{
  "FacilityID": 1000083514,
  "FacilityName": "The Andersons Marathon Holding LLC",
  "FacilityStr1": "5728 Sebring Warner Rd",
  "FacilityStr2": null,
  "FacilityCity": "Greenville",
  "FacilityState": "OH",
  "FacilityZipCode": "45331",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39037",
  "LEPC": "Darke County LEPC",
  "FacilityLatDecDegs": "40.081111",
  "FacilityLongDecDegs": "-084.591667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 793658688,
  "ParentCompanyName": "The Andersons Marathon Ethanol, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Andersons Marathon Ethanol, LLC",
  "OperatorStr1": "1947 Briarfield Blvd.",
  "OperatorStr2": "PO Box 119 (Attn: Corp.Safety Dept)",
  "OperatorCity": "Maumee",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43537",
  "OperatorZipCodeExt": null,
  "FTE": 63,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203969",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-10-17 00:00:00",
  "SafetyInspectionBy": "Insurance inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-11-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-11-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-11-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-11-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000104363,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000083514,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000130706,
          "ProcessID": 1000104363,
          "ChemicalID": 56,
          "Quantity": 80984.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000130707,
          "ProcessID": 1000104363,
          "ChemicalID": 155,
          "Quantity": 882096.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000114977,
              "ProcessChemicalID": 1000130707,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000114978,
              "ProcessChemicalID": 1000130707,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000114979,
              "ProcessChemicalID": 1000130707,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000114980,
              "ProcessChemicalID": 1000130707,
              "ChemicalID": 137
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000105696,
          "ProcessID": 1000104363,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000088349,
              "Process_NAICS_ID": 1000105696,
              "SafetyReviewDate": "2019-01-01 00:00:00",
              "PHA_Date": "2015-10-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-12-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Water Cannon",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-08-08 00:00:00",
              "TrainingReviewDate": "2018-01-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-12-29 00:00:00",
              "EquipmentInspectionDate": "2019-01-03 00:00:00",
              "EquipmentTested": "Fire System",
              "ChangeMgmtDate": "2018-12-06 00:00:00",
              "ChangeMgmtReviewDate": "2016-02-01 00:00:00",
              "PreStartupReviewDate": "2018-12-11 00:00:00",
              "ComplianceAuditDate": "2018-07-31 00:00:00",
              "AuditCompletionDate": "2020-01-01 00:00:00",
              "IncidentInvestigationDate": "2018-09-04 00:00:00",
              "InvestigationChangeDate": "2018-10-09 00:00:00",
              "ParticipationPlansReviewDate": "2015-12-16 00:00:00",
              "HotWorkPermitReviewDate": "2018-12-14 00:00:00",
              "ContractorSafetyReviewDate": "2019-01-31 00:00:00",
              "ContractorSafetyEvalDate": "2019-01-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ethanol Manufacturing",
              "_chemicals": [
                {
                  "PrimaryKey": 1000110087,
                  "PreventionProgram3ID": 1000088349,
                  "ProcessChemicalID": 1000130706
                },
                {
                  "PrimaryKey": 1000110088,
                  "PreventionProgram3ID": 1000088349,
                  "ProcessChemicalID": 1000130707
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000083514,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Greenville Fire Dept.",
    "CoordinatingAgencyPhone": "9375481103",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083514,
      "SummaryText": "\n\nThe Andersons Marathon Holding LLC\n\nGreenville Operations\n\nRisk Management Plan - Executive Summary\n\n\n\nSite and Process Description\n\n\n\nThe Andersons Marathon Holding LLC is located at 5728 Sebring Warner Road, located North of Sebring Warner Rd in the City of Greenville in Darke County, Ohio.  The Andersons Marathon Holding LLC facility operates 24 hours a day and 7 days a week with a staff of approximately 63 people.\n\n\n\nThe following operations are performed at this facility:  Grain Receiving and Storage, Grain Milling, Fermentation, Distilling, Dehydration and Evaporation, Decanter Separation, Wet and Dry Distillers Grain with Solubles (WDGS / DDGS) Drying, Wet and Dry Distillers Grain with Solubles Storage and Shipping, and Ethanol Storage and Shipping.  \n\n\n\nCorn is stored temporarily in concrete silos and steel bins prior to being fed to four Hammer Mills where the corn is dry-milled into a powder and then conveyed to the production area.\n\n\n\nCorn is blended with water & enzymes and pumped into Fermenters for batch fermentation.  Fermentation final product results in a Beer Mash which is approximately 12% ethanol and 88% non-fermentable solids and water.  The Beer Mash product goes through a scrubbing process to removed residual volatile organics from fermentation, and then enters the distilling process.\n\n\n\nCO2 gas is a byproduct of fermentation and sent to a scrubbing process that reduces the amount of ethanol and HAPs released to the atmosphere.  A blend of water with an additive flows countercurrent to the gases and removes the ethanol and HAPs from the CO2 gas.  CO2 gases from the Scrubber system vents to atmosphere or a dry ice production facility adjacent to The Andersons Marathon Holding LLC.\n\n\n\nThe distilling process separates components of the Beer Mash that results in 190-proof ethanol, non-fermentable solids and water.  The 190-proof ethanol is pumped to bulk storage prior to pumping into a dehydration process to remove the residual water, with the f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083514,
      "SummaryText": "inal product resulting in 200-proof ethanol.  200-proof ethanol is pumped to bulk storage prior to blending with a denaturant and stored in one of three Denatured Ethanol Storage Tanks.  Denaturant Ethanol Storage Tanks pump directly to loadout racks for both trucks and railcars. \n\n\n\nNon-fermentable corn solids and water or \"Whole Stillage\" is sent through a high velocity separation process, resulting in Wet Distillers Grain with Solubles (WDGS), Thin Stillage (water with solubles) and eventually Corn Oil.  WDGS has a moisture content of approximately 65% and can be sold directly as animal feed.  Alternatively, WDGS can be process further and dried into Dry Distillers Grain with Solubles (DDGS).  DDGS has a moisture content of approximately 12% and stored on-site in a storage barn prior to loading into trucks and railcars.  The resulting recycled water or \"Thin Stillage\" is reused within the process as make-up water with solubles.  Corn Oil is a liquid co-product extracted from the Thin Stillage as a fatty-acid feedstock or biodiesel feedstock.\n\n\n\nThe distillation process removes the ethanol from the beer, non-fermentable corn solids and water.  The remaining water is then removed from the residual mash or whole stillage.  The resulting product is called wet distillers grain (WDG).  A small amount of WDG will be maintained as \"wet cake\" - having a moisture content of 65 - 70% -- and sold directly to customers as high-quality animal feed.  Storage of wet cake is very limited, on the north side of the Energy Center.  The majority of WDG will be dried to approximately 12% moisture.  The resulting product is called dried distillers grain (DDG), which can be stored for extended periods of time in the large barn at the east end of the property.  After leaving the dryers, the DDG is cooled before going to storage.\n\n\n\nTwo Thermal Oxidizers serve as the emission control units for four Dryers as well as various process vents.  The Thermal Oxidizers are very efficient at contr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083514,
      "SummaryText": "olling particulates, carbon monoxide, VOC's, HAP's and nuisance odors.\n\n\n\nThe facility also has a water cooling tower for non-contact cooling water used in the Fermentation process and Distillation, and a fire pump for emergency events.\n\n\n\nRMP Applicability & Chemical Description\n\n\n\nThe RMP requirements apply to covered chemicals (anhydrous ammonia, flammable chemicals within the denaturant with a flash point less than 100?F in processes above 10,000 pounds.  The Andersons Marathon Holding LLC is subject to RMP requirements due to exceeding threshold quantities (TQ) above regulated TQ values for toxic substance Anhydrous Ammonia and flammable mixture Denaturant (Natural Gasoline).\n\n\n\nAnhydrous Ammonia is used to control pH in process and stored outside in a 18,000-gallon storage tank on the west side of the Fermenters.  Maximum capacity of the storage tank is 15,300 gallons (85%) Anhydrous Ammonia.  This toxic substance is a gas at ambient temperature and pressure.  The Anhydrous Ammonia is a liquid when stored under pressure inside the tank.\n\n\n\nNatural Gasoline (Denaturant) is blended with 200-proof ethanol as an additive to \"poison\" the final product, Denatured Ethanol, and stored outside in an 188,000-gallon storage tank on the north end of the property in the Tank Farm.  Maximum capacity of the storage tank is 176,508 gallons.\n\n\n\nSummary of Release Scenarios\n\n\n\nWorst Case Release - Anhydrous Ammonia\n\n\n\nAs mentioned above, the storage tank has a capacity of 18,000 gallons, but when filled to 85%, it can only hold 15,300 gallons or 76,959 pounds of ammonia (@77-degree F).  The worst-case release scenario would occur with a complete failure or burst of the ammonia storage tank.  So, 76,959 pounds of product that is capable of being released during the worst-case scenario.\n\n\n\nWorst Case Release - Flammable Mixture \n\n\n\nThe worst-case release scenario would be a total loss of a full tank of natural gasoline resulting in a vapor cloud explosion.  The storage tank's usa"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000083514,
      "SummaryText": " this facility's hazard management program.  All hoses, tanks, valves and storage units are inspected at least monthly.  A good PM program is our strongest defense against a release of anhydrous ammonia.  All hose replacements are documented.  Records of all maintenance tasks performed on the tank or appendages are also on file.\n\n\n\nThis facility uses a certified third-party contractor for all welding and construction performed on the anhydrous ammonia tank or transfer pipes.  Copies of all reports are on file. The ammonia system undergoes a thorough inspection by a third party at least every five years.\n\n\n\nSee \"Steps Taken to Address Hazards\" for more information on prevention measures and identification.\n\n\n\nManagement System\n\n(see \"Steps Taken to Address Hazards\")\n\n\n\nEquipment maintenance\n\nAll equipment maintenance is formally documented. See the \"Prevention Program\" section for further explanation.\n\n\n\nTraining\n\n\n\nAll employees receive annual training on anhydrous ammonia, emergency action plan and spill procedures, and hazard communication.  Documentation and attendance rosters are on file at the facility.  \n\n\n\nContractors\n\n\n\nContractors that are hired by The Andersons, Inc may go through a documented Prequalification process.  Records of this evaluation are kept on file.\n\n\n\nAll contractors also receive a \"contractor safety review\" prior to performing work at the facility.  During this review, they are informed of any potential hazards at the facility, emergency procedures, site-specific safety rules and the ability to request an MSDS for any product at any time.\n\n\n\nSteps Taken to Address Hazards\n\n\n\nThe Andersons Marathon Holding LLC has many systems in place for hazard assessment and mitigation.  \n\n\n\nThe Andersons Safety Department performs annual hazard management audits at the facility.  The audits include a physical walk through of the entire facility and a review of all EPA, OSHA and DOT paperwork and training documentation.  Action items are noted, and recom"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083514,
      "SummaryText": "ble capacity is 176,508 gallons or 974,324 pounds of natural gasoline.  Of the 974,324 pounds of natural gasoline, 472,752 pounds are RMP reportable chemicals.\n\n\n\nAlternative Release - Anhydrous Ammonia\n\n\n\nThe most likely causes of ammonia emergencies are ruptured hoses and defective valves, as represented by the alternative release scenario.  The most probable time for an exposure to occur will be during a transfer from a delivery truck to the storage tank.  Flexible hoses must be connected properly.  Hoses are date-stamped and replaced by the transporter or The Andersons in advance of the expiration date or when defects are observed.  All transfers of ammonia are directly observed by the delivery truck driver.  Transfers of anhydrous ammonia from the storage tank to the processing building occur inside fixed steel pipes and are automated from the control room.  No hoses are utilized in the operation.\n\n\n\nUnder normal circumstances for the alternative scenario, the amount released would not be based on the total volume of both vessels.  Instead, it would be limited by the volume of the delivery truck.  The plumbing at the storage vessel receiving bulkhead has backflow preventers which would prevent the tank from emptying its contents if a transfer hose ruptured.  Therefore, the product that would be released would have to come from the delivery truck.  \n\n\n\nAnhydrous ammonia is supplied by a tanker truck, which holds 20 tons (40,000 pounds) of product.  Product is transferred via rubber hoses to the storage tank at a rate of 1,000 pounds / minute.  The truck has an excess flow valve and the receiving system at the tank also has one.  Typically, a release would immediately trigger the excess flow valves to slam shut.  However, if the release was too slow to trigger the excess flow valve, it would continue to leak until the transfer system could be shut down.  Over the course of a ten-minute period, approximately 10,000 pounds (10 minutes x 1,000 pounds) of ammonia wou"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000083514,
      "SummaryText": "ld be released.\n\n\n\nAlternative Release - Flammable Mixture\n\n\n\nThe most likely cause of a natural gasoline emergency is a release during a delivery due to a faulty hose or valve resulting in a vapor cloud explosion.  Deliveries are made by truck and pumped into the storage tank.  Deliveries are typically 9,000 gallons or 48,686 pounds of which 23,623 pounds are butane, 2,2-dimethyl propane, 2-methylbutane and pentane.  \n\n\n\nAll deliveries are made during business hours and are observed by the truck driver and facility personnel.  If a release were to occur the delivery attendants could stop the flow within minutes.  The loadout area where deliveries occur has a catchment basin with underground piping to secondary containment of the tank farm.     \n\n\n\nRMP Comp was used to determine the distance to 1 psi overpressure and 2010 US Census Bureau Data was used to determine public receptor information.\n\n\n\nExplanation of How Ammonia Releases are Prevented\n\n\n\nA complete failure or burst of the ammonia storage tank, as represented by the worst-case scenario, is highly unlikely.  The bulk storage tank was built in 2006 under strict guidelines established by the ASME pressure vessel code.  The National Board Certificate for the tank is on file.  The storage tank is protected by concrete traffic barriers.  All welding and structural work done on the tanks or appendages are performed by certified welders and stamped accordingly.\n\n\n\nPassive mitigation refers to equipment, devices or technologies that function without human, mechanical or energy input.  The passive mitigation systems in place include:\n\n\n\nBulkhead breakaway units located on the connection point between the delivery truck and the storage tank plumbing.  If a truck driver were to drive off without disconnecting from the tank, the concrete structure would cause the hose to shear off from the plumbing.  At this point, active mitigation would take effect and an excess flow valve, just inside the breakaway barrier, would pr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000083514,
      "SummaryText": "event the tank from emptying into the atmosphere.\n\n\n\nActive mitigation refers to equipment, devices or technologies that require human, mechanical or other energy input to function.  The active mitigation systems in place include:\n\n\n\nExcess flow valves are located on all outgoing liquid and vapor valves on both storage tanks.  They close automatically if the volume of gas or liquid flowing through the line exceeds the normal flow rate.  They won't reopen until the downstream shutoff valve is closed and the pressure equalizes on both sides of the valve seat.  Two principal causes of the excess valve closing are a ruptured hose or a broken pipe or shutoff valve downstream that is opened too quickly.\n\n\n\nBack check valves are located on the unloading lines of delivery trucks and are designed to ensure that the flow goes in one direction only.  This prevents anhydrous ammonia from flowing back to the transport tank from the storage tank.\n\n\n\nPressure-relief valves are located on the top of the bulk storage tanks, fixed steel piping and on the vaporizer to relieve pressure that is too great.  This can be caused by elevated temperatures in the summer or overfilling.  They open directly to the atmosphere at 250 psig and close when the pressure inside the tank drops below this pressure.\n\n\n\nAn emergency shutoff cord, located along the side of the anhydrous ammonia bulk storage tank, activates the emergency shutoff valves (\"snappy joes\") on the discharge side of the ammonia pump.  This stops the flow of ammonia by remote activation of a spring-loaded valve.\n\n\n\nAn ample supply of water is available near the bulk storage tank from a nearby water tank and a water hydrant to help knock down a vapor cloud.\n\n\n\nSpill control kits are located at the facility and include sorbent material, shovels, PPE and disposal containers.\n\nDelivery truck drivers supervise all anhydrous transfers to and from the bulk storage tank\n\n\n\nPrevention Program\n\n\n\nPreventive maintenance is an integral piece of"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000083514,
      "SummaryText": "mendations are made. The audits consist of five major topical areas:  Safety & Health, Environmental, Fire Protection & Security, Administrative and Housekeeping & Storage.  Issues are documented in a report and sent to the facility manager and upper management.  Updates on action item status must be made regularly.\n\n\n\nA Process Hazard Analysis (PHA) has been performed at this facility, as part of the Process Safety Management Program.  The analysis will be updated every five years, or as changes in the process are made.  PHA's are performed using the Haz Op protocol and analyze all aspects involved in the production of ethanol.  The evaluation team includes representatives from the corporate Safety Department, facility Management and Operations employees.\n\n\n\nFormal investigations are performed for all environmental or safety incidents.  Documentation is kept on file at the facility and the corporate Safety Department.\n\n\n\nA formal Management of Change (MOC) system is in place at this facility.  An electronic form is submitted whenever a change is made to any of the processes within the scope of the PSM program.  Forms are routed to the Engineering and Safety Departments for review and remarks.  \n\n\n\nMonthly Safety Committee meetings allow employees to discuss any concerns they may have with the operation of the facility.  Issues are documented and assigned to employees for follow-up. Records of all meetings are kept at the facility.\n\n\n\nResponse Action in the Event of a Release\n\n\n\nIn the event of a small, controlled leak or defective valve, employees are instructed to shut down the transfer process and, if possible, don the appropriate PPE, approach the shutoff valve from upwind and attempt to turn it off. \n\n\n\nFor an uncontainable release, employees will immediately call the police and fire department or other first responders, as appropriate.  All employees, customers and contractors are to be evacuated to an upwind location. Once the response team has arrived, we wi"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000083514,
      "SummaryText": "ll work in concert with them to close the valves between the tank and the leak.  In the meantime, a steady spray of water will deluge the ammonia gas plume and knock it to the ground, while chemically binding any free ammonia.\n\n\n\nThe employees are instructed to make emergency phone calls in this order:  911, the Facility Manager, the corporate Safety Department emergency phone number, the state emergency hotline and the National Spill Response Center phone number.  All applicable contact names and numbers are found in the facility spill and emergency action plan. \n\n\n\nCommunication procedures with responders \n\n\n\nThe local fire department is invited to tour the facility on an annual basis.  Facility management, employees and fire department personnel have jointly discussed the location of the anhydrous ammonia and response procedures on a regular basis.  They know the location of all emergency shutoff valves and on-site response equipment.  We believe that a strong relationship with first responders is our best defense.\n\n\n\nThe LEPC and state regulatory agencies receive a copy of our hazardous materials storage information, every February, in accordance with our community right to know obligations.  A copy of the Emergency Action Plan is on file with the LEPC and the local fire department.\n\n\n\nThe facility has not had an accident associated with their RMP regulated chemicals in the last five years.\n\n\n\nSecurity Plans\n\n\n\nThe Department of Transportation (DOT), Research and Special Programs Administration (RSPA) 49 CFR Part 172, requires all facilities that offer or transport hazardous materials to document a security plan and perform employee awareness training.  \n\n\n\nA security assessment plan has been created to describe all security measures at this facility, identify any vulnerable areas and then document the measures taken to address those risks.  The plan is intended to work in conjunction with the Emergency Action and Spill Control Plan to meet all required criteria"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000083514,
      "SummaryText": ".\n\n\n\nTraining is performed with all employees annually and within 90 days of employment.\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}