{
  "FacilityID": 1000078517,
  "FacilityName": "GSP Merrimack LLC - Merrimack Station",
  "FacilityStr1": "431 River Road",
  "FacilityStr2": null,
  "FacilityCity": "Bow",
  "FacilityState": "NH",
  "FacilityZipCode": "03304",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33013",
  "LEPC": "Bow LEPC",
  "FacilityLatDecDegs": "43.140808",
  "FacilityLongDecDegs": "-71.468082",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 81010799,
  "ParentCompanyName": "Granite Shore Power LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "GSP Merrimack LLC",
  "OperatorStr1": "431 River Road",
  "OperatorStr2": null,
  "OperatorCity": "Bow",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03304",
  "OperatorZipCodeExt": "3314",
  "RMPContact": null,
  "RMPTitle": "Station Manager",
  "FTE": 65,
  "OtherEPAFacilityID": "03304PBLCS97RIV",
  "EPAFacilityID": "100000079309",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TV-0055",
  "SafetyInspectionDate": "2013-05-17 00:00:00",
  "SafetyInspectionBy": "OSHA-PSM",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.13808,
  "FRS_Long": -71.47288,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097906,
      "AltID": "MK2 SCR DeNOx",
      "FacilityID": 1000078517,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099148,
          "ProcessID": 1000097906,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122823,
          "ProcessID": 1000097906,
          "ChemicalID": 56,
          "Quantity": 490000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000622823,
          "ProcessID": 1000097906,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000097907,
      "AltID": "MK1 SCR DeNOx",
      "FacilityID": 1000078517,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099149,
          "ProcessID": 1000097907,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122824,
          "ProcessID": 1000097907,
          "ChemicalID": 56,
          "Quantity": 280000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000622824,
          "ProcessID": 1000097907,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000097908,
      "AltID": "Rail car storage",
      "FacilityID": 1000078517,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099150,
          "ProcessID": 1000097908,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122825,
          "ProcessID": 1000097908,
          "ChemicalID": 56,
          "Quantity": 1400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000622825,
          "ProcessID": 1000097908,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078517,
      "SummaryText": "Risk Management Plan for PSNH Merrimack Station \n\n\n\nEPA ID # 1000 0007 9309\n\n\n\nGranite Shore Power, LLC (GSP) is committed to maintaining a comprehensive Risk Management Program to ensure the safety of its workers and the surrounding communities.  \n\n\n\nTo satisfy our commitment, GSP will continue to:\n\n\n\n?    Ensure compliance with all applicable environmental laws, regulations, and other requirements;\n\n?    Coordinate with local emergency response agencies; and \n\n?    Ensure that our commitment to environmental excellence is communicated through all levels of the organization. \n\n\n\nGSP expects all employees to understand and comply with the commitments outlined above and will promote these commitments with our suppliers, vendors and contractors.\n\n\n\nMerrimack Station Management is responsible for implementation and oversight of the Risk Management Program.  Environmental and Safety personnel are also involved in Risk Management Program related activities including but not limited to plan updates, emergency response coordination, drills, and training. \n\n\n\nA. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n \n\nGSP is committed to providing a safe working environment for all employees.  Achievement of this objective requires that all employees at all levels in the organization create and maintain safe working conditions.  This means strict adherence to established safety rules and practices, and the elimination of all unsafe acts from the workplace.  Each employee, as a condition of employment, is accountable for adhering to safety rules and safe work practices.  Station Management (including the Safety and Training Manager) is responsible for implementation of this policy.\n\n\n\nMerrimack Station has incorporated the program elements from the OSHA Process Safety Management Regulation 29CFR 1910.119 into the routine operation of the facility as the foundation of an accidental release prevention program.  The station maintains an Emergency Response Plan as part of an Int"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078517,
      "SummaryText": "egrated Contingency Plan (ICP) that will be activated in the event of an emergency involving a regulated substance.  Merrimack Station is included in the local emergency response plan and the ICP is provided to the following external entities: Bow Fire Department, Central New Hampshire Hazmat Team, Concord Hospital, Bow Police Department, Bow Emergency Management Department, and the New Hampshire Department of Environmental Services. \n\n\n\nB. THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n \n\nMerrimack Station is a fossil fueled electric power generating facility owned and operated by GSP Merrimack LLC, a wholly owned subsidiary of Granite Shore Power, LLC. \n\n\n\nThe purpose of this facility is to generate electric power for sale via transmission and distribution lines.  There are four separate units with a net claimed capacity of 438 megawatts.  Units 1 & 2 use coal fired cyclone boilers to produce steam that powers turbine driven generators capable of 108 and 330 megawatts respectively.  Oxides of nitrogen (NOx) form during the combustion process.\n\n\n\nSelective Catalytic Reduction deNOx Technology (SCR) was installed in 1995 on Unit 2 and in 1999 on Unit 1 to remove emissions of nitrogen oxide (NOx) as part of the plan to comply with the 1990 Clean Air Act Amendments.  The application of SCR reduces NOx air emissions from the station in excess of 80%.  Ammonia, a regulated substance, is the reagent used in the process.  Ammonia vapor is added to the flue gas ahead of the catalyst bed where it combines with the NOx to form nitrogen gas and water vapor.\n\n\n\nC. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS. \n\n\n\nThe ammonia storage and handling facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  The ammonia systems were designed and constructed with ANSI K61.1 Safety Requirements for the Storage and Handling of Anhydrous Ammonia guidance.  The storage tanks are bu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078517,
      "SummaryText": "ilt to the ASME Pressure Vessel Code for Unfired Vessels.\n\n\n\nGSP's accident prevention program is based on the OSHA Process Safety Management Plan which is a 13 point program for preventing or minimizing the consequences of catastrophic releases.  The Plan includes: routine maintenance and inspections, operating procedures, employee training in the hazards and handling of ammonia, and provides for periodic program audits.\n\n \n\nAll employees who operate ammonia equipment are trained in the hazards of ammonia.  Shift operators conduct rounds that include observations of the ammonia systems.  Trouble reports are submitted when action is required and qualified mechanics are on site to make repairs.  Pressure vessels are inspected according to the ASME.  A management of change process is followed for qualifying modifications to the covered processes.\n\n\n\nD. FIVE-YEAR ACCIDENT HISTORY\n\n \n\nMerrimack Station went into commercial operation in 1960.  The first use of anhydrous ammonia on site was in 1991.  There have been no reportable releases of ammonia or related impacts from the use of ammonia to the health and safety of employees or the surrounding community.\n\n\n\nE. THE EMERGENCY RESPONSE PROGRAM\n\n \n\nA written Emergency Response Plan is included as part of the Integrated Contingency Plan (ICP) and provides guidance to employees in the event of any emergency at the station.  The primary contact during any emergency is the on-duty working foreman operations (WFO) who is available on site 24/7 at 603-230-7903.  There are 4 WFO's who work on rotating shifts.  The ICP includes procedures for notifying the local response agencies.  The plan is submitted to and periodically reviewed with the Bow Fire Department (BFD) and representatives of the Regional Emergency Planning Committee (REPC).  Two Merrimack Station Employees were elected as members of the REPC on May 7, 2019, representing industry and the environment.  The BFD and the Central NH Hazmat Team (CNHHMT) are consulted in p"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078517,
      "SummaryText": "lanning and conducting emergency response drills.  The most recent ammonia-related drill was conducted with the BFD and CNHHMT at Merrimack Station on November 15, 2018. \n\n \n\nAccess to the site is restricted to employees and authorized contractors.  Early warning systems include ammonia gas detectors that are strategically placed around the equipment.  \n\n\n\nF. PLANNED CHANGES TO IMPROVE SAFETY \n\n\n\nGSP is committed to providing a safe work environment.  The following items will be initiated as part of the ongoing program to ensure safety:\n\n\n\n- Continue to provide annual refresher training to Hazardous Waste Operator/ Emergency Response personnel \n\n- Review and update current contractor training program\n\n- Perform non-destructive examination (NDE) on the ammonia storage tanks following a regular schedule\n\n- Implement the recommendations from the May 2019 Process Hazard Analysis Revalidation and the upcoming Process Safety Management Audit in November 2019. \n\n"
    }
  ]
}