{
  "FacilityID": 1000084228,
  "FacilityName": "Sika Corporation- Fernley Plant",
  "FacilityStr1": "210 Lyon Drive",
  "FacilityStr2": null,
  "FacilityCity": "Fernley",
  "FacilityState": "NV",
  "FacilityZipCode": "89408",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32019",
  "LEPC": "Lyon County LEPC",
  "FacilityLatDecDegs": "39.605556",
  "FacilityLongDecDegs": "-119.205556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.rmax.com",
  "FacilityEmailAddress": "woolsey.matt@us.sika.com",
  "FacilityDUNS": 71491021,
  "ParentCompanyName": "Sika Corporation",
  "Company2Name": null,
  "CompanyDUNS": 2179893,
  "Company2DUNS": 0,
  "OperatorName": "Sika Corporation",
  "OperatorStr1": "201 Polito Ave",
  "OperatorStr2": null,
  "OperatorCity": "Lyndhurst",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07071",
  "OperatorZipCodeExt": null,
  "RMPContact": "Sandy Cassinelli",
  "RMPTitle": "Plant Manager",
  "FTE": 21,
  "OtherEPAFacilityID": "89408RMXNC210L",
  "EPAFacilityID": "100000175213",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "AP3086-0434.03",
  "SafetyInspectionDate": "2019-06-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-12-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-12-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-12-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-12-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.60792,
  "FRS_Long": -119.20602,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105209,
      "AltID": "Hydrocarbon Injection Sys",
      "FacilityID": 1000084228,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106540,
          "ProcessID": 1000105209,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131737,
          "ProcessID": 1000105209,
          "ChemicalID": 125,
          "Quantity": 57328.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000631737,
          "ProcessID": 1000105209,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084228,
      "SummaryText": "Sika Corporation\n\n210 Lyon Drive\n\nFernley, Nevada 89408\n\n\n\nRisk Management Plan\n\nExecutive Summary\n\n\n\nSource and Process Description\n\n\n\nSika Corporation, located at 210 Lyon Drive, in Fernley, Nevada, is a facility that manufactures foam insulation products for use in both residential and commercial applications. The raw materials used in the production of foam are all liquids and are transported to the facility by truck and rail car. The raw materials are stored on-site in bulk tanks ranging in  up to 12,000 gallons, or in drums or totes. The liquid raw materials, through the use of a series of tanks and high pressure pumps, are mixed together and injected between a facer material. Once all of the liquids are combined together in the desired proportions, they react to form a foam. Following the injection, the foam passes through a laminator heater that further solidifies and hardens the foam. Following the laminator, the foam is cut to the desired width and length, stacked, and packaged for shipment. The foam insulation products, once packaged, are typically stored on-site for a short time, prior to their shipment to Sika Corporation's customers.\n\n\n\nRegulated Substances\n\n\n\nIn its manufacturing process, Sika Corporation has the ability to use a flammable hydrocarbon, which contains Pentane (CAS # 109-66-0), as a blowing agent. Pentane is a substance that is regulated by the EPA's Chemical Accident Prevention Provisions. Sika Corporation maintains a supply of this hydrocarbon blowing agent in a 12,000 gallon bulk storage tank, located on-site, for use in its manufacturing process.\n\n\n\nPrevention of Accidents / Accidental Releases\n\n\n\nPrevention of accidents / accidental releases at the facility is accomplished through not only compliance with EPA's Accidental Release Prevention provisions and other Federal and State regulations (including OSHA's Process Safety Management of Highly Hazardous Chemicals requirements), but through application of Sika Corporation's corporat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084228,
      "SummaryText": "e philosophies and commitment to provide a safe work environment. Sika Corporation believes its employees are an extremely valuable resource. Employee training and employee involvement are important components of its accident / accidental release prevention programs. \n\n\n\nSafe work practices are documented through the development and implementation of written operating procedures for production and maintenance personnel. Employee training is comprehensive, focusing on proper procedures for job specific routine and non-routine tasks, as well as providing an overview and awareness of the components of Sika Corporation's Risk Management Plan. Training is provided by a competent, experienced person.\n\n\n\nPreventive maintenance programs focus on inspection and/or testing of all process components including tanks, piping, pumps, valves, controls, instruments, and safety systems. In addition to helping ensure safe and reliable operation by maintaining the mechanical integrity of the process equipment, the results of this program are used to identify opportunities for system improvement. \n\n\n\nNumerous safety systems and controls have been incorporated into Sika Corporation's manufacturing process. These include redundant pressure regulators and pressure relief devices, excess and insufficient flow detection and shutoff devices, a gas detection and monitoring system, several ventilation systems, a fire suppression system, and control of potential electrical ignition sources. A variety of sensors and interlocks provide process control and rapid, automatic response to releases or threats of releases, These responses include increased process/building ventilation, raw material feed shutoff, process shutdown, and activation of facility evacuation alarms.\n\n\n\nSika Corporation has implemented a Management of Change program that requires a very detailed safety assessment and management approval for any significant change to equipment, safety systems, and/or operating procedures associat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084228,
      "SummaryText": "ed with its manufacturing process. Sika Corporation's Contractor Safety Program is designed to ensure any contractors performing work at the facility are experienced, properly trained, and capable of performing the required work as well as informed of the relevant facility hazards, operating and safety procedures.\n\n\n\nSika Corporation conducts a Process Hazard Analysis at regular intervals and as needed. This detailed, critical analysis of equipment, procedures, process parameters and potential deviations is used to identify opportunities for incremental safety improvements.                                                                                                                                                                                                                                                                                                                                                               These prevention programs have enabled Sika Corporation to have minimal accidents or releases (defined by 40 CFR 68.42a) during the life of this process.    \n\n                                                                                                                                                                    \n\nEmergency Action Procedures\n\n\n\nSika Corporation has implemented an Emergency Action Plan that has been prepared in accordance with the requirements of 29 CFR 1910.38. This plan establishes detailed facility evacuation, response, and reporting procedures for potential facility emergencies including, fires/explosions, spills, accidental releases, power failures, natural disasters, bomb threats, civil disturbances, and medical emergencies. The Plan designates a facility Emergency Coordinator who is responsible for implementing the plan during an emergency. The plan also provides for emergency action procedure training for all facility personnel. Emergency action procedures that may be implemented in the event of an accidental release of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084228,
      "SummaryText": "Pentane include the use of portable fire extinguishers, facility evacuation, and/or response by the appropriate local agencies. The facility is protected from fire by an automatic sprinkler system. The procedures in this plan have been coordinated with the appropriate local emergency response agencies."
    }
  ]
}