{
  "FacilityID": 1000011224,
  "FacilityName": "Ronson Consumer Products Corporation",
  "FacilityStr1": "3 Ronson Road",
  "FacilityStr2": null,
  "FacilityCity": "Woodbridge Township",
  "FacilityState": "NJ",
  "FacilityZipCode": "07095",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34023",
  "LEPC": "Woodbridge Twp OEM",
  "FacilityLatDecDegs": "40.556639",
  "FacilityLongDecDegs": "-074.318111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ronsoncorp.com",
  "FacilityEmailAddress": "info@ronsoncorp.com",
  "FacilityDUNS": 42899211,
  "ParentCompanyName": "Ronson Corporation",
  "Company2Name": null,
  "CompanyDUNS": 2148500,
  "Company2DUNS": 0,
  "OperatorName": "John Levine",
  "OperatorStr1": "3 Ronson Road",
  "OperatorStr2": null,
  "OperatorCity": "Woodbridge Township",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07095",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Levine",
  "RMPTitle": "Plant Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175482",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-10-06 00:00:00",
  "SafetyInspectionBy": "NJ Dept. of Community Affairs",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-11-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-11-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-11-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-07-13 00:00:00",
  "DeRegistrationEffectiveDate": "2010-03-01 00:00:00",
  "AnniversaryDate": "2014-11-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.55342,
  "FRS_Long": -74.28808,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "0.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013391,
      "AltID": "Storage Tanks",
      "FacilityID": 1000011224,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013752,
          "ProcessID": 1000013391,
          "NAICSCode": "339999",
          "_desc": {
            "NAICS_CODE": "339999",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015376,
          "ProcessID": 1000013391,
          "ChemicalID": 107,
          "Quantity": 99289.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515376,
          "ProcessID": 1000013391,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011224,
      "SummaryText": "ES.1    Introduction\n\nA Risk Management Plan (RMP) has been implemented at Ronson Consumer Products Corporation for the reduction of accidental releases of hazardous materials.  The RMP summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to the community of hazardous chemical releases.  This RMP is organized to correspond with specific U.S. Environmental Protection Agency (U.S. EPA) RMP definitions and requirements, including:\nA?    Introduction;\nA?    Policies to protect health, environment, and safety;\nA?    Facility identification and regulated substances covered process;\nA?    Hazard assessment;\nA?    Prevention program;\nA?    Five-year accident history;\nA?    Emergency response program; and\nA?    Planned changes to improve safety.\n\nES.2    Ronson Consumer Products Corporation to Protect Health, Environment, and Safety\n\nRisk management and safety are important concerns at Ronson Consumer Products Corporation; this Risk Management Plan formalizes and documents these activities.  Ronson Consumer Products Corporation is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment.\nThis commitment to health, the environment, and safety starts with upper management.  All managers and supervisors are members of the Safety and Health Committee and routinely dedicate time each month to review health and safety matters.  The employees at Ronson Consumer Products Corporation attend health and safety meetings led by their supervisor or manager.  Each manager and supervisor reports his/ her discussions with employees each month at the Safety and Health committee meetings.  The Committee reviews safety performance, takes corrective action when appropriate, and strives for continuous improvement.  Ronson Consumer Products CorporationA?s commitment to safety is demonstrated in the training programs for all employees, including seasonal employees.  The training progra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011224,
      "SummaryText": "ms provide information on preventing accidents through knowledge of hazards and safe work practices.\n\nES.3    Facility Identification\n\nRonson Corporation has been operating at the 3 Ronson Road facility for approximately 50 years.  Two buildings are located on-site.  One is a one-story brick building which houses offices, the processing areas, shipping/receiving and raw material and finished product storage functions.  The second building is a one-story metal warehouse used for storage of dry goods and empty cardboard containers.\n\nThe Ronson (processing area) facility is comprised of the following:\nA?    Multi-Lube product line\nA?    Kleenol product line\nA?    Ronsonol product line\nA?    Quality Control\nA?    Quality Assurance\n\nRonson Corporation operations include the filling and blending of specific materials into final products.  These final products are then dispensed into containers through fill lines, with the containerized materials being sold as consumer commodities. \n\nMulti-Lube\nMulti-Lube filling operations are conducted in the Fill Room.  Multi-Lube is a mixture of a Mineral spirits (5,000 gallon tank), fragrance (5 gallon pail), Oils and Alox (55 gallon drum).   Mineral spirits are fed through a feed tube into a 2,000 gallon mix tank and mixed with Oils/Alox, which are pneumatically fed.  Containment and control systems have been installed to minimize overflow and recover multi-lube and re-circulate back to the mix tank for re-use.\n\nKleenol\nKleenol filling operations are conducted in the Fill Room.  Kleenol is a mixture of a Mineral spirits (5,000 gallon tank), fragrance (5 gallon pail), Isopropyl Alcohol (55 gallon drum), Glycol Ether (55 gallon drum), Surfactants (55 gallon drum) and water.   Mineral spirits are manually fed into mix tank (55 gallon plastic drum) and mixed with the other ingredients, which are manually fed.\n\nRonsonol\nRonsonol filling operations are conducted in the Fill Room.  Ronsonol is comprised of Naphtha (15,000 gallon tank).   Naphtha is fed throu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011224,
      "SummaryText": "gh process piping tubes into filling cabinet.  Multiple sized containers are filled in a carrousel design. Containment and control systems have been installed to minimize overflow and to re-circulate (manual) product back to the mix tank for re-use.\n\nMulti-Fill\nMulti-fill filling operations are conducted in the Fill Room.  Multi-fill is the direct feed of butane from the outdoor storage tanks (2 x 10,000 gallons).  Butane is fed through process piping to a gas-filling cabinet.  The entire system, including the gas-filling cabinet, is pressurized to approximately 110 PSI and butane is directly injected into aluminum tubes.  Manually adjustable regulators are in place to prevent over-pressurization.\n\nOther activities include:\nA?    Flint packaging; \nA?    Refillable butane lighter packaging; \nA?    Raw material and finished product storage; \nA?    Machine shop (equipment and parts repair)\n\nThe facility uses Isobutane and Liquefied Petroleum, which are regulated under 40 Code of Federal Regulations (CFR) Part 68, the U.S. EPA RMP Rule.  \n\nThe majority of the flammable materials are either stored in aboveground storage tanks (AST) located on the southwest corner of the property or in the concrete vault aboveground storage tank (AST), located partially below gradient on the west side of the building.  These flammable materials include:\nA?    Isobutane (A-31) Two (2) 10,000 gallon ASTs; \nA?    Liquefied petroleum gas (A-70) One (1) 1,850 gallon AST; \nA?    Petroleum Naphtha 15,000 gallon and Mineral Spirits 5,000 gallon -- One (1) 20,000 gallon AST A? partitioned concrete vault.\n"
    }
  ]
}