{
  "FacilityID": 1000084153,
  "FacilityName": "Cypress Creek Water Treatment Plant",
  "FacilityStr1": "704 Paxton Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Florence",
  "FacilityState": "AL",
  "FacilityZipCode": "35630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01077",
  "LEPC": "Lauderdale County LEPC",
  "FacilityLatDecDegs": "34.826667",
  "FacilityLongDecDegs": "-087.700556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.florenceutilities.com/Gas_Water",
  "FacilityEmailAddress": "mdoyle@florenceal.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City Of Florence Water Department",
  "OperatorStr1": "P.O. Box 1023",
  "OperatorStr2": null,
  "OperatorCity": "Florence",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35631",
  "OperatorZipCodeExt": "1023",
  "RMPContact": "Ryan Wallace",
  "RMPTitle": "Superintendent of Water Treatment",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000006414",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-07-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-12-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-12-12 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-12-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-12-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.79833,
  "FRS_Long": -87.70039,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105117,
      "AltID": null,
      "FacilityID": 1000084153,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106450,
          "ProcessID": 1000105117,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131626,
          "ProcessID": 1000105117,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000631626,
          "ProcessID": 1000105117,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084153,
      "SummaryText": "1    Accidental Release Prevention and Emergency Response Policies\n\n\n\n     The City of Florence Water Department, as operators of the Cypress Creek Water Treatment Plant, is strongly committed to employee, public, and environmental safety. This commitment is demonstrated by our accidental release prevention program that addresses design, installation, operating procedures, maintenance, and training. It is our policy to implement appropriate controls and industry standards to prevent the release of regulated substances. It is also our policy to conduct scheduled trainings for all of our employees that handle any regulated substance. Our prevention program also includes coordination with the City of Florence Fire Department and the Florence Lauderdale Emergency Management Agency (EMA) which provides emergency personnel and equipment to control and mitigate the effects of a release.\n\n\n\n2   The Facility and The Regulated Substance Handled\n\n\n\n     The Cypress Creek Water Treatment Plant primary activity is to provide potable water to the City of Florence and Lauderdale County while meeting or exceeding all Federal and State regulations. The one regulated substance at this facility is chlorine.  This chlorine is used for disinfecting treated water for potable use by the City of Florence and Lauderdale County. The maximum inventory at this facility is 12,000 pounds.\n\n\n\n3    The General Accidental Release Prevention Program and Chemical - Specific Prevention Steps\n\n\n\n      This facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA. The following sections briefly describe the elements of the release prevention program that is in place at our facility.\n\n\n\nProcess Safety Information\n\n      The Cypress Creek Water Treatment Plant maintains safety information that describes the chemical hazards, operating parameters and procedures, and equipment designs associated with the chlorinating pro"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084153,
      "SummaryText": "cess.\n\n\n\nProcess Hazard Reviews\n\n      This facility conducts comprehensive process hazard reviews of the chlorination system at regular intervals to ensure that potential hazards are identified and controlled expeditiously. The hazard reviews are conducted by the plant superintendent, lead maintenance staff, and operator personnel.\n\n\n\nTraining\n\n      This facility maintains a training program to ensure that all personnel are trained in the operating procedures, hazards, and safe handling of chlorine. This program requires each employee that handles chlorine to take refresher training every three years. All of our operating personnel are grade IV certified operators in the State of Alabama.\n\n\n\nMaintenance\n\n      This facility's maintenance personnel perform routine maintenance checks on all process equipment to ensure proper operations. The equipment checked includes storage tanks, piping and valve systems, relief and vent systems, and emergency shut down systems and controls. If any deficiencies are found, they are corrected in a safe and timely manner. Specialized training of all maintenance personnel is required, as needed.\n\n\n\nEmployee Participation\n\n      This facility encourages input from all employees on accidental release prevention and improvements.\n\n\n\n4    The Five Year Accident History\n\n\n\n      This facility has an excellent record of preventing any accidental release over the last 5 years. Due to our stringent release prevention policy, there has not been an accidental release from this facility during this period.\n\n\n\n5    The Emergency Program\n\n\n\n      This facility is coordinated with the City of Florence Fire Department and the Florence Lauderdale EMA to respond with emergency personnel and equipment as needed. This facility has a public notification in place to notify the public in the event of an accidental release.  In accordance with RMP regulations, this facility is included in the community emergency response plan and has operating procedures in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084153,
      "SummaryText": " place to notify emergency responders in the event of an accidental release.  \n\n\n\n6    Planned Changes to Improve Safety\n\n\n\n     Planned safety improvements include involving City of Florence Fire Department and Florence Lauderdale EMA in all chlorine safety training. In addition, ensuring labels and status signage will be updated as needed on the chlorination equipment and piping. We at the City of Florence Water Department are committed to safety and are always seeking ways to improve safety.\n\n"
    }
  ]
}