{
  "FacilityID": 1000114476,
  "FacilityName": "The Hillshire Brands Company - Newbern, TN",
  "FacilityStr1": "2000 Biffle Road",
  "FacilityStr2": null,
  "FacilityCity": "Newbern",
  "FacilityState": "TN",
  "FacilityZipCode": "38059",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47045",
  "LEPC": "Dyer County LEPC",
  "FacilityLatDecDegs": "36.139167",
  "FacilityLongDecDegs": "-089.272222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.hillshirebrands.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5213962,
  "ParentCompanyName": "Tyson Foods,Inc",
  "Company2Name": null,
  "CompanyDUNS": 5213962,
  "Company2DUNS": 5213962,
  "OperatorName": "The Hillshire Brands Company",
  "OperatorStr1": "2000 Biffle Road",
  "OperatorStr2": null,
  "OperatorCity": "Newbern",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38059",
  "OperatorZipCodeExt": null,
  "FTE": 800,
  "OtherEPAFacilityID": "TND982154569",
  "EPAFacilityID": "100000139469",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-07-20 00:00:00",
  "SafetyInspectionBy": "Paragon Insurance",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.139167,
  "FRS_Long": -89.272222,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000142623,
      "AltID": "Refrigeration System",
      "FacilityID": 1000114476,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000178385,
          "ProcessID": 1000142623,
          "ChemicalID": 56,
          "Quantity": 103000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000144136,
          "ProcessID": 1000142623,
          "NAICSCode": "31161",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000122011,
              "Process_NAICS_ID": 1000144136,
              "SafetyReviewDate": "2024-02-08 00:00:00",
              "PHA_Date": "2024-02-05 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-02-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "The plant is staffed 24/7",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-05-03 00:00:00",
              "TrainingReviewDate": "2024-02-06 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "IIAR VIDEO TRAINING TAPES Do's & Don'ts PSMF601 and OJT/OJE PSMF607 & PSMF608",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "OJT/OJE form PSMF 607/608",
              "MaintenanceReviewDate": "2024-05-03 00:00:00",
              "EquipmentInspectionDate": "2024-02-15 00:00:00",
              "EquipmentTested": "NH3 Compressor Inspection",
              "ChangeMgmtDate": "2023-09-06 00:00:00",
              "ChangeMgmtReviewDate": "2024-02-06 00:00:00",
              "PreStartupReviewDate": "2024-01-31 00:00:00",
              "ComplianceAuditDate": "2024-02-06 00:00:00",
              "AuditCompletionDate": "2025-02-14 00:00:00",
              "IncidentInvestigationDate": "2016-02-06 00:00:00",
              "InvestigationChangeDate": "2016-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2024-02-06 00:00:00",
              "HotWorkPermitReviewDate": "2023-10-10 00:00:00",
              "ContractorSafetyReviewDate": "2023-11-01 00:00:00",
              "ContractorSafetyEvalDate": "2023-10-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000153050,
                  "PreventionProgram3ID": 1000122011,
                  "ProcessChemicalID": 1000178385
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000114476,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-05-13 00:00:00",
    "ERTrainingDate": "2023-05-31 00:00:00",
    "CoordinatingAgencyName": "Dyer County EMA",
    "CoordinatingAgencyPhone": "7312867831",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000114476,
      "SummaryText": "Hillshire Brands Company - NEWBERN, TN\r\nEXECUTIVE SUMMARY\r\n\r\nBackground Data\r\nn\r\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), The Hillshire Brands Compay - Newbern, TN, submits this Risk Management Plan (RMP) for operations at their Newbern, Tennessee facility. The Hillshire Brands Company - Newbern, TN produces pork sausage for public consumption packaged under the Jimmy Dean Sausage brand.  The Hillshire Brands Company - Newbern, TN has been in operation at this facility for over thirty years providing quality meat products and over 700 jobs to the local community.\r\n\r\nAccidental Release Prevention and Emergency Response Policy\r\nHillshire Bands - Newbern, TN is committed to protecting the health of its employees, the surrounding community, and the environment; therefore it is The Hillshire Brands Company - Newbern, TN's policy to maintain compliance with 40 CFR 68 as well as Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations, Chapter 1910, Section 119 (29 CFR 1910.119), and OSHAs Hazardous Waste Operations and Emergency Response regulations (29 CFR 1910.120). \r\n\r\nStationary Sources and Regulated Substances\r\nThe Hillshire Brands Company - Newbern, TN is subject to 112A regulations, because ammonia, a regulated substance, is present at the facility in amounts greater than 10,000 pounds.  The Hillshire Brands Company - Newbern, TN uses anhydrous ammonia as a refrigerant to maintain the 275,000 ft2 facility within the range of operating temperatures required by the United States Department of Agriculture (USDA) for food processing and preserving.  Anhydrous ammonia is an industry-standard refrigerant for meat processing plants.  The Hillshire Brands Company - Newbern, TN's refrigeration system consists of receivers, compressors, evaporators, condensers, and piping whic"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000114476,
      "SummaryText": "h contains an amount in excess of 10,000 pounds of anhydrous ammonia. \r\n\r\nWorst Case / Alternative Release Scenario\r\n\r\nIn accordance with 40 CFR Part 68, Subpart B, The Hillshire Brands Company - Newbern, TN evaluated off-site consequences for releases of anhydrous ammonia.  Both a worst case scenario and an alternative case scenario were developed.\r\n\r\nAccidental Release Prevention Program\r\n\r\nThe ammonia refrigeration system is designed and constructed in accordance with ANSI/IIAR 2-1992 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigeration Systems.  To prevent and mitigate accidental releases of anhydrous ammonia, The Hillshire Brands Company - Newbern, TN has implemented several precautionary measures.\r\n\r\nThe Hillshire Brands Company - Newbern, TN has developed and implemented a PSM program pursuant to OSHA regulations and through this program has evaluated the system for potential anhydrous ammonia releases.  Some of the controls installed to prevent catastrophic releases of ammonia are process equipment (vents, pressure relief valves, backup pumps, and manual shutoffs), and automated controls (automatic shut-off), ammonia leak detection system, and electrical distribution system grounding. In addition, The Hillshire Brands Company - Newbern, TN has an Emergency Response/Hazardous Materials team consisting of personnel trained to respond to potential ammonia releases.\r\n\r\nHillshire Brands Company - Newbern, TN has developed standard operating procedures for all employees and contractors that have contact with the ammonia refrigeration system that incorporate safety measures into the procedures.  These safety procedures were developed by refrigeration system operators and are reviewed at a frequency sufficient to ensure that they reflect current operating practice, including changes that result from changes in the process chemicals, technology, and equipment, and changes to the facility. The Hillshire Brands Company - Newbern, TN enco"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000114476,
      "SummaryText": "urages employee participation in development of the control measures used at the plant by means of company memoranda and training sessions.  Pursuant to written management of change procedures established by The Hillshire Brands Company - Newbern, TN, any changes to the operating procedures are to be communicated to affected employees.\r\n\r\nThe Hillshire Brands Company - Newbern, TN maintains the refrigeration system in good working order and has implemented a preventative maintenance program to prevent accidental releases.  The preventative maintenance program is scheduled, documented and managed using log sheets to ensure that regular maintenance occurs on the refrigeration system.  These log sheets are maintained in the Refrigeration office for three years.  Equipment tests are also performed to ensure the mechanical integrity of critical refrigeration system components.  Specifically, pressure vessels, headers, and piping are tested to detect corrosion.  \r\n\r\nTo ensure that The Hillshire Brands Company - Newbern, TN's control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\r\n\r\n- In accordance with the PSM program, The Hillshire Brands Company - Newbern, TN conducts detailed PSM compliance audits every three years.  Each audit incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\r\n\r\n- In addition, the local fire department participates in an emergency response drills at the facility.\r\n\r\n- The USDA maintains a daily presence for monitoring the The Hillshire Brands Company - Newbern, TN facility.\r\n\r\n- The Hillshire Brands Company - Newbern, TN's insurance carrier also co"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000114476,
      "SummaryText": "nducts independent annual audits. \r\n\r\nFive-Year Accident History\r\n\r\nOver the last five years, The Hillshire Brands Company - Newbern, TN has not experienced a reportable accidental off-site release of anhydrous ammonia from the ammonia refrigeration system.\r\n\r\nEmergency Response Program\r\n\r\nThe Hillshire Brands Company - Newbern, TN has documented emergency response procedures in the facility's Emergency Response/Action Plan in order to facilitate response efforts in the event of an off-site anhydrous ammonia release.  Included in the Plan are measures to be taken internally by The Hillshire Brands - Newbern, TN  and measures to be taken by off-site response agencies.\r\n\r\nHillshire Brands Company - Newbern, TN has trained on-site personnel to respond to accidental ammonia releases.  These personnel are trained according to their duties and functions in accordance with 29 CFR 1910.120, OSHA's Hazardous Waste Operations and Emergency Response regulations.  These personnel receive initial training and annual update training thereafter.\r\n\r\nTo assure that the local governmental response agencies are familiar with The Hillshire Brands Company - Newbern, TN's emergency response procedures, the facility  provides copies of the Emergency Response/Action Plan and future major revisions to the following local agencies for their review and approval:\r\n\r\n- Newbern Fire Department\r\n- Dyersburg Fire Department\r\n- Dyer County Emergency Planning Committee\r\n\r\nTo plan for an ammonia release with off-site consequences, The Hillshire Brands Company - Newbern, TN's Emergency Response/Action Plan includes procedures to inform local response agencies for public communication.\r\n\r\nIn the event of an anhydrous ammonia release with off-site consequences, the general public will be warned using police and fire vehicles equipped with public address systems.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nAmmonia refrigeration is a mature industry employing known technology.  Yet, the plant remains abreast"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000114476,
      "SummaryText": "of current innovations that improve safety.  To this end, The Hillshire Brands Company - Newbern, TN is an active member of International Institute of Ammonia Refrigeration (IIAR) and the Refrigerating Engineers & Technicians Association (RETA).  This involvement enables the facility to learn and implement the most modern safety system improvements as they emerge within the ammonia refrigeration industry.  Computer management systems enhance reliable operation of the RMP covered process. Some of the most recent planned improvements include installation of new equipment and piping relocations to improve both employee safety and the safety of the RMP covered process."
    }
  ]
}