{
  "FacilityID": 1000097403,
  "FacilityName": "TRANSFLO East Chicago Terminal",
  "FacilityStr1": "1401 West 145th Street",
  "FacilityStr2": null,
  "FacilityCity": "East Chicago",
  "FacilityState": "IN",
  "FacilityZipCode": "46312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18089",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.631620",
  "FacilityLongDecDegs": "-087.488620",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "AB",
  "FacilityURL": "www.transflo.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "TRANSFLO Terminal Services, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "TRANSFLO Terminal Services, Inc.",
  "OperatorStr1": "500 Water Street",
  "OperatorStr2": "J-975",
  "OperatorCity": "Jacksonville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32202",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197538",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-01-08 00:00:00",
  "SafetyInspectionBy": "US Fed Railroad Administration-Haz Mat Inspector",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-01-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-01-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-01-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-01-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000120611,
      "AltID": "Pentane Transfer",
      "FacilityID": 1000097403,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000150883,
          "ProcessID": 1000120611,
          "ChemicalID": 115,
          "Quantity": 160000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000150884,
          "ProcessID": 1000120611,
          "ChemicalID": 125,
          "Quantity": 166400.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000121985,
          "ProcessID": 1000120611,
          "NAICSCode": "48821",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000075812,
              "Process_NAICS_ID": 1000121985,
              "SafetyReviewDate": "2021-04-01 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "NEC-70 for electrical classification, ASME B31.3",
              "FR_Comments": null,
              "HazardReviewDate": "2017-04-03 00:00:00",
              "ChangeCompletionDate": "2017-04-28 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Nitrogen used to purge unit post transfer.",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Loaders are in attendance during loading to monitor process for leaks.",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Loaders in attendance during process operation.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-04-01 00:00:00",
              "TrainingReviewDate": "2021-04-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-04-03 00:00:00",
              "EquipmentInspectionDate": "2021-04-01 00:00:00",
              "EquipmentTested": "Unit is visualy inspected daily prior to use..",
              "ComplianceAuditDate": "2021-04-01 00:00:00",
              "AuditCompletionDate": "2021-05-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The transload process at TRANSFLO has a NAICS Code of 48211 and is considered a ?Program 2? level prevention program as described in Subpart D of 40 CFR 68 (68.48 through 68.60).  This terminal utilizes a series of terminal specific work instructions and procedures for the daily operations including the transload of pentane.  Specific documents referenced in the RMP are found in an electronic operating procedures manual accessible to the terminal management and employees.  Written copies of work instructions are available at the terminal but are not considered controlled documents.  The seven requirements for the prevention program are described below and will be implemented on a daily basis at the Sanford terminal.\n\n\n\n3.1    Safety Information (40 CFR 68.48)\n\n\n\nRMP safety information requirements include compiling written information concerning equipment and processes.  Compiled information must address:\n\n\n\n?    Safety Data Sheets (SDS)\n\n?    Maximum inventory (single tank car)\n\n?    Storage and Process limits\n\n?    Equipment Specifications\n\n?    Codes and Standards\n\n\n\nTRANSFLO maintains a current MSDS for pentane in the terminal mangers office and in the terminal Hazard Communication station as required for 29 CFR 1910.1200.\n\n\n\nThe SDS for pentane, equipment specification and product storage information are available on the TRANSFLO internal electronic records system.\n\n\n\n3.2    Hazard Review (40 CFR 68.50)\n\n\n\nAn initial hazard review was conducted on the transfer process and equipment by TRANSFLO personnel, the equipment supplier and outside safety professional consultants during the normal TRANSFLO new business development process.\n\n\n\nA pre-start up hazard review using a ?what if checklist? process was conducted on November 20-21, 2006.   This hazard review (Process Hazard Analysis) was revalidated on 3/13/12.  \n\n\n\nTo prevent / control the catastrophic release of pentane, the following controls are integrated into the transfer process:\n\n\n\na.    Railcar-\n\no    Double shelf couplers (to prevent tank punctures during car handling)\n\no    Bottom outlet protection\n\no    Safety relief valve\n\n\n\n\n\nb.    Terminal Physical Plant\n\no    Bonded and grounded track\n\no    Paved transfer area with spill control \n\no    Track spill pans \n\n\n\n\n\nc.    Transfer Unit\n\no    Bonding cables\n\no    High level probe\n\no    Liquid volume meter \n\no    Remote electrical shut of capability\n\no    Closed loop vapor recovery system\n\n\n\n\n\n3.3    Operating Procedures  (40 CFR 68.52)\n\n\n\nTRANSFLO operating procedures address the steps for each operating phase, operating limits and safety system and their functions.\n\n\n\nSpecific requirements are as follows:\n\n\n\n?    Initial start up\n\n?    Normal operations\n\n?    Temporary Operations\n\n?    Emergency Operations\n\n?    Normal Shutdown\n\n?    Start up following a turnaround or emergency shutdown\n\n?    Consequences of deviations\n\n?    Equipment inspections\n\n\n\nTransfer process work instructions were developed for this unit and are used as the basis for training employees who will be operating the system.  These procedures will be maintained at the terminal office and will be used for employee evaluation and audit purposes.  These work instructions are available to terminal employees in the terminal office and maintained on the TRANSFLO intranet system.\n\n\n\nIn addition to the transfer work instruction, the terminal operator follows established TRANSFLO procedures for the inspection of inbound railcars, inbound cargo trailers and general health, safety and environmental procedures.  \n\n\n\n\n\n\n\n\n\n\n\n3.4    Training    (40 CFR 68.54)\n\n\n\nAs required under 40 CFR 68.54, training requirements for new operators at TRANSFLO include training on operating procedures and must cover health and safety hazards, emergency operations, and safe work practices applicable to the employee normal job or function.  Refresher training is provided at least every three years.  The facility also determines that each operator has received and understands the training requirements and keeps a record of complete training for each employee with the date of the training and the method used to verify that the employee understand the subject matter.\n\n\n\nThe training program includes classroom and on job instruction with emphasis on safety and health hazards and emergency response procedures.  These materials are maintained in the terminal managers office.  Verification that the operators understand the materials is accomplished through written tests, verbal questioning and hands-on demonstrations. \n\n\n\n3.5    Maintenance  (40 CFR 68.56)\n\n\n\nAs required by the regulations, TRANSFLO implements a maintenance program that includes the preventative maintenance, inspection and testing of the pentane transfer unit.  The specific required provisions are as follows:\n\n\n\n?    Written procedures- Administrative guidance\n\n?    Training\n\n?    Inspection and Testing\n\n\n\nTRANSFLO follows a maintenance program to assure system equipment integrity is maintained.\n\n\n\nTerminal personnel are responsible for level-1 maintenance on the transfer equipment that includes:\n\n\n\n?    Daily inspection of the transfer unit\n\n?    Cleaning of the unit\n\n?    Hose inspections (visual)\n\n?    Unit tire pressure\n\n?    Unit lubrication\n\n?    Unit electrical cord and plug inspection\n\n\n\nAll maintenance on the unit?s meter, pump or electrical systems are performed by he equipments supplier, RBT Inc., TRANSFLO Regional Equipment Mangers or qualified outside contractors using internal maintenance procedures specific by individual component suppliers.\n\n\n\nMaintenance and testing of the railroad tank cars and ISO containers are the responsibility of the car or container owners or leasors.\n\n\n\n3.6    Compliance Audits (40 CFR 68.58)\n\n\n\nTRANSFLO is required to conduct compliance audits at least every 3 years from the date of RMP submission.  The audit must include an evaluation of the design and effectiveness of risk management program elements and a field inspection of the safety and health conditions and practices to verify that systems are effectively implemented and operational.  The compliance audits will be conducted by at least one person knowledgeable in the pentane transfer process.  TRANSFLO will comply with the following document requirements:\n\n\n\n?    The employer must certify the compliance audits\n\n?    A written report of the findings of the audit shall be developed.\n\n?    The employer shall promptly determine and document an appropriate response to each of the findings of the audit.\n\n?    The employers shall document that any deficiencies have been corrected.\n\n?    The employer shall retain the most recent compliance audits reports/.\n\n?    The compliance audits shall be made available to employees and their designated representatives.\n\n\n\nAs required, TRANSFLO will undergo an audit every 3 years.  The first audit is scheduled for November 2009.   In addition to the scheduled RMP specific audit, TRANSFLO has an active terminal operation audit system that includes a review the following:\n\n\n\n?    Terminal HS&E regulatory compliance\n\n?    Terminal employee training\n\n?    Transfer operations including compliance with Work Instructions, procedures and polices\n\n?    Terminal physical plant maintenance and documentation\n\n?    Transfer equipment inspection, maintenance and documentation.\n\n\n\nTRANSFLO Operations and HS&E personnel conduct these audits.  The Director of Operations reviews the results of these audits and items of nonconformance are the responsibility of the Manger of Field Operations and the contract operator for correction.\n\n\n\n3.7    Incident Investigation  (40 CFR 68.60)\n\n\n\nIncident investigation is the process of identifying the underlying causes of incidents and implementing steps to prevent similar events from occurring.  The RMP requires the investigation of each incident that resulted in, or could reasonable have resulted in a catastrophic release of regulated substance, employee injury or off site impact.\n\n\n\nThe specific requirements of the incident investigation are as follows:\n\n\n\n?    Initiate an investigation promptly, no later than 48 hours after the incident.\n\n?    Establish an investigation team with at least one team member knowledgeable in the transfer process.\n\n?    Summarize the investigation in a report, including:\n\no    Date of incident\n\no    Date investigation begin\n\no    Description of the incident\n\no    Factors contributing to the incident\n\no    Root cause of the incident\n\no    Any recommendations to prevent future incidents\n\n\n\nAddress and resolve the team?s finding and recommendations\n\n?    Document resolutions and corrective actions\n\n?    Review the report with affected personnel and contactors where applicable\n\n?    Retain the report for five years.\n\n\n\nTRANSFLO has established incident investigation procedures for the pentane transfer process as follows:\n\n\n\n1.    The facility maintains an updated comprehensive Emergency Action pan (EAP) for injuries, spills, fires and other credible terminal threats.  All employees are trained on the activation of the EAP and their roles.  An annual response exercise is held and includes an invitation to the local fire department to attend using the EAP.\n\n2.    All product releases are reported following the incident reporting procedures list in the EAP.\n\n3.    Upon completion of the emergency phase of the incident, a formalized incident investigation process is initiated using the documents listed in attachment 3-7.\n\n\n\nTRANSFLO holds an incident review conference call or on-site investigation meeting within 5 days of any spill or incident with employee injury, evacuation or off site consequence.  Senior operations personnel lead this call from TRANSFLO, the contract operator and other groups or agencies with significant incident involvement.\n\n\n\nThe pentane transfer process was be installed in the East Chicago, IN terminal on December 1, 2006.  This is a new product for this terminal but uses equipment, procedures and processes used in this terminal and the TRANSFLO network for over 10 years.  There have been no incidents or releases of pentane involving this equipment or process.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000076540,
                  "PreventionProgram2ID": 1000075812,
                  "ProcessChemicalID": 1000150883
                },
                {
                  "PrimaryKey": 1000076541,
                  "PreventionProgram2ID": 1000075812,
                  "ProcessChemicalID": 1000150884
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000097403,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-05-01 00:00:00",
    "ERTrainingDate": "2020-05-01 00:00:00",
    "CoordinatingAgencyName": "East Chicago Fire Department",
    "CoordinatingAgencyPhone": "2193918472",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000097403,
      "SummaryText": "Executive Summary (40 CFR 68.155)\n\n\n\nBackground Data\n\n\n\nIn accordance with Title 40 of the Code of Federal Regulations, chapter 68 (40 CFR 68) promulgated by the Federal Environmental Administration (EPA), TRANSFLO Terminal Services, Inc. has prepared this Risk Management Plan (RMP) for operations involving pentane and LPG products at their East Chicago, IN facility.  The TTSI terminal provides transloading services of bulk products between rail and truck transportation modes.  The East Chicago TRANSFLO terminal has been in operation since 1988.  The terminal is located at 1401 West 145th Street, East Chicago, IN.\n\n\n\nAccidental Release Prevention and Emergency Response Policy\n\n\n\nTRANSFLO is committed to protecting the health and safety of its employees, contract operators, the surrounding community and the environment; therefore it is TRANSFLO policy to maintain compliance with 40 CFR 68.\n\n\n\nStationary Sources and Regulated Substances\n\n\n\nTRANSFLO will handle pentane and LPG products at this terminal, transloading product from railroad tank cars into highway cargo trailers in quantities in excess of 8,000 gallons per cargo trailer which will exceed the 10,000 pound threshold quantity listed in 40 CFR 68, Appendix A.\n\n\n\nWorst Case Scenario\n\n\n\nAs required by 40 CFR 68 Subpart B, TRANSFLO has evaluated a worst-case release scenario for these products using the parameters specified by the EPA.  TRANSFLO's worst-case release scenario is the rupture of a single railroad tank car with subsequent product release over a 10-minute period.  In developing the release parameters of the worst-case scenario, TRANSFLO has not considered any passive mitigation measures.  Using the EPA's RMP*Comp software program, it was determined that the distance to the flammable endpoint in this scenario has the potential to result in a release with offsite consequences.  The worst-case release scenario was developed following EPA regulations and is considered to have an extremely low probability "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000097403,
      "SummaryText": "of occurrence.\n\n\n\nAlternative Release Scenario\n\n\n\nTRANSFLO also evaluated several other release scenarios considered to have a higher level probability of occurrence (although stall a very low probability) based upon a review of over 10 years of incident data from chemical transloading operations.  This 10 year period included the safe handling of over 500,000 rail to truck chemical transloads.  After a careful review of both the worst-case and alternative release scenarios, TRANSFLO has decided to include one alternative release scenario into the RMP document.  \n\n\n\nThe alternative release scenario identified by TRANSFLO is the failure of a product transfer hose.  In developing the parameters of Alternative Release Scenario 1, TRANSFLO considered the average response time of terminal personnel to control the release and safely shut the transfer unit down.   Using the EPA RMP*Comp software program and EPA's RMP offsite Consequence Analysis Guidance Document, the distance to the flammable endpoint in the alternative release scenario has the potential to result in minor site consequences at a distance much less than the worst-case scenario and would largely be limited to terminal property itself.\n\n\n\nAccidental Release Prevention Program\n\n\n\nTo prevent and mitigate accidental releases of pentane, TRANSFLO has implemented several precautionary measures:\n\n\n\n- TRANSFLO has developed standard operating procedures (SOP'S) for the transloading of pentane and LPG products from railcar to highway cargo tanks or ISO containers for use by trained and qualified personnel.\n\n- TRANSFLO encourages contract operator employees to voice concerns, offer suggestions and contribute to procedures, policies and processes involving this product.  Employees are expected to follow established procedures until employee driven process changes are implemented, training conducted and communicated to all affected persons.\n\n- TRANSFLO conducts operational audits and inspections to insure compliance wi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000097403,
      "SummaryText": "th established operating procedures, maintenance of transfer equipment and facility physical systems.\n\n- A documented inspection and maintenance program for the transfer unit, railcars and cargo tanks used for this operation is in place and will be maintained for the life of this operation.  These processes include preventative maintenance of the transfer unit to maintain on-board safety and control systems.\n\n\n\nThe transfer unit has been designed and constructed to meet or exceed the requirements outlined in the National Fire Protection Association (NFPA) Flammable and Combustible Liquids Code 2003 ed.) or LPG Code (NFPA 58).  A review of the National Fire Code finds this operation is in compliance with all requirements of the code.\n\n\n\nTRANSFLO will conduct initial familiarization sessions with the local emergency responders as part of the terminals emergency action plan (EAP).   In addition, the following agencies inspect the TRANSFLO terminal on a regular basis:\n\n\n\nU.S. Department of Transportation- Federal Railroad Administration- Hazardous Materials Inspectors.  \n\n\n\nIndiana Department of Environmental Protection\n\n\n\n\n\n\n\n\n\nFive- Year Accident History.  There are no accidents or releases to report.\n\n\n\nEmergency Response Program\n\n\n\nTRANSFLO and the contract operator have documented emergency response plans and procedures in place at this facility to respond to and safety mitigates any release or accident involving pentane.  Included in the emergency response plan are measures to be taken internally by TRANSFLO contract operators to control the release, if possible, and to make initial notification to local responders and to TRANSFLO headquarters.\n\n\n\nOperator personnel at the terminal are trained to the Hazardous Materials Operations level as outlined in 29 CFR 1910.120 Hazardous Waste Operations and Emergency Response.  These employees may also perform activities under the specialist employee definition as defined by 1910.120.  These personnel receive annual trainin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000097403,
      "SummaryText": "g on activation of the facility emergency action plan, their roles in an emergency and accident notification procedures.\n\n\n\nTo assure that the local municipal response agencies are familiar with TRANSFLO emergency response procedures and copies of the Emergency Action plan (EAP) have been shared with and reviewed by local responders.  In the event of a significant release of pentane that involve off site populations, these populations will be notified through the LEPC.\n\n\n\nPlanned Changes To Improve Safety\n\n\n\nTRANSFLO and its contract operators have implemented a continuous training program for employees and preventative maintenance procedures for the transfer unit to ensure a high level of safety performance and regulatory compliance.\n\n\n\n\n\nTRANSFLO Administrative Purpose\n\nUpdated 5/25/12 for new temrinal manager. \n\nUpdated 1/25/13 to show Larry Adamoski as TM. Updated telephone and email address.\n\nUpdated 7/05/13 with new email for terminal manager.\n\nResubmittal 10/28/13- updated dates and terminal data.\n\nResubmitted 5/26/15 with LPG process added.\n\nUpdated 6/29/18 to show Jeramy Nelson at TM.  Added new TM contact number. Updated audit, training, unit inspection and PHA dates. GAR\n\nResubmittal 5/21/2020 updated compliance activity dates and terminal data- GAR\n\nResubmittal- removed LPG from RMP, updated Drew Kenealy as TM. "
    }
  ]
}