{
  "FacilityID": 1000103279,
  "FacilityName": "Univar Solutions Anchorage",
  "FacilityStr1": "590 East 100th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Anchorage",
  "FacilityState": "AK",
  "FacilityZipCode": "99515",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "02020",
  "LEPC": "Anchorage Municpality LEPC",
  "FacilityLatDecDegs": "61.13000",
  "FacilityLongDecDegs": "-149.872778",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A6",
  "LatLongDescription": "AB",
  "FacilityURL": "www.univarsolutions.com",
  "FacilityEmailAddress": "ryan.barker@univarsolutions.com",
  "FacilityDUNS": 181523838,
  "ParentCompanyName": "Univar Solutions USA LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Univar Solutions USA, Inc",
  "OperatorStr1": "590 East 100th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Anchorage",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99515",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": "99515vnwtr590E1",
  "EPAFacilityID": "100000218702",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-11-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-11-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-11-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 61.129407,
  "FRS_Long": -149.871824,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "1.0",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000128391,
      "AltID": "Transloading/Blending",
      "FacilityID": 1000103279,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000160971,
          "ProcessID": 1000128391,
          "ChemicalID": 57,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000129783,
          "ProcessID": 1000128391,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000079617,
              "Process_NAICS_ID": 1000129783,
              "SafetyReviewDate": "2022-11-17 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2018-10-06 00:00:00",
              "ChangeCompletionDate": "2018-10-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-11-17 00:00:00",
              "TrainingReviewDate": "2022-11-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-11-17 00:00:00",
              "EquipmentInspectionDate": "2022-11-17 00:00:00",
              "EquipmentTested": "Pump",
              "ComplianceAuditDate": "2022-10-10 00:00:00",
              "AuditCompletionDate": "2022-11-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000080326,
                  "PreventionProgram2ID": 1000079617,
                  "ProcessChemicalID": 1000160971
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000103279,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-09-12 00:00:00",
    "ERTrainingDate": "2022-11-17 00:00:00",
    "CoordinatingAgencyName": "Anchorage Fire Department",
    "CoordinatingAgencyPhone": "9072674936",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000103279,
      "SummaryText": "COMPANY OVERVIEW\nUNIVAR Solutions USA Inc. is a wholesale chemical distributor serving a number of U.S. industries. Founded in 1924,\nUNIVAR supplies the food industry, chemical compounders, pharmaceuticals, mining, forest products, oil and gas producers, electronics, coatings and many other key industries with the chemical raw materials required to produce or refine products used in numerous end-use markets. UNIVAR Solutions USA Inc.is a member of the National Association of Chemical distributors (NACD) and complies with the Responsible Distribution Process (RDP), an environmental, health and safety improvement initiative.\nSome of the products stored and handled by UNIVAR are subject to EPA's Risk Management Program rule (40CFR Part 68). A key requirement of this rule is the preparation and submission of an RMP Plan, contained herein. The contents of the RMP Plan are prescribed by EPA, including this Executive Summary.\n\nCORPORATE PREVENTION AND EMERGENCY RESPONSE APPROACH\n1. Prevention Program\nProcesses that are subject to OSHA's Process Safety management (PSM) standard AND are regulated under EPA's RMP rule are subject to the Program 3 Prevention program. UNIVAR Solutions USA Inc. has documented the Prevention Program in its Process Safety Management Manual. Briefly, this program includes provisions and requirements for:\n* Process Safety Information\n* Process Hazard Analysis\n* Operating Procedures\n* Training\n* Mechanical Integrity\n* Management of Change\n* Pre-Startup Review\n* Compliance Audits\n* Incident Investigation\n* Employee Participation\n* Hot Work permits\n* Contractors\nNote this facility is not subject to PSM and is a Program 2 Location. \n\n2. Emergency Response Approach\nUNIVAR Solutions USA Inc. has an Emergency Contingency Plan in place. This Plan is shared with local emergency responders who have access to UNIVAR facility personnel (and up-to-date phone numbers). UNIVAR responds to minor incidents but will call in professional emergency responders in the ev"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000103279,
      "SummaryText": "ent of all other incidents.\nUNIVAR invites and encourages local emergency responders such as the fire department to visit and familiarize themselves with UNIVAR products and facilities. Joint emergency exercises are conducted when possible.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\nOur facility's primary activities encompass Chemical Storage & Distribution. The sole RMP regulated substances present at our facility is Aqueous Ammonia 29%.  Aqua ammonia is delivered in railcars of and transloaded from railcar to chemical hose to piping to chemical hose to tanker truck. \n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. This facility was designed and constructed in accordance with NFPA- 58 Standard, 1967 Edition. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nUNIVAR Solutions USA Inc maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is the \"What-If\" technique. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years. Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, UNIVAR USA Inc maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdow"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000103279,
      "SummaryText": "n, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nUNIVAR Solutions USA Inc has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every year and more frequently as needed.\n\nMechanical Integrity\nUNIVAR Solutions USA Inc carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audits\nUNIVAR Solutions USA Inc conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nUNIVAR Solutions USA Inc promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nUNIVAR Solutions USA Inc truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to expre"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000103279,
      "SummaryText": "ss their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. UNIVAR Solutions USA Inc has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\nFIVE-YEAR ACCIDENT HISTORY\nUNIVAR Solutions USA Inc has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, no accidental release of Aqueous Ammonia 30% has occurred during this period.\n\nEMERGENCY RESPONSE PLAN\nUNIVAR Solutions USA Inc is strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated\nsubstances. Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release. We are also completely coordinated with the local Fire Department which provides additional emergency response expertise. UNIVAR Solutions USA Inc carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including ad"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000103279,
      "SummaryText": "equate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nThrough Process Hazard Analysis performed at this facility, existing safeguards have been determined to be adequate and no changes are warranted at the present time."
    }
  ]
}