{
  "FacilityID": 1000009024,
  "FacilityName": "Mexichem Specialty Resins, Inc. - Henry Plant",
  "FacilityStr1": "1546 County Road 1450N",
  "FacilityStr2": null,
  "FacilityCity": "Henry",
  "FacilityState": "IL",
  "FacilityZipCode": "61537",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17123",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "41.135278",
  "FacilityLongDecDegs": "-089.340833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.mexichem.com/English/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mexichem, S.A.B. de C.V.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mexichem, S.A.B. de C.V.",
  "OperatorStr1": "1546 County Road 1450N",
  "OperatorStr2": null,
  "OperatorCity": "Henry",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61537",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Johnson",
  "RMPTitle": "H,S&E Supervisor",
  "FTE": 93,
  "OtherEPAFacilityID": "61537THGNCRURAL",
  "EPAFacilityID": "100000080315",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "96020128",
  "SafetyInspectionDate": "2009-04-30 00:00:00",
  "SafetyInspectionBy": "USDOT Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-11-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.10757,
  "FRS_Long": -89.43932,
  "FRS_Description": "OTHER",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010549,
      "AltID": null,
      "FacilityID": 1000009024,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010930,
          "ProcessID": 1000010549,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012014,
          "ProcessID": 1000010549,
          "ChemicalID": 101,
          "Quantity": 4000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 101,
            "ChemicalName": "Vinyl chloride  [Ethene, chloro-]",
            "CASNumber": "75-01-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512014,
          "ProcessID": 1000010549,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009024,
      "SummaryText": "PolyOne Corporation Henry Plant\nEnvironmental Policy\n\nThe PolyOne Corporation Henry Plant, a producer of Specialty Vinyl Chloride Resins, is fully committed to conducting operations in a manner protective of the environment that benefits both our employees and community.  We will accomplish this by:\n\nA? Complying with all applicable federal, state and local regulations and permits.\n \nA? Proactively finding ways to continually improve in our environmental performance and prevent pollution through teamwork and innovation. Our efforts are supported by PolyOne Corporate Policy.\n \nA? Communicating this policy to all employees and other stakeholders, and to manage its effective implementation through employee participation and the use of an Environmental Management System.\n                                                                                      \n\nPolyOne Corporation Henry Plant\nSafety and Health Policy\n\nWe are committed as individuals and as a team to ensure that everyone who comes into the plant returns home uninjured and healthy.  We continuously strive to improve our processes, procedures, and work systems in meeting this objective.\n\nPolyOne Corporation\nENVIRONMENTAL POLICY\n\nPolyOne Corporation conducts its operations in an environmentally responsible manner that is protective of the communities in which we operate. Our environmental management system assures compliance with applicable environmental laws and regulations.  \n\nWe are committed to the continual improvement of environmental programs and to pollution prevention. Setting and periodically reviewing environmental objectives and targets assures excellence in environmental leadership.\n\nIt is the responsibility of each and every one of us to ensure that all operations in the company are carried out in accordance with this policy\n\nPolyOne Corporation\nSAFETY AND HEALTH POLICY\n\nPolyOne Corporation believes safety and health are the highest corporate priority. It is our policy to conduct business in a man"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009024,
      "SummaryText": "ner that ensures the safety and health of employees, customers and the communities in which we operate.\n\nPolyOne will be the leader in safety and health by setting aggressive goals and measuring performance. We have adopted Responsible Care principles to guide our efforts in continuous improvement. \n\nIt is PolyOne's expectation that stakeholders be committed to operating in a safe manner. As a condition of employment, we expect and require each individual to work safely at all times. We must share the philosophy that every accident and injury is preventable.\n\nIt is the responsibility of each person at PolyOne to give the highest priority to safety and health both on and off the job. Commitment, attitude, and behavior are the most important factors in preventing injuries and illnesses and preserving health. Our commitment to excellence in safety and health is absolute.\n\n                                                                                                                                                                      \nSUMMARY OF REGULATED SUBSTANCES\n\nThe PolyOne Corporation located in Henry, Illinois has one regulated flammable substance identified for the Accidental Release Prevention Program (40 CFR Part 68.130) above the Threshold Quantity (TQ) of 10,000 pounds: Vinyl Chloride Monomer (VCM) (CAS No. 75-01-4).\n\nNo toxic chemicals listed in the Accidental Release Prevention Program exceed the TQ.\n\n\nRELEASE SCENARIOS\n\nThe worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario are outlined herein:\n\nWORST-CASE RELEASE SCENARIO\n\nFailure of one spherical storage tank would release 2,000,000 pounds of Vinyl chloride.  It is assumed that the entire contents of the sphere are released as a vapor, which finds an ignition source.  Ten percent of the release quantity is assumed to participate in the resulting explosion.\n\nUsing the equatio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009024,
      "SummaryText": "ns for calculating over pressure from the RMP Offsite Consequence Analysis Guidance Document (OCAG).  \nA? The distance to the endpoint of 1 psi overpressure equals 0.76 miles. \n\nUsing Fire Radiation Table 22, page 70 of OCAG.\nA? The distance for radiant heat dose of 5 kW/square meter is 0.85 miles.\n\n\nALTERNATIVE RELEASE SCENARIO\n\nAn overpressurization of a tank rupture disk or relief valve results in a release of 12,000 pounds of vinyl chloride.  The entire contents of the tank are released over 2 minutes.  Unconfined vapor travels to the lower flammability limit (LFL).\n\nThe distance to the endpoint for the LFL for the alternative scenario is less than 317 feet or 0.06 miles.\n\nUsing Exhibit C-2, page 100 of OCAG.\nA? LFL of VCM is 92 mg/l\n\nUsing Reference Table 21, page 66 of OCAG.\nA? Distance to LFL for 6,000 pound/minute release rate is <0.06 miles (<317 feet)\n\n\n PREVENTION PROGRAM\n\nPolyOne Corporation has in place a prevention program encompassing elements consistent with the Occupational Safety and Health Administration (OSHA) Process Safety Management Standard (PSM) for Highly Hazardous Chemicals (29 CFR 1910.119).  VCM, the same substance is regulated under the USEPA Clean Air Act Section 112(r)(7) Accidental Release Prevention Requirements: Risk Management Programs (RMP)(40 CFR Part 68).\n\nThe PolyOne Henry facility, which is covered under a Title V Operating Permit and the PSM and RMP standards, has implemented the following:\n\n1.  An Employee Participation policy has been instituted to regularly consult with employees regarding the development and implementation of PSM/RMP elements and hazard assessments.\n\n2.  A comprehensive Process Safety Information program, which insures complete and accurate written information concerning process chemicals, process technology and process equipment.  This information is included in the employee training programs.\n\n3.  Process Hazard Analysis (PHA) is conducted to identify and analyze the potential hazards associated with t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009024,
      "SummaryText": "he processing or handling of highly hazardous chemicals.\n\n4.  The preparation of Operating Procedures that describe tasks to be performed, operating conditions to be maintained, data to be recorded, and safety precautions to be taken.\n\n5.  PolyOne Corporation has established Employee Training programs to insure that all employees, including maintenance and contractor employees involved with chemicals, fully understand the potential hazards of each chemical.  PolyOne Corporation has established an \"Operator Certification\" program to train, test and certify company employees.\n\n6.  Contractors are thoroughly evaluated to insure that they have the appropriate job skills, knowledge and certifications to perform the job safely.\n\n7.  For new processes, a Pre-Startup Safety Review is conducted to insure a safe transition into the normal operating mode.\n\n8.  A Mechanical Integrity program is in place to assure the integrity of process equipment.  Elements include the following:\n\nA? identification and categorization of equipment and instrumentation\nA? inspections and test\nA? establishment of prescribed inspection frequencies\nA? development and application of pertinent maintenance procedures\nA? training of maintenance personnel\nA? documentation of test and inspection results\nA? documentation of manufacturer's maintenance recommendations\n                                                                                                                                                                            \n9.  A \"Hot Work\" Permit system is in place to manage welding, cutting or brazing of equipment in process areas.\n\n10. To properly manage changes involving processes, chemical, technology, equipment or facilities a Management of Change system has been implemented.\n\n11. In the event of any chemical release or \"near miss\", a team of experienced individuals familiar with the process conducts an Incident Investigation  Any recommended changes are documented within the Management o"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000009024,
      "SummaryText": "f Change system.\n\n12. An Emergency Response program is in place for the entire facility and the surrounding community in the event of a chemical release.  \n\n13. Compliance Audits are performed to review all relevant documentation, verify process safety information, inspect the physical facilities and conduct interviews with representative plant personnel.\n\nFIVE YEAR ACCIDENT HISTORY\n\nDuring the past five years The PolyOne Corporation Henry Plant has had no chemical releases which created an emergency situation outside the plant boundaries nor resulted in any deaths, injuries, or significant property damage onsite or known offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe PolyOne Corporation has in place the following \"Emergency Procedures\" for handling accidental releases of chemicals:\n\nA? Fire Emergency Procedure\nA? Gas Alarm Procedure\nA? Emergency Evacuation Procedure\nA? Notification Procedure\nA? Spill Prevention Control and Countermeasure Plan\n \nA notification system is in place to initiate response to any emergency.  Key personnel are notified via plant alarms, pagers and telephone. Once notification has occurred, key personnel follow a series of emergency plans.  For example, in the event of a fire, the Firebrigade Team will respond and an onsite Chain of Command communication system is implemented. The Firebrigade Team is trained to deal with chemical releases and emergencies. All members are trained in First Aid/CPR.\n\nCoordinated drills with the Henry Volunteer Fire Department, neighboring industry, Marshall County ESDA, and the Local Emergency Planning Committee (LEPC) are conducted to insure good communication and operational effectiveness. \n\n                                                                                                                                                               \nFACILITY IMPROVEMENTS\n\nThe PolyOne Corporation plans to continue to evaluate"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000009024,
      "SummaryText": " the regulated process as required under the PSM/RMP Standards to insure safe operations.  Additionally, the company will continue to work with the local fire department, ESDA and LEPC to coordinate training drills and information.  The PolyOne Corporation annually performs a complete facility review to verify an effective Environmental, Safety and Health program."
    }
  ]
}