{
  "FacilityID": 1000012046,
  "FacilityName": "City of West Palm Beach Water Treatment Plant",
  "FacilityStr1": "1009 Banyan Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "West Palm Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "33402",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12099",
  "LEPC": "District 10 LEPC -- Terry Hess",
  "FacilityLatDecDegs": "26.716111",
  "FacilityLongDecDegs": "-080.062778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "asharpe@wpb.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of West Palm Beach",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of West Palm Beach",
  "OperatorStr1": "1009 Banyan Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "West Palm Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33402",
  "OperatorZipCodeExt": null,
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000088193",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-07-15 00:00:00",
  "SafetyInspectionBy": "Other: City of West Palm Beach Risk Management",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-07-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-07-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-07-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-11-09 00:00:00",
  "DeRegistrationEffectiveDate": "2010-11-01 00:00:00",
  "AnniversaryDate": "2015-07-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 26.71478,
  "FRS_Long": -80.06245,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "No longer uses chlorine gas, chlorine gas removed; Liquid bleach used now",
  "_processes": [
    {
      "ProcessID": 1000014799,
      "AltID": "Ammoniation",
      "FacilityID": 1000012046,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000017186,
          "ProcessID": 1000014799,
          "ChemicalID": 56,
          "Quantity": 21250.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000015142,
          "ProcessID": 1000014799,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000012143,
              "Process_NAICS_ID": 1000015142,
              "SafetyReviewDate": "2009-11-15 00:00:00",
              "PHA_Date": "2009-11-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 1,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-11-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "scrubber",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-09-30 00:00:00",
              "TrainingReviewDate": "2009-09-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-09-30 00:00:00",
              "EquipmentInspectionDate": "2009-11-15 00:00:00",
              "EquipmentTested": "chlorinator, ammoniators, relief valves, alarms, detectors, scrubbers, systems are completely cheched and tested on a weekly basis",
              "ChangeMgmtDate": "2009-09-30 00:00:00",
              "ChangeMgmtReviewDate": "2009-09-30 00:00:00",
              "PreStartupReviewDate": "2009-11-15 00:00:00",
              "ComplianceAuditDate": "2007-07-15 00:00:00",
              "AuditCompletionDate": "2007-07-15 00:00:00",
              "IncidentInvestigationDate": "2002-03-18 00:00:00",
              "InvestigationChangeDate": "2003-07-01 00:00:00",
              "ParticipationPlansReviewDate": "2009-09-30 00:00:00",
              "HotWorkPermitReviewDate": "2009-09-30 00:00:00",
              "ContractorSafetyReviewDate": "2009-09-30 00:00:00",
              "ContractorSafetyEvalDate": "2009-11-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "Prevention:     The Water Treatment Plant received Best Operated Plant, Region 6 - 1997, 1998; FWPCOA Chairman Safety Award 1997; AWWA Outstanding A Plant in State 1998; and AWWA 2003 Outstanding Safety Award.  Numerous precautions are taken at the Water Treatment Plant to prevent the accidental release of chlorine and ammonia gas into the atmosphere, and to minimize the consequences if a release does occur.\n\nChlorine Containers -- The chlorine is stored and discharged from one ton containers.  The containers are welded tanks with heads convexed inward and forge welded to the barrel.  The sides are crimped inward at each end to form chimes which provide a substantial grip for lifting beams.  The container valves are protected by removable steel valve protective housing.  All ton containers are equipped with fusible metal pressure relief devices.  The fusible metal is designed to yield or melt between 158F and 165F to relieve pressure and prevent rupture or the container in case of a fire or other exposure to high temperature.\n\nChlorine System -- The system has process controls, a mitigation system and a monitoring and detection system.  Process controls in place is a Standard Operating Procedure (SOP) to check for leaks prior to placing the containers on line, manual shut-off if a leak is detected at a valve, and routine replacement of any gaskets or valves.  Mitigation systems in use are an enclosed building with chlorine sensors.  When chlorine is detected above 1.0 ppm (ACGIH short-term exposure limit) an alarm sounds, the building's louvers and vents close and the scrubber system is activated.\n\nPassive Mitigation -- The chlorine building is a concrete reinforced sealed block structure.  During normal use the building is closed with only mechanical louvers used for ventilation.\n\nActive Mitigation -- The building is equiped with a detection/alarm system.  The sensor detects chlorine at concentration of 0.5 parts per million (ppm) or greater.  If chlorine is detected at 1.0 ppm or greater the building's louvers and vents close and an audible alarm sounds and an indicator light illuminates.  The computer system in the main office indicates the release.  Activated upon the detection of chlorine is the building's scrubber system.  99.3 % of the chlorine gas is removed from the air prior to entering the atmosphere.  The scrubber system can neutralize a release of 2,00 pounds of chlorine without recharging the caustic solution in the system.  Additional quantities of chlorine can be mitigated upon recharging the system.  This is a continuous process until all relased chlorine is neutralized.\n\nAmmonia Tanks -- The ammonia is stored and discharged from two (2) 2,500 gallon tanks.  The tanks are steel welded with all appertenances have excess flow relief valves and manual shut-off valves.  The tanks are filled to 85% capacity providing for 2,125 gallons of anhydrous ammonia storage per tank and a total storage capacity of 4,250 gallons of anhydrous ammonia.  Both tanks are equipped with over-pressure relief valves designed to discharge at 250 psig.\n\nAmmonia System -- The system has process controls , a mitigation system, and a monitoring and detection system.  Process controls in place is a Standard Operating Procedure (SOP) to check for leaks prior to changing over the tanks for service.  Manual  shutoff if a leak is detected at a valve of pipe fitting. And routnine maintenance all ammonia system components.  Mitigation systems in use are an enclosed building with ammonia detectors and audible alarm, and an automatically activated scrubber system.  The amoonia detectors will active at 3 ppm and the scrubber will activate at 30 ppm.\n\nPassive Mitigation -- The ammonia building is a concrete reinforced sealed block structure.  During normal use the building is closed with only the mechaical louvers used for ventilation.\n\nActive Mitigation -- The building is equipped with a detection / alarm system.  The sensor detects ammonia concentrations at 3 parts per million (ppm) or greater and an audible alarm sounds.  If ammonia is detected at 30 ppm or greater the building's vents close and audible alarm sounds and an indicator light illuminates and the scrubber activates.  The computer in the main office indicates the release.  The air and ammonia gas inside the building is vemtilated through the scrubber system.  100% of the ammonia gas is removed for the air prior to entering the atmosphere.  The scrubber uses water as the neuttralizing agent and can neutralize the complete contents of both tanks at full capacity without the need for recharging.  This is a continuous process until all release ammonia gas is neutralized.\n\nMaintenance -- The scrubber system, vents, louvers, and alarms are tested weekly on the chlorine system.  The caustic solution in the chlorine scrubber system is laboratory tested every two (2) months.  Chlorine repair kits are kept onsite for emergency operations.   The scrubber system, alarm and detectors are tested weekly on the ammonia system.   An annual safety inspection is performed at the Water Treatment Plant by David C. Holler, Environmental, Health and Safety Officer, City of West Palm Beach.\n\nPersonnel -- The personnel involved in these processes are licensed operators.  All operators attend annual training for both the trouble shooting - safety and response for both chlorine and ammonia.  Additionally, several operators and maintenance personnel attend an eight (8) week HazMat / First Responder course at the South Technical FireAcademy.  HazMat / First Responder course is refreshed annually with a one day course.\n\nGeneral Accidental Release Prevention Program -- Standard operating procedures for leak detection, and operations and maintenance are in place for botht he chlorine and ammonia systems.  Both the ammonia and chlorine gas is stored in enclose buildings with detection and alarm systems, and automatically activated scrubber systems.\n\nEmergency Response Plan / Procedures -- The wastewater treatment plant maintains a written Emergency Response Plan.  The basis of the plan is if a chlorine leak occurs the utility personnel can take a defensive measure to seal the leak.  Defensive measures are defined as closing valves, such as cylinder valves and header valves.  In the event that a leak can not be stopped by simply closing a valve or valves, the utiltiy personnel shall evacuate the area of the cylinder leak to a safe diostance to await Fire Rescue personnel.  Utility personnel will notify the West Palm Beach Fire Departement by a designated red telephone or by calling 911.  The fire Rescue personnel then take charge of the situation with assistance from utility personnel.  If additional assitance is needed, the West Palm Beach Fire Departement will call upon the Palm Beach County Fire Rescue personnel. \n\nHazmat Response / Procedures -- The West Palm Beach Fire Department has established a two tiered approach to incidents involving hazardous materials.  First, all emergency response personnel will be trained as operational first responders.  The second level of response will be a Hazardous Materials Response Team specially trained and equipped to conduct offensive operations at a hazardous materials incident.  Prior to assignement to the West Palm Beach Fire Department Hazardous Materials Team, an individual must conform to the following criteria:\n\n(1)  Have successfully completed the hazardous Materials Technician course and have demonstrated the competencies outlined in the 1992 edition of the Natiional Fire Protection's Standard 472. \n\n(2)  Have completed a baseline medical examination pursuant to 29 CFR 1910.120 and have been determined by the ezamining physician to be free of any medical conditions which would place the employee at increased risk of impairment of the employee's health from work in hazardous materials emergency response. \n\n(3)  Hold a current certification as a State of Florida Medicla Technician, and/or Paramedic. \n\n(4) Demonstrate a working knowledge of Special Operations 5's layout, equipment locations and functions. \n\n(5)  Have a working knowledge of the West Palm Beach Fire Department's Hazardous Materials Team's Standard Operating Procedures.  \n\nHazardous materials incidents are categorized into four (4) levels based on the intensity and quantity of the release:  Level I -- A Level I incident is a minor situation.  A Level I incident is defined as a release of less than 25 gallons liquid or 50 pounds solid of a know hazardous material.  Level II --  A Level II incident is one in which a more serious threat is posed by the release or potential relaes of a hazardous material.  Level II incidents require a definte assitance and intervention by a Hazardous Materials Team.  Level III -- A Level III incident is a major incident requiring specialized assistance and may require assitance from support agencies.  A formal command post, staging area, and medicla and/or rehab groups are established.  The establishment and control over isolatins (hot) zones is included.  Level IV -- A Level IV incident is a local disaster.  This type of incident will severly strain or exceed the capabilities of local response agencies.  A long-term command post may be required.  It may require activation of an Emergency Operatins Center.  \n\nThe following procedures will be followed during an incident:  The Fire Rescue Unit arriving at a hazardous materials incident shall establish command, utilizing a unit or geographic location to indentify command.  The HazMat Group shall report directly to the Incident Commander.  The HazMat Group is responsible for recommending evacuation distances, obtaining information concerning the hazards and risks posed by the material(s) in question, recommending decontamination and safety measures, recommending possible mitigation efforts and provide other technical assitance.  The Incident Commander retains overall control and authority during the entire operation, and the HazMat Group shall perform mitigative actions. \n\nIf additional HazMat Teams are needed the Palm Beach County Regional Hazardous Materials Response Teams (PBCRHMRT) assits the West Palm Beach Fire Departement with hazardous materials incidents.  The PBCRHMRT has an Emergency Management Plan with supplements the plan of the West Palm Beach Fire Department.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000014279,
                  "PreventionProgram3ID": 1000012143,
                  "ProcessChemicalID": 1000017186
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000014800,
      "AltID": "Chlorination",
      "FacilityID": 1000012046,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000017187,
          "ProcessID": 1000014800,
          "ChemicalID": 62,
          "Quantity": 72000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000015143,
          "ProcessID": 1000014800,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000012144,
              "Process_NAICS_ID": 1000015143,
              "SafetyReviewDate": "2009-11-15 00:00:00",
              "PHA_Date": "2009-11-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 1,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-11-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-09-30 00:00:00",
              "TrainingReviewDate": "2009-09-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-09-30 00:00:00",
              "EquipmentInspectionDate": "2009-11-15 00:00:00",
              "EquipmentTested": "all equipment involved in the chlorination process",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-09-30 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2007-07-15 00:00:00",
              "AuditCompletionDate": "2007-07-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-09-30 00:00:00",
              "HotWorkPermitReviewDate": "2009-09-30 00:00:00",
              "ContractorSafetyReviewDate": "2009-09-30 00:00:00",
              "ContractorSafetyEvalDate": "2009-11-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "Prevention:     The Water Treatment Plant received Best Operated Plant, Region 6 - 1997, 1998; FWPCOA Chairman Safety Award 1997; AWWA Outstanding A Plant in State 1998; and AWWA 2003 Outstanding Safety Award.  Numerous precautions are taken at the Water Treatment Plant to prevent the accidental release of chlorine and ammonia gas into the atmosphere, and to minimize the consequences if a release does occur.\n\nChlorine Containers -- The chlorine is stored and discharged from one ton containers.  The containers are welded tanks with heads convexed inward and forge welded to the barrel.  The sides are crimped inward at each end to form chimes which provide a substantial grip for lifting beams.  The container valves are protected by removable steel valve protective housing.  All ton containers are equipped with fusible metal pressure relief devices.  The fusible metal is designed to yield or melt between 158F and 165F to relieve pressure and prevent rupture or the container in case of a fire or other exposure to high temperature.\n\nChlorine System -- The system has process controls, a mitigation system and a monitoring and detection system.  Process controls in place is a Standard Operating Procedure (SOP) to check for leaks prior to placing the containers on line, manual shut-off if a leak is detected at a valve, and routine replacement of any gaskets or valves.  Mitigation systems in use are an enclosed building with chlorine sensors.  When chlorine is detected above 1.0 ppm (ACGIH short-term exposure limit) an alarm sounds, the building's louvers and vents close and the scrubber system is activated.\n\nPassive Mitigation -- The chlorine building is a concrete reinforced sealed block structure.  During normal use the building is closed with only mechanical louvers used for ventilation.\n\nActive Mitigation -- The building is equiped with a detection/alarm system.  The sensor detects chlorine at concentration of 0.5 parts per million (ppm) or greater.  If chlorine is detected at 1.0 ppm or greater the building's louvers and vents close and an audible alarm sounds and an indicator light illuminates.  The computer system in the main office indicates the release.  Activated upon the detection of chlorine is the building's scrubber system.  99.3 % of the chlorine gas is removed from the air prior to entering the atmosphere.  The scrubber system can neutralize a release of 2,00 pounds of chlorine without recharging the caustic solution in the system.  Additional quantities of chlorine can be mitigated upon recharging the system.  This is a continuous process until all relased chlorine is neutralized.\n\nAmmonia Tanks -- The ammonia is stored and discharged from two (2) 2,500 gallon tanks.  The tanks are steel welded with all appertenances have excess flow relief valves and manual shut-off valves.  The tanks are filled to 85% capacity providing for 2,125 gallons of anhydrous ammonia storage per tank and a total storage capacity of 4,250 gallons of anhydrous ammonia.  Both tanks are equipped with over-pressure relief valves designed to discharge at 250 psig.\n\nAmmonia System -- The system has process controls , a mitigation system, and a monitoring and detection system.  Process controls in place is a Standard Operating Procedure (SOP) to check for leaks prior to changing over the tanks for service.  Manual  shutoff if a leak is detected at a valve of pipe fitting. And routnine maintenance all ammonia system components.  Mitigation systems in use are an enclosed building with ammonia detectors and audible alarm, and an automatically activated scrubber system.  The amoonia detectors will active at 3 ppm and the scrubber will activate at 30 ppm.\n\nPassive Mitigation -- The ammonia building is a concrete reinforced sealed block structure.  During normal use the building is closed with only the mechaical louvers used for ventilation.\n\nActive Mitigation -- The building is equipped with a detection / alarm system.  The sensor detects ammonia concentrations at 3 parts per million (ppm) or greater and an audible alarm sounds.  If ammonia is detected at 30 ppm or greater the building's vents close and audible alarm sounds and an indicator light illuminates and the scrubber activates.  The computer in the main office indicates the release.  The air and ammonia gas inside the building is vemtilated through the scrubber system.  100% of the ammonia gas is removed for the air prior to entering the atmosphere.  The scrubber uses water as the neuttralizing agent and can neutralize the complete contents of both tanks at full capacity without the need for recharging.  This is a continuous process until all release ammonia gas is neutralized.\n\nMaintenance -- The scrubber system, vents, louvers, and alarms are tested weekly on the chlorine system.  The caustic solution in the chlorine scrubber system is laboratory tested every two (2) months.  Chlorine repair kits are kept onsite for emergency operations.   The scrubber system, alarm and detectors are tested weekly on the ammonia system.   An annual safety inspection is performed at the Water Treatment Plant by David C. Holler, Environmental, Health and Safety Officer, City of West Palm Beach.\n\nPersonnel -- The personnel involved in these processes are licensed operators.  All operators attend annual training for both the trouble shooting - safety and response for both chlorine and ammonia.  Additionally, several operators and maintenance personnel attend an eight (8) week HazMat / First Responder course at the South Technical FireAcademy.  HazMat / First Responder course is refreshed annually with a one day course.\n\nGeneral Accidental Release Prevention Program -- Standard operating procedures for leak detection, and operations and maintenance are in place for botht he chlorine and ammonia systems.  Both the ammonia and chlorine gas is stored in enclose buildings with detection and alarm systems, and automatically activated scrubber systems.\n\nEmergency Response Plan / Procedures -- The wastewater treatment plant maintains a written Emergency Response Plan.  The basis of the plan is if a chlorine leak occurs the utility personnel can take a defensive measure to seal the leak.  Defensive measures are defined as closing valves, such as cylinder valves and header valves.  In the event that a leak can not be stopped by simply closing a valve or valves, the utiltiy personnel shall evacuate the area of the cylinder leak to a safe diostance to await Fire Rescue personnel.  Utility personnel will notify the West Palm Beach Fire Departement by a designated red telephone or by calling 911.  The fire Rescue personnel then take charge of the situation with assistance from utility personnel.  If additional assitance is needed, the West Palm Beach Fire Departement will call upon the Palm Beach County Fire Rescue personnel. \n\nHazmat Response / Procedures -- The West Palm Beach Fire Department has established a two tiered approach to incidents involving hazardous materials.  First, all emergency response personnel will be trained as operational first responders.  The second level of response will be a Hazardous Materials Response Team specially trained and equipped to conduct offensive operations at a hazardous materials incident.  Prior to assignement to the West Palm Beach Fire Department Hazardous Materials Team, an individual must conform to the following criteria:\n\n(1)  Have successfully completed the hazardous Materials Technician course and have demonstrated the competencies outlined in the 1992 edition of the Natiional Fire Protection's Standard 472. \n\n(2)  Have completed a baseline medical examination pursuant to 29 CFR 1910.120 and have been determined by the ezamining physician to be free of any medical conditions which would place the employee at increased risk of impairment of the employee's health from work in hazardous materials emergency response. \n\n(3)  Hold a current certification as a State of Florida Medicla Technician, and/or Paramedic. \n\n(4) Demonstrate a working knowledge of Special Operations 5's layout, equipment locations and functions. \n\n(5)  Have a working knowledge of the West Palm Beach Fire Department's Hazardous Materials Team's Standard Operating Procedures.  \n\nHazardous materials incidents are categorized into four (4) levels based on the intensity and quantity of the release:  Level I -- A Level I incident is a minor situation.  A Level I incident is defined as a release of less than 25 gallons liquid or 50 pounds solid of a know hazardous material.  Level II --  A Level II incident is one in which a more serious threat is posed by the release or potential relaes of a hazardous material.  Level II incidents require a definte assitance and intervention by a Hazardous Materials Team.  Level III -- A Level III incident is a major incident requiring specialized assistance and may require assitance from support agencies.  A formal command post, staging area, and medicla and/or rehab groups are established.  The establishment and control over isolatins (hot) zones is included.  Level IV -- A Level IV incident is a local disaster.  This type of incident will severly strain or exceed the capabilities of local response agencies.  A long-term command post may be required.  It may require activation of an Emergency Operatins Center.  \n\nThe following procedures will be followed during an incident:  The Fire Rescue Unit arriving at a hazardous materials incident shall establish command, utilizing a unit or geographic location to indentify command.  The HazMat Group shall report directly to the Incident Commander.  The HazMat Group is responsible for recommending evacuation distances, obtaining information concerning the hazards and risks posed by the material(s) in question, recommending decontamination and safety measures, recommending possible mitigation efforts and provide other technical assitance.  The Incident Commander retains overall control and authority during the entire operation, and the HazMat Group shall perform mitigative actions. \n\nIf additional HazMat Teams are needed the Palm Beach County Regional Hazardous Materials Response Teams (PBCRHMRT) assits the West Palm Beach Fire Departement with hazardous materials incidents.  The PBCRHMRT has an Emergency Management Plan with supplements the plan of the West Palm Beach Fire Department.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000014280,
                  "PreventionProgram3ID": 1000012144,
                  "ProcessChemicalID": 1000017187
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000012046,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-12-01 00:00:00",
    "ERTrainingDate": "2009-09-15 00:00:00",
    "CoordinatingAgencyName": "West Palm Beach Fire Department",
    "CoordinatingAgencyPhone": "5618352900",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012046,
      "SummaryText": "The City of West Palm Beach Water Treatment Plant has developed this Risk Management Plan (RMP) in response to Section 112 ( r ) of the Clean Air Act (CAA).  This guidance complies with the United States Environmental Protection Agency's (EPA) Risk Management Program (RMP) regulations, 40 CFR Part 68, and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) Standard 29 CFR 1910.119.\n\nSection 112( r ) requires facilities which store certain toxic or flammable chemicals above threshold quantities to develop and implement an RMP.  The RMP evaluates the worst case and alternative case release of these chemicals  into the environment and the impact on surrounding human populations and environmental receptors.  The worst case release scenario assumes that all of the toxic substance within a vessel, system or process is released at one time.  The alternative case scenario assumes a smaller, more realistic, release of perhaps on cylinder or container.  The RMP also evaluates the facility's resources to cope with chemical releases.  Although the RMP present worst case and alternative case scenarios, it should be noted that there has never been an incident at the ECRWWTF which resulted in any offsite consequences or injury to human health or the environment.\n\nThe City's water treatment plant located at Clear Lake, treats surface water from the Water Catchment Area (WCA) and the L-8 Canal.  It provides potable water to the City of West Palm Beach, the Town of Palm Beach and South Palm Beach, and to some unincorporated ares of Palm Beach County.  Current water use ranges between 20 and 40  million gallons per day (mgd).  The water plant can treat up to 47 mgd, which is expected to be sufficient to meet its future water demands.\n\nThe original water system was developed by Henry Flagler in 1894 to serve the hostoric Royal Ponciana Hotel.  The first water treatment plant was constructed in 1921.  The City of West Palm Beach purchsed the plant "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012046,
      "SummaryText": "in 1955 and has continued to expand and operate the plant.  A pro-active improvement program will provide potable water to meet existing and anticipated regulatory standards.  In the past two years the water treatment plant upgrades have totaled over $20 million to enhance and modify the treatment process and safety to meet the proposed rerquirement of the Safe Drinking Water Act and other federal legislation.\n\nThe water treatment plant physically and chemically treats raw intake water to produce a potable water which meets standards of the Safe Water Drinking Act.\n\nChlorine and ammonia are both used at this facility at quantities above the EPS -- List of Regulated Toxic Substances and Threshold Quantities for Accidental Release Prevention, and thus both chlorine and ammonia are the basis of this RMP.  \n\nThe maximum amount of liquid chlorine onsite at anyone time during normal operation is 36,000 pounds.  Chlorine cylinders are stored in a state-of-the-art chlorine building equipped with a computerized leak detection system and a chlorine leak scrubber system.  If a leak develops inside the building the leak detection system sends an alarm to the control room and activates the scrubber system.  All vents and louvers in the building automatically close.  The air within the building is drawn through the scrubber system which neutralizes the chlorine gas with a sodium hydroxide solution.  Chlorine is used in the treatment process to produce potable water.  Chlorine is added to the water as a disinfectant to kill pathogenic bacteria.  During normal operattions six (6) on ton (2,000 pounds) chlorine containers are in use at one time, plus six (6) containers are on standby with container valves closed, and six (6) more are in storage.  The chlorine is stored int eh containers as a liquid under pressure, but is discharged into the water as a gas.\n\nChlorine is one of the chemical elements and is one of the halogens.  Neither gas nor the liquid is explosive or flammable, how"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012046,
      "SummaryText": "ever, both reactive chemically with many sustances.  Chlorine is a hazardous chemical that can cause severe injury or death if released into the atmosphere.  Chlorine gas is primarily a respiratory irritant.  In sufficient concentrations, the gas irritates the mucous membranes, the respiratory system and skin.  At higher levels there is vomiting associated with labored breathing.  In extreme cases difficulty breathing may increase to the point where death can occur from suffocation.\n\nChlorine is also hazardous to the environment.  Chlorine causes bleached spots on leafy palnts due to an attack on chlorophyll in the leaf.  Mammanlian animals suffer many of the same effects as humans exposed to chlorine.  Many forms of aquatic animal life are adversely agffected by chlorine in concentrations well below 0.1 ppm, but harmful concentrations are unlikely unless chlorine is discharged directly in to the water. Chlorine gas processing will be removed from the facility within the next 12 months with a liquid chlorine system being installed.\n\nThe maximum amount of ammonia onsite at any one time is 21,250 pounds.  The ammonia tanks are located in a state-of-the-art ammonia building with a computerized leak detection system and an ammonia leak scribber system.  If a leak develops inside the building the leak detection system sends an alarm to the control room and activates the scrubber system.  All vents in the building automatically close.  The air within the building is drawn throught the scrubber system which cleans the air of ammonia gas using water as the reactant.  The water ammonai solution is then discharged to the sanitary sewer system for disposal.  Ammonia is used in the treatment process to produce potable.  Ammonia is added to the water to aid in the disinfecting procees. By adding ammonia to the water the amount of daily chlorine consumption is reduced.  The ammonia and chlorine combine to create chloramine which has a higher disinfecting capability than chlorine "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012046,
      "SummaryText": "alone. The ammonia allows the chlorine to remain and stabilize the in the system allow the chlorine to be effective throughout the distibution system.  During normal operations one 2,500 gallon tankis in use with another 2,500 gallon tank on stand-by.  The ammonia is stored in the tanks as a liquid under pressure, but it is discharged into the water as a gas.\n\nAnhydrous ammonia is a colorless gas with a sharp pungent odor.  Ammonia gas may become flammable or explosive when exposed to oxygen enriched environments or strong oxidizing materials.  Ammonia will react violently many different chemical compounds and metals.  Ammonia storage rooms must be kept free of stong oxidizers and combustible materials.  Ammonia is a hazardous materila that can cause severe injury or death if released into the atmosphere.  Ammonia gas is primarily an respiratory irritant.  In sufficient concentrations the gas irritates the mucous membranes, the respiratory system and the skin.  High concentrations may cause pulmonary edema.  Concentrations at 5,000 ppm can caise sudden death."
    }
  ]
}