{
  "FacilityID": 1000056402,
  "FacilityName": "Flint Hills Resources Iowa Falls, LLC",
  "FacilityStr1": "21050 140th Street",
  "FacilityStr2": null,
  "FacilityCity": "Iowa Falls",
  "FacilityState": "IA",
  "FacilityZipCode": "50126",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19083",
  "LEPC": "Hardin County LEPC",
  "FacilityLatDecDegs": "42.505318",
  "FacilityLongDecDegs": "-093.282043",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 966513413,
  "ParentCompanyName": "FHR Biofuels & Ingredients, LLC",
  "Company2Name": null,
  "CompanyDUNS": 966500147,
  "Company2DUNS": null,
  "OperatorName": "Flint Hills Resources Iowa Falls, L",
  "OperatorStr1": "21050 140th Street",
  "OperatorStr2": null,
  "OperatorCity": "Iowa Falls",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50126",
  "OperatorZipCodeExt": null,
  "FTE": 67,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000189609",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-06-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-07-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-07-18 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-07-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-12-04 00:00:00",
  "DeRegistrationEffectiveDate": "2018-08-20 00:00:00",
  "AnniversaryDate": "2021-07-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.507192,
  "FRS_Long": -93.28041,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Flammable mixture is not subject to RMP as the mixture meets NFPA-3 criteria.",
  "_processes": [
    {
      "ProcessID": 1000070431,
      "AltID": "Denaturant Storage",
      "FacilityID": 1000056402,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087018,
          "ProcessID": 1000070431,
          "ChemicalID": 155,
          "Quantity": 700000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000076685,
              "ProcessChemicalID": 1000087018,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000076686,
              "ProcessChemicalID": 1000087018,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000076687,
              "ProcessChemicalID": 1000087018,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000074445,
              "ProcessChemicalID": 1000087018,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000074446,
              "ProcessChemicalID": 1000087018,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000071633,
          "ProcessID": 1000070431,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000058912,
              "Process_NAICS_ID": 1000071633,
              "SafetyReviewDate": "2014-08-22 00:00:00",
              "PHA_Date": "2014-08-22 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Risk Matrix with walkthrough",
              "PHACompletionDate": "2016-12-15 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "fire suppression with foam",
              "OpProceduresReviewDate": "2015-12-08 00:00:00",
              "TrainingReviewDate": "2015-10-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-04-20 00:00:00",
              "EquipmentInspectionDate": "2012-04-20 00:00:00",
              "EquipmentTested": "Full API 653 inspections, internal, external and floor scans.",
              "ChangeMgmtDate": "2014-08-21 00:00:00",
              "ChangeMgmtReviewDate": "2015-06-23 00:00:00",
              "PreStartupReviewDate": "2014-09-04 00:00:00",
              "ComplianceAuditDate": "2014-06-20 00:00:00",
              "AuditCompletionDate": "2016-04-30 00:00:00",
              "IncidentInvestigationDate": "2015-06-23 00:00:00",
              "InvestigationChangeDate": "2015-06-23 00:00:00",
              "ParticipationPlansReviewDate": "2015-06-03 00:00:00",
              "HotWorkPermitReviewDate": "2015-06-20 00:00:00",
              "ContractorSafetyReviewDate": "2015-07-22 00:00:00",
              "ContractorSafetyEvalDate": "2015-12-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000072251,
                  "PreventionProgram3ID": 1000058912,
                  "ProcessChemicalID": 1000087018
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000056402,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Iowa Falls Fire Department",
    "CoordinatingAgencyPhone": "6416486464",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056402,
      "SummaryText": "RMP Executive Summary \r\nThis Executive Summary briefly reviews the major elements of the Risk Management Plan (RMP) for Flint Hills Resources Iowa Falls, LLC (FHR Iowa Falls) ethanol production facility located near the city of Iowa Falls, Hardin County, Iowa. The facility started up in 2004 and was purchased from Hawkeye Iowa Falls, LLC by FHR Iowa Falls in 2011  This summary is presented in response to the requirements of the United States Environmental Protection Agency (EPA) under Title 40 of the Code of Federal Regulations, Part 68 (40 CFR.68) and Section 112(r) of the Clean Air Act. FHR Iowa Falls is subject to the RMP rule due to the onsite storage of natural gasoline (denaturant), a regulated flammable mixture, above the threshold quantity. \r\n1.\tAccidental Release Prevention and Emergency Response Policies \r\nFHR Iowa Falls is committed to protecting the environment and operating the facility in a manner that promotes the safety of employees and the general public. Management has adopted and implemented policies that adhere to applicable federal and state rules and regulations and as such the design and construction of the facility has incorporated physical and operational safeguards to prevent accidental releases. Through the proper design, installation, operation and maintenance of the equipment, and the training of personnel, FHR Iowa Falls has minimized the hazard to human health and the environment from fires, explosions, or any unplanned sudden or non-sudden release of hazardous materials. \r\nIn the event of a release, the facility's emergency response is described in its Emergency Response Action Plan (ERAP) and Integrated Contingency Plan (ICP), which consists of a Facility Response Plan (FRP) and Spill Prevention Control and Countermeasures (SPCC) Plan. The ICP and ERAP consist of procedures for responding to releases, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address emergency r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056402,
      "SummaryText": "esponse (including proper first-aid and medical treatment for exposures), evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements. In addition, FHR Iowa Falls has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions on the use of emergency response equipment. Employees receive training on performing their specific emergency response duties. The emergency response program is updated when necessary based on modifications made to facility processes or emergency response procedures. \r\n2.\tFacility Description and Regulated Substances Handled\r\nFHR Iowa Falls is a corn-based denatured ethanol fuel production plant which operates 24 hours per day, 7 days per week. Ethanol is produced through the conversion of corn starch to sugars and then conversion of the sugars to ethanol (i.e., grain alcohol) through a batch fermentation and continuous distillation process. \r\nRMP regulated substances stored above their threshold quantity at the facility include natural gasoline, which is used as a denaturant in the ethanol fuel product.\r\n3.\tAccidental Release Prevention Program and Chemical-Specific Prevention Steps\r\nFHR Iowa Falls has programs in place to address accidental release prevention measures required by EPA, Process Safety Management (PSM) requirements from the Occupational Safety and Health Administration (OSHA), and notification requirements of EPA's Emergency Response and Community Right-to-Know (EPCRA) regulations. The facility complies with PSM for the management of all regulated substances such as ethanol, fuel additives, and denaturant (natural gasoline).\r\nEmployee Participation\r\nFHR encourages employees to participate in safety management and accident prevention. The facility has developed an employee participation program as part of the PSM program."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056402,
      "SummaryText": "Safety information, process hazard analysis (PHA) results, recommendations, and action items, incident investigations, compliance audits, operating procedures, emergency response plan, and records of management of change are available to the operating personnel.\r\nProcess Hazard Analysis and Process Safety Information\r\nThe facility utilizes the What-If/What-If Checklist Combined PHA methodology. The PHA identified the following potential major hazards:  toxic release, fire, explosion, over-pressurization, overfilling, and equipment failure. The facility utilizes process controls such as vents, relief valves, check valves, manual and automatic shutoffs, interlocks, alarms and procedures, excess flow devices and grounding equipment to prevent or limit releases. The facility also utilizes dike containment around the facility's storage tanks, including the denaturant storage tank, to contain and mitigate liquid releases.\r\nFHR Iowa Falls keeps a variety of technical documents onsite that are used to help maintain safe operation of the facility and provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, piping and instrument drawings.\r\nOperating Procedures and Training\r\nFHR Iowa Falls is responsible for developing and implementing written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the PSM. The operating procedures that have been developed have been prepared as a guide for those involved with initial start-up, normal operation, normal shutdown and emergency shutdown of the process. The facility has developed and implemented a comprehensive training program for employees involved in facility operations. \r\nContractors\r\nThe facility's contractor safety procedures establish minimum guidelines and activities in order to assure that the contracto"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000056402,
      "SummaryText": "r's employees follow safe work practices and procedures. Prior to awarding contracts, the FHR representative evaluates the prior safety performance of any prospective contractor. After the contractor has been selected, a FHR Iowa Falls representative conducts a contractor orientation meeting with the contract employer representative. At that time, FHR reviews known potential fire, explosion, or toxic release hazards that are related to the contractor's work and the covered process. The contract employer representative is also informed of the applicable provisions of the emergency action plan, conditions regarding entrance to the process and the applicable safe work practices that must be followed in order to work at the site. Because contractors may work on or near the process equipment, the facility has procedures in place to ensure that contractors perform their work in a safe manner, have the appropriate knowledge and skills, and are aware of the hazards in their workplace.\r\nPre-Startup Safety Reviews\r\nAs part of the management of change (MOC) process, whenever a modification to the existing process is planned, either temporary or permanent, FHR Iowa Falls requires a Pre-Startup Safety Review (PSSR). The PSSR confirms that, prior to putting into service, the construction and equipment being used is in accordance with design specifications. The PSSR also confirms that the safety, operating, maintenance, and emergency procedures are in place and adequate training for each involved employee has been completed. A PSSR includes field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention measures are properly implemented.\r\nMechanical Integrity\r\nThe facility's mechanical integrity program was developed as part of PSM that defines requirements for ensuring the integrity of process equipment. Written procedures help ensure the safe implementation of maintenance activities thus promoting the reliabili"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000056402,
      "SummaryText": "ty and integrity of process equipment. This program also includes training, regular inspections and equipment testing. \r\nSafe Work Practices\r\nFHR Iowa Falls has safe work practices in place to ensure worker and process safety. These safety standards control entry into work areas and confined spaces, specify procedures to follow for isolating energy sources by lockout/tag-out and describe the permitting process for completing work in the facility. Safety standards and work procedures are reviewed annually. \r\n\r\nHot Work Permit\r\nThe facility has a hot work permit program that details areas which require a permit and those areas for which a permit is not required. A hot work permit is required in process areas for cutting, welding, spark-producing equipment, etc., except in designated areas. The procedure includes accountability and responsibility for authorizing and issuing the hot work permit, display of the permit at the site of the hot work until the work is completed, site inspection, designation of appropriate precautions to be taken with the hot work, and assignment of a fire watch where appropriate.\r\n\r\nManagement of Change\r\nThe facility's MOC program reviews proposed changes to process chemicals, technology, equipment, procedures, materials, and design conditions prior to implementation of the change. Changes are reviewed by an interdisciplinary team to ensure that adequate controls are in place to manage any new hazards, and to verify that existing controls have not been compromised by a process change. \r\nIncident Investigation\r\nFHR Iowa Falls has procedures to promptly investigate any incident that has resulted in, or could reasonably result in a catastrophic of a regulated substance, fire/explosion, major property damage, environmental damage, or personal injury. The procedure establishes the minimum guidelines and activities of the incident investigation program in order to reduce the likelihood of repetitive occurrences of events which could reasonably lead"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000056402,
      "SummaryText": "to catastrophic releases. Investigations will be undertaken by a team to identify the situation leading to the incident as well as any corrective actions to prevent a similar release in the future. Corrective actions are tracked until they are completed. Incident investigation reports are retained for at least five years.\r\nCompliance Audits\r\nThe facility regularly conducts audits of the provisions of RMP and PSM to verify that procedures and practices developed under the standard are adequate and are being followed. A compliance audit of each program is conducted every three years. The audits include a review of documentation and process safety information, inspection of the physical facilities, and interviews with all levels of plant personnel. The audit team develops findings that are forwarded to facility management for resolution. Findings and corrective actions taken in response to each finding are tracked until resolved.\r\nChemical-Specific Prevention Steps\r\nThe processes at the facility include hazards that must be managed to ensure continued safe operation. The PSM Program elements summarized previously apply to the denaturant process. Collectively, these program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors. In addition to PSM, the facility has instrumentation and equipment to detect, contain, and reduce the consequences of a release, including:\r\nRelease Detection \r\n-\tMonitoring equipment to detect temperature, level, and pressure changes\r\n-\tHand held air monitoring equipment with oxygen, LEL, CO and H2S monitoring sensors\r\n Release Containment/Control \r\n-\tAtmospheric relief devices\r\n-\tValves to permit isolation of the process\r\n-\tShutdown systems\r\n-\tRedundant equipment and instrumentation (i.e., uninterruptible power supply for the process control system)\r\n Release Mitigation \r\n-\tSecondary containment to contain liquid releases\r\n-\tFire suppression and extinguishing systems\r\n-\tTrained emergen"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000056402,
      "SummaryText": "cy response personnel\r\n-\tEmergency response equipment located on-site\r\n-\tFHR Personnel respond to small spills on-site\r\n4.\t  Accident History\r\nThe facility has not had any accidents reportable under RMP within the past five years.\r\n5.\tEmergency Response Program\r\nAs discussed above, FHR Iowa Falls maintains a written ICP and ERAP at the facility. The purpose of these documents is to protect worker and public safety as well as the environment. These documents address aspects of emergency response, step-by-step emergency situation assessments, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident requirements. In addition, FHR Iowa Falls has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures according to their role at the site, so that they are prepared and capable to respond up to incipient level fires or spills incident potentials. FHR Iowa Falls works with the local fire department and emergency responders to ensure the proper execution of the site plans. The emergency response program will be updated when necessary based on modifications made to facility processes. \r\n\r\n6.\tPlanned Changes to Improve Safety\r\nThe facility has been designed and constructed to meet existing construction and process safety requirements. FHR Iowa Falls continually reviews safety practices and equipment and maintenance programs are monitored on an ongoing basis. No immediate changes are scheduled at this time."
    }
  ]
}