{
  "FacilityID": 1000004337,
  "FacilityName": "Pasadena Water & Power Broadway Power Plant",
  "FacilityStr1": "85 E. State Street",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "CA",
  "FacilityZipCode": "91105",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.125430",
  "FacilityLongDecDegs": "-118.148172",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ci.pasadena.ca.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Pasadena",
  "Company2Name": null,
  "CompanyDUNS": 809839186,
  "Company2DUNS": 0,
  "OperatorName": "City of Pasadena Water & Power",
  "OperatorStr1": "45 E. Glenarm Street",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91105",
  "OperatorZipCodeExt": "3418",
  "FTE": 35,
  "OtherEPAFacilityID": "CAD981648249",
  "EPAFacilityID": "100000172396",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "800168",
  "SafetyInspectionDate": "2008-07-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-08-09 00:00:00",
  "DeRegistrationEffectiveDate": "2017-01-17 00:00:00",
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.12614,
  "FRS_Long": -118.14819,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000005280,
      "AltID": "SCR Aqueous Ammonia",
      "FacilityID": 1000004337,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000005922,
          "ProcessID": 1000005280,
          "ChemicalID": 57,
          "Quantity": 89600.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000005486,
          "ProcessID": 1000005280,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000003427,
              "Process_NAICS_ID": 1000005486,
              "SafetyReviewDate": "2007-06-26 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Uniform Building Code, Uniform Mechanical Code, Uniform Fire Code",
              "FR_Comments": null,
              "HazardReviewDate": "2009-02-26 00:00:00",
              "ChangeCompletionDate": "2010-02-26 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": "Changes to policies & procedures",
              "OpProceduresReviewDate": "2007-06-26 00:00:00",
              "TrainingReviewDate": "2007-06-26 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-06-26 00:00:00",
              "EquipmentInspectionDate": "2009-04-22 00:00:00",
              "EquipmentTested": "Completed semi annual inspection of hot air blowers",
              "ComplianceAuditDate": "2007-06-26 00:00:00",
              "AuditCompletionDate": "2009-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2003-08-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "SCR Aqueous Ammonia System",
              "_chemicals": [
                {
                  "PrimaryKey": 1000003493,
                  "PreventionProgram2ID": 1000003427,
                  "ProcessChemicalID": 1000005922
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000004337,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Pasadena Fire Department",
    "CoordinatingAgencyPhone": "6267444115",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000004337,
      "SummaryText": "This Executive Summary contains the facility's administrative and operational programs to prevent aqueous ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is 29.4% aqueous ammonia.  The following topics are addressed in this Executive Summary:\n\n* Accidental Release Prevention and Emergency Response Policies\n\n* Stationary Source and Regulated Substances Handled\n\n* Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n* Five Year Accident History\n\n* Emergency Response Program\n\n* Planned Changes to Improve Safety\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe City of Pasadena Broadway Power Plant facility, located in Pasadena, California, utilizes aqueous ammonia, 29.4% weight anhydrous ammonia, in the Unit B-3 Steam Plant Selective Catalytic Reduction (SCR) system to help maintain air quality compliance of the emission stack, specifically, reducing NOx (NO and NO2) emissions.  \n\nSenior management at the facility is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all employees and the surrounding communities.  Senior management administers the safety and environmental policies and programs.  These programs include but are not limited to forklift safety, hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturersA? documentation, Emergency Response, as well as the Risk Management Plan.\n\nThe City of Pasadena Broadway Power Plant facility has independently coordinated emergency response efforts with the local Fire Department.  In the case of an ammonia related emergency, it is the policy of the City of Pasadena Broadway Power Plant to evacuate the employees and to allow the fire department/HazMat team to respond to the emergency.  If an ammonia release could potentially impact the local community, a Commun"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000004337,
      "SummaryText": "ity Notification Plan would be activated. If an ammonia release were to extend into the neighboring community, a Shelter In Place plan would go into effect.  \n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe City of Pasadena Broadway Power Plant facility is located at 85 E. State Street in Pasadena, California. The facility is located at Glenarm Street and Arroyo Parkway at the northern end of the 110 freeway.  The area immediately surrounding the facility is urban with a mixture of commercial, industrial, and residential areas.     \n\nIn the aqueous ammonia process, the liquid aqueous ammonia is pulled from the tank through the ammonia shut off valve by two pumps.  It then travels through double walled piping, underground, to the first level of the Broadway Power Plant.  There it flows through a strainer manifold and then travels up to the fifth level where it flows through a back pressure regulator control valve, a flow control valve to the vaporizer and then the injection grid.  The catalyst bed provides the surface area for the SCR reactions to occur.\n \nThe ammonia shut off valve remains open based on several permissive conditions including, but not limited to boiler load, reactor temperature, ammonia storage tank level, and metering pump operation.  The aqueous ammonia is mixed with compressed air prior to entering the vaporizer where it is mixed with hot blower air and then fed to either the economizer superheat-side or the economizer reheat-side of the ammonia injection grid in the combustion exhaust stack.\n\nThe NOx in the flue gas reacts with ammonia in the SCR reactor catalyst layers to form harmless elemental nitrogen and water.  The elemental nitrogen and water remain in the flue gas as it passes through the stack to the atmosphere.  The SCR reactor is designed for a NOx reduction efficiency of 89.3% when firing natural gas.\n\nThe SCR system is equipped with various automatic process controls which ensure safe and efficient operation of the SCR reactor, vap"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000004337,
      "SummaryText": "orizer, metering pumps, shut-off and regulating valves.  In addition, pressure relief valves automatically engage in the event the system experiences a very high pressure situation.  In case of an ammonia leak, four ammonia sensing devices will provide an alarm locally and in the control room.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe storage of aqueous ammonia at the City of Pasadena Broadway Power Plant is governed by many safety features.  Much of the safety of the processes is inherent in the policies and procedures that govern the operation of the process.  For example, the Broadway Plant operates in accordance with the California Accidental Release Prevention (CalARP) Program.  The aqueous ammonia system is checked by operators on a daily basis.\n\nThe Broadway Power Plant maintains tight control of the aqueous ammonia system through various process controls and monitors.  In the event that the primary engineering or administration controls at the facility fail and result in a release of aqueous ammonia, there are three mechanisms at the facility to minimize the impact:  1) ammonia vapor detectors, 2) liquid sensor, and 3) associated alarms.  There are four vapor detectors located in the following locations at the Broadway Plant: Bermed Storage Area, Feed Pump Skid, Vaporizer Area, Catalyst Expansion Joint.  The ammonia sensors activate a local alarm and an alarm in the control room that is always manned.   All ammonia detectors provide an alarm to alert operators.\n\nOther automatic protections that are designed to mitigate or prevent a release of aqueous ammonia include: a containment berm surrounding the aqueous ammonia tank is sized to hold the entire contents of the tank, double walled piping from the pumpsA? discharge to the stacks, and valves that will automatically engage to relieve pressure or vacuum (negative pressure) in the tank.\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no significant releases of ammonia t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000004337,
      "SummaryText": "hat exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material in the past five years (May 2004 through May 2009).  In addition, there have been no injuries resulting from an ammonia release, nor any releases or A?near missesA? that warranted an internal incident investigation.  \n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of Pasadena Broadway Power Plant facility has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the RMP/CalARP document, which is maintained at the facility:\n\n  1.) To save lives.\n  2.) To minimize and avoid injuries.\n  3.) To protect the environment.\n  4.) To minimize property damage.\n\nThe City of Pasadena Power Plants facility maintains a safety committee whose members include the designated Emergency Coordinator for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the RMP and CalARP regulations, as well as to incorporate facility changes.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Hazard Review, including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the City of Pasadena Broadway Power Plant facility located at 85 E. State Street in Pasadena, California. The City of Pasadena Broadway Power Plant's safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. Continue to train all employees in the facility safety plan/progra"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000004337,
      "SummaryText": "ms.\n2. Continue to have employee involvement in safety plan development.\n3. Continue employee involvement through safety team participation.\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n"
    }
  ]
}