{
  "FacilityID": 1000046338,
  "FacilityName": "Sterling Production Plant",
  "FacilityStr1": "20313 Riverside Drive",
  "FacilityStr2": null,
  "FacilityCity": "Sterling",
  "FacilityState": "CO",
  "FacilityZipCode": "80751",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08075",
  "LEPC": "Logan County LEPC",
  "FacilityLatDecDegs": "40.629806",
  "FacilityLongDecDegs": "-103.194778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "webmast@kuglercompany.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kugler Oil Company",
  "Company2Name": null,
  "CompanyDUNS": 35009810,
  "Company2DUNS": 0,
  "OperatorName": "Kugler Oil Company",
  "OperatorStr1": "PO Box 1748",
  "OperatorStr2": null,
  "OperatorCity": "McCook",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "69001",
  "OperatorZipCodeExt": "1748",
  "RMPContact": "Mike Gapp",
  "RMPTitle": "Safety Director",
  "FTE": 4,
  "OtherEPAFacilityID": "COD980452726",
  "EPAFacilityID": "100000014842",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-11 00:00:00",
  "SafetyInspectionBy": "Colorado Dept. of AG",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-03-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-08-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-08-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-08-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.62745,
  "FRS_Long": -103.19717,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000057687,
      "AltID": "Liquid Fertilizer Manufac",
      "FacilityID": 1000046338,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000058608,
          "ProcessID": 1000057687,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070431,
          "ProcessID": 1000057687,
          "ChemicalID": 56,
          "Quantity": 670000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000570431,
          "ProcessID": 1000057687,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046338,
      "SummaryText": "Sterling Production Plant\n\n\n\nThe Sterling Dealer Fertilizer Plant is located in a rural setting near the edge of the corporate limits of Sterling, Colorado.  The facility converts and blends raw feed stocks to produce a variety of liquid products to be used as agricultural fertilizer in surrounding areas.  Kugler Oil Company, the parent of SDF is a family owned corporation located in McCook, Nebraska.  The owners live in McCook, NE, surrounded by friends and neighbors who are also their customers.  The principal officers of the parent company as well as nearly all the employees at the Sterling location are all very active in the affairs of their local communities and are as interested in the health and welfare of their neighbors as they are their own families.\n\n\n\nThe facility has two large pressure vessels for the storage of Anhydrous Ammonia. Anhydrous Ammonia is delivered by semi tanker-trailers.  The equipment to receive Ammonia by rail exists, but there are no current plans to utilize it.  The various grades of fertilizers plus all the other chemicals produced and stored at this facility are not considered hazardous or are stored below the threshold amounts to be considered under Part 68 of the Risk Management Program.\n\n\n\nThe Kugler Oil Company has always been very pro-active in meeting accepted industry standards for storage and handling of the various chemicals with which they deal.  Safety is of paramount concern and to that end they hire an internal Safety Director,  provide for a Safety Committee that meets regularly and in addition contract with an outside firm for safety overview and guidance.   Part of the Management Directive for the Company safety program states that It is the intent of management that full implementation of the safety program will benefit this facility, and as such it is a high priority of the facility.  The benefits will include preventing accidents, reducing overall operating costs by reducing down time, repair costs, time and costs"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046338,
      "SummaryText": " spent in training new employees, reducing workers compensation claims costs, and increasing productivity through a better trained and motivated workforce.  To this end, it is the responsibility of management to provide a workplace free of  hazards.... By extension the safety of the community  surrounding our facilities is of as much concern as for our employees as ourselves.\n\n\n\nIn the unlikely scenario where an ammonia vapor cloud would leave the premises of the Sterling Plant, our employees are trained to inform the local population. Coordination has been effected with the Logan County Local Emergency Planning Committee (LEPC) whose agencies can provide for notification of those residents likely to be affected so that they may in turn evacuate the area. The Sterling Fire Department personnel are invited to make regular visits  to the facility to become familiar with the premises and equipment so that their response to any emergence situation would be appropriately handled.\n\n\n\nThe Kugler Company at this and all similar locations requires that all materials and procedures meet the State of Colorado and Industry Standards, ANSI K61.1, for construction of Ammonia handling facilities.  Our goal is to be a good neighbor and maintain an operation in consonance with the natural environment and the surrounding residents.\n\n\n\nSince the time of its acquisition in the late eighty's,  there have been no reportable releases (greater than 100 pounds) from this facility, in fact no accidental release of toxic materials of any amount have occurred.  It is to be noted that in the history of the Kugler Company ownership of this faciity there has been no reportable release of hazardous materials of any kind on site.   The Company attributes their training program of employees and supervisors to be key to this flawless record.  \n\n\n\nAccess to this plant is funneled through a single entrance which passes around and is in complete view of the production building.  The storage tanks are in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046338,
      "SummaryText": " plain sight of employees at this facility and are visually monitored to prevent any unauthorized access to the equipment.  Kugler Oil Company has met all SARA Title III and Tier Two and EPRCA 312 reporting requirements."
    }
  ]
}