{
  "FacilityID": 1000013710,
  "FacilityName": "Salt Lake City Water Reclamation Plant",
  "FacilityStr1": "1365 West 2300 North",
  "FacilityStr2": null,
  "FacilityCity": "Salt Lake City",
  "FacilityState": "UT",
  "FacilityZipCode": "84116",
  "Facility4DigitZipExt": "1283",
  "FacilityCountyFIPS": "49035",
  "LEPC": "Salt Lake City LEPC",
  "FacilityLatDecDegs": "40.812310",
  "FacilityLongDecDegs": "-111.930550",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.slcgov.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Salt Lake City Corportaion",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Salt Lake City Corporation - Public",
  "OperatorStr1": "1365 West 2300 North",
  "OperatorStr2": null,
  "OperatorCity": "Salt Lake City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84116",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dale A. Christensen",
  "RMPTitle": "Plant Manager",
  "FTE": 65,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000054594",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-04-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-04-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-04-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-04-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.81239,
  "FRS_Long": -111.93067,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017087,
      "AltID": "Waste Water Utilitiy",
      "FacilityID": 1000013710,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017481,
          "ProcessID": 1000017087,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020311,
          "ProcessID": 1000017087,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520311,
          "ProcessID": 1000017087,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013710,
      "SummaryText": "1.      Accidental Release Prevention and Emergency Response Policies\nWe at Salt Lake City Water Reclamation Plant are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n2.      The Facility and the Regulated Substances Handled\nOur facility's primary activities encompass processing waste water and sewage.  We have one regulated substance present at our facility.  This substance is Chlorine.  Chlorine is used for disinfection.  Our chlorine processs and storage facility is capable of a maximum inventory of 32,000.00 pounds; however, the actual quantity of chlorine on-site is limited to approximately 20,000 pounds.\n\n3.      The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with generally recognized wastewater treatment codes.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nSalt Lake City Water Reclamation Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist (combined).  The studies are undertaken by a team of qualified p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013710,
      "SummaryText": "ersonnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 08/05/2003.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Salt Lake City Water Reclamation Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nSalt Lake City Water Reclamation Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nSalt Lake City Water Reclamation Plant carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Salt Lake City Water Reclamation Plant to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of management of change procedures was performed on 08/05/2003.  Process operators, main"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013710,
      "SummaryText": "tenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Salt Lake City Water Reclamation Plant.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nSalt Lake City Water Reclamation Plant conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 09/24-25/2002.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nSalt Lake City Water Reclamation Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nSalt Lake City Water Reclamation Plant truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013710,
      "SummaryText": " selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Salt Lake City Water Reclamation Plant has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n4.      Five-year Accident History\nSalt Lake City Water Reclamation Plant has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no accidental releases have occurred during this period.\n\n5.      Emergency Response Program\nSalt Lake City Water Reclamation Plant carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\n\nTo ensure reliable operation, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\nSalt Lake City is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n6.      Planned Changes To Improve Safety\nSalt Lake City Water Reclamation Plant is committed to ensuring that each process is operated and maintained in a safe and efficient manner.  Though no changes to our covered process are planned at present, we will be evaluating our emergency response plan as well as addressing recommendations generated during our recent PHA Revalidation.  As mentioned previously, changes that affect process safety will be managed through our Management of Change Program.\n"
    }
  ]
}