{
  "FacilityID": 1000045463,
  "FacilityName": "City of El Centro Water Treatment Plant",
  "FacilityStr1": "1101 Danenber Dr.",
  "FacilityStr2": null,
  "FacilityCity": "El Centro",
  "FacilityState": "CA",
  "FacilityZipCode": "92243",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.766669",
  "FacilityLongDecDegs": "-115.56580",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of El Centro",
  "Company2Name": "N/A",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of El Centro",
  "OperatorStr1": "307 W. Brighton Ave.",
  "OperatorStr2": null,
  "OperatorCity": "El Centro",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92243",
  "OperatorZipCodeExt": null,
  "RMPContact": "Hector Mu?oz",
  "RMPTitle": "Supervisor",
  "FTE": 5,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000151113",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-21 00:00:00",
  "SafetyInspectionBy": " Department of Toxic Substance Control",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-12-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-12-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.7655,
  "FRS_Long": -115.56136,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056426,
      "AltID": "Chlorination System",
      "FacilityID": 1000045463,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000057368,
          "ProcessID": 1000056426,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068795,
          "ProcessID": 1000056426,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568795,
          "ProcessID": 1000056426,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045463,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nAccidental Release Prevention \n\n\n\nThe El Centro - WTP has developed a RMP and an Emergency Response Plan (ERP) to address CalARP Program requirements (19 CCR ?2735-2785).  The El Centro - WTP has a long standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the chlorination system.  The El Centro - WTP's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\n\n\nStationary Source and Regulated Substance \n\n\n\nThe El Centro - WTP is located at 1101 Danenberg Dr., El Centro, California 92243. The regulated substance at the facility is chlorine.  The maximum intended inventory of chlorine is 20,000 pounds (Lbs.) and it is stored in pressurized one-ton chlorine containers at ambient temperature in liquid form.  The regulated substance, chlorine, is used at the facility for water treatment purposes. \n\n\n\nHazard Assessment Summary/Offsite Consequence Analysis \n\n\n\nWorst-Case Release Scenario Results Summary:\n\nPer CalARP Regulations and US EPA RMP Regulations, one worst-case analysis has been defined and modeled for the Chlorination System.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment tab of the 2014 CalARP/RMP/PSM Program 3 Five Year Update Binder. \n\n\n\nAlternative Release Scenario Results Summary:\n\nAn alternative release scenario was modeled.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment tab of the 2014  CalARP/RMP/PSM Program 3 Five Year Update Binder.\n\n\n\nRisk Considerations\n\n\n\nAlthough the storage and use of chlorine has inherent potential risks, and worst-case release scenarios can potentially reach the community; the El Centro - WTP has recognized these potential risks and structured its safety programs to make the worst-c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045463,
      "SummaryText": "ase type of event non-credible.  In addition to the safety practices of the company and plant personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event.\n\n\n\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with a chlorine release, including the following:\n\n?    Automatic / manual shutdown\n\n?    Shut-off valves connected to each one-ton container\n\n?    If a leak is detected by chlorine sensors, the detection system, connected to a control system, will be activated and it will shut the chlorine supply.\n\n?    The facility has chlorine detectors that activate a scrubber system.\n\n?    Safety showers/eye wash stations are available for operators, if exposed to chlorine.\n\n?    Personal protective equipment (PPE) is used by plant personnel, as necessary.\n\n?    The system undergoes periodic maintenance to reduce the likelihood of catastrophic failures.\n\n\n\nAccidental Release Prevention Program \n\n\n\nAs part of the implementation of this CalARP Program, key Prevention Program elements were documented and implemented by the El Centro - WTP to manage process safety issues associated with the use of chlorine.  Furthermore, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.\n\n \n\nMaximum Intended Inventory\n\nNote: A 1-ton container of chlorine will contain at a maximum 2,000 pounds.\n\nOn Line    Two (2) - 1-ton Containers = 4,000 pounds\n\nStan By    Two (2)- 1-ton Containers = 4,000 pounds\n\nStorage (cradles)    Six (6) 1-ton Containers  = 12,000 pounds\n\nMaximum Intended Inventory    20,000 (10 Containers)\n\n\n\nAs illustrated above, the covered process has more than the 2,500-lb threshold quantity f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045463,
      "SummaryText": "or US EPA RMP, the 1,500-lb threshold quantity for Cal/OSHA PSM threshold quantities, and the 100-lb state threshold for CalARP Program.  As a result, the chlorine covered process is subject to CalARP Program Level 3, US EPA RMP Program Level 3, and Cal/OSHA PSM.  \n\n\n\nThe Prevention Program 3 elements include:\n\n?Process Safety Information\n\n?Process Hazard Analysis\n\n?Operating Procedures\n\n?Training\n\n?Mechanical Integrity\n\n?Management of Change\n\n?Pre-Startup Safety Review\n\n?Compliance Audits\n\n?Incident Investigation\n\n?Employee Participation\n\n?Hot Work Permit\n\n?Contractors\n\n\n\nIn addition, key emergency response elements were addressed in Section 4.7 of this document. \n\n\n\n\n\nFive-Year Accident History \n\n\n\nFor any accidental release meeting the five-year accident history reporting criteria of 19 CCR ?2750.9, the owner or operator shall submit the data required under 19 CCR ?2745.5, ?2745.6, and ?2745.7 with respect to that accident within six months of the release or by the time the RMP is updated under 19 CCR ?2745.10, whichever is earlier.  From 19 CCR ?2750.9: \n\nThe owner or operator shall include in the five-year accident history all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nThere have been no CalARP-applicable releases of chlorine at the El Centro - WTP in the past five years.\n\n\n\n\n\nEmergency Response Program\n\n\n\nThe El Centro - WTP is not a First Responder Facility.  The Facility has implemented an Emergency Action Plan (EAP) that meets the requirements of the California Code of Regulations, Title 8, Section 3220 (8 CCR ?3220) and does not assume the role of first responder during an emergency.  Employees are trained to evacuate and call 9-1-1.  \n\nThe El Centro - WTP has submitted a Hazardous Materials Business Plan in order to coordinate with the local emergency planning and respons"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045463,
      "SummaryText": "e agencies to ensure that in an event of an emergency they are properly prepared and have knowledge of the system.  The Facility will coordinate with local Fire Department and First Responders.  They are trained and fully equipped to respond to hazardous material releases  \n\n\n\nThe El Centro - WTP maintains the EAP that provides the response protocols and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures, which have been implemented to respond effectively to emergency situations that may arise at the facility.  The EAP is reviewed and updated at least once per year to ensure compliance with CalARP and EAP regulations.  Key elements of the EAP include:\n\n?Emergency Alarm Procedures\n\n?Evacuation Procedures\n\n?Safety and Health Considerations\n\n?Notification Procedure\n\n\n\nExternal Events Analysis Information\n\n\n\nPursuant to the requirements of 19 CCR ?2745.6(l); the following external events analysis information shall be submitted:\n\n?The types of natural and human caused external events considered in the Process Hazard Analysis (PHA) 19 CCR ?2760.2 or Hazard Review 19 CCR ?2755.2.  \n\noDuring the December 3, 2014 PHA, plausible events were considered.  General events external to the facility that can conceivably cause a release of chlorine were addressed.  For detail information, refer to PHA Report located within the PHA Section Tab of the 2014 CalARP/RMP/PSM Program 3 Five-Year Update Binder.\n\n\n\n?The estimated magnitude or scope of external events which were considered.  If not known, the owner or operator of the stationary source shall work closely with the AA to determine what is required.  If seismic events are applicable, the parameters used in the consideration of the seismic analysis and which edition of the Uniform Building Code was used when the process was designed.\n\noA seismic safety walk-down was performed on March 3, 2014.  All findings are documented in the \"Seismic Assessment\" report located within the 2014 CalARP/R"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000045463,
      "SummaryText": "MP/PSM Program 3 Five-Year Update Binder.\n\noThe magnitudes of the external events considered are detailed within the PHA Worksheets and were qualitatively risk-ranked by the PHA Team.\n\n\n\n?For each external event, with a potential to create a release of a regulated substance that will reach an endpoint offsite, apply \n\n1)The expected date of completion of any changes resulting from the PHA\n\n2)Major hazards identified;\n\n3)Process controls in use;\n\n4)Mitigation systems in use;\n\n5)Monitoring and detection systems in use; and,\n\n6)Changes since the last PHA\n\n\n\noRefer to Section 7.4 section of the RMPe*submit, under PHA, for the required information.\n\n?The date of the most recent field verification that equipment is installed and maintained as designed.\n\n\n\noThe most recent field verification that equipment was installed and maintained as designed was performed on January 16, 2014.  Chlorine contractor visits the facility on annually basis to perform a deep maintenance to all the chlorination equipment.  They change all the main parts of the equipment and ensure system is functions properly.  It includes, chlorinators, injectors, working valves, kits and cleaning.  Contractor also visits the facility on an as-needed basis.   \n\n\n\noIn addition, facility operators perform daily and weekly rounds to the system.  Records are kept by the WTP Supervisor.\n\n\n\nPlanned Changes To Improve Safety \n\nThe PHA study has been conducted to examine mitigation measures to improve safety at the facility.  Planned changes to improve safety are listed as recommendations in the December 4, 2014 PHA Report located behind the PHA Tab of the 2014 CalARP/RMP/PSM Program 3 Five-Year Update Binder.\n\n\n\nFlammables: Worst Case \n\nThe use of flammable materials at the El Centro - WTP is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable. \n\n\n\nFlammables: Alternative Release \n\nThe use of flammable materials at the El Centro - WTP is not encompassed by eit"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000045463,
      "SummaryText": "her the federal or state RMP requirements.  Therefore, this section is not applicable. \n\n"
    }
  ]
}