{
  "FacilityID": 1000063046,
  "FacilityName": "Kraft Heinz Company Kirksville",
  "FacilityStr1": "2504 North Industrial Road",
  "FacilityStr2": null,
  "FacilityCity": "Kirksville",
  "FacilityState": "MO",
  "FacilityZipCode": "63501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29001",
  "LEPC": "Adair County LEPC",
  "FacilityLatDecDegs": "40.219515",
  "FacilityLongDecDegs": "-92.590939",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4318846,
  "ParentCompanyName": "Kraft Heinz Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kraft Heinz Company Kirksville",
  "OperatorStr1": "2504 North Industrial Road",
  "OperatorStr2": null,
  "OperatorCity": "Kirksville",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63501",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert M. Sullivan",
  "RMPTitle": "Operational Risk Manager",
  "FTE": 467,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000158241",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-12-14 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-04-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.21784,
  "FRS_Long": -92.59222,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "51",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079125,
      "AltID": "Refrigeration",
      "FacilityID": 1000063046,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000080287,
          "ProcessID": 1000079125,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098552,
          "ProcessID": 1000079125,
          "ChemicalID": 56,
          "Quantity": 65292.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598552,
          "ProcessID": 1000079125,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063046,
      "SummaryText": "RISK MANAGEMENT PLAN - EXECUTIVE SUMMARY\n\nKRAFT HEINZ COMPANY\n\nKirksville, Missouri\n\n\n\n\n\n1.0    Accidental Release Prevention and Emergency Response Policies [40 CFR 68.155(a)]\n\n\n\nThe Kraft Heinz Company has a policy to adhere to all applicable federal, state and local environmental regulations.  Facility management regards employee and public safety as a very serious matter and have taken several precautions to maintain a safe working and public environment.  The Kirksville facility has an excellent record in preventing releases of anhydrous* ammonia and has a thorough emergency training program for on-site emergency responders. This facility has implemented an electronic preventive maintenance system.  This is a system that uses a real time database to track training and inspection dates and issue reminders to responsible groups.\n\n\n\nThe emergency response policies at the Kirksville facility ensure that there is emergency response coverage 24 hours - 7 days per week.  There are also adequate provisions for coordination with outside agencies such as with the Kirksville Fire Department in the event of an emergency.\n\n\n\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\n\n\n\n\n2.0    Process Description and Regulated Substances [40 CFR 68.155(b)]\n\n\n\nThe Kraft Heinz Company is located at 2504 North Industrial Road, Kirksville, MO.  The Kirksville facility is a manufacturer of meat products, specifically, lunch meats. The North American Industry Classification System (NAICS) code for the primary process at this facility is (311612). The facility is capable of producing, cooking and packaging various sliced lunch meat products. These products include turkey, ham and bologna for consumer intake. Many areas of the plant are refrigerated to preserve the meat products. Some of these areas include raw material receiving, product staging, product processing, brine mixing, and other storage areas. The Kirksville facility has one regulated subst"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063046,
      "SummaryText": "ance under 40 CFR 68: ammonia. Ammonia is used as a cooling agent in the onsite refrigeration process. The ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds and the facility stores ammonia quantity greater than 10,000 lbs. Thus, 40 CFR 68 is applicable to the Kirksville facility.\n\n\n\nDue to the recent expansion at the Kirksville facility more ammonia was added for the additional refrigeration systems.  Though the expansion project required an additional quantity of ammonia, the existing ammonia refrigeration system has the single largest container holding ammonia.  Therefore, the worst case and alternative case scenarios did not change.  The current modeling data and Risk Management Plan was reviewed and then re-modeled using United States Environmental Protection Agency's (USEPA's) RMP*Comp (TM).  The appropriate information was updated in the Risk Management Plan.\n\n\n\nThe ammonia refrigeration systems have associated hazards that can potentially affect on-site employees and the general public if there is a release from either system. Although the alternative release scenario is more probable, the US EPA requires that one worst-case and one alternative release scenario is reported for each regulated chemical. Described below are the associated hazards.\n\n\n\nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1989.  The dominant characteristic of this chemical is its toxicity.  It is a self-alarming chemical by its distinctive pungent odor.  Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations.  Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature.  It is not poisonous, but it is corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause severe burns.\n\n\n\nThe risks to persons in an accidental release of ammonia include:\n\n1.    Irritation of respiratory tr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063046,
      "SummaryText": "act,\n\n2.    Corrosive attack of skin and other tissue,\n\n3.    Freezing of skin and other body tissue when contacted by liquid ammonia.\n\n\n\n\n\n3.0    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps [40 CFR 68.155(c)]\n\n\n\nThe majority of the refrigeration piping is on the roof.  The Kirksville facility has developed an OSHA PSM program for their ammonia refrigeration system.  Ammonia falls under the RMP Program 3 prevention program which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is compliance with RMP Program 3 prevention program.  Thus, the Kirksville facility ammonia PSM has been reviewed and determined to be complete for the RMP document.  \n\n\n\nThere are several aspects of the prevention program that are key and the plant maintains good training, certification and employee awareness of operating procedures.\n\n\n\n\n\n4.0    Five-year Accident History [40 CFR 68.155(d)]\n\n\n\nThe Kraft Heinz Company has an excellent record of preventing accidental releases over the last 5 years. Due to our release prevention policies, there has been no accidental release as defined in 40 CFR 68.42(a) during this period.\n\n\n\n\n\n5.0    Emergency Response Program [40 CFR 68.155(e)]\n\n\n\nThe Kirksville facility has an Emergency Response Plan which is called the Emergency Action plan (EAP). The EAP describes response procedures to minimize hazards to human health and the environment in the event of an accidental anhydrous ammonia release. Aspects of emergency response include HAZWOPER trained technicians to minimize a release, adequate first aid and medical treatment, evacuations, notifications of local emergency response agencies and the public, as well as post incident procedures for anhydrous ammonia exposure, and the procedures to inform authorities and the public are described in the EAP. A general practice drill is performed at least annually. A site map, SDSs, and list of chemicals are kept alongside the E"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000063046,
      "SummaryText": "AP. The Kirksville Fire Department tours the plant twice a year. \n\n\n\n\n\n6.0    Planned Changes to Improve Safety [40 CFR 68.155(f)]\n\n\n\nSeveral developments and findings have resulted from the implementation of the various elements of the Kirksville facility's accidental release prevention program. Continued training, and program reviews are some of the major steps the Kirksville facility wants to implement to improve plant safety. These changes are expected to be implemented in a timely manner.\n\n"
    }
  ]
}