{
  "FacilityID": 1000078865,
  "FacilityName": "Livingston Regional Water Supply System",
  "FacilityStr1": "4253 FM 350 South",
  "FacilityStr2": null,
  "FacilityCity": "Livingston",
  "FacilityState": "TX",
  "FacilityZipCode": "77351",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48373",
  "LEPC": "Polk County LEPC",
  "FacilityLatDecDegs": "30.692500",
  "FacilityLongDecDegs": "-095.020556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.trinityra.org",
  "FacilityEmailAddress": "trinity@trinityra.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Trinity River Authority of Texas",
  "Company2Name": null,
  "CompanyDUNS": 43810290,
  "Company2DUNS": 0,
  "OperatorName": "Trinity River Authority of Texas",
  "OperatorStr1": "5300 South Collins",
  "OperatorStr2": null,
  "OperatorCity": "Arlington",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76018",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dewayne Coburn",
  "RMPTitle": "Mgr., So. Region Support Services",
  "FTE": 6,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000071628",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-02-07 00:00:00",
  "SafetyInspectionBy": "Hazard Risk Analysis, LLC",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.69246,
  "FRS_Long": -95.02238,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000098363,
      "AltID": "Water Treatment System",
      "FacilityID": 1000078865,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099604,
          "ProcessID": 1000098363,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000123392,
          "ProcessID": 1000098363,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000623392,
          "ProcessID": 1000098363,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078865,
      "SummaryText": "INTRODUCTION\n\n\n\nThe Trinity River Authority of Texas (TRA) is a political subdivision charged by legislative mandate with three functions.  These include the maintenance of a Master Plan for basin-wide development, serving as a local sponsor for federal water projects, and providing services authorized by the Texas Legislature within TRA's defined territory that includes all or part of seventeen counties encompassing approximately 17,500 square miles. \n\n\n\nTRAs greatest impact to the general public is ownership and operation of several large water and wastewater treatment facilities.  TRA provides essential services to a significant portion of the public in the Dallas/Fort Worth metropolitan area and to several cities around Lake Livingston.  As the operator of these facilities, it is TRA's duty to inform the public about efforts to prevent and, if necessary, respond if a hazardous substance were inadvertently released from one of our treatment facilities.  \n\n\n\nTRA's Livingston Regional Water Supply System (LRWSS) began supplying treated water to the City of Livingston in July of 1981.  Raw water for this project is supplied by nearby Lake Livingston.  In 1991 the plant was expanded to serve the nearby Polunsky Prison Unit.  This expansion increased the plant's current design capacity to three million gallons per day.  The Livingston treatment facility produces water of the highest quality, meeting or exceeding the standards set by the Texas Commission on Environmental Quality and the Environmental Protection Agency.\n\n\n\n\n\nRISK MANAGEMENT PROGRAM\n\n\n\nAs a result of federal requirements, 40 CFR Part 68, Accidental Release Prevention Program (ARPP), the LRWSS is required to develop and implement a Risk Management Program (RMP) Program Level 2 due to the quantity of chlorine that it uses in its treatment process.  In developing its RMP, LRWSS has conducted an analysis of potential offsite consequences of an accidental release including a worst-case and alternative case re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078865,
      "SummaryText": "lease scenario.  In addition, the facility has compiled a five-year accidental release history, a release prevention program and an emergency response program.  The LRWSS has an outstanding safety record and there have been no accidents related to the chlorine process in the past five years.\n\n\n\nPREVENTION PROGRAMS\n\n\n\nLRWSS places the highest emphasis on safety and hazard prevention.  To this end, we have developed a comprehensive prevention program that includes the following key points:\n\n\n\n- Annual training is required by all operations and maintenance employees who work in and around hazardous chemical storage and loading areas.\n\n\n\n- Visual inspections of these covered processes are conducted by operations personnel on each shift.\n\n\n\n- Sensors and alarms are in place around all process areas to detect any leakage of the hazardous chemicals.\n\n\n\n- Hoist system has been improved to reduce hazard of moving 1 ton cylinders and delivery ingress and egress improved.\n\n\n\n- Written operating procedures are continuously updated and maintained for operations personnel to use during their work routines.\n\n\n\n- All accidents are investigated promptly with written documentation of all findings.  These accident investigations are reviewed by management and Certified Safety Professionals to determine cause and prevention.\n\n\n\n- Monthly safety audits are conducted of all plant process areas including covered process areas.  Written documentation of these monthly audits, including actions taken to correct problems, is maintained for a minimum of five years.\n\n\n\n- Preventative maintenance programs for covered processes are in place and a computerized records management system is in place to automatically generate reports regarding preventative maintenance needs and/or histories on all covered process equipment. \n\n\n\n- Project personnel on various safety issues that are pertinent to covered processes conduct monthly safety meetings.\n\n\n\nThese above procedures have resulted in a greater awar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078865,
      "SummaryText": "eness of operation limits and emergencies and have resulted in a much safer work place thereby benefiting employees and the general public.\n\n\n\nEMERGENCY RESPONSE\n\n\n\nAdditionally, our Emergency Response Plans are in place to outline actions to take should an accidental release occur.  The plans have been reviewed by the local Fire Departments and local Emergency Planning Committees.\n\n\n\nCOMMITMENT TO SAFETY AND OUR COMMUNITY\n\n\n\nTRA's continued commitment to the safety of our facilities and our communities is illustrated by our continuous improvement process.  Our facilities continue to take advantage of updated technology and advancements in the way we operate.  This includes site security.  Recent facility upgrades have included perimeter monitoring, security cameras, and policies and procedures to ensure access to our facilities is by authorized personnel only."
    }
  ]
}