{
  "FacilityID": 1000080334,
  "FacilityName": "National Frozen Foods Corporation",
  "FacilityStr1": "436 NW State Ave",
  "FacilityStr2": null,
  "FacilityCity": "Chehalis",
  "FacilityState": "WA",
  "FacilityZipCode": "98532",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53041",
  "LEPC": "Lewis County LEPC",
  "FacilityLatDecDegs": "46.665556",
  "FacilityLongDecDegs": "-122.972500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "dtobias@nffc.com",
  "FacilityDUNS": 9262064,
  "ParentCompanyName": "Pasco Acquisitions",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "National Frozen Foods Corporation",
  "OperatorStr1": "188 Sturdevant Rd",
  "OperatorStr2": null,
  "OperatorCity": "Chehalis",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98532",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000066224",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "SWCAA 1652",
  "SafetyInspectionDate": "2017-08-09 00:00:00",
  "SafetyInspectionBy": "State Labor & Industries Region 4",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-02-15 12:52:20",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-11 19:16:41",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-11 19:16:41",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 46.664863,
  "FRS_Long": -122.972412,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100294,
      "AltID": "ammonia",
      "FacilityID": 1000080334,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125633,
          "ProcessID": 1000100294,
          "ChemicalID": 56,
          "Quantity": 49950.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101542,
          "ProcessID": 1000100294,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084683,
              "Process_NAICS_ID": 1000101542,
              "SafetyReviewDate": "2019-05-14 00:00:00",
              "PHA_Date": "2018-04-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fans are in place to help regulate temperature in the compressor room.",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "High and low level visual and audible alarms on vessels outside of compressor room.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-01-23 00:00:00",
              "TrainingReviewDate": "2019-01-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-04-15 00:00:00",
              "EquipmentInspectionDate": "2019-05-17 00:00:00",
              "EquipmentTested": "Refrigeration vessel inspection: boilers, compressors, condensors",
              "ChangeMgmtDate": "2017-06-18 00:00:00",
              "ChangeMgmtReviewDate": "2019-04-03 00:00:00",
              "PreStartupReviewDate": "2019-02-20 00:00:00",
              "ComplianceAuditDate": "2019-05-17 00:00:00",
              "AuditCompletionDate": "2020-05-01 00:00:00",
              "IncidentInvestigationDate": "2009-10-07 00:00:00",
              "InvestigationChangeDate": "2009-10-07 00:00:00",
              "ParticipationPlansReviewDate": "2019-01-16 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-27 00:00:00",
              "ContractorSafetyReviewDate": "2019-01-02 00:00:00",
              "ContractorSafetyEvalDate": "2019-02-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000105556,
                  "PreventionProgram3ID": 1000084683,
                  "ProcessChemicalID": 1000125633
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080334,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-05-08 00:00:00",
    "ERTrainingDate": "2019-05-15 00:00:00",
    "CoordinatingAgencyName": "Chehalis Fire Department & LEPC",
    "CoordinatingAgencyPhone": "3607483394",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Department of Homeland Security 6 CFR 27.400"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080334,
      "SummaryText": "NATIONAL FROZEN FOODS CORPORATION\r\nCHEHALIS, WASHINGTON\r\n\r\nRISK MANAGEMENT PLAN\r\nEXECUTIVE SUMMARY\r\n\r\n\r\nBackground Data\r\n \r\nUnder Section 112(r)(7) of the Clean Air Act, and in accordance with Title 40 of the code of Federal Regulations, Chapter 68 (40 CFR 68), promulgated by the Environmental Protection Agency (EPA), National Frozen Foods Corporation (National) submits this Risk Management Plan (RMP) for operations at their State Ave facility in Chehalis, Washington. National's operations include the processing, freezing, and packaging of vegetables such as peas, corn and carrots for public consumption. National has been in operation at this facility since 1927, providing quality frozen vegetables and over 400 jobs to the local community.\r\n\r\n\r\nAccidental Release Prevention and Emergency Response Policy\r\n\r\nNational is committed to protecting the health of its employees, the surrounding community, and the environment; therefore, it is National's policy to manage a safe and healthy workplace, protect the environment and maintain compliance with safety, health, and environmental regulations: 40 CFR 68 as well as Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations, Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA's Hazardous Operations and Emergency Response regulations (29 CFR 1910.120).\r\n\r\n\r\nStationary Sources and Regulated Substances\r\n\r\nNational is subject to Section 112(r) of the Clean Air Act because ammonia, a regulated substance, is present at the facility in amounts greater than 10,000 pounds. National is required to maintain low temperatures in the food processing areas of the plant that are within standards required by the United States Department of Agriculture (USDA) to ensure quality in the final products. National uses anhydrous ammonia (the 112(r) regulated substance) as a refrigerant to maintain the facility within the required range of operatin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080334,
      "SummaryText": "g temperatures. Anhydrous ammonia is an industry-standard refrigerant for refrigeration facilities. National's refrigeration system, consisting of receivers, compressors, evaporators, condensers, and piping, can contain a maximum amount of 49,950 pounds of anhydrous ammonia at certain times during the process season; normal working capacity is far less than this amount.\r\n\r\n\r\nAccidental Release Prevention Program\r\n\r\nThe last major upgrade of the refrigeration facility occurred in 2015, when everything was designed according to the existing ANSI/IIAR Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigerating Systems. To prevent and mitigate accidental releases of anhydrous ammonia, National has implemented several precautionary measures, such as process/equipment controls, standard operating procedures (SOPs), preventative maintenance programs, employee training, and audit programs.\r\n\r\nNational has developed and implemented a PSM program pursuant to OSHA regulations and as such, has evaluated the system for the potential of anhydrous ammonia releases. Some of the controls installed to prevent catastrophic releases of ammonia are process equipment (vents, pressure relief valves, backup pumps, and remote shutoffs) and automated controls (automatic shut-offs and electrical distribution system grounding), National has developed standard operating procedures for all employees and contractors that have contact with the ammonia refrigeration system. The SOPs incorporate safety measures into the procedures, and were developed by refrigeration system operators. They are reviewed on a yearly basis by means of a SOP review session. Process safety information for the refrigeration system is reviewed during non-processing season months. Each refrigeration operator on each shift conducts daily safety meetings with employees under their responsibility. National encourages employee participation in development of the control measures used at the plant by mea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080334,
      "SummaryText": "ns of newsletters and training sessions. Pursuant to written management of change procedures established by National, any changes to the operating procedures are to be communicated to affected employees.\r\n\r\nNational understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore, National has implemented a preventive maintenance program. The preventive maintenance program is scheduled, documented and managed to ensure that regular maintenance occurs on the system.\r\n\r\nTo ensure that National's control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system.\r\n\r\n- In accordance with the PSM program, National conducts detailed PSM compliance audits every 3 years. Each audit incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\r\n\r\n- In addition, National is audited by the Chehalis Fire Department annually. National is audited by the USDA and FDA on a yearly basis.\r\n     - The department of Ecology, Air Quality, inspects on a yearly basis. \r\n- National's insurance carrier also conducts independent audits on a yearly basis.\r\n- The Washington Industrial Safety and Health Act (WISHA) Division of the State Department of Labor and Industry conducts audits once every three years.\r\n- Food Safety Audits are conducted by many different independent organizations throughout the year.\r\n\r\n\r\nFive-Year Accident History\r\n\r\nOver the last 5 years, National has not experience an accidental release of anhydrous ammonia from the ammonia refrigeration system causing any on-site death, injury or significant property damage, or known off"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080334,
      "SummaryText": "-site death, injury, property damage, environmental damage, evacuations, or sheltering in place.\r\n\r\n\r\nEmergency Action Program\r\n\r\nNational has developed a comprehensive emergency action program designed to protect both employees and the community in the event of a release. This program is fully described in Section 12 of the Risk Management Program and is titled Emergency Action Plan. \r\n\r\nTo assure that the local governmental response agencies are familiar with National's emergency response procedures, National has submitted copies of the Emergency Action Plan for review and approval by the following agencies:\r\n\r\n- Chehalis Fire Department\r\n- Lewis County LEPC\r\n\r\nTo plan for an ammonia release with offsite effects, National's Emergency Action Plan includes procedures to mitigate the release, procedures to inform local response agencies, transportation maps for response agencies, evacuation route maps, and procedures for public communication.\r\n\r\nIn the event of an anhydrous ammonia release with offsite effects, the general public will be warned by police and fire vehicles equipped with public address systems.\r\n\r\n\r\nContinuous Efforts to Improve Safety\r\n\r\nAs a result of National's initial process hazard analyses and as part of National's continuous efforts to improve the performance of its safety systems, ongoing training and communication is planned at the facility to improve safety and prevent anhydrous ammonia releases. \r\n\r\n- On going communication with Lewis County  LEPC, Chehalis Fire Department, on our Emergency Action Plan. National hosted an eight hour HAZWOPER refresher training course annually, in which the local fire department, district fire departments and the LEPC were invited and attended.\r\n\r\n- National has a plant defense policy which includes security training for managers and employees. The program is reviewed and updated annually. The most recent review May 17, 2019.  \r\n\r\n- National was audited by the Department of Homeland Security on CAST in July 2"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080334,
      "SummaryText": "018."
    }
  ]
}