{
  "FacilityID": 1000090682,
  "FacilityName": "Costco Wholesale - Salt Lake City",
  "FacilityStr1": "5995 West 300 South",
  "FacilityStr2": null,
  "FacilityCity": "Salt Lake City",
  "FacilityState": "UT",
  "FacilityZipCode": "84104",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49035",
  "LEPC": "Salt Lake City LEPC",
  "FacilityLatDecDegs": "40.760899",
  "FacilityLongDecDegs": "-112.028633",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.costco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 35520639,
  "ParentCompanyName": "Costco Companies, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Costco Wholesale",
  "OperatorStr1": "5995 West 300 South",
  "OperatorStr2": null,
  "OperatorCity": "Salt Lake City",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84104",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dan Wells",
  "RMPTitle": "Depot Manager",
  "FTE": 270,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000193505",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-03-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-11-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-11-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-11-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-11-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112749,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000090682,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000114082,
          "ProcessID": 1000112749,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140891,
          "ProcessID": 1000112749,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000640891,
          "ProcessID": 1000112749,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090682,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe Costco Wholesale facility has an emergency action plan in effect.  The Emergency Action Plan (EAP) is summarized in the Emergency Planning and Response section of Costco Wholesale's PSM/RMP document.  This EAP was designed to meet the following objectives:\n\n\n\n1.) To save lives.\n\n2.) To minimize and avoid injuries.\n\n3.) To protect the environment.\n\n4.) To minimize property damage.\n\n\n\nCostco maintains a safety committee whose members are the designated emergency coordinators for the facility.  The EAP provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This EAP will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\n\n\nCostco Wholesale has coordinated emergency response efforts with the local fire department, the Salt Lake City Fire Department.  In the case of an ammonia-related emergency, it is the policy of Costco Wholesale to evacuate the employees and to allow the responders to respond to the emergency (potentially with the assistance of trained facility personnel).  The refrigeration contractor will be available for guidance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nCostco Wholesale began operation of the ammonia system in November 2005.  The ammonia system at the Costco Wholesale facility consists primarily of vessels, compressors, a condenser, evaporators and associated piping.  The majority of the equipment is located inside the engine room.  The system is a closed loop refrigeration system similar to a residential refrigerator.  There are no emissions or planned releases of ammonia.\n\n\n\nThe Costco Wholesale facility provides cold storage space and a cross docking area for refrigerated items.  Ammonia sensors are located in the Engi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090682,
      "SummaryText": "ne Room and Warehouse that alert facility personnel and activate the ventilation system in the Engine Room and close all feed lines out of the Engine Room.  The ammonia detection system also has the capability to shut-off all electrical power to the Engine Room.  \n\n\n\nThe maximum intended inventory of ammonia is 15,000 pounds.  \n\n\n\nRefrigeration process equipment at the facility operates continuously.  Compressors and the condenser cycle on and off to comply with system demand during operation.  The ammonia refrigeration system provides cooling for two cold storage areas (+28A?F Meat Cooler and +35A?F Cross Dock) and the Engine Room (+70A?F).  The majority of the system equipment is located in the ammonia Engine Room.  The condenser is mounted on the Engine Room roof, the water diffusion tank is located outside the Engine Room, and the evaporators are placed in the cold storage areas or the Engine Room. \n\n\n\nRISK MANAGEMENT PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Costco Wholesale ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with OSHA's Process Safety Management (PSM) regulation and EPA's Risk Management Program (RMP).  The facility also maintains a contract with a professional refrigeration service firm to conduct preventative maintenance and any necessary repairs.\n\n\n\nAmmonia detectors are strategically located in the Engine Room and the Warehouse.  In case of ammonia detection, visible and audible alarms will activate at the facility and at the computer system.\n\n\n\nIn the event of a power failure, ammonia operations would automatically shut-down (solenoid valves close, compressors shut-down, condenser fans and water pumps shut-down, evaporator fans shut-down, etc.), thereby limiting the possibility of any ammonia releases. \n\n\n\nThe system also incorporates a pressure relief system"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090682,
      "SummaryText": ".  In the event of over-pressurization, vessels will vent to a common header which relieves, via an emergency refrigerant control box, to an outside water diffusion tank until the system pressure decreases sufficiently to reseat the valves.  This mechanism prevents vessels from rupturing in case they become over pressurized.\n\n\n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted during daily walk-throughs by Costco Wholesale, and repaired immediately.\n\n\n\nIn addition to the Uniform Mechanical Code, Costco Wholesale has developed a preventive maintenance program that utilizes the services of a professional refrigeration contractor to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.  This program is implemented throughout the company.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nAn investigation into Costco Wholesale's accident history revealed that there was one release of ammonia in the previous five years (September 2015 - September 2020) that meets the EPA RMP definition of \"accident\".\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nCostco Wholesale has an emergency action plan in effect at the facility.  The Emergency Action Plan (EAP) is detailed in the Emergency Planning and Response section of this PSM/RMP document, which is maintained at the facility.  Emergency response activities are coordinated with the Salt Lake City Fire Department and the local fire houses.  In case of a major ammonia emergency, the facility will first call 9-1-1 to alert the local Police and Fire Departments.  Other responders will be called as needed.  If a release exceeds the federal reporting"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000090682,
      "SummaryText": " quantity of 100 pounds for ammonia, calls will be made to the following organizations:  the National Response Center and within 15 minutes, the Utah Department of Public Safety Division of Emergency Services and Homeland Security, the EPA Region 8 Main Office, and the Utah State Emergency Response Commission, by calling the Environmental Response and Remediation Division.\n\n\n\nCostco Wholesale maintains a safety committee whose members are the designated emergency coordinators for the facility.  The EAP provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  The EAP is reviewed and updated at least once per year.  This EAP will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to renovation of the facility.\n\n\n\nCostco Wholesale will be responsible for evacuating and ensuring the safety of its employees and will coordinate emergency response efforts with the fire department and its refrigeration contractor on a periodic and ongoing basis.  The facility holds evacuation drills at least once per year.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazard Analysis (PHA) revalidation was conducted on September 24, 2020.  This document includes the results using the IIAR What IF Checklist. In 2019 an independent Mechanical Integrity Inspection was completed.  These studies were performed to define potential hazards associated with operational deviations of the ammonia system. The Costco Wholesale facility is committed to safety and as part of a continual effort to provide a safe work environment for its employees Costco Wholesale continues to train all employees on the facility Emergency Action Plan, continues to involve employees in soliciting safety suggestions, continues to involve employees through safety team "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000090682,
      "SummaryText": "participation and continues to perform internal and external safety audits and inspection as needed. \n\n"
    }
  ]
}