{
  "FacilityID": 1000044654,
  "FacilityName": "Wilbur-Ellis Company, Colusa",
  "FacilityStr1": "7254 Farinon Road",
  "FacilityStr2": null,
  "FacilityCity": "Colusa",
  "FacilityState": "CA",
  "FacilityZipCode": "95932",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06011",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "39.180908",
  "FacilityLongDecDegs": "-121.997747",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6913479,
  "ParentCompanyName": "Wilbur-Ellis",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wilbur-Ellis Company",
  "OperatorStr1": "7254 Farinon",
  "OperatorStr2": null,
  "OperatorCity": "Colusa",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95932",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Heier",
  "RMPTitle": "Branch Manager",
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045499",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-29 00:00:00",
  "SafetyInspectionBy": "Colusa County Environmental Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-09-12 00:00:00",
  "DeRegistrationEffectiveDate": "2016-03-16 00:00:00",
  "AnniversaryDate": "2019-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.18,
  "FRS_Long": -121.99194,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Source no longer uses Anhydrous Ammonia",
  "_processes": [
    {
      "ProcessID": 1000055204,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 1000044654,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056061,
          "ProcessID": 1000055204,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067315,
          "ProcessID": 1000055204,
          "ChemicalID": 56,
          "Quantity": 100320.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567315,
          "ProcessID": 1000055204,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000055205,
      "AltID": "24% Aqua Ammonia Storage",
      "FacilityID": 1000044654,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056062,
          "ProcessID": 1000055205,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067316,
          "ProcessID": 1000055205,
          "ChemicalID": 57,
          "Quantity": 36192.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567316,
          "ProcessID": 1000055205,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044654,
      "SummaryText": "Executive Summary\n\n\n\n1. Accidental Release Prevention Policies\n\n\n\nWilbur-Ellis Company, Colusa has developed a risk management program \n\n(updated April 2013) and an emergency response plan(updated August 2013) to address the requirements of 40 CFR 68 of the Clean Air Act. Wilbur-Ellis Company, Colusa is diligent in the handling of all chemicals and is dedicated to the safety of its employees and the neighboring community. Wilbur-Ellis Company, Colusa staff is trained and utilize equipment to monitor the facility and provide safeguards, while effectively and safely storing and distributing anhydrous and aqueous ammonia. \n\n\n\nWilbur-Ellis Company, Colusa has a long standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Anhydrous Ammonia Storage System and the Aqueous Ammonia Storage System. Wilbur-Ellis Company, Colusa policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\n\n\n2. Stationary Source and Regulated Substances\n\n\n\nThe Wilbur-Ellis Company, Colusa is located at 7254 Farinon Rd., Colusa, California in the county of Colusa. The primary activity at the Facility is the storage, and sale of fertilizers, in addition to, the sale of pre-packaged agricultural chemicals to farmers.\n\n\n\nAnhydrous ammonia is received, stored, and distributed for direct application as a crop production nutrient. Anhydrous ammonia is received by truck and stored in one 15000 gallon storage tank (bullet) at the site. The maximum quantity of anhydrous ammonia handled in this process is 100,320 pounds.\n\n\n\nAqua ammonia (24% of ammonia by weight) is stored in one 20,000-gallon above ground tanks at the site. The total quantity of ammonia present in the aqua ammonia, based on 24% active ingredient by weight, is 36,192 pounds. \n\n\n\n3. Hazard Assessment Summary/Offsite Conseque"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044654,
      "SummaryText": "nce Analysis\n\n\n\nPer 40 CFR 68 Regulations, the description covering the worst-case and alternative case release scenarios has been eliminated from the executive summary. Please refer to the Hazard Assessment report for the results of this analysis. \n\n\n\n-Risk Considerations\n\n\n\nAmmonia is a toxic inhalation hazard; and thus, the use of anhydrous and aqueous ammonia has inherent potential risks to potentially reach sensitive populations within the community. The facility's identified potential risks for an ammonia release from its process are included in the off-site consequence analysis, Hazard Assessment, and Process Hazard Analysis (PHA). Facility RMP elements and other safety programs are structured to minimize the potential of a release from the identified risks.\n\n\n\n   -The history of the Wilbur-Ellis Company, Colusa (i.e., no CalARP-applicable anhydrous or aqueous ammonia releases) reflects the adequacy of the design and diligence of the plant staff in safely storing and distributing anhydrous and aqueous ammonia. \n\n\n\n4. Accidental Release Prevention Program \n\n\n\nAs part of the implementation of this Risk Management Program, key Prevention Program elements were documented and implemented by Wilbur-Ellis Company, Colusa to manage process safety issues associated with the use of anhydrous and aqueous ammonia. In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.\n\nThe facility's maximum intended inventory of anhydrous ammonia is 100,320 lb.  Therefore, the covered process has over the 10,000 lb threshold quantity for EPA RMP and Cal/OSHA PSM.  The 500 lb state threshold for the California Accidental Release Prevention (CalARP) Program is also exceeded.  As a result, the anhydrous ammonia covered process is subject to CalARP Program Level 3 and EPA RMP Program Level 3. \n\n\n\nThe Anhydrous Ammonia Prevention Program 3 elements include:\n\n\n\n   -Process Safety Information\n\n   -Process Hazard Ana"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044654,
      "SummaryText": "lysis\n\n   -Operating Procedures\n\n   -Training\n\n   -Mechanical Integrity\n\n   -Management of Change\n\n   -Pre-Startup Safety Review\n\n   -Compliance Audits\n\n   -Incident Investigation\n\n   -Employee Participation\n\n   -Hot Work Permit\n\n   -Contractors\n\n\n\nIn addition, key emergency response elements were addressed in the Business Emergency Plan. See EMERGENCY RESPONSE PROGRAM below.\n\n\n\nThe facility's maximum storage of ammonia in the aqueous solution is 36,192 lb.  Therefore, it is over the 20,000 lbs threshold (20% or greater concentration) for EPA RMP and the 500 lbs (all concentrations) state threshold for California Accidental Release Prevention (CalARP) Program.  Wilbur-Ellis Company, Colusa is not subject to Cal/OSHA PSM or Program 3 requirement due to the fact that the concentration of aqueous ammonia managed at the Facility is 24% and the Cal/OSHA PSM threshold quantity of aqueous ammonia is only for concentrations greater than 44%. For the reasons mentioned above, the Aqueous Ammonia Storage Tank is subject to CalARP Program Level 2 and EPA RMP Program Level 2.\n\n\n\nThe Aqueous Ammonia Prevention Program 2 elements include:\n\n\n\n   -Safety Information\n\n   -Hazard Review\n\n   -Operating Procedures\n\n   -Training\n\n   -Maintenance\n\n   -Compliance Audits\n\n   -Incident Investigation\n\n\n\n5. Five-Year Accident History\n\n\n\nThere have been no EPA-applicable releases of ammonia at Wilbur-Ellis Company, Colusa in the past five years.\n\n\n\n6. Emergency Response Program\n\n\n\nWilbur-Ellis Company, Colusa is not a First Responder.  Employees are trained to evacuate and call 911 in case of an emergency.  Wilbur-Ellis Company, Colusa will coordinate with local Fire Department and First Responders. Wilbur-Ellis Company, Colusa has filed a Business Emergency Plan to help coordinate with local responders.\n\nAn Emergency Action Plan (EAP) that meets the requirements of the CCR Title 8 ?3220 is in place.\n\n\n\n7. External Events Analysis Information\n\n\n\nPursuant to the requirements of California Health"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044654,
      "SummaryText": " & Safety Code, Title 19, Division 2, Chapter 4.5, ?2745.7(q); the following external events analysis information shall be submitted:  \n\n\n\n-The types of natural and human caused external events considered in PHA Section 2760.2 or Hazard Review Section 2755.2.  \n\n   \n\n   The Facility's 2009 PHA is in the process of being reviewed and updated. Section 8.a. of this RMP will be corrected when the PHA review and updates are completed (targeted completion by 6/30/2014). During the June 2009 PHA and 2013 Hazard Review a broad list of external events was considered by the Team.  General events external to the plant that can conceivably cause a release of anhydrous or aqueous ammonia were addressed.  The External Events that were considered credible include, but are not limited to, earthquake, vandalism, sabotage, external fire, human error/misoperation, and vehicle impact. \n\n\n\n-The estimated magnitude or scope of external events which were considered. If not known, the owner or operator of the stationary source shall work closely with the Administering Agency (AA) to determine what is required. If seismic events are applicable, the parameters used in the consideration of the seismic analysis and which edition of the Uniform Building Code was used when the process was designed.\n\n   \n\n   The magnitudes of the external events considered are detailed within the PHA Worksheets and were qualitatively risk-ranked by the PHA Team.\n\n\n\n-For each external event, with a potential to create a release of a regulated substance that will reach an endpoint offsite, apply \n\n\n\n1) The expected date of completion of any changes resulting from the PHA;\n\n2) Major hazards identified;\n\n3) Process controls in use;\n\n4) Mitigation systems in use;\n\n5) Monitoring and detection systems in use; and,\n\n6) Changes since the last Hazard Review (HR) or PHA\n\n\n\n8. Planned Changes to Improve Safety\n\n\n\nWilbur-Ellis is committed to continuously making safety improvements. To improve the safety of the anhydrous ammo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044654,
      "SummaryText": "nia system, Wilbur-Ellis is in the process of developing a more comprehensive anhydrous ammonia inspection checklist for the bullet tank system and nurse tanks. The comprehensive checklist will include daily, weekly, and annual inspection frequencies, including visual and non destructive tests to evaluate the mechanical integrity of the tanks, valves, piping, etc. At a minimum, inspection frequencies will follow industry standards. Wilbur-Ellis is also implementing a facility-wide comprehensive corrective action/preventative action (CAPA)log to track and facilitate completion of listed CAs on a timely basis. Recommended improvements and identified deficiencies from the inspection checklists, compliance audits, and PHA studies will be included on the facility CAPA log along with the priority, employee responsible, and targeted completion dates.\n\n\n\n\n\n9. Flammables: Worst Case\n\n\n\nThe use of flammable materials at Wilbur-Ellis Company, Colusa is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable. \n\n\n\n10. Flammables: Alternative Release\n\n\n\nThe use of flammable materials at Wilbur-Ellis Company, Colusa is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable.\n\n"
    }
  ]
}