{
  "FacilityID": 1000000305,
  "FacilityName": "Brenham Main Water Treatment Plant",
  "FacilityStr1": "1105 South Austin",
  "FacilityStr2": null,
  "FacilityCity": "Brenham",
  "FacilityState": "TX",
  "FacilityZipCode": "77833",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48477",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "30.159445",
  "FacilityLongDecDegs": "-096.396667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "http://www.ci.brenham.tx.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Brenham",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Brenham",
  "OperatorStr1": "200 W. Vulcan",
  "OperatorStr2": null,
  "OperatorCity": "Brenham",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77833",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000056191",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-02-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-04-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-04-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-04-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-04-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.2361,
  "FRS_Long": -96.4089,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000344,
      "AltID": "Water Treatment",
      "FacilityID": 1000000305,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000361,
          "ProcessID": 1000000344,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000000378,
          "ProcessID": 1000000344,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000000175,
              "Process_NAICS_ID": 1000000378,
              "SafetyReviewDate": "2009-02-03 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2009-02-03 00:00:00",
              "ChangeCompletionDate": "2009-05-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-02-04 00:00:00",
              "TrainingReviewDate": "2009-02-04 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-02-04 00:00:00",
              "EquipmentInspectionDate": "2009-04-14 00:00:00",
              "EquipmentTested": "All process equipment is inspected daily as part of Normal Operations.",
              "ComplianceAuditDate": "2009-02-03 00:00:00",
              "AuditCompletionDate": "2009-05-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2009-02-02 00:00:00",
              "CBI_Flag": 0,
              "Description": "Chlorination Process",
              "_chemicals": [
                {
                  "PrimaryKey": 1000000180,
                  "PreventionProgram2ID": 1000000175,
                  "ProcessChemicalID": 1000000361
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000305,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-02-05 00:00:00",
    "ERTrainingDate": "2009-02-06 00:00:00",
    "CoordinatingAgencyName": "Brenham Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000305,
      "SummaryText": "City of Brenham\nMain Water Treatment Plant\nRISK MANAGEMENT PROGRAM\nEXECUTIVE SUMMARY\n\n\n1.0    Accidental Release Prevention and Emergency Response Policies\n\nThe City of Brenham Main Water Treatment Plant is committed to the safety of our workers, the public, and the environment.  The resources invested in the \n\nprevention of accidental releases of hazardous substances demonstrate this commitment.  The City of Brenham Main Water Treatment Plant implements \n\nreasonable controls, such as training of personnel and the safe design, installation, operation and maintenance of our processes.  Our policy is to make \n\nevery effort to prevent the release of hazardous substances but in the event of a release, our trained personnel and local emergency response agencies \n\nwill respond to control and contain the release in a manner that will be safe for workers and will help prevent injuries to the public or the \n\nenvironment.\n\n\n2.0    Description of The City of Brenham Main Water Treatment Plant and Regulated Substances\n\nThe City of Brenham Main Water Treatment Plant is located in Cleburne, Texas.  The City of Brenham Main Water Treatment Plant handles one substance \n\nregulated by the Risk Management Plan Rule (RMP Rule) in quantities above the Threshold Quantity.  This substance is:\n\n* Chlorine - stored in 1 ton cylinders and used for disinfection of the water prior to distribution.\n\n\n\n3.0    Hazard Assessment\n \nThe RMP Rule requires The City of Brenham Main Water Treatment Plant to perform a Hazard Assessment of the regulated substances stored and used in the \n\ncovered processes at the facility.  This Hazard Assessment includes an offsite consequence analysis for the following scenarios:\n \n* One worst-case and one alternative release scenario for the toxic substance chlorine for the chlorination process unit at the facility.\n\nThe City of Brenham Main Water Treatment Plant completed a Hazard Assessment for the covered processes and the results have been appropriately \n\ncommunicated to th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000305,
      "SummaryText": "e local emergency response agencies. The Hazard Assessment has been recently updated to reflect changes in population.\n\n\n4.0    Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe RMP Rule requires that a prevention program be established for The City of Brenham Main Water Treatment Plant chlorination processes.  The following \n\ndetails the prevention program elements at The City of Brenham Main Water Treatment Plant that apply to these processes.\n\n4.1    Safety Information\n\nThe City of Brenham Main Water Treatment Plant maintains a variety of technical documents that are used to help ensure safe operation of The City of \n\nBrenham Main Water Treatment Plant processes.  Material safety data sheets (MSDSs) document the physical and chemical properties of hazardous substances \n\nhandled at The City of Brenham Main Water Treatment Plant, including the chlorine in the covered process.  The engineering design documents include the \n\noperating parameters, the design basis and configuration of the equipment in each covered process, and references to applicable codes and standards.\n\n\n4.2    Hazard Review\n\nThe City of Brenham Main Water Treatment Plant performs and periodically updates hazard reviews of the covered processes to help identify and control \n\nprocess hazards.  Checklists are used to guide the hazard review.  These checklists include items to help ensure The City of Brenham Main Water Treatment \n\nPlant operates and maintains the equipment in a manner consistent with the applicable design specifications, codes, standards, and regulations.\n\n4.3    Operating Procedures\n\nThe City of Brenham Main Water Treatment Plant develops and maintains operating procedures to define how tasks related to process operations should be \n\nperformed.  The operating procedures are used to:\n\n1. train employees and contractors, and\n2. serve as reference guides for appropriate actions to take during both normal and abnormal process conditions.\n\n4.4    Training\n\nThe City of Bre"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000305,
      "SummaryText": "nham Main Water Treatment Plant trains personnel in the operating procedures to help ensure safe and effective performance of their \n\nassigned tasks. A record of all training is maintained to help ensure new and refresher training is provided on a timely basis.\n\n4.5    Maintenance\n\nThe City of Brenham Main Water Treatment Plant properly maintains the equipment in our processes.  The City of Brenham Main Water Treatment Plant \n\nmaintenance program includes:\n\n1. procedures to safely guide workers in their maintenance tasks,\n2. worker training in the maintenance procedures, and\n3. inspection and testing program to help identify equipment deterioration and damage before equipment fails.\n\n4.6    Compliance Audits\n\nThe City of Brenham Main Water Treatment Plant performs periodic (at least every three years) audits of covered processes to verify the processes are \n\noperating in compliance with the requirements of the RMP Rule.  A compliance audit report is prepared after each audit, and any deficiencies noted by the \n\naudit are corrected in a timely manner.\n\n\n4.7    Incident Investigations\n\nThe City of Brenham Main Water Treatment Plant investigates all incidents that could reasonably have resulted in a serious injury to personnel, the \n\npublic, or the environment.  The City of Brenham Main Water Treatment Plant trains employees to identify and report any and all incidents requiring \n\ninvestigation.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation \n\nare documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n4.8    Chemical-specific Prevention Steps - Chlorine\n\nIndustry standards are followed at The City of Brenham Main Water Treatment Plant to help ensure safe handling of chlorine and sulfur dioxide.  The \n\nvendor supplies chlorine via a Department of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The process equipment is designe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000305,
      "SummaryText": "d \n\nand constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works \n\nAssociation, ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling \n\nprocedures according to the guidelines required by The City of Brenham Main Water Treatment Plant.\n\n\n5.0    Five Year Accident History\n\nThere has been no accidents or incidents that resulted in injuries to employee, the public, or the environment The City of Brenham Main Water Treatment \n\nPlant in the past five years.\n\n\n6.0    Emergency Response Programs\n\nThe City of Brenham Main Water Treatment Plant has prepared a written emergency response plan that complies with the RMP Rule, other federal standards \n\nand industry guidelines.  This plan has been communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  The City of \n\nBrenham Main Water Treatment Plant periodically conducts emergency drills to test our emergency plan and coordinate these drills with the local fire \n\ndepartment.\n\n\n7.0    Planned Changes to Improve Safety\n\nThe City of Brenham Main Water Treatment Plant continuously attempts to improve the safety of our processes to protect our employees, the public and the \n\nenvironment.  The City of Brenham Main Water Treatment Plant incident investigations, employee suggestions and improvements in technology are utilized to \n\nupdate the safety aspects of the processes.  The following changes to improve process safety are planned or have recently been completed.\n\n1. Implement a chlorine shipment Quality Assurance Program to aid in the inspection of chlorine cylinders when received, and\n2. Implement a preventive maintenance program for the hoist used to move chlorine cylinders.\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}