{
  "FacilityID": 1000091462,
  "FacilityName": "Tangi-Pac, LLC",
  "FacilityStr1": "101 Ponchatoula Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Ponchatoula",
  "FacilityState": "LA",
  "FacilityZipCode": "70454",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22105",
  "LEPC": null,
  "FacilityLatDecDegs": "30.425054",
  "FacilityLongDecDegs": "-90.439490",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ragan and Massey",
  "OperatorStr1": "101 Ponchatoula Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Ponchatoula",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70454",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Massey",
  "RMPTitle": "VP",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230092",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-12-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-01-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-01-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-01-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-01-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000113649,
      "AltID": "Amination",
      "FacilityID": 1000091462,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000115022,
          "ProcessID": 1000113649,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000141971,
          "ProcessID": 1000113649,
          "ChemicalID": 109,
          "Quantity": 379500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 109,
            "ChemicalName": "Isopropylamine [2-Propanamine]",
            "CASNumber": "75-31-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000641971,
          "ProcessID": 1000113649,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091462,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nTangi-Pac is committed to operating in a manner that is safe for the plant workers, the public, and the environment. Tangi-Pac strives to protect and promote the health and safety of its employees, its neighbors, and others who may be affected by activities at the facility. Tangi-Pac also strives to limit adverse effects on the physical environment in which its activities are carried out. The facility has established systems to help ensure safe operation of the processes at this facility. One part of these systems is the risk management program which helps manage the risks at the facility and complies with the requirements of the EPA's Rule 40 CFR Part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule). One of the requirements of the RMP rule is to submit an RMP describing the risk management program at the facility. An initial RMP for the facility was submitted to EPA via the RMP Submit Program in January 2016. Tangi-Pac will update its RMP at least once every five years or when changes at the facility require revisions to the RMP.  This submittal will satisfy the five year update requirement\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONCE POLICIES\n\n\n\nTangi-Pac's goal at its program 3 stationary source is accidental release prevention, while maintaining emergency response procedures to minimize consequences in the event of any such release. Tangi-Pac maintains a Process Safety Manual directing employees to process safety information in accordance with respective Occupational Safety and Health Administration (OSHA) process safety management and EPA chemical accident prevention provisions. Tangi-Pac also maintains an Emergency Procedures Manual providing necessary information and guidelines to utilize in the event of an emergency situation resulting in accidental release of a regulated substance. Tangi-Pac's objective is to train affected employees and contractors in emergency response procedures, and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091462,
      "SummaryText": "requires that emergency response actions are supported by proper consideration for safety, health, and welfare of employees, contractors, the surrounding community, and property.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nTangi-Pac has developed a management system to oversee implementation of the RMP elements. Tangi-Pac assigns responsibility for implementing individual requirements of the program to identified persons exhibiting respective qualifications. Tangi-Pac's system includes:\n\n\n\n*Compiling process safety information to support completing process hazard analyses\n\n*Issuing written operating procedures that provide instructions for safely conducting activities in the covered process, and training employees involved in operating the process\n\n*A mechanical integrity program\n\n*Management of change procedures and pre-startup safety reviews\n\n*Compliance audits in order to evaluate compliance with provisions of the program\n\n*Incident investigation for incidents which resulted in, or could reasonably have resulted in, a release of a regulated substance\n\n*An established hot work permit program\n\n*Employee participation and training\n\n*Contractor pre-qualification, participation, and training\n\n\n\nTangi-Pac's prevention steps include engineering and administrative controls. Redundant equipment and instrumentation is installed where applicable. Tangi-Pac uses a Distributed Control System to control production in covered process units. Administratively, Tangi-Pac engages in periodic inspection and maintenance practices consistent with industry standards, as well as OSHA and EPA regulatory provisions. Tangi-Pac's covered process units also include fire suppression, containment, and mitigation systems. \n\n\n\nEMPLOYEE PARTICIPATION\n\n\n\nEmployee participation is a goal at Tangi-Pac. Keeping employees informed and involved creates a team unity atmosphere. Employees participate on Process Hazards Analysis (PHA) teams and have access to all information and recommendations. This info"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000091462,
      "SummaryText": "rmation along with updated Operation Manuals is available in assigned locations throughout the facility. Operation manuals are developed, updated, and reviewed by Operations personnel and the Training Department. These Operation Manuals assist employees in refresher training and Operator Recertification Programs.\n\n\n\nSafety meetings are held on a regular basis for Operations, Maintenance, Administration, and Contract personnel. Topics chosen are relevant to respective personnel assigned duties, and general and specific information is provided as informational instruments to enhance employee participation in facility-wide safety performance.\n\n\n\nPROCESS SAFETY INFORMATION\n\n\n\nTangi-Pac keeps a variety of technical documents that are used to help maintain safe process operations. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. Specific departments within Tangi-Pac are assigned responsibility for maintaining up-to-date process safety information.\n\n\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets.  For specific process areas, Tangi-Pac has documented safety-related limits for specific process parameters (e.g., temperature, level, pressure, composition) in the operation manuals for the process unit. Tangi-Pac promotes maintaining process parameters within limits by using process controls and monitoring instruments, operating procedures, trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\n\n\nTangi-Pac also maintains technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc. This information, in combination with written procedur"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000091462,
      "SummaryText": "es and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to enhance safety features in respective processes.\n\n\n\nPROCESS HAZARD ANALYSIS\n\n\n\nTangi-Pac has a comprehensive PHA program to recognize and control hazards associated with the process. Within this program, the existing covered process and potential future processes are systematically examined.\n\n\n\nTangi-Pac primarily uses the What-If/Checklist technique to perform these evaluations. The analyses are conducted using a team of personnel who exhibit operating, maintenance, and process engineering experience and expertise. This team identifies and evaluates hazards of the process as well as recommends accident prevention and/or mitigation measures when the team believes such measures are warranted.\n\n\n\nTangi-Pac periodically updates PHAs of the affected unit. These periodic reviews will be conducted at least every five years and will be conducted at this frequency until the process is no longer operating. \n\n\n\nOPERATING PROCEDURES\n\n\n\nTangi-Pac maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. Procedures are periodically reviewed and annually certified as current and accurate. Procedures are maintained current by revising them as necessary to reflect changes made to the process. In addition, the Tangi-Pac operating procedures provide guidance on how to respond to events that result in exceeding safe operating limits for specific process or equipment parameters. The written operating procedures are readily available to operators in the process units and for other personnel to use as necessary to sa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000091462,
      "SummaryText": "fely perform their job tasks.\n\n\n\nTRAINING\n\n\n\nTo complement the written procedures for process operations, Tangi-Pac has implemented a training program for all employees involved in operating a process. New employees receive basic training in Tangi-Pac operations. After operators demonstrate (e.g., through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures in order to maintain skills and knowledge at an acceptable level. \n\n\n\nCONTRACTORS\n\n\n\nTangi-Pac may use contractors to supplement its work force during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, Tangi-Pac has procedures in place to provide that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform Tangi-Pac personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, (4) safe work practices, and (5) a work permit process (i.e., for hot work, confined space, etc.) prior to their beginning work. In addition, Tangi-Pac evaluates contractor safety programs and performance during the selection of a contractor. Tangi-Pac personnel monitor contractor performance to evaluate the level at which contractors are fulfilling their safety obligations.\n\n\n\nPRE-STARTUP SAFETY REVIEW\n\n\n\nTangi-Pac conducts a pre-startup safety review for any new facility or facility modification that requires a change in the process safety information. This review provides that safety features, procedures, pers"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000091462,
      "SummaryText": "onnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to corroborate that construction is in accordance with the design specifications and that all supporting systems are operationally ready. The review team uses checklists to verify all aspects of readiness. A review involves field verification of the construction and serves a quality assurance function.\n\n\n\nMECHANICAL INTEGRITY\n\n\n\nTangi-Pac uses established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: \n\n\n\n*Conducting training\n\n*Developing written procedures\n\n*Performing inspections and tests\n\n*Correcting identified deficiencies \n\n*Applying quality assurance measures\n\n\n\nIn combination, these activities form a system that maintains the mechanical integrity of the process equipment. To help ensure that they can perform their job in a safe manner, maintenance personnel receive training on: \n\n\n\n*An overview of the process\n\n*Safety and health hazards\n\n*Applicable maintenance procedures\n\n*Emergency response plans\n\n*Applicable safe work practices \n\n\n\nWritten procedures are used in the order that work is performed in a consistent manner and provide a basis for training. Inspections and tests are completed to evaluate equipment functioning as compared to that intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\n\n\nAnother integral part of the mechanical integrity program is quality assurance. Tangi-P"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000091462,
      "SummaryText": "ac incorporates quality assurance measures into equipment purchases and repairs. This practice assesses suitability of new equipment for its intended use and establishes that proper materials and spare parts are used when repairs are made.\n\n\n\nMANAGEMENT OF CHANGE\n\n\n\nTangi-Pac has a comprehensive system to manage changes to processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards, and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process technology information, equipment information, and procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are provided with any necessary training on the change.\n\n\n\nINCIDENT INVESTIGATION\n\n\n\nTangi-Pac will investigate incidents that resulted in, or reasonably could result in, a fire/explosion, gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team, which can include contractors, will document its findings, develop recommendations to prevent a recurrence, and forward these results to Tangi-Pac management for resolution. Corrective actions will be taken in response to the investigation team's findings, and recommendations will be tracked until they are complete. The final resolution of each finding or recommendation will be documented, and the investigation results will be reviewed with all employees (including contractors) who could be affected by the findings. \n\n\n\nCOMPLIANCE AUDITS\n\n\n\nTo help ensure that the accident prevention program is functioning"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000091462,
      "SummaryText": " properly, Tangi-Pac will periodically conduct audits to confirm the procedures and practices required by the accident prevention program are being implemented. Compliance audits will be conducted at least every three years. The final resolution of each finding will be documented, and recent audit reports will be retained. \n\n\n\nHOT WORK PERMIT\n\n\n\nThe facility's hot work procedure requires that detailed permitting activities take place before, during, and after any job that has the potential to provide a source of ignition. The permit is followed through to completion of the work and those permits are maintained on site. The facility implements other work permits as necessary to assure safe work conditions are communicated to maintenance and contract personnel.\n\n\n\nSAFE WORK PRACTICES\n\n\n\nTangi-Pac has safe work practices in place to sustain worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedure to control welding and other spark-producing activities, and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to foster that operations and maintenance activities are performed safely.\n\n\n\nADDITIONAL SAFETY FEATURES\n\n\n\nIn addition to the accident prevention program activities, Tangi-Pac has many safety features to help prevent the accidental releases of regulated substances in the facility. These safety features help to prevent potential accident scenarios that could be caused by equipment failures and human error. These features include but are not limited to: \n\n\n\n*Operating parameter monitors with alarms\n\n*Process relief systems\n\n*Isolation"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000091462,
      "SummaryText": " valves (manual or automated)\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nTangi-Pac is committed to minimizing potential risks to the public, employees and environment. A fundamental part of this commitment is the prevention of accidental releases of hazardous substances in and around the facility. Within the past five years, there has not been a release of a regulated substance from a regulated process. In accordance with the requirements of 40 CFR 68.42, information relating to any accidental release that results in death, injury, significant property damage, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage will be documented for the facility and provided in future RMP submittals. Any accidental release involving a reportable RMP chemical will be reported to the federal and state emergency response agencies.\n\n\n\nTangi-Pac will hold a public a meeting to provide information required under 40 CFR 68.42(b), no later than 90 days after any RMP reportable accident resulting in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nTangi-Pac's emergency response program is set forth in its Emergency Procedures Manual. That manual is comprised of numerous relevant sections. Those sections deal with, but are not limited to:\n\n\n\n*Employee participation \n\n*Incident command management\n\n*Response teams\n\n*Emergency evacuation procedures\n\n*Fire response\n\n\n\nThe Emergency Procedures Manual states Tangi-Pac's management issued policy statement, which is briefly described in the Accidental Release Prevention and Emergency Response Policies section in this Executive Summary.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nTangi-Pac's mechanisms to improve safety include written procedure review, process hazard analysis, management of change, incident reporting and investigation, near miss reporting"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000091462,
      "SummaryText": " and investigation, and employee safety meetings and suggestion processes. Also, Tangi-Pac's pre-startup safety review includes, among other things, 'show stoppers' that prohibit any startup until those items are closed. Tangi-Pac assigns respective tasks resulting from each of these mechanisms to responsible persons, and closure is approved only after all recommendations and action items are documented as complete.\n\n\n\nThe facility constantly strives to improve the safety of its operations through periodic safety reviews, the incident investigation program, and a program soliciting safety suggestions from the workers. Tangi-Pac believes that continuous improvement is the key to success in the future. This is especially true in the safety, health, and environmental areas. Tangi-Pac continuously looks for opportunities to improve our abilities in protecting our people and our community. Tangi-Pac actively solicits and implements safety and process improvement suggestions.\n\n\n\n\n\n"
    }
  ]
}