{
  "FacilityID": 1000061278,
  "FacilityName": "UNIVAR USA INC",
  "FacilityStr1": "1001 OLD BERMUDA HUNDRED ROAD",
  "FacilityStr2": null,
  "FacilityCity": "CHESTER",
  "FacilityState": "VA",
  "FacilityZipCode": "23836",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51041",
  "LEPC": "CHESTERFIELD COUNTY LEPC",
  "FacilityLatDecDegs": "37.343889",
  "FacilityLongDecDegs": "-077.377500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 102971785,
  "ParentCompanyName": "UNIVAR USA INC",
  "Company2Name": null,
  "CompanyDUNS": 102971785,
  "Company2DUNS": null,
  "OperatorName": "DAVID CHATHAM",
  "OperatorStr1": "1001 OLD BERMUDA HUNDRED ROAD",
  "OperatorStr2": null,
  "OperatorCity": "CHESTER",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23836",
  "OperatorZipCodeExt": null,
  "FTE": 45,
  "OtherEPAFacilityID": "VAD041283342",
  "EPAFacilityID": "100000154806",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-12-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Chester",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-11-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-11-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-11-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-11-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 37.34377,
  "FRS_Long": -77.3826,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000076546,
      "AltID": "Containerized Storage",
      "FacilityID": 1000061278,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094931,
          "ProcessID": 1000076546,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000094932,
          "ProcessID": 1000076546,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000094933,
          "ProcessID": 1000076546,
          "ChemicalID": 31,
          "Quantity": 72000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000077728,
          "ProcessID": 1000076546,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000064334,
              "Process_NAICS_ID": 1000077728,
              "SafetyReviewDate": "2016-07-19 00:00:00",
              "PHA_Date": "2016-11-02 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Onsite Emergency Response Personnel and Equipment. Fire Dept. and Haz Mat",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Daily Inspections",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-03-11 00:00:00",
              "TrainingReviewDate": "2016-07-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-03-11 00:00:00",
              "EquipmentInspectionDate": "2016-11-29 00:00:00",
              "EquipmentTested": "Forklift",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2016-07-19 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2016-07-19 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-07-19 00:00:00",
              "HotWorkPermitReviewDate": "2016-07-19 00:00:00",
              "ContractorSafetyReviewDate": "2016-11-22 00:00:00",
              "ContractorSafetyEvalDate": "2016-07-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000079111,
                  "PreventionProgram3ID": 1000064334,
                  "ProcessChemicalID": 1000094931
                },
                {
                  "PrimaryKey": 1000079112,
                  "PreventionProgram3ID": 1000064334,
                  "ProcessChemicalID": 1000094932
                },
                {
                  "PrimaryKey": 1000079113,
                  "PreventionProgram3ID": 1000064334,
                  "ProcessChemicalID": 1000094933
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000061278,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-09-13 00:00:00",
    "ERTrainingDate": "2016-09-13 00:00:00",
    "CoordinatingAgencyName": "CHESTERFIELD COUNTY FIRE DEPT",
    "CoordinatingAgencyPhone": "8047481236",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061278,
      "SummaryText": "UNIVAR USA INC\r\n1001 OLD BERMUDA HUNDRED RD   \r\nCHESTER VA  FACILITY RMP PLAN\r\nEXECUTIVE SUMMARY\r\n\r\nCOMPANY OVERVIEW\r\n\r\nUNIVAR USA Inc. is a wholesale chemical distributor serving a number of U.S. industries.  Founded in 1924, UNIVAR supplies the food industry, chemical compounders, pharmaceuticals, mining, forest products, oil and gas producers, electronics, coatings and many other key industries with the chemical raw materials required to produce or refine products used in numerous end-use markets.\r\n\r\nUNIVAR USA Inc . Is a member of the National Association of Chemical distributors (NACD) and complies with the Responsible Distribution Process (RDP), an environmental, health and safety improvement initiative.\r\n\r\nCertain products stored and handled by UNIVAR are subject to EPA's Risk Management Program rule (40 CFR Part 68).  A key requirement of this rule is the preparation and submission of an RMP Plan, contained herein.  The contents of the RMP Plan are prescribed by EPA, including this Executive Summary.\r\n\r\nUNIVAR USA Inc. Chester facility stores and distributes Cyclohexylamine, Chlorine and Sulfur Dioxide at the 1001 Old Bermuda Hundred Rd facility. \r\n\r\nCORPORATE PREVENTION AND EMERGENCY RESPONSE APPROACH\r\n\r\n1. Prevention Program\r\n\r\nProcesses that are subject to OSHA's Process Safety management (PSM) standard AND are regulated under EPA's RMP rule are subject to the Program 3 Prevention program.  UNIVAR USA Inc. has documented the Prevention Program in its Process Safety Management Manual.  Briefly, this program includes provisions and requirements for:\r\n\r\n* Process Safety Information\r\n* Process Hazard Analysis\r\n* Operating Procedures\r\n* Training\r\n* Mechanical Integrity\r\n* Management of Change\r\n* Pre-Startup Review\r\n* Compliance Audits\r\n* Incident Investigation\r\n* Employee Participation\r\n* Hot Work permits\r\n* Contractors\r\n\r\n\r\n\r\n2. Emergency Response Approach\r\n\r\nUNIVAR USA Inc. has an Emergency Contingency Plan in place.  This Plan is shared with local emergency"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061278,
      "SummaryText": "responders who have access to UNIVAR  facility personnel (and up-to-date phone numbers).  UNIVAR responds to minor incidents but will call in professional emergency responders in the event of all other incidents.\r\n\r\nUNIVAR invites and encourages local emergency responders such as the fire department to visit and familiarize themselves with UNIVAR products and facilities.  Joint emergency exercises are conducted when possible.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\r\n\r\nOur facility's primary activities encompass Chemical Storage & Distribution.  We have three RMP regulated substances present at our facility.  The substances are Sulfur Dioxide, Chlorine and Cyclohexylamine. Listed below is the way the RMP regulated substance are stored/handled on site.\r\n\r\n1. Chlorine is received in 150 pound cylinders which are stored at the Chester facility for distribution to end use customers. \r\n\r\n2. Sulfur Dioxide is received in 150 pound cylinders which are stored at the Chester facility for distribution to end use customers.  \r\n\r\n3. Cyclohexylamine is received in 55 gallon drums and 110 gallon IBC's which are stored at the Chester facility for distribution to end use customers.\r\n\r\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM \r\n\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\r\n\r\nProcess Safety Information\r\n\r\nUNIVAR USA Inc maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis\r\n\r\nOur facility conducts comprehensive"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061278,
      "SummaryText": "studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is  the \"What-If\" technique. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years.  Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures\r\n\r\nFor the purposes of safely conducting activities within our covered processes, UNIVAR USA Inc maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\r\n\r\nTraining\r\n\r\nUNIVAR USA Inc has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every year and more frequently as needed.\r\n\r\nMechanical Integrity\r\n\r\nUNIVAR USA Inc carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\n\r\nWritten procedures are in place at UNIVAR USA Inc to manage changes in process chemicals, technology, equipment and procedures.  Process operators, mainten"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061278,
      "SummaryText": "ance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews\r\n\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at UNIVAR USA Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\n\r\nUNIVAR USA Inc conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\r\n\r\nIncident Investigation\r\n\r\nUNIVAR USA  Inc promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation\r\n\r\nUNIVAR USA Inc truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\r\n\r\nContractors\r\n\r\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  UNIVAR USA Inc has a strict policy"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000061278,
      "SummaryText": "of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nUNIVAR USA Inc has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, no accidental release of Cyclohexylamine, Chlorine or Sulfur Dioxide has occurred during this period.\r\n\r\nEMERGENCY RESPONSE PLAN\r\n\r\nUNIVAR USA Inc is strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with the local Fire Department which provides additional emergency response expertise.\r\n\r\nUNIVAR USA Inc carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThrough Process Hazard Analysis performed at this facility, exis"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000061278,
      "SummaryText": "ting safeguards have been determined to be\r\nadequate and no changes are warranted at the present time.\r\n\r\n\r\nCERTIFICATION STATEMENT\r\n\r\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\r\n\r\nName:\t\t________________________________________\r\n\r\nSignature:\t________________________________________\r\n\r\nTitle:\t\t________________________________________\r\n\r\nDate signed:\t________________________________________"
    }
  ]
}