{
  "FacilityID": 1000048359,
  "FacilityName": "Trident Seafoods Bedford Plant",
  "FacilityStr1": "940 Orange Street",
  "FacilityStr2": null,
  "FacilityCity": "Bedford",
  "FacilityState": "VA",
  "FacilityZipCode": "24523",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51019",
  "LEPC": "Bedford County, VA",
  "FacilityLatDecDegs": "37.337943",
  "FacilityLongDecDegs": "-079.497410",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.tridentseafoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Trident Seafoods Corporation",
  "OperatorStr1": "940 Orange Street",
  "OperatorStr2": null,
  "OperatorCity": "Bedford",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "24523",
  "OperatorZipCodeExt": null,
  "RMPContact": "R. Lewis Poindexter",
  "RMPTitle": "Maintenance Manager",
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000158198",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-03-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-01-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-01-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-01-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-04-28 00:00:00",
  "DeRegistrationEffectiveDate": "2015-04-20 00:00:00",
  "AnniversaryDate": "2020-01-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.3378,
  "FRS_Long": -79.49834,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060508,
      "AltID": "311412",
      "FacilityID": 1000048359,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061650,
          "ProcessID": 1000060508,
          "NAICSCode": "311999",
          "_desc": {
            "NAICS_CODE": "311999",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000074072,
          "ProcessID": 1000060508,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000574072,
          "ProcessID": 1000060508,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048359,
      "SummaryText": "RISK MANAGEMENT PLAN DATA ELEMENTS\n\nEXECUTIVE SUMMARY\n\n\n\nThis document presents Trident Seafoods Corporation's, strategy to comply with the Clean Air Act requirements of Section 112(r)(7)40 CFR Part 68, Accidental Releases Prevention Requirements Risk Management Program, and OSHA's 29 CFR.1910.119 Process Safety Management Program.  It is Trident Seafoods intent to develop the policies and procedures presented in these documents to prevent accidental releases of regulated substances and to reduce the severity of those releases when they do occur.\n\n\n\n\n\n1.0 POLICIES IN PLACE:\n\n\n\nThere is a management system in place with one person responsible for the overall success of the program.   There is a person responsible for each section of the program.  This is a brief description of each program section:\n\n\n\nEmployee Participation - Employees are given shared responsibility with management in the continued evolution of the program.\n\nProcess Safety Information - Chemical, equipment, and system information has been compiled to ensure the safe design and operation.\n\nProcess Hazard Analysis - was performed  using a \"What if/Checklist format  to identify potential hazards and minimize their impact.\n\nOperating Procedures - Standard Operating Procedures developed to ensure the safe operation of the process.\n\nTraining - Training program established and operators trained to ensure the safe operation of the process.\n\nContractors - Contractor program established to ensure only qualified and trained contractor work on or near the process.\n\nPre-Startup Safety Review - Procedures and check lists developed to ensure all safety requirements are completed before startup of new or modified process.\n\nMechanical Integrity - Program developed to ensure equipment and systems installed per design specifications and maintained per manufacturer recommendations and good engineering practices.\n\nHot Work Permit - Permit program established to prevent the potential of fire/explosion resulting from hot "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048359,
      "SummaryText": "work near hazardous chemicals.\n\nManagement of Change - Procedures established to manage process changes to ensure the integrity of the PSM program is maintained.\n\nIncident Investigations - Procedures established to investigate releases that resulted in or could have resulted in a catastrophic release of a hazardous chemical and to prevent recurrence.\n\nCompliance Audits - Procedures established to periodically review program implementation and to correct as necessary.\n\nTrade Secrets - Policy implemented to provide all necessary information regardless of trade secrets to ensure employee safety.\n\n\n\n\n\n2.0 SOURCE AND SUBSTANCE:\n\n\n\nTrident Seafoods of Bedford, Virginia is a food processing facility.  Trident Seafoods uses anhydrous ammonia (CAS Number 7664-41-7) in its refrigeration system to cool and freeze foods.\n\n\n\n\n\n3.0 ACCIDENTAL RELEASE PREVENTION PROGRAM:\n\n\n\nThe prevention portion of the program centers on OSHA's Process Safety Management program. This details employee participation in all portions of both programs including a process hazard analysis, compliance audits, management of change, safety reviews, review of operating procedures, training for job responsibilities, maintenance, testing and inspection of equipment and the refrigeration system, emergency response, when necessary and incident investigations for actual and potential incidents when they occur.  All persons working on or around the ammonia system contribute to the success of our company and the prevention of accidental releases of ammonia.\n\n\n\nA hazard assessment study has been performed detailing a Worst Case and Alternate Worse Case ammonia release.  Census figures from the 2010 Census are included in this study and details the number of persons living in the vicinity of the release.  What is not included in this figure is the number of persons working in the facility and also persons in the immediate area working at other business locations.  In particular, this would increase the potential num"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048359,
      "SummaryText": "ber of persons in the vicinity of the alternate worse case scenario, a distance of 0.1 miles.  This would potentially affect more than a hundred persons working in this area.\n\n \n\n\n\n\n\n4.0 ACCIDENT HISTORY:\n\n\n\nThere have been no accidents or releases on ammonia in the last five (5) years.\n\n\n\n\n\n5.0 EMERGENCY RESPONSE PROGRAM:\n\n\n\nTrident Seafoods has an emergency action plan which has been coordinated with community emergency responders.  The facility relies entirely on outside local community emergency response teams to address major ammonia releases. The local Bedford Fire Department tours this plant yearly and is aware of the ammonia system that is used in the production process.\n\n\n\n\n\n6.0 PLANNED CHANGES TO IMPROVE SAFETY:\n\n\n\nSafety is the number one priority of Trident Seafoods Corporation. The Risk Management/Process Safety Management program is part of an ongoing effort to improve safety and efficiency at our facility.  This is a part of our daily routine. "
    }
  ]
}