{
  "FacilityID": 1000007682,
  "FacilityName": "White River M.W.D. Water Treatment Plant",
  "FacilityStr1": "2880 Farm Road 2794",
  "FacilityStr2": "Water Plant Road",
  "FacilityCity": "Spur",
  "FacilityState": "TX",
  "FacilityZipCode": "79370",
  "Facility4DigitZipExt": "9607",
  "FacilityCountyFIPS": "48107",
  "LEPC": "Crosby County-Crosbyton LEPC",
  "FacilityLatDecDegs": "33.456503",
  "FacilityLongDecDegs": "-101.092664",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "wrmwdgm@caprock-spur.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "White River Mun. Water District",
  "OperatorStr1": "2880 FM 2794",
  "OperatorStr2": null,
  "OperatorCity": "Spur",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79370",
  "OperatorZipCodeExt": "9607",
  "RMPContact": "Mickey Rogers",
  "RMPTitle": "General Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000119329",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-27 00:00:00",
  "SafetyInspectionBy": "eHT Consultant",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.45722,
  "FRS_Long": -101.09028,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000008900,
      "AltID": "Chlorine Water Treatment",
      "FacilityID": 1000007682,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000009112,
          "ProcessID": 1000008900,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010018,
          "ProcessID": 1000008900,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000510018,
          "ProcessID": 1000008900,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007682,
      "SummaryText": "White River Municipal Water District (MWD) operates a Water Treatment Plant (WTP) which is located in Crosby County, Texas near Spur.  The WTP provides potable water to the cities of Crosbyton, Post, Ralls, and Spur. Chlorine gas is used in the disinfection process at the White River MWD plant.  Up to 8,000 pounds of chlorine may be stored at the White River MWD plant. (A?68.155(b))  Because the stored quantity of chlorine onsite exceeds the threshold quantity, White River MWD developed this Risk Management Plan (RMP).  The White River MWD plant is subject to Program 2 RMP requirements.  In order to oversee implementation of the plan, a Management System overseen by the White River MWD General Manager is implemented to ensure that the RMP and associated Prevention Program are implemented correctly and maintained up-to-date.\n\nAs part of the requirements for the Risk Management Prevention Program, a Hazard Assessment was conducted that evaluated worst case and alternative chlorine and ammonia release scenarios.  The worst-case chlorine release scenario is based on the United States Environmental Protection AgencyA?s (EPAA?s) RMP Comp program and involves the release of the entire contents of one 2,000-pound cylinder over a 10-minute period as a result of a catastrophic failure of the chlorine cylinders. The distance to the toxic endpoint as determined using RMP Comp is 3.1 miles. The potential number of off-site residents affected by the worst case scenario as determined by LandView6 is 116 persons.  The public receptors in the release area are the recreation areas around White River Lake, a church, and residences.  There are no federally designated or state-designated environmental receptors in the area.   \n\nThe alternative chlorine release scenario assumes a more realistic situation in which a connective pipe is damaged.  The distance to the toxic endpoint in the alternative chlorine release scenario as determined using NOAAA?s ALOHA model in conjunction with RMP Co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007682,
      "SummaryText": "mp is 0.2 miles.  Using LandView6 it was determined that there are no potential off-site residents located in the potentially affected alternative chlorine release area. The public receptors in the alternate scenario release area consist of recreation areas.  There are no other public receptors in the release area (no residences, schools, or office buildings.)  There are no federally designated or state-designated environmental receptors in the area.   \n\nA Prevention Program was also established, and expands upon the current practices already in-place at the WTP.  Written operating procedures are used in conjunction with on-the-job training to ensure that certified Water Treatment Plant (WTP) operators are proficient in performing their duties before being allowed to work with chlorine storage and feed systems.  Certified WTP operators conduct daily inspections and any problems with the chlorine and ammonia systems are documented and addressed.  In addition, the certified WTP operators insure that the equipment used in the disinfection process is maintained according to the manufacturersA? recommendations. (A?68.155(a) &(c))  Because of these efforts, the WTP has not had a chlorine release that resulted in an injury, either on-site or off-site, within the previous five (5) years. (A?68.155(d))  As part of the Program, White River MWD will periodically perform compliance audits, hazard reviews and incident investigations, according to a predetermined schedule described in the RMP and as needs dictate.  These compliance audits and hazard reviews document any planned changes to improve safety.  (A?68.155(f))  \n\nThe White River MWD WTP complies with the emergency response regulations per Occupational Safety and Health Administration (OSHA) 29 CFR A?1910.38, as well as with applicable fire codes and the standards set forth by the Chlorine Institute.  The White River MWD WTP is a non-responding facility for emergency response.   As such, the White River MWD WTP does not h"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007682,
      "SummaryText": "ave an Emergency Response Plan; rather, the White River MWD WTP is included in the Crosby County Local Emergency Planning CommitteeA?s (LEPC) regional Emergency Response Plan.  WTP operators are trained to contact the City of Ralls Fire Department Chemical Hazard Team via 911 in the event of a release.  The City of Ralls Fire Department Chemical Hazard Team will serve as the first responder and coordinate the emergency response, including the evacuation of surrounding residents when required (A?68.155(e)).  \n"
    }
  ]
}