{
  "FacilityID": 1000055207,
  "FacilityName": "Liguria Foods Inc",
  "FacilityStr1": "1515 N 15th St",
  "FacilityStr2": null,
  "FacilityCity": "Humboldt",
  "FacilityState": "IA",
  "FacilityZipCode": "50548",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19091",
  "LEPC": "Humboldt County LEPC",
  "FacilityLatDecDegs": "42.737985",
  "FacilityLongDecDegs": "-94.230442",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 809824639,
  "ParentCompanyName": "CTI Foods Holding Co.",
  "Company2Name": null,
  "CompanyDUNS": 808128966,
  "Company2DUNS": 0,
  "OperatorName": "Liguria Foods",
  "OperatorStr1": "1515 N. 15th Street",
  "OperatorStr2": null,
  "OperatorCity": "Humboldt",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50548",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ty Taylor",
  "RMPTitle": "Plant Manager",
  "FTE": 170,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000231652",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-10-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-02-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-01-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-01-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-01-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000069054,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000055207,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000070216,
          "ProcessID": 1000069054,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000085121,
          "ProcessID": 1000069054,
          "ChemicalID": 56,
          "Quantity": 23730.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000585121,
          "ProcessID": 1000069054,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055207,
      "SummaryText": "This is to inform all interested persons, including employees that Liguria Foods is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals, In this way we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.   Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.  Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.  \n\n\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.  Liguria Foods' will continue to conduct yearly evacuation drills and plan to improve safety through offering continual training for operators.\n\n\n\nLiguria Foods is located in Humboldt, Iowa and is a sausage processing facility. The facility operates one Engine Room for its ammonia refrigeration system located at the East side of the building.  The total anhydrous ammonia inventory in this single process is 23,730 lbs.\n\n\n\nThe Refrigeration System is operated as a singl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055207,
      "SummaryText": "e stage system with two operating temperatures, +5?F on the medium side and +15?F on the high side.  Both the medium side and high side systems use Controlled Pressure Liquid to feed all evaporators and drying rooms.  \n\n\n\nOn the medium side system, the controlled pressure liquid flows across the blast chiller coils where it picks up heat from the product, changing the ammonia from a liquid to a vapor.  The +5?F medium side ammonia vapor is sent from the blast chillers to the +5?F medium side accumulator via a suction header. Vapor from the medium temperature accumulator is fed to the medium side compressors. The compressed vapor from the medium side compressors is sent to the condensers. \n\n\n\nOn the high side system, the controlled pressure liquid flows across the various evaporator coils and drying rooms where it picks up heat from the product, changing the ammonia from a liquid to a vapor.  The +15?F high side ammonia vapor is sent from the evaporators and drying rooms to the +15?F high side accumulator via a suction header. Vapor from the high temperature accumulator is fed to the high side compressors. The compressed vapor from the high side compressors is sent to the condensers. \n\nDuring the compression phase in the high and medium stage compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig. The high-pressure ammonia vapor flows from the high stage compressors to the evaporative condensers where heat is removed, turning the vapor into a high pressure liquid.  The high-pressure liquid is converted to controlled pressure and collected in a controlled-pressure receiver.  The liquid collected in the controlled-pressure receiver provides liquid to the plant evaporators.\n\n\n\nThe emergency action plan at Liguria Foods requires all associates to be trained in safe evacuation and notification procedures in cases of actual or drill emergencies. Training shall include escape routes, notifi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055207,
      "SummaryText": "cation of appropriate response agencies, instructions on activating a building fire alarm system and what should be done after evacuating a building. To aid in the training process evacuation drills are conducted at the facility annually.  In the case of an emergency, Joe Christopherson is VP of Operations and is the primary Incident Commander. The alternate Incident Commander is Steve Dunkle, Director of Quality Assurance.  The Incident Commander will coordinate Liguria Foods' Emergency Action Plan and applicable emergency services with the following local agencies:\n\n\n\nHumboldt Emergency Management\n\n515-332-4809\n\n\n\nCity Police Department\n\n515-332-2600\n\n\n\nCity Fire Department\n\n515-332-2600\n\n\n\nUpon discovering an emergency situation, all employees shall immediately notify management or security using the phone, radio, or wireless phones. Management or Security are to notify refrigeration and the Primary Incident Commander (IC).  If the Primary IC is not available, the alternate IC shall be notified next.  The IC will determine if evacuation of the plant is the safest course of action and should activate the evacuation alarm if necessary.  If the emergency involves the release of ammonia and a decision is made to evacuate the plant, first determine the assembly area.  The location of the assembly area will be based on the current wind direction and will be upwind of the release area.   The use of an alarm horn/strobe will inform employees that they are to evacuate the building.  If your immediate contact options cannot be reached, dial 911.  In the event of an evacuation, all employees should proceed to the designated assembly area and await further instructions from their evacuation supervisor. Facility map identifying exit doors, evacuation routes and assembly areas are posted at various locations throughout the facility.  Once everyone has evacuated the facility and arrived at their designated meeting area, a head count must be conducted by the Emergency Coordinato"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000055207,
      "SummaryText": "r to account for missing people, including visitors and/or contractors in his/her area.  A daily crew/employee list shall be maintained for each department within the facility. Ten minutes will be allowed for critical unit operators to shutdown their equipment and reach the designated meeting location before attendance will be reported.  \n\n\n\nRegarding the worst case scenario assessment, the release of ammonia from the Controlled Pressure Receiver would release 13,444 lbs completely at the high level float switch.  If the level reaches the high level float switch controls are in place that shuts down the entire system and does not let any more ammonia enter this vessel.  If the 13,444 lbs were to release within 10 minutes, the distance to endpoint of the release would be 2.2 miles.\n\n\n\nThe scenario of a worst case ammonia release is unlikely due to the following reasons:\n\n\n\n1.    Worst-case weather conditions are uncommon.\n\n2.    Industry standards for the manufacture and quality control of pressure vessels.\n\n3.    Ammonia is not corrosive in this service.\n\n4.    Pressure safety valves limit operating pressure in this vessel.\n\n5.    Installed ammonia sensors in the engine room to warn of leaks.\n\n6.    The emergency action plan in place at the facility.\n\n\n\nLiguria Foods has not had any accidents to report since the commissioning of this plant in 1974.\n\n"
    }
  ]
}