{
  "FacilityID": 1000090311,
  "FacilityName": "Mobile Bay Onshore Treating Facility",
  "FacilityStr1": "6000 Deakle Road",
  "FacilityStr2": null,
  "FacilityCity": "Theodore",
  "FacilityState": "AL",
  "FacilityZipCode": "36582",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.429570",
  "FacilityLongDecDegs": "-88.181880",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": "www.wtoffshore.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "W&T Offshore, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 114284037,
  "Company2DUNS": null,
  "OperatorName": "W&T Offshore, Inc.",
  "OperatorStr1": "5718 Westheimer Road",
  "OperatorStr2": "#700",
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77057",
  "OperatorZipCodeExt": null,
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000212584",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "503-4011",
  "SafetyInspectionDate": "2020-05-02 00:00:00",
  "SafetyInspectionBy": "Alabama Oil and Gas Board",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-10-15 09:14:28",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-10-15 09:14:28",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-10-15 09:14:28",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-10-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.4319,
  "FRS_Long": -88.1825,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112322,
      "AltID": "H2S Treating Facility",
      "FacilityID": 1000090311,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140393,
          "ProcessID": 1000112322,
          "ChemicalID": 63,
          "Quantity": 20287.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000113654,
          "ProcessID": 1000112322,
          "NAICSCode": "21113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000095848,
              "Process_NAICS_ID": 1000113654,
              "SafetyReviewDate": "2020-09-30 00:00:00",
              "PHA_Date": "2016-02-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "PHA Delta Revalidation Technique",
              "PHACompletionDate": "2016-12-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-08-15 00:00:00",
              "TrainingReviewDate": "2020-09-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer-based training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer-based training",
              "MaintenanceReviewDate": "2020-08-15 00:00:00",
              "EquipmentInspectionDate": "2020-09-25 00:00:00",
              "EquipmentTested": "LEL Detectors (Numerous)",
              "ChangeMgmtDate": "2020-04-24 00:00:00",
              "ChangeMgmtReviewDate": "2020-02-20 00:00:00",
              "PreStartupReviewDate": "2015-09-02 00:00:00",
              "ComplianceAuditDate": "2019-02-14 00:00:00",
              "AuditCompletionDate": "2019-02-20 00:00:00",
              "IncidentInvestigationDate": "2011-05-03 00:00:00",
              "InvestigationChangeDate": "2015-07-29 00:00:00",
              "ParticipationPlansReviewDate": "2020-02-20 00:00:00",
              "HotWorkPermitReviewDate": "2020-02-20 00:00:00",
              "ContractorSafetyReviewDate": "2020-09-08 00:00:00",
              "ContractorSafetyEvalDate": "2020-02-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000119693,
                  "PreventionProgram3ID": 1000095848,
                  "ProcessChemicalID": 1000140393
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000090311,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-08-17 00:00:00",
    "ERTrainingDate": "2020-09-11 00:00:00",
    "CoordinatingAgencyName": "Mobile County EMA",
    "CoordinatingAgencyPhone": "2514608000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090311,
      "SummaryText": "Mobile Bay Onshore Treating Facility \r\nRisk Management Program Plan \r\nExecutive Summary\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe Mobile Bay Onshore Treating Facility has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention (e.g., training of personnel, considering safety in the design, installation, operation, and maintenance of the facility, etc.). Our approach is to implement reasonable controls to prevent foreseeable releases of regulated substances as well as other substances. If a release does occur, our trained personnel will take steps to control and contain it, until local emergency organizations arrive. Additional details are included in the other sections of this plan.\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\n\r\nThe Mobile Bay Onshore Treating Facility, located near Theodore, Alabama consists of one Program Level 3 process that utilizes several operations (e.g., separation, dehydration, compression, thermal oxidation) to treat hydrogen sulfide, a regulated substance, from a naturally occurring hydrocarbon gas mixture. Transportation of regulated substances into and out of the facility is handled via pipeline and truck. Additional details are included in the other sections of this plan.\r\nThis facility is located in a relatively undeveloped rural area surrounded by pine trees. A community road borders the facility. \r\n\r\nOffsite Consequence Analysis Results\r\n\r\nIn accordance with special security guidance provided by the USEPA, data addressing the facility's Offsite Consequence Analyses (Worst Case Scenario and Alternate Release Scenario) are not detailed in this section. Refer to Data Element Sections 2 and 3 of this plan.\r\n\r\nGeneral Accidental Release Prevention Program\r\n\r\nThe following is a summary of the accident prevention program in place at this facility. Processes at this facility regulated by EPA's Risk Management P"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090311,
      "SummaryText": "rogram (RMP) are also subject to OSHA's Process Safety Management (PSM) standard. This summary addresses each of the EPA RMP elements and describes the management systems in place to implement the accident prevention program.\r\n\r\nEmployee Participation\r\n\r\nThis facility provides for and encourages employees to participate in process safety management and accident prevention. Examples of employee participation range from updating/compiling technical information and drawings to participating on process hazard analysis (PHA) or incident investigation teams. Employees have the opportunity to participate in Safety Steering Committee to drive and improve the safety and accident prevention programs within each location.  \r\n\r\nProcess Safety Information (PSI)\r\n\r\nThis facility keeps a variety of technical documents that are used to help maintain safe operation of the facility. These documents address chemical properties and associated hazards, safe operating limits for key process parameters, specific chemical inventories, and equipment design basis/configuration information. The HSE contact at this facility is responsible for coordinating the PSI updates.\r\n\r\nChemical-specific information (including exposure hazards, emergency response, and exposure treatment considerations) is provided in safety data sheets. For specific process areas, this facility has documented safety-related operating limits for process parameters (e.g., temperature, pressure, level) in the operating procedures. This facility ensures processes are maintained within these limits using process controls/monitoring equipment, trained personnel, and protective instrument systems (e.g., automated shutdown systems, pressure relief valves).\r\n \r\nThis facility also maintains numerous technical documents that provide information about the design and construction of the process equipment. This information includes the materials of construction, design pressure, temperature ratings, and electrical rating of equipment."
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000090311,
      "SummaryText": "gram for this facility is coordinated with the Mobile County Emergency Management Agency. This facility has around-the-clock communications capability with the emergency response organizations (e.g., Mobile County Fire Department, Mobile County Sheriff's Department, Alabama State Police, and local ambulance services, etc.). These organizations are responsible (if necessary) for notifying the public, coordinating the community response (e.g., blocking off roads, evacuation, etc.), and providing onsite response (e.g., medical treatment, etc.). This facility conducts periodic emergency action drills and provides periodic refreshers to the local emergency response organizations on the hazards associated with the facility operations.\r\n\r\nRecent Changes to Improve Safety\r\n\r\nOur HSE&R systems are evergreen and are in a continuous state of improvement, usually through many small improvement steps. These improvement steps are tightly integrated with our training programs. This facility resolves findings from PHAs, incident investigations, and safety audits"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090311,
      "SummaryText": "This information, in combination with written procedures and trained personnel, provides a basis for inspection/maintenance activities and the evaluation of proposed process or facility changes.\r\n\r\nProcess Hazard Analysis (PHA)\r\n\r\nThis facility has a comprehensive program to help ensure hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure adequate controls are in place to manage these hazards.\r\n\r\nIn the most recent PHA cycle, the facility utilized a PHA delta revalidation process, an industry-accepted hazard evaluation technique for RMP and PSM-covered processes. The analyses are conducted using a team of facility operating/maintenance personnel, facility engineers, and technical consultants (as necessary). This team identifies and evaluates hazards of the processes as well as the accident prevention and mitigation measures.\r\n\r\nThe PHA team findings are forwarded to management to coordinate further evaluation and\r\nresolution. This process involves field level business teams, which include engineering, operations personnel, and management. Operations personnel are also involved in the evaluation of resolution options. Implementation of the resolutions is prioritized for accomplishment based on relative risk. Resolution plans are tracked until completed. The final resolution of each finding is documented and retained.\r\n\r\nTo help ensure the process controls do not eventually deviate significantly from the original design and as a tool to identify and mitigate potential hazards, this facility updates and revalidates the process hazard analysis at least every 5 years. The results of these updates are also documented and retained. Similarly, the team's findings are forwarded to management to coordinate further evaluation and resolution, and the final resolution of findings are documented and retained.\r\n\r\nOperating Procedures\r\n\r\nThis facility maintains writte"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000090311,
      "SummaryText": "n procedures that address the various modes of process operations (e.g., startup, normal, temporary, emergency shutdown, normal shutdown) and provide guidance on how to respond to upper/lower limit exceedances for specific equipment or process parameters. Procedures are readily available to operators and other personnel to use as necessary to safely perform their job tasks. These procedures provide a consistent basis for training new operators and are annually reviewed and validated. Computer based training and assessment guides are used to maintain proficiency. Revisions necessary to reflect changes are made through the Management of Change (MOC) process.\r\n\r\nTraining\r\n\r\nThe Computer based training, on the job training and assessment guides provide the framework to ensure operators and other employees achieve minimum required competencies to safely perform their work. The development and maintenance of written operating and maintenance procedures provide a comprehensive training program to employees involved in operating and maintaining process equipment. New employees receive basic training in facility operations (e.g., process overview, applicable procedure reviews, etc.). New operators are then paired with experienced operators to learn process-specific duties and tasks. After the new operators demonstrate (e.g., written tests, hands-on skills demonstration) that they have adequate knowledge to perform the duties and tasks in a safe manner on their own, they are certified and allowed to work independently. In addition, personnel who operate process equipment receive refresher training at least every 3 years on the applicable procedures to help ensure their skills and knowledge are maintained at an acceptable level. This training and the means used to verify that the employee understood the training are documented.\r\n\r\nContractors\r\n\r\nThis facility uses contractors to supplement its workforce for general maintenance or construction activity. Because some contractors"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000090311,
      "SummaryText": "work on or near process equipment, procedures are in place to help ensure contractors: perform their work in a safe manner, have the appropriate knowledge and skills, are aware of the hazards in the workplace, understand what they should do in the event of an emergency, understand and follow safety rules, and inform Mobile Bay Onshore Treating Facility personnel of any hazards they find during their work. This is accomplished by providing contractors an orientation prior to working in this facility which includes: process overview, information about safety and health hazards, applicable emergency action plan provisions, and information on safe work practices. Also, a job safety and environmental analysis (JSEA) is reviewed/updated or developed by the contractors (with facility personnel assistance as needed) prior to maintenance/construction tasks.\r\n\r\nFacility personnel routinely monitor contractor job performance to help ensure they are fulfilling their safety obligations. Contractor safety programs and performance are evaluated during the initial selection process, and the facility supervisor conducts periodic evaluations of safety performance.\r\n\r\nPre-Startup Safety Reviews (PSSR)\r\n\r\nThis facility conducts PSSRs for facility modifications that require significant changes in the process safety information. The purpose of the PSSR is to ensure safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides an additional check to make sure that construction is in accordance with the design specifications and supporting systems are operationally ready. A PSSR involves field verification of the construction and serves a quality function by verifying that the requirements of this accident prevention program are properly implemented. The Management of Change (MOC) is used to steward assignment and completion of PSSRs.\r\n\r\nMechanical Integrity (MI)\r\n\r\nFacility Integrity Manageme"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000090311,
      "SummaryText": "nt incorporates well-established practices and procedures to maintain pressure vessels, piping systems, relief/vent systems, controls, pumps, compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this MI program include: training, written procedures, inspections/tests, correction of identified deficiencies, and quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process. Maintenance personnel receive training on the process, safety and health hazards, applicable maintenance procedures, emergency procedures, and applicable safe work practices to help ensure they perform their jobs in a safe manner. Written procedures and equipment manuals help ensure work is performed in a consistent manner and provide a basis for training.\r\n\r\nInspections/tests and preventive maintenance are performed on a scheduled basis to help ensure equipment and safety devices function as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness, etc.). If a deficiency is identified, employees correct the deficiency before placing the equipment back into service or a group of experts (e.g., engineers, etc.) review the use of the equipment and determine what actions are necessary to ensure safe operation of the equipment until the deficiency can be corrected.\r\n\r\nAnother integral part of the MI program is quality assurance. This facility incorporates quality assurance measures into equipment purchases and repairs to help ensure new equipment is suitable for its intended use and proper materials/spare parts are used for repairs.\r\n\r\nHot Work and Other Safe Work Practices\r\n\r\nThis facility has long-standing safe work practices in place to help ensure worker and process safety. These include orientations for visitors/contractors; control of the entry/presence/exit of support personnel; energy isolation for equipment being worked on; procedures for the sa"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000090311,
      "SummaryText": "itors\r\n- Process Safety Controls (PSH, PSL, LSH, LSL, etc.)\r\n\r\nRelease Containment/Control....\r\n- Pressure/thermal relief valves/rupture disks that discharge into a flare system for incineration\r\n- Manual/automatic isolation valves\r\n- Automated shutdown systems for specific process parameter\r\n- Redundant equipment and instrumentation\r\n\r\nRelease Mitigation....\r\n- Fire extinguishing systems\r\n- Personal protective equipment\r\n- Bermed/diked areas surrounding vessels\r\n- Flame detectors to ensure the flare remains lit\r\n\r\nFive Year Accident History\r\n \r\nThe Mobile Bay Onshore Treating Facility has had an excellent record for accident prevention over the past 5 years. In fact, there have not been any incidents, as defined in the regulation.\r\n\r\nEmergency Response Program Information\r\n\r\nThis facility maintains a written emergency action plan in accordance with OSHA 1910.38 to protect the workers, public, and environment. The plan consists of procedures for handling releases regulated substances and other flammables and chemicals including the possibility of fires or explosions. The procedures address: facility/equipment isolation and shutdown, initial first aid and medical treatment for exposures (i.e., Safety Data Sheet information), evacuation plans for this facility, accounting for facility personnel after an evacuation, notification of local emergency response agencies, and post-incident cleanup/decontamination requirements. In addition, this facility has procedures that address the maintenance, inspection, and testing of emergency equipment and alarms. Facility personnel receive training on these procedures, as necessary, to perform their specific duties.\r\n\r\nThe emergency action plan is reviewed annually and updated when necessary. Plan changes required because of modifications to this facility or emergency response equipment are administered through the management of change process, which includes informing and/or training affected personnel.\r\n\r\nThe overall emergency pro"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000090311,
      "SummaryText": "fe removal of hazardous materials before opening of process piping/equipment; hot work permit/procedure to safely manage spark-producing activities; vehicle entry into process area; confined space entry permit/procedure to help ensure precautions are taken before entering confined spaces; safety and security device bypass expectations; simultaneous operations guidance; and behavioral job safety and environmental analyses (JSEAs) to identify and mitigate hazards associated with maintenance tasks. These practices, along with related procedures and training of affected personnel, form a system to help ensure operations and maintenance activities are performed safely.\r\n\r\nManagement of Change (MOC)\r\n\r\nThis facility has a comprehensive system to manage changes to process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes. The MOC facilitates appropriate review and authorization before a change is implemented. Changes are reviewed to ensure adequate controls are in place to manage any new hazards and to verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, equipment information, drawings, and procedures are updated for these changes. In addition, operating and maintenance personnel are provided the necessary training related to the change.\r\n\r\nIncident Investigation\r\n\r\nThis facility promptly investigates incidents that resulted in (or could have reasonably resulted in) a fire, explosion, release, major equipment/property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations, and forwards these results to management for resolution. Corrective actions taken in response to the investigation team's findings are tracked until"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000090311,
      "SummaryText": "completed. The final resolution of each finding is documented, and investigation results are reviewed with employees (including contractors) who could be affected. Incident investigation reports are retained for at least 5 years so that reports can be reviewed during the next PHA revalidation.\r\n\r\nCompliance Audits\r\n\r\nTo help ensure the accident prevention program is functioning properly, an audit is conducted at the facility at least once every 3 years to determine whether the program's procedures and practices are being implemented. An audit team consisting of both facility and technical personnel evaluate the implementation/effectiveness of the processes in this accident prevention program and develop findings that are documented and forwarded to management to coordinate resolution. Corrective actions are taken in response to the audit team's findings, and resolution status is tracked until actions are completed. The final resolution of each finding is documented and the two most recent audit reports are retained.\r\n\r\nChemical-Specific Prevention Steps\r\n\r\nThe processes at this facility have hazards that are managed to help ensure continued safe operation. The following is a description of existing safety features applicable to the prevention of accidental releases of the specific regulated substances.\r\n\r\nUniversal Prevention Activities\r\n\r\nThe accident prevention program previously summarized is applied to the RMP-covered processes at this facility. These prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human error.\r\n\r\nSpecialized Features\r\n\r\nThis facility has safety features on many units to: quickly detect a release, contain/control a release, and reduce/mitigate the consequences of a release. The following types of safety features are used throughout the facility:\r\n\r\nRelease Detection....\r\n- Hydrocarbon gas detectors/alarms\r\n- Hydrogen Sulfide gas detectors/alarms\r\n- Toxic and flammable gas mon"
    }
  ]
}