{
  "FacilityID": 1000106880,
  "FacilityName": "Trinity Frozen Foods, LLC",
  "FacilityStr1": "6064 Deep Branch Road",
  "FacilityStr2": null,
  "FacilityCity": "Pembroke",
  "FacilityState": "NC",
  "FacilityZipCode": "28348",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37155",
  "LEPC": "Robeson County LEPC",
  "FacilityLatDecDegs": "34.647391",
  "FacilityLongDecDegs": "-79.173960",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "https://www.trinityfrozenfoods.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Trinity Frozen Foods, LLC",
  "OperatorStr1": "6064 Deep Branch Road",
  "OperatorStr2": null,
  "OperatorCity": "Pembroke",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28372",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000250818",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-11-22 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-09-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-09-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-09-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000133584,
      "AltID": null,
      "FacilityID": 1000106880,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000167368,
          "ProcessID": 1000133584,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000135020,
          "ProcessID": 1000133584,
          "NAICSCode": "42442",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000115186,
              "Process_NAICS_ID": 1000135020,
              "SafetyReviewDate": "2023-09-05 00:00:00",
              "PHA_Date": "2023-12-31 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-03-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ventilation system in machine room",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-09-05 00:00:00",
              "TrainingReviewDate": "2023-09-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Online-based training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-09-05 00:00:00",
              "EquipmentInspectionDate": "2023-07-11 00:00:00",
              "EquipmentTested": "Fire alarm system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2023-09-05 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-09-05 00:00:00",
              "HotWorkPermitReviewDate": "2023-09-05 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2023-09-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000144481,
                  "PreventionProgram3ID": 1000115186,
                  "ProcessChemicalID": 1000167368
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106880,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Deep Branch Fire Department",
    "CoordinatingAgencyPhone": "9107392221",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106880,
      "SummaryText": "R), Machine Room Air Unit, and the pre-cool coil of the FPS Freezer. \n\nAt the Machine Room Air Unit, liquid ammonia flowing through the coil is partially boiled as it absorbs heat from the air in the Machine Room. The partially vaporized ammonia (liquid/vapor mixture) is returned to the High Temp LPR.\n\nThe high temperature recirculated liquid from the High Temp LPR experiences a pressure drop as it flows through the motorized valve or the hand expansion valve prior to entering the Low Temp LPR. The Low Temp LPR then pumps low temperature recirculated liquid to five evaporator coils within the FPS Freezer.  \n\nThe FPS Freezer consists of a pre-cool coil and five freezer coils. The precool coil receives high temp recirculated liquid from the High Temp LPR, while the five freezer coils receive low temp recirculated liquid from the Low Temp LPR. The liquid within the coils partially vaporizers as it absorbs heat from the product (potatoes or blueberries) passing through the unit. The wet suction (liquid/vapor mixture) from the precool coil returns to the High Temp LPR, while the wet suction from the freezer coils returns to the Low Temp LPR. \n\nFreezer coils #1-4 within the FPS Freezer also receive hot gas from the compressors for coil defrost. Coil defrost is sequential (one coil at a time) and occurs based on programming within the control panel for the FPS Freezer. Defrost of freezer coil #5 occurs when the FPS Freezer is shut down for cleaning. Defrost for the pre-cool coil is not necessary (frost/ice accumulation on the coil is not expected as the coil operates at a higher pressure/temperature).\n\nThe pressure/temperature of the High Temp LPR and Low Temp LPR is maintained by the compressors, which draw suction from the vessels. Compressor SC-1 draws high stage suction from the High Temp LPR whereas Compressors SC-2 to SC-4 draw low stage suction from the Low Temp LPR and economizer suction from the High Temp LPR. At the compressors, the temperature of the ammonia vap"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106880,
      "SummaryText": "ning, implementing practices consistent with industry standards, and performing inspections and tests to maintain the integrity of the equipment.  Trinity Frozen Foods has implemented some of the action items and is moving forward with addressing the remaining outstanding recommendations.  In addition, the facility plans to continue providing employees with a safe work environment through continued training on current policies and procedures and conducting audits to identify deficiencies and make improvements."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106880,
      "SummaryText": "f the equipment when operating parameters exceed safe operating limits.  Relief valves on pressurized ammonia vessels prevent equipment rupture in the event of overpressurization.  Regular inspections and tests are performed to ensure these controls are in good working order.\n\nFive Year Accident History\nAccording to the EPA RMP regulation, the five year accident history covers only certain releases:\n•\tThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.  \n•\tThe release must have caused at least one of the following:\no\tOn-site deaths, injuries, or significant property damage; or\no\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nThe system is of new construction and is estimated to start up in mid-September 2023; therefore, there have been no releases that meet the above criteria.\n\nEmergency Response Program\nTrinity Frozen Foods has developed an Emergency Action Plan (EAP) for the purpose of protecting employees and the surrounding community.  The EAP covers procedures for: 1) evacuating and accounting for visitors and employees, 2) addressing ammonia releases and other foreseeable emergencies that could occur onsite, 3) notifying external agencies and emergency response personnel, and 4) administering first aid measures for ammonia exposure. Employees are informed of the elements of the EAP and trained in the evacuation procedure.  In the event of an ammonia release, employees will evacuate or shelter-in-place, depending on the nature of the release, and the trained personnel will investigate the issue and contact the fire department for assistance as needed.\n\nPlanned Changes to Improve Safety\nA Process Hazard Analysis was performed on the ammonia refrigeration system, and the evaluation resulted in action items to improve safety at the facility.  The recommendations mainly consist of developing new procedures, providing employee trai"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106880,
      "SummaryText": "or rises as the pressure of the ammonia vapor increases. The resulting high stage discharge (high pressure ammonia vapor, or hot gas) is sent to the condensers and also routed to the FPS Freezer, specifically freezer coils #1-4, for coil defrost.\n\nCondensers EC-1 and EC-2 condense the high pressure ammonia vapor back to a high pressure liquid. The condensing process is facilitated by water that is sprayed on the condenser coils and air drawn over the coils by the condenser fans. The resulting high pressure ammonia liquid drains back to the High Pressure Receiver to be re-used in the refrigeration process.\n\nThe system is also equipped with an Auto Purger which removes non-condensables in the system (air and water).\n\nAccidental Release Prevention Program\nTrinity Frozen Foods has developed an accidental release prevention program for compliance with the EPA RMP regulation.  The program includes but is not limited to the following elements:\n•\tProcess safety information regarding the hazards of ammonia, and operating and technical specifications for the refrigeration system and the associated equipment;\n•\tWritten procedures for operating and maintaining the refrigeration system;\n•\tTraining for personnel involved with system operations and maintenance;\n•\tWritten procedures for safely introducing modifications to the process;\n•\tInvestigating releases of ammonia and near miss incidents and implementing measures to prevent recurrence; \n•\tWritten procedures for conducting hot work on or near the process;\n•\tContractor management policies to ensure contract employee safety while on facility premises;\n•\tAudit procedures for ensuring that the programs are being implemented in accordance with the regulations; and\n•\tEmployee involvement in program development and implementation.\n\nIn addition, engineering controls have been implemented to reduce the chance of an accidental release to the environment.  These are comprised of equipment monitoring systems and safety controls to shut of"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106880,
      "SummaryText": "Accidental Release and Emergency Response Policies\nTrinity Frozen Foods is committed to providing a safe environment to its employees and surrounding communities. This commitment is reflected in the safety and environmental programs that are implemented at the facility.  For example, written procedures have been created for operating the ammonia refrigeration system.  Only trained operators are permitted to perform system operations.  Trinity Frozen Foods has also developed a robust maintenance program to ensure the equipment is in good operating condition. All of these programs are geared towards the prevention of an accidental release at the facility.  In addition, these programs incorporate emergency procedures to mitigate the effects of a release if it does occur.  At such an event, emergency coordinators will assess the situation and notify outside responding agencies as necessary.\n\nStationary Source and Regulated Substance\nTrinity Frozen Foods is located at 6064 Deep Branch Road in Pembroke, North Carolina.  Ammonia is used as a refrigerant in the facility’s refrigeration system.  The system is used to freeze food products (potatoes and blueberries).  The system uses a maximum of 13,000 pounds of ammonia. A description of how the refrigeration system operates is as follows.\n\nThe refrigeration cycle begins with the transfer of liquid ammonia from the evaporative condensers to the High Pressure Receiver. The High Pressure Receiver feeds high pressure liquid ammonia to the compressors SC-1 – SC-4 as liquid injection for oil cooling purposes. Liquid in the High Pressure Receiver is also fed to the High Temperature Low Pressure Recirculator (High Temp LPR).  \n\nPrior to entering the High Temp LPR, the high pressure liquid experiences a pressure drop as it flows through the motorized valve or the hand expansion valve of the liquid feed assembly. The High Temp LPR then pumps high temperature recirculated liquid to the Low Temperature Low Pressure Receiver (Low Temp LP"
    }
  ]
}