{
  "FacilityID": 1000066600,
  "FacilityName": "Aneth Central Gas Processing Plant",
  "FacilityStr1": "1.5 Miles North Hwy 262",
  "FacilityStr2": "Mile Post 21",
  "FacilityCity": "Montezuma Creek",
  "FacilityState": "UT",
  "FacilityZipCode": "84534",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49037",
  "LEPC": "San Juan County LEPC",
  "FacilityLatDecDegs": "37.29765",
  "FacilityLongDecDegs": "-109.26023",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Elk Petroleum, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Elk Petroleum, Inc.",
  "OperatorStr1": "1700 Lincoln Street",
  "OperatorStr2": "Suite 2550",
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80203",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000214216",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "NN-OP-00-02",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-12-18 17:51:08",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-11-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-11-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-11-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.29836,
  "FRS_Long": -109.26358,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000083498,
      "AltID": "Hydrocarbon Liquids",
      "FacilityID": 1000066600,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000104167,
          "ProcessID": 1000083498,
          "ChemicalID": 98,
          "Quantity": 19752.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000084699,
          "ProcessID": 1000083498,
          "NAICSCode": "211111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000070374,
              "Process_NAICS_ID": 1000084699,
              "SafetyReviewDate": "2018-12-11 00:00:00",
              "PHA_Date": "2017-12-20 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-08-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Electrical Area Classification",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-12-11 00:00:00",
              "TrainingReviewDate": "2018-12-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-12-11 00:00:00",
              "EquipmentInspectionDate": "2018-12-11 00:00:00",
              "EquipmentTested": "Process piping and equipment",
              "ChangeMgmtDate": "2017-09-08 00:00:00",
              "ChangeMgmtReviewDate": "2018-12-11 00:00:00",
              "PreStartupReviewDate": "2013-06-05 00:00:00",
              "ComplianceAuditDate": "2018-12-11 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": "2015-03-12 00:00:00",
              "InvestigationChangeDate": "2015-06-15 00:00:00",
              "ParticipationPlansReviewDate": "2018-12-10 00:00:00",
              "HotWorkPermitReviewDate": "2018-12-11 00:00:00",
              "ContractorSafetyReviewDate": "2018-11-29 00:00:00",
              "ContractorSafetyEvalDate": "2018-11-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000087233,
                  "PreventionProgram3ID": 1000070374,
                  "ProcessChemicalID": 1000104167
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000066600,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-05-31 00:00:00",
    "ERTrainingDate": "2018-10-11 00:00:00",
    "CoordinatingAgencyName": "San Juan County EMS",
    "CoordinatingAgencyPhone": "8002697911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000066600,
      "SummaryText": "ess, process technology information, and process equipment data.  The process safety information is updated whenever process changes are made.\r\n\r\nAccurate and complete process safety information enables the Facility's employees and contractors involved in operating and maintaining the Facility to identify and understand the hazards of the process.  Process safety information is used to conduct process hazard analysis on the existing process or a proposed modification to a process.  \r\n\r\nProcess Hazard Analysis (PHA):  The Aneth Unit Central Gas Processing Facility is committed to performing a detailed hazard analysis of each covered process to identify, evaluate, and control hazards involved in the processes.  Each process is systematically examined to identify potential hazards, controls in place to manage these hazards, and recommend additional controls, as appropriate.\r\n \r\nThe Facility uses the hazard and operability (HAZOP) and check list PHA methodologies, which are conducted using a team of people who have operating,  maintenance, safety, and engineering expertise.  The team identifies and evaluates potential hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and / or mitigation measures.\r\n\r\nAs a minimum the Aneth Unit Central Gas Processing Facility will perform periodic PHA reviews or revalidations every 5 years as long as the process is operating.\r\n\r\nPHA findings and recommendations and their resolution are documented.  The Facility has implemented a system to address and resolve all PHA findings and recommendations in a timely manner through a written schedule.  All recommendations must be resolved by management and PHA findings and recommendation resolutions are communicated to all effected employees.  .\r\n\r\nOperating Procedures: The Aneth Unit Central Gas Processing Facility has developed and implemented written operating procedures that describe the tasks that facility operators a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000066600,
      "SummaryText": "nd transport drivers must perform, the safe process operating parameters that must be maintained, and safety precautions for operations and maintenance activities.  The Facility's written operating procedures address various modes of process operations, including: (1) initial start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) emergency operations, (6) normal shutdown, and (7) start-up after turnaround.  \r\n\r\nContractors:  The Aneth Unit Central Gas Processing Facility has developed and implemented a program to ensure that contractors used to supplement its employee workforce to perform maintenance, renovation or specialty work on or near RMP / PSM-covered processes are qualified to perform the work and are informed of the potential hazards.\r\n\r\nPre-startup Safety Reviews (PSSR's):  The Aneth Unit Central Gas Processing Facility requires a pre-startup safety review (PSSR) be performed and documented for any physical modification -to the PSM-covered processes.  Additionally, any new units added at the Facility that is considered a PSM-covered process will also require a PSSR be performed and documented.\r\n\r\nMechanical Integrity:   The Aneth Unit Central Gas Processing Facility has developed and implemented procedures to maintain the on-going mechanical integrity of critical process equipment in accordance with industry recognized and generally accepted good engineering practices.\r\n\r\nInspections and tests are documented and deficiencies outside of the acceptable limits are corrected in a safe and timely manner.  \r\n\r\nSafe Work Practices and Procedures:  The Aneth Unit Central Gas Processing Facility has developed and implemented safe work practices that include but are not limited to: methods for controlling plant entry; presence and exit of support personnel; lockout/ tagout procedures to ensure isolation of energy sources for equipment undergoing maintenance; hot work procedures and permits for work with the potential for generating ig"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000066600,
      "SummaryText": "Accidental release prevention and emergency response policies:\r\n\r\nThe Aneth Unit Central Gas Processing Facility (the Facility) has implemented the elements of an EPA Program 3 Risk Management Plan (RMP) and all the elements of OSHA's Process Safety Management (PSM) program.  The Facility complies with Company policies and procedures for compliance with applicable federal, tribal, state, and local laws.  If an emergency were to occur, it is Company policy to notify the San Juan Country Central Dispatch and appropriate Navajo Nation emergency response agencies to request they respond to the emergency.\r\n\r\nThe Stationary Source and Regulated substances:\r\n\r\nThe Aneth Unit Central Gas Processing Facility is a carbon dioxide (CO2) compression facility that recycles CO2 collected from the Aneth Unit producing oil wells, removes moisture and hydrocarbon condensate from the CO2, and stabilizes the recovered hydrocarbon condensate.  The pressure of the CO2 is then increased by compression and re-injected into Aneth Unit CO2 injection wells to enhance the tertiary recovery of oil.  Propane, a PSM/RMP-regulated substance, is used in the refrigeration system as part of the condensate stabilization process. The presence of propane in a pressurized tank in quantities exceeding 10,000 pounds subjects the Facility to PSM and RMP requirements.\r\n\r\nGeneral Accidental Release Prevention Program:\r\n\r\nThe Aneth Unit Central Gas Processing Facility has developed and implemented the following general accidental release and prevention program elements in accordance with the elements of a Program 3 Risk Management Plan (RMP) accident prevention rule,  the elements of OSHA's Process Safety Management (PSM) standard, and other applicable industry standards, codes, and regulations:\r\n\r\nProcess Safety Information:  The Facility has compiled written process safety information for all PSM-covered processes.  The process safety information includes the hazards of chemicals used or produced in the proc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000066600,
      "SummaryText": "trained in the execution of the Emergency Response Plan and drills are conducted annually.\r\n\r\nEmergency response program changes are administered through the MOC process.\r\n\r\nPlanned Changes to Improve Safety:\r\n\r\nThere are currently no planned changes to improve safety at the Facility."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000066600,
      "SummaryText": "nition sources in the presence of flammable or combustible material; and confined space entry permits and procedure to ensure that adequate precautions are in place before entry is allowed into a permit-required confined space.\r\n\r\nTraining:  The Aneth Unit Central Gas Processing Facility has developed and implemented a comprehensive training program for all employees involved in operating a PSM-covered process.  The training programs may include classroom, and practical training.  Employees are tested to demonstrate their understanding of the training and competency.\r\n\r\nManagement of Change:  The Aneth Unit Central Gas Processing Facility requires that a management of change (MOC) review be performed for any modification to equipment, procedures, products and process parameters of a PSM-covered process.  \r\n\r\nIncident Investigation:  The Aneth Unit Central Gas Processing Facility requires that any incidents resulting in the release of regulated substances, or a siginificant near miss, must be investigated as soon as possible, but no later than 48 hours following the incident.  The Facility has established a system to promptly address, resolve, and communicate incident investigation findings and recommendations.  \r\n\r\nCompliance Audits:  The Aneth Unit Central Gas Processing Facility will conduct regular internal compliance audits to ensure that the Facility is in compliance with all applicable elements of the EPA Risk Management Plan (RMP) accident prevention rule, OSHA Process Safety Management (PSM) Standard, and other applicable requirements.\r\n\r\nFive-year Accident History:\r\n\r\nNo release of a regulated substance has occurred in the last 5 years.  \r\n\r\nEmergency Response Program Information:\r\n\r\nThe Aneth Unit Central Gas Processing Facility Emergency Response Plan is site-specific.  It includes emergency response actions required by plant employees, as well as requirements for notification and coordination with local responders and agencies. All affected employees are"
    }
  ]
}