{
  "FacilityID": 1000007054,
  "FacilityName": "Red Bluff Water Treatment Plant",
  "FacilityStr1": "120 North Red Bluff Road",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77506",
  "Facility4DigitZipExt": "1531",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Southeast Regional LEPC",
  "FacilityLatDecDegs": "29.718056",
  "FacilityLongDecDegs": "-095.210278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Coastal Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Coastal Water Authority",
  "OperatorStr1": "One Allen Center, Suite 2800",
  "OperatorStr2": "500 Dallas Street",
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": "4708",
  "RMPContact": "Mike Kent",
  "RMPTitle": "Adminstrator, Ops, Procurement, MIS",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000024118",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-02-20 00:00:00",
  "DeRegistrationEffectiveDate": "2014-01-09 00:00:00",
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.72,
  "FRS_Long": -95.21,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000008217,
      "AltID": "Chlorination System",
      "FacilityID": 1000007054,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000008423,
          "ProcessID": 1000008217,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000009199,
          "ProcessID": 1000008217,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000509199,
          "ProcessID": 1000008217,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007054,
      "SummaryText": "Coastal Water Authority\nRed Bluff Water Treatment Plant\n\nRISK MANAGEMENT PROGRAM PLAN\nExecutive Summary\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response policies at Coastal Water Authority's Red Bluff facility are engrained in the fundamentals of our prevention program. \n\nThe Red Bluff Water Treatment Plant presently handles one chemical that is considered toxic by the Environmental Protection Agency (EPA).  The same properties that make this chemical valuable for making drinking water safe also make it necessary to observe specific safety precautions.  These safety precautions are exercised in the operation and maintenance of our chlorination system to control human and environmental exposure in an effort to reduce the overall threat to our workers as well as the surrounding communities.  \n\nIt is Coastal Water Authority's policy to adhere to all applicable federal, state and local rules and regulations.  However, the safe handling of hazardous chemicals is paramount at CWA and we often exceed standards and recommended practices governing the safe handling of hazardous chemicals to ensure that we have obtained a reasonable level of risk reduction\n\nWe believe that accountability for safety reaches throughout all levels of management at CWA.  Senior managementA?s commitment and dedication to continued safe-operating practices is clearly evident in our organization structure and employee empowerment. \n\nFacility Description and regulated substances handled\n\nThe Red Bluff plant site covers approximately 4 acres within the Pasadena City limits.  It is located at 120 North Red Bluff, Pasadena, Texas in Harris County. Our facility is designed to treat a maximum of 9,000,000 gallons of water per day.\n\nThere is a maximum of six (6) full-time employees at the plant site at any one time. \n\nWe presently handle only one chemical which is considered toxic by the EPA.   This substance is present in quantities "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007054,
      "SummaryText": "greater than the threshold quantity identified by the RMP regulation and therefore is included in our risk management program.  \n\nChlorine:  Chlorine is used as a water treatment chemical at the plant. It is received into the plant in one ton containers.  These containers are standard DOT and Chlorine Institute specified containers.  Deliveries of chlorine are received at the plant every three (3) months.  The plant has a maximum inventory of 8,000 pounds of chlorine onsite; however, only one container (2,000 pounds) is being used at any one time.  \n\nAccidental release program & chemical-specific prevention steps:\n\nCoastal Water Authority contracted with an outside engineering firm to assist in the development of a prevention program tailored exclusively to water treatment operations.  This prevention program was designed around mechanical integrity and training aspects.  The primary objective of our prevention program is to ensure complete containment of chlorine through safe operation and maintenance of the chlorination system.  \n\nThe prevention program has been designed with the following objectives:\n\nEnhancement of the mechanical integrity of all chlorine equipment and piping,\nCompilation of safety information to improve hazard awareness, and\nTraining to increase hazard recognition\n\nFive year accident history\n\nCWA has a very comprehensive Incident Reporting and Investigation procedural process.  This process is defined and explained by CWA-008.  Basically, an incident occurs when a deviation from expected performance is experienced.  \n\nFormal investigations are required to be conducted by appointed teams knowledgeable in operations or equipment being investigated.  Root cause and corrective actions are also required in order to determine incident prevention steps.  Progress regarding corrective action on all investigated incidents is required to be tracked through to completion.\n\nCoastal Water Authority's Red Bluff plant has not had an accidental release of EPA "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007054,
      "SummaryText": "regulated chemicals within the past five years that resulted in an onsite injury or affected the community adversely. \n\nEmergency response program\n\nAt CWA's Red Bluff Water Treatment Plant, we handle one regulated toxic substance (chlorine) over threshold quantities.  We made a decision to not respond to catastrophic releases of chlorine at the Red Bluff plant.  Instead, our employees have been instructed to call 911 and notify the Pasadena Fire Department and Southeast Regional LEPC, and to evacuate in the event of such a catastrophic incident.  CWA maintains a Chlorine Institute Emergency Kit B and Scott Air Packs on-site for emergency response.\n\nIn accordance with the requirements of the Risk Management Program rule, CWA is included in the Southeast Regional LEPC local emergency response plan under the Emergency Planning and Community Right-to-Know Act (EPCRA). \n\nPlanned improvements to reduce risk\n\nInvestigation of inherently safer technologies presented by the Chlorine Institute, chlorine inventory reduction studies, and fail safe design applications are a few of the continuous improvements occurring at CWA.  We have also recently purchased and installed a halogen auto-close system for chlorine valves.  We plan to upgrade the system in the near future by replacing the chlorine system with a bleach system.  Safety depends upon our management commitment, the manner in which we handle chlorine, the safety devices inherent to our chlorination system, our operating procedures and philosophies, and the training of our employees."
    }
  ]
}