{
  "FacilityID": 1000119172,
  "FacilityName": "Ergon Terminaling, Inc. - Marietta",
  "FacilityStr1": "35020 State Route 7",
  "FacilityStr2": null,
  "FacilityCity": "Newport",
  "FacilityState": "OH",
  "FacilityZipCode": "45768",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39167",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "39.3813708",
  "FacilityLongDecDegs": "-81.2837006",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ergon.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Ergon Terminaling, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ergon Terminaling, Inc. - Marietta",
  "OperatorStr1": "35020 State Route 7",
  "OperatorStr2": null,
  "OperatorCity": "Newport",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45768",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000228773",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-11-06 00:00:00",
  "SafetyInspectionBy": "United States Coast Guard",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-03-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2025-03-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2025-03-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2030-03-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 39.38179,
  "FRS_Long": -81.28458,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000148727,
      "AltID": "Condensate Stabilization",
      "FacilityID": 1000119172,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000186060,
          "ProcessID": 1000148727,
          "ChemicalID": 155,
          "Quantity": 770000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000166100,
              "ProcessChemicalID": 1000186060,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000166101,
              "ProcessChemicalID": 1000186060,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000166102,
              "ProcessChemicalID": 1000186060,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000166103,
              "ProcessChemicalID": 1000186060,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000166104,
              "ProcessChemicalID": 1000186060,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000150462,
          "ProcessID": 1000148727,
          "NAICSCode": "32419",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000127223,
              "Process_NAICS_ID": 1000150462,
              "SafetyReviewDate": "2024-12-02 00:00:00",
              "PHA_Date": "2024-12-02 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2027-12-15 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Freezing Temperatures",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Monitors",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-11-19 00:00:00",
              "TrainingReviewDate": "2024-12-17 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-12-17 00:00:00",
              "EquipmentInspectionDate": "2024-12-09 00:00:00",
              "EquipmentTested": "Relief Valve Inspection",
              "ChangeMgmtDate": "2024-01-08 00:00:00",
              "ChangeMgmtReviewDate": "2024-12-05 00:00:00",
              "PreStartupReviewDate": "2024-10-18 00:00:00",
              "ComplianceAuditDate": "2022-06-08 00:00:00",
              "AuditCompletionDate": "2024-04-15 00:00:00",
              "IncidentInvestigationDate": "2019-06-19 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2024-11-20 00:00:00",
              "HotWorkPermitReviewDate": "2024-12-17 00:00:00",
              "ContractorSafetyReviewDate": "2024-12-05 00:00:00",
              "ContractorSafetyEvalDate": "2024-12-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000159400,
                  "PreventionProgram3ID": 1000127223,
                  "ProcessChemicalID": 1000186060
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000119172,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-11-16 00:00:00",
    "ERTrainingDate": "2024-12-17 00:00:00",
    "CoordinatingAgencyName": "Marietta Fire Department",
    "CoordinatingAgencyPhone": "7403733131",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "Yes",
    "LEPCCoordinationDate": "2024-12-10 00:00:00",
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2024-12-10 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000119172,
      "SummaryText": "This is an executive summary of the policies, procedures and activities that ensure compliance with the EPA's Accidental Release Prevention Requirements - Risk Management Program pursuant to Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) for Ergon Terminaling, Inc. (Ergon) Condensate Stabilization Facility.\n\nThe accidental release prevention and emergency response policies at the stationary source [40 CFR 68.155(a)]:\nErgon's accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. This Risk Management Plan (RMP) involves the preparation of response plans that are tailored to this facility and to the emergency response services available in the community.\n \nThe stationary source and regulated substances handled [40 CFR 68.155(b)]:\n\nStationary Source, Regulated Substances Handled & Covered Process:\n\nThe Ergon Marietta Condensate Stabilization Facility, located at 35020 State Route 7, Newport, Ohio 45768 has been designed in accordance with good engineering practices, sound operating philosophies, and is consistent with Ergon's engineering and operational guidance. The produced NGL meets the criteria for classification as Liquefied Petroleum Gas (LPG) by the State of Ohio. Therefore, the NGL storage and trucking loading facilities have been designed per Ohio State Fire Code 1301:7-7-38 and NFPA-58. If an emergency should occur, it is our policy to notify the Marietta Fire Department and request that they respond to the emergency. Our employees are trained in the use of portable fire extinguishers for the extinguishment of fires at the incipient stage. \n\nThe Condensate Stabilization unit is designed to reduce the Reid vapor pressure of unstabilized condensate. The stabilized condensate product can be safely shipped via barge while the resultant NGL is compressed, condensed, and stored in two 90,000-gallon bullet tanks. An NGL truck loading facility is included in this operating"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000119172,
      "SummaryText": "facility. The facility is manned 24 hours per day and the control system utilizes PLC's for control of the safety systems and the process. The system is designed fail safe with process interruption, fire & gas detection, and emergency shutdown.\n \nThe general accidental release prevention program and chemical-specific prevention steps [40 CFR 68.155(c)]:\n\nThis facility complies with EPA's accident prevention rule, the OSHA PSM standard, and all applicable state and local codes and regulations. The NGL system is designed, installed, and maintained in accordance with NFPA-58 and state law. The accident prevention program elements include the following:\n\nProcess Safety Information - Written process safety is an assemblage of equipment design specifications, process technology knowledge, and chemical hazard information. This reference material includes Piping and Instrumentation Drawings (P&ID's), materials of construction, design codes and engineering standards. The Process Safety Information is used to perform a Process Hazard Analysis which studies any potential safety consequences resulting from process deviations and the adequacy of the installed safeguards. \n\nProcess Hazard Analysis - In order to identify the process hazards associated with the facility, Ergon conducted a Process Hazard Analysis (PHA). The primary method of PHA selected was the Hazard and Operability (HAZOP) Study. The HAZOP Study is a scenario-based method of hazard evaluation that was developed for continuous and batch plant processes. The HAZOP Study was judged to be an effective method of hazard evaluation for the majority of the processes being evaluated by Ergon. A \"What-If\" analysis was used as a secondary method of analysis to supplement the HAZOP method. Review and updates of the process hazard analysis will be conducted every 5 years. \n \nOperating Procedures - Operating Procedures have been developed to guide the various phases of unit operation as well as safe work practices. The procedu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000119172,
      "SummaryText": "res contain action steps, process conditions, personnel responsibilities, safe operating limits, and how to respond to abnormal conditions. \n\nTraining - Training is one of the most critical elements of risk management. Requirements for operating personnel include initial training on the process, procedures, hazards and safe work practices, refresher training is required every three years. All employees receive basic training consisting of an overview of the process and the hazards present.\n\nMechanical Integrity - The Mechanical Integrity element helps to assure that the condition of critical equipment is monitored, maintained, and documented. Ergon utilizes a computerized maintenance management system to help organize mechanical integrity activities and records. Regularly scheduled inspection and preventative maintenance intervals comply with applicable codes and good engineering practice.\n\nManagement of Change - Numerous industrial incidents have been caused by unauthorized or inappropriate changes to equipment. The Marietta Terminal follows a Management of Change (MOC) procedure where additions, deletions, or modifications undergo thorough review. The MOC procedure documents the basis and scope of the change, the effect on hazards, updates to Process Safety Information, Procedures, and Training.\n\nPre-Startup Review - Prior to startup of a changed process or affected part of the process, employees involved in operating the process, maintaining the process, and contract employees affected by a change are informed of and trained in the changes. Additionally, process safety information and operating procedures are updated to reflect the changes necessary.\n\nCompliance Audits - RMP compliance audits will be conducted at least every three (3) years. The audit procedures include an examination of the written RMP Plan and documentation, interviews with responsible personnel, and visual inspections of the site and equipment. A standard audit form is used to document each st"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000119172,
      "SummaryText": "ep and to ensure an effective audit is conducted and proper follow-up is accomplished.  \n\nIncident Investigation - Incidents that result in or could have resulted in a release of the flammable mixture/explosion are investigated immediately. Each incident is investigated in an attempt to identify the root cause of the incident and to implement corrective actions to prevent future incidents. The incident investigation elements include a description of the accident, process description, process flow diagram, recommendations and review with affected personnel.\n\nEmployee Participation - Employee Participation is an element that is integrally linked to all the other elements. Employee participation is a core part of our business strategy. Employees are involved in documenting process safety information, conducting hazard analysis, writing and reviewing procedures, conducting training, managing change, investigating incidents, and assuring safe work practices are followed.\n\nHot Work Permit - The hot work permits issued at the facility document that all fire prevention and protection requirements have been implemented prior to the start of any hot work operations. Each issued permit identifies the date(s) authorized to perform the hot work and the equipment on which the hot work is to be performed, as well as site preparation and safety equipment requirements and documentation.\n\nContractors - Prior to starting any work on or adjacent to the natural gas condensate stabilization process equipment and NGL storage tank, contractors are required to provide detailed information regarding their safety and health performance record. Contractors are then informed of potential hazards they may be exposed to; emergency action plans in place and required safe work practices. They are also informed of their responsibilities to ensure that their employees receive the necessary training. Periodic inspections of the contractor's performance are conducted to ensure safe work practices are b"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000119172,
      "SummaryText": "eing followed. Documentation is maintained that the listed requirements have been met.\n\nChemical Specific Prevention Steps - The natural gas condensate stabilization process including NGL storage has hazards that must be managed to ensure continued safe operation. Safety features applicable to prevention of accidental releases of regulated substances at the facility are in place to help prevent potential accidental scenarios that could be caused by equipment failures and human error. The facility has safety features on many units to help (a) contain/control a release (e.g., excess flow and isolation valves); (b) quickly detect a release (e.g., hydrocarbon detectors with alarms),and (c) reduce the consequences of (mitigate) a release (e.g., fire suppression and extinguishing).\n\nThe five-year accident history [40 CFR 68.155(d)]:\n\nThe Ergon Marietta facility has had zero RMP reportable incidents in the previous five years.\n\nThe emergency response program [40 CFR 68.155(e)]:\n\nIn the event of an emergency involving the liquefied petroleum gas system, it is our policy to notify the Marietta Fire Department and request that they respond to the emergency. We train our employees in the use of portable fire extinguishers and to respond to fires in the incipient stage to prevent a more severe emergency.\n\nPlanned changes to improve safety [40 CFR 68.155(f)]:\n\nErgon is committed to continuous improvement and will continue to review the operation and make improvements where appropriate to further improve safety."
    }
  ]
}