{
  "FacilityID": 1000049020,
  "FacilityName": "ISP Lima LLC",
  "FacilityStr1": "1220 South Metcalf Street",
  "FacilityStr2": null,
  "FacilityCity": "Lima",
  "FacilityState": "OH",
  "FacilityZipCode": "45804",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39003",
  "LEPC": "Allen County LEPC",
  "FacilityLatDecDegs": "40.718333",
  "FacilityLongDecDegs": "-084.116389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 363150108,
  "ParentCompanyName": "Ashland Inc",
  "Company2Name": null,
  "CompanyDUNS": 5003264,
  "Company2DUNS": null,
  "OperatorName": "ISP Lima LLC",
  "OperatorStr1": "1220 South Metcalf Street",
  "OperatorStr2": null,
  "OperatorCity": "Lima",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45804",
  "OperatorZipCodeExt": null,
  "FTE": 41,
  "OtherEPAFacilityID": "45805BPCHMFORTA",
  "EPAFacilityID": "100000191491",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0302020343",
  "SafetyInspectionDate": "2012-06-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-04-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-04-10 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-04-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-04-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.718333,
  "FRS_Long": -84.116389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061451,
      "AltID": "BDO Manufacturing",
      "FacilityID": 1000049020,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000075405,
          "ProcessID": 1000061451,
          "ChemicalID": 118,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000062633,
          "ProcessID": 1000061451,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000051103,
              "Process_NAICS_ID": 1000062633,
              "SafetyReviewDate": "2014-11-06 00:00:00",
              "PHA_Date": "2014-11-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "an equivalent secondary containment",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-09-24 00:00:00",
              "TrainingReviewDate": "2012-10-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-07-15 00:00:00",
              "EquipmentInspectionDate": "2014-03-31 00:00:00",
              "EquipmentTested": "Butane Vaporizer (external inspection)",
              "ChangeMgmtDate": "2013-11-04 00:00:00",
              "ChangeMgmtReviewDate": "2013-01-31 00:00:00",
              "PreStartupReviewDate": "2013-11-22 00:00:00",
              "ComplianceAuditDate": "2015-03-16 00:00:00",
              "AuditCompletionDate": "2015-09-30 00:00:00",
              "IncidentInvestigationDate": "2013-05-29 00:00:00",
              "InvestigationChangeDate": "2013-07-31 00:00:00",
              "ParticipationPlansReviewDate": "2015-03-19 00:00:00",
              "HotWorkPermitReviewDate": "2015-02-13 00:00:00",
              "ContractorSafetyReviewDate": "2015-01-01 00:00:00",
              "ContractorSafetyEvalDate": "2014-11-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000062457,
                  "PreventionProgram3ID": 1000051103,
                  "ProcessChemicalID": 1000075405
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000049020,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-11-18 00:00:00",
    "ERTrainingDate": "2014-12-31 00:00:00",
    "CoordinatingAgencyName": "Allen County LEPC",
    "CoordinatingAgencyPhone": "4192273535",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000049020,
      "SummaryText": "The ISP Lima Plant is committed to operating in a manner that is safe for Lima Plant workers, the public and the environment.  As a member of the American Chemistry Council and the Synthetic Organic Chemical Manufacturers Association, ISP implements the principles of Responsible Care to ensure a safe and environmentally sound operation. In addition, as part of this commitment, the Lima Plant has established systems to help ensure safe operation of the processes at this facility.  One part of these systems is a Risk Management Program (RMP) that helps manage risk at the Lima Plant and that complies with the requirements of the Environmental Protection Agency's (EPA) rule 40 CFR part 68 Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a Risk Management Plan (RM Plan) describing the Risk Management Program at the Lima Plant.  This document is intended to satisfy the RM Plan executive summary requirements of the RMP rule and to provide the public with a description of that Risk Management Program.\r\n\r\n1.1 The Accidental Release Prevention and Emergency Response Policies\r\n\r\nThe ISP Lima Plant is committed to the safety of workers and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  The Plant implements reasonable controls to prevent foreseeable releases of hazardous substances.  In the event of a significant accidental release, our trained personnel will take appropriate action to minimize the effects of the release, summon the Emergency Response team (a shared service with Lima Chemical, ISP, and PCS), and summon the nearby Shawnee Township Response Team, who are trained to respond to chemical emergencies.\r\n\r\nISP's BDO Site General Manager has overall responsibility for the development and implementation of the Risk Management Program for the EPA-regulated process at Lima.  However, the specific responsib"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000049020,
      "SummaryText": "ilities for certain aspects of that program have been delegated to other personnel who report either directly, or through other management personnel, to the Site General Manager.  Those relationships are depicted on an organization chart.  Specific responsibility for the implementation of the Process Safety Management (PSM), accident prevention program, RMP hazard assessment and Risk Management Plan has been delegated to designated technical staff.  In keeping with our policy that safe operation is part of everyone's job, many other personnel are also involved in RMP activities on an ongoing basis.\r\n\r\n1.2  ISP's Lima Plant Regulated Substances\r\n\r\nThe ISP Lima Plant is a chemical manufacturing facility located south of the City of Lima, Ohio, in Allen County. The Lima Plant's primary product is 1,4 butanediol (BDO). Other by-products are gamma butyroactone (BLO) and Tetrahydrofuran (THF).  We use butane as our primary feed stock, which is received by pipeline from the Lima Refinery, which is adjacent to our facility.  Butane is a flammable gas and is present in the BDO process above the RMP rule threshold quantity. \r\n\r\n1.3 The Accidental Release Prevention Program\r\n\r\nThe following is a summary of the general accident prevention program in place at the Lima Plant.  Because butane, which is regulated by the EPA RMP regulation is also subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulation, and because the OSHA PSM requirements are very similar to the EPA RMP requirements for chemical manufacturing facilities, this summary addresses each of the OSHA PSM elements.  The PSM program at this facility has been extended, where necessary, to satisfy EPA's Program Level 3 accident prevention program requirements.\r\n\r\n1.3.1 Employee Participation\r\n\r\nISP encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000049020,
      "SummaryText": "echnical documents and chemical information, to participating as members of Process Hazard Analysis (PHA) teams, incident investigation teams, and plant and process inspection teams. Employees actively participate in behavior based safety observations of co-workers and contractors.  Employees also have access to all PHAs, incident investigations, inspection and observation documents and statistics.\r\n\r\n1.3.2  Process Safety Information\r\n\r\nThe Lima Plant keeps a variety of technical documents that are used to help maintain safe operation of the process. These documents address chemical properties and associated hazards, limits for key process parameters, specific chemical inventories, and equipment design basis/configuration information. Specific personnel within the Plant are assigned responsibility for maintaining up-to-date process safety information. \r\n\r\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in Material Safety Data Sheets (MSDSs). This information is supplemented by documents that specifically address known safety concerns and any known hazards associated with the inadvertent mixing of chemicals.  For specific process areas, the Plant has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in their product/process operating manuals.  The Plant ensures that the process is maintained within these limits by using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems). \r\n\r\nThe Plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc. This information, in combination with written procedures and trained personnel, provides a basis for establishi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000049020,
      "SummaryText": "ident prevention program requirements are properly implemented.\r\n\r\n1.3.8  Mechanical Integrity\r\n\r\nThe Lima Plant has established practices and procedures to maintain storage vessels, pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process equipment.\r\n\r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their job in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, management will correct the deficiency, in a timely manner, or management of change will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\r\n\r\n1.3.9  Safe Work Practices\r\n\r\nISP has long-standing safe work practices in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedure to control welding and other spark-pr"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000049020,
      "SummaryText": "oducing activities, and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\n1.3.10  Management of Change\r\n\r\nThe Lima Plant has a comprehensive system to manage changes to processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. The Plant maintains Management of Change procedures, which ensure that all changes to plant processes and operating procedures are reviewed and implemented to prevent work hazards.  In addition, operating and maintenance personnel are provided with any necessary training on the change.\r\n\r\n1.3.11  Incident Investigation\r\n\r\nISP promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, gas releases, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The Plant maintains a written Incident Reporting & Investigation program, which specifically addresses reporting of incidents, incident investigations, and the use of a Tracking & Management System, to help manage post accident activities.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwar"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000049020,
      "SummaryText": "the operator understood the training.\r\n\r\n1.3.6  Contractors\r\n\r\nThe Lima Plant uses contractors to supplement its work force during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the Plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform plant personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) information about safety and health hazards, (2) emergency response plan requirements, and (3) safe work practices prior to their beginning work.  The Plant maintains a Contractor Safety Program, which specifically addresses contractor safe work practices and is reviewed for accuracy and updates every 3 years.  In addition, the Plant evaluates contractor safety programs and performance during the selection of a contractor.  Plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\r\n\r\n1.3.7   Pre-startup Safety Reviews\r\n\r\nISP conducts a pre-startup safety review for any new facility or facility modification that requires a change in the process safety information.  The purpose of the review is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  The review team uses checklists to verify all aspects of readiness.  A review involves field verification of the construction and serves a quality assurance function by requiring verification that acc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000049020,
      "SummaryText": "ng inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\n1.3.3  Process Hazard Analysis (PHA)\r\n\r\nThe Lima Plant has a comprehensive PHA program to help ensure that hazards associated with the process are identified and controlled.  Within this program, the process is systematically examined to identify hazards and ensure that adequate controls are in place to manage those hazards.\r\n\r\nThe Plant primarily uses the hazard and operability (HAZOP) analysis technique to perform these evaluations.  HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques available.  The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and makes recommendations for additional prevention and/or mitigation measures when the team believes such measures are necessary. \r\n\r\nThe PHA team recommendations are reviewed with plant management for evaluation and resolution. Implementation of safety improvements in response to PHA findings is based on corporate risk acceptance criteria.  ISP utilizes a Layer of Protection Analysis (LOPA) method to guide in prioritization of these improvements.  This ensures that potential accident scenarios with the highest risks receive immediate attention.  All approved safety improvements being implemented in response to PHA team recommendations are tracked until they are complete.  The final resolution of each recommendation is documented and retained.\r\n\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the Plant periodically updates and revalidates the PHA results.  These periodic reviews are conducted at least every 5 year"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000049020,
      "SummaryText": "s and will be conducted at this frequency until the process is no longer operating. The results and recommendations from these updates are documented and retained. \r\n\r\n1.3.4  Operating Procedures\r\n\r\nThe Lima Plant maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, and (5) normal shutdown. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  Procedures are periodically reviewed and annually certified as current and accurate.  Procedures are maintained current by revising them as necessary to reflect changes made to the process.  In addition, the operating procedures provide guidance on how to respond to events that result in exceeding safe operating limits for specific process or equipment parameters.  The written operating procedures are readily available to operators in the process units and for other personnel to use as necessary to safely perform their job tasks.\r\n\r\n1.3.5  Training\r\n\r\nTo complement the written procedures for process operations, ISP has implemented a company training program for all employees involved in operating a process.  New employees receive basic training on site operations.  After successfully completing this training, a new operator is paired with an experienced operator to learn process-specific duties and tasks.  After operators demonstrate (e.g., through tests, skills demonstration) that they have adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years.  All of this training is documented for each operator, including the means used to verify that"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000049020,
      "SummaryText": "ds these results to site management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations. \r\n\r\n1.3.12  Compliance Audits\r\n\r\nTo help ensure that the accident prevention program is functioning properly, ISP periodically conducts audits to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years.  The audit develops findings that are forwarded to plant management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n\r\n1.4  Chemical-Specific Prevention Steps\r\n\r\nThe process at the Lima Plant presents potential hazards that must be managed to ensure continued safe operation. The accident prevention program summarized above is applied to the EPA RMP-covered process at the site. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures or human errors.\r\n\r\nIn addition to the accident prevention program activities listed above, the Lima Plant has safety features to help contain/control a release and reduce the consequences of a release.  The following types of safety features are used in various processes:\r\n\r\nRelease Containment/Control\r\nA·  Process relief valves prevent overpressure damage to equipment\r\nA·  Manual and automatic valves to permit isolation of the process\r\nA·  Automated shutdown syste"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000049020,
      "SummaryText": "ms for specific process parameters (e.g., high level, high temperature)\r\nA·  Vessels to capture materials in the event of a release\r\nA·  Curbing or diking to contain liquid releases\r\nA·  Redundant equipment and instrumentation where needed (e.g., uninterruptible power supply for process control system)\r\nA·  Trained emergency response personnel\r\nA·  Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\r\n\r\n1.5  Five-year Accident History\r\n\r\nNo releases of RMP regulated substances have occurred from the ISP Lima Plant in the last 5 years that have resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage off site.\r\n\r\n1.6  Emergency Response Program\r\n\r\nThe Lima Plant maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, plant evacuation plans and accounting for plant personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements.  In addition, the Plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures to perform their specific emergency response duties. The emergency response program is updated when necessary based on modifications made to plant processes or facilities. \r\n\r\nThe overall emergency response program for the Plant is coordinated with the Allen C"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000049020,
      "SummaryText": "ounty local emergency planning committee (LEPC) and with offsite responders who would be called to support emergency response efforts if required. This coordination includes periodic meetings of the LEPC, which includes local emergency response officials, local government officials, and industry representatives.  The Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to participating in periodic LEPC meetings, the ISP Plant conducts periodic emergency drills that involve the LEPC and emergency response organizations, and the plant provides annual refresher training to local emergency responders regarding the hazards of regulated substances in the plant. \r\n\r\n1.7  Planned Changes to Improve Safety\r\n\r\nISP's Lima Plant constantly strives to improve the safety of its operations through periodic safety reviews, the incident investigation program, and a program soliciting suggestions from the workers.  The Plant resolves all findings from PHAs, some of which result in modifications to the process."
    }
  ]
}