{
  "FacilityID": 1000034890,
  "FacilityName": "Sysco Grand Rapids, LLC",
  "FacilityStr1": "3700 Sysco Court S.E.",
  "FacilityStr2": null,
  "FacilityCity": "Grand Rapids",
  "FacilityState": "MI",
  "FacilityZipCode": "49512",
  "Facility4DigitZipExt": "2083",
  "FacilityCountyFIPS": "26081",
  "LEPC": "Kent County LEPC",
  "FacilityLatDecDegs": "42.895302",
  "FacilityLongDecDegs": "-85.537218",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "grr@sysco.com",
  "FacilityDUNS": 51763969,
  "ParentCompanyName": "Sysco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 51099661,
  "Company2DUNS": 0,
  "OperatorName": "Thomas Shaeffer",
  "OperatorStr1": "3700 Sysco Court S.E.",
  "OperatorStr2": null,
  "OperatorCity": "Grand Rapids",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49512",
  "OperatorZipCodeExt": "2083",
  "RMPContact": "Amy H. Campbell",
  "RMPTitle": "Vice Pres.of  Employee Relations",
  "FTE": 239,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000094872",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-04-30 00:00:00",
  "SafetyInspectionBy": "Big Horn Environmental & Safety",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-07-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-07-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-07-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.89677,
  "FRS_Long": -85.53602,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000042701,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000034890,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000043080,
          "ProcessID": 1000042701,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000051263,
          "ProcessID": 1000042701,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000551263,
          "ProcessID": 1000042701,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000034890,
      "SummaryText": "\n\nExecutive Summary\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nSysco Food Services of Grand Rapids, located in Grand Rapids, Michigan, provides refrigeration for warehousing and distribution of food and related products and services. Sysco Food Services of Grand Rapids senior management is not only committed to offer superior service, but also maintains a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. Sysco Food Services of Grand Rapids administers safety and environmental policies at the facility to ensure compliance with OSHAs Process Safety Management (PSM) and EPAs Risk Management Program (RMP). These programs include forklift safety, hazard communications, lockout/tagout, employee safety manuals, manufacturers documentation, and the Emergency Response Plan.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nSysco Food Services of Grand Rapids is located at 3700 Sysco Court S. E., Grand Rapids, Michigan 49512. The system was designed and constructed in accordance with all applicable federal, state, and local regulations.\n\n\n\nThe system uses 18,000 pounds of ammonia to provide refrigeration for warehousing and distribution of food and related products and services. The compressors of the system are located within two separate engine rooms, however the vessels are located both outside the building and in separate engine rooms. The condensers are mounted on the roof and all of the evaporators are located in their respective freezer/cold storage areas.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Sysco Food Services of Grand Rapids ammonia refrigeration system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. For example, Sysco Food Services of Grand Rapids operates in accordance with OSHAs Process Safety Management regulation.\n\n\n\nOther safety f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000034890,
      "SummaryText": "eatures of the ammonia refrigeration system include: ammonia sensors that sound a facility-wide alarm, an emergency shut down button that kills power to engine room equipment, relief valves on all pressure vessels, and continuous ventilation in the engine room to prevent ammonia explosions.\n\n\n\nIn addition to the Uniform Mechanical Code, the facility has based its maintenance program on the industry standard: the International Institute of Ammonia Refrigeration (IIAR) guidelines. In particular, the IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems is used at the facility.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nAn investigation into Sysco Food Services of Grand Rapidss accident history showed that there had been no reportable ammonia releases over the past five years (March 2008 too March 2013) that exceeded the Federal Reportable Quantity of 100 pounds. In addition, there have been no injuries resulting from an ammonia release.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nSysco Food Services of Grand Rapids has an emergency response plan in effect at the facility. The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM document, which is maintained at the facility. This Plan was designed to meet the following objectives:\n\n\n\n1.) To save lives.\n\n2.) To minimize and avoid injuries.\n\n3.) To protect the environment.\n\n4.) To minimize property damage.\n\n\n\nSysco Food Services of Grand Rapids maintains a safety committee whose members are the designated emergency coordinators for the facility. The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan is reviewed and updated at least once per year. This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorpo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000034890,
      "SummaryText": "rate facility changes due to the renovation of the facility.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazard Analysis (PHA) performed in September of 2004, generated mitigation measures (recommendations) to improve safety at the Sysco Food Services of Grand Rapids facility located at 3700 Sysco Court S. E., Grand Rapids, Michigan 49512. The Sysco Food Services of Grand Rapids safety committee has completed several items, including the recommendations, in a continual effort to provide a safe work environment for their employees. These changes include the following items:\n\n\n\n1. Continue to train all employees in Process Safety Management and the facility Safety Plan/Programs.\n\n\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n\n\n3. Continue employee involvement through safety team participation.\n\n\n\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}