{
  "FacilityID": 1000089786,
  "FacilityName": "Pace Wastewater Reclamation Plant",
  "FacilityStr1": "4401 Woodbine Road",
  "FacilityStr2": null,
  "FacilityCity": "Pace",
  "FacilityState": "FL",
  "FacilityZipCode": "32571",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12113",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "30.595833",
  "FacilityLongDecDegs": "-087.182500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Pace Property Finance Authority, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Pace Property Finance Authority, In",
  "OperatorStr1": "4401 Woodbine Road",
  "OperatorStr2": null,
  "OperatorCity": "Pace",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32571",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192588",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-10-23 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-09-10 14:24:40",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-09-10 14:24:40",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-09-10 14:24:40",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-09-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.595833,
  "FRS_Long": -87.1825,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111634,
      "AltID": "Ton Cylinder Facility",
      "FacilityID": 1000089786,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139576,
          "ProcessID": 1000111634,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000139577,
          "ProcessID": 1000111634,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000112947,
          "ProcessID": 1000111634,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000095220,
              "Process_NAICS_ID": 1000112947,
              "SafetyReviewDate": "2020-03-02 00:00:00",
              "PHA_Date": "2020-03-02 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-03-02 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-03-02 00:00:00",
              "TrainingReviewDate": "2020-03-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-03-02 00:00:00",
              "EquipmentInspectionDate": "2020-03-02 00:00:00",
              "EquipmentTested": "Sensors",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2020-03-02 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2019-10-23 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-03-02 00:00:00",
              "HotWorkPermitReviewDate": "2020-03-02 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2020-03-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000118919,
                  "PreventionProgram3ID": 1000095220,
                  "ProcessChemicalID": 1000139576
                },
                {
                  "PrimaryKey": 1000118920,
                  "PreventionProgram3ID": 1000095220,
                  "ProcessChemicalID": 1000139577
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000089786,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-09-23 00:00:00",
    "ERTrainingDate": "2014-09-23 00:00:00",
    "CoordinatingAgencyName": "District 1 -LEPC",
    "CoordinatingAgencyPhone": "8505958510",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089786,
      "SummaryText": "1.0  ACCIDENTAL RELEASE PREVENTION EMERGENCY RESPONSE POLICY SUMMARY\n\nThe Pace Wastewater Reclamation Plant (the Plant) is located on Woodbine Road in Pace.  Pace is a rapidly growing community in Santa Rosa County, Florida.  The facility is a critical part of the local utility system.  Pace Property Finance Authority, Inc. (PPFA) is committed to operating the facility in a manner that is protective of the health and safety of the public, the environment, and its employees.  PPFA is committed to operating and maintaining the facility in accordance with all applicable regulatory requirements including those of the Florida Department of Environmental Protection (FDEP), the Occupational Safety and health Administration (OSHA) and the Environmental Protection Agency (EPA).  The commitment to excellence in operation and maintenance is evidenced by previous awards from FDEP for operation and maintenance.\n\nTo ensure that this facility is operated and maintained in a safe manner and in accordance with applicable regulations, PPFA has developed an integrated Process Safety Management/Risk Management Program (the Program).  The Program is fully integrated in the system wide operation and maintenance program and Emergency Response Plan.\n\nPPFA has designated the General Manager with overall responsibility for the development, implementation and integration of the Program.  The Wastewater Facilities Manager has the primary responsibility and accountability for seeing that day to day operation of the facility is in compliance with the Program and its associated components and that the Program accurately reflects facility conditions.  The System Engineer is tasked as a secondary compliance monitor to double check that all requirements are met.\n\n\n2.0  STATIONARY FACILITY DESCRIPTION\n\nThe PPFA Plant provides wastewater treatment for the entire PPFA franchise area and has been in operation since 1993.  The Ton Cylinder Facility (the Facility) was constructed in 2005 to house ton cyli"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089786,
      "SummaryText": "nders of chlorine and sulphur dioxide.  The Plant previously used 150 pound cylinders.  Chlorine is used for disinfection of the treated effluent.  Sulphur dioxide is used to de-chlorinate prior to discharge to a treatment wetland.\n\nThe Ton Cylinder Facility is a three room enclosed building.  A small room is used to house electrical and control components.  This room is isolated from the other rooms.  The other two rooms house the chlorine and sulphur dioxide cylinders.  These rooms are enclosed and isolated from one another.  There are holders for three 2000 pound cylinders in each of the rooms.  Up to two cylinders are connected to a controlling manifold in each room.  Only one container is online at any time with the other container available in standby via automatic switchover regulators.\n\n3.0  ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nPPFA has developed a detailed prevention program based on the OSHA PSM standards.  A summary of the miscellaneous components is listed below.  All components will be updated as required by regulation.\n\n  3.1  Process Safety Information \nProcess safety information is included in the formalized prevention program and is also available at the Facility site for immediate reference.  The information consists of MSDS information and Chemtrec contact information.  The information will be updated frequently.\n\n  3.2  Process Hazard Analysis\nAn initial What If type PHA was performed prior to design of the building.  This effort resulted in a building design that incorporates several release prevention and mitigation measures.  These measures included an enclosed building, an alarm system, minimization of connections and piping and secondary protection of piping.\n\nA subsequent What If analysis near completion of the facility resulted in operation and maintenance procedures integrated into the Program.  One significant procedure is the use of multiple staffing during changing of cylinders and maintenance on pressurized components.\n\n  3.3  O"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089786,
      "SummaryText": "perating Procedures\nOperating procedures have been developed in accordance with regulations and are contained in the Operations and Maintenance Manual.\n\n  3.4  Training\nA system of training is set up to provide individual and group training on a regular basis.  Training is provided on specific operations and maintenance procedures and general facility, process and chemical safety.\n\n  3.5  Mechanical Integrity\nAn extensive maintenance program has been established for the Plant and associated facilities.  The maintenance program for the Ton Cylinder Facility has been integrated into this program.  Manufacturers maintenance requirements have been integrated with overall process maintenance requirements.  There is also a tracking method to be used to verify routine and special maintenance.\n\nAll chemical handling components and equipment are inspected annually and preventative maintenance performed by Southeast Water Technologies. \n\n  3.6  Management of Change\nA system has been implemented to provide for Management of Change.  Any major work at the facility must be reviewed to determine overall affect on all other components of the Program.  Components of the Program must be modified and employees informed of changes prior to implementation of any change affecting the Program.\n\n  3.8  Compliance Audits\nAn initial Compliance Audit will be performed prior to start-up to insure that all components of the Program have been implemented.  The facility will not be brought online until all components have been verified as being adequate and fully implemented.\n\n  3.8  Incident Investigation\nPPFA has adopted the OSHA PSM guidelines for Incident Investigation.  Employees are trained to report all incidents.\n\n  3.9  Employee Participation\nPPFA maintains a policy of complete employee involvement to insure that the maximum level of training is provided and that the safety of the facility, employees and the general public is insured.  All employees involved in daily operations at the P"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089786,
      "SummaryText": "lant site participate in all aspects of the Program.\n\n  3.10  Hot Work Permits\nAlthough PPFA staff performs all maintenance and repair work at the facility, a hot work permit program has been established in accordance with OSHA requirements.\n\n  3.11  Contractors\nAlthough PPFA staff performs all maintenance and repair work at the facility, a plan for selecting and informing contractors has been established.\n\n4.0  FIVE-YEAR ACCIDENT HISTORY\n\nThere has never been an accidental release at the Plant or any PPFA facility.\n\n5.0  EMERGENCY RESPONSE PROGRAM\n\nAn Emergency Response Plan (ERP) has been implemented for the facility.  The ERP defines the actions to be taken by employees in the event of an accidental release.  The ERP has been communicated to and coordinated with the Local Emergency Response Committee, the Santa Rosa County Emergency Management service and the local fire and police departments.  It is PPFA's policy that all employees likely to witness or discover an accidental release be trained to initiate the emergency response plan by notifying the proper authorities or response agencies.  It is the policy of PPFA that employees allow trained hazardous response teams to mitigate all releases.  Evacuation of offsite areas is to be coordinated by the local fire and police departments.\n\n6.0  PLANNED CHANGES TO IMPROVE SAFETY\n\nThere have been several meetings with the Pace Voluteer Fire Department concerning various scenarios and response issues and there are no planned changes anticipated.  PVFD has HAZMAT qualified personnel on standby and has inspected the facility for proper equipment in the event of an emergency.  Inspected components include: sensors, SCBAs, B kits, A kits, exhaust fans, and sealed rooms.  \n\nThe prevention program components will insure that any new measures necessary, or those that are determined to substantially increase safety, will be incorporated into the Program."
    }
  ]
}