{
  "FacilityID": 1000001852,
  "FacilityName": "Central Cold Storage",
  "FacilityStr1": "13526 Blackie Road",
  "FacilityStr2": null,
  "FacilityCity": "Castroville",
  "FacilityState": "CA",
  "FacilityZipCode": "95012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36",
  "FacilityLongDecDegs": "-121",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 76126317,
  "ParentCompanyName": "The VPS Companies",
  "Company2Name": null,
  "CompanyDUNS": 76126317,
  "Company2DUNS": 0,
  "OperatorName": "Jack Randle",
  "OperatorStr1": "13526 Blackie Road",
  "OperatorStr2": null,
  "OperatorCity": "Castroville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95012",
  "OperatorZipCodeExt": null,
  "RMPContact": "Trevor N. Long",
  "RMPTitle": "President/Chief Operating Officer",
  "FTE": 96,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000140956",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-07-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.76139,
  "FRS_Long": -121.74972,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002438,
      "AltID": "anhydrous ammonia",
      "FacilityID": 1000001852,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000002548,
          "ProcessID": 1000002438,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002685,
          "ProcessID": 1000002438,
          "ChemicalID": 56,
          "Quantity": 13975.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000502685,
          "ProcessID": 1000002438,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001852,
      "SummaryText": "1.    Accidental Release Prevention and Emergency Response Policy\n\nCentral Cold Storage operates a processing, shipping and cooling facility in Castroville, CA. Risk prevention and emergency response procedures are in place at this facility. The Emergency Response Plan lists the responsible personnel and the policies for responding to an accident involving the regulated substance.\nCentral Cold Storage facility has fixed refrigeration system onsite composed of screw compressors, evaporative condensers, evaporative cooling coils, pressure vessels, ammonia pumps and diffusion tank. All compressors have safety switches that would shut down the compressors upon detection of unsafe operating conditions. All the pressure vessels and the compressors are protected by safety relief valves against high pressure situations. There is are ammonia detectors in the cold rooms and the mechanical room for alarming. There is a list of responders experienced with ammonia refrigeration that would respond and determine specific responses for any incident. Safeties and detection equipment are tested and maintained by experienced maintenance personnel as spelled out in the SOPA?s (Standard Operating Procedures) and testing and inspection program.\nEmergency response training will be conducted yearly for current employees and as required for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\nAmmonia \n\n2.    Description of Source and Substance Handled\n\nAmmonia refrigeration system is used for maintaining temperatures in freezer storage and process rooms. The original freezer building was constructed in 1975 and the additions were built in 1981 and 1985. Refrigeration coils for room cooling were added to National Custom Packing (NCP) processing rooms and were tied into CCS refrigeration system. The Coils were added to NCP 2 in 1999 and to NCP 1 in 2002. The total charge for the refrigeration system is approximately 14,000 LBS. Figure 3.1, 3.2, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001852,
      "SummaryText": "3.3 show the facility location map, site plan and refrigeration system layout respectively.\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See appendix C for Material Safety Data Sheet for Anhydrous Ammonia.\n\n3.     Accidental Release Prevention Program\n\nCentral Cold Storage maintains a release prevention program to eliminate or minimize release. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release, see Appendix-N, Incident Investigation Form. A Risk Management Program, which includes accident prevention procedures for the ammonia refrigeration system, is maintained on-site along with this RMP.\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. There are emergency shut off switched outside the mechanical room for shutting down the system. Ammonia detectors are installed in all refrigerated rooms and the mechanical room. Personnel will automatically be notified if any detector exceeds set point. Monitoring is 24 hours per day. An emergency control box and diffusion tank allows system pressure to be relieved manually. All relief valves at the facility are tied into ammonia diffusion tank prevent high releases to ambient.\n\n4.    Emergency Response "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001852,
      "SummaryText": "Program\n\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Hazmat Team Chief is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The Hazmat Team Chief will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required. A description of the Emergency Response Program is included in Appendix Q.\n5.    Five Year Accident History\n\nAccording to Central Cold Storage Personnel, since startup there have been no releases of anhydrous ammonia resulting in reportable quantities or injuries.\n\n6.    Planned Safety Improvements\n\nSpecific recommendations resulting from the PHA and safety inspection are listed in Appendix G as Hazard Mitigation Recommendations. All refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation.\n\n"
    }
  ]
}