{
  "FacilityID": 1000035817,
  "FacilityName": "Wilbur-Ellis Company (Farwell, TX)",
  "FacilityStr1": "48 US Highway 60 East",
  "FacilityStr2": null,
  "FacilityCity": "Farwell",
  "FacilityState": "TX",
  "FacilityZipCode": "79325",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48369",
  "LEPC": "Parmer County LEPC",
  "FacilityLatDecDegs": "34.391736",
  "FacilityLongDecDegs": "-103.040278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.wilberellis.com/Division/Pages/Agribusiness",
  "FacilityEmailAddress": "JBradley@wilburellis.com",
  "FacilityDUNS": 6913479,
  "ParentCompanyName": "Wilbur-Ellis Company LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wilbur-Ellis Company",
  "OperatorStr1": "PO Box 667",
  "OperatorStr2": null,
  "OperatorCity": "Farwell",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79325",
  "OperatorZipCodeExt": null,
  "RMPContact": "Randy Cain",
  "RMPTitle": "Branch Manager",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052211",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-05-01 00:00:00",
  "SafetyInspectionBy": "Parmer County LEPC",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-03-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-03-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 34.39194,
  "FRS_Long": -103.03972,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "12",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000043909,
      "AltID": "Storage and Transfer",
      "FacilityID": 1000035817,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000044330,
          "ProcessID": 1000043909,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000052833,
          "ProcessID": 1000043909,
          "ChemicalID": 56,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000552833,
          "ProcessID": 1000043909,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000035817,
      "SummaryText": "The Plan describes procedures implemented by Wilbur-Ellis Company, Agribusiness Division (\"Wilbur-Ellis\") to prevent accidental releases of ammonia that could cause harm to the public and the environment from short-term exposures.  The Plan includes an analysis of the potential offsite consequences of an accidental release, a five-year accident history, and a release prevention and emergency response program.  \n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nWilbur-Ellis has implemented release prevention and emergency response procedures to minimize the potential for accidental releases of hazardous materials.  Emergency response procedures including evacuation procedures and notification procedures have been implemented by Wilbur-Ellis.  In addition, Wilbur-Ellis has developed operating procedures and preventative maintenance activities to reduce the likelihood of accidental releases.\n\n\n\nThis Plan and the emergency response procedures document the accidental release prevention, safety, and emergency policies in place at Wilbur-Ellis.\n\n\n\nDescription of Stationary Source and Regulated Substances\n\n\n\nWilbur-Ellis is located at 48 US Highway 60 East in Farwell, Texas (the \"facility\").  Wilbur-Ellis is a retailer of fertilizer in the form of anhydrous ammonia stored under pressure.  There is one anhydrous ammonia storage tank located at the facility with a maximum capacity of approximately 18,000 gallons.  The anhydrous ammonia is transferred from the storage tanks into 1,000 gallon nurse tanks.  A maximum total of ten nurse tanks containing anhydrous ammonia are stored at the facility at any given time.  The contents of the nurse tanks are sold to the local farming community for use as fertilizer.  \n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n  \n\nWilbur-Ellis has developed and implemented this Plan with the objective of complying with the requirements and guidelines set forth by the Federal Risk Managemen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000035817,
      "SummaryText": "t Plan program.  The Plan's purpose is to enhance the facility's existing safety programs implemented at the site to reduce the possibility of accidental releases of anhydrous ammonia that could cause harm to employees, the public and the environment.  The emergency response program, documented in the emergency response procedures, includes accidental release prevention and chemical specific prevention steps.\n\n\n\nWilbur-Ellis ensures that equipment meets the appropriate industry standards prior to use.  Wilbur-Ellis implements operating procedures and maintenance procedures in accordance with manufacturer and industry specifications to prevent accidental releases at the facility.  Chemical specific prevention steps implemented at the site include excess flow valves, pressure relief valves, emergency shut off valves with cables that run along the length of the horizontal storage tanks for quick access, and ammonia training for personnel.\n\n \n\nFive-Year Accident History\n\n\n\nThere have been no qualifying accidents involving ammonia in the five-year period prior to the completion of this Plan.\n\n\n\nEmergency Response Program\n\n\n\nThe facility coordinates with the Parmer County Fire Department (\"fire department\") regarding specific actions to be taken in response to an accidental release of anhydrous ammonia.  The facility has established emergency evacuation procedures to evacuate the site and notify the appropriate agencies regarding a release.  The facility's emergency response program is documented in the facility's Emergency Response Procedures.  The emergency procedures contain the following key elements:\n\n\n\n1.    Procedures for informing local agencies responsible for responding to accidental releases.\n\n2.    Information on emergency health care.\n\n3.    Emergency response training for employees.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nPlans to improve safety at the facility were developed based on the results of compliance audits, hazard reviews, and a Risk Management Plan (RMP) "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000035817,
      "SummaryText": "site inspection conducted by an outside contractor.  The Branch Manager is currently working on an implementation schedule for the recommended actions.  Recommended actions include the following:\n\n\n\n1.    Document that maintenance repairs/replacements are compliant with ANSI, ASME, and OSHA standards for ammonia systems.\n\n2.    Install lockable storage boxes and break away valves on the ammonia fill nozzles used at the nurse tank filling stations.\n\n3.    Relocate the load-in valves for the storage tank and install bulkheads for security.\n\n4.    Evaluate potential installation of a security system to protect the ammonia process.\n\n5.    Install manifolds on the pressure relief valves for the storage tank for easy replacement if needed which will prevent the need to drain the contents of the tank prior to maintenance.\n\n6.    Treat the rusted surfaces of the storage tank and piping by applying an approved coating.\n\n7.    Install a system to eliminate venting bleeder valves to atmosphere and direct vented ammonia to water.\n\n8.    Ensure that liquid lines and valves are painted red to distinguish them from the vapor lines and valves."
    }
  ]
}