{
  "FacilityID": 1000076420,
  "FacilityName": "FEDEX Supply Chain Jacksonville Dist. Center",
  "FacilityStr1": "12200 Presidents Court",
  "FacilityStr2": null,
  "FacilityCity": "Jacksonville",
  "FacilityState": "FL",
  "FacilityZipCode": "32220",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12031",
  "LEPC": "Regional Planning Council/Regi",
  "FacilityLatDecDegs": "30.36557",
  "FacilityLongDecDegs": "-81.844574",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.unilever.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 796185445,
  "ParentCompanyName": "FEDEX Supply Chain",
  "Company2Name": null,
  "CompanyDUNS": 796185445,
  "Company2DUNS": null,
  "OperatorName": "FEDEX Supply Chain Unilever Dist.",
  "OperatorStr1": "12200 Presidents Court",
  "OperatorStr2": null,
  "OperatorCity": "Jacksonville",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32220",
  "OperatorZipCodeExt": null,
  "FTE": 128,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000206387",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-06-13 00:00:00",
  "SafetyInspectionBy": "NSF - Cook & Thurber Audit",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-03-28 13:48:11",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-28 13:48:11",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-03-28 13:48:11",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-11-24 00:00:00",
  "DeRegistrationEffectiveDate": "2021-11-15 00:00:00",
  "AnniversaryDate": "2024-03-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 30.36557,
  "FRS_Long": -81.844574,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Consumer commodity products with NFPA ratings of 1, 2, and 3 only.",
  "_processes": [
    {
      "ProcessID": 1000094997,
      "AltID": "Aerosol Warehouse",
      "FacilityID": 1000076420,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118827,
          "ProcessID": 1000094997,
          "ChemicalID": 155,
          "Quantity": 1000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000103272,
              "ProcessChemicalID": 1000118827,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000103275,
              "ProcessChemicalID": 1000118827,
              "ChemicalID": 111
            },
            {
              "FlamMixChemID": 1000103276,
              "ProcessChemicalID": 1000118827,
              "ChemicalID": 130
            },
            {
              "FlamMixChemID": 1000103277,
              "ProcessChemicalID": 1000118827,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000096259,
          "ProcessID": 1000094997,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000076420,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-09-17 00:00:00",
    "ERTrainingDate": "2008-11-02 00:00:00",
    "CoordinatingAgencyName": "NE Florida LEPC",
    "CoordinatingAgencyPhone": "9042790880",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000076420,
      "SummaryText": "n procedures will occur whenever management or the local response officials have activated the appropriate alarm. The emergency coordinator will direct all non-essential vehicles, away from the facility. The emergency coordinator will ensure that emergency equipment has unfettered entrance to the facility.\r\n\r\n 1.2 The stationary source and regulated substances handled:\r\n\r\nFSC is a closed container warehouse for Unilever Company product. The facility does not manufacture, package, re-package, transfer, or handle raw product. The facility has two processes that deal with hazardous substances regulated by the Risk Management Program.\r\n\r\nThe first process includes the docking of trailers containing finished product, unloading the trailers using motorized forklifts, storage of the product in designated areas. It consists of loading the trailers with motorized forklifts, and the un-docking of the trailers and transport from the property. \r\n\r\nThe second process is the storage of the products with in the facility. The products that are stored at this facility are varied in concentrations, physical states, and constituents. Only a small amount of the products in the warehouse contain regulated hazardous substances.  Due to the constant change in inventory driven by the industry demand of Unilever product, FSC does not have a steady amount of regulated substances in the warehouse. To determine the maximum amount of regulated substances stored in the building, a review of product inventories was conducted to achieve a estimate of maximum storage. The maximum storage was used to calculate possible quantities that may be released.\r\n\r\n 1.3 Worst-case release scenario and the alternative release scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario:\r\n\r\nDuring a review of products and product histories, no substances are governed under the toxic substance category in the RMP. The facility will investigate all new produ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000076420,
      "SummaryText": "cts to determine if thresholds are met for toxic substances requirements. \r\n\r\nThe contents of the flammable propellant mixture is regulated under the flammable substance category in the RMP. The worst-case scenario would be a comprehensive incident, an act of God that is not controlled by FSC. This may cause for destruction of one (1) 14 oz. aerosol can resulting in the entire release of a liquid and flammable propellant mixture containing regulated chemicals. In this worst-case scenario, no mitigating measures are present to contain the release. Under worst case weather conditions, the dispersion cloud would travel 0.005 miles before dispersing enough to no longer pose a hazard to the public. The endpoint distance was calculated using the EPA's RMP*Comp model. \r\n\r\n 1.4 The general accidental release prevention program and chemical-specific prevention steps:\r\n\r\nFSC is compliant with The Environmental Protection Agency's (EPA) Risk Management Plan (RMP). In addition, this facility does extensive training, procedural review, and complies with the requirements of this rule. \r\n\r\nUpon hiring, and at required intervals, each Teammate is given Department of Transportation (DOT) hazardous materials training, OSHA Hazard Communication (HAZCOM) training, and EPA Right-To-Know (RTK) training. In addition, all new Teammates are given additional training regarding Personal Protection Equipment (PPE) use and maintenance, loading and unloading, handling of material, forklift operation, emergency response, and evacuation procedures.\r\n\r\nThis facility has safety committee. The safety committee is comprised of Teammates and management that meet once a month. The purpose of the safety committee is to review any incidents that may have occurred and discuss safety related issues in the facility. All issues are addressed and discussed until a viable solution is derived. All safety committee information is documented and recorded.\r\n\r\n 1.5 The five-year accident history:"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000076420,
      "SummaryText": "Due to the management of the processes, extensive training, and written operating procedures, this FSC facility has not had a release in the past five years.\r\n\r\n 1.6 The emergency response program:\r\n\r\nFSC has an emergency response program in place. This plan describes the procedures to be implemented as a result of a release. Twice per year, the facility runs evacuation exercises based on a release scenario or in case of a fire. All evacuation exercises are timed and evaluated for effectiveness.\r\n\r\nIn addition, FSC has developed and implemented a Spill Prevention Control and Countermeasures (SPCC) plan.\r\n\r\n 1.7 Planned changes to improve safety:\r\nFSC is continually reviewing and improving procedures and processes to optimize performance and safety. The facility is not planning drastic changes to building structure, grounds, or mitigation systems."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000076420,
      "SummaryText": "In March of 2019, CSC updated the original Risk Management Plan (RMP) prepared by RCS.  Much of the text below was prepared by RCS.  Where appropriate, CSC has removed text and replaced it with updated text.\r\n\r\nThis Risk Management Plan (RMP) has been completed by Regulatory Compliance Services, Inc. (RCS, Inc.) for GENCO (now FEDEX Supply Chain - or FSC) in compliance with the Environmental Protection Agency (EPA) Clean Air Act, Section 112(r). FSC operates a warehouse facility with hazardous substances that are covered under 112(r).\r\n\r\nCSC reviewed products stored in the warehouse and examined their (M)SDS.  Based on CSC review of approximately 300 products, it is estimated that the facility stores 1,000,000 pounds of flammable consumer products.  These products are classified as flammable mixtures and contain more that the threshold quantities of the following CAA 112(r) listed chemicals:  Butane (106-97-8), Difluoroethane (75-37-6), Isobutane (75-28-5) and Methane, Oxybis- (115-10-6).\r\n\r\nThe RMP requirements were designed to facilitate communication to responders and the public in the event of a catastrophic release of the listed substances. These requirements also insure the continuing improvement and safety of each identified process. Major facilities needing to comply with 112(r) may be defined as; a facility that is used to store large volumes of highly hazardous substances for use in manufacturing, treatment processes or bulk storage. Some of the requirements are not applicable to a closed container non-bulk facility. All items that are not applicable are provided with an explanation in the attachments to this plan.\r\n\r\nThe RMP has three (3) different models to follow when completing a plan. The models are based on types of products, processes, and quantities. This plan meets the requirement of Program 1. \r\n\r\nUnder Program 1 FSC is not required develop a plan in response to the Occupational Safety and Health Administration's (OSHA) Process Safety"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000076420,
      "SummaryText": "Management (PSM) 29 CFR 1910.119. \r\n\r\n 1.1 The accidental release prevention and emergency response policies at the stationary source:\r\n\r\nFSC operates a, contract warehouse for Unilever. The facility is located at 12200 Presidents Court, Jacksonville, FL 32220. Products stored at the facility exceed threshold requirements outlined in the Code of Federal Regulations (CFR) Title 40, Part 68. In fully demonstrating compliance with the standards set forth in Section 112(r) of the 1990 Clean Air Act, FSC is implementing a Risk Management Program through this Risk Management Plan.\r\n\r\nThe facility is a closed-container distribution facility for appropriately marked, labeled and packaged non-bulk consumer products. These products are stored within specially designed areas of the warehouse. Aerosol products that are the subject of this RMP are stored in locations that have been engineered to store aerosol products, following guidelines established by Building Officials Code Association (BOCA) Guidelines, and National Fire Protection Association (NFPA) Guidelines.\r\n\r\nFSC is dedicated to providing a safe, publicly aware, environmentally friendly solution to logistics management. All procedures at the facility have been written to ensure Teammate and public safety. Procedures are continuously reviewed and revised based on facility need, management review and Teammate suggestions.\r\n\r\nWhen any Teammate discovers any release of a hazardous substance, the emergency response procedures developed at FSC are implemented. The first step for a Teammate would be to immediately notify his or her supervisor. The supervisor will immediately contact the Primary Emergency Coordinator. Upon notification of a release, and if appropriate, the Primary Coordinator will immediately contact the local fire department, the police department, the Community Emergency Planning Committee, the Florida DEP State Warning Point, and the outside response contractor.\r\n\r\nThe facility emergency evacuatio"
    }
  ]
}