{
  "FacilityID": 1000102163,
  "FacilityName": "Lompoc Valley Cooling",
  "FacilityStr1": "1501 N L St",
  "FacilityStr2": null,
  "FacilityCity": "Lompoc",
  "FacilityState": "CA",
  "FacilityZipCode": "93436",
  "Facility4DigitZipExt": "2808",
  "FacilityCountyFIPS": "06083",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.663273",
  "FacilityLongDecDegs": "-120.462525",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I1",
  "LatLongDescription": "LF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 80588880,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Lompoc Valley Cooling, Inc",
  "OperatorStr1": "1501 N L St",
  "OperatorStr2": null,
  "OperatorCity": "Lompoc",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93436",
  "OperatorZipCodeExt": "2808",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000249037",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-12-08 00:00:00",
  "SafetyInspectionBy": "Santa Barbara County CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-08-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-08-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-08-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1.82",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "100",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000126800,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000102163,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000158708,
          "ProcessID": 1000126800,
          "ChemicalID": 56,
          "Quantity": 11167.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000128175,
          "ProcessID": 1000126800,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000109278,
              "Process_NAICS_ID": 1000128175,
              "SafetyReviewDate": "2022-08-24 00:00:00",
              "PHA_Date": "2018-05-14 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-05-14 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Vandalism, Pipe Hangar Support failure, workplace violence,",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion tank on site",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-06-06 00:00:00",
              "TrainingReviewDate": "2022-03-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-05-04 00:00:00",
              "EquipmentInspectionDate": "2022-05-04 00:00:00",
              "EquipmentTested": "IIAR 6 Ammonia Refrigeration Safety Inspection Checklist for Pressure Vessels, Evaporators, Compressors 1-2-3-4, Screw Compressors 1 and 2, Pumps, Evaporative Condensing towers",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2022-06-06 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2022-06-06 00:00:00",
              "AuditCompletionDate": "2022-06-06 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2022-06-06 00:00:00",
              "HotWorkPermitReviewDate": "2022-06-06 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000137077,
                  "PreventionProgram3ID": 1000109278,
                  "ProcessChemicalID": 1000158708
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000102163,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Santa Barbara County CUPA",
    "CoordinatingAgencyPhone": "8056814927",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000102163,
      "SummaryText": "1 EXECUTIVE SUMMARY\n\nThis Risk Management Plan (RMP) document has been prepared according to California Accidental Release Prevention (Cal/ARP) Program Level II requirements and specifications. Reference documents used in its preparation include the current Cal/ARP Regulations found in CCR19, Div. 2, Chapter 4.5 et seq., the Cal/ARP Administering Agency Guidance 1-31-05, and the USEPA General Guidance for Preparation of RMPs, including Ammonia Refrigeration Appendix (parameters for Offsite Consequence Analysis). This written Risk Management Plan is intended to describe the overall Risk Management Program for the facility\u0092s Ammonia Refrigeration Operations.\n\nThis Cal/ARP Risk Management Plan was developed to address the ammonia refrigeration process that is utilized at the Lompoc Valley Cooling, LLC (LVC) fresh produce cooling & shipping facility in Lompoc, CA. The facility and refrigerating process was professionally engineered & built new in 2013; according to codes, standards and permit requirements as locally adopted and approved by the City of Lompoc and Santa Barbara County at that time. The Cal/ARP Regulated Substance (RS) used in the refrigerating process is anhydrous ammonia. The ammonia and devices that circulate and store the ammonia are the subject of the RMP document.\n\n        1.1 Accidental Release Prevention and Emergency Response Policies\n\nThe LVC Accidental Release Prevention and Emergency Response Policies remain unchanged; they are simply not to have accidental releases or emergencies. The Company endeavors to execute this policy through the daily implementation of its safety programs which includes, but is not limited to the safe design, operation and maintenance of the ammonia refrigeration process. This Cal/ARP RMP is specifically designed and intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen. It is the goal of the company to protect its employees, visitors and neighbors from harm due to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000102163,
      "SummaryText": "Company operations. To that end, the facility is equipped with state-of-the-art life, fire suppression and ammonia monitoring, detection and alarms systems that are engineered directly into the plant.\nFacility staff will communicate to the Fire Department and evacuate (or shelter-in-place according to the situation) if there is a release situation or fire; a \u0093Non-Responding Facility\u0094 policy has been adopted. The company however recognizes the need to plan for and coordinate effective emergency response. An Emergency Action Plan has been developed within the facility\u0092s Hazardous Material Business Plan, which addresses public response notification requirements, emergency procedures & evacuation. Managers and employees would shepherd visitors in an emergency; it is the policy of the company that no-one shall respond to an emergency in a way that is beyond his or her level of training and responsibility. By effectively determining that people are safe, the Fire Department can more swiftly manage the tactical part of a response. The company coordinates its emergency response planning with Lompoc City Fire and the local CUPA that has RMP jurisdiction. This is done via periodic inspections of the facility and required submittals of this document and the HMBP to the local CUPA. LVC confirmed (with Lompoc City Fire) that the facility would be included in the EPCRA Community Emergency Plan when the facility was built.\nThe ammonia refrigeration system is supported by Capitol Industrial Maintenance & Electric (Fabricold) and Western Precooling Systems (WPS) for ammonia refrigeration operations, technical inspections, and maintenance needs. Fabricold is a local licensed contractor with C-38 Classification. WPS is an established state-wide provider of ammonia refrigeration equipment and services, in particular portable vacuum cooling equipment (Hydro-Vac\u0099). These companies employ personnel experienced in providing technical support for ammonia refrigeration systems, including rel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000102163,
      "SummaryText": "ease or threatened release scenarios. These service providers are on call to the facility 24/7/365.\n        1.2 General Description of the Stationary Source and Regulated Substances\n\nLompoc Valley Cooling (LVC) is located at 1501 North L Street, inside city limits on the north side of Lompoc, and is zoned Industrial/Business Park. Adjacent property use to the west is commercial, south is commercial, residential & industrial, east is commercial and residential, and the Lompoc Airport is located to the north. The overall site occupies 3.58 Acres; with a total building area of 31,165 square feet with 24,929 square feet devoted to cold storage. The facility is used for fresh produce pre-cooling, short term temperature-controlled storage, and shipping. The fresh produce handled includes row crop & fresh fruit commodities.\n\nAs described above, anhydrous ammonia CAS 7441-41-7 is the Cal/ARP Regulated Substance in use in a single closed-loop refrigeration process. This process utilizes Pressure Coolers to provide high CFM for precooling fresh produce types that cannot be vacuum cooled (strawberries for example). A Hydro- Vac\u0099 Vacuum Tube is utilized for the rapid removal of field heat from other fresh produce such as lettuce, and cauliflower, Icemakers support Ice Injectors for broccoli and cilantro. Room Evaporators (Fan Coil Units) provide temperature control inside of normally occupied enclosed refrigerated space; after being pre-cooled the produce is kept inside the Cooler for short term storage prior to shipping. Ammonia refrigerating equipment consists of a PLC-based Monitoring, Control and Alarm System, Compressors, Pressure Vessels, Condenser, Evaporators (Room Units), Pressure Coolers, Vacuum Tube, piping, pumps, valves and an ammonia-water diffusion system. Pressure and temperature controls are installed in accordance with appropriate standards, including isolation and overpressure relief valves. Relief valves terminate at a sparger at the bottom of an Ammonia-Wat"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000102163,
      "SummaryText": "er Diffusion system. If a Relief Valve were to operate, the ammonia would be captured in this system, thereby preventing a release to atmosphere. Automatic cutouts protect the system from overpressure, high or low refrigerant liquid levels and proper oil temp & level parameters. Critical cutouts are periodically inspected & tested to confirm proper actuation. Daily rounds are done to observe and ensure proper operating conditions.\n\nAs stated above the facility is supported by Fabricold Electric for its cooler system operations and by Western Precooling Systems (WPS) for its vacuum cooling operations. These companies employ highly skilled and experienced Technicians.\n\n        1.3 Summary of the General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAccidental Release Prevention Program\n\nThe design & installation of the refrigeration system process along with the implementation of the Cal/ARP Prevention Program is designed to provide assurance that the risks associated with ammonia are effectively managed. The elements of the Cal/ARP Prevention Program are intended to be integrated with the daily and ongoing functions of the facility, which are specifically intended to prevent an occurrence and minimize the consequences of a release of Anhydrous Ammonia. The Cal/ARP Program Level 2 Prevention Program includes but is not limited to Safety Information, Hazard Reviews, Written Operating Procedures, Training, Inspections & Maintenance, Compliance Audits, Incident Investigation and Emergency Response.\n\nChemical-Specific Prevention Steps\nBuilding space is equipped with a modern fire alarm and sprinkler system. The refrigeration system is equipped with redundant pre-programmed automatic safety cut-outs, including a redundant overpressure cutout switch, and an automated ammonia system monitoring, detection and alarm system. The alarm\nsystem is programmed to notify a third-party alarm company that monitors for alarms 24/7/365. The alarm system al"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000102163,
      "SummaryText": "erts according to pre-programmed parameters, including if the refrigeration system is approaching out-of-tolerance conditions, or if there is a fire or a release in progress. Appropriate notifications are made according to a pre-determined call-out list maintained by the third-party supervising alarm company.\n\nPressure relief valves (PRV) terminate at an engineered ammonia-water diffusion system. If a PRV were to operate, ammonia is contained within this system thereby preventing a release to atmosphere.\n\nWritten procedures have been developed for the daily operation of ammonia-handling equipment, including the steps to be taken in the event of a release or threatened release. The written procedures include necessary safety precautions and address operating phases as defined by the Cal/ARP Program. Refrigeration systems shall be operated by pre-qualified personnel who are trained and qualified in the relevant operating and safety procedures. Written Operating Procedures are maintained on-site.\n\nScheduled technical inspections and maintenance services are delegated to Fabricold and Western Precooling Systems (WPS). Only qualified Technicians will execute maintenance. LVC personnel perform daily rounds to validate proper operating conditions and identify deviations if/when present.\n\nRefrigeration oil must be periodically drained from the refrigeration system. The refrigeration system is equipped with special self-closing valves are used as a permissive for oil drain flow. If a release were to develop during an oil-draining task, the Technician simply releases the handle of the self-closing valve and flow is terminated.\n\nOther release prevention measures:\n\n    \u0095 The facility was engineered and constructed by professional companies observing appropriate codes and standards, permit requirements, and good engineering practices.\n    \u0095 The site and facilities are secured to discourage access by unauthorized personnel.\n    \u0095 Since opening, a CCTV system has been installed fo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000102163,
      "SummaryText": "r enhanced remote monitoring\n    \u0095 Refrigerating equipment is located in areas normally inaccessible to casual vehicular traffic; some equipment piping and valves are roof-mounted.\n    \u0095 Equipment is protected from vehicles, forklifts or other impact by placement techniques; & added barriers where necessary.\n    \u0095 Operators are trained and certified in written SOP\u0092s, and are only allowed to perform those tasks for which they have been pre-qualified.\n    \u0095 Qualified vendors perform and document SOP training, which is validated via demonstration and/or observation.\n    \u0095 Employees are trained in hazard communication (discovery and communicating) for releases, threatened releases, fires, vandals, etc.\n    \u0095 Staff maintains housekeeping of the facility on a day-to-day basis.\n    \u0095 An inspection & maintenance program is established according to the Cal/ARP Program.\n    \u0095 An Injury and Illness Prevention Program (IIPP) & Training Program is established. Personnel are trained according to their position and level of responsibility.\n\n        1.4 Summary of the Five-Year Accident History\n\nThere is no data to report.\n        1.5 Summary of the Emergency Response Program\n\nThe facility is equipped with modern fire and life safety systems as discussed & described previously in this document. In the event of an emergency release facility personnel will respond in a defensive & supporting role. The procedure is to identify the problem area (if it can be done quickly and safely), evacuate personnel to the designated safe area (or Shelter-in-Place) per the emergency plan, and notify proper responding agencies & support personnel. The company will fully cooperate with public emergency responders. Emergency response measures are coordinated with the local CUPA and Fire Department(s) via submittal of the California Hazardous Material Business Plan; the development, implementation, and submittal of Cal/ARP Reports, and other coordination activities with appropriate agencies.\n\nAs only pr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000102163,
      "SummaryText": "operly trained and qualified personnel are authorized to respond to emergencies; only the Fire Department and 1910.120(q)-Certified Personnel would respond to an actual release emergency. Other personnel shall notify and evacuate. Fabricold & WPS employ personnel that are 1910.120(q) and/or Negative Pressure Respirator Certified. Emergency planning documents are updated on a regular basis & submitted when appropriate or required; emergency contacts and procedures are established within the Hazardous Material Business Plan (HMBP). The HMBP includes procedures for small releases, ammonia first aid information and Cooler Manager Emergency Checklist. Written ammonia operating procedures include emergency shutdown. Appropriate personnel are trained in these procedures.\n        1.6 Planned changes to improve safety\n\nMethods to identify safety improvements are a function of the Cal/ARP RMP & the routine maintenance of the Plant. Rounds & Inspections are performed and documented at regular intervals. Safety hazards are aggressively sought out for identification and correction through this process, and all employees are encouraged to participate in hazard identification. Refrigeration maintenance needs are determined through a pre-planned inspection and maintenance program. If and when discovered, imminent hazards shall be immediately isolated and placed off-limits until proper mitigation/abatement is evaluated and executed by qualified personnel. It is the desire of Plant management to maintain safe conditions at all times through this process. Should this process fail, investigative procedures established via the Cal/ARP Program shall be implemented to determine the cause. Appropriate planning and measures shall be taken to prevent incident re-occurrence.\n\nThe Level II Hazard Review update utilizing the What-if/Checklist Methodology was performed by an experienced & diversified team on 4/19/2018. This CUPA and USEPA-approved methodology is used widely throughout the ammoni"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000102163,
      "SummaryText": "a refrigeration industry. External Events as required by the Cal/ARP Program including plausible site-specific events were reviewed and documented. A written schedule of Hazard Review recommendations has been compiled and submitted to LVC Management. The last recommendation was closed and documented 5/14/2018.\n\n        1.7 External Events Analysis Information \u0096 CAL/ARP\n\nThe Cal/ARP Program requires the reporting of External Events considered in the Hazard Review; and reporting of External Events with potential for offsite consequences, and other specified information which is presented below. Events with a Consequence (CN) Rating of Medium (M) or High (H) could potentially result in offsite consequences. There were no scenarios identified with a final rating of 4 Serious or 5 Critical Concern due to expected Frequency ratings and/or Safeguards/Controls. One recommendation in this part of the review was later confirmed to have already been completed (#V3\nEvaporator Hangar Bolt Tightness Checks Feb 2018). A CCTV system has been installed which is intended to improve security monitoring. There are no other changes to report."
    }
  ]
}