{
  "FacilityID": 1000069428,
  "FacilityName": "Polycoat Products, LLC - Arlington, TX",
  "FacilityStr1": "3001 E. Pioneer Pkwy.",
  "FacilityStr2": null,
  "FacilityCity": "Arlington",
  "FacilityState": "TX",
  "FacilityZipCode": "76010",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.714124",
  "FacilityLongDecDegs": "-97.055567",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A6",
  "LatLongDescription": "ST",
  "FacilityURL": "www.polycoatusa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "American Polymer Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Polycoat Products, LLC.",
  "OperatorStr1": "3001 E. Pioneer Pkwy.",
  "OperatorStr2": null,
  "OperatorCity": "Arlington",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76010",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000238664",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-02-05 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-06-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000087628,
      "AltID": "TDI Storage & Handling",
      "FacilityID": 1000069428,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000109684,
          "ProcessID": 1000087628,
          "ChemicalID": 77,
          "Quantity": 61200.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000088851,
          "ProcessID": 1000087628,
          "NAICSCode": "32551",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000069428,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-02-05 00:00:00",
    "ERTrainingDate": "2018-02-05 00:00:00",
    "CoordinatingAgencyName": "Arlington Fire Department",
    "CoordinatingAgencyPhone": "8174596939",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069428,
      "SummaryText": "Facility Description\n\n\n\n\"Polycoat Products, LLC. - Arlington, TX\" is a division of American Polymers Corporation, is a coating manufacturing facility located in 3001 E. Pioneer Parkway, Arlington, Texas 76010.  The facility will engage in loading, unloading, storing, mixing and blending of various raw materials including liquids and powders to manufacture coatings.  The facility uses Toluene diisocyanate (unspecified isomer) (TDI) (CAS # 264171-62-5) in the production of polymers.  TDI will be stored in excess of the regulatory threshold of 10,000 pounds set forth in 40 CFR 68.130. Polycoat Products will be extremely cautious in the handling of all chemicals and will be very diligent about safety for its employees and its neighbors. Polycoat Products staff will be well trained and will utilize modern equipment to provide safeguards. The TDI storage tank and transfer system, that will contain the regulated substance Toluene diisocyanate (TDI), will be used for supplying TDI to the polymer production reactors in the process area.\n\n\n\n\n\n\n\nAccidental Release Prevention Policy and Emergency Response Policies\n\n\n\n\"Polycoat Products, LLC. - Arlington, TX\" will implement precautions like engineering controls and wearing appropriate personal protective equipment when handling TDI and associated equipment. In order to prevent accidental release of the chemical from various sources a policy to check the equipment regularly will be implemented. , that minimize the possibility of accidental chemical releases and operational safety programs that ensure safe operations at the facility.\n\nPolycoat Products will have Risk Management Program in place to manage the handling, loading and transfer of TDI. The program will include requirements for written operating procedures, personnel training, equipment maintenance, incident investigation, and periodic review or audit of program elements. Written procedures will be developed as part of this program that specifies the steps for every task"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069428,
      "SummaryText": " undertaken related to the TDI system. In addition to the Risk Management Program, common industry standards, policies, and procedures will be followed.\n\nPolycoat Products will have emergency response plan in effect to handle potential emergency situations at this facility. This plan will be designed to meet the following objectives:\n\n1.) To save lives.\n\n2.) To minimize and avoid injuries.\n\n3.) To protect the environment.\n\n4.) To minimize property damage.\n\nKey elements of the Emergency Response Plan will include specific steps that Polycoat Products management expects of its employees to take to protect health of the employees, visitors and the neighbors. The Emergency Response Plan will provide the response organization and notification procedures, key phone numbers and contact points and evacuation maps, and instructions for evacuation and for actions to be taken in case of a fire, injury, earthquake and chemical spill. TDI health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility. The Emergency Plan is reviewed and updated periodically to ensure that it remains current. \n\n\n\n\n\n\n\nStationary Source and Regulated Substance\n\n\n\nThis facility stores, handles and uses a chemical listed in part 68 of Title 40 of the Code of Federal Regulations, beyond a threshold quantity, as established by the EPA; \n\n- Toluene diisocyanate (unspecified isomer) (TDI) (CAS # 264171-62-5) - 61,200 lbs\n\nTDI will be used in the production of polymers. It will be reacted in small quantities with resins inside a series of batch reactors. The TDI system consists of a double walled storage tank, a transfer pump, and a bank of scrubbers that are used during the filling operation, piping and valves. The storage tank has a capacity of 6,000 gallons. The largest quantity of TDI stored in this double walled tank is 61,200 lbs. TDI transfer is accomplished via a transfer pump that is controlled automatically by a f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069428,
      "SummaryText": "low meter. TDI storage tank is designed for truck and marine transport like a containerized cargo. Therefore, it includes features to enhance its ruggedness. The tank is used as a stationary tank at this site. All piping attached to the tank; penetrate tank boundaries from the top. TDI is received in bulk by a tank truck. The truck is parked outside and the transfer is done by hoses connected to the truck at unloading rack. During the course of the unloading operation, the vapor space of the storage tank is forced through the scrubber units. Therefore, no TDI vapors are released during this operation. In addition to the double wall feature, the storage tank is set inside a containment area within the building at the facility to minimize the impacts of a release from the tank. The dimensions of the containment are 28'8\" length X 14'4\" wide X 3'4\" height with sufficient volume to contain the entire contents of the tank.\n\n\n\n\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-specific Prevention Steps\n\n\n\nFacility will have an accident release prevention program in place following to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA. The general accidental release prevention program will consist of following: \n\n?    TDI storage tank will be located inside an enclosed building\n\n?    Double walled TDI storage tank with high level alarms and pressure/vacuum relief devices\n\n?    Automated shutdown systems for critical process parameters (e.g., high-pressure) \n\n?    Secondary containment within the building for TDI storage tank\n\n?    Valves to isolation of the process\n\n?    Fire suppression and extinguishing systems\n\n?    Trained emergency response personnel\n\n?    Personal protective equipment while handling TDI\n\n?    Policy for maintenance checks for storage tank and equipment regularly \n\n\n\n\n\n\n\nFive-year Accident History\n\n\n\nThere are no reportable accidents in the past five years.\n\n\n\n\n\n\n\nEmergency Response Programs\n\n\n\nFacility employees will "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000069428,
      "SummaryText": "be trained of the limits of an incidental response and proper steps to follow for emergency notification and employee evacuation procedures in case of a release of a regulated substance. Appropriate procedures will be in place to notify emergency responders such as the Local Fire Department who will then notify the Tarrant County LEPC. The Fire Department Emergency Response Plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\n\n\n\n\n\n\n\nPlanned Changes to Improve Safety \n\n\n\nFacility will work to constantly improve the safety of the processes using recommendations developed through the prevention programs and safety suggestions from the employees. \n\n"
    }
  ]
}