{
  "FacilityID": 1000009155,
  "FacilityName": "Gerawan Farming Plant #2",
  "FacilityStr1": "1467 E. Dinuba Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Reedley",
  "FacilityState": "CA",
  "FacilityZipCode": "93654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.588000",
  "FacilityLongDecDegs": "-119.430000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": "nikolich@gerawan.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dan Gerawan",
  "OperatorStr1": "1400 E. Dinuba Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Reedley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93654",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000080832",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-06-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.58959,
  "FRS_Long": -119.43336,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010721,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000009155,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012207,
          "ProcessID": 1000010721,
          "ChemicalID": 56,
          "Quantity": 155000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000011103,
          "ProcessID": 1000010721,
          "NAICSCode": "11133",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000008752,
              "Process_NAICS_ID": 1000011103,
              "SafetyReviewDate": "2009-06-23 00:00:00",
              "PHA_Date": "2009-06-22 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-06-22 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Engine Room",
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-22 00:00:00",
              "TrainingReviewDate": "2009-06-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-06-22 00:00:00",
              "EquipmentInspectionDate": "2009-06-22 00:00:00",
              "EquipmentTested": "evaporative coils",
              "ChangeMgmtDate": "2007-02-01 00:00:00",
              "ChangeMgmtReviewDate": "2009-06-23 00:00:00",
              "PreStartupReviewDate": "2009-06-22 00:00:00",
              "ComplianceAuditDate": "2009-06-15 00:00:00",
              "AuditCompletionDate": "2010-02-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-06-22 00:00:00",
              "HotWorkPermitReviewDate": "2009-06-22 00:00:00",
              "ContractorSafetyReviewDate": "2009-06-22 00:00:00",
              "ContractorSafetyEvalDate": "2009-06-22 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Gerawan Farming Plant 2 facility is a commercial packinghouses for deciduous tree fruit - apricots, nectarines, peaches, plums, and grapes.  Plant #2 has two ammonia systems that provide refrigeration capacity to multiple cold rooms equipped with forced air tunnels for cooling fruit.  Twenty rooms are designated as \"precooling\" rooms, twelve others are designated cold storage rooms, one is designated for Quality Control and one for Preconditioning of Fruit.  Several hallways and the loading dock are also refrigerated.  Computer systems also provide substantial control and alarm capability.\n\nHigh pressure liquid from the high pressure receivers is piped to a series of a liquid feed solenoid valves.  From there, high pressure liquid is piped to each cold room, where it passes through an expansion valve into a low pressure accumulator vessel mounted either on the roof or in the bunkers.  Low temperature liquid circulates by thermal convection through the evaporator coils located behind bunker walls in the cold rooms.  Low pressure and temperature gas collects in the accumulator vessel, and passes through a pressure regulator into a suction line.  The suction line returns the vapor to main suction accumulators which separate any residual liquid from the gas.  The gas is piped to compressors which elevate the temperature and pressure of the gas.  The high pressure discharge gas from the compressors is sent to water cooled evaporative condensers where the high pressure gas ammonia is liquified and returned to the high pressure receivers. Liquid separated from the suction return gas in the primary accumulator vessels drains into liquid transfer vessels.  Operation of float switch activated solenoid valves raise the pressure in the liquid transfer vessels to the point the liquid can be drained into the high pressure receivers.  There are three high pressure receivers; two in the west engine room and one in the east engine room.   \n\nThe facilities were built by professional refrigeration engineers in accordance industry standards.  They were also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction of each. The systems contain numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to the atmosphere if the pressure in the system exceeds their set point.  In addition, ammonia detectors are located in selected areas of the facility, and will shut down equipment if ammonia is detected.  Lastly, an emergency \"dump box\" contains switches and valves to turn off equipment and vent ammonia from each system if necessary.\n\nThe ammonia systems at this facility are co-located such that a release of ammonia could impact the ability to operate vessels which are not directly connected.  Therefore, the facility is treated as a single process.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000010139,
                  "PreventionProgram3ID": 1000008752,
                  "ProcessChemicalID": 1000012207
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000009155,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-06-22 00:00:00",
    "ERTrainingDate": "2009-06-23 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "5596389228",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009155,
      "SummaryText": "1.2    EXECUTIVE SUMMARY\n\n1.    Emergency Response and Prevention Policy.\n\nAll employees are to report all releases of ammonia (odors) immediately.  \n\nFederal regulations require reporting when there is a release of ammonia exceeding 100 pounds in 24 hours.\n\nState regulations required reporting when there is an accidental release of ammonia or a threat of accidental release of ammonia.  Gerawan Farming interprets this regulation at any release that poses a threat of injury to anyone.\n\nAll releases and near misses are to be recorded using the incident investigation forms in the Operations Binder.  All releases are to be monitored and all readings recorded.  All releases and near misses are to be reviewed to develop procedures that may prevent future incidents.\n\nAny release of more than 50 ppm shall result in immediately shutting down the ammonia system and Steven Jackson is to be called if not on site.  Releases less 50 ppm shall result in immediately calling Steven Jackson, if not on site, for instructions.\nQuick response kits have been provided for Gerawan Farming employees complete this task.  \n\nGerawan Farming maintains a full time maintenance crew.  Gerawan Farming employees perform daily inspections as well as minor repairs and oil draining at this facility.\n\nInvasive procedures to the ammonia system are generally performed by contractors (APCCO) and (CA).  Both of these contractors have an extended working relationship with Gerawan Farming, Plant #2/\n\nProcess Description and Operating Condition\n\nThe Gerawan Farming Plant 2 facility is a commercial packinghouses for deciduous tree fruit A? apricots, nectarines, peaches, plums, and grapes.  Plant #2 has two ammonia systems that provide refrigeration capacity to multiple cold rooms equipped with forced air tunnels for cooling fruit.  Twenty rooms are designated as A?precoolingA? rooms, twelve others are designated cold storage rooms, one is designated for Quality Control and one for Preconditioning of Fruit.  Several h"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009155,
      "SummaryText": "allways and the loading dock are also refrigerated.  Computer systems also provide substantial control and alarm capability.  \n\nHigh pressure liquid from the high pressure receivers is piped to a series of a liquid feed solenoid valves.  From there, high pressure liquid is piped to each cold room, where it passes through an expansion valve into a low pressure accumulator vessel mounted either on the roof or in the bunkers.  Low temperature liquid circulates by thermal convection through the evaporator coils located behind bunker walls in the cold rooms.  Low pressure and temperature gas collects in the accumulator vessel, and passes through a pressure regulator into a suction line.  The suction line returns the vapor to main suction accumulators which separate any residual liquid from the gas.  The gas is piped to compressors which elevate the temperature and pressure of the gas.  The high pressure discharge gas from the compressors is sent to water cooled evaporative condensers where the high pressure gas ammonia is liquefied and returned to the high pressure receivers. Liquid separated from the suction return gas in the primary accumulator vessels drains into liquid transfer vessels.  Operation of float switch activated solenoid valves raise the pressure in the liquid transfer vessels to the point the liquid can be drained into the high pressure receivers.  There are three high pressure receivers; two in the west engine room and one in the east engine room.   \n\nThe facilities were built by professional refrigeration engineers in accordance industry standards.  They were also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction of each. The systems contain numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to the atmosphere if the pressure in the system exceeds their "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009155,
      "SummaryText": "set point.  In addition, ammonia detectors are located in selected areas of the facility, and will shut down equipment if ammonia is detected.  Lastly, an emergency A?dump boxA? contains switches and valves to turn off equipment and vent ammonia from each system if necessary.\n\nThe ammonia systems at this facility are co-located such that a release of ammonia could impact the ability to operate vessels, which are not directly connected.  Therefore, the facility is treated as a single process.  \n\n\nThe ammonia is contained in two closed systems. System 2.0 contains approx. 76,000 pounds of ammonia contained in two high pressure receivers.  System 2.1 contains approx. 53,918 pounds of ammonia in a single high pressure receiver.\n\n3.    No Entry per current requirements.\n\n4. Gerawan FarmingA?s Prevention Program is described in the RMP/PSM Manual.  The RMP Prevention Program is equivalent to OSHA's Process Safety Management Program (PSM).  The Prevention Program implemented by Gerawan Farming is essential to help prevent releases and to minimize the effects if a release does occur.\n\nKey objectives of Gerawan Farming Prevention Program are briefly described below:\n\n1) Maintain current and complete refrigeration system technical information. (Addressed under the Process Safety Information chapter)\n2) Thorough team evaluation of the refrigeration system.  The evaluation considers a number of potential problems including: mechanical problems, human errors, and external events (e.g., earthquakes).  All safety recommendations developed by the team are reviewed and addressed by Gerawan Farming.  (Addressed under Process Hazard Analysis chapter.)\n3) Written procedures and policies that establish how the refrigeration system should be operated and maintained and how to investigate accidental releases. (Addressed under Operating Procedures, Mechanical Integrity, and Incident Investigation chapters.)\n4) Certification of refrigeration operators to safely operate the refrigeration system"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009155,
      "SummaryText": ".  Gerawan Farming certifies operators following completion of operator training and Gerawan Farming's confirmation of the operator's ability apply what they have learned.  (Addressed under Training chapter.)\n5) Employee involvement in the Prevention Program.  This is addressed on two levels.  First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Process Hazard Analysis study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.).  This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to-day activities.  \nSecond, all Gerawan Farming employees (direct hires and contract) at this facility receive ammonia awareness training.  Additionally, they have access to the RMP/PSM information.  These activities improve the overall safety of the employees. (Both levels are addressed under Employee Participation chapter)\n6) Implementation of additional measures when changes are planned (procedural or mechanical).  These measures begin before any changes are made and may include a Process Hazard Analysis, operator training, and Process Safety Information updates plus other measures required by Gerawan Farming's Management of Change Procedure.  \nIf a mechanical change is required and for maintenance contracts, Gerawan Farming has a procedure for selecting a contractor based on the company's experience and safety history. Additionally, if welding, grinding, or other \"Hot Work\" occurs close to the refrigeration system, a Gerawan Farming Hot Work permit is required.  The purpose of the permit and the associated Hot Work procedure is to minimize the possible of a fire. \nFollowing completion of a mechanical change, a pre-startup safety review is required before the system can be started. (These areas are addressed under Management of Change, Contractor Qualifications, Hot Work Permit, and Pre-Start-up Safety Review chapters.)\n7) Verification"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000009155,
      "SummaryText": " of Gerawan Farming's compliance with the RMP/PSM program.  This self-audit process is an important tool to confirm whether each of the elements in the Prevention Program (and the Risk Management Program) has been implemented and properly documented by Gerawan Farming personnel.  Gerawan Farming has established a Management System procedure to address any shortcomings, which the audit may find. (Addressed under Compliance Audit chapter.)   \n8) Minimize employee injury and illness.  \n\n5.  There were no reported ammonia releases during the last five years.\n\n6.  This facility has trained personnel to implement the Emergency Response Plan developed for this facility.  Detailed plans (emergency action plans) have been developed to assist responding facility personnel.  All areas (zones) in this plant can be brought under control within 20 minutes of any ammonia emergency or breakdown.  Small releases can be brought under control immediately.  \n\nThe emergency release response plan for all releases is to gain access to the shut down valves and switches for the area with the release.  If the area shut down  are within the ammonia release area at concentrations above 300 ppm, the entire ammonia will be shut down if appropriate.  \n\nThe Fresno Fire Department personnel will respond to any major release.  Reedley Fire Department has been contacted and appraised of the chemicals contained at this facility.\n\nThe Federal and California Emergency Planning Regulations considered in this program include:\n    EPAA?s Risk Management Plan\n    OSHAA?s Emergency Action Plan\n    OSHAA?s Process Safety Standard\n    EPAA?s Emergency Planning and Community Right to Know\n    Business Plan (CA)\n    Contingency Plan (integrated into Business Plan)\n    CalARP (Calif. version of above cited regulations)\n\nProduct and community safety are primary concerns at this facility.  The prevention program has been updated during this 5 year update process.\n"
    }
  ]
}