{
  "FacilityID": 1000052144,
  "FacilityName": "WESTROCK COATED BOARD, LLC",
  "FacilityStr1": "HIGHWAY 165 SOUTH",
  "FacilityStr2": null,
  "FacilityCity": "COTTONTON",
  "FacilityState": "AL",
  "FacilityZipCode": "36851",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01113",
  "LEPC": "Russell County LEPC",
  "FacilityLatDecDegs": "32.175000",
  "FacilityLongDecDegs": "-085.030833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.WESTROCK.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 184102846,
  "ParentCompanyName": "WESTROCK COMPANY",
  "Company2Name": null,
  "CompanyDUNS": 102235004,
  "Company2DUNS": 102235004,
  "OperatorName": "WESTROCK COATED BOARD, LLC",
  "OperatorStr1": "PO BOX 940",
  "OperatorStr2": null,
  "OperatorCity": "PHENIX CITY",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36868",
  "OperatorZipCodeExt": null,
  "FTE": 700,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124304",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "211-0004",
  "SafetyInspectionDate": "2008-09-11 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-09-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-09-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-09-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-09-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.17497,
  "FRS_Long": -85.03097,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000065791,
      "AltID": "coating process",
      "FacilityID": 1000052144,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000081418,
          "ProcessID": 1000065791,
          "ChemicalID": 57,
          "Quantity": 32190.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000066953,
          "ProcessID": 1000065791,
          "NAICSCode": "32213",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000052144,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2013-03-12 00:00:00",
    "ERTrainingDate": "2014-11-17 00:00:00",
    "CoordinatingAgencyName": "MAHRT MILL HAZMAT TEAM",
    "CoordinatingAgencyPhone": "3348555200",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000052144,
      "SummaryText": "The WestRock- WestRock Coated Board, LLC,\n\nMahrt mill is committed to operating in a manner safe for\n\nMahrt workers, the public, and the environment.  Employing\n\nover 700 people from the surrounding communities,\n\nWestRock recognizes that it is a vital part of the\n\ncommunity.  It also recognizes its responsibility in\n\ninforming the community of potential hazards associated with\n\nthe processes at the Mahrt mill.  As part of this\n\ncommitment, Mahrt has established a system to help ensure\n\nsafe operation of the processes at this facility and in\n\nturn, reduce the risk to employee health, contractor health\n\nand community health and to the environment.  WestRock's\n\nMahrt mill risk reduction system includes a Process Safety\n\nManagement system that complies with the requirements of the\n\nOccupational Safety and Health Administration (OSHA)\n\nregulation 29 CFR 1910.119.  Another component of this\n\nsystem is a Risk Management Program (RMP) that helps manage\n\nthe risks at Mahrt and complies with the requirements of the\n\nEnvironmental Protection Agency's (EPA) regulation 40 CFR\n\npart 68, Accidental Release Prevention Requirements:  Risk\n\nManagement Programs (the RMP rule).  One of the requirements\n\nof the RMP rule is to submit a risk management plan (RMPlan)\n\ndescribing the risk management program at Mahrt.  This\n\ndocument is intended to satisfy the RMPlan requirements of\n\nthe RMP rule and to provide the public with the description\n\nof the risk managment program at Mahrt\n\n\n\n1.1  Accidental Release Prevention and Emergency Response\n\n     Policies\n\n\n\nMahrt is committed to the safety and health of Mahrt workers\n\nand the public, and to the preservation of the environment,\n\nthrough the prevention of accidental releases of hazardous\n\nsubstances.  Mahrt implements reasonable controls such as\n\noperator training, preventive maintenance and safe operating\n\nprocedures to prevent foreseeable releases of hazardous\n\nsubstances.  Before using a hazardous substance at Mahrt\n\nmill, Mahrt considers"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000052144,
      "SummaryText": " using alternative substances that do\n\nnot have the potential to adversely affect Mahrt workers,\n\nthe public and the environment.   In the event of a\n\nsignificant accidental release, Mahrt evacuates workers and\n\ncontains the release to prevent and or reduce the\n\nconsequences of the release.\n\n\n\n1.2  The WestRock Coated Board, LLC-Mahrt and Regulated\n\n     Substances\n\n\n\nMahrt is a paper mill without bleaching operations,\n\nproducing coated unbleached Kraft paperboard, known as\n\nCoated Natural Kraft for use in multiple beverage packaging\n\nand folding cartons for food, pharmaceuticals and other\n\nproducts.  Mahrt mill produces two grades of Coated Natural\n\nKraft paperboard:  Carrier Kote for beverage packaging and\n\nCustom Kote for folding cartons.  More than half of the\n\nmills total production is Carrier Kote.  The covered process\n\nis defined as a regulated substance present in more than a\n\nthreshold quantity as determined under 68.115 and includes\n\nany use, storage, manufacturing, handling or the on-site\n\nmovement of such substances, or combination of these\n\nactivities.  For the purposes of this definition, any group\n\nof vessels that are interconnected, or separate vessels,\n\nwhich are located such that a regulated substance could be\n\ninvolved in a potential release, shall be considered a\n\nsingle process.  The facility handles one substance\n\nregulated by the RMP rule in sufficient quantities to be\n\ncovered by the RMP rule:\n\n     -Aqueous Ammonia stored in the Color Plant area for use\n\non the Paper Machines\n\n\n\nAs a result of the use of the regulated substances at Mahrt,\n\nthe following process is covered by the RMP rule:\n\n                    Process- Aqueous Ammonia\n\n                    Program Level- 1\n\n                    Regulated Substance- Ammonia (29wt. %)\n\n                    Process Quantity- 32,190\n\n\n\n1.3  Off-site Consequence Analysis\n\n\n\nThe RMP rule requires the Mahrt mill to perform an off-site\n\nconsequence analysis for the following scenarios\n\n               - "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000052144,
      "SummaryText": "   One worst case scenario for the toxic substance ammonia\n\n\n\nThe purpose of the offsite consequence analysis is to\n\ndetermine the distance at which certain effects might occur\n\nto the public and environment in the event of an accidental\n\nrelease.  The following information summarizes this offsite\n\nconsequence analysis.\n\n\n\n1.3.1     Aqueous Ammonia\n\n\n\nAqueous Ammonia is a colorless liquid with a pungent odor.\n\nIt is non-flammable, mixes with water and contact should be\n\navoided with the liquid vapor.  The worst case release\n\nscenario for the toxic substances is failure of the 15,000\n\ngallon (32,190 lbs) aqueous ammonia (29% wt) storage tank in\n\nthe rail car unloading area.  A diked area contains the\n\nrelease aqueous ammonia, which evaporates, forming a vapor\n\ncloud.  The maximum distance to the toxic endpoint\n\nconcentration is .30 mile.  No public or environmental\n\nreceptors are located within this distance of storage tank.\n\n\n\n1.4  Accidental Release Prevention Program and Chemical\n\n     Specific Prevention Steps\n\n\n\nMahrt maintains a number of programs to help prevent\n\naccidental releases and ensure safe operation.  The accident\n\nprevention programs in place at Mahrt include:\n\n\n\n     Safety information.  Mahrt maintains a variety of\n\ntechnical documents that are used to help maintain safe\n\noperation of the processes at Mahrt.  Material safety data\n\nsheets (MSDS's) document the physical properties of\n\nhazardous substance handled at Mahrt, including the\n\nregulated substance in covered process.  The information\n\nincludes toxicity information, permissible exposure limits,\n\nphysical data, reactivity data, corrositivity data, thermal\n\nand chemical stabilility data and the hazards of mixing\n\nsubstances in the process.  The engineering design documents\n\ninclude the operating parameters, the design basis and\n\nconfiguration of the equipment in each covered process and\n\nreferences to applicable codes and standards.\n\n\n\n     Hazard Review.  Mahrt performs and periodically update"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000052144,
      "SummaryText": "s\n\nhazard reviews of the covered process to help identify and\n\ncontrol process hazards.  Checklists are used to guide the\n\nhazard review.  These checklists include items to help\n\nensure the Mahrt operates and maintains the equipment in a\n\nmanner consistent with the applicable design specifications,\n\ncodes, standards and regulations.\n\n\n\n     Operating Procedures.  Mahrt develops and maintains\n\noperating procedures to define how tasks related to process\n\noperations should be performed.  The operating procedures\n\nare used to train employees and contractors and serve as\n\nreference guides for appropriate actions to take during both\n\nnormal operations and process upsets.\n\n\n\n     Training.  Mahrt trains personnel in the operating\n\nprocedures to help ensure safe and effective performance to\n\ntheir assigned tasks.  A training documentation file is\n\nmaintained to help ensure that refresher training is\n\nprovided, as necessary.\n\n\n\n     Maintenance.  Mahrt properly maintains the process\n\nequipment.  The Mahrt mill maintenance program includes\n\nprocedures to safely guide workers in their maintenance\n\ntasks.  Worker training in the maintenance procedures and\n\ninspections and testing program to help identify equipment\n\ndeterioration and damage before the equipment fails.\n\n\n\n     Compliance Audits.  Mahrt performs periodic compliance\n\naudits of the covered process to verify that the process is\n\noperating in compliance with the requirements of the RMP\n\nrule.\n\n\n\n     Incident investigations.  Mahrt investigates all\n\nincidents that could reasonably result in a serious injury\n\nto personnel, the public or the environment. Mahrt trains\n\nemployees to identify and report any incident requiring\n\ninvestigation.  An investigation team is assembled, and the\n\ninvestigation is initiated within 48 hours of the incident.\n\nThe results of the investigation are documented,\n\nrecommendation is resolved and appropriate process\n\nenhancements are implemented.\n\n\n\n     Chemical Specific Prevention Steps.  In"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000052144,
      "SummaryText": "dustry standards\n\nare followed at Mahrt to help ensure safe handling of\n\naqueous ammonia.  The ammonia vendor supplies aqueous\n\nammonia via Department of Transportation (DOT) approved tank\n\ntruck and follows DOT standards when loading the aqueous\n\nammonia storage tank.  The storage tank design and\n\nconstruction are consistent with the American National\n\nStandards Institute (ANSI) standards.\n\n\n\n1.5  Five Year Accident History\n\n\n\nNo releases of regulated substances have occurred from Mahrt\n\nin the last five years that have resulted in consequences of\n\ninterest (i.e., death, injuries, or significant property\n\ndamage on site; or known death, injuries, evacuations,\n\nsheltering-in-place, property damage, or environmental\n\ndamage off site)\n\n\n\n1.6  Emergency Response Program\n\n\n\nMahrt mills emergency response program contains procedures\n\nfor accidental releases and hazards associated at the Mahrt\n\nmill.  Mahrt fire brigade and HAZMAT team have been trained\n\naccording to these procedures and will respond to fires and\n\nreleases.\n\n\n\n1.7  Planned Changes to Improve Safety\n\n\n\nMahrt constantly strives to improve the safety of the\n\nprocess at Mahrt through both the incident investigation\n\nprogram and a program soliciting safety suggestions from the\n\nworkers.\n\n"
    }
  ]
}