{
  "FacilityID": 1000079728,
  "FacilityName": "DDP Specialty Electronics Materials US",
  "FacilityStr1": "901 East Kankakee River Drive",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "IL",
  "FacilityZipCode": "60481",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17197",
  "LEPC": "Will County LEPC",
  "FacilityLatDecDegs": "41.317778",
  "FacilityLongDecDegs": "-088.136389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1381581,
  "ParentCompanyName": "Rohm and Haas Electronic Materials CMP Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DDP Specialty Electronics Materials",
  "OperatorStr1": "901 East Kankakee River Drive",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60481",
  "OperatorZipCodeExt": null,
  "RMPContact": "Nirav Panchal",
  "RMPTitle": "Site Leader",
  "FTE": 140,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186602",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099496,
      "AltID": "Hydrocarbon Storage",
      "FacilityID": 1000079728,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100733,
          "ProcessID": 1000099496,
          "NAICSCode": "32599",
          "_desc": {
            "NAICS_CODE": "32599",
            "NAICS_DESCRIPTION": "All Other Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124685,
          "ProcessID": 1000099496,
          "ChemicalID": 155,
          "Quantity": 81000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000107920,
              "ProcessChemicalID": 1000124685,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000107921,
              "ProcessChemicalID": 1000124685,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000107922,
              "ProcessChemicalID": 1000124685,
              "ChemicalID": 130,
              "_chemical": {
                "ChemicalID": 130,
                "ChemicalName": "Methyl ether  [Methane, oxybis-]",
                "CASNumber": "115-10-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000624685,
          "ProcessID": 1000099496,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079728,
      "SummaryText": "General Executive Summary for Chemical, Manufacturing and Oil Refining Facilities\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nWe at DDP Electronic Materials are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass production of polyurethane systems.  We have 2 regulated substances present at our facility.  They are both flamable liquid mixtures consisting of isobutane, propane, and methyl ether.  The flammable liquid mixtures are stored in two individual tanks at the facility, and are used as blowing agents in the production of aerosol cans containing polyurethane foam. This plan covers both storage and transfer of material through piping to the production lines.\n\n\n\n3. The Worst Case Release Scenario and the Alternative Release Scenario, including administrative controls and mitigation measures to limit the distances for each reported scenario, were modeled using most current RMP Comp.\n\n\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with applicable API / ASME Specifications, applicable NFPA Codes, and Corporate Standards.The following sections briefly describe the elements of the release prevention program thatare in place at our facility.\n\n\n\nProcess Safety Information\n\nDDP Electronic Materials maintains a detailed record"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079728,
      "SummaryText": " of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is Reactive Chemical/Process Hazard Analysis Reviews, Layer of Protection Analysis Reviews, and other reviews.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of three years.  Any findings related to the hazard analysis are addressed in a timely manner.  \n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, DDP Electronics Materials maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nDDP Electronics Materials has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\n\n\nMechanical Integrity\n\nDDP Electronics Materials carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered spec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079728,
      "SummaryText": "ialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at DDP Electronics Materials to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training on the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at DDP Electronics Materials. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nDDP Electronics Materials conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nDDP Electronics Materials promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nDDP Electronics Materials truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079728,
      "SummaryText": "including information resulting from process hazard analyses in particular.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  DDP Electronic Materials has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n\n\n5. Five-year Accident History\n\nDDP Electronics Materials has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\n6. Emergency Response Plan\n\nDDP Electronics Materials carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\n7. Planned Changes to Improve Safety\n\nThere are a few changes being evaluated (not yet planned) with regards to Hydrocarbon handling safety.\n\n\n\n1.    Use of dry disconnects and breakaway couplings on the unload arms\n\n2.    The installation of a break wall to help prevent movement of a potentially flammable cloud off-site\n\n3.    Spring loaded vent valves on the unload arms\n\n4.    Procedural changes on testing unload connections prior to beginning unloading\n\n5.    Procedure creation/revisions"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079728,
      "SummaryText": " as related to proper inerting of Hydrocarbon systems after maintenance and prior to RTO\n\n"
    }
  ]
}