{
  "FacilityID": 1000048098,
  "FacilityName": "Verona Pumping Station",
  "FacilityStr1": "Verona Pumping Station",
  "FacilityStr2": "250 Brigden Dr.",
  "FacilityCity": "Battle Creek",
  "FacilityState": "MI",
  "FacilityZipCode": "49014",
  "Facility4DigitZipExt": "6612",
  "FacilityCountyFIPS": "26025",
  "LEPC": "Calhoun County LEPC",
  "FacilityLatDecDegs": "42.338806",
  "FacilityLongDecDegs": "-085.144028",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Battle Creek",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Battle Creek",
  "OperatorStr1": "10 N Division St.",
  "OperatorStr2": null,
  "OperatorCity": "Battle Creek",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49016",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian K. Cowham",
  "RMPTitle": "Chief Operator",
  "FTE": 6,
  "OtherEPAFacilityID": "MI0000450",
  "EPAFacilityID": "100000037603",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-10-29 00:00:00",
  "SafetyInspectionBy": "RS Technical Inc., Leak detectors",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-12-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-29 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-03-15 00:00:00",
  "DeRegistrationEffectiveDate": "2015-11-02 00:00:00",
  "AnniversaryDate": "2019-12-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.34167,
  "FRS_Long": -85.14333,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "148000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060163,
      "AltID": "Water Chlorination",
      "FacilityID": 1000048098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061292,
          "ProcessID": 1000060163,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073686,
          "ProcessID": 1000060163,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000573686,
          "ProcessID": 1000060163,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048098,
      "SummaryText": "City of Battle Creek-Verona Pumping Station\n\nRMP Executive Summary \n\n\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nWe at the Verona Pumping Station (Water Treatment Plant) are strongly committed to\n\nemployee, public and environmental safety. This is demonstrated, by an accidental release\n\nprevention program that covers such areas as design, installation, operating procedures,\n\nmaintenance and employee training associated with the process at our facility. It is our\n\npolicy, through the use of appropriate controls, to prevent the release of the regulated\n\nsubstance used in our operation. If such a release should occur, we are completely\n\ncoordinated with the HAZMAT unit of the Battle Creek Fire Department. They would\n\nprovide the highly trained emergency response personnel to control the effects of any\n\nrelease.\n\n\n\nThe Source and Regulated Substance Handled\n\n\n\nThe primary activity of the Verona Pumping Station is Municipal Water Supply and\n\nTreatment. We have 1 regulated substance at our facility. That substance is Chlorine. It is\n\nused in the treatment process for oxidation and disinfection.\n\n\n\nThe maximum inventory at the Verona Pumping Station is 24,000 lbs. It is stored in 1\n\nlocation in 2,000 lb. cylinders.\n\n\n\n3. The Worst Case Release Scenario and the Alternative Release Scenario, including\n\nadministrative controls and mitigation measures to limit the distance for each scenario.\n\n\n\nTo evaluate the worst case scenario, RMP Comp Software ver. 1.07. We have used the same\n\nSoftware for the alternative scenario. The details are as follows.\n\n\n\nThe worst case scenario involves a direct release of 2,000 lbs. of Chlorine in a gaseous form over 10 minutes. At Class F atmospheric stability and 1.5 m/s wind speed, a maximum distance of 1.3 miles is needed in an urban setting to reach a toxic endpoint of 0.0087 mg/L.\n\n\n\nThe Alternative release scenario submitted for a 1 ton Chlorine Container with gas feed. This scenario involves the release of Chlo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048098,
      "SummaryText": "rine gas through a 5/16\" diameter valve\n\nbody opening due to tubing, connection or valve failure. It has a 317lb total release at a rate of 10.5 lb/min over a 60 minute duration. This scenario assumes a stability class D, relative humidity of 50%, temperature of 77 degrees F and wind speed of 3.0 m/s. This\n\nscenario has a distance to it's toxic endpoint of 0.10 miles in an urban setting.\n\n\n\nPage 2\n\n\n\n4. General Accidental Release Prevention Program and the Chemical-Specific Prevention\n\nSteps.\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release\n\nprevention requirements set out under 40 CFR part 68. The Chlorination process at our\n\nfacility is subject to the OSHA PSM standard under 29 CFR 1910.119. The following\n\nsections briefly describe the elements of the program that is in place at the Verona\n\nPumping Station.\n\n\n\nProcess Safety Information\n\nThe Verona Pumping Station maintains a detailed record of safety information on the\n\nchemical hazards, operating parameters and equipment designs associated with the\n\nChlorination process.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that the hazards associated with the\n\nChlorination process are identified and controlled. We use the \"Check List\" analysis\n\nmethod, conducted by a team of qualified personnel, to evaluate the process every 3 years\n\nor whenever there is a change to the process. Any problems are addressed in a timely\n\nmanner.  \n\n\n\nOperating Procedures\n\nThe Verona Pumping Station maintains written operating procedures. These procedures\n\ncover the modes of operation such as start up, normal operations, emergency operations\n\nand shutdown procedures. These procedures are reviewed regularly and are available to\n\nanyone involved with the process.\n\n\n\nTraining\n\nThe Verona Pumping Station has a training program in place to ensure that employees\n\noperating the process are competent in the operating procedures associated with the\n\nprocess. Refresher traini"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048098,
      "SummaryText": "ng is provided at least every 3 years.\n\n\n\nMechanical Integrity\n\nVerona Pumping Station carries out documented maintenance checks on all the\n\nchlorination equipment to ensure proper operation. Maintenance checks are performed by\n\nqualified  personnel and factory trained service people. Any problems are corrected in a\n\ntimely manner. \n\n\n\nManagement of Change\n\nWritten procedures are in place at the Verona Pumping Station to manage any change in\n\nthe Chlorination process. This includes changes in equipment, technology or procedures.\n\nAll employees involved with the maintenance or operation of the process are notified\n\npromptly of any changes and offered training on the changes.\n\n\n\nPage 3\n\n\n\nPre-start up Review\n\nPre-start up, safety reviews are conducted on any new equipment or changes to existing\n\nequipment in the Chlorination process. These reviews are conducted to confirm that\n\nconstruction, operating and maintenance procedures are correct and understood by all\n\nemployees involved in the process prior to the start up of any new equipment.\n\n\n\nCompliance Audits\n\nThe Verona Pumping Station will conduct audits on a regular basis to determine if the\n\nprovisions under the PSM rule are being carried out. These audits are to be done at least\n\nevery 3 years. Any corrective actions required, as a result of these audits, will be promptly\n\ntaken care of.\n\n\n\nIncident Investigation\n\nThe Verona Pumping Station promptly investigates any incident that results in or could\n\nresult in a chlorine release. These investigations are to identify the causes leading to the\n\nincident as well as any corrective actions necessary to prevent its recurrence.\n\n\n\nEmployee Participation\n\nThe staff, of the Verona Pumping Station, believes that process safety management and\n\naccident prevention are a team effort. Employees are encouraged to express their views on\n\naccident prevention and to recommend improvements. Employees actively serve on the\n\nProcess Safety Management Team.\n\n\n\nContractors\n\nSometimes w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048098,
      "SummaryText": "e hire contractors to conduct maintenance and construction activities. These\n\ncontractors are required to adhere to all safety regulations and policies. Verona Pumping\n\nStation has a strict policy of coordinating safety issues with contractors and employees on\n\nany potential hazards involved with the contractors work. Contractors are also informed\n\nof all emergency response procedures, should an accidental release occur.\n\n\n\n5. Five year Accident History\n\n\n\nThe Verona Pumping Station has an excellent record of preventing accidental releases\n\nover the years. In the past 5 years we have had no releases of chlorine that resulted in any\n\ndeaths, injuries, damage on site or off site consequences. \n\n\n\n6. Emergency Response Plan\n\n\n\nThe Verona Pumping Station has a written emergency response plan to deal with the\n\nrelease of any hazardous materials. This plan requires the notification of the Battle Creek\n\nFire Department. It relies on their HAZMAT team for all aspects of emergency response\n\nincluding first aid, medical treatment, evacuations, notification of local emergency\n\nagencies and the public. \n\n\n\nPage 4\n\n\n\nTo ensure proper operation, our emergency equipment is inspected and serviced according\n\nto the manufacturers recommendations.\n\n\n\nThe Calhoun County LEPC is the Local Emergency Planning Committee.\n\n                                                                                                                         7. Planned Changes to Improve Safety\n\n\n\nThere are current plans to change our operating equipment. We are constantly reviewing changes in our industry and new technologies for anything we can do to make the operation of our Chlorination Process safer. We will be installing a new Sodium Hypochlorite system and eliminating the use of Chlorine Gas.\n\n\n\n8. Certification Statement\n\n\n\nThe undersigned certifies that to the best of my knowledge, information and belief, formed\n\nafter reasonable inquiry, the information is true, accurate and complete.\n\n\n\nBrian K. "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048098,
      "SummaryText": "Cowham\n\n\n\n\n\nChief Operator - Verona Pumping Station\n\nCity of Battle Creek\n\n\n\nDate: 12/24/14"
    }
  ]
}