{
  "FacilityID": 1000081146,
  "FacilityName": "CS Storage IV Inc.",
  "FacilityStr1": "230 Kenneth Welch Drive",
  "FacilityStr2": null,
  "FacilityCity": "Lakeville",
  "FacilityState": "MA",
  "FacilityZipCode": "02347",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25023",
  "LEPC": "Lakeville LEPC",
  "FacilityLatDecDegs": "41.881632",
  "FacilityLongDecDegs": "-70.939384",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cssfreezers.com",
  "FacilityEmailAddress": "tom@cssfreezers.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Thomas Parenteau",
  "OperatorStr1": "310 Kenneth Welch Drive",
  "OperatorStr2": null,
  "OperatorCity": "Lakeville",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02347",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000226025",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-08-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-08-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101423,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000081146,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127080,
          "ProcessID": 1000101423,
          "ChemicalID": 56,
          "Quantity": 16800.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000102670,
          "ProcessID": 1000101423,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000085674,
              "Process_NAICS_ID": 1000102670,
              "SafetyReviewDate": "2019-06-11 00:00:00",
              "PHA_Date": "2018-11-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-09-30 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-07-02 00:00:00",
              "TrainingReviewDate": "2019-04-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-06-20 00:00:00",
              "EquipmentInspectionDate": "2019-06-27 00:00:00",
              "EquipmentTested": "Compressors, vessels, condenser, evaporators, and piping.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2019-06-11 00:00:00",
              "PreStartupReviewDate": "2014-07-01 00:00:00",
              "ComplianceAuditDate": "2017-10-27 00:00:00",
              "AuditCompletionDate": "2018-10-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-04-17 00:00:00",
              "HotWorkPermitReviewDate": "2019-04-17 00:00:00",
              "ContractorSafetyReviewDate": "2019-04-17 00:00:00",
              "ContractorSafetyEvalDate": "2019-04-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "The purpose of the Cold Storage Solutions Risk Management Program is to assist with the prevention of accidental releases of toxic and flammable substances that can cause harm to the public, facility employees, and to the environment.\n\n\n\nCold Storage Solutions? Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68.  The stationary source is the ammonia refrigeration system located at Cold Storage Solutions 230 Kenneth Welch Drive, Lakeville, MA.  It is owned and operated by CS Storage IV, Inc.  The only Risk Management Program regulated substance at this facility is anhydrous ammonia, which is classified as a toxic substance, liquified under pressure.  \n\n\n\nThis facility is a cold storage warehouse/food distribution facility.  The refrigeration system in this facility has an inventory of approximately 15,000 pounds of anhydrous ammonia stored on site in two separate ammonia refrigeration systems.  System 1 is 8,626 lbs and System 2 is 8,167 lbs.  This process does not meet the requirements of Program 1.  It is subject to OSHA?s Process Safety Management Standard.  Thus, this Risk Management Plan has been developed to meet the EPA Program 3 Level of Compliance.\n\n\n\nThis Risk Management Program Manual has been developed by HCG Associates on behalf of CS Storage IV, Inc. specifically to prevent or mitigate accidental releases associated with the storage and use of anhydrous ammonia at the Cold Storage Solutions facility. As noted in specific sections, portions of this Plan, including technical details associated with anhydrous ammonia operations were prepared by Ammerican Refrigeration Inc., of Andover, Massachusetts. This manual was developed to meet the requirements of the Risk Management Plan regulations and is available to government agencies and the public for review.\n\n\n\nCold Storage Solutions operates the 230 Kenneth Welch Drive facility on an approximately 13-acre industrially zoned parcel in Lakeville, Massachusetts (see Figure 1). The site is situated approximately 2.5-miles north of Assawompsett Pond, the public drinking supply for the City of Taunton, .47 miles southwest of Rt. 495, an interstate highway which averages 50,000 vehicles per day, .32 miles south of a CSX freight rail line, and 2.6 miles north of Assawompset Elementary School.\n\n\n\n\n\nCold Storage Solution?s 230 Kenneth Welch Drive facility adheres to a comprehensive fourteen volume Process Safety Management Program developed to assist in preventing the accidental discharge or release of anhydrous ammonia.  The RMP also works concurrently with the OSHA Process Safety Management program under 29 CFR 1910.119.  CSS employees and management staff participate in both regulatory safety programs in order to maintain an accident free work environment.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000106853,
                  "PreventionProgram3ID": 1000085674,
                  "ProcessChemicalID": 1000127080
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081146,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-07-24 00:00:00",
    "ERTrainingDate": "2019-06-24 00:00:00",
    "CoordinatingAgencyName": "Lakeville Fire & Police Departments",
    "CoordinatingAgencyPhone": "5089474121",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "MGL CMR 1 c60"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081146,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE\n\n\n\nThe purpose of the Cold Storage Solutions Risk Management Program is to assist with the prevention of accidental releases of toxic and flammable substances that can cause harm to the public, facility employees, and to the environment.  It is the policy of Cold Storage Solutions to adhere to all applicable Federal, State, and Local laws and regulations. The ammonia refrigeration process at Cold Storage Solutions has been designed and operates in accordance with EPA's Accidental Release Prevention Rule, and applicable State and Local codes and regulations.  Cold Storage Solutions has qualified engineering, operations, and maintenance personnel knowledgeable in the process, and the safe operation of ammonia refrigeration systems, with direct responsibility of the process.  The process is also designed and operated in compliance with the Occupational Safety and Health Administration's Process Safety Management Rule.  Cold Storage Solutions has developed a management system that will oversee the implementation of the Risk Management Program.  This implementation will be overseen by the following team of employees:\n\n\n\nMr. Thomas Parenteau will have overall responsibility for the development, implementation, and integration of the program.  Assistance for program supervision is provided by the Safety Director and the Facilities Maintenance Manager, with ultimate responsibility lying with the Facility Manager.  \n\n\n\nCSS Management is committed to the implementation of the Risk Management Program and views it as a vital aspect and integrated part of daily operations.  CSS Management has provided the support and resources to insure the successful implementation of the identified procedures on an ongoing basis.  Furthermore, Cold Storage Solutions realizes that it is of the utmost importance to convey not only its commitment, but further yet a committed culture of safety to its employees, supervisors, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081146,
      "SummaryText": "and business partners.  This will be established in the following manner:\n\n*through verbal instruction upon employee hiring\n\n*by strict enforcement of CSS practices, procedures, and safety programs relative to the operation and maintenance of the ammonia refrigeration systems.\n\n*through corporate management examples\n\n*through recognition of exceptional employees that excel in the RMP\n\n*through emergency response training and drills\n\n*Steps such as these demonstrate the unwavering commitment of Cold Storage Solutions corporate management in requiring employee participation, and compliance with the RMP program.\n\n\n\nThrough the Cold Storage Solutions Emergency Action Plan as required under OSHA PSM, Cold Storage Solutions has emergency response procedures in place that comply with the Accidental Release Prevention Program.\n\n\n\nDESCRIPTION OF FACILITY AND REGULATED SUBSTANCES HANDLED\n\n\n\nCold Storage Solutions' Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68.  The stationary source is the ammonia refrigeration system located at Cold Storage Solutions 230 Kenneth Welch Drive, Lakeville, MA.  It is owned and operated by CS Storage IV, Inc..  The only Risk Management Program regulated substance at this facility is anhydrous ammonia, which is classified as a toxic substance, liquified under pressure.  \n\n\n\nThis facility is a cold storage warehouse/food distribution facility primarily engaged in the refrigerated (cold storage) of seafood and cranberry products Cold Storage Solutions operates the 230 Kenneth Welch Drive facility on an approximately 13-acre industrially zoned parcel in Lakeville, Massachusetts (see Figure 1). The site is situated approximately 2.5-miles north of Assawompsett Pond, the public drinking supply for the City of Taunton, .47 miles southwest of Rt. 495, an interstate highway which averages 50,000 vehicles per day, .32 miles south of a CSX freight rail line, and 2.6 miles north "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081146,
      "SummaryText": "of Assawompset Elementary School.  The two separate and distinct refrigeration systems in this facility have a combined inventory of approximately 16,793 pounds of anhydrous ammonia stored on site in the two separate ammonia refrigeration systems.  System 1 is 8,626 lbs and System 2 is 8,167 lbs.  This process does not meet the requirements of Program 1.  It is subject to OSHA's Process Safety Management Standard.  The Accidental Release Prevention Program applicability threshold for anhydrous ammonia is 10,000 lbs.  Thus, this Risk Management Plan has been developed to meet the EPA Program 3 Level of Compliance.\n\n\n\nThe process is the standard refrigeration cycle.  Anhydrous Ammonia is utilized as a primary refrigerant, with the only substance within the system being Anhydrous Ammonia.  The process causes the ammonia to boil into a gas and then cool into a liquid, repeating the process continuously.  The refrigeration system lowers the liquid pressure to lower the boiling point and then evaporates the ammonia within the system using room air as the heat source.  The system then compresses the ammonia into a high pressure temperature and cools the gas until such time as it condenses.  The condensed liquid is pumped into a low pressure side of the system where the pressure is lowered and the cycle repeats itself.  The ammonia changes states form to a liquid-gas-liquid cycle.  Anhydrous Ammonia does not change chemically, and it is not consumed or released during the refrigeration cycle.  Ammonia continually recirculates throughout the system.\n\n\n\nThe Risk Management Program Manual has been developed specifically to prevent or mitigate accidental releases associated with the storage and use of anhydrous ammonia at the Cold Storage Solutions facility. As noted in specific sections, portions of this Plan, including technical details associated with anhydrous ammonia operations. The written manual was developed to meet the requirements of the Risk Management Plan regulatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081146,
      "SummaryText": "ns and is available to government agencies and the public for review.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nCold Storage Solution's 230 Kenneth Welch Drive facility adheres to a comprehensive fourteen volume Process Safety Management Program developed to assist in preventing the accidental discharge or release of anhydrous ammonia.  The process is currently designed and maintained in compliance with ANSI/ASHRAE guidance, as well as the International Institute of Ammonia Refrigeration Standards.  Process verification takes place through design audits by trained personnel and/or consultants and refrigeration contractors.  The schedule of such verifications is at least once every three years.  The RMP also works concurrently with the OSHA Process Safety Management program under 29 CFR 1910.119.  CSS employees and management staff participate in both regulatory safety programs in order to maintain an accident free work environment.\n\n\n\nThis Cold Storage Solutions facility follows the Environmental Protection Agency Risk Management Plan under 40 CFR 68, and OSHA's 29 CFR 1910.119 Process Safety Management Program.  The documentation requirements of these two programs have been consolidated in the documenting and record filing process with both federal agencies.\n\nThe Accident Prevention Program documents and records are kept as identified in each element of the program.\n\nThe following topics identify the practices and procedures Cold Storage Solutions has adopted:\n\n*Process Safety Information\n\n*Process Hazard Analysis\n\n*Operating Procedures\n\n*Training\n\n*Mechanical Integrity\n\n*Management of Change\n\n*Pre-Startup Review\n\n*Compliance Audits\n\n*Incident Investigations\n\n*Employee Participation\n\n*Hot Works\n\n*Contractors\n\n\n\nPROCESS HAZARD ANALYSIS\n\n\n\nAs part of the program a system evaluation and Process Hazard Analysis is conducted on a five year cycle, or earlier if process changes require additional evaluation.  These recommendations are then evaluated and implemented in a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081146,
      "SummaryText": " timely manner.  An off-site consequence analysis has been completed for a worst-case release scenario and an alternative release scenario to document the distance to toxic endpoints for each scenario, as well as the potential population, public, and environmental receptors that fall within the radius of impact for each scenario.\n\n\n\nMECHANICAL INTEGRITY PROGRAM\n\n\n\nPreventative Maintenance (PM) is an active part of the Cold Storage Solutions daily operations.  Cold Storage Solutions executes documented maintenance inspections on process equipment to ensure safe and proper operation.  Process equipment included within the MI Program includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shut down systems, system controls, and compressors.  Maintenance procedures are carried out by qualified and certified refrigeration and maintenance personnel with a background in refrigeration maintenance practices.  Training is provided to personnel as needed every three years and during process changes.  PM is performed in accordance with OSHA-PSM, and in many cases, the process safety equipment PM Schedule prescribed by Cold Storage Solutions exceeds recommended equipment maintenance schedules.  An extensive PM Program schedule is carried out on a daily-weekly-monthly-quarterly-semi-annual-annual basis.  Ammonia Detection sensors are present at multiple locations within the facility and tested semi-annually.  Relief Valves are replaced on a 5 yr. change out schedule according to industry best practices.  Emergency Ventilation and Emergency Shut Down Controls are also tested on a monthly schedule.  Any equipment deficiencies identified during maintenance inspections are corrected in a safe and timely manner.\n\n\n\nPROCESS SAFETY INFORMATION\n\n\n\nCold Storage Solutions maintains a detailed record of written process safety information that describes chemical hazards, operating parameters, and equipment designs associated with all of the equipment and "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000081146,
      "SummaryText": "processes.\n\n\n\nMANAGEMENT OF CHANGE\n\n\n\nWritten procedures are in place at Cold Storage Solutions to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel, and associated employees whose job tasks are affected by a change in process are promptly notified of the change, and offered training to deal with the process change.  The Management of Change procedure includes involvement by management, engineering, safety, and affiliated contractors that will confirm the safe and orderly implementation of any change.  \n\n\n\nPRE-STARTUP SAFETY REVIEWS\n\n\n\nPre-startup safety reviews related to new process and to modifications in the established processes are conducted as a regular practice at Cold Storage Solutions. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCOMPLIANCE AUDITS\n\n\n\nCold Storage Solutions conducts audits on a regular basis, and a PSM/RMP audit on a three year cycle.  Audits are conducted to determine whether the provisions set out under the RMP Rule are being implemented.  Any required corrective actions are undertaken and completed promptly and safely.  All reports are maintained as part of the PSM/RMP Programs for the life of the system.\n\n\n\nEMPLOYEE PARTICIPATION\n\n\n\nCold Storage Solutions believes that process safety management and accident prevention is a team effort.  Cold Storage Solution employees are encouraged to share their views concerning accident prevention issues and recommended improvements during monthly PSM Team meetings.  In addition, CSS employees have access to all process information collected as part of the facility's compliance with the RMP Rule including information resulting from the completion of Process Hazard Analysis Studies.\n\n\n\nCONTRACTORS\n\n\n\nCold Storage Solutions has a contractor qualification program in places as an element of the RMP and"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000081146,
      "SummaryText": " PSM programs.  CSS has third-party refrigeration contractors assist with the maintenance of the refrigeration equipment as needed.  Cold Storage Solutions also hires contractors to conduct specialized maintenance and construction activities as required.  Prior to selecting a contractor, a thorough evaluation of the safety performance of the contractor is undertaken.  Cold Storage Solutions has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are informed of all applicable procedures for emergency response to an accidental release of a regulated substance.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nCold Storage Solutions has an excellent history of preventing accidental releases since the construction of the facility.  Due to our release prevention policies that has been no accident history during this period.  \n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nCold Storage Solutions has developed a comprehensive emergency response policy that was developed and meets established criteria.  The plan has been provided to the Local LEPC and Lakeville Fire Department.  Included within this program are coordinated annual emergency response drills with the Lakeville Fire Department, as well as internal evacuation and notification employee drills.  Employee training is focused on topics such as:  Ammonia Properties and Emergency Response, Respiratory Protection, Process Safety Management, Hot Works Program, Ammonia Detection Devices, Atmospheric Monitoring, CPR/First Aid, and Emergency Action Plan Implementation.  A process release would be detected by ammonia sensors located throughout the facility, and alarm signal is activated triggering horns and blue strobes (at 25 ppm) if ammonia is detected.   An alarm system and control panel also notify central station monitoring, as well as notifying select CSS personnel.  Cold Storage Solutions personnel would notify the Lakeville Fire Department if any of the follow"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000081146,
      "SummaryText": "ing conditions exist:\n\n\n\n*Upon investigation of the incident Cold Storage Solutions personnel determine the release is severe enough to require response assistance by the Lakeville Fire Department.\n\n*Reportable quantities of anhydrous ammonia are released.\n\n*A potential fire exists.\n\n*An over pressurization condition exists.\n\n\n\nThe Lakeville Fire Department and Local Emergency Planning Committee can provide assistance in the event of an emergency, and will be notified of a reportable release from the process.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nCurrent changes to improve safety include increased employee training, and regularly scheduled evacuation exercises.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}