{
  "FacilityID": 1000080296,
  "FacilityName": "Bayer HealthCare LLC - Berkeley Site",
  "FacilityStr1": "800 Dwight Way",
  "FacilityStr2": null,
  "FacilityCity": "Berkeley",
  "FacilityState": "CA",
  "FacilityZipCode": "94710",
  "Facility4DigitZipExt": "1986",
  "FacilityCountyFIPS": "06001",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "37.858361",
  "FacilityLongDecDegs": "-122.295611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bayer.com",
  "FacilityEmailAddress": "BRKLHSES@bayer.com",
  "FacilityDUNS": 5068705,
  "ParentCompanyName": "Bayer AG",
  "Company2Name": null,
  "CompanyDUNS": 5068705,
  "Company2DUNS": null,
  "OperatorName": "Bayer HealthCare LLC",
  "OperatorStr1": "800 Dwight Way",
  "OperatorStr2": null,
  "OperatorCity": "Berkeley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94710",
  "OperatorZipCodeExt": "1986",
  "FTE": 1065,
  "OtherEPAFacilityID": "94710CTTRB4THAN",
  "EPAFacilityID": "100000139389",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-05-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-02-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.858361,
  "FRS_Long": -122.295611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100237,
      "AltID": "NH3 refrigeration process",
      "FacilityID": 1000080296,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125564,
          "ProcessID": 1000100237,
          "ChemicalID": 56,
          "Quantity": 18695.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101484,
          "ProcessID": 1000100237,
          "NAICSCode": "325414",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084651,
              "Process_NAICS_ID": 1000101484,
              "SafetyReviewDate": "2018-02-26 00:00:00",
              "PHA_Date": "2022-10-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-10-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-12-06 00:00:00",
              "TrainingReviewDate": "2021-05-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-01-07 00:00:00",
              "EquipmentInspectionDate": "2021-02-08 00:00:00",
              "EquipmentTested": "Annual PM on Ammonia Condenser 0996E04",
              "ChangeMgmtDate": "2021-05-17 00:00:00",
              "ChangeMgmtReviewDate": "2021-12-03 00:00:00",
              "PreStartupReviewDate": "2021-07-29 00:00:00",
              "ComplianceAuditDate": "2021-04-30 00:00:00",
              "AuditCompletionDate": "2022-06-30 00:00:00",
              "IncidentInvestigationDate": "2020-11-28 00:00:00",
              "InvestigationChangeDate": "2020-12-13 00:00:00",
              "ParticipationPlansReviewDate": "2019-10-22 00:00:00",
              "HotWorkPermitReviewDate": "2019-09-27 00:00:00",
              "ContractorSafetyReviewDate": "2021-10-28 00:00:00",
              "ContractorSafetyEvalDate": "2021-10-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000105492,
                  "PreventionProgram3ID": 1000084651,
                  "ProcessChemicalID": 1000125564
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080296,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-09-28 00:00:00",
    "ERTrainingDate": "2022-04-26 00:00:00",
    "CoordinatingAgencyName": "Berkeley Fire Department",
    "CoordinatingAgencyPhone": "5109813473",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080296,
      "SummaryText": "ergency response.\r\n\r\nCity of Berkeley is the Certified Unified Program Agency (CUPA) with which our emergency plan has been coordinated and verified.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nSince the last RMP submission in 2019, Bayer has continued to strive to keep all elements of our accidental release prevention program up to date. Additionally, Bayer continues to routinely review and update its procedures pertaining to emergency response, including the conducting of refresher training, exercises, and response drills with facility operations personnel, the Site Emergency Response Team, and the Berkeley Fire Department. \r\n\r\nThe facility has also made several safety improvements to the refrigeration system.  In March 2017, a new air compressor with a refrigerated air dryer was installed to supply air flow into the ammonia relief vent line to reduce stagnant air and moisture collection that can impact the vent line ammonia sensor.  In November 2017, five sensors were installed on the roof Building B62 and two sensors were installed in the B62 control room.  An HMI panel was also installed at the entrance of B62 at the control room door to allow monitoring of ammonia sensors prior to entering the control room. \r\n\r\nThe most recent Process Hazards Analysis, which included a Hazard and Operability (HAZOP) and a facility inspection, provided mitigation measures to improve safety at the facility.  These include developing new procedures and updating existing procedures, addition of high pressure switches for the pump, and verifying safety setpoints associated with the ammonia equipment.  Most of the recommendations have been completed, and Bayer is moving forward with addressing the remaining outstanding action items."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080296,
      "SummaryText": "articular information resulting from process hazard analyses.\r\n\r\nContractors\r\nOn occasion, our company hires contractors to conduct specialized preventive maintenance and/or construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Bayer Corporation has a strict policy of informing the contractors of known potential hazards related the contractor's work and the ammonia refrigeration process. Contractors are also trained in all the appropriate procedures related to emergency response should an accidental release of a regulated substance occur.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nAccording to the RMP regulation, the five year accident history covers only certain releases:\r\n\r\n1) The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.  \r\n2) The release must have caused at least one of the following:\r\nOn-site deaths, injuries, or significant property damage; or\r\nKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\r\n\r\nOur facility has had no releases of anhydrous ammonia from the refrigeration system in the last five years that meet the above criteria.  In addition, there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds.\r\n\r\nEMERGENCY RESPONSE PLAN\r\n\r\nBayer carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified em"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080296,
      "SummaryText": "rmore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\nWritten procedures are in place at Bayer to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel and any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of the changes and offered training to understand and deal with the modification.\r\n\r\nPre-Startup Safety Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a requirement at Bayer. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures and operator training are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nBayer conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and timely manner.\r\n\r\nIncident Investigation\r\nBayer promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation\r\nBayer truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation to the RMP Rule, in p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080296,
      "SummaryText": "d with the anhydrous ammonia refrigeration process are identified and controlled. The methodology used to carry out these analyses is a Hazard and Operability Study (HAZOP). The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are regularly revalidated every five years. Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered process, Bayer maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The procedures regularly reviewed and certified at least annually and are readily accessible to operators involved with the process.\r\n\r\nTraining\r\nBayer has a comprehensive training program in place to ensure that employees that are operating the covered process are completely competent in the operating procedures associated with this process.\r\n\r\nNew employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently. Refresher training is provided at least every year and more frequently as needed. Additionally, all site employees receive Ammonia General Awareness Training, which covers Basic Properties of Ammonia; Building Alarms, Evacuation Procedures, & Community Siren; and Basic First Aid for Exposure.\r\n\r\nMechanical Integrity\t\r\nBayer carries out highly documented maintenance checks on process equipment to ensure proper functionality. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthe"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080296,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION PROGRAM AND EMERGENCY RESPONSE POLICIES\r\n\r\nWe at Bayer are strongly committed to employee, public and environmental safety. This commitment is the basis of having a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur, we are prepared to work closely with the Berkeley Fire Department which provides highly trained emergency response personnel to control and mitigate the effects of the release.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\r\n\r\nOur facility's primary activities encompass biotechnological pharmaceutical manufacturing and research. We have one regulated substance present at our facility, anhydrous ammonia, which is used for process equipment refrigeration. The total quantity of ammonia in the system is approximately 18,695 pounds.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA. The anhydrous ammonia refrigeration process at our facility is also subject to the California OSHA PSM Standard and the California Accidental Release Prevention (CalARP) Program regulation.\r\n\r\nThe following sections briefly describe the elements of our release prevention program currently in place at our stationary source.\r\n\r\nProcess Safety Information\r\nBayer maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with the anhydrous ammonia refrigeration process.\r\n\r\nProcess Hazard Analysis\r\nOur facility conducts comprehensive studies to ensure that potential hazards associate"
    }
  ]
}