{
  "FacilityID": 1000085007,
  "FacilityName": "Republic Plastics, Ltd.",
  "FacilityStr1": "355 Schumann Road",
  "FacilityStr2": null,
  "FacilityCity": "McQueeney",
  "FacilityState": "TX",
  "FacilityZipCode": "78123",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48187",
  "LEPC": "Guadalupe County LEPC",
  "FacilityLatDecDegs": "29.586940",
  "FacilityLongDecDegs": "-098.043890",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": "141 N. Martinwood Rd, Suite 104",
  "FacilityEmailAddress": "bviars@ksvgroup.com",
  "FacilityDUNS": 60990624,
  "ParentCompanyName": "Republic Plastics, Ltd.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Republic Plastics, LTD",
  "OperatorStr1": "355 Schumann Road",
  "OperatorStr2": null,
  "OperatorCity": "McQueeney",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78123",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jose Colon",
  "RMPTitle": "Operations Manager",
  "FTE": 194,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000225954",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-02680",
  "SafetyInspectionDate": "2019-07-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-04-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-04-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-04-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000106196,
      "AltID": "Isobutane Storage",
      "FacilityID": 1000085007,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000107469,
          "ProcessID": 1000106196,
          "NAICSCode": "32614",
          "_desc": {
            "NAICS_CODE": "32614",
            "NAICS_DESCRIPTION": "Polystyrene Foam Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132961,
          "ProcessID": 1000106196,
          "ChemicalID": 107,
          "Quantity": 85000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632961,
          "ProcessID": 1000106196,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000085007,
      "SummaryText": "Republic Plastics owns and operates a polystyrene foam products manufacturing facility located in McQueeney, Guadalupe County, Texas.  The facility is designed to manufacture polystyrene products which involve the use and storage of Isobutane and polystyrene pellets, the pressurization of Isobutane gas in a high pressure building, extrusion, roll storage and aging, thermoforming and stamping, and fluff reclamation. The equipment associated with the production of foam products consists of extruders, thermoformers, pellet feed silos, fluff surge hoppers, and associated storage and packaging areas. In accordance with the Environmental Protection Agency (EPA) Risk Management Plan (RMP) definition for a process, the facility is defined as the Isobutane tank located outside, the associated piping, pumps leading up to the high pressure building, and distribution of the Isobutane to the extruders.\n\n\n\nSection 112 of the Clean Air Act applies to the Republic Plastics facility in Mcqueeney because the facility handles and stores Isobutane, a RMP-regulated flammable gas, in excess of the threshold quantities. Two (2) requirements of this section specifically apply to operations at the plant: \n\n\n\n1. Purpose and General Duty Clause - The essence of the general duty clause is that an owner/operator that stores and uses hazardous chemicals in any quantity has a fundamental obligation to ensure a safe operation and to have plans in place in the event of an accident to appropriately manage the situation. Republic Plastics is committed to ensuring the safe operation of its Isobutane facility, as well as all of its other operations, to ensure a safe workplace for our employees and a safe location for our neighbors in the community. Republic Plastics, therefore, has procedures in place to prevent accidents and is committed to emergency preparedness both for the facility and community-wide by coordinating with the local Fire Department.\n\n\n\n2. Risk Management Plan - The Republic Plastics "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000085007,
      "SummaryText": "facility handles and stores Isobutane in excess of the threshold specified in Section 112.  Republic Plastics management is aware of the potential hazards posed by the handling and storage of a flammable gas.  Programs have been established to prevent accidental releases and to train personnel for emergency evacuation procedures in the event of a release.  These programs are documented and described in this Risk Management Plan.\n\n\n\nRepublic Plastics has implemented safety precautions and procedures designed to prevent and mitigate catastrophic releases.  Operating and maintenance procedures, training, mechanical integrity including inspection and testing of equipment are performed routinely and are part of our quality assurance program.  In addition, Republic Plastics has coordinated with the local fire department to assist in the coordination of emergency preparedness and response.\n\n\n\nRepublic Plastics management is committed to:\n\n?    Preventing accidents\n\n?    Training employees in correct procedures in the event of an accident\n\n?    Participating in community emergency preparedness\n\n?    Addressing potential citizen concerns by communicating the hazards associated with our operations and steps that are taken to prevent and mitigate accidents\n\n?    Being a good corporate citizen of Mcqueeney, TX.\n\n\n\nWith these objectives in mind, this Risk Management Plan has been developed to provide information about our management of the risks associated with the Isobutane process.  Most importantly, Republic Plastics stresses its commitment to ensuring the safe operation for its employees, its visitors, and its community.  In addition to the above Clean Air Act and the Emergency Planning and Community Right to Know Act (EPCRA) requirements, Republic Plastics has developed a management system in accordance with the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) requirements.  Republic Plastics has conducted a process hazard analysis (PHA) of its Isobut"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000085007,
      "SummaryText": "ane process and is currently implementing recommendations made to further improve the safe operation of this process. \n\n"
    }
  ]
}