{
  "FacilityID": 1000090691,
  "FacilityName": "Monument Chemical Port Arthur",
  "FacilityStr1": "2450 South Gulfway Drive",
  "FacilityStr2": null,
  "FacilityCity": "Port Arthur",
  "FacilityState": "TX",
  "FacilityZipCode": "77641",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "29.828587",
  "FacilityLongDecDegs": "-093.963257",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.monumentchemical.com",
  "FacilityEmailAddress": "wmcconnell@monumentchemical.com",
  "FacilityDUNS": 146252775,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Monument Chemical Port Arthur",
  "OperatorStr1": "P.O. Box 1421",
  "OperatorStr2": null,
  "OperatorCity": "Port Arthur",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77640",
  "OperatorZipCodeExt": null,
  "RMPContact": "William J McConnell",
  "RMPTitle": "Vice President / Site Manager",
  "FTE": 58,
  "OtherEPAFacilityID": "TXD 988076295",
  "EPAFacilityID": "100000180065",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-10-23 00:00:00",
  "SafetyInspectionBy": "TX GLO",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Vinyl Acetate & Allyl Alcohol",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-11-02 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-11-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-11-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 29.9217,
  "FRS_Long": -95.0533,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112758,
      "AltID": "Vinyl Acetate Distill",
      "FacilityID": 1000090691,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000114091,
          "ProcessID": 1000112758,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140900,
          "ProcessID": 1000112758,
          "ChemicalID": 29,
          "Quantity": 3600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000640900,
          "ProcessID": 1000112758,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090691,
      "SummaryText": "\n\nKMTEX, LLC RISK MANAGEMENT PLAN (RMP)\n\nEXECUTIVE SUMMARY \n\nKMTEX is committed to operating in a manner that is safe for KMTEX employees, the public and the environment. KMTEX has established a system to help ensure safe operation of the processes at this facility. KMTEX operates in the custom toll processing of petrochemicals and specialty chemicals. We have no higher priority than safe and compliant operations. \n\n1.1    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \n\nKMTEX has multiple release prevention programs and policies integrated into all phases of operation from design through maintenance.  This includes our EPA RMP Program, OSHA PSM Program, as well as our Emergency Response Plans. \n\n1.2    KMTEX AND REGULATED SUBSTANCES\n\nKMTEX handles Vinyl Acetate in a distillation process to remove impurities. It is our covered process and is a Program Level 3 process.\n\n1.3    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS \n\nThe KMTEX facility is an OSHA process safety management (PSM) regulated facility. The elements of the KMTEX facility PSM program / OSHA PSM standard have been in place since 1991, which are very similar to the prevention program requirements of the EPA's RMP standard. The accidental release prevention program required for Program 3 processes include policies, procedures and practices in the following areas: \n\n?    Employee Participation \n\n?    Process Safety Information \n\n?    Process Hazard Analysis \n\n?    Operating Procedures KMTEX maintains written operating procedures in the form of runbooks at the facility that address various modes of process operations such as: (1) unit start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, and (5) normal shutdown. The operating procedures are reviewed by operators and technical staff before every process begins. \n\n?    Training. \n\n?    Contractors Safety Programs KMTEX utilizes contractors during increased maintenance or construction activities. Becaus"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090691,
      "SummaryText": "e some contractors work on or near process equipment, KMTEX has mandated that all contractors attend and complete applicable training at the International Safety Training Council (ISTC) location to ensure that they: (1) perform their work in a safe manner, (2) have appropriate knowledge and skills, (3) are aware of the hazards at KMTEX, (4) understand what they should do in the event of an emergency, (5) understand and follow site-specific safety rules and, (6) inform KMTEX personnel of any hazards that they find while performing their work. \n\n?    Pre-Startup Safety Review \n\n?    Mechanical Integrity \n\n?    Safe Work Practices KMTEX has safe work practices in place to help ensure worker and safety. Examples of these include: (1) control of the entry/presence/exit of support personnel, (2) a lockout/tag-out procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work) and, (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures, along with training of affected personnel, form a system to ensure that operations and maintenance activities are performed safely at the facility. \n\n?    Management of Change \n\n?    Incident Investigation \n\n?    Compliance Audits \n\nCHEMICAL-SPECIFIC PREVENTION STEPS Hazards in the KMTEX processes are continually managed to ensure safe operations. The existing safety features to prevent accidental releases of regulated substances in the facility are described below. In addition to the accident prevention program activities, KMTEX has safety features on many units to help, (1) contain/control a release, (2) quickly detect a release and, (3) reduce the consequences or mitigate a release. \n\n1.4 FIVE-YEAR ACCIDENT HISTORY The KMTEX facility in Port Arthur has an excellent record of acc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090691,
      "SummaryText": "ident prevention. There have been no RMP incidents at the KMTEX facility in the past five years. All incidents are investigated as per the severity and causes are identified and corrected. The events that do not meet the EPA definition of an RMP incident, are investigated based upon severity level and American Chemistry Council (ACC) guidelines. \n\n1.5 EMERGENCY RESPONSE PROGRAM KMTEX coordinates emergency response with the City of Port Arthur Fire Department. KMTEX personnel will respond to minor events that do not have the potential for significant effect, (I.E. small fires or small leaks). In the event of a larger fire or release, personnel and contractors evacuate the area and contact the local fire department. This coordination includes periodic meetings of the Jefferson County Local Emergency Planning Committee (LEPC) and the Sabine Neches Chiefs Association (SNCA), which includes local emergency response officials, local government officials, and industry representatives. In addition to periodic LEPC meetings, KMTEX conducts emergency drills that involve the United States Coast Guard & Texas GLO. \n\n1.6 PLANNED CHANGES TO IMPROVE SAFETY KMTEX strives to improve the safety of KMTEX processes through periodic safety reviews and the incident investigation program. KMTEX is continuously investigating and reviewing technology and/or applications that could possibly enhance its safety efforts. \n\n"
    }
  ]
}