{
  "FacilityID": 1000101918,
  "FacilityName": "City of Fortuna Water Wells Site",
  "FacilityStr1": "1501 Eel River Drive",
  "FacilityStr2": null,
  "FacilityCity": "Fortuna",
  "FacilityState": "CA",
  "FacilityZipCode": "95540",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06023",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "40.570806",
  "FacilityLongDecDegs": "-124.147500",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.friendlyfortuna.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Fortuna",
  "OperatorStr1": "621 11th Street",
  "OperatorStr2": "P.O. Box 545",
  "OperatorCity": "Fortuna",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95540",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000249055",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-05-20 00:00:00",
  "SafetyInspectionBy": "Humboldt County DHHS Public Health DEH",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-08-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-08-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-08-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000126501,
      "AltID": "Disinfection",
      "FacilityID": 1000101918,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000158241,
          "ProcessID": 1000126501,
          "ChemicalID": 62,
          "Quantity": 900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000127874,
          "ProcessID": 1000126501,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101918,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-06-17 00:00:00",
    "ERTrainingDate": "2020-06-17 00:00:00",
    "CoordinatingAgencyName": "Humboldt County DHHS Public Health",
    "CoordinatingAgencyPhone": "7072682226",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Cal/ OSHA GISO 3220, 5189"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101918,
      "SummaryText": "cidental release prevention program for the City's operations at this facility. The program and document management procedures included in the PSM Program are used as the management system for the Risk Management Program as well.\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\nRelease prevention steps specific to chlorine have been identified and implemented. These include installation of chlorine leak detectors, and creating facility-specific written operating procedures.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences.\n\nEMERGENCY RESPONSE PRoGRAM\n\nThe City of Fortuna's Emergency Response Program plan applicable to chlorine releases consists of site evacuation and notification of the Humboldt County Hazardous Materials Response Unit by calling 911 in coordination with Humboldt County Division of Environmental Health, the agency responsible for hazardous materials inventory reporting and release response coordination.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAll of the improvements and mitigation measures identified in the Hazard Review, which the City of Fortuna committed to accomplish have been completed or are in progress. Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101918,
      "SummaryText": "handled with a steel rack by a forklift, and stored in the chemical storage room, either double-chained to the wall, or double-chained on a dual-cylinder scale. Two chlorine 150-lb. cylinders are connected to the system with one as a standby. The chlorine is used for disinfection of raw groundwater prior to distribution. Pressurized chloine within a container is reduced to vacuum by tank-mounted vacuum regulator valves, metered through gas rotameters and drawn into the water by the passage of pressurized water through an injector.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of the City of Fortuna that the receipt, storage and handling of chlorine at its facilities be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment. In order to accomplish this goal, the City of Fortuna has gathered safety information on chlorine and on the process, equipment and procedures involving chlorine; performed a structured assessment of hazards of the process and external events which might effect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and has established a written emergency response program coordinated with emergency response agencies.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\nGeneral accidental release prevention programs instituted by the City of Fortuna are categorized as administrative (management) programs; procedures, training, and engineering controls; and emergency response programs.\n\nThe City of Fortuna has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 and CalOSHA GISO Section 5189 covering the disinfection process at the Water Wells Site. This constitutes the general ac"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101918,
      "SummaryText": "The City of Fortuna has instituted a Risk Management Program for the Water Wells Site, as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68 and CalARP regulations. The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of California and Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation or mitigation measures and auditing of program elements.\n\nA Risk Management Plan was filed as required by ARP and CalARP regulations in 1999 for chlorine.  Due to staff turnover and unknown other causes, the original EPA Facility Identifier for this existing facility was lost. This is a re-draft update of that original RMP, and is being filed in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe City of Fortuna operates and maintains a water wells site, located at 1501 Eel River Drive in the City of Fortuna, CA, Humboldt County, and uses chlorine, classified as RS, for disinfection in quantities greater than the Federal threshold quantity for this RS. The site houses six 150-lb. cylinders for a total of 900 lbs. This site is checked daily, but not fully staffed for any regular, consistent time. A telephone auto-dialer system alerts operators to alarm conditions when the facility is not manned.\n\nChlorine is received in 150 lb. cylinders by truck,"
    }
  ]
}