{
  "FacilityID": 1000000499,
  "FacilityName": "Council Bluffs Water Works",
  "FacilityStr1": "2000 North 25th Street",
  "FacilityStr2": null,
  "FacilityCity": "Council Bluffs",
  "FacilityState": "IA",
  "FacilityZipCode": "51502",
  "Facility4DigitZipExt": "0156",
  "FacilityCountyFIPS": "19155",
  "LEPC": "Pottawattamie County LEPC",
  "FacilityLatDecDegs": "41.278361",
  "FacilityLongDecDegs": "-095.882556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.cbwaterworks.com",
  "FacilityEmailAddress": "briegel@cbwaterworks.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "NA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Council Bluffs",
  "OperatorStr1": "P. O. Box 309",
  "OperatorStr2": "2000 North 25th Street",
  "OperatorCity": "Council Bluffs",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51502",
  "OperatorZipCodeExt": "0156",
  "RMPContact": "John Elliott",
  "RMPTitle": "Purification Manager",
  "FTE": 52,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000018232",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-12-30 00:00:00",
  "SafetyInspectionBy": "DNR Sanitary Group",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.28769,
  "FRS_Long": -95.87175,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000626,
      "AltID": "Chlorine",
      "FacilityID": 1000000499,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000000651,
          "ProcessID": 1000000626,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000651,
          "ProcessID": 1000000626,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000500651,
          "ProcessID": 1000000626,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000499,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policy\n\nChlorine is commonly used in water treatment operations such as CBWW's facility in Council Bluffs.  CBWW recognizes that with chlorine use there are necessary safety precautions in order to protect the safety of their employees and of the nearby community.  It is CBWW's policy to design and operate a safe facility.  This is accomplished through the experience and training of our personnel.\nOur emergency plan includes procedures for notification of local authorities and potentially affected neighbors.  Employees are trained to handle minor leaks. \n\nSource and Regulated Substances\n\nThe plant provides water for the city of Council Bluffs and surrounding areas.  The main water supply is the Missouri River.  In addition, the plant has two groundwater wells.  \nThe intake water is treated in preliminary settling basins to remove sand and heavy silt.  Chemicals are added at the rapid mixers and allowed time to react and form floc (aggregate particles) in the flocculation basins.  Additional solids are removed at the clarification basins and then the water is filtered.  Chlorine is added after filtration.  The treated water is stored prior to distribution.\nCouncil Bluffs Water Works (CBWW) uses chlorine, chlorine dioxide, and ammonia for disinfection in the water treatment process.  Chlorine is the primary disinfectant.  The current chlorine handling and storage facilities were constructed in 1997. \nThe chlorine system operates on valve mounted vacuum regulators.  The facility uses one-ton containers of chlorine which are delivered by truck transport.  A two-ton capacity hoist is used to transfer the containers between the storage area and the dock. The maximum intended inventory for chlorine is 16,000 pounds.  Typical inventory is 10,000 to 12,000 pounds of chlorine. \nChlorine is the only regulated chemical that is on site above the process safety management (PSM) and risk management (RM) program thresholds.  Thou"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000499,
      "SummaryText": "gh not above the PSM or RM thresholds, chlorine dioxide and ammonia are also addressed in the PSM and RM programs in regards to general duty requirements.\nAlternate disinfectants are chlorine dioxide and chloramines. Since chlorine dioxide is an unstable gas, it is generated on site by reacting chlorine and sodium chlorite solution.  The chlorine dioxide generator and associated equipment are located in a dedicated room installed during the 1997 construction project.\nChloramines are formed from the reaction of chlorine (hypochlorite ion acid) and ammonia.  Ammonia is applied using anhydrous ammoniia.  The anhydrous ammonia is applied as purchased.\n\n\nAdministrative Controls and Mitigation Measures\n\nThe chlorine building is divided into separate areas for storage, chlorination, and chlorine dioxide. The structure is complete with a ventilation system.  The storage and chlorination rooms are equipped with chlorine gas detectors.  Audible alarms alert operators if there is a chlorine gas leak.  A remote signal is sent to the control room SCADA system to help alert the operator of a chlorine leak. \nEach of these rooms has an external entrance which is locked to prevent unauthorized entry. There are no flammable or combustible materials stored in these areas.  \nCBWW has policies and procedures in place to decrease the likelihood a chlorine release event and to minimize the consequence if there is a release. Operators are trained in the proper usage and handling of chlorine.\n\nGeneral Release Prevention Program and Prevention Steps\n\nThe chlorine process complies with both the EPA prevention program level 3 requirements and the OSHA PSM requirements. The facility is operated according to manufacturer recommendations and Chlorine Institute recommendations.\n\nFive Year Accident History\n\nCBWW did not have any releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in pla"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000499,
      "SummaryText": "ce, property damage, or environmental damage.\n\nEmergency Response Program\n\nThe emergency action plan has been coordinated with Pottawattamie County Emergency Management Agency.\n\nPlanned Changes\n\nThe current chlorine process (a vacuum system) was installed in 1997.  This system replaced the old pressurized system.  CBWW continues to improve their process safety management program."
    }
  ]
}