{
  "FacilityID": 1000005294,
  "FacilityName": "Campos Foods LLC",
  "FacilityStr1": "241 Elkins Road",
  "FacilityStr2": null,
  "FacilityCity": "Caryville",
  "FacilityState": "TN",
  "FacilityZipCode": "37714",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47013",
  "LEPC": "Campbell County LEPC",
  "FacilityLatDecDegs": "36.315639",
  "FacilityLongDecDegs": "-084.209333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 94768702,
  "ParentCompanyName": "Lopez Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": 94768702,
  "Company2DUNS": null,
  "OperatorName": "David Walker",
  "OperatorStr1": "241 Elkins Road",
  "OperatorStr2": "PO Box 55",
  "OperatorCity": "Caryville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37714",
  "OperatorZipCodeExt": null,
  "FTE": 260,
  "OtherEPAFacilityID": "TND098070311",
  "EPAFacilityID": "100000136131",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-12-09 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-10-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.31714,
  "FRS_Long": -84.207,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000006341,
      "AltID": "Ammonia (anhydrous)",
      "FacilityID": 1000005294,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000007105,
          "ProcessID": 1000006341,
          "ChemicalID": 56,
          "Quantity": 27500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000045409,
          "ProcessID": 1000006341,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000039178,
              "Process_NAICS_ID": 1000045409,
              "SafetyReviewDate": "2012-06-02 00:00:00",
              "PHA_Date": "2013-10-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-12-11 00:00:00",
              "TrainingReviewDate": "2012-06-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-06-02 00:00:00",
              "EquipmentInspectionDate": "2013-09-13 00:00:00",
              "EquipmentTested": "Condensers",
              "ChangeMgmtDate": "2012-02-01 00:00:00",
              "ChangeMgmtReviewDate": "2012-06-02 00:00:00",
              "PreStartupReviewDate": "2013-08-19 00:00:00",
              "ComplianceAuditDate": "2012-06-02 00:00:00",
              "AuditCompletionDate": "2012-06-02 00:00:00",
              "IncidentInvestigationDate": "2013-08-15 00:00:00",
              "InvestigationChangeDate": "2013-08-17 00:00:00",
              "ParticipationPlansReviewDate": "2012-06-02 00:00:00",
              "HotWorkPermitReviewDate": "2012-06-02 00:00:00",
              "ContractorSafetyReviewDate": "2012-06-02 00:00:00",
              "ContractorSafetyEvalDate": "2012-06-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000046546,
                  "PreventionProgram3ID": 1000039178,
                  "ProcessChemicalID": 1000007105
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000005294,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-01-16 00:00:00",
    "ERTrainingDate": "2013-04-23 00:00:00",
    "CoordinatingAgencyName": "Campbell County EMA",
    "CoordinatingAgencyPhone": "4235626151",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000005294,
      "SummaryText": "Campos Foods utilizes anhydrous ammonia for its product refrigeration processes. The process technology of ammonia refrigeration systems has been in existence for many years and is therefore standardized and not subject to signficant change. Changes in design for the system involved only additions to or modifications of the existing system and its components. The technical design basis for ammonia refrigeration would only be modified by the IIAR, ANSI, ASHRAE, or similar organization. Therefore, Campos Foods does not directly control management of process technology.\r\n\r\nAmmonia is self-alarming by its distinctive pungent odor. Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations (these concentrations would not result in any significant health risk). Most mechanical rooms with ammonia storage/process equipment, even well ventilated, may have concentrations oaround 5 PPM.\r\n\r\nAmmonia is classified as a Group 2 Refrigerant per ASHRAE Standard 34-1992. The dominant characteristic of a Group 2 Refrigerant is its toxicity. Ammonia is self alarming by its distinctive pungent odor. Due to this odor, personnel exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations. Ammonia is readily absorbed into the moisture of the skin and, in heavy concentrations, can cause severe burns.\r\n\r\nThe department of Transportation classifies ammonia as non-flammable. However, ammonia is flammable within concentrations of 18-25% volume in air. Oil carried by the ammonia vapors in the process systems lowers this level considerably, and generally 4% by volume in air is considered the safe limit to prevent explosion.\r\n\r\nIn recognition of the potential adverse effects of ammonia release both from an employee and public safety perspective, Campos Foods has instituted Process Safety Management Program and Risk Management Program, in addition to the existing safety programs. The plans include all phases of pla"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000005294,
      "SummaryText": "nt operation including design, construction, operation, maintenance, and decommissioning. \r\n\r\nThe facilities ammonia refrigeration systems are designed in accordance with the American National Standard for Equipment Design and Installation of Ammonia Mechanical Refrigeration Systems ANSI/IIAR-2-1992; The Electrical Safety Code for Mechanical Refrigeration ANSI/ASHRAE Standard 15; the IIAR Minimum Safety Criteria for a Safe Ammonia Refrigeration System, IIAR Bullitan No. 109; the American National Standards Institute, \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia\", ANSI K 61.1-1989; the American Society of Heating, Refrigerating, and Air Conditioning Engineers, Inc., \"Safety Code for Mechanical Refrigeration\", ANSI/ASHRAE 15-1992, and the National Electric Code.\r\n\r\nAll employees involved with highly hazardous chemicals and processes, including refrigeration mechanics, maintenance personnel and contractor employees, require training to fully understand the safety and health hazards of the chemicals and processes they work with. Training under the HAZCOM Standard (1910.1200) is used to familiarize affected employees with the chemicals and how to read MSDS, however it is supplemented with training in such subjects as:\r\n                                                        HAZMAT Emergency Response\r\n                                                        Standard Operating Procedures\r\n                                                        Reading and using P&ID's in daily routine tasks and emergency conditions\r\n                                                        Safe Work Practices\r\n                                                        Emergency evacuation and response\r\n                                                        Safety Procedures\r\n                                                        Work authorization activities\r\n                                                        Process Safety Management"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000005294,
      "SummaryText": "Risk Management Program\r\n\r\nAs with all safety training, documentation of employee's participation in the training are maintained on an individual basis.\r\n\r\nInitial training is conducted for each employee currently involved in operating a process and for each employee before they are first assignes to operate a process. Refresher training will be conducted at a minimum of three-year interval unless changes in operations or process methodology prompt more frequent training events.\r\n\r\nContractors performing work on the ammonia systems will be held to the same high standards as Campos Foods employees and in conformance with the PSM standard. Specifically, the company will assure the following:\r\n\r\nThe contract employer's safety record is reviewed and evaluated. The contractor employer is aware of the known hazards related to the contractor's assigned work and the processes. The contractor employer is aware of all applicable provisions of the sites emergency action plan. Procedures are in place to control the entry, presence, and exit of contract and applicable federal safety standards not limited to the following:\r\n\r\nContractor employee's are trained in the safe work practices applicable to the assigned work. Each contractor employee is instructed in known hazards and applicable provisions of the emergency action plan. Appropriate employee training and documentation is maintained. Contractor employee's adhere to the safe work practices. Campos Foods representatives are apprised of any unique hazards presented by the contracted work.\r\n\r\nThe ammonia refrigeration system is critical to the production process operations, and therefore to the company's livelihood. As a result, preventative and responsive maintance is a critical function. Those employee's charged with the maintance of these systems are knowledgeable and undergo continous training to assure proper equipment function, process efficiencies and as a result, the safety and security of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000005294,
      "SummaryText": "the systems.\r\n\r\nIn recognition of the physical hazards associated with the use of anhydrous ammonia, written Ammonia entry permit, Hot Work and Confined Space Entry programs and associated training are utilized to cover welding or cutting on piping or components of a covered process, and/or entry into a designated permit required space. These programs incorprate requirements for other non-routine work practices by individuals, including contractors, to include line break, lock-out-tag-out and temporary operational permits.\r\n\r\nIn order to properly manage process system changes, written procedures have been developed and implemented to coordinate these changes. This effort identifies and evaluates all changes as \"change in kind\" or majors, and produce documentation of the evaluation. The results of these evaluations may include procedure changes and require additional training before start-up can be authorized.\r\n\r\nShould the preventative actions addressed above be insufficient in preventing a system/component failure, the resulting incidents are treated as serious, regardless of the actual outcome. Campos Foods does not measure the level of severity by the outcome, but instead on the recognized potential consequences. In order to effectively address this concern, a response program has been implemented to include the following:\r\n\r\nAll incidents and near misses are investigated within 48 hours by a designated team. The root cause(s) and factors contributing to the incident are defined. Written corrective recommendations are provided to site management along with a plan to implement the recommendations of the incident investigation team. This report is shared with all affected employee's and the documentation is retained for 5 years.\r\n\r\nShould an event result in a loss of ammonia of significant volume, immediate evacuation of the affected areas is initiated in accordance with the sites Emergency Action Plan and Risk Management Program.  Depending on the circumstances, t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000005294,
      "SummaryText": "rained Campos Foods employees utilizing appropriate levels of protective equipment may affect the required corrective actions. Current air dispersion modeling demonstrate significant risk to the public, according to county records approximately 2000 people would be evacuated in a worse case scenerio, but appropriate notification and evacuation of potentially impacted areas will be initiated as appropriate to the situation. \r\n\r\nTo assure that the programs addressed above are effective in terms of prevention and response, periodic audits will be conducted by an external professional knowledgeable of the food industry, ammonia refrigeration processes and applicable codes and standards, including the OSHA Process Safety Managements requirements.\r\n\r\nCampos Foods has no reports of loss of ammonia on file for the last five(5) years."
    }
  ]
}