{
  "FacilityID": 1000014020,
  "FacilityName": "Clean Harbors LaPorte, LLC",
  "FacilityStr1": "500 Independence Parkway Souhth",
  "FacilityStr2": null,
  "FacilityCity": "La Porte",
  "FacilityState": "TX",
  "FacilityZipCode": "77571",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-",
  "FacilityLatDecDegs": "29.707337",
  "FacilityLongDecDegs": "-095.090879",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cleanharbors.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Clean Harbors Environmental Services, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 157793639,
  "Company2DUNS": null,
  "OperatorName": "Clean Harbors LaPorte, LLC",
  "OperatorStr1": "500 Independence Parkway South",
  "OperatorStr2": null,
  "OperatorCity": "La Porte",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77571",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": "TXD982290140",
  "EPAFacilityID": "100000192061",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-03-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-05-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-05-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-05-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-06-19 00:00:00",
  "DeRegistrationEffectiveDate": "2017-06-12 00:00:00",
  "AnniversaryDate": "2015-05-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.707288,
  "FRS_Long": -95.090618,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017568,
      "AltID": "Container Storage",
      "FacilityID": 1000014020,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020892,
          "ProcessID": 1000017568,
          "ChemicalID": 98,
          "Quantity": 45000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000020893,
          "ProcessID": 1000017568,
          "ChemicalID": 118,
          "Quantity": 45000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000017950,
          "ProcessID": 1000017568,
          "NAICSCode": "562112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000012211,
              "Process_NAICS_ID": 1000017950,
              "SafetyReviewDate": "2010-05-11 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "NFPA 30, State electrical code, Uniform building code",
              "FR_Comments": null,
              "HazardReviewDate": "2010-05-11 00:00:00",
              "ChangeCompletionDate": "2010-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-05-11 00:00:00",
              "TrainingReviewDate": "2010-05-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-05-11 00:00:00",
              "EquipmentInspectionDate": "2010-05-11 00:00:00",
              "EquipmentTested": "Fire Extinguishers",
              "ComplianceAuditDate": "2008-12-16 00:00:00",
              "AuditCompletionDate": "2008-12-16 00:00:00",
              "IncidentInvestigationDate": "2005-01-20 00:00:00",
              "InvestigationChangeDate": "2005-02-01 00:00:00",
              "MostRecentChangeDate": "2005-05-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000012497,
                  "PreventionProgram2ID": 1000012211,
                  "ProcessChemicalID": 1000020892
                },
                {
                  "PrimaryKey": 1000012498,
                  "PreventionProgram2ID": 1000012211,
                  "ProcessChemicalID": 1000020893
                }
              ]
            }
          ]
        },
        {
          "Process_NAICS_ID": 1000017951,
          "ProcessID": 1000017568,
          "NAICSCode": "48422",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000017952,
          "ProcessID": 1000017568,
          "NAICSCode": "48423",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014020,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-06-01 00:00:00",
    "ERTrainingDate": "2009-04-12 00:00:00",
    "CoordinatingAgencyName": "La Porte Fire Dept. and LEPC",
    "CoordinatingAgencyPhone": "2814713607",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014020,
      "SummaryText": "2.1 Corporate Statement\nClean Harbors La Porte (Facility) operates a hazardous waste treatment and storage facility (TSDF) in accordance with a Resource Conservation and Recovery Act (RCRA) hazardous waste license issued by the Texas Commission on Environmental Quality (TCEQ).  The Facility strives to conduct its business and operations in strict conformity with all applicable laws, and in a safe and responsible manner.  The Facility has always placed the highest priority on the health and safety of its employees and members of the community in which it operates.\nThe Facility is subject to the provisions of the Accidental Release Prevention requirements because regulated toxic and flammable liquids are present in quantities which, on occasion, exceed the regulatory thresholds for these substances. Accordingly, the Facility has prepared a Risk Management Plan.\nThe Facility 's accidental release prevention program involves a unified approach that integrates technologies, procedures and management practices.  The Facility is designed, constructed, inspected, maintained and operated in a manner so as to minimize the risk of exposure to employees and the public to hazardous materials managed at the site, and in conformity with all governmental regulations.\nThe Facility has a comprehensive Inspection Plan, which requires daily, weekly, monthly, and annual inspections of its processes, equipment and management practices.\nThe Facility maintains a Contingency Plan, which prescribes procedures to be followed in the event of a fire or release at the facility.  The Contingency Plan includes procedures for notifying local, state and federal emergency response officials of incidents, and specifies arrangements made with emergency responders to ensure an effective response in the event of an emergency.\nThe Facility has a training program which ensures that each employee receives the training necessary to enable him/her to safely and effectively carry out his/her job responsibiliti"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014020,
      "SummaryText": "es.  Included in the facility training plan are training modules which instruct employees on the hazards of the regulated substances stored at the site, the procedures for evacuation from the facility, procedures for responding to releases, and procedures for notification of incidents to both facility personnel and offsite emergency responders.  In addition to the initial training that all employees receive, each employee receives refresher training on an annual basis.\n2.2 Accident Release Prevention and Emergency Response Policies\nThe FacilityÂ¿s release prevention program and emergency response procedures have been developed in accordance with the EPA requirements for hazardous waste facilities described in the federal regulations 40 CFR 264 Subpart C and Subpart D. In addition, these requirements have been adopted by the State of Texas and incorporated by the TCEQ in a facility IHW permit #50225.\nRelease prevention policies include: design and operation of the facility; communication equipment; testing and maintenance of equipment; access to communication and alarm systems; aisle space requirements and arrangements with local authorities. \nEmergency response policies include: designation of emergency coordinators; detailed emergency action procedures including notification of local authorities; lists of emergency response equipment; emergency phone numbers; evacuation procedures and reporting requirements.\n2.3 Description of the Facility and Regulated Substances \nThe Facility is a commercial hazardous waste management facility engaged in the storing and bulking of hazardous waste regulated under RCRA.  Hazardous waste is stored in containers in enclosed warehouses. The facility has the potential to store propane (100%) and butane (100%), which are regulated RMP chemicals, in quantities greater than the threshold planning quantity of 10,000 pounds. Off-specification or out dated propane and butane are received from customers in compressed gas cylinders with a maxi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014020,
      "SummaryText": "mum size of 100 pounds per cylinder. These compressed gases are transported to and from the facility by truck. The material is stored in Warehouse III in Department of Transportation (DOT) approved containers for a time period that generally does not exceed 90 days. The compressed gases are shipped out of the facility to other waste management facilities for ultimate disposal or use as waste fuel. \nThe maximum quantity of propane and butane that can be stored at the facility is 45,000 pounds.\n2.4 General Accidental Release Prevention Program and Chemical-Specific Prevention \nThe EPA risk management regulations identify three levels of requirements.  Program Level 2 applies to the Facility, because this facility is not subject to the Occupational Safety and Health Administration (OSHA), Process Safety Management program and does not qualify for Program Level 1.  The facility has procedures in place to prevent and mitigate potential releases of toxic and flammable substances including propane and butane.  These procedures are detailed in the Facility's RCRA Part B hazardous waste permit.  The procedures include, but are not limited to, the following:\nÂ·\tAn inspection program, which requires daily, weekly, monthly and annual inspections of process equipment, alarm systems, and management practices, with a procedure for documenting and correcting any deficiencies identified in inspections;\nÂ·\tA standard operating procedure for the transfer of flammable and combustible liquids;\nÂ·\tA standard operating procedure for ensuring that incompatible materials are not consolidated together;\nÂ·\tA waste analysis plan which ensures that the waste received by the Facility conforms to the waste as initially represented by each generator, and that each waste stream is managed correctly;\nÂ·\tA security plan to prevent unknowing or unwanted access to the facility; and\nÂ·\tA training plan which ensures that employees at the facility are adequately trained to perform their job duties knowled"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014020,
      "SummaryText": "geably and safely.\nIn addition, the Facility has instituted a Program Level 2 prevention program consisting of the following elements:\nÂ·\tProcess Safety Information including Material Safety Data Sheet (MSDS) for regulated substances;\nÂ·\tProcess Hazard Analysis, including a systematic evaluation of potential hazards associated with handling regulated substances and development of recommendations for improving safety;\nÂ·\tOperating procedures regarding transfer, storage and processing of regulated substances;\nÂ·\tTraining of workers on operating procedures;\nÂ·\tMaintenance procedures to ensure mechanical integrity of equipment;\nÂ·\tCompliance audits of the prevention program to be conducted every three years; and\nÂ·\tIncident investigation to document releases and accidents of regulated substances.\n2.5 Five-year Accident History\nDuring the past five (5) years (May 2005 to April 2010), there has not been any accident involving any RMP regulated substance that qualifies for reporting under 40 CFR Part 68.  \n2.6 Emergency Response Program\nIt is the policy of the Facility to place the highest priority on employee safety and health and on protection of the community from all plant-induced environmental conditions.  An emergency response plan has been developed which prescribes emergency procedures, which the facility will implement in the event of a release or fire at the facility.\nThe Facility's Emergency Response Plan is identified as the facility Contingency Plan.  The purpose of this plan is to describe both the hazards associated with the management of waste materials at the facility and the steps that will be taken to minimize the risk associated with each hazard.  By ensuring that proper preventative measures are taken at all times and by providing for emergency response procedures to be followed in the event of any unexpected occurrence(s), the Facility intends to operate its facility in a manner that does not pose a significant threat to public health, safety or welfa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014020,
      "SummaryText": "re of the environment.  The Facility's record in this regard has been exceptional and its overall contribution to the protection of human health and the environment far surpasses the risks associated with the type of activities performed at the facility.\nThe specific elements of The Facility's Contingency Plan are discussed in Section 6.0 of this RMP.\n2.7 Planned Changes to Improve Safety\nThe facility has organized its management system to effectively address all hazards and potential risks. Thorough accident investigation and personnel training are necessary to support continual improvement in the facility safety program.  The Facility's accident investigation procedure and training plan are designed to incorporate new technology improvement in safety as well as lessons learned from accidents. This information is shared on a national level between Environmental Health and Safety (EH&S) professionals and company management to increase awareness and improve safety procedures.  \nCurrent information about the safe handling of all chemicals present at the facility is available to employees, and can be readily interpreted by emergency response team staff and the Facility Emergency Coordinators when questions arise from public safety officials regarding potential risks to the community.  All of these features of the RMP and the integrated risk management program at this site lead to operations that meet or exceed the state and federal regulatory requirements applicable to the facility's operations."
    }
  ]
}