{
  "FacilityID": 1000062808,
  "FacilityName": "GSAC-OKC Facility",
  "FacilityStr1": "5900 S. Hattie Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Oklahoma City",
  "FacilityState": "OK",
  "FacilityZipCode": "73129",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40109",
  "LEPC": "Oklahoma County LEPC",
  "FacilityLatDecDegs": "35.4078",
  "FacilityLongDecDegs": "-097.4859",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.spartannash.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6962294,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 6962294,
  "Company2DUNS": 0,
  "OperatorName": "MDV SpartanNash, LLC",
  "OperatorStr1": "7600 France Ave. South",
  "OperatorStr2": null,
  "OperatorCity": "Edina",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55435",
  "OperatorZipCodeExt": null,
  "RMPContact": "Todd Payne",
  "RMPTitle": "Distribution Director",
  "FTE": 175,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000065038",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "No inspections to-date",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-03-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-03-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-03-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-03-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.40694,
  "FRS_Long": -97.48972,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078739,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000062808,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000079921,
          "ProcessID": 1000078739,
          "NAICSCode": "42441",
          "_desc": {
            "NAICS_CODE": "42441",
            "NAICS_DESCRIPTION": "General Line Grocery Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098073,
          "ProcessID": 1000078739,
          "ChemicalID": 56,
          "Quantity": 12500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598073,
          "ProcessID": 1000078739,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062808,
      "SummaryText": "Executive Summary\n\n\n\nThe SpartanNash Oklahoma City Distribution Center is committed to the protection of its employees and the surrounding community by safely managing all hazardous materials found on the premises. Policies and procedures are in-place to assist the staff with compliance with applicable hazardous materials rules and regulations. The Process Safety Management (PSM) Team at the facility is responsible to ensure appropriate procedures and safety measures are in-place to protect our employees and the surrounding community. The PSM Team is comprised of the Distribution Center Director, Maintenance Manager and Refrigeration Technician with assistance from the Senior Director Facility Services Engineer, Corporate Environmental, Health & Safety Manager, MDV Safety Coordinator and from the outside refrigeration contractor.\n\n\n\n    The facility is located in a commercial area located off of Interstate 35 south of Oklahoma City, OK. The facility consists of a two warehouses located on each side of Hattie Avenue north of SE 59th Street. The dry side warehouse is located on the west side and the perishable/frozen warehouse is located on the east side of Hattie Street. The perishable/frozen facility contains the ammonia refrigeration system and is approximately 111,000 square feet in . The property is approximately 11 acres in .  The areas around the facility consist primarily of commercial businesses and some open space. The terrain is mostly flat prairie type terrain. The site is characterized by paved areas of asphalt and concrete as well as some grassy areas around the facility. \n\n\n\n    SpartanNash Oklahoma City receives and stores grocery product for eventual distribution to military commissaries in the Oklahoma City area, Oklahoma as well as other nearby states. Grocery products from this facility consist of frozen products as well as meat and other perishable items. The facility is connected to city water and sewer services.\n\n    \n\n    Hours of operation are up to 24 ho"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062808,
      "SummaryText": "urs per day, 6 days per week.  Personnel at the facility include a distribution center director plus administrative staff, warehouse staff and truck drivers. Headcount at full capacity is estimated to be approximately 125 associates (warehouse staff and drivers).\n\n\n\nThe refrigeration for this part of the facility is provided by an ammonia refrigeration system. The ammonia system contains approximately 12,500 pounds of anhydrous ammonia. In this system, ammonia is the heat transfer medium that is compressed, cooled through the use of evaporative condensers and distributed to cooling evaporators throughout the ammonia refrigerated parts of the facility to maintain appropriate temperatures for the products stored in each area.\n\n\n\nBecause of the use of hazardous materials on-site, the facility is regulated by federal and state hazardous material rules and regulations. The ammonia, lead and sulfuric acid (used in powered industrial truck batteries) are regulated under the Emergency Planning and Community Right-to-Know (EPCRA) regulations. The Risk Management Plan (RMP) is required under the Chemical Accident Prevention Provisions under the Clean Air Act (40 CFR Part 68). The facility has also registered with the Department of Homeland Security since its ammonia quantity exceeds the 10,000 pound threshold for registration (6 CFR Part 27).\n\n\n\nFrom an occupational safety and health perspective the facility is subject to the OSHA Process Safety Management (PSM) standard which covers the management and use of the anhydrous ammonia on-site and is required to have an emergency response plan. Other OSHA rules such as lockout tag out, fall protection, confined space; powered industrial trucks, etc. also apply to the facility. \n\n\n\nThe ammonia refrigeration system is the process presenting the most risk to our employees and the surrounding community. Safe guards in the form of computer control systems employing sensors and interlocks to shutdown the system in the event of an equipm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062808,
      "SummaryText": "ent malfunction or release of ammonia are built into the system. Alarm sensors are placed within the ammonia engine room (processing center) and throughout the facility to alert plant staff of any ammonia releases within the facility. Detailed emergency plans and procedures are in-place to warn our employees and the surrounding community in the event of a release. \n\n\n\nThere have been no ammonia releases from the facility since the restart of the facility refrigeration system (originally the facility was operated by a previous owner and was later closed down for a period of time prior to the restart by SpartanNash). Incident investigation procedures are in-place to ensure any potential future release is thoroughly investigated to determine the \"root cause\" of the incident and to ensure appropriate corrective action is implemented quickly and efficiently. Since the facility has been restarted by a new owner there has yet to be a compliance audit on the renovated refrigeration system. The first compliance audit will occur within 2-3 years of the date of this Risk Management Program. \n\n\n\nThe facility has a detailed emergency response program to handle fire, ammonia releases or natural disasters. All employees receive training during new hire orientation sessions and periodic refresher training to ensure they understand the facility emergency response procedures. Attachments to Part 6 of the Process Safety Management Plan provide detailed coverage of potential ammonia release scenarios and the appropriate actions in response to those scenarios. In the event of an ammonia release, the employees are provided information over the facility public address system as to the nature of the release and instructions where they should assemble. Given the safety hazards of ammonia, the safest place maybe within the facility; if evacuation is necessary, the employees are given directions to the appropriate outdoor assembly point based on the direction of the wind. Evacuation drills ar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062808,
      "SummaryText": "e periodically held to ensure the employees are familiar with the emergency response procedures.\n\n\n\nThe Oklahoma County LEPC is charged with the primary responsibility for emergency response at this location. The facility has contacted the local emergency responders (Fire Department) to make them aware of the anhydrous ammonia on-site.\n\n\n\nSpartanNash continues to investigate and implement changes to the ammonia process in order to improve safety and minimize risks associated with it. The annual operating budget includes sufficient allocation of fiscal resources to continuously maintain and improve the process and promote the training of operators and supervisory personnel.\n\n\n\n"
    }
  ]
}