{
  "FacilityID": 1000001765,
  "FacilityName": "Chippewa Valley Ethanol Company",
  "FacilityStr1": "270 20th Street NW",
  "FacilityStr2": null,
  "FacilityCity": "Benson",
  "FacilityState": "MN",
  "FacilityZipCode": "56215",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27151",
  "LEPC": null,
  "FacilityLatDecDegs": "45.325833",
  "FacilityLongDecDegs": "-095.639167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PP",
  "FacilityURL": "www.cvec.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Chippewa Valley Ethanol Company",
  "OperatorStr1": "270 20th Street NW",
  "OperatorStr2": null,
  "OperatorCity": "Benson",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56215",
  "OperatorZipCodeExt": null,
  "RMPContact": "William A. Lee",
  "RMPTitle": "General Manager",
  "FTE": 53,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000015583",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "15100026",
  "SafetyInspectionDate": "2007-04-05 00:00:00",
  "SafetyInspectionBy": "ENSR Coorporation",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 45.31505,
  "FRS_Long": -95.61133,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002353,
      "AltID": "Natural Gasoline Storage",
      "FacilityID": 1000001765,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000002462,
          "ProcessID": 1000002353,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002576,
          "ProcessID": 1000002353,
          "ChemicalID": 155,
          "Quantity": 400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 87407,
              "ProcessChemicalID": 1000002576,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000502576,
          "ProcessID": 1000002353,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000002354,
      "AltID": "Aqua Ammonia Storage",
      "FacilityID": 1000001765,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000002463,
          "ProcessID": 1000002354,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002577,
          "ProcessID": 1000002354,
          "ChemicalID": 57,
          "Quantity": 34500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000502577,
          "ProcessID": 1000002354,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001765,
      "SummaryText": "     Chippewa Vallley Ethanol manufactures 49.5 million gallons of ethyl alcohol annually. It is used in motor fuels, industrial alcohol and beverage alcohol applications. Corn is primarily used as a feedstock to the facility. The corn is dry milled, mixed with waters and the starch in the grain is enzymatically converted to sugars. The corn, water and sugar mixture (mash) is then sterilized in a cooking process. After cooking, yeast is added to the mash to ferment the sugars into ethyl alcohol. After fermentation is complete the ethyl alcohol is separated from the mash via a distillation process. Ethyl Alcohol is produced at a rate of 130,000 gallons per day. The remaining corn and water solution is centrifuged. The water soluble fraction is further evaporated (condensed) to a thick syrup and added back to the wet grain portion which are dried together to produce Distillers Dried Grains with Solubles (DDGS). DDGS is marketed as an animal feed ingredient.\n     Ethyl Alcohol is a substance that is regulated by the Alcohol and Tobacco Tax and Trade Bureau. Due to tax structures on beverage alcohol, any alcohol used for motor fuel purposes must be denatured with substances rendering the product unfit for human consumption. This is accomplished by adding 5 gallons of Natural Gasoline from on-site storage to every 100 gallons of ethyl alcohol. The industrial grade ethanol (specially denatured and un-denatured) is tranported under bond to customers in industrial, food and beverage applications.\n     CVEC uses hazardous chemicals (aqueous ammonia, sulfuric acid and sodium hydroxide) in the manufacturing process. These chemical are stored on site in above ground storage tanks. Sulfuric Acid and Sodium Hydroxide are stored inside buildings with concrete floors. Aqua Ammonia is stored in two 8200 gallon outdoor storage tanks. Both tanks are in a concrete dike with 3 foot walls. Chemical safety training is provided for the employee. Other training provided to employees on safe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001765,
      "SummaryText": "ty and health issues included in our policy manual are: hazardous communication, hearing conservation, chemical lab standard, emergency responses, respiratory training, forklift training, confined space entry, lockout / tagout, process safety management, contractor safety, contractor evaluation, hot work permits, electrical safety, fire extinquishers and personal protective equipment. CVEC is committed to being a responsible chemical manufacturer and providing a safe and healthful workplace. \n     Because ethyl alcohol is a flammable liquid the distillation areas, product storage areas and loadout operations are managed under the process safety management policies and procedures. The maximum intended inventory on site of NFPA 3 flammable liquid storage is 1,713,000 million gallons. Natural Gasoline, the denaturant for the motor fuel application, is a NFPA 4 flammable liquid and has a maximum intended storage of 58,500 gallons. We receive natural gasoline in truck and railcar quantities and offload to storage. All flammable storage tanks are contained in dikes and the tanks are equipped with pressure relief devices, flame arrestors and electronic level control with audible alarms. Our final products are loaded onto tanker transports and railcars for dispatch to customers. The transfer pad areas are designed to capture a railcar quantity spill or release. CVEC has a Spill Prevention Countermeasure and Control Plan and also complies with the Department of Transportation regulations as an offerer of hazardous substances in commerce.\n     CVEC files a Toxic Chemical Release Inventory for SARA listed chemicals, reports under the Toxic Substances Control Act, and complies with Emergency Planning Community Right-to-Know Act 302, 304, 311 and 312. We have an Above Ground Storage Tank Permit, a National Pollution Discharge Elimination System / Stormwater Permit and an Air Quality Permit all issued by the State of Minnesota. \n     CVEC's emergency response program is coordinat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001765,
      "SummaryText": "ed with the local fire department (Benson Fire Department). Emergency procedures are written for fires, spills and tornados. All emergencies require to first call 911. Specific emergency shutdown operations procedures are written for the process safety management covered areas. We have fire protection systems throughout the whole facility. All buildings are equipped with automatic sprinkler systems and distillation buildings are equipped with alcohol foam deluge systems. The industrial alcohol loadout area has a water deluge system with infrared heat detection system in place. The fire systems are inspected monthly and annually third party checked out. We recently upgraded the system to include a new 600,000 gallon fire water storage tank with a diesel fired back up pump. The fire department is equipped with extra fire-fighting foam. CVEC works closely with our local fire department and offer our facility for training purposes. The local fire department and CVEC coordinated with eight other adjacent area responders to a mock railcar fire for training purposes. The response from the training was effective and positive and these rural volunteer fire departments relied on that training the morning of October 22, 2003.  The training  practice was tragically necessary due to an expolsion in the mash preparation process area triggered by a welders torch that sent a tank into the air that landed on product loadout resulting in a railcar and tanker transport actual fire. The response was quick, professional and effective. There were no off-site injuries or evacuations. The welder lost his life and another worker was moderately burned. This tragic event has triggered many changes at CVEC, most notably the creating of a position and hiring of a full time safety professional at the manager level. The Safety Managers' job description is dedicated to review, update, create, communicate and enforce safety and health policies with employees and contractors. \n     CVEC is located o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000001765,
      "SummaryText": "n the outskirts of a rural community (Benson, MN, population 3200). The only public receptor affected by our operation is a grain elevator that supplies our feedstock. CVEC recently added a fence around the entire facility (including the adjacent grain elevator) and installed perimeter security cameras. Other tranportation security issues are also being considered.  CVEC strives to be responsible neighbor and our operations should pose a low threat hazard on the surrounding community."
    }
  ]
}