{
  "FacilityID": 1000096423,
  "FacilityName": "John Soules Foods",
  "FacilityStr1": "1135 Towel Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Valley",
  "FacilityState": "AL",
  "FacilityZipCode": "36854",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01017",
  "LEPC": "Chambers County LEPC",
  "FacilityLatDecDegs": "32.7784820",
  "FacilityLongDecDegs": "-85.1768553",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "John Soules Foods",
  "OperatorStr1": "1135 Towel Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Valley",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36854",
  "OperatorZipCodeExt": null,
  "RMPContact": "Adam White",
  "RMPTitle": "Maintenance Manager",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000247583",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-09-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-09-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-09-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "23",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119589,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000096423,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000120982,
          "ProcessID": 1000119589,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000149591,
          "ProcessID": 1000119589,
          "ChemicalID": 56,
          "Quantity": 51900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000649591,
          "ProcessID": 1000119589,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096423,
      "SummaryText": "1.0         EXECUTIVE SUMMARY\n\n \n\nThis document has been prepared to demonstrate how John Soules Foods - Valley complies with the requirements set forth under EPA's Chemical Accidental Prevention Provisions (40 CFR Part 68).  \n\n \n\nThis plan has been developed specifically to address the requirements applicable to the use of anhydrous ammonia at John Soules Foods - Valley located in Valley, AL. Each of the following sections provides a general overview of the requirements and defines the design attributes, documentation, and actions that are established to comply with those requirements.  In most instances, John Soules Foods - Valley has already developed measures and systems that provide compliance with 40 CFR Part 68 rules as a result of other regulatory programs and requirements.  This document does not replicate that information but rather provides cross-references to the applicable existing documentation.  In those instances where information was developed specifically to comply with the Part 68 requirements, that information is contained in this document.\n\n\n\n\n\n1.1.     Corporate Commitment to Safety\n\n \n\nJohn Soules Foods - Valley is committed in providing to all employees a work environment that is free from recognized health and safety hazards.  Accordingly, our goal is achieving and sustaining  safety through communication, information, and training.  To this end, we are dedicated to the concept that all employees receive the proper orientation and are provided with the means necessary to ensure the environment remains as safe and healthful as possible.\n\n \n\n1.1.1.     It is the policy of John Soules Foods - Valley to:\n\n \n\n1.1.1.1    Provide safe working conditions, proper tools, and personal protective equipment.\n\n \n\n1.1.1.2     Comply with all federal, state, and local occupational health, safety, and environmental laws and regulations.\n\n \n\n1.1.1.3    Provide and sustain a high level of commitment to ensure all employees have a safe and healthy work environment in which to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096423,
      "SummaryText": " work.\n\n \n\n1.1.1.4     Ensure, through training, and when necessary disciplinary action, that all employees work in a safe manner.\n\n \n\n1.1.1.5    Educate and/or train all employees in safe work practices, and ensure that each employee fully understands his or her job, equipment, techniques, and methods to reduce the risk to himself or herself and their co-workers.\n\n \n\n1.1.2.    Encourage all employees to \"Think Safety\", so that safety habits developed and practiced at work carry through to non-work related activities.\n\n \n\n1.1.3.    John Soules Foods - Valley's aim is to provide a professional service as efficiently as possible while minimizing the use of toxic materials wherever and whenever prudent.  In this effort, our highest priority will be the proactive pursuit of cost-effective process changes that reduce or eliminate the use and/or generation of hazardous toxics at the endpoint of service.  Where hazardous toxics cannot be eliminated, improving controls to handle these substances will be explored and implemented wherever possible.\n\n \n\n1.1.4.    John Soules Foods - Valley has prepared a facility safety policy and procedures program specifically tailored for the facility. In addition, a Process Safety Management Program has also been established and implemented regarding the ammonia refrigeration system process.  It is the responsibility of the designated facility personnel to carry out these programs.\n\n \n\n1.1.5.    The first duty of John Soules Foods - Valley employees is to exercise care in the performance of his/her work tasks to prevent an accident to him/herself, co-workers, the general public or equipment.  Safety-consciousness must take precedence over expedience, and is required as a condition of continued employment of all employees at all levels of the organization.\n\n \n\n1.2.    John Soules Foods - Valley Facility Description\n\n\n\n Facility description and regulated substances handle\n\n\n\nJohn Soules Foods is a domestic producer of processed food products. The John Soules Foo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000096423,
      "SummaryText": "ds - Valley, AL plant site covers approximately 291,000\n\nsquare feet within the Valley, AL city limits. It is located at 1135 Towel Avenue in Valley, AL, Chambers County.  The facility employees approximately 200 personnel.  The facility uses Anhydrous Ammonia in the \"Refrigeration System\".\n\n\n\n Accidental release program & chemical-specific prevention steps\n\n1.2.1.    The substance regulated under the Chemical Accident Prevention Provisions (40 CFR 68) that is located on site, in various locations and quantities is anhydrous ammonia.\n\n \n\n1.2.2.    Anhydrous ammonia is utilized on site for the \"Refrigeration System.\" Approximately 51,900 pounds of ammonia is used as a refrigerant in the facility's system.  The ammonia is contained in various vessels, piping, condensers and evaporators used throughout the ammonia refrigeration system.  \n\n \n\n1.3.    Worst Case Release Scenario\n\n \n\n1.3.1.    Considering that a \"catastrophic\" possibility does exist; the facility modeled two off site consequence analyses; a worst case and alternate case scenario.\n\n \n\n1.3.2.    For both scenarios, EPA's RMP Comp was used to determine the facility Off-Site Consequence Analysis.  The distances to the toxic endpoints for both releases, and the potential impacts are discussed in Section 3.0. Releases are represented on the maps in Appendix B of this document.\n\n \n\n1.4.    Emergency Response Program\n\n \n\n1.4.1.    John Soules Foods - Valley is equipped with an emergency information system.  Evacuation plans are placed throughout the facility to inform personnel in an emergency relating to the accidental release of ammonia, or other emergencies that may be encountered.  There are specific procedures that all employees must follow in the event of release; which can be found in the John Soules Foods - Valley Emergency Action Plan.  These procedures include evacuation of personnel, notification of authorities and actions to be taken to stop, or mitigate the emergency if it is safe to do so.\n\n \n\n1.4.2.    Plant personnel hav"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000096423,
      "SummaryText": "e received required emergency training as outlined in OSHA Standard 29 CFR 1910.120.\n\n \n\n1.4.3.    The Valley Fire Department has visited the facility to review the process operations, safety systems and discussed emergency response coordination.\n\n\n\n\n\n2.0         MANAGEMENT\n\n \n\n2.1.    Under EPA's 40 CFR 68.15, the Facility is required to assign a qualified person with overall responsibility for the development, implementation, and documentation of a system to manage the Risk Management program elements.  \n\n \n\n2.2.    When responsibility for implementing individual requirements of this RM plan is assigned to persons other than the overall qualified person, the names and positions of those personnel are documented and the lines of authority defined through the John Soules Foods - Valley PSM/RM Management System, (refer to Appendix A). \n\n \n\n2.3.     Consistent with OSHA Process Safety Management (PSM), John Soules Foods - Valley Sr. Director of Operations has overall responsibility for program. The EH&S Specialist will be responsible for administering and management of program, with support from the John Soules Foods - Valley personnel and John Soules Foods' top management.\n\n \n\n \n\n3.0         WORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\n \n\n3.1.    Under Subpart B of Part 68, subject facilities are required to evaluate the potential hazards that may result in the event of a release of a regulated substance from the facility.  \n\n \n\n3.2.    The following sections discuss the worst case and alternative release scenarios that have been developed for the anhydrous ammonia system at John Soules Foods - Valley along with the associated off-site impacts.\n\n \n\n3.2.1.    Worst Case Release Scenario\n\n \n\n3.2.1.1    The worst-case release scenario was based on a catastrophic release when the process systems Intercooler Vessel located inside the facility ammonia room, containing approximately 32,739 pounds of anhydrous ammonia, ruptures and releases the entire contents in a ten-minute period. Due to the lo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000096423,
      "SummaryText": "cation of nearby overhead doors and direct releases to outside atmosphere, mitigation factors were not considered for any of the scenarios created.\n\n \n\n3.2.1.2    The worst-case scenario established a release rate of 3,274 pounds of anhydrous ammonia per minute, over a 10-minute period. \n\n \n\n3.2.1.3    The distance to the toxic endpoint from such a release, as determined by RMP Comp is 2.13 miles (modeling calculations provided in Appendix B).                        \n\n \n\n3.2.1.4    Within the area affected by the worst-case scenario is a calculated residential population of approximately 671.  The population and receptor calculations were determined using ALOHA Gaussian Dispersion, a viewer software program for EPA, Census Bureau and US Geological Service data and maps, powered by the MARPLOT mapping system. \n\n \n\n3.2.1.5    There are no national or state parks, forests, and monuments; officially designated wildlife sanctuaries, preserves, and refuges; and federal wilderness areas.  There are residences, schools, commercial, and industrial facilities within the worst-case endpoint.\n\n \n\n3.2.2.    Alternative Release Scenario\n\n \n\n3.2.2.1    The alternative release scenario for the anhydrous ammonia system involves the rupture of the shaft seal on one of the seven compressors. This scenario resulted in a release of approximately 500 pounds of ammonia over a period of fifteen minutes. The release from the suspect compressor that is located in the ammonia room would be dispersed into the atmosphere via the relief header vent located on the facility roof above the ammonia room.\n\n \n\nThe distance to the toxic endpoint of the alternate scenario is 250 yards.  The affected area for the alternative release scenario is shown in Appendix B. Within the affected area, according to MARPLOT described above, there are no hospitals, prisons, recreation areas, national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, or refuges; or federal wilderness areas.  However, ther"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000096423,
      "SummaryText": "e are commercial businesses that would be affected by the alternate release scenario.\n\n \n\n \n\n4.0         ACCIDENT HISTORY\n\n \n\nNo accidental releases from the cover process have occurred resulting deaths, injuries, or significant property damage onsite or known off-site deaths, injuries, and evacuations, sheltering in place, property damage, or environmental damage.\n\n \n\n5.0         RMP FILING AND CERTIFICATION\n\n \n\nA copy of the electronic submission to the EPA using RMP Submit is contained in Appendix C of this Risk Management Program.\n\n \n\n \n\n6.0         PROCESS SAFETY INFORMATION\n\n \n\n6.1.     Under 40 CFR 68.65, the Facility is required to compile written process safety information before conducting any process hazard analysis.  This compilation aids in the identification and understanding of the hazards posed by processes involving regulated substances.\n\n \n\n6.1.1.    Personal Exposure Limits (PELS) and data regarding physical and chemical characteristics, reactivity, and corrosivity can be found in the Safety Data Sheet (SDS), located in the Process Safety Information section of the PSM Manual.  Thermal and chemical stability, and compatibility with other chemicals are also addressed in the SDS.\n\n \n\n6.1.2.     A block flow diagram of the process is on file in the Refrigeration Department.\n\n \n\n6.1.3.    The process system used at John Soules Foods - Valley is an enclosed loop mechanical process system that utilizes anhydrous ammonia as a heat exchange media in the freezing and cooling of the refrigerated food products.  There are no chemical reactions involving ammonia that occur. The principle involved is the ability of a refrigerant, in this case ammonia, to absorb heat as it changes state from a liquid to a gas, and to give up that heat as it changes back to a liquid.  The change in pressure levels required to accomplish this is supplied by the compressors.  The heat is absorbed in the cooling evaporators of various designs, and removed from the system by the condensers.  Mo"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000096423,
      "SummaryText": "re detailed and specific descriptions of the process system are provided in the PSM program.\n\n \n\n6.1.4.    The process system is charged with approximately 34,100 pounds of anhydrous ammonia to achieve the proper operating pressures and levels that are required within the process system.  \n\n \n\n6.1.5.    The safe upper and lower temperatures, pressures, flows and compositions are addressed in the Technical Operating Specifications located in the Operating Procedure section of the PSM Manual.  The consequences of deviating from these safe limits are also addressed in the Operating Procedures as well as the Process Hazard Analysis section of the PSM Manual.\n\n \n\n6.1.6.    The Piping and Instrumentation Diagrams (P&IDs) are located in the Refrigeration department office, while the electrical classification, ventilation design, and pressure relief system design are documented in Process Safety Information section of the PSM Manual. \n\n \n\n6.1.7.    The system was designed to meet the applicable sections of ASHRAE, ASTM, ANSI, NEMA, ASTI, and State and County Building Codes.  \n\n \n\n6.1.8.    The primary safety system consists of pressure relief valves located on the system's pressure vessels. The relief valves will vent to atmosphere in the event of an overpressure situation within the vessel or associated process components. \n\n \n\n6.1.9.    6.1.9.     In addition to the pressure relief valves, there are high-level shutdown devices configured to various pressure vessels within the process, which will shut down compressor operation in the event of an abnormal operating level in the process system vessels.\n\n \n\n6.1.10.    6.1.10. The ammonia room is equipped with ammonia detection sensors that activate alarms and ventilation fans in the event a pre-determined level of ammonia is released. \n\n \n\n6.1.11.    6.1.11. The ammonia room is also equipped with an emergency shutdown  \"kill\" switch located outside the ammonia room exit that will shut down the entire process system if activated by facility personnel"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000096423,
      "SummaryText": ".\n\n      \n\n    \n\n1.0    7.0         PROCESS HAZARD ANALYSIS\n\n \n\n7.1.    Under 40 CFR 68.67, the facility is required to perform an initial process hazard analysis on processes involving regulated substances.  The analysis is required to identify, evaluate, and control the hazard involved in the process.\n\n \n\n7.2.    The hazards of the process are identified in Process Safety Information. Safeguards to control hazards and prevent malfunctions and errors are identified in the Process Hazard Analysis section of the PSM Manual.\n\n \n\n7.3.    The consequences of system failures are addressed in the Process Hazard Analysis (PHA) section of the PSM Manual.\n\n \n\n7.4.    The findings and recommendations of the PHA team can be found in the PHA section of the PSM Manual.  The owner/operator's response to the PHA findings, along with the schedule of response action implementation and documentation of the implementation, is also addressed in the PHA section of manual.  \n\n \n\n7.5.1.    PHA's are performed as required by the PSM/RM program, will be revalidated at least once every 5 years.  \n\n \n\n7.5.2.    The John Soules Foods - Valley facility's next PHA revalidation is due no later than July 2026.  \n\n \n\n7.5.3.    All PHA documentation is retained for the life of the process.\n\n    \n\n \n\n8.0         OPERATING PROCEDURES\n\n \n\n8.1.    Under 40 CFR 68.69, the facility is required to develop and implement written operating procedures for safely conducting activities on processes involving regulated substances.\n\n \n\n8.2.    Written procedures, precautions, and parameters for the safe operation, shutdown, and maintenance of the system are addressed in the Operating Procedures section of the PSM Manual. \n\n \n\n8.3.    Procedures for start-up, temporary operations, emergency operations, and emergency shutdown are included in the Operating Procedures Section.\n\n \n\n8.4.    Operating limits, consequences of deviation, and steps required to correct or avoid deviation are addressed in the Operating Procedures and the PHA sections of the manual.\n\n"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000096423,
      "SummaryText": " \n\n\n\n9.0    TRAINING\n\n \n\n9.1.    Under 40 CFR 68.71, the facility is required to provide training to employees operating processes involving regulated substances.\n\n \n\n9.2.    All employees will receive initial training as described in Section of the PSM Manual, and will be followed by refresher training a minimum of once every three years.  Employees will receive continual on the-job training regarding understanding hazards, operating procedures, maintenance, and inspection.  \n\n \n\n9.2.1.    Sign-in sheets, verification of understanding and documentation of the training for each employee are located in the Refrigeration Department files. \n\n \n\n\n\n10.0    MECHANICAL INTEGRITY/MAINTENANCE\n\n \n\n10.1.    Under 40 CFR 68.73, the facility is required to establish and implement written procedures to maintain the ongoing integrity of process equipment, to provide training to employees regarding these procedures, and to provide for testing and inspection of process equipment.\n\n \n\n10.2.    Procedures for testing, inspection and preventative maintenance of the process equipment are included in the Mechanical Integrity section of the PSM Manual.  \n\n \n\n10.3.    Documentation of maintenance activities for the refrigeration equipment is maintained on file within the facility's Refrigeration Department files.\n\n\n\n\n\n11.0    MANAGEMENT OF CHANGE\n\n \n\n11.1.    Under 40 CFR 68.75, the facility is required to establish and implement written procedures to manage changes to process chemicals, technology, equipment, and procedures. \n\n \n\n11.2.    Written procedures to manage changes and requirements for training personnel when changes occur, or when Standard Operating Procedures or Standard Maintenance Procedures are updated, are located in the Management of Change section of the PSM Manual.\n\n\n\n \n\n12.0    COMPLIANCE AUDITS\n\n \n\n12.1.    Under 40 CFR 68.79, the facility is required to certify that the procedures and practices developed under this standard have been evaluated at least every 3 years and that they are adequate and are bein"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000096423,
      "SummaryText": "g followed. \n\n12.2.    An audit to evaluate facility compliance within the requirements of this program will be completed every 3 years.  \n\n \n\n12.3.    Documentation of findings, responses, and corrective actions resulting from the completion of the PSM audit checklist shall be added into the PSM Program. \n\n \n\n12.4.    The two most recent audit reports will be maintained on file in the PSM Program.\n\n \n\n\n\n13.0    INCIDENT INVESTIGATION\n\n \n\n13.1.    Under 40 CFR 68.81, the facility is required to investigate each incident that resulted in, or could reasonably have resulted in, a catastrophic release of a regulated substance. \n\n \n\n13.2.    Within 48 hours of each incident that results in, or could have resulted in, a \"catastrophic release\" of ammonia, an investigation shall be initiated into the incident in accordance with the Emergency Action Plan. \n\n \n\n13.3.    An investigation report shall document the date and time of the incident, along with a description of the incident with its contributing factors, and recommendations to avoid future incidents.  Incident Investigation guidelines and reports can be found in the Incident Investigation section of the PSM manual.\n\n \n\n13.4.    Copies of completed investigation reports will be maintained for a period of 5 years.\n\n \n\n \n\n14.0    EMPLOYEE PARTICIPATION\n\n \n\n14.1.    Under 40 CFR 68.83, the facility is required to develop a written plan of action regarding the implementation of employee participation. \n\n \n\n14.2.    A written plan of action for employee participation in Process Hazard Analysis, Management of Change, and training is included in the Employee Participation section of the PSM Program. \n\n \n\n14.3.    Access to documents is also addressed in the Employee Participation section of the PSM Program.\n\n \n\n \n\n15.0    HOT WORK PERMITS\n\n \n\n15.1.    Under 40 CFR 68.85, the facility is required to issue hot work permits for hot work conducted on or near a covered process. \n\n \n\n15.2.    Hot work permits shall be issued in accordance with 29 CFR 1910.252(a), and as desc"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000096423,
      "SummaryText": "ribed in the PSM Standard 1910.119(k).\n\n \n\n \n\n16.0    CONTRACTOR PROGRAM\n\n \n\n16.1.    Responsibilities of the facility and of contractors performing maintenance or repair, turnaround, major renovations, or specialty work on or adjacent to a covered process are specified under 40 CFR 68.87. This section does not apply to contractors providing incidental services that do not influence process safety, such as janitorial work or food services.\n\n \n\n16.2.    John Soules Foods - Valley personnel shall evaluate the safety performance and safety programs of contractors during the selection process, in accordance with guidelines in the PSM Program. \n\n \n\n16.3.    John Soules Foods - Valley shall provide hazard information and emergency response procedures to all contractors prior to them entering the Facility to commence work.\n\n \n\n16.4.    Contractors shall receive un-announced performance evaluations regarding the fulfillment of their obligations, including:\n\n \n\n3.2.1.    Each contract employee is trained in the work practices necessary to safely perform his/her job.\n\n \n\n3.2.2.    Each contract employee is instructed in the known potential fire, explosion, or toxic release hazards related to his/her job and the process, and the applicable provisions of the Emergency Action Plan.\n\n \n\n16.5.    The contractor has documented that each contract employee has received and understood the required training.  Documentation to be maintained by the contractor shall include the employee's name, date of training, and the means used to verify that the employee understood the training.\n\n \n\n16.6.    Each contract employee follows applicable facility safe work practices.\n\n \n\n16.7.    The contractor will notify John Soules Foods - Valley personnel of any unique hazards presented by the contractor's work or any hazards found.\n\n \n\n \n\n17.0    EMERGENCY RESPONSE / ACTION PROGRAM\n\n \n\n17.1.    Under 40 CFR 68.95, the facility is required to develop and implement an emergency response program for the purpose of protecting public health "
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000096423,
      "SummaryText": "and the environment.\n\n \n\n17.2.    John Soules Foods - Valley employees have received training as outlined in 29 CFR 1910.20.  John Soules Foods - Valley is equipped with an emergency information system.  Evacuation plans are placed throughout the facility to inform personnel in an emergency relating to the accidental release of ammonia, or other emergencies that may be encountered.  There are specific procedures that all employees must follow in the event of release; which can be found in the John Soules Foods - Valley Emergency Action Plan.  These procedures include response to the release, evacuation of personnel, notification of authorities and actions to be taken to stop, or mitigate the emergency if it is safe to do so\n\n \n\n17.3.    Procedures for notifying the local emergency response agencies of accidental releases are detailed in the facility's Emergency Action Plan.\n\n \n\n17.4.    Documentation of emergency medical procedures to treat accidental human exposures is included in the Emergency Action Plan, as well as the Process Safety Information and Operating Procedure sections of the PSM Manual."
    }
  ]
}