{
  "FacilityID": 1000079375,
  "FacilityName": "Fallbrook Water Reclamation Plant",
  "FacilityStr1": "1425 S. Alturas St",
  "FacilityStr2": null,
  "FacilityCity": "Fallbrook",
  "FacilityState": "CA",
  "FacilityZipCode": "92028",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.220200",
  "FacilityLongDecDegs": "-117.153700",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fpud.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Fallbrook Public Utility District",
  "Company2Name": null,
  "CompanyDUNS": 73384828,
  "Company2DUNS": 0,
  "OperatorName": "Fallbrook Public Utility District",
  "OperatorStr1": "990 E. Mission Road",
  "OperatorStr2": null,
  "OperatorCity": "Fallbrook",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92088",
  "OperatorZipCodeExt": "2290",
  "RMPContact": "Owni Toma",
  "RMPTitle": "Chief Plant Operator",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000123323",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-11-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.38747,
  "FRS_Long": -117.24089,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099015,
      "AltID": null,
      "FacilityID": 1000079375,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100258,
          "ProcessID": 1000099015,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124087,
          "ProcessID": 1000099015,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624087,
          "ProcessID": 1000099015,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079375,
      "SummaryText": "Accidental Release and Emergency Response Policies\n\nThe Fallbrook Water Reclamation Plant is committed to providing a safe environment to its employees and surrounding communities.  This commitment is reflected in the safety and environmental programs that are implemented at the facility.  For example, written procedures have been created for the handling of chlorine.   Safety programs are geared towards the prevention of an accidental release at the facility.  In addition, these programs incorporate emergency procedures to mitigate the effects of a release if it does occur.  At such an event, emergency coordinators will assess the situation and notify outside responding agencies as necessary.\n\n\n\nStationary Source and Regulated Substance\n\nThe Fallbrook Water Reclamation Plant, utilizes gaseous chlorine to treat water for domestic purposes. The plant has a maximum of 16,000 pounds of chlorine stored in eight one-ton containers, two pairs of two containers are on-line at any given time. Each container is placed on a scale to allow the Fallbrook Water Reclamation Plant operators to plan ahead for ordering more chlorine. Each one-ton container is positioned so that the valves are vertically aligned.  For the one-ton container, a manifold is connected to the top container valve to ensure chlorine gas is drawn out of the container. A vacuum is created when process water is pumped through the ejectors.  This flow generates a vacuum which opens the vacuum regulator.  Upon loss of vacuum in the line from any one ton container, a diaphragm in the vacuum regulator will close, stopping any chlorine from escaping. Any chlorine gas in the tubing upon loss of vacuum, downstream of the regulator, will be drawn through the ejectors and into solution.\n\n\n\nThere is a chlorine sensor within the chlorine room, the chlorine sensor would alert Fallbrook Water Reclamation Plant employees who would respond to the facility. In addition, a release of chlorine resulting in a concentration of 1 "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079375,
      "SummaryText": "ppm in the chlorine building would activate an audible alarm. At a concentration of 3 ppm, the scrubber turns on. The scrubber system consists of an ejector-venturi scrubber, caustic storage tank, and mist eliminator pad that effectively remove chlorine gas through absorption and chemical reaction between the gas and scrubbing liquid. In addition, the halogen system will is activated and the vacuum ceases.\n\n\n\nAccidental Release Prevention Program\n\nThe Fallbrook Water Reclamation Plant has developed an accidental release prevention program for compliance with the OES CalARP regulation.  The program includes but is not limited to the following elements:\n\n?    Safety information regarding the chemical hazards, and operating and technical specifications for the equipment;\n\n?    Written procedures for operating and maintaining the processes;\n\n?    Training for employees involved with system operations and maintenance;\n\n?    Written procedures for managing system changes and startup of a modified process;\n\n?    Investigating releases and near misses and implementing measures to prevent recurrence;\n\n?    Written procedures for conducting hot work on or near the regulated processes;\n\n?    Contractor management policies to ensure contract employee safety while on facility premises; and\n\n?    Employee involvement in program development and implementation.  \n\n\n\nFallbrook Water Reclamation Plant is committed to the prevention and minimization of accidental releases of chlorine. It is the policy of the Fallbrook Water Reclamation Plant to adhere to all applicable federal, state, and local regulations. \n\n\n\nFive Year Accident History\n\nA review of the five year accident history showed that there have been no incidents at the facility that meet the RMP criteria for a reportable accident (onsite deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place).  In addition, there have been no incidents at the fac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079375,
      "SummaryText": "ility in the last five years that resulted in a release of more than the Federal Reportable Quantity. \n\n\n\nEmergency Response Program\n\nFallbrook Water Reclamation Plant has developed an Emergency Response Plan (ERP) for the purpose of protecting employees and the surrounding community.  The ERP covers procedures for: 1) evacuating and accounting for visitors and employees, 2) dealing with a chemical release and other foreseeable emergencies that could occur onsite, 3) notifying external agencies and emergency response personnel, and 4) administering first aid measures for chemical exposure.  Employees are informed of the elements of the ERP initially and annually.  In the event of a chemical release, employees will evacuate or shelter-in-place, depending on the nature of the release, and the facility will contact the fire department for assistance as necessary.\n\n\n\nPlanned Changes to Improve Safety\n\nProcess Hazard Analysis, Seismic Assessment, and Compliance Audits have been performed on the chlorine system and safety programs, and these studies have resulted in action items to improve safety at the facility.  The recommendations mainly consist of formalizing procedures, implementing practices consistent with industry standards, and performing inspections and tests to maintain the integrity of the equipment.  Fallbrook Water Reclamation Plant has implemented several of these action items and is moving forward with completing the remaining outstanding recommendations.   In addition, the facility plans to continue providing employees with a safe work environment through continued training on current policies and procedures, and conducting audits to identify deficiencies and make improvements."
    }
  ]
}