{
  "FacilityID": 1000020501,
  "FacilityName": "Roundup Natural Gas Liquids Extraction Facility",
  "FacilityStr1": "3064 Road I",
  "FacilityStr2": null,
  "FacilityCity": "Wiggins",
  "FacilityState": "CO",
  "FacilityZipCode": "80654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08087",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "40.115027",
  "FacilityLongDecDegs": "-104.092396",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Xcel Energy, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 186614616,
  "Company2DUNS": 0,
  "OperatorName": "Public Service Company of Colorado",
  "OperatorStr1": "1800 Larimer Street",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": "COD981544430",
  "EPAFacilityID": "100000019749",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "950PMR081",
  "SafetyInspectionDate": "2001-10-30 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-01-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-02-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-02-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-02-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.11472,
  "FRS_Long": -104.09139,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000024990,
      "AltID": "Nat Gas Liq. Extraction",
      "FacilityID": 1000020501,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000029751,
          "ProcessID": 1000024990,
          "ChemicalID": 98,
          "Quantity": 6572.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000029752,
          "ProcessID": 1000024990,
          "ChemicalID": 155,
          "Quantity": 115115.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 102956,
              "ProcessChemicalID": 1000029752,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 102957,
              "ProcessChemicalID": 1000029752,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 102958,
              "ProcessChemicalID": 1000029752,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 102959,
              "ProcessChemicalID": 1000029752,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000025353,
          "ProcessID": 1000024990,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000020501,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-05-08 00:00:00",
    "ERTrainingDate": "2014-08-19 00:00:00",
    "CoordinatingAgencyName": "Morgan County Emergency Response",
    "CoordinatingAgencyPhone": "9708678506",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000020501,
      "SummaryText": "This executive summary is a brief overview of the Risk Management Program and the associated policies at the Public Service Company of Colorado (PSCo) Roundup Natural Gas Liquids (NGL) Extraction Facility.  The facility qualifies for Program Level 1 based on its offsite consequences analysis and that there have been no significant accidental releases of one or more of the regulated substances from a covered process in the five years prior to the submission of this RMP. PSCo maintains a separate PSM program for the OSHA requirements. PSCo management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community. This understanding is reflected in procedures described and referenced in the RMP manual.\n\nStationary Sources and Regulated Substances\n\nRoundup is a natural gas liquids extraction facility designed to process 40 mmscfd of natural gas. The purpose of the Roundup NGL Extraction Facility is to reduce the dew point of the gas to a level that is acceptable for pipeline transmission. Control of the dew point is critical since the incoming gas is water saturated in many cases. The dew point increases as the concentration of moisture (water and heavy hydrocarbons) in the inlet gas increases. As gas flows through the pipeline, its temperature will decrease to about the same temperature as the surrounding ground. If this temperature is below the dew point of the gas, the water and heavy hydrocarbons will tend to condense. The resulting buildup of hydrates can begin to restrict process flow, particularly at orifices and bends in the pipe. In extreme cold, the hydrates may even form a potentially dangerous ice plug. \n\nIn order to reduce the dew point of the gas (and accordingly, minimize the formation of hydrates), the inlet gas is chilled using a propane refrigeration system. This process allows the heavy hydrocarbons and water to condense out of the process flow. Ethylene glycol "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000020501,
      "SummaryText": "is spray-injected into the inlet gas at each heat exchanger to absorb the condensed water. Ethylene glycol, condensed liquid hydrocarbons, and residue gas are then separated in a cold separator. The lower the temperature in the separator, the greater the volume of liquid extracted, which also lowers the dew point of the residue gas. The ethylene glycol is circulated through a reboiler to drive off water, and then it is circulated to the separator. Condensed hydrocarbons are then stored. The residual gas is then delivered to the transmission pipeline. \n\nThe RMP-regulated substances handled at this facility are LPG, drip gas, and propane. The following is a breakdown of the locations of these materials at Roundup:\n\nNGL Plant Propane System: Maximum Volume - 500 gallons Maximum Weight = 2530 lbs.\nPropane Makeup Tank: Maximum Volume - 1200 gallons Maximum Weight =6072 lbs.\nLPG Product System: Maximum Volume - 150 gallons Maximum Weight = 759 lbs.\nLPG Product Storage: Maximum Volume - 9600 gallons Maximum Weight = 48,576 lbs.\nDrip Gas: Maximum Volume - 5000 gallons Maximum Weight = 25,300 lbs.\n\nThe propane and liquid hydrocarbon systems are the only covered processes at this time at the Roundup NGL Extraction Facility. The balance of the plant is regulated under DOT Pipeline Safety regulations Parts 190-199. Filling of the tanks is administratively limited to 80% of the tank capacity by NFPA 58 requirements, as corrected for facility elevation.\n\nOffsite Consequence Analysis\n\nPSCo determined that the worst-case release scenario should address the release of the entire contents of the single largest container.  Based on administrative controls the worst-case release is 9600 gallons (48,576 pounds) over a ten-minute period.  The release was modeled with RMP Comp and the impact area was determined to extend 0.3 miles from the facility.  There are no public or environmental receptors within the impact area.\n\nAccident History\n\nWithin the five-year period prior to the submittal"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000020501,
      "SummaryText": " of this RMP, there were no accidental releases of regulated flammable materials meeting the requirements of 40 CFR 68.42.\n\nEmergency Response Program\n\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies. The program is described in detail in the Emergency Planning and Response section of the RMP compliance manual and meets the requirement of 40 CFR 68.95. The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public. The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\n"
    }
  ]
}