{
  "FacilityID": 1000094294,
  "FacilityName": "Crosby Chase 2-1H Production Pad",
  "FacilityStr1": "T150N, R94W, Section 3, NW/SE",
  "FacilityStr2": null,
  "FacilityCity": "Mandaree",
  "FacilityState": "ND",
  "FacilityZipCode": "58757",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38053",
  "LEPC": "Mckenzie County LEPC",
  "FacilityLatDecDegs": "47.8391231",
  "FacilityLongDecDegs": "-102.696535",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "WPX Energy Williston, LLC",
  "OperatorStr1": "10471 One A Street SW",
  "OperatorStr2": null,
  "OperatorCity": "Killdeer",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58640",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000246931",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-06-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-06-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-01-22 00:00:00",
  "DeRegistrationEffectiveDate": "2023-11-23 00:00:00",
  "AnniversaryDate": "2026-06-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117042,
      "AltID": "Flare Gas Capture Facilit",
      "FacilityID": 1000094294,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146427,
          "ProcessID": 1000117042,
          "ChemicalID": 155,
          "Quantity": 382500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000129773,
              "ProcessChemicalID": 1000146427,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000129770,
              "ProcessChemicalID": 1000146427,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000129771,
              "ProcessChemicalID": 1000146427,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000129772,
              "ProcessChemicalID": 1000146427,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000129774,
              "ProcessChemicalID": 1000146427,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000129775,
              "ProcessChemicalID": 1000146427,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000129776,
              "ProcessChemicalID": 1000146427,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118451,
          "ProcessID": 1000117042,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094294,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-07-01 00:00:00",
    "ERTrainingDate": "2020-09-01 00:00:00",
    "CoordinatingAgencyName": "McKenzie County Sheriff's Office",
    "CoordinatingAgencyPhone": "7014443654",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094294,
      "SummaryText": "1. INTRODUCTION AND SUMMARY\r\n\r\n1.1. EXECUTIVE SUMMARY\r\n\r\nA leasing company, Valence Natural Gas Solutions (Valence), operates a flare gas capture facility (Facility) designed to take WPX Energy Williston, LLC (WPX) facility natural gas and remove natural gas liquids (NGLs) from the gas prior to gathering and final treatment at the Crosby Chase 2-1H Production Pad (Site). This report provides the Risk Management Plan (RMP) for the capture facility, pursuant to the requirements of the U.S. Environmental Protection Agency (EPA) RMP rule.\r\n\r\nThe Facility is designed to remove liquids from gas and let lighter gases continue to go to the flare. The NGLs are primarily propane. The Facility is comprised of two plants. Flare Gas Capture Plant 2 (FGC-002) is on the Northwest side of the Site access road, with up to 8 trailers comprised of the MCC/generator, gas processing, liquid storage, flare systems and one skidded booster compressor. The equipment has \r\ninterconnecting pipe racks and cables between. The WPX main raw gas supply riser is located on the north side of the Facility, while the residue gas riser to WPX is located to the south. The Water Storage along with NGL Liquid Storage is located on the Northwest side to the West of the process trailers. Water and NGL loading will occur off the end of the liquid trailers. Flare Gas Capture Plant 3 (FGC-003) is along the Northeast side of the Site with up to 12 trailers comprised of the MCC, boost compression, processing, liquid storage, CNG compression and flare facilities. The equipment is all trailer mounted with interconnecting pipe racks and cable between. The CNG loading occurs west of the CNG compressor (towards the flare stack), there can be as many as five CNG trailers parked either full, actively filling or be in queue to be filled. The Water Storage along with NGL Liquid Storage is located on the Northeast side to the East of the process trailers. Water and NGL loading will occur off the end of the liquid trailers"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094294,
      "SummaryText": ". The NGL storage tanks have an 23,250-gallon capacity. Valence will have up to five tanks on-Site and the maximum fill for each tank is 18,600 gallons. The 93,000 gallons is equivalent to 382,500 lbs. of flammable liquids. Two 16,000-gallon capacity produced water tanks will also be on-Site.\r\n\r\nUnder the authority of Section 112(r) of the Clean Air Act, the Chemical Accident Prevention Provisions require facilities that produce, handle, process, distribute, or store certain chemicals to develop a Risk Management Program, prepare a Risk Management Plan (RMP), and submit the RMP to EPA. Covered facilities were initially required to comply with the rule in 1999, and the rule has been amended on several occasions since then, most recently in 2004. This Facility is regulated under Title 40, Part 68 of the Code of Federal Regulations (40 CFR 68), more commonly known as the Risk Management Program (RMP) rule. RMP plans must be prepared for processes that store in excess of the thresholds set forth by 40 CFR 68.130. For flammable liquids, the threshold is 10,000 lbs. This Site can store approximately 382,500 lbs. of NGL and exceeds 10,000 lbs. threshold, thus the facility is subject to the requirements of the Chemical Accident Prevention rule and must prepare an RMP.\r\n\r\n1.2. LOCATION\r\n\r\nThe Crosby Chase 2-1H Production Pad is in the NW ¼ of the SE ¼ of Section 3, Township 150N, Range 94W, McKenzie County, North Dakota, on the Fort Berthold Indian Reservation (FBIR).\r\n\r\nLatitude: 47.83912317968884, Longitude: -102.6965354207543\r\n\r\nDriving Directions:\r\nFrom the intersection of North Dakota Highway 22 and North Dakota Highway 73 near Mandaree, North Dakota, travel northerly on ND Highway 22 for 5.08 miles. Turn right (east) onto unnamed lease road. Follow lease road easterly for 0.61 miles to fork in roadway; veer right (Southeasterly) for 0.37 miles to next intersection. Turn right (south) onto access road. Travel southerly 0.43 miles. Crosby Chase 2-1H Production Pad will b"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000094294,
      "SummaryText": "ination of the effects of any accidental releases of one or more of the regulated substances from a covered process in the five years prior to the submission of the Risk Management Plan. To be reportable, the release must have caused at least one of the following:\r\n1. On-site deaths, injuries, or significant property damage; or\r\n2. Known Off-Site deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage.\r\nThe Crosby Chase 2-1H Production Pad is newly constructed and therefore, no accidental releases have occurred in the past five years.\r\n\r\n4. RMP PLAN SUBMITTAL\r\n\r\nSubmittal of an RMP Plan is required for all covered processes for which a regulated substance is above a threshold quantity in a process. Since the NGL storage falls within the limits of the Program 1 requirements, the RMP Plan will contain the information pertinent to this program. Upon submittal of the RMP Plan, no additional submittals will be required under the RMP until:\r\n1. An NGL accident with off-Site impacts occurs;\r\n2. Process changes might reasonably be expected to change the distance to the level of concern by a factor of two or more;\r\n3. A change occurs at or near the Facility that requires a revised off-Site consequence analysis (e.g. New public receptors become present within the impact radius, or;\r\n4. Five years from the date of initial submittal of the RMP Plan.\r\nThe certification letter will be submitted through RMP*eSubmit.\r\nA physical copy of the Crosby Chase 2-1H Production Pad RMP will be stored on-location and at the WPX Energy Killdeer, ND Field Office."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094294,
      "SummaryText": "e on the left (east) side of the lease road.\r\n\r\n1.3. RMP REQUIREMENTS\r\n\r\nAll facilities subject to the RMP rule must complete a hazard assessment analysis for the regulated chemical. In addition, the recent (5-year) accident history and emergency response plan must be reviewed. Based on these assessments, the Facility will be classified within one of three program levels.\r\n> Program 1 - no off-Site receptor impacted (potentially and in last five years)\r\n> Program 2 - off-Site impacts but not subject to Occupational Safety and Health\r\nAdministration's Process Safety Management Standard (OSHA PSM)\r\n> Program 3 - off-Site impacts and subject to OSHA PSM\r\n\r\nAll programs require submittal of an RMP Plan. For Program 2 and 3 processes, a release prevention program and an emergency response program are required. The following sections provide a brief summary of the hazard assessment, accident history, prevention program, emergency response, and subsequent RMP program level determination for the Crosby Chase 2- 1H Production Pad.\r\n\r\n1.4. HAZARD ASSESSMENT\r\n\r\nThree possible natural gas liquids (NGL) processes were identified as having the largest potential, should a spill occur: the NGL storage tanks, the tank truck unloading, and the piping. The rupture of the NGL storage tanks was identified to be the worst-case release scenario since it will result in the largest spill surface area. For the worst-case release scenario, the maximum distance to the level of concern is 0.6 miles. Details on the hazard assessment are provided in Section 2.\r\n\r\n1.5. RECEPTORS IMPACTED\r\n\r\nOnce the impact distance of the worst-case release scenario is examined, the impact on off-Site receptors must be considered. If public receptors or environmental receptors are impacted, additional analysis is required. Any unrestricted areas within this region of the level of concern (0.6 miles) must be evaluated to determine if public or environmental receptors are impacted. There are no public receptors (res"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094294,
      "SummaryText": "idences) and no environmental receptors within the impact radius. Details on the receptors impacted are provided in Section 2.4.\r\n\r\n1.6. ACCIDENT HISTORY\r\n\r\nThere are no accidents to report for either the five-year accident history (40 CFR §68.42) or for determining Program 1 applicability (40 CFR §68.10(b)(1)).\r\n\r\n1.7. EMERGENCY RESPONSE\r\n\r\nA Facility emergency response plan for the Crosby Chase 2-1H Production Pad is in place and has been coordinated with local emergency planning and response organizations as required by 40 CFR §68.10(b)(3).\r\n\r\n1.8. PROGRAM LEVEL\r\n\r\nNGL storage at the facility qualifies as a Program 1 process since three applicability criteria for a Program 1 process have been met:\r\n1. No accidental releases of NGL have led to off-Site death, injury, or response and restoration activities at an environmental receptor within the last five years (40 CFR §68.10(b)(1));\r\n2. The maximum distance to the level of concern does not impact any public or environmental receptor (40 CFR §68.10(b)(2));\r\n3. Emergency response procedures have been coordinated between WPX and local emergency planning and response organizations (40 CFR §68.10(b)(3)).\r\n\r\n1.9. RMP PLAN\r\n\r\nSubmittal of an RMP is required for all covered processes if the regulated substance is present above a threshold quantity. This Site can store approximately 382,500 lbs. of NGLs and exceeds 10,000 lbs. threshold, thus the RMP is required. Upon submittal of the RMP Plan, no additional submittals will be required under the RMP until:\r\n1. An accident with off-Site impacts occurs;\r\n2. Process changes might reasonably be expected to change the distance to the level of concern by a factor of two or more;\r\n3. A change occurs at or near facility that requires a revised off-Site consequence analysis (e.g. New public receptors move within the impact radius), or;\r\n4. Five years from the date of initial submittal of the RMP Plan.\r\n\r\nSince the WPX facility is subject to RMP, a hazard assessment must be performe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000094294,
      "SummaryText": "d. The first step of the hazard assessment is a worst-case analysis to determine the maximum potentially affected area. Should off-Site receptors be impacted in the worst-case analysis, additional alternative case analyses are required.\r\n\r\n2. HAZARD ASSESSMENT\r\n\r\n2.1. WORST-CASE RELEASE SCENARIO ANALYSIS\r\n\r\nA worst-case release is defined under 40 CFR §68.3 as:\r\n... the release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to an endpoint defined in 40 CFR §68.22(a).\r\nThe worst-case scenario quantity is determined in 40 CFR §68.25(b) as the greatest amount in any single vessel or pipe used in a covered process, considering administrative controls that limit the maximum quantity. The term process is defined in 40 CFR §68.3 as:\r\n... any activity involving a regulated substance including any use, storage, manufacturing, handling, or on-site movement of such substances, or combination of these activities. For the purposes of this definition, any group of vessels that are interconnected, or separate vessels that are located such that a regulated substance could be involved in a potential release, shall be considered a single process.\r\nThe definition of process is broad and can be interpreted to include all equipment handling a regulated substance. Three processes have the potential to release flammable gases, which include:\r\n1. NGL Storage Tank;\r\n2. Truck unloading from the NGL storage tank;\r\n3. Piping.\r\n\r\n2.1.1. NGL Storage Tank\r\nThe NGL storage tanks are the largest process at 93,000 gallons. Should a spill occur, all of 93,000 gallons (382,500 lbs.) of NGL is assumed to be released in the worst-case release scenario. Per 40 CFR 68.25 (1), for regulated flammable gases handled as refrigerated liquids under pressure the total quantity in the vessel is assumed to be released as a gas over a 10-minute period.\r\n\r\n2.1.2. Truck Unloading\r\nThe NGL storage tank unloading is another major pr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000094294,
      "SummaryText": "ocess at approximately 8,000 gallons.\r\nAlthough the unloading process could result in a potential release, the tank truck is not considered for RMP if the truck's motive power stays attached to the tank. Thus, the tank truck is removed from consideration as the worst-case scenario.\r\n\r\n2.1.3. Piping\r\nThe NGL is produced in the system and flows to the NGL storage tank through a piping system. The piping consists primarily of 1.0-inch and 2.0-inch diameter pipes. For the purposes of this analysis, a leak from the full system is assumed. The dimensions of the pipe are conservatively assumed to be 500 ft. long by 2.0 (0.167 ft.) diameter, for a volume of 1.94 barrels or 81.6 gallons. Since the maximum spill (93,000 gallons) resulted from the NGL storage tank is larger than the total spill volume from the piping system, the rupture of the NGL storage tank is determined to be the worst-case process.\r\n\r\n2.2. METEOROLOGICAL CONDITIONS\r\n\r\nThe meteorological parameters for the worst-case scenario are defined by 40 CFR §68.22(b) as having a wind speed of 1.5 m/s and the atmospheric stability Class F. The temperature is taken as 77 °F as default by the RMP*Comp program. Table 2-1 summarizes the meteorological conditions used for the worst-case release analysis.\r\nTable 2-1. Worst case release scenario meteorological conditions\r\nParameter Value\r\nAtmospheric stability class - F\r\nWind speed at 10-m anemometer height (m/s) - 1.5\r\nAir temperature (F) - 77\r\n\r\n2.3. DISPERSION MODELING ANALYSIS\r\n\r\nThe dispersion modeling analysis for accidental gas release into the ambient air is evaluated with the RMP*Comp program. Besides the release and meteorological conditions discussed above, the analysis also utilized the rural ground surface roughness. The modeled Distance-To-Endpoint was 0.6 miles.\r\n\r\n2.4. OFF-SITE CONSEQUENCE ANALYSIS: POPULATION AND ENVIRONMENT\r\n\r\nAfter the distance to the flammable endpoint has been determined, the off-Site impacts on population, public receptors, and enviro"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000094294,
      "SummaryText": "nmental receptors should be analyzed as required by the RMP rule. The population within a circle centered at the point of release and a radius equal to the distance to the flammable endpoint should be estimated to two significant digits. In addition, all types of public receptors (schools, residences, hospitals, prisons, public recreation areas or arenas, major commercial or industrial areas) and environmental receptors (national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, or refuges; federal wilderness areas) within this distance should be identified.\r\n\r\nA field survey was used to estimate the potentially affected population within the distance to the flammable endpoint and to identify public receptors. The survey showed that no population is within the 0.6-mile impact radius for the worst-case release. The types of public receptors and environmental receptors identified within the impact area are listed in Table 2-2. Recent aerial imagery was used to find the public receptors within the impact radius. Additionally, no environmental receptors are impacted by the worst-case release scenario.\r\n\r\nTable 2-2. Public and Environmental receptors within impact area for NGL worst case release scenario\r\nReceptor Distance to Endpoint NGL - 0.6 mile\r\nSchools - No\r\nResidences - No\r\nHospitals - No\r\nPrisons/Correctional Facilities - No\r\nRecreation Areas - No\r\nCommercial, Office, or Industrial Areas - No\r\nOther - No\r\n\r\nNational or State Parks, Forests, or Monuments - No\r\nOfficially Designated Wildlife Sanctuaries, Preserves, or Refuges Federal Wilderness Area - No\r\nOther - No\r\n\r\nSince no off-Site receptor is impacted in the worst-case analysis, additional alternative case analysis is not required.\r\n\r\n3. FIVE-YEAR ACCIDENTAL HISTORY\r\n\r\nPer the requirements of the RMP rule, WPX must include a five-year accident history of the Crosby Chase 2-1H Production Pad in the Risk Management Plan. The five-year accident history involves an exam"
    }
  ]
}