{
  "FacilityID": 1000054842,
  "FacilityName": "Taylor Farms Express Cooling",
  "FacilityStr1": "1225 Abbott Street",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.655704",
  "FacilityLongDecDegs": "-121.627034",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": "taylorfarmsfoodservice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Taylor Farms Foodservice",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Taylor Farms Express Cooling",
  "OperatorStr1": "1225 Abbott Street",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 97,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000084856",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-10-10 00:00:00",
  "SafetyInspectionBy": "Cypress Engineering Group",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-10-23 03:14:08",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-10-23 03:14:08",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-10-23 03:14:08",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-10-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.65433,
  "FRS_Long": -121.6289,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000068635,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000054842,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000084561,
          "ProcessID": 1000068635,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000069778,
          "ProcessID": 1000068635,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000057295,
              "Process_NAICS_ID": 1000069778,
              "SafetyReviewDate": "2019-10-10 00:00:00",
              "PHA_Date": "2019-10-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-04-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "operator error, no flow, low flow, lack of maintenance, design deficiency, physical damage & vandalism/terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Diffusion Tank",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Diffusion Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-10-10 00:00:00",
              "TrainingReviewDate": "2019-10-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "tailgates",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-10-10 00:00:00",
              "EquipmentInspectionDate": "2019-10-10 00:00:00",
              "EquipmentTested": "all refrigeration equipment",
              "ChangeMgmtDate": "2019-05-14 00:00:00",
              "ChangeMgmtReviewDate": "2019-10-10 00:00:00",
              "PreStartupReviewDate": "2019-05-14 00:00:00",
              "ComplianceAuditDate": "2017-09-24 00:00:00",
              "AuditCompletionDate": "2019-03-24 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-10-10 00:00:00",
              "HotWorkPermitReviewDate": "2019-10-10 00:00:00",
              "ContractorSafetyReviewDate": "2018-05-31 00:00:00",
              "ContractorSafetyEvalDate": "2018-05-31 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000070114,
                  "PreventionProgram3ID": 1000057295,
                  "ProcessChemicalID": 1000084561
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000054842,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-12-14 00:00:00",
    "ERTrainingDate": "2019-07-19 00:00:00",
    "CoordinatingAgencyName": "Monterey County Health Department",
    "CoordinatingAgencyPhone": "8317554971",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000054842,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\r\nTaylor Farms Express Cooling conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required.\r\nOn-site personnel provide initial emergency response. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. Refrigeration contractors would also be on-call to provide emergency response.\r\nEmergency response training will be conducted yearly for current employees and as required to for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\r\n\r\n2. Stationary Source and Regulated Substances Handled\r\nTaylor Farms Express Cooling uses anhydrous ammonia as a refrigerant in their operations. Sheets R0.0 and R2.0 in Chapter 8 Appendix 8.1* show the facility location map and site plan, respectively.\r\nThe ammonia system is used for cold storage and produce pre-cooling. The refrigeration system at the facility is composed of both fixed and portable equipment. Fixed system includes, screw and reciprocating type compressors, evaporative condensers, pressure vessels, ammonia pumps, cold room evaporative cooling coils, pressure cooling systems, ammonia detection, control systems and diffusion tank. Portable systems include two half cars, one 1-1/2 car vacuum tubes, two refrigeration"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000054842,
      "SummaryText": "trailers and one hydroshower. Two half-car vacuum tubes are leased from Western Precooling Systems (WPS) and stay at the site only during the operating season. WPS technicians and operators are responsible in seasonal set-up, start-up, operation, maintenance and daily monitoring of these systems. 1-1/2 car tube (Proper Temp Vacuum Tube) is owned and operated by Taylor Farms Express Cooling personnel and stays onsite throughout the season. All portable and fixed system equipment are tied together and operate as a single system.\r\nFacility operates seasonally from approximately April 15 through November 15. WPS Vacuum Tubes are brought to the site during this time only. All of the fixed refrigeration equipment except the evaporative condensers, two high pressure receivers and the diffusion tank are located indoors. The facility pumps down all the ammonia in the system to the high-pressure receivers and three 1,000-gallon nurse tanks during the off season. All equipment is maintained at 60 psig pressure during the off-season to eliminate air contamination.\r\nAll compressors have safety switches that would shut down the compressors upon detection of unsafe operating conditions. Refrigeration control system sends alarms to refrigeration manager in case of emergency situation or any high pressure, high temp or ammonia detection. All pressure vessels and compressors are protected against high-pressure situations by safety relief valves. There are ammonia detectors in the cold rooms and mechanical room for alarming. There are assigned responders experienced with ammonia refrigeration that would respond to and determine specific actions for any incident.\r\nThe refrigeration systems at the facility were constructed as per applicable codes and industry standards at the time of construction. The total ammonia charge of the refrigeration systems at the facility is approximately 28,000 lb.\r\nRefrigeration drawings are located in Chapter 8 Appendix 8.1 Refrigeration System Drawings*."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000054842,
      "SummaryText": "A list of refrigeration equipment used at this facility can be found in Chapter 12*. Fixed and portable refrigeration equipment locations can be found on the plans located on sheets R2.0, R2.1 and R2.2*. International Institute of Ammonia Refrigeration (IIAR) \"Ammonia Refrigeration Safety Inspection Checklists,\" located in Chapter 12 Appendix 12.2*, describe equipment details.\r\nThe refrigeration systems at this facility are single-stage vapor compression cycles. In general, the process chemistry for these systems are shown in Chapter 8*.\r\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See Chapter 8 Appendix 8.3* for Safety Data Sheets (SDS) for anhydrous ammonia.\r\n\r\n3. General Accidental Release Prevention Program\r\nTaylor Farms Express Cooling maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases in order to prevent a similar future release, see Chapter 16 Incident Investigation*.\r\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. There are emergency shut-off switches outside the mechanical room for shutting down the system. Ammonia detectors are installed in all refrigerated rooms and the mechanical room. Pe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000054842,
      "SummaryText": "rsonnel will automatically be notified if any detector exceeds its set point. Monitoring is done 24 hours per day. An emergency control box and diffusion tank allows system pressure to be relieved manually. Most of the relief valves at the facility are tied into an ammonia diffusion tank to prevent high-pressure releases to ambient. \r\n\r\n4. Five-Year Accident History\r\nAccording to Taylor Farms Express Cooling personnel, there has been no releases of anhydrous ammonia resulting in reportable quantities or injuries since they acquired the facility in April 2014. \r\n\r\n5. Emergency Response Program\r\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Compliance Manager is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The Compliance Manager will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required. A description of the emergency response plan is included in Chapter 20*.\r\n\r\n6. Planned Changes to Improve Safety\r\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed and can be found in Chapter 00*. The table items are a result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, and a Safety Inspection performed by a qualified person. Some corrective items in the recommendation table originate from multiple codes but are listed only once. Specific facility areas and systems categorize recommendations resulting from the Safety Inspection; some of which may repeat general Process Hazard Analysis and Code Compliance Review items. Based on the severity of the hazards identified, implementation deadlines are also recommended.\r\nAll refrigeration equipment is well maintained and oper"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000054842,
      "SummaryText": "ated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation.\r\n\r\n*All RMP elements are stored in cloud and can be accessed by the facility personnel."
    }
  ]
}