{
  "FacilityID": 1000025821,
  "FacilityName": "Reser's Fine Foods. Inc. - Topeka Distribution",
  "FacilityStr1": "3121 SE 6th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Topeka",
  "FacilityState": "KS",
  "FacilityZipCode": "66607",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20177",
  "LEPC": "Shawnee County LEPC",
  "FacilityLatDecDegs": "39.043962",
  "FacilityLongDecDegs": "-95.63588",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "UN",
  "LatLongDescription": "OT",
  "FacilityURL": "www.resers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9026642,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Reser's Fine Foods, Inc.",
  "OperatorStr1": "3121 SE 6th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Topeka",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66607",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Harding",
  "RMPTitle": "General Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000216768",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-12-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-11-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-01-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-01-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-01-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000031732,
      "AltID": null,
      "FacilityID": 1000025821,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000032040,
          "ProcessID": 1000031732,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000038456,
          "ProcessID": 1000031732,
          "ChemicalID": 56,
          "Quantity": 17106.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000538456,
          "ProcessID": 1000031732,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000025821,
      "SummaryText": "1.0    EXECUTIVE SUMMARY\n\n\n\n1.10 Accidental Release Prevention And Emergency Response Policies\n\n\n\nThe Reser's Fine Foods, Inc. refrigeration system uses pure anhydrous ammonia (a commonly used refrigerant for industrial systems) as the refrigerant.  Given the quantity handled, anhydrous ammonia is considered a hazardous substance by the EPA.  Many of the properties that make ammonia valuable as a refrigerant also requires that precautions and procedures be in place to protect employee and public health and safety during a chemical emergency.  It is the policy of Reser's Fine Foods, Inc. to be in compliance with all applicable federal and state rules and regulations.  \n\n\n\nSafety at our facility is inherent on the manner in which anhydrous ammonia is handled.  While the design of the facility incorporates a multitude of safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.  \n\n\n\n1.11 Process Safety Management Program\n\n\n\nWe have a written Process Safety Management (PSM) plan that complies with state and federal regulations.  A crucial component of this plan is the Emergency Response Plan, developed in compliance with the Emergency Response provisions.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside agencies.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.\n\n\n\n1.20 Facility Description and Substances Handled\n\n\n\nThe Reser's Fine Foods, Topeka Distribution Center is a cold food storage facility that stores and distributes refrigerated foods.  Distributions of safe refrigerated foods require the use of a refrigeration system to preserve the integrity of processed foods.  This refrigeration process uses ammonia as a refrigerant.  Access to the facility is restricted to authorized employees and visitors, management personnel and contractors.\n\n\n\nThe regulated substance handled is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000025821,
      "SummaryText": " anhydrous ammonia.\n\n\n\nThe ammonia refrigeration system's maximum inventory is 17,106 pounds of anhydrous ammonia.  There is no standby make-up inventory kept on-site.\n\n\n\n1.30 General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nReser's Fine Foods, Inc. complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  The design and construction of this facility was in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.\n\n\n\nReser's written PSM plan incorporates many policies and procedures to ensure safe operation and maintenance of this facility.  This plan will be reviewed and updated as necessary by the Reser's Fine Foods, Inc. Risk Management Department.\n\n\n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures and safety considerations.  Only qualified maintenance personnel operate and interact with the refrigeration system.  This minimized the chances of inadvertent error in operation that could lead to release of ammonia.  Startup, shutdown, and any on-stream adjustments are handled by these qualified persons.  \n\n\n\n1.40 Five Year Accident History\n\n\n\nN/A.\n\n\n\n1.50 Emergency Response Program\n\n\n\nReser's Fine Foods, Inc. has a written Emergency Response Plan developed to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  It shall comply with provisions Emergency Response regulations.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.  This plan will undergo review with the local emergency services responding agency.  \n\n\n\nThe approach in the development of this plan has been to identify t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000025821,
      "SummaryText": "he ammonia emergencies most likely to occur at Reser's Fine Foods, Inc. and establish precautions and procedures to protect life safety and health during an emergency.  The refrigeration process has back-up prevention systems to keep processing malfunctions from becoming ammonia release emergencies.  \n\n\n\nAll Reser's Fine Foods, Inc. personnel will be trained to fulfill their designed responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify plan elements requiring improvement.  \n\n\n\nThis plan will be reviewed and updated as necessary by the Reser's Fine Foods, Inc. Risk Management Department.\n\n\n\n1.60 Planned Changes to Improve Safety\n\n\n\nAll system components meet design specifications for equipment, design and installation of ammonia mechanical refrigerating systems.  All pressure vessels are built according to the appropriate pressure vessel codes.  Any upgrades or extensive maintenance work performed in the future will be in compliance with those standards applicable at that time.\n\n\n\n\n\nRESER'S FINE FOODS, INC.\n\nTOPEKA DISTRIBUTION CENTER\n\nTOPEKA, KANSAS\n\n\n\n"
    }
  ]
}