{
  "FacilityID": 1000103954,
  "FacilityName": "Chesapeake Export Terminal",
  "FacilityStr1": "2901 South Military Highway",
  "FacilityStr2": null,
  "FacilityCity": "Chesapeake",
  "FacilityState": "VA",
  "FacilityZipCode": "23323",
  "Facility4DigitZipExt": "5804",
  "FacilityCountyFIPS": "51550",
  "LEPC": "Chesapeake LEPC",
  "FacilityLatDecDegs": "36.776667",
  "FacilityLongDecDegs": "-076.312778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.nglenergypartners.com/",
  "FacilityEmailAddress": "info@nglep.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "NGL Supply Terminal Company LLC",
  "Company2Name": "NGL Energy Partners LP",
  "CompanyDUNS": null,
  "Company2DUNS": 965465086,
  "OperatorName": "NGL Energy Partners",
  "OperatorStr1": "6120 S. Yale Ave.",
  "OperatorStr2": "Suite 805",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74136",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168301",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-07-26 00:00:00",
  "SafetyInspectionBy": "U.S. Coast Guard",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-01-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-01-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-01-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-01-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.776667,
  "FRS_Long": -76.312778,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000129421,
      "AltID": "LPG Storage/ Distribution",
      "FacilityID": 1000103954,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000162292,
          "ProcessID": 1000129421,
          "ChemicalID": 118,
          "Quantity": 80000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000162293,
          "ProcessID": 1000129421,
          "ChemicalID": 98,
          "Quantity": 150000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000130836,
          "ProcessID": 1000129421,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000111511,
              "Process_NAICS_ID": 1000130836,
              "SafetyReviewDate": "2022-06-27 00:00:00",
              "PHA_Date": "2023-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-09-28 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Hydrants, hose, & monitor nozzles. Portable fire extinguishers",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Flammable gas detectors. Fire detectors.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-04-22 00:00:00",
              "TrainingReviewDate": "2021-06-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Web Based",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-06-29 00:00:00",
              "EquipmentInspectionDate": "2022-12-01 00:00:00",
              "EquipmentTested": "All Pressure vessels",
              "ChangeMgmtDate": "2022-09-28 00:00:00",
              "ChangeMgmtReviewDate": "2021-06-29 00:00:00",
              "PreStartupReviewDate": "2022-09-29 00:00:00",
              "ComplianceAuditDate": "2021-06-29 00:00:00",
              "AuditCompletionDate": "2022-12-13 00:00:00",
              "IncidentInvestigationDate": "2019-05-31 00:00:00",
              "InvestigationChangeDate": "2022-02-18 00:00:00",
              "ParticipationPlansReviewDate": "2022-07-29 00:00:00",
              "HotWorkPermitReviewDate": "2022-08-17 00:00:00",
              "ContractorSafetyReviewDate": "2022-11-29 00:00:00",
              "ContractorSafetyEvalDate": "2021-06-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000140033,
                  "PreventionProgram3ID": 1000111511,
                  "ProcessChemicalID": 1000162292
                },
                {
                  "PrimaryKey": 1000140032,
                  "PreventionProgram3ID": 1000111511,
                  "ProcessChemicalID": 1000162293
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000103954,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-12-13 00:00:00",
    "ERTrainingDate": "2023-01-05 00:00:00",
    "CoordinatingAgencyName": "Chesapeake Fire Department",
    "CoordinatingAgencyPhone": "7573826566",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000103954,
      "SummaryText": "vacuations, sheltering in place, or environmental damage.\n\nEMERGENCY RESPONSE PLAN:\nThe Chesapeake Terminal has a written emergency response plan to deal with accidental releases of propane and butane. The plan includes all aspects of emergency response including evacuations and notification of local emergency response agencies. Our facility's\nemergency response plan is based upon the NPGA's LP-Gas Handbook/ Guidelines for Developing Plant Emergency Response\nProcedures/ How to Control LP-Gas Leaks and Fires. To ensure proper functioning, our emergency response equipment is\nregularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our\nprocesses that would require a modified emergency response.\n\nPLANNED CHANGES TO IMPROVE SAFETY:\nAt the Chesapeake terminal we will continually strive for safety improvement. Periodic process safety inspections and Process Hazard Analyses will be conducted followed with timely response."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000103954,
      "SummaryText": "r job tasks.\n\nTraining:\nThe Chesapeake Terminal has a comprehensive training program in place to ensure that employees are completely competent in the operating procedures associated with these processes. New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently and have passed a written proficiency test.\nRefresher training is provided annually.\n\nMaintenance:\nThe Chesapeake Terminal carries out documented maintenance checks on process equipment to ensure proper functioning. Maintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner. Equipment manufacturer's written procedures help ensure that work is performed in a consistent manner and provide a basis for training.\n\nCompliance Audits:\nThe Chesapeake Terminal conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation:\nChesapeake Terminal personnel promptly investigate any incident that has resulted in, or could reasonably result in, a catastrophic release of LPG. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from recurring. All reports are retained for a minimum of 5 years.\n\nFIVE-YEAR ACCIDENT HISTORY:\nThe Chesapeake, VA Terminal has had an excellent record of preventing accidental releases over the last 5 years. Due to our\nstringent release prevention policies, there has been no accidental releases during this period that resulted in injuries, deaths, offsite property damage, e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000103954,
      "SummaryText": "ws are addressed in a safe and timely manner. Hazard Reviews are conducted using a team of people who have operating and maintenance experience as well as engineering and safety expertise. The team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. To help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the plant periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained. The team findings are forwarded to management for consideration, and the final resolution of the findings are documented and retained for the life of the process.\n\nOperating Procedures:\nFor the purposes of conducting activities safely within our butane distribution facility, personnel at the Chesapeake Terminal maintain written operating procedures. These procedures address various modes of operation, such as emergency shutdown system/ startup procedures, pre-operational visual inspection procedures, rail car un-loading procedures, rail car loading procedures, ship loading procedures, and transport loading and unloading procedures. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process. Operating Procedures are readily available to operators and for other personnel to use as necessary to safely perform thei"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000103954,
      "SummaryText": "tallations, (American Petroleum Institute).\n*\tAPI 620, Design and Construction of Large, Welded, Low-Pressure Storage Tanks, (American Petroleum Institute).\nThe plant is attended by at least two operators at all times. They log field operating data at four-hour intervals and monitor plant equipment using the following monitoring and control systems: Indoor operating areas of the plant are monitored by combustible vapor detectors to quickly detect leaks. The main control panel, located in the central control room, displays pressures, temperatures, valve positions, and flow rates and provides for remote operation and manual or automatic shutdown of valves and equipment.\nWritten policies and procedures for safe operation are contained in the following manuals:\n*\tOperations Manual and Emergency Manual, covering normal startup, operation, and shutdown of marine loading/unloading systems and equipment.\n*\tNGL Safety Policies and Procedures Manual, it covers safe work practices and permitting requirements for such activities as, electrical work, confined space and vessel entry, excavation, and other hazardous activities. \n*\t“The Plant security and visitor policies are covered in the Facility Security Plan.\n*\tProcess Safety Management Program, covering policies and procedures for PSM program elements.  Section 12.0 of the PSM manual contains our emergency response plan covering guidelines for situations involving unusual events or threats to public safety.\n\nSafety Information:\nA detailed record of written safety information is maintained at the Chesapeake Terminal that describes the chemical hazards, operating parameters and equipment designs associated with all aspects of our distribution facility.\n\nHazard Review:\nA What-if and Checklist and HAZOP methodologies are used to carry out hazard reviews at our facility. The reviews focus on operating procedures, equipment functions, and handling practices to identify possible hazards. Any finding related to the hazard revie"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000103954,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\nThe NGL Energy Partners Chesapeake Terminal personnel are strongly committed to employee, public, and environmental safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our process. Our emergency response program is based upon the NFPA 58 Requirements for LP-Gas Storage and NPGA's LP-Gas Safety Handbook/ Guidelines for Developing Plant Emergency Procedures/ How to Control LP-Gas Leaks and Fires. In addition, if a release were to occur, we have coordinated a response plan with the Chesapeake Fire Department, which provides highly trained emergency response personnel to control and mitigate the effects of the release.\n\nTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCE HANDLED:\n\nThe NGL Energy Partners Chesapeake Terminal located in Chesapeake, VA exports and stores fully refrigerated liquid butane (also called liquefied petroleum gas or LPG) at approximately 25 deg F. The terminal receives this product by rail and processes this product by chilling it to approximately 25 deg F for shipment to its customers by ship. Propane is used as a refrigerant in the chilling process.  Propane and butane are both regulated flammable substance. The terminal has no RMP listed toxic chemicals in threshold quantities.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nThe Chesapeake Terminal has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. The terminal was designed and built in accordance with provisions of the following recognized standards for LPG facilities:\n*\tNFPA 58, Standard for the Storage and Handling of Liquefied Petroleum Gases, (National Fire Protection Association).\n*\tAPI 2510, Design and Construction of Liquefied Petroleum Gas (LPG) Ins"
    }
  ]
}