{
  "FacilityID": 1000080019,
  "FacilityName": "SIMPLOT GROWER SOLUTIONS - COLUSA",
  "FacilityStr1": "2947 Highway 20",
  "FacilityStr2": null,
  "FacilityCity": "Colusa",
  "FacilityState": "CA",
  "FacilityZipCode": "95932",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06011",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "39.182603",
  "FacilityLongDecDegs": "-121.996900",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.simplot.com",
  "FacilityEmailAddress": "josh.jordan@simplot.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Simplot AB Retail, Inc.",
  "Company2Name": "dba Simplot Grower Solutions",
  "CompanyDUNS": 117198950,
  "Company2DUNS": 0,
  "OperatorName": "Simplot AB Retail",
  "OperatorStr1": "1099 W. Front Street",
  "OperatorStr2": null,
  "OperatorCity": "Boise",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83702",
  "OperatorZipCodeExt": null,
  "RMPContact": "Troy Bolt",
  "RMPTitle": "VP & GM Retail Business",
  "FTE": 12,
  "OtherEPAFacilityID": "CAD095882403",
  "EPAFacilityID": "100000044533",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-08-14 00:00:00",
  "SafetyInspectionBy": "Colusa County Environmental Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.2376,
  "FRS_Long": -122.0268,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099883,
      "AltID": "Ammonia Process",
      "FacilityID": 1000080019,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101125,
          "ProcessID": 1000099883,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125137,
          "ProcessID": 1000099883,
          "ChemicalID": 56,
          "Quantity": 160000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000125138,
          "ProcessID": 1000099883,
          "ChemicalID": 57,
          "Quantity": 730000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625137,
          "ProcessID": 1000099883,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625138,
          "ProcessID": 1000099883,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080019,
      "SummaryText": "SIMPLOT GROWER SOLUTIONS - COLUSA CALIFORNIA\n\nEXECUTIVE SUMMARY\n\n\n\n\n\nThe purpose of the Colusa facility Ammonia Process Safety and Risk Management Plan is to prevent the accidental release of ammonia into the workplace, the surrounding community, and the environment, and to set forth procedures to control and mitigate a release if one was to occur.   It is the policy of the J. R. Simplot Company to manufacture, handle, transport, store, and dispose of all substances safely and in compliance with the requirements of federal, state, and local environmental, health, & safety laws while reducing the risks to human health, safety, and the environment.  This policy applies to all groups, divisions, operations, and departments of the J. R. Simplot Company, including the Simplot Grower Solutions (SGS) facility located at 2947 Highway 20, Colusa, Colusa County, California.  Facility management is expected to implement, and all employees are expected to comply with, the spirit and letter of this policy.\n\n\n\nSGS Colusa is an agricultural retail store, providing ag-related products and services to area farmers.  The facility stores and handles bulk dry fertilizers, bulk liquid fertilizers, bulk liquid herbicides, and performs both dry and liquid custom fertilizer blending.  The facility also stores prepackaged fertilizers and other agricultural chemicals for sale and delivery to farmers.  The regulated substances stored and handled at this location are anhydrous ammonia (NH3) and aqua ammonia solutions (aqua).  NH3 is received via tank truck, and is offloaded into one of two interconnected pressure storage tanks.  The NH3 is predominately utilized for the production of aqua by mixing 24% NH3 in water.  The aqua is stored onsite in one of 3 aboveground storage tanks.  Aqua is loaded into bobtail trailers as 20% nitrogen liquid fertilizer for delivery to farmers, or into cargo tank trucks for transfer to other Simplot facilities. \n\n \n\nThe worst-case release scenario for the facili"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080019,
      "SummaryText": "ty is the catastrophic failure of an 18,000-gallon NH3 pressure storage tank.  This event would result in an uncontrolled release with a calculated distance of 5.1-miles to the toxic endpoint.  The surrounding area within the circle as defined by the 5.1-mile radius is flat terrain and predominately rural.  The estimated population within the circle is 7,200.  Potential public receptors include the City of Colusa (north), an industrial park (south), the Colusa County Airport (east), and the Colusa National Wildlife Refuge (west).  Note that the worse-case scenario is unlikely to occur because of the safety margin built into the design code for pressure vessel construction, and because of protective devices and procedures in place to prevent a release.    \n\n\n\nTwo alternative ammonia release scenarios were evaluated for the facility.  The scenario for anhydrous ammonia (NH3) involved rupture of a 2-inch transfer hose, in which NH3 is released into the atmosphere for a period of 1-minute before safety design features or human intervention stops the flow.  The total estimated release is 1,545-lbs. with a calculated distance to the toxic endpoint of 0.3-miles.  Mitigation systems for stopping the flow include the nitrogen-activated emergency shutoff system, vessel excess flow valves, and hose break-away fittings.  The scenario for aqua involves rupture of a 6-inch HDPE pipe, in which aqua is released as a liquid for a period of 2-minutes before safety design features or human intervention stops the flow.  The total estimated release is 35,600-lbs. with a calculated distance to the toxic endpoint of 0.6-miles.  In both alternative scenarios, the affected population within the toxic endpoint was determined to be zero.\n\n\n\nThe facility Plan complies with the OSHA Process Safety Management (PSM) regulations, the EPA Risk Management Plan (RMP) regulations, and the California Accidental Release Prevention Program (CalARP) regulations under 19 CCR Division 2 Chapter 4.5. The cov"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080019,
      "SummaryText": "ered process is subject to Program 3 requirements.    Also referenced are Industrial standards, including ANSI/CGA G-2.1 - 2014, \"Requirements for the Storage and Handling of Anhydrous Ammonia\", 6th Edition.  The facility utilizes advancements in equipment and technology to improve safety and prevent the release of ammonia.  For example, a nitrogen-activated emergency shut-off system was installed, which allows for emergency isolation of the NH3 tanks using pushbuttons mounted at local work stations and remotely at a distance.  Breakaway coupling and shear devices were installed on transfer hoses to prevent an ammonia release caused by a drive-away tank truck or nurse tank trailer.  Additional instrumentation was recently added to the aqua blending area to improve process safety.  Another key practice at this facility is ammonia training.   All employees receive ammonia general awareness training.  Operators receive classroom and field training, and are certified by management.  Operators are involved in reviewing and updating standard operating procedures.  \n\n\n\nDuring the past 5 years, the facility has had no accidental releases of ammonia that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  \n\n\n\nThe facility has an emergency response plan that provides evacuation procedures and notification contact information.  Employees receive annual training on the plan and periodically participate in evacuation drills.  The facility hazmat response team is qualified to respond up to Level C, but does not have the training or equipment to respond to a large uncontrolled release of anhydrous ammonia.  In this case, Colusa County Fire Department would serve as the primary emergency responder.  Emergency plans and procedures have been coordinated with the Fire Department and the Colusa County Environmental Health Services Department.  As process cha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080019,
      "SummaryText": "nges occur, facility management will contact the Colusa County Fire Department to modify emergency coordination plans as needed.\n\n\n\nThrough our ongoing implementation of the Prevention Program elements of the PSM/RMP plan, the SGS Colusa facility looks continuously for possible process modifications and administrative changes that will improve safety and prevent releases.      \n\n"
    }
  ]
}