{
  "FacilityID": 1000059602,
  "FacilityName": "Lawson Products McCook Distribution Center",
  "FacilityStr1": "8801 West 47th Street",
  "FacilityStr2": null,
  "FacilityCity": "McCook",
  "FacilityState": "IL",
  "FacilityZipCode": "60525",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.804428",
  "FacilityLongDecDegs": "-87.839583",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lawsonproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Lawson Products, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5438890,
  "Company2DUNS": 0,
  "OperatorName": "Shane Mc Carthy",
  "OperatorStr1": "8770 W. Bryn Mawr Ave., suite 900",
  "OperatorStr2": null,
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60631",
  "OperatorZipCodeExt": "3515",
  "FTE": 149,
  "OtherEPAFacilityID": "ILR000176859",
  "EPAFacilityID": "100000232802",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-06-15 00:00:00",
  "SafetyInspectionBy": "Shambaugh & Son, L.P.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-12-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-12-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-12-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-12-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074493,
      "AltID": null,
      "FacilityID": 1000059602,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092172,
          "ProcessID": 1000074493,
          "ChemicalID": 155,
          "Quantity": 404470.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000080065,
              "ProcessChemicalID": 1000092172,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000080066,
              "ProcessChemicalID": 1000092172,
              "ChemicalID": 111
            },
            {
              "FlamMixChemID": 1000080067,
              "ProcessChemicalID": 1000092172,
              "ChemicalID": 92
            },
            {
              "FlamMixChemID": 1000080068,
              "ProcessChemicalID": 1000092172,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000080069,
              "ProcessChemicalID": 1000092172,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000080070,
              "ProcessChemicalID": 1000092172,
              "ChemicalID": 130
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000075655,
          "ProcessID": 1000074493,
          "NAICSCode": "42384",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000059602,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-11-29 00:00:00",
    "ERTrainingDate": "2016-12-07 00:00:00",
    "CoordinatingAgencyName": "McCook Fire Deparment",
    "CoordinatingAgencyPhone": "7082550100",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059602,
      "SummaryText": "The accidental release prevention and emergency response policies at your facility: \n\n\n\nLawson Products, Inc. is committed to worker and public safety, and particularly, in the operation of our McCook distribution center facility. This commitment to safety is demonstrated by the resources invested in accident prevention, including, but not limited to Powered Industrial Truck and Spill Response training. Lawson Products, Inc. maintains a Safety Data Sheet (SDS) listing in the warehouse for use by facility employees. Annual fire safety inspections are performed by the Shambaugh & Son, L.P. In addition, Lawson Products, Inc. coordinates emergency response measures with McCook Fire Department. Lawson Products contracts FM Global for Risk Assessment and underwriting. At least annually, FM audits the facility with a team of engineers for the purpose of minimizing potential risk of catastrophic events. Lawson Products utilizes the following: Emergency Response Plan (ERP), Hazardous Communication Program and Process Safety Management Program (PSM).\n\nYour facility and the regulated substances handled:\n\nLawson Products, Inc. is an industrial distributor of maintenance and repair supplies, distributing products from our 300,000 square-foot facility in McCook, Illinois. The McCook distribution center consists of administration offices, warehouse storages, and shipping areas. The facility warehouses and distributes approximately 300,000 products under different brand names, some of which are regulated chemical aerosol products. The McCook distribution center operates 5 days a week, 19 hours per day, and employs 149 people.\n\nThe operations affected by the risk management plan (RMP) involve the receipt and storage of aerosol products. Product is moved within the warehouse via forklift trucks. The individual containers are typically packaged in corrugated shippers. The shippers are typically stacked on a pallet, on which there may be 1,000-2,000 individual containers. The palletize"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059602,
      "SummaryText": "d loads are stored within an isolated NFPA aerosol cage with ESFR fire protection. There are 19-hour security personnel during hours of operation and fire monitoring system 24/7 in the facility for a potential event.\n\n\n\nSome aerosol products stored in McCook facility contain flammable propellants which are regulated under the RMP Rule if handled, manufactured or stored in a process at a facility in a quantity greater than its listed threshold quantity. The specified threshold quantity for flammable substances under the RMP Rule is 10,000 pounds. The warehouse facility constitutes a single process. The warehouse stores greater than 10,000 pounds of butane and propane in aerosol products. \n\n\n\nThe aerosol products are typically in metal containers, with the maximum size of aerosol can is 24-ounce. \n\nThe average weight of these aerosol products is 17.28 oz. and the average amount of propellant in each can is 14%. Per EPA Helpline, the worst case scenario was clarified as the release of the largest quantity of a regulated substance from a single aerosol can. The worst case scenario was based on one 18 oz. aerosol can containing 15% of propane and 15% of butane. The quantity released in a vapor cloud explosion would not affect any residential population or public receptor or have any off-site consequences.\n\n\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\n\n\nLawson's McCook facility is subject to OSHA PSM rule. Lawson Products, Inc. is ISO 9001 certified company,\n\nand internal and external audits are performed regularly.\n\n\n\nLawson Products, Inc. has developed programs to comply with the required environmental, health and safety standards. We take a systematic approach to preventing accidental releases of hazardous chemicals through process management systems and programs which include:\n\n\n\n- ERP\n\n- Standard work instructions\n\n- Daily pre-startup meeting\n\n- Job hazard analysis / job safety analysis\n\n- Compliance audits\n\n- Regular f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059602,
      "SummaryText": "acility inspections (Daily, Weekly, Monthly, Annual)\n\n- Operating procedures\n\n- Accident investigation\n\n- Training\n\n- Employee participation\n\n- Preventive maintenance of equipment\n\n- Hot work permit\n\n- Contractor safety\n\n\n\nIn addition to our management programs, specially designed systems to control, prevent, detect, and mitigate potential accidental releases are also in place. These include an early suppression, fast response sprinkler system (ESFR) installed throughout the warehouse, to be used in the event of a fire. Aerosol storage racks are equipped with in-rack sprinkler systems and enclosed in aerosol cage. All of our forklift operators are trained and certified. Water is pumped through the system via an on-site fire pump. The ESFR system is connected to the public water supply system. Our fire pump and sprinkler systems are inspected annually by an outside independent company. \n\n\n\nThe five-year accident history:\n\n\n\nLawson's McCook facility has no history of accidental releases. Lawson Products, Inc. certifies in the RMP submission to the EPA that during the past five years, no accidental releases have occurred involving regulated flammable substances from the warehousing of aerosol products.\n\n \n\nThe emergency response program: \n\n\n\nLawson Products, Inc. has an emergency response plan which details procedures to follow in response to an accidental release and other emergencies. The plan that satisfies the requirements for contingency planning and/or notification procedures under the Illinois Toxic Substances Disclosure to Employees Act, OSHA Hazard Communication Rule and Illinois Chemical Safety Act. This plan has been shared with McCook Fire department and the Cook County (Cook Suburban) LEPC. Personnel are trained as emergency coordinators and emergency responders. Our plan is tested on a regular basis through exercises and drills. Some of these drills are coordinated with the McCook Fire Department. All drill participants are asked to provide comment on suc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059602,
      "SummaryText": "cesses and failures during the process. If necessary, plan changes are made and republished. The plan must be reviewed minimally, on an annual basis.  \n\n\n\nWe also provide current SDS' to these agencies as part of the Tier II annual inventory reporting requirement. \n\n\n\nThe facility emergency response plan provides guidance to include local emergency responders such as police, fire, and rescue as appropriate.\n\n\n\nThe Lawson Products, Inc. McCook distribution center meets the National Fire Protection Association Code on the Manufacture and Storage of Aerosol Products (NFPA 30B). This facility has been designed with early suppression fast response (ESFR) sprinkler system to minimize any fire incident. \n\n\n\nIn the event of an emergency affecting the local community, Lawson Products, Inc. will work closely with local, county and state agencies to help ensure public safety. These agencies take the lead in informing the public on appropriate actions in the event of an emergency.\n\n\n\nEmployees of Lawson Products, Inc. Mc Cook DC are trained and instructed to evacuate through the nearest exit in the event of a release, fire or other evacuation. Employees are not responsible for any action required to contain a release or to extinguish a fire. \n\n\n\nPlanned changes to improve safety:\n\n\n\nPlanned changes to improve safety at the facility include: \n\n\n\n1)    Emergency evacuation drills twice a year. \n\n2)    Planned refresher training on Chemical Spill response & clean-up (2016 - triennial)\n\n3)    Hazardous Communication Training (Annual)\n\n4)    Annual review of JSA's (job safety analyses)\n\n5)    Continuation of regular site inspections and audits by safety committee, management team, and both internal & external auditors (ISO & insurance consultants).\n\n6)    Continuation of scheduled required training mandated by Federal, State, Municipal agencies, as well as Insurance providers and Lawson Mandated trainings. \n\n"
    }
  ]
}