{
  "FacilityID": 1000045522,
  "FacilityName": "Cold Storage Solutions IV Inc.",
  "FacilityStr1": "230 Kenneth Welch Drive",
  "FacilityStr2": null,
  "FacilityCity": "Lakeville",
  "FacilityState": "MA",
  "FacilityZipCode": "02347",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25023",
  "LEPC": "Lakeville LEPC",
  "FacilityLatDecDegs": "41.881632",
  "FacilityLongDecDegs": "-70.939384",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cssfreezers.com",
  "FacilityEmailAddress": "tom@cssfreezers.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Thomas Parenteau",
  "OperatorStr1": "310 Kenneth Welch Drive",
  "OperatorStr2": null,
  "OperatorCity": "Lakeville",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02347",
  "OperatorZipCodeExt": null,
  "RMPContact": "Thomas Parenteau",
  "RMPTitle": "President",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000226025",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-08-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-08-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-08-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056784,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000045522,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000057727,
          "ProcessID": 1000056784,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000069369,
          "ProcessID": 1000056784,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000569369,
          "ProcessID": 1000056784,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045522,
      "SummaryText": "The purpose of the Cold Storage Solutions Risk Management Program is to assist with the prevention of accidental releases of toxic and flammable substances that can cause harm to the public, facility employees, and to the environment.\n\n\n\nCold Storage Solutions' Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68.  The stationary source is the ammonia refrigeration system located at Cold Storage Solutions 230 Kenneth Welch Drive, Lakeville, MA.  It is owned and operated by Cold Storage Solutions Inc.  The only Risk Management Program regulated substance at this facility is anhydrous ammonia, which is classified as a toxic substance, liquified under pressure.  \n\n\n\nThis facility is a cold storage warehouse/food distribution facility.  The refrigeration system in this facility has an inventory of approximately 15,000 pounds of anhydrous ammonia stored on site in two separate ammonia refrigeration systems.  System 1 is 8,000 lbs and System 2 is 7,000 lbs.  This process does not meet the requirements of Program 1.  It is subject to OSHA's Process Safety Management Standard.  Thus, this Risk Management Plan has been developed to meet the EPA Program 3 Level of Compliance.\n\n\n\nThis Risk Management Program Manual has been developed by HCG Associates on behalf of Cold Storage Solutions, Inc. specifically to prevent or mitigate accidental releases associated with the storage and use of anhydrous ammonia at the Cold Storage Solutions facility. As noted in specific sections, portions of this Plan, including technical details associated with anhydrous ammonia operations were prepared by American Refrigeration Company, Inc., of Andover, Massachusetts. This manual was developed to meet the requirements of the Risk Management Plan regulations and is available to government agencies and the public for review.\n\n\n\nCold Storage Solutions operates the 230 Kenneth Welch Drive facility on an approximately 13-acre indu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045522,
      "SummaryText": "strially zoned parcel in Lakeville, Massachusetts (see Figure 1). The site is situated approximately 2.5-miles north of Assawompsett Pond, the public drinking supply for the City of Taunton, .47 miles southwest of Rt. 495, an interstate highway which averages 50,000 vehicles per day, .32 miles south of a CSX freight rail line, and 2.6 miles north of Assawompset Elementary School.\n\n\n\nAccidental Release Prevention Policy\n\nCold Storage Solution's 230 Kenneth Welch Drive facility adheres to a comprehensive fourteen volume Process Safety Management Program developed to assist in preventing the accidental discharge or release of anhydrous ammonia.  The RMP also works concurrently with the OSHA Process Safety Management program under 29 CFR 1910.119.  CSS employees and management staff participate in both regulatory safety programs in order to maintain an accident free work environment.\n\n\n\nEmergency Response Program\n\nCold Storage Solutions has developed a comprehensive emergency response policy that was developed and meets established criteria.  The plan has been provided to the Local LEPC and Lakeville Fire Department.  Included within this program are coordinated annual emergency response drills with the Lakeville Fire Department, as well as internal evacuation and notification employee drills.  Employee training is focused on topics such as:  Ammonia Properties and Emergency Response, Respiratory Protection, Process Safety Management, Hot Works Program, Ammonia Detection Devices, Atmospheric Monitoring, CPR/First Aid, and Emergency Action Plan Implementation.\n\n\n\nProcess Overview\n\nThe process is the standard refrigeration cycle.  Anhydrous Ammonia is utilized as a primary refrigerant, with the only substance within the system being Anhydrous Ammonia.  The process causes the ammonia to boil into a gas and then cool into a liquid, repeating the process continuously.  The refrigeration system lowers the liquid pressure to lower the boiling point and then evaporates the ammo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045522,
      "SummaryText": "nia within the system using room air as the heat source.  The system then compresses the ammonia into a high pressure temperature and cools the gas until such time as it condenses.  The condensed liquid is pumped into a low pressure side of the system where the pressure is lowered and the cycle repeats itself.  The ammonia changes states form to a liquid-gas-liquid cycle.  Anhydrous Ammonia does not change chemically, and it is not consumed or released during the refrigeration cycle.  Ammonia continually recirculates throughout the system.\n\n\n\nManagement & Prevention Program\n\nCold Storage Solutions has developed a management system that will oversee the implementation of the Risk Management Program.  This implementation will be overseen by the following team of employees:\n\n\n\nMr. Thomas Parenteau will have overall responsibility for the development, implementation, and integration of the program.  Assistance for program supervision is provided by the Safety Director and the Facilities Maintenance Manager, with ultimate responsibility lying with the Facility Manager.\n\n\n\nScope & Commitment\n\nThe focus of the Management Program is on tracking, reporting, and documenting the operation and maintenance of the Ammonia refrigeration system.  This is required in order to insure a minimal risk to the community, provide a sphere of safety to the environment, our employees, and the facility.  Operations of the Cold Storage Solutions facility comply with all aspects of the Process Safety Management Program.\n\n\n\nCSS Management is committed to the implementation of the Risk Management Program and views it as a vital aspect and integrated part of daily operations.  CSS Management has provided the support and resources to insure the successful implementation of the identified procedures on an ongoing basis.  Furthermore, Cold Storage Solutions realizes that it is of the utmost importance to convey not only its commitment, but further yet a committed culture of safety to its employees, s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045522,
      "SummaryText": "upervisors, and business partners.  This will be established in the following manner:\n\n*through verbal instruction upon employee hiring\n\n*by strict enforcement of CSS practices, procedures, and safety programs relative to the operation and maintenance of the ammonia refrigeration systems.\n\n*through corporate management examples\n\n*through recognition of exceptional employees that excel in the RMP\n\n*through emergency response training and drills\n\n*Steps such as these demonstrate the unwavering commitment of Cold Storage Solutions corporate management in requiring employee participation, and compliance with the RMP     program.\n\n\n\nAccident Prevention Program\n\nThis Cold Storage Solutions facility follows the Environmental Protection Agency Risk Management Plan under 40 CFR 68, and OSHA's 29 CFR 1910.119 Process Safety Management Program.  The documentation requirements of these two programs have been consolidated in the documenting and record filing process with both federal agencies.\n\nThe Accident Prevention Program documents and records are kept as identified in each element of the program.\n\nThe following topics identify the practices and procedures Cold Storage Solutions has adopted:\n\n*Process Safety Information\n\n*Process Hazard Analysis\n\n*Operating Procedures\n\n*Training\n\n*Mechanical Integrity\n\n*Management of Change\n\n*Pre-Startup Review\n\n*Compliance Audits\n\n*Incident Investigations\n\n*Employee Participation\n\n*Hot Works\n\n*Contractors\n\n\n\nAccident History\n\nThis is a new process with no Risk Management Plan reportable accidents in the last five years.\n\n\n\nPlanned Changes to Improve Safety\n\nOngoing Employee Awareness and Training have been implemented.  Furthermore, Cold Storage Solutions has implemented OSHA's Process Safety Management Program.\n\n\n\nEmergency Response Plan\n\nCold Storage Solutions Emergency Response Plan meets the following criterion:\n\n29 CFR 1910.138  Employee Emergency Plan and Fire Protection Plan\n\n29 CFR 1910.119  Process Safety Management of Highly Hazar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000045522,
      "SummaryText": "dous Chemicals\n\n29 CFR 1910.120  Hazardous Waste Operations and Emergency Response\n\n40 CFR Part 68 Risk Management Program, with specific procedures for notifying public safety agencies, the community, and identified public receptors.\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}