{
  "FacilityID": 1000060817,
  "FacilityName": "Bridgestone APM - Sanborn",
  "FacilityStr1": "6350 Inducon Drive East",
  "FacilityStr2": null,
  "FacilityCity": "Sanborn",
  "FacilityState": "NY",
  "FacilityZipCode": "14132",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36063",
  "LEPC": "Niagara County LEPC",
  "FacilityLatDecDegs": "43.114544",
  "FacilityLongDecDegs": "-078.918740",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 80371448,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bridgestone APM - Sanborn",
  "OperatorStr1": "6350 Inducon Drive East",
  "OperatorStr2": null,
  "OperatorCity": "Sanborn",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14132",
  "OperatorZipCodeExt": null,
  "FTE": 65,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000233936",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-10-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-10-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-10-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-10-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000076005,
      "AltID": "Mafg. Polyurethane Foam",
      "FacilityID": 1000060817,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094152,
          "ProcessID": 1000076005,
          "ChemicalID": 77,
          "Quantity": 41209.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000077187,
          "ProcessID": 1000076005,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000060817,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-10-01 00:00:00",
    "ERTrainingDate": "2016-10-01 00:00:00",
    "CoordinatingAgencyName": "Sanborn Fire Company",
    "CoordinatingAgencyPhone": "7167314616",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060817,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\n\n\nAt Bridgestone APM, we are committed to operating all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have a designed and implemented, including:\n\n\n\n?    A description of our facility and use of substances regulated by EPA's regulation\n\n?    A summary from our assessment of the potential offsite consequences from accidental chemical releases\n\n?    An overview of our accidental release prevention programs\n\n?    A five-year accident history for accidental release chemicals regulated by EPA's RMP Rule\n\n?    An overview of our emergency response program\n\n?    An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public and the environment\n\n?    The certifications that EPA's RMP Rule requires us to provide\n\n?    The detailed information (called data elements) about our risk management program\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nOur facility produces polyurethane foam seat pads and backs for the automotive industry using a variety of chemicals and processing operations.  In our processes, we use the following chemicals that EPA has identified as having the potential to cause significant offsite consequences in the event of a substance release:\n\n\n\nTOXICS\n\n\n\nToluene Diisocyanate (TDI).  Our facility has multiple totes with a capacity of 350 gallons each that contain the TDI.  TDI is a main component of the chemical mixture used to formulate the foam seat pads.\n\n\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060817,
      "SummaryText": "re posed to our employees, the public and the environment by our use of these chemicals.\n\n\n\nKEY OFFSITE CONSEQUENCE ANALYSIS SCENARIOS\n\n\n\nEPA's RMP Rule requires that information about the worst case scenario(s) for the facility be provided.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\n\n\n\n\n\n\n\n\n\n\nWorst-Case Release Scenario(s) Evaluation - Regulated Toxic Chemicals\n\n\n\nThe following is a summary of the worst-case scenario developed for the Sanborn facility RMP.  The tote volume used was 350 gallons.\n\n\n\nA tote rupture was assumed to be the worst-case scenario which would release the tote contents into the chemical storage room secondary containment area surrounding the tote.  The total area of the secondary containment measures 1,300 square feet with a depth of 5.5 inches.  The total area of the secondary containment has a liquid capacity of approximately 4,052 gallons.  The liquid TDI would be contained in the secondary containment area.  The amount of TDI that would be emitted is equal to the volume of TDI in a single tote in the secondary containment surface area at 1 centimeter deep.  The worst-case release scenario assumed that the surface area emissions of the contained TDI would first be released into the enclosed chemical room area before being released to the surrounding area.\n\n\n\nOur Worst-case Release Scenario would be a catastrophic failure of a single 350 gallon tote.  This would involve the involuntary release of up to 350 gallons of TDI to the diked area located inside the chemical room of the facility.\n\n\n\nThe RMP regulations require determining if the toxic endpoint for the worst-case release scenario remains within the facility property boundary or if it goes offsite and possibly impacts public receptors.  The toxic endpoint for TDI listed in 40 CFR 68 Appendix A - Table Of Toxic Endpoints is 0.007 milligrams "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060817,
      "SummaryText": "per Liter (mg/L) (1 ppm).  This airborne concentration is the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing serious health effects or symptoms that could impair an individual's ability to take protective action.\n\n\n\nModeling was performed using the EPA recommended ALOHA (Area Locations Of Hazardous Atmospheres), version 5.4.7 September 2016 air dispersion model to determine potential TDI emissions from the worst-case scenario spill.  The ALOHA model predicted the toxic end point for a catastrophic tote failure that does not go past the Bridgestone APM Plant property perimeter.\n\n\n\n\n\nThe release rate calculated by the ALOHA program was a value of 0.00561 lbs/min.  This release rate rounded to 0.1 lb/min in order to have a release rate that would not be printed as zero by RMP*eSubmit.  The evaporation duration calculated by ALOHA was 60 minutes.  The evaporation duration time was entered as 60 minutes as allowed by RMP*eSubmit.  The toxic endpoint calculated by ALOHA&reg; was determined to be 0.033 miles and was entered in RMP*eSubmit as 0.03 miles.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nWe maintain a number of programs to help prevent accidental releases and ensure safe operation.  The accident prevention programs in place include:\n\n\n\n1.    TDI is received in stainless steel totes\n\n2.    Employees (Material Handlers) that handle the unloading of TDI receive training on truck unloading and storage\n\n3.    Internal checklists are used for every unloading event to help reduce the risk of an accidental release.\n\n4.    Material Handlers are trained in forklift operation for the lifting of totes, transport and placement of the TDI in the chemical storage room.\n\n5.    The chemical room has a 5.5 inch dike for secondary containment.\n\n\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nWe will keep records for all significant acciden"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000060817,
      "SummaryText": "tal chemical releases that occur at our facility.\n\n\n\nThe following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\n\n\n\nWe have not had a significant accidental chemical spill occur at our facility since the facility has opened.\n\n\n\nIn the event that a significant spill does occur, we will conduct a formal incident investigation to identify and correct the root causes of each event.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nWe maintain an integrated contingency plan, which consolidates all of the various federal, state and local regulatory requirements for emergency response planning.  Our program provides the essential planning and training for effectively protecting the workers, the public and the environment during emergency situations.  Furthermore, we coordinate our plan with the local fire department.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAs there has not been any accidental chemical releases from our facility that has caused an offsite impact, we are not required to plan any changes to our program.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCERTIFICATIONS\n\n\n\nBased on the criteria in 40 CFR 68.10, the distance to the specified endpoint for the worst-case accidental release scenario for all processes at our facility is less than the distance to the nearest public receptor.\n\n\n\nWithin the past five years, the process(es) has (have) had no accidental release that caused offsite impacts provided in the RMP rule (40 CFR 68.10(b)(1)).  No additional measures are necessary to prevent offsite impacts from accidental releases.  In the event of fire, explosion or a release of a regulated substance from the process(es), entry within the distance to the specified endpoints may pose a danger to public emergency responders.  Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP Plan.  The undersigned certifies that, to the best of my knowledge, informati"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000060817,
      "SummaryText": "on, and belief formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\n\n\n\n\nSignature:\n\n\n\n\n\nTitle:\n\n\n\n\n\nDate:\n\n\n\n"
    }
  ]
}