{
  "FacilityID": 1000069683,
  "FacilityName": "Finch Paper LLC",
  "FacilityStr1": "1 Glen Street",
  "FacilityStr2": null,
  "FacilityCity": "Glens Falls",
  "FacilityState": "NY",
  "FacilityZipCode": "12801",
  "Facility4DigitZipExt": "2167",
  "FacilityCountyFIPS": "36113",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "43.306944",
  "FacilityLongDecDegs": "-073.641389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 800328754,
  "ParentCompanyName": "Finch Paper Holdings LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Finch Paper LLC",
  "OperatorStr1": "1 Glen Street",
  "OperatorStr2": null,
  "OperatorCity": "Glens Falls",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "12801",
  "OperatorZipCodeExt": "2167",
  "RMPContact": "Sandra LeBarron",
  "RMPTitle": "Director of EHSS",
  "FTE": 829,
  "OtherEPAFacilityID": "NYD002081024",
  "EPAFacilityID": "100000109269",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "55020000500059",
  "SafetyInspectionDate": "2013-05-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-06-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-06-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-06-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 43.30719,
  "FRS_Long": -73.63925,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000087281,
      "AltID": "Pulp prep chlorine",
      "FacilityID": 1000069683,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000088483,
          "ProcessID": 1000087281,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108829,
          "ProcessID": 1000087281,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000608829,
          "ProcessID": 1000087281,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000087282,
      "AltID": "Wastewater treat chlorine",
      "FacilityID": 1000069683,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000088484,
          "ProcessID": 1000087282,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108830,
          "ProcessID": 1000087282,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000608830,
          "ProcessID": 1000087282,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000087283,
      "AltID": "Ammonia",
      "FacilityID": 1000069683,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000088485,
          "ProcessID": 1000087283,
          "NAICSCode": "322121",
          "_desc": {
            "NAICS_CODE": "322121",
            "NAICS_DESCRIPTION": "Paper (except Newsprint) Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108831,
          "ProcessID": 1000087283,
          "ChemicalID": 56,
          "Quantity": 1600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000608831,
          "ProcessID": 1000087283,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000087284,
      "AltID": "Chlorine dioxide",
      "FacilityID": 1000069683,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000088486,
          "ProcessID": 1000087284,
          "NAICSCode": "322121",
          "_desc": {
            "NAICS_CODE": "322121",
            "NAICS_DESCRIPTION": "Paper (except Newsprint) Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108832,
          "ProcessID": 1000087284,
          "ChemicalID": 71,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000608832,
          "ProcessID": 1000087284,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069683,
      "SummaryText": "EXECUTIVE SUMMARY FOR FINCH PAPER LLC\n\nFinch Paper LLC is  a fully integrated pulp and paper mill stretched along the Hudson River in Glens Falls, New York.  Our mill produces more than 240,000 tons annually of premium papers for publishing, advertising, graphic arts, and business office uses, and employs approximately 829 people.\n\n\n\nProtecting the health and safety of our employees, neighbors, and the surrounding environment is our top priority. We have long maintained, and regularly review and update, a comprehensive process safety program to evaluate and reduce any risks associated with the use of chemicals in our manufacturing processes.  One component of these efforts is a risk management program (RMP) that helps manage the risks involved with using hazardous substances at our facility and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule). This document is intended to satisfy the executive summary requirement of the RMP rule and to provide the public with a description of our RMP.\n\n\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\n\n\nProtecting the health and safety of our employees and neighbors, and of the surrounding environment, is our top priority, and we have a comprehensive program in place to reduce any risks associated with our manufacturing processes.\n\n\n\nOur risk management program consists of three elements:\n\n\n\nHazard Assessment and Reduction.  We regularly assess the risks associated with the use of chemicals in our manufacturing processes and seek out ways in which to reduce those risks, be it through the use of alternative materials or process control improvements.\n\n\n\nAccident Prevention.  We engineer and construct our manufacturing processes and equipment to minimize the possibility of accidental chemical releases. We also provide our employees with extensive training in the safe opera"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069683,
      "SummaryText": "tion of those processes and equipment.\n\n\n\nEmergency Response.  Finch Paper has a 25-member certified Hazardous Materials Response Team, consisting of employees from throughout our operations, fully prepared to respond in the unlikely event of an accidental chemical release. We also work closely with our local fire, police, and emergency services agencies to help ensure a well-coordinated, prompt, professional, and prepared response to any emergency at our facilities.\n\n\n\nOur internal emergency communications program ensures that all supervisors and employees in areas affected by an inadvertent chemical formation or leak are warned and evacuated, if necessary, and immediate steps are taken to evaluate and stop the leak. The external procedure sets forth a plan to notify neighbors, police, firefighters, ambulance services, public officials and the news media.\n\n\n\n2.  Regulated Substances\n\n\n\nThe federal RMP rule requires manufacturers to file an RMP report if they use, manufacture, or store any one of 140 RMP-regulated chemicals beyond a threshold quantity established by the EPA.  Finch Paper uses three of these 140 chemicals in quantities regulated by the rule:\n\n\n\nAnhydrous ammonia, which is used in our pulping operation\n\n\n\nChlorine dioxide, which is used in our bleaching operation\n\n\n\nChlorine, which is used as a disinfectant in our pulp prep area and for process control in our wastewater treatment plant.\n\n\n\n3. Offsite Consequence Analysis\n\n\n\nFinch Paper has conducted offsite consequence analyses to determine how the public and the environment could be impacted in the unlikely event of an accidental release of any of the regulated substances used by Finch Paper.  Following the recommendations given to us during a multi-media inspection of our facility by the EPA in May 2013, we have identified one highly unlikely worst case scenario involving these substances, as well as alternative release scenarios for each of the chemicals.\n\n\n\nUnder the worst-case scenario, we are re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069683,
      "SummaryText": "quired to identify the vessel or pipeline that holds the largest quantity of one of the regulated chemicals, and to assume that this vessel or pipe fails, releasing its entire contents within a 10-minute period.  Absolutely no consideration can be given to the many safety control mechanisms that are in place to protect against such an accident.\n\n\n\nWe are also asked to determine the distance to the toxic endpoint of such a release.  The toxic endpoint is the concentration at which nearly all people can be exposed to the chemical for up to an hour without experiencing serious health effects.\n\n\n\nAlthough the likelihood of such a release occurring is highly remote, EPA has required analysis of the worst-case scenario to help support a dialogue between the facility and the community on release prevention.\n\n\n\nThe alternative release  scenarios, although still highly unlikely, are considered to be more realistic than the worst-case scenario. In these scenarios, EPA allows us to take into consideration the many active and passive mitigation measures in use at our facilities, because EPA states \"the assumption that both passive and active mitigation measures fail when such measures are specifically designed and installed to mitigate catastrophic releases is unrealistic.\"\n\n\n\nThe following summarizes Finch Paper's offsite consequence analyses:\n\n\n\nOur worst case scenario is a rupture in an 80,000 gallon chlorine dioxide storage tank that leads to a release of 668,000 lb of chlorine dioxide solution (approximately 8,000 lb.of chlorine dioxide at 1.2% wt%) into the diked area surrounding the storage tank. As required by the rule, we assumed the entire contents of the tank would be released within ten minutes under worst-case weather conditions. Given this scenario, the resulting release may reach offsite receptors. \n\n\n\nAlternative release scenarios.  The following descriptions represent more realistic, although still highly unlikely, alternative release scenarios for each of our "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000069683,
      "SummaryText": "RMP-regulated chemicals:\n\n\n\nChlorine. This scenario assumes that the unloading valve on a one ton chlorine cylinder ruptures. We calculated that it would take approximately 10 minutes for all the chlorine to be released from a cylinder, and that the resulting cloud may reach offsite receptors. Sensors are in place in the area to detect a leak and activate an alarm. \n\n\n\nChlorine Dioxide. This scenario assumes that a purge valve to the atmosphere is open in error, and that chlorine dioxide solution is released to a containment dike, allowing chlorine dioxide solution to be released over a 38 minute period before a Finch Paper employee can safely stop the leak. Sensors are in place in the area to detect a leak and activate an alarm. It is estimated that the resulting cloud may reach offsite receptors.\n\n\n\nAnhydrous Ammonia. This scenario assumes that a 1.5\" pipe carrying liquid ammonia from the pulp mill to the power plant ruptures, allowing ammonia to be released over a 30 minute period before a Finch Paper employee can safely stop the leak. In reality, such a release would likely activate safety devices on the ammonia railcar that would reduce, if not stop, the flow of ammonia. These safety mechanisms were disregarded for this scenario, however, in order to meet EPA's requirements that the release extend off site, if possible.  Sensors are also in place along the pipe, at the unloading station and at the power plant to detect a leak. It is estimated that the resulting cloud may reach offsite receptors.\n\n\n\n4.  Accidental Release Prevention Program and Chemical-specific Prevention Steps\n\n\n\nWe have always believed that safety is the highest priority.  Beginning in 1992, we formalized this belief into a prevention program that complies with the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) rule.  For Finch Paper, the prevention program requirements for EPA's RMP rule are nearly identical to the PSM rule.  The following sections b"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000069683,
      "SummaryText": "riefly describe the elements of our prevention program that address the RMP rule requirements. \n\n\n\n4.1  Prevention program\n\n\n\nOur accident prevention program consists of the following 12 elements:\n\n\n\n1. Process safety information.  We maintain a variety of technical documents, including an emergency preparedness plan, to help ensure that our employees and local emergency responders know about the hazards associated with our facility.  These documents address (1) physical properties of the hazardous substances we handle, (2) operating parameters for our equipment, and (3) design basis and configuration for our equipment.  We ensure that this process safety information is available to all our employees.\n\n\n\n2. Process hazard analysis.  We work with an independent consultant to perform and periodically update process hazard analyses (PHAs) of our covered processes to help identify process hazards and make recommendations that might improve the safe operation of the process.  A multidisciplinary team is assembled to analyze the hazards of our processes.  This team includes personnel with engineering and process operating experience and a leader with PHA experience. The team systematically addresses the hazards associated with operation of the equipment in the covered process areas. The team then prepares a written report describing the results of the analysis, including a list of recommendations.  Responsibility for resolving the recommendations is assigned to area personnel, and, when appropriate, changes to enhance the safety of the process are implemented.  Each analysis is revisited at least every 5 years to ensure it is current.\n\n\n\n3. Operating procedures.  Our process engineers, operators, and managers work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures are used to train employees and serve as reference guides for appropriate actions to take during both no"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000069683,
      "SummaryText": "rmal operations and process upsets.  Operating procedures include:  (1) steps for safely conducting activities, (2) applicable process safety information, such as safe operating limits and consequences of process deviations, and (3) safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs.\n\n\n\n4. Training.  We train workers to safely and effectively perform their assigned tasks.  Our training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Oral reviews are used to verify that an employee understands the training material before the employee can begin or resume work in the process.\n\n\n\n5. Mechanical integrity.  We maintain our process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  Our mechanical integrity (preventive maintenance) program includes (1) an inspection and testing program to help identify equipment deterioration and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meet the strict design standards required for service in our processes.\n\n\n\n6. Management of change.  We evaluate and specifically approve all proposed changes to chemicals, equipment, technology, and procedures to help ensure that the change does not negatively affect safe operations. All changes other than replacement-in-kind (e.g., replacing a valve with an identical valve) must be approved through the full management of change program.  This helps ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000069683,
      "SummaryText": "notified of the changes.\n\n\n\n7. Pre-startup review.  We recognize that new or newly modified processes are historically more likely to be involved in accidental releases.  Therefore, we perform safety reviews of new or modified processes before placing them into service to help ensure their safe operation.  This review confirms that: (1) construction and equipment are in accordance with design specifications, (2) adequate safety, operating, maintenance, and emergency procedures are in place, (3) employee training has been completed, and (4) for a covered process, a PHA has been performed if the process is new or management of change requirements have been completed if an existing process has been modified.\n\n\n\n8. Compliance audit.  One of the cornerstones of an effective prevention program is a regular, thorough assessment.  We audit our covered processes every 3 years to be certain our prevention program is effectively addressing the safety issues of our operations.  We assemble an audit team that includes personnel knowledgeable in the PSM and RMP rules and in our process designs, and this team evaluates whether the prevention program satisfies the requirements of these two rules and whether it is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n\n\n9. Incident investigation.  We investigate all incidents that could reasonably have resulted in serious injury to personnel, the public, or the environment so that similar accidents can be prevented in the future.  We train our employees to identify and report any incident requiring investigation.  An investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process improvements are implemented.\n\n\n\n10. Employee participation.  We have a "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000069683,
      "SummaryText": "written employee participation program for covered processes to help ensure that the safety concerns of our workers are addressed.  We encourage active participation of personnel in the prevention program activities of all processes at the facility.  Employees are consulted on and informed about all aspects of our accidental release prevention program.\n\n\n\n11. Hot work permits.  We have a hot work permit program to control spark- or flame-producing activities that could result in fires or explosions in our facility.  We reviewed OSHA's fire prevention and protection requirements and created a hot work permit form to comply with these requirements.  Personnel who are to perform hot work are required to fill out the form.  The appropriate supervisor reviews the completed form before work can begin.  Training in the use of the hot work permit form is included in our safe work practices orientation.\n\n\n\n12. Contractors.  We have a program in place to help ensure that contractor activities at our facility are performed in a safe manner.  This program reviews the safety record of all our contractors to help ensure that we hire only contractors who can safely perform the desired tasks.  We explain to the contract supervisors the hazards of the processes on which they and their employees will work, our safe work practices, and our emergency response procedures.  The Contractor is required to ensure that training has been performed for each of their employees who will work at the facility before that worker begins work at our facility.  And finally, we periodically review contractors' training documents and work performance to help ensure that safe practices are followed. \n\n\n\n 4.2  Chemical-specific prevention steps\n\n\n\nIn addition to the required prevention program elements, we have implemented safety features specific to the hazardous substances used at our facility.  The following paragraphs describe some of these safety features.\n\n\n\nChlorine dioxide.  Chlorine dioxide is pr"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000069683,
      "SummaryText": "oduced at the facility in a chlorine dioxide generator.  As soon as it is generated, it is dissolved in water for storage and use in the bleaching process.  Only a small amount of pure chlorine dioxide exists; almost all of the chlorine dioxide at the facility is in the solution storage tanks.  The tanks are located inside a containment dike that can hold the entire contents of one of the tanks.  The tanks are inspected regularly for any sign of deterioration, such as corrosion.  Also, there are detectors in the area that would detect a release of chlorine dioxide and activate an alarm to alert operators to a problem.  Emergency response equipment is available, and personnel are trained to respond to a release.  Personnel could isolate any release from the piping or equipment with manual isolation valves.\n\n\n\nChlorine.  Chlorine is supplied in 1-ton cylinders that are approved by both the Department of Transportation and the Chlorine Institute.  Chlorine is fed through a short length of tubing into process piping.  In the pulp prep area, the chlorine flows into large streams of process water, where it is mixed and diluted.  In the wastewater treatment area, the chlorine flows into a large stream of wastewater, where it is mixed and diluted.  Treatment of wastewater with chlorine is performed only occasionally.  In both locations, the chlorine is stored and used inside buildings that are equipped with a scrubber capable of absorbing the contents of a full cylinder of chlorine.  In addition, we have installed permanently mounted chlorine sensors at both locations to alert operators of even small chlorine leaks.\n\n\n\nAnhydrous ammonia.  Anhydrous ammonia is supplied in 80-ton railcars that are approved by the Department of Transportation.  Ammonia is fed through a short length of flexible hose into process piping.  From there, it is transferred to the pulp mill and to the power house.  In the pulp mill, small quantities of ammonia are fed into process streams where it is "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000069683,
      "SummaryText": "consumed.  In the power house ammonia is mixed with a large quantity of water where it is mixed and diluted.  If a release occurs in the ammonia piping or hose, the excess flow valve in the railcar will reduce, if not stop, the flow into the atmosphere.  Also, the ammonia unloading area is always monitored in the control room by video cameras set up outside, so that operators can quickly respond to a release through remotely operated block valves.\n\n\n\n5.  Five-year Accident History\n\n\n\nWe have reviewed the facility's accident history.  This history indicates continuous safe operation of chemical processes over the last 5 years.  \n\n\n\n6.  Emergency Response Programs\n\n\n\nWe have a written emergency response program to help safely respond to accidental releases of hazardous substances.  The emergency response plan includes procedures for:\n\n\n\nInforming the LEPC about accidental releases that could reasonably result in offsite consequences\n\n\n\nProviding proper first aid and emergency medical treatment for accidental human exposure to hazardous substances\n\n\n\nControlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\n\n\n\nInspecting and maintaining emergency response equipment\n\n\n\nReviewing and updating the emergency response plan\n\n\n\nWe have a team that is trained to respond to emergency situations, and the Plant Manager is in charge of coordinating emergency actions.  All of our personnel are trained in evacuation procedures.  The Environmental Control Manager is responsible for notifying the Warren County Local Emergency Planning Committee (LEPC) of the emergency situation, and the LEPC is responsible for notifying the public, if necessary.\n\n\n\nThe written emergency response plan complies with other federal contingency plan regulations [e.g., OSHA regulation 29 CFR 1910.120(a)]. Finch Paper currently has one professional employee participating in the Warren County LEPC, ensuring a regular dialogue with local emergency"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000069683,
      "SummaryText": " planners.\n\n\n\n7.  Planned Changes to Improve Safety\n\n\n\nWe constantly strive to improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees.  There are currently no major projects for safety improvement that have reached the planning stage."
    }
  ]
}