{
  "FacilityID": 1000014355,
  "FacilityName": "Ashland Water Treatment Plant",
  "FacilityStr1": "1630 Cleveland Ave",
  "FacilityStr2": null,
  "FacilityCity": "Ashland",
  "FacilityState": "OH",
  "FacilityZipCode": "44805",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39005",
  "LEPC": "Ashland County LEPC",
  "FacilityLatDecDegs": "40.881361",
  "FacilityLongDecDegs": "-082.287250",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 20644100,
  "ParentCompanyName": "City of Ashland",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Ashland",
  "OperatorStr1": "206 Claremont Ave",
  "OperatorStr2": null,
  "OperatorCity": "Ashland",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44805",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Hunter",
  "RMPTitle": "Director, Water Treatment",
  "FTE": 13,
  "OtherEPAFacilityID": "ODH98061824",
  "EPAFacilityID": "100000117401",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-04-25 00:00:00",
  "DeRegistrationEffectiveDate": "2011-04-22 00:00:00",
  "AnniversaryDate": "2015-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.87929,
  "FRS_Long": -82.29063,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017947,
      "AltID": "Chlorine",
      "FacilityID": 1000014355,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018267,
          "ProcessID": 1000017947,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021272,
          "ProcessID": 1000017947,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521272,
          "ProcessID": 1000017947,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014355,
      "SummaryText": "                                                                         Executive Summary\nThis facility uses chlorine as required by federal and state regulations to reduce the risk of diseases.  Chlorine is an effective destroyer of pathogens in water.  Our employees and their families live here and we are all dedicated to the safe operation of our facility.\n\nPolicy:  Safety of employees and the public are of primary concern.  As a part of the public service sector, we are committed to protecting the public and the environment.  Our programs include an aggressive preventative maintenance program, extensive training and coordination with local emergency response personnel to efficiently react to an emergency.\n\nDescription of the Facility:  We treat the drinking water for our area.  Part of the process requires insuring that disease-causing pathogens do not cause outbreaks of illnesses in the public.  Chlorine is used to kill bacteria and other pathogens in our process.\n\nOffsite Consequence Analysis of a Release: In accordance with the EPA rules, an anlaysis of the impact distance in the case of a release of all chlorine connected to this system was performed.  This analysis was made using the EPA methods and guidance available April 14, 1999.  Stored chlorine not connected to the system and determined to not be at reasonable risk was not included.  This model includes a release of all chlorine connected, failure of all safety systems and unfavorable weather conditions.  The model predicts the area, which could be affected by a little as 1/10 of the concentration of gas, which is considered immediately dangerous to life and health.  A circle was generated which ignores wind direction.  This circle is 1.3 miles in diameter.\n\nAn additional release scenario was modeled.  In this case the accident used was believed to be more likely and more realistic weather conditions were used.  We assumed that a valve on one of the chlorine tanks malfunctioned and the full tank empt"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014355,
      "SummaryText": "ied in 1 hour.  This gave a diameter of potential impact of 0.1 miles.\n\nOur system includes automatic alarms and we have procedures in place to respond to emerency situations.\n\nThere are strict licensing requirements to be a plant operator.  In addition to our on-site training and safety procedures, the EPA and OSHA rules regulate our activities.\n\nAs part of the requirements of this EPA programs, we carefully reviewed our accident history for the last 5 years and we found that we have operated without a reportable chlorine related incident.  We are dedicated to safety and our record proves it.\n\nIn case of an emergency, our personnel will work with local fire department responders and the Local Emergency Planning Committee.  We have training every year for our people and we coordinate with the fire department on a regular basis.  Although we take extensive precautions to prevent a chlorine release, we firmly believe in having a plan in case of an emergency.  This is the same philosophy, which leads to fire drills and first aid training.\n\nWe are constantly looking for methods to improve.  As part of this PSM/RMP program we performed an extensive self-evaluation with the assistance of a professional consultant.  We did find some areas where we could do better such as providing a site map to the fire department so they could better respond.  This and other areas of possible improvement are being addressed.  To insure safety, we have instituted a new procedure to perform a safety review of all mechanical or procedural changes."
    }
  ]
}