{
  "FacilityID": 1000044495,
  "FacilityName": "BIC Consumer Products Manufacturing Co., Inc.",
  "FacilityStr1": "565 BIC Drive",
  "FacilityStr2": null,
  "FacilityCity": "Milford",
  "FacilityState": "CT",
  "FacilityZipCode": "06461",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09009",
  "LEPC": "Milford LEPC",
  "FacilityLatDecDegs": "41.223056",
  "FacilityLongDecDegs": "-073.097778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "BIC Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BIC Consumer Products Manufacturing",
  "OperatorStr1": "565 BIC Drive",
  "OperatorStr2": null,
  "OperatorCity": "Milford",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06461",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Sullivan",
  "RMPTitle": "Area Mgr Facilities E&S",
  "FTE": 138,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000130976",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-12-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 41.21668,
  "FRS_Long": -73.09281,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054949,
      "AltID": "Lighter Fuel Operations",
      "FacilityID": 1000044495,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055787,
          "ProcessID": 1000054949,
          "NAICSCode": "339999",
          "_desc": {
            "NAICS_CODE": "339999",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066916,
          "ProcessID": 1000054949,
          "ChemicalID": 107,
          "Quantity": 184000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000566916,
          "ProcessID": 1000054949,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044495,
      "SummaryText": "BIC Consumer Products Manufacturing Co., Inc.\n\n565 Bic Drive, Milford, Connecticut\n\n\n\nRisk Management Plan\n\nExecutive Summary\n\n\n\n\n\nSource and Process Description\n\n\n\nBIC Consumer Products (BIC) manufactures lighters at 565 BIC Drive, Milford, Connecticut.  The lighter manufacturing building is bordered by public roads, commercial and industrial properties. BIC's Lighter Manufacturing consists of lighter production and supporting engineering and administrative operations.  Production operations at the lighter manufacturing facility include plastic and metal component manufacture, product assembly, packaging, storage and shipping.  Lighters are filled with liquefied petroleum gas (LP gas) fuel during the assembly process.  The primary component of the lighter's LP gas fuel is isobutane, a substance regulated under EPA Accidental Release Prevention provisions. In 2009, BIC completed significant upgrades to the isobutane unloading and filling process, storage tanks, piping and piping network as well as installation of additional gas monitoring devices and fire protection systems.\n\n\n\nThe LP gas is stored in tanks located in a secure outdoor tank farm. A Liquid Transfer System pumps the LP gas from three (3) aboveground storage tanks (one 10,000 gallon, and two 18,000 gallon ASTs) through underground pipelines to lighter assembly machines in the building.  The lighter assembly machines are located in specially designed rooms dedicated to lighter assembly.  After assembly, lighters are moved via forklift, pallet-jack or conveyor to quality assurance, storage and packaging operations located elsewhere in the building.  Pallets of packaged lighters are then loaded onto trucks for shipment.\n\n\n\nSummary of Major Hazards\n\n\n\nThe ability to produce a clean burning, stable flame is one of the properties that makes isobutane an ideal fuel for lighters.  Although its flammability can be a useful property, large quantities of isobutane can also pose a safety hazard in the unlikely even"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044495,
      "SummaryText": "t of an uncontrolled accidental release during storage or processing.  An uncontrolled release from a container or pipeline may result in an accumulation of flammable concentrations of gas which could result in a fire or explosion if an ignition source is present.  This concern has resulted in the development of numerous Federal, State and local government regulations, as well as codes and standards from organizations such as the National Fire Protection Association (NFPA) which are designed to help ensure the safe storage, processing and use of LP gases such as isobutane.\n\n\n\nConsequences of Failure to Control the Hazards\n\n\n\nIn accordance with EPA Risk Management Program requirements, BIC has evaluated the potential consequences of the failure to control the hazard described above.  This evaluation required analyses of a prescribed Worst Case Scenario and a possible Alternative Release Scenario.  The distance to endpoint and the area affected by each scenario were determined using computer-modeling software provided by EPA.  The purpose of these analyses was to assess the off-site impact of these hypothetical events.\n\n\n\nAs prescribed by EPA, the Worst Case Scenario considers an unmitigated release of the entire contents of BIC's largest isobutane storage tank when filled to its maximum allowable capacity (85%). The Worst Case Scenario then assumes that 10% of the released LP gas participates in a subsequent vapor cloud explosion.  Since the facility is located in a developed area, this computer-modeled Worst Case Scenario would have some off-site effects.  There are no schools, hospitals, recreational areas or environmentally sensitive areas within the affected area (prescribed endpoint).  However, the analysis suggests that a limited number of residential and commercial properties could be affected.\n\n\n\nThe Alternative Scenario considers an accidental release of one supply/return gas line break (from one tank to the building, and back to the tank). BIC calculated an"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044495,
      "SummaryText": " Alternative Scenario assuming that approximately 250 pounds of isobutane would be released from approximately 700 feet of schedule 80 piping as a result of a gas line break. There are two emergency shutoff valves (one before the piping enters the ground, and one on the return line to the tank), which will limit the amount of isobutane released to approximately 250 pounds. If the released gas were to mix with an appropriate quantity of air and also encounter an ignition source, a potential vapor cloud fire could result.  The results of the consequence analysis suggest minimal off-site impact, if any.  Due to a limitation of the computer model used, endpoint distances of less than 0.1 miles cannot be directly calculated. There are no residences, schools, hospitals, recreational areas or environmentally sensitive areas within the affected area (prescribed endpoint).\n\n\n\nExplanation of How Releases are Prevented and Steps Taken to Address Hazards\n\n\n\nBIC Consumer Products has been manufacturing lighters in the current facility since 1977 without a single incident involving a release of isobutane with off-site consequences.  This is one of many statistics that reflect a continuous corporate commitment to the safety and well-being of BIC employees and the community.\n\n\n\nPrevention of accidental releases at the facility is accomplished not only through compliance with EPA's Accidental Release Prevention provisions and other Federal and State regulations, but through application of long-standing corporate philosophies and initiatives which help support safe operations.  For example, BIC's strong commitment to product quality results in continuous improvement of our manufacturing operations including state-of-the-art process design and control and preventative maintenance.  BIC's extensive in-line quality testing of every lighter not only guarantees safe and reliable operation of the product by the consumer, but also provides an additional measure of safety for the manufacturi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044495,
      "SummaryText": "ng operations. \n\n\n\nBIC's corporate commitment to safety and sound environmental management is translated into action by a full-time staff of  highly trained Environmental, Health and Safety (EH&S) professionals who service all BIC facilities.  BIC's EH&S staff, along with lighter production staff, administer several programs which contribute to release prevention including safe work practices, employee training, preventative maintenance, process design and numerous administrative controls designed to ensure that any safety concerns are identified and addressed.\n\n\n\nSafe work practices are documented in written operating procedures for production and maintenance personnel.  Employee training is comprehensive, including targeted training in relevant, job-specific work practices as well as overview and awareness training in the various components of BIC's Risk Management Program.  Training, which is often a mix of on-the-job and classroom is conducted and documented by competent, experienced personnel.  Employee competency and understanding is assessed.  \n\n\n\nPreventative maintenance programs focus on inspection and maintenance of process components including tanks, pumps, valves, controls, instruments and safety systems.  In addition to helping ensure safe and reliable operation, the results of this program are used to identify opportunities for system improvement.\n\n\n\nNumerous safety systems and controls have been incorporated into isobutane processing and lighter manufacturing operations.  These include redundant pressure regulators, various excess flow detection and shutoff devices, an extensive gas detection system, several ventilation systems, fire suppression systems and control of potential electrical ignition sources.  A variety of sensors and interlocks provide process control and rapid, automatic response to releases or threats of releases.  These responses include fuel shutoff, system shutdown, activation of fire suppression systems and facility evacuation.\n\n\n"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044495,
      "SummaryText": "\nAmong BIC's administrative safety programs is the Management of Change Program, which requires a very detailed safety assessment and approval process for any significant change to equipment or safety systems associated with isobutane processing.  BIC's Contractor Safety Program is designed to ensure that contractors, including LP gas delivery drivers, are also trained in relevant BIC operating and safety procedures.\n\n\n\nBIC conducts a Process Hazard Analysis at regular intervals and as needed.  This detailed, critical analysis of equipment, procedures, process parameters and potential deviations are used to identify opportunities for incremental safety improvements.\n\n\n\nResponse Action in the Event of a Release\n\n\n\nBIC has implemented a written Emergency Plan which establishes detailed procedures for addressing potential emergencies including fires, explosions, accidental releases, power failures, natural disasters, bomb threats, civil disturbances, and medical emergencies. The plan designates a Facility Emergency Coordinator who is responsible for implementing the plan during an emergency.  The plan also provides for emergency specific training of all facility personnel.  Emergency response to fires, explosions, releases and other incidents at the facility have been coordinated with outside agencies through formal agreements.  Site visits and joint training exercises have been conducted with Milford Fire Department firefighters in order to familiarize Fire Department staff with BIC facilities and emergency procedures.\n\n\n\nEmergency response steps that may be implemented in the event of a release of isobutane include manual and/or automatic activation of fire suppression systems, shutoff devices, ventilation systems and alarm systems.  Other planned procedural actions range from simple leak repair by maintenance personnel to coordinated evacuation of off-site areas and coordinated response activities with State and City emergency response organizations.  Although not d"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000044495,
      "SummaryText": "iscussed in detail for purposes of this brief summary, BIC maintains numerous safety systems, sensors, process interlocks and emergency procedures designed to provide safe and efficient response to emergencies."
    }
  ]
}