{
  "FacilityID": 1000068235,
  "FacilityName": "Woodbridge Corporation",
  "FacilityStr1": "827 Graham Drive",
  "FacilityStr2": null,
  "FacilityCity": "Fremont",
  "FacilityState": "OH",
  "FacilityZipCode": "43420",
  "Facility4DigitZipExt": "4077",
  "FacilityCountyFIPS": "39143",
  "LEPC": "Sandusky County LEPC",
  "FacilityLatDecDegs": "41.354444",
  "FacilityLongDecDegs": "-083.078056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 833265994,
  "ParentCompanyName": "Woodbridge Holdings Inc.",
  "Company2Name": null,
  "CompanyDUNS": 161659883,
  "Company2DUNS": 161659883,
  "OperatorName": "Woodbridge Corporation",
  "OperatorStr1": "827 Graham Drive",
  "OperatorStr2": null,
  "OperatorCity": "Fremont",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43420",
  "OperatorZipCodeExt": "4077",
  "FTE": 140,
  "OtherEPAFacilityID": "OH0000868505",
  "EPAFacilityID": "100000155878",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-02-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-02-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-02-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-02-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.35438,
  "FRS_Long": -83.07857,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085517,
      "AltID": "Polyurethane Foam",
      "FacilityID": 1000068235,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106833,
          "ProcessID": 1000085517,
          "ChemicalID": 77,
          "Quantity": 125000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000086759,
          "ProcessID": 1000085517,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000053635,
              "Process_NAICS_ID": 1000086759,
              "SafetyReviewDate": "2018-01-08 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "API653",
              "FR_Comments": null,
              "HazardReviewDate": "2018-01-08 00:00:00",
              "ChangeCompletionDate": "2018-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-02-13 00:00:00",
              "TrainingReviewDate": "2018-02-13 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Online training for exempt employees",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Written testing for online training",
              "MaintenanceReviewDate": "2018-02-13 00:00:00",
              "EquipmentInspectionDate": "2017-09-13 00:00:00",
              "EquipmentTested": "TDI Area Monitors",
              "ComplianceAuditDate": "2018-02-13 00:00:00",
              "AuditCompletionDate": "2018-12-31 00:00:00",
              "IncidentInvestigationDate": "2018-01-12 00:00:00",
              "InvestigationChangeDate": "2018-03-23 00:00:00",
              "MostRecentChangeDate": "2018-02-13 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000054341,
                  "PreventionProgram2ID": 1000053635,
                  "ProcessChemicalID": 1000106833
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068235,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-02-13 00:00:00",
    "ERTrainingDate": "2018-01-06 00:00:00",
    "CoordinatingAgencyName": "Fremont Fire Department",
    "CoordinatingAgencyPhone": "4193324131",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068235,
      "SummaryText": "EPA's RISK MANAGEMENT PLAN EXECUTIVE SUMMARY FOR FREMONT PLANT\n\n\n\n1. Accidental release prevention and emergency response policies.\n\n\n\n    The Fremont Plant, as part of the Woodbridge Group of companies, believes the health and safety of its employees and the protection of the natural environment, should be of the utmost concern in the operation of its business.  We are committed to operating and maintaining all of our processes in a safe and responsible manner.\n\n\n\nIt is our policy to:\n\n\n\n    * Comply with all applicable laws, regulations, and standards. \n\n\n\n    * Review and assess our operations for the purpose of making health, safety & environmental improvements.\n\n\n\n        Our complete Health, Safety & Environmental policy statement,signed by our Plant Manager, is posted in the lobby of our facility.\n\n\n\n    We use a combination of prevention programs and emergency response planning, which are described later in this document,to help ensure the safety of our employees and the public as well as protection of the environment.  Our Plant Manager has overall responsibility for ensuring that our facility operates in a safe and reliable manner.  This responsibility includes overseeing the implementation of the elements of our risk management program.  To ensure that our risk management program is appropriately developed and implemented, our Plant Manager has assigned the role of RMP coordinator to a staff member with the background, training, and experience necessary to manage the program.  The RMP Coordinator, acting with the authority delegated directly from the Plant Manager, is responsible for coordinating the development, implementation and integration of the RMP elements as is required under Section 68.15 of the RMP rule.\n\n\n\n2. The stationary source and regulated substances handled.\n\n\n\n    The primary purpose of the Fremont Plant is to produce polyurethane foam seat cushions for the automotive industry. The foam is made by high pressure mixing of chemicals immediately prior to "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068235,
      "SummaryText": "pouring the mixture into a mold that is attached by carrier to a continuously moving line.  The mold moves through a curing oven.  Upon exiting the oven, the foam pads are removed from the mold, crushed, trimmed and prepared for shipment to customers.  Toluene Diisocyanate (TDI), which is regulated by EPA's risk management program rule, is one of the reactants required to manufacture polyurethane foam.  TDI is received at the plant by tanker truck.  It is stored in 2 tanks located in the contained bulk storage tank room.  The TDI is then transferred to the process utilizing a computer-controlled system.\n\n\n\n    Access to the site is restricted to authorized facility employees, management personnel, and contractors.  The maximum amount of TDI that can be stored at this facility is 125,000 pounds.\n\n\n\n3. Off-site consequence analysis scenarios.\n\n\n\n    EPA's RMP rule requires that we provide information about the worst-case release and alternative release scenario's for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.\n\n\n\nWorst case release scenario:\n\n\n\n    The methodology used to determine the distance to the worst case scenario toxic endpoint as established by the RMP rule were the algorithms and tables contained within in EPA's Offsite Consequence Analysis Guideline document, as employed using EPA's RMPComp software program. Meteorological conditions of 1.5 m/s wind speed, 101 degrees F release temperature, and an atmospheric stability classification of \"F\" were input to the model per EPA RMP specifications. An urban environment was assumed due to the characteristics of the local terrain.\n\n\n\n    The worst case scenario assumes a catastrophic failure of the maximum capacity storage tank full of TDI inside the building, discharging its entire contents of 75,790 pounds, as is stipulated in the RMP rule.  The release temperature (10"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068235,
      "SummaryText": "1 degrees F) is assumed to be equivalent to the maximum ambient temperature experienced in the area in the most recent three year period. There is containment in the tank area (i.e., a dike) which would contain such a release within a 1,250 square foot area.  For the worst case scenario, the modeled distance to the RMP-specified toxic endpoint concentration of 0.007 mg/l is 0.4 miles (2,112 feet) from the release location.\n\n\n\nAlternative case release scenario:\n\n\n\n        The selected alternative release scenario involves an assumed rupture of a nominal two-inch diameter pipe that is connected to the vessel maximum quantity TDI storage vessel described above under the worst case scenario. The release duration was estimated as a maximum of ten minutes before the release would be isolated and neutralized. The same, maximum release temperature of 101 degrees F as per the worst case scenario was assumed, as was the same 1,250 square foot containment dike. RMPComp was used to estimate the TDI release and evaporation conditions based on the assumed temperature, maximum liquid height in the vessel (3.5 feet), and maximum vessel storage pressure (17.7 psia). RMP-suggested meteorological conditions were assumed (3.0 m/s wind speed and an atmospheric stability classification of \"D\"). For the alternative release scenario, the modeled distance to the RMP-specified toxic endpoint concentration of 0.007 mg/l is 0.1 miles (528 feet) from the release location.\n\n\n\n        For both the worst case scenario, potential exposures to the toxic endpoint concentration of 0.007 mg/l include several residential structures, commercial structures, and one correctional facility.  For the alternative case scenario, exposures are limited to commercial structures surrounding the facility.\n\n\n\n4. Prevention Program\n\n\n\n    We take a systematic, proactive approach to preventing accidental releases of chemicals.  Our management systems for our TDI process address each of the key features of successful preve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068235,
      "SummaryText": "ntion programs that meet or exceed RMP Prevention Program Level 2 requirements as detailed in 40 CFR, Part 68, Subpart C, including:  \n\n\n\nSafety Information\n\n\n\nHazard Review\n\n\n\nOperating Procedures\n\n\n\nTraining\n\n\n\nMaintenance\n\n\n\nCompliance Audits, and\n\n\n\nIncident Investigation\n\n\n\n    These listed individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we conduct business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n\n\n5. Five-year accident history.\n\n\n\n    We have not had any TDI releases that qualify for listing in the EPA's required five-year accident history report.  \n\n\n\n6. The emergency response program.\n\n\n\n    We maintain an integrated contingency plan, which consolidates the various federal, state and local regulatory requirements for emergency response planning.  Our program provided essential planning and training for effectively protecting workers, the public and the environment during emergency situations.\n\n\n\n    We have coordinated our program with the local emergency planning committee and the fire department.  A representative of the fire department periodically visits this plant to discuss how we are prepared to respond to a release of TDI.  \n\n\n\n7. Planned changes to improve safety.\n\n\n\n    At this time we are continuing to maintain and enhance our current safety management systems, including all aspects of accident prevention and response.  We also anticipate improving our training programs in the area of specific maintenance tasks."
    }
  ]
}