{
  "FacilityID": 1000082109,
  "FacilityName": "Sunrise Growers - Oxnard 2",
  "FacilityStr1": "2640 Sturgis Rd",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.200893",
  "FacilityLongDecDegs": "-119.139076",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.sunrisegrowers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sunopta",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sunrise Growers - Oxnard 2",
  "OperatorStr1": "2640 Sturgis Road",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93030",
  "OperatorZipCodeExt": null,
  "RMPContact": "Fred Ruiz",
  "RMPTitle": "Company Engineer",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000242579",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-11-15 00:00:00",
  "SafetyInspectionBy": "Oxnard Fire Department (CUPA)",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-09-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "200",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102536,
      "AltID": null,
      "FacilityID": 1000082109,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000103809,
          "ProcessID": 1000102536,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128478,
          "ProcessID": 1000102536,
          "ChemicalID": 56,
          "Quantity": 16100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000628478,
          "ProcessID": 1000102536,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082109,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThis Executive Summary contains Sunrise Growers - Oxnard 2's administrative and operational programs to prevent ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is ammonia.  The following topics are addressed in this Executive Summary:\n\n\n\n-    Accidental Release Prevention and Emergency Response Policies\n\n-    Stationary Source and Regulated Substance\n\n-    Hazard Assessment Summary\n\n-    Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n-    Five Year Accident History\n\n-    Emergency Response Program\n\n-    Planned Changes to Improve Safety\n\n\n\nThe following Data Elements sections are attached as part of the EPA RMP submittal:\n\n\n\nSection 1:    Registration Information\n\nSection 2:    Toxics - Worst Case Release \n\nSection 3:    Toxics - Alternative Release \n\nSection 4:    Flammables - Worst Case Release (NOT APPLICABLE)\n\nSection 5:    Flammables - Alternative Release (NOT APPLICABLE)\n\nSection 6:    Five Year Accident History \n\nSection 7:    Prevention Program 3 Component \n\nSection 8:    Prevention Program 2 Component (NOT APPLICABLE)\n\nSection 9:    Emergency Response Component\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nSunrise Growers - Oxnard 2 is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process equipment at the facility.  \n\n\n\nSunrise Growers - Oxnard 2's management is also committed to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. Sunrise Growers - Oxnard 2's safety and environmental policies as they relate to the ammonia refrigeration system are administered by the Company Engineer, who conducts periodic inspections of the facility to ensure compliance, and oversees t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082109,
      "SummaryText": "he entire safety and environmental programs, including the California Accidental Release Prevention Program. It is Sunrise Growers - Oxnard 2's policy to implement appropriate control measures to prevent possible releases of regulated substances.  Unforeseeable, if such a release does occur; the facility will implement the Emergency Action Plan and contact appropriate authorities and safely evacuate the facility.  \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Sunrise Growers - Oxnard 2 facility is located at 2640 Sturgis Road in Oxnard, California, which is approximately 1.5 miles south of Highway 101 and 0.2 miles east of Highway 1-Pacific Coast Highway. The area immediately surrounding the facility is urban with a mixture of industrial facilities and farming.\n\n\n\nThe primary business of the Sunrise Growers - Oxnard 2 facility is to provide refrigerated warehousing and storage for fruit and vegetable products. In order to conduct operations, the facility employs two co-located ammonia systems: the System 1 - Cooler system and the System 2 - IQF Freezer system. The System 1 - Cooler system has a maximum charge of 8,100 pounds and the System 2 - IQF Freezer system has a maximum charge of 8,000 pounds of ammonia as a refrigerant, respectively. System 1 and System 2 are considered co-located as the System 2 - IQF Freezer system has a compressor located within the System 1 - Cooler system's engine room.  The systems, consisting of piping, valves, and equipment, cycle ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cooling food products. Typical operating conditions range from 0 - 5 psig on the low pressure side of each system to 130-150 psig on the high side of each system.  \n\n\n\nThe systems at Sunrise Growers - Oxnard 2 were constructed in accordance with all applicable federal, state, and local regulations, codes, a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082109,
      "SummaryText": "nd standards including mechanical codes, fire codes, and building codes in place at the time of construction.\n\n\n\nHAZARD ASSESSMENT SUMMARY\n\n\n\nResult Summary\n\n\n\nA Hazard Assessment was completed for the facility on July 15, 2019 to determine the potential impacts to the surrounding community due to an accidental release of ammonia.  The Hazard Assessment modeled three scenarios: a worst case release scenario, an alternative case scenario for the System 1 - Cooler system, and an alternative case release scenario for the System 2 - IQF Freezer system.\n\n\n\nSince the previous Hazard Assessment study, there have been no significant changes made to each ammonia refrigeration system.  \n\n\n\nIn order to determine the impacted population around the facility, the potential for exposure to concentrations exceeding the EPA Toxic Endpoint (EPA TE) value was investigated.  For ammonia, the EPA TE concentration for a one hour averaging time is 200 ppm.  The furthest EPA TE distance reached by an ammonia cloud from the facility is 0.70 miles in the worst case scenario where the entire contents of the System 2 - IQF Freezer LTPR-1 Recirculator are released in 10 minutes.  The alternate release scenario is a small hole (0.25\") in a pipeline that reaches 0.09 miles from the facility for the System 1 - Cooler System and 0.10 miles from the facility for the System 2 - IQF Freezer system.\n\n\n\nTable 2 displays the estimated residential populations that are at risk of being exposed to concentrations exceeding EPA TE.  The \"at risk\" population represents the number of people within the radius of the maximum downwind distance reached by the plume in all wind directions. The population was estimated using 2010 census tract data from CAMEO - MARPLOT Version 5.1.1 Mapping Software.  When calculating population densities for large areas which encompass many tracts, the accuracy is rated as good; however, for small areas that encompass only two or three partial tracts, the population data may be skewe"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000082109,
      "SummaryText": "l employees in the facility and alert the local emergency responders (fire department). The operator of the facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nEPA's RMP Program regulation defines \"accident\" as the following:\n\n\n\n\"An unanticipated emission of a regulated substance or other extremely hazardous substance into the ambient air from a stationary source. \n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nAn investigation into the facility's accident history during the Process Hazard Analysis study performed on June 19, 2019, revealed that there have been no releases of ammonia over the past five years (June 2014 - June 2019) that exceeded the Federal Reportable Quantity of 100 pounds in 24 hours or that meet the CalARP reporting criteria for the Five-Year Accident History as specified above. In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazard Analysis study, performed on June 19, 2019, generated mitigation measures (recommendations) to improve safety at Sunrise Growers - Oxnard 2 facility located in Oxnard, California. The mitigation measures include additional training, key maintenance related tests/inspection, and enhanced emergency response policies and procedures.  The Sunrise Growers - Oxnard 2 safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. Continue to train all employees in the facility Safety P"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000082109,
      "SummaryText": "d due to the unequal distribution within the tract.\n\n\n\nThe EPA requires that facilities also consider \"Environmental Receptors\" defined as: areas such as national or state parks, forests, or monuments; wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas.  There were no environmental receptors located within the furthest downwind distance of 0.70 miles.\n\n\n\nWorst Case Release Result Summary\n\n\n\nThe worst case release scenario is a release of the largest quantity of a regulated substance from a vessel or process line failure that results in the greatest distance to a specified endpoint in ten (10) minutes. Since the largest vessel in the system, the System 2 - IQF Freezer LTPR-1 Recirculator, can hold the entire ammonia charge for the IQF Freezer System (7,986 pounds), the entire capacity of the vessel is assumed to be released.  \n\n\n\nSince the LTPR-1 unit is located inside, passive mitigation was considered for the worst case release scenario.\n\n\n\nOnly the first 10 minutes of the release for solutions under ambient conditions is required for estimating the off-site consequences, because the toxic component in a solution evaporates fastest during the first few minutes of a spill, when its concentration is highest.  EPA allows a facility to use typical meteorological conditions at the facility.  For the worst case scenario, a wind speed of 1.5 meters/second and stable conditions (F class stability) were used, to find the distance to the toxic endpoint of 200 ppm in a rural area.\n\n\n\nThe release rate of ammonia from LTPR-1 to the outside environment in the worst case release scenario is 319 pounds per minute.  \n\n    \n\nEPA's \"General Guidance on Risk Management Programs for Chemical Accident Prevention\", March 2009, Figure E-2 and Equation 5 located in Appendix E.3.4-Log Log Equation-Anhydrous Ammonia-Alternate for D Stability, Wind Speed 1.5 meters per second, was used to find the downwind distance for the worst release scenario. This release reache"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000082109,
      "SummaryText": "s 1.08 miles off site and may impact population receptors (other industrial/commercial businesses and resident). No environmental receptors were affected by this potential release.  The population receptors that may be affected by this worst case release scenario are listed in Table 3 and shown as the outer pink circle in Figure 2.\n\n\n\nAlternative Release Result Summary\n\n\n\nThe alternative release scenarios presented are similar to the worst case in that they are liquid releases.  The alternative release scenarios chosen for this facility are those of 0.25 inch diameter orifices in each system leading to airborne releases, representative of a pump seal leak, a gasket rupture, pinhole leak due to corrosion, flange seal leak, valve bonnet seal leak, etc.  It is assumed that this release is from the high side of each system; therefore at a maximum pressure of 130 psig for the System 1 - Cooler system and 150 psig for the System 2 - IQF Freezer system.  The release scenarios are assumed to last for approximately 60 minutes each, which considers the refrigeration systems' emergency shutdown capabilities.\n\n\n\nEPA's \"General Guidance on Risk Management Programs for Chemical Accident Prevention\", March 2009, Figure E-3 and Equation located in Appendix E.3.4-Log Log Equation-Anhydrous Ammonia-Alternate for D Stability, Wind Speed 3.0 Meters per Second, was used to find the downwind distance for the alternate release scenarios. The release reaches 0.09 miles off site for the System 1 - Cooler system and 0.10 miles off site for the System 2 - IQF Freezer system and may impact population receptors (other industrial/commercial businesses only).  No environmental receptors were affected by these potential releases.  The potential releases are shown as inner light blue  and inner dark blue circles in Figure 2 and Figure 3.  The population receptors that may be affected by these alternative case release scenarios are listed in Table 3 and shown per ID in Figures 2 and 3.\n\n\n\nA complete"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000082109,
      "SummaryText": " and thorough description of the release scenarios can be found in the 2019 Hazard Assessment report.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Sunrise Growers - Oxnard 2 ammonia systems have many safety features.  Much of the safety of the systems are inherent in the policies and procedures that govern the operation of the systems. \n\n\n\nThe PSM / RMP / CalARP program ensures that all security and safety procedures are addressed.  Staff is trained in operation, maintenance and emergency procedures related to the operation of the ammonia systems.  All pressure vessels in the ammonia systems are equipped with relief valves that vent to the atmosphere at a certain pressure set point. A preventative maintenance program assures that equipment is maintained and serviced on a regular schedule and that worn, aging, or defective components are replaced as required to maintain equipment in good operating condition.  Controls and safety devices are inspected regularly to ensure proper operation.\n\n \n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Sunrise Growers - Oxnard 2 facility is a non-responding facility has an emergency action plan (EAP) in effect. This Plan was designed to meet the following objectives:\n\n\n\n1. To save lives.\n\n2. To minimize and avoid injuries.\n\n3. To protect the environment.\n\n4. To minimize property damage.\n\n\n\nThe operator of the facility maintains a safety committee whose members are the designated emergency coordinators for the facility. The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan is \n\nreviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM / RMP / CalARP regulations.\n\n\n\nIn the event of an ammonia emergency, Sunrise Growers - Oxnard 2 plans to evacuate al"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000082109,
      "SummaryText": "lan/Programs.\n\n\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n\n\n3. Continue employee involvement through safety team participation.\n\n\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n\n\nEPA RMP CDX SUBMISSION NOTES\n\n\n\nItem numbers 7.8a, 7.9, 7.11.a, and 7.11.b have been intentionally left blank. These programs (Management of Change, Pre-Startup Review, Incident Investigation) are in place and will be implemented when required. The Emergency Action Plan outlines notification procedures and reporting procedures in the event of an emergency, which could include fire, ammonia release, blackout, and earthquake.\n\n"
    }
  ]
}