{
  "FacilityID": 1000059620,
  "FacilityName": "GH Foods",
  "FacilityStr1": "1730 Eastridge Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Riverside",
  "FacilityState": "CA",
  "FacilityZipCode": "92507",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.933229",
  "FacilityLongDecDegs": "-117.300976",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Renaissance Food Group, LLC",
  "Company2Name": "Calavo Growers",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Calavo Growers",
  "OperatorStr1": "1141A Cummings Road",
  "OperatorStr2": null,
  "OperatorCity": "Santa Paula",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93060",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ariana Centeno",
  "RMPTitle": "Maintenance Planner",
  "FTE": 400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199965",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-11-18 00:00:00",
  "SafetyInspectionBy": "County of Riverside DEH (CUPA)",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-09-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-09-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074508,
      "AltID": "Main Plant Refrigeration",
      "FacilityID": 1000059620,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000075670,
          "ProcessID": 1000074508,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092138,
          "ProcessID": 1000074508,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000592138,
          "ProcessID": 1000074508,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059620,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe facility uses ammonia as a refrigerant within a closed system.  Ammonia is a hazardous substance that must be handled properly in order to prevent accidental releases and injuries.  It is the policy of GH Foods to conduct all operations (including the ammonia refrigeration system) in a safe manner.  This policy extends to all employees and contractors at the facility.  GH Foods implements this policy towards chemical and general safety through on going employee participation, training, written operating procedures, maintenance, inspections, safety committee meetings, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  In the event of an ammonia accident, the facility has an Emergency Action Plan to notify the appropriate authorities and safely evacuate the facility.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nGH Foods is located at 1730 Eastridge Avenue, in Riverside, California.  The facility is approximately 0.6 miles west of Interstate 215 and 1.0 miles south of Interstate 215 / Highway 60.  The area immediately surrounding the facility is urban with a mixture of commercial and industrial areas.  The facility restarted up the system in September 2016, and began facility operations is March 2017.\n\n\n\nThe primary business of the GH Foods facility is to process, store, and distribute perishable food products.  In order to conduct initial operations, the facility maintains a refrigeration system charged with anhydrous ammonia, a regulated substance. The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for the processing, storage, and distribution of produce.  Typical operating conditions range from 38 psig"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059620,
      "SummaryText": " on the low pressure side of the system to 135 psig on the high side of the system.  \n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nAdministrative Measures:\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n\n\n?    EPA's Risk Management Program (RMP);\n\n?    OSHA's Process Safety Management (PSM); and\n\n?    California Accidental Release Prevention Program (CalARP).  \n\n\n\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on site workers.  The following summarizes the key compliance programs that have been implemented by GH Foods to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Safe Work Practices program ensures that GH Foods employees and contractors follow Lockout / Tagout, Hazard Communication, Hot Work (e.g. welding), and Chemical and General Safety Procedures in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\n\n\n\nThe facility also operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\n?    IIAR Bulletin 107, \"Suggested Safety and Operat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059620,
      "SummaryText": "ing Procedures When Making Ammonia Refrigeration Tie ins\"\n\n?    IIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\" \n\n?    IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\n\n?    IIAR, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\"\n\n\n\nEngineering Measures:\n\nThe GH Foods ammonia refrigeration system has many safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.\n\n\n\nOther safety features of the ammonia refrigeration system include: emergency shutdown switches that kill power to the equipment (located outside each Engine Room door and in the Outdoor Equipment Area), relief valves on all pressure vessels, and continuous ventilation (controlled by a thermostat) in the Engine Room to prevent explosions. The facility has also installed ammonia sensors at strategic locations throughout the facility which:\n\n\n\n25 ppm:    Audible and visual alarms activate in the Engine Room.  A visual alarm activates for the building.  Facility personnel evacuate.\n\n\n\n150 ppm:    The king valve shuts off flow to the makeup air handler units or engine room.  The valve group for the refrigerated zones will close at 150 ppm in that area. The emergency exhaust fan switches on in the Engine Room.\n\n\n\n2,000 ppm:     In the Engine Room, a shunt trip activates to shut down power in the Engine Room except for ammonia detectors and ventilation.\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe previous name of this facility was Calavo - Riverside and during the Process Hazard Analysis conducted on August 15, 2016, it was noted that there have been no ammonia releases in the past 5 year"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059620,
      "SummaryText": "s (August 2011 - August 2016) that exceed the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material.  Note, the facility had a minor ammonia release in 2019, but it did not meet the Federal Reportable Quantity of 100 pounds. See the Incident Investigation forms at the facility for more details on this incident.  \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an Emergency Action Plan (EAP) in effect at the facility.  This Plan was designed to meet the following objectives:  \n\n\n\n?    save lives;\n\n?    minimize and avoid injuries;\n\n?    protect the environment; and\n\n?    minimize property damage.\n\n\n\nThe Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM/RMP/CalARP regulations.  Facility personnel receive annual training regarding the emergency procedures.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nA Process Hazard Analysis (PHA) was performed on March 15, 2011, September 9, 2013, and most recently on August 15, 2016.  These studies generated mitigation measures (recommendations) to improve safety at the GH Foods facility located in Riverside, California.  The mitigation measures include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  The GH Foods safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1.    Continue to train all employees in the facility Safety Plan/Programs.\n\n\n\n2.    Continue to have employee involvement in Safety Plan Development.\n\n\n\n3.    Continue employee involvement through safety team participation.\n\n\n\n4.    Continue internal and external safety audits/inspections and impl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000059620,
      "SummaryText": "ement changes as needed. \n\n\n\nDATA ELEMENTS NOTES:\n\nData Element 7.10: GH Foods (Calavo Growers) purchased the facility from the previous owners in 2016, therefore the compliance audit was conducted in 2019.\n\n"
    }
  ]
}