{
  "FacilityID": 1000051267,
  "FacilityName": "Sargento Foods, Inc.",
  "FacilityStr1": "1 Persnickety Place",
  "FacilityStr2": null,
  "FacilityCity": "Plymouth",
  "FacilityState": "WI",
  "FacilityZipCode": "53073",
  "Facility4DigitZipExt": "0350",
  "FacilityCountyFIPS": "55117",
  "LEPC": "Sheboygan LEPC",
  "FacilityLatDecDegs": "43.773099",
  "FacilityLongDecDegs": "-087.999202",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sargento Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 80499973,
  "Company2DUNS": 0,
  "OperatorName": "Sargento Foods, Inc.",
  "OperatorStr1": "1 Persnickety Place",
  "OperatorStr2": null,
  "OperatorCity": "Plymouth",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53073",
  "OperatorZipCodeExt": "0350",
  "RMPContact": "James Zimmerman",
  "RMPTitle": "Facilities Engineer",
  "FTE": 820,
  "OtherEPAFacilityID": "WIR000021097",
  "EPAFacilityID": "100000192935",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-06-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-09-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-09-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-09-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064759,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000051267,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000065884,
          "ProcessID": 1000064759,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000080146,
          "ProcessID": 1000064759,
          "ChemicalID": 56,
          "Quantity": 20060.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000580146,
          "ProcessID": 1000064759,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000051267,
      "SummaryText": "Sargento Foods, Inc., in Plymouth, Wisconsin is home to Sargento headquarters and also houses the main distribution center. Production lines at the plant process a variety of dairy products. Processes conducted at the Plymouth facility include high speed slicing with zip closure packaging, horizontal form/fill/seal shred packaging with zip closures, dices and cubed cheese in bulk packaging, and high speed portion-control packaging of grated dry cheese. This plant is situated on a 65-acre parcel of land near the northwestern limits of the City of Plymouth. Adjacent properties to the south are industrial and commercial, to the west are residential and to the north and east are rural residential.\n\n\n\nThe facility has a basic single-stage mechanical refrigeration system utilizing ammonia as the refrigerant. There are two separate ammonia systems at the facility, with the compressors in two separate mechanical rooms. The original system (referred to as the \"West\" Ammonia Refrigeration System) was constructed in 1993 to 1994, and the new system (referred to as the \"East\" Ammonia Refrigeration System) was constructed in 2005. The systems are completely independent of each other. The total maximum intended inventory of ammonia within the West system at any time is approximately 14,500 pounds, and within the East system is approximately 16,600 pounds.  Both ammonia refrigeration systems were designed and installed in accordance with Wisconsin Administrative Code COMM Chapter 43, ASTM standards and ASHRAE 15. The facility is equipped with alarm and ammonia detection systems, which continually monitor the refrigeration system. Also, Sargento maintenance employees make daily inspections. \n\n\n\nAn offsite consequence analysis was conducted to determine the results of hypothetical worst-case and alternative accidental releases. In view of security concerns, EPA revised the Chemical Accident Prevention Rule to remove the requirement for including offsite consequence data in the Execu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000051267,
      "SummaryText": "tive Summary, which is posted on the EPAs website. Therefore, no offsite consequence data is included in this Executive Summary. The offsite consequence data is included in the Risk Management Plan kept on site and shared with the Local Emergency Planning Committee and area emergency responders.\n\nThe ammonia system at Sargento Foods Plymouth is covered by the Occupational Safety and Health Administration (OSHA) Process Safety Management Plan (PSM) which requires the facility to manage system operations and develop emergency response and accident prevention programs. Sargento Foods developed and implemented a PSM program for the Plymouth facility in 2005. The PSM plan was most recently audited in 2012 and 2015. A Process Hazard Analysis (PHA) conducted in May 2012 covered situations affecting workers inside of the facility, the surrounding community, and the environment. The most recent PHA update was in March 2015. \n\n\n\nSargento Foods is committed to protecting the health and well-being of their employees, the community, and the environment. Employee training programs are in place, including ammonia awareness training and emergency action procedures for all employees, annual training for the spill response teams, annual response training for the maintenance personnel and ammonia system training for the ammonia technicians. Training schedules are handled promptly by the Safety and Technical Training Coordinator. The facility has a chemical labeling program and a spill prevention plan. Outside contractors must follow written contractor policies and receive on-line training before working at the facility. Hot work permits and lockout/tagout procedures are required. \n\n\n\nSargento Foods has never had an accident involving the ammonia system that caused deaths, injuries, property damage, or environmental damage. If an emergency were to occur, the local fire and hazardous response team would be notified and the emergency response procedures would be followed. The facility ha"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000051267,
      "SummaryText": "s an Emergency Action Plan, and emergency drills are carried out several times each year. Each shift has Emergency Response Teams who have been trained in Emergency Action Plan procedures and in coordination with outside response personnel. The Sheboygan County Local Emergency Planning Committee has developed an offsite plan for the ammonia system and is aware of the procedures to follow in case of an emergency release situation. The local response teams are invited to visit the Sargento Plymouth Facility each year. "
    }
  ]
}