{
  "FacilityID": 1000091343,
  "FacilityName": "Clean Harbors of Baltimore, Inc.",
  "FacilityStr1": "1910 Russell Street",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21230",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24510",
  "LEPC": null,
  "FacilityLatDecDegs": "39.271667",
  "FacilityLongDecDegs": "-76.65595",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cleanharbors.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Clean Harbors, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 157793639,
  "Company2DUNS": null,
  "OperatorName": "Clean Harbors of Baltimore, Inc.",
  "OperatorStr1": "1910 Russell Street",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21230",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": "MDD980555189",
  "EPAFacilityID": "100000093276",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-04-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-12-17 10:49:23",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-12-17 10:49:23",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-12-17 10:49:23",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-12-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.2711,
  "FRS_Long": -76.6327,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000113527,
      "AltID": "Tank Storage",
      "FacilityID": 1000091343,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000141840,
          "ProcessID": 1000113527,
          "ChemicalID": 92,
          "Quantity": 70000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000141841,
          "ProcessID": 1000113527,
          "ChemicalID": 125,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000141842,
          "ProcessID": 1000113527,
          "ChemicalID": 4,
          "Quantity": 296000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000114896,
          "ProcessID": 1000113527,
          "NAICSCode": "562211",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000071416,
              "Process_NAICS_ID": 1000114896,
              "SafetyReviewDate": "2019-03-28 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2019-03-28 00:00:00",
              "ChangeCompletionDate": "2019-07-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-04-15 00:00:00",
              "TrainingReviewDate": "2015-04-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-12-08 00:00:00",
              "EquipmentInspectionDate": "2020-12-15 00:00:00",
              "EquipmentTested": "hoses, pumps, valves",
              "ComplianceAuditDate": "2020-06-30 00:00:00",
              "AuditCompletionDate": "2020-06-30 00:00:00",
              "IncidentInvestigationDate": "2015-04-15 00:00:00",
              "InvestigationChangeDate": "2015-07-15 00:00:00",
              "MostRecentChangeDate": "2015-04-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000072165,
                  "PreventionProgram2ID": 1000071416,
                  "ProcessChemicalID": 1000141840
                },
                {
                  "PrimaryKey": 1000072166,
                  "PreventionProgram2ID": 1000071416,
                  "ProcessChemicalID": 1000141841
                },
                {
                  "PrimaryKey": 1000072167,
                  "PreventionProgram2ID": 1000071416,
                  "ProcessChemicalID": 1000141842
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000091343,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-12-03 00:00:00",
    "ERTrainingDate": "2015-01-30 00:00:00",
    "CoordinatingAgencyName": "City of Baltimore Fire Department",
    "CoordinatingAgencyPhone": "4103963597",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091343,
      "SummaryText": "Clean Harbors of Baltimore, Inc.\r\n\r\n1910 Russell Street\r\n\r\n\r\nBaltimore, Maryland\r\n\r\n\r\nClean Harbors of Baltimore, Inc.\r\n1910 Russell Street\r\nBaltimore, Maryland\r\n\r\n\tIntroduction\r\n\r\nClean Harbors owns and operates a RCRA permitted Treatment, Storage and Disposal Facility (TSDF) in Baltimore, Maryland, which may be subject to U.S. Environmental Protection Agency (EPA) regulations governing Accidental Release Prevention (ARP) Requirements: Risk Management Programs under Section 112(r) of the Clean Air Act (40 CFR Part 68).  The TSDF may be subject to these provisions because it is possible that threshold quantities of several specific regulated toxic and/or flammable liquids may be present in greater than threshold quantities.  Under most circumstances Clean Harbors' records indicate that regulated substances are present in concentrations below 1% and/or in less than the threshold quantities specified in the ARP regulation.  This Risk Management Plan (RMP) which is prepared under the EPA's predictive filing provisions has been developed in accordance with the requirements specified under 40 CFR Part 68, Subpart G.  The RMP certifies that Clean Harbors of Baltimore, Inc. has instituted a Risk Management Program that is in compliance with U.S. EPA ARP requirements. \r\n\r\nThe RMP includes an Executive Summary and Data Elements following the format published by U.S. EPA.  This document identifies the applicable corporate policies and risk management systems, including comprehensive accident prevention and emergency response programs.  In addition, this RMP identifies a set of worst case and alternative release scenarios, the potential off-site consequences of those releases, and the facility's five year accidental release history.  This RMP certifies that prevention and emergency response programs are in place so as to minimize risks to workers and the potentially affected public.   \r\n\r\n\r\n\r\n1.0   CLEAN HARBORS RESOURCE RECOVERY  ACCIDENTAL RELEASE AND EMERGENCY  RESPONSE POL"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091343,
      "SummaryText": "ICIES \r\n\r\n1.1\tCorporate Statement \r\n\r\nClean Harbors of Baltimore, Inc. (CHBI) operates a hazardous waste treatment storage and disposal facility (TSDF) in accordance with a RCRA hazardous waste license issued by the Maryland Department of the Environment.  CHBI strives to conduct its business and operations in strict conformity with all applicable laws, and in a safe and responsible manner.  CHBI has always placed the highest priority on the health and safety of its employees and members of the community in which it operates.\r\n\r\nCHBI may be subject to the provisions of the Accidental Release Prevention (ARP) Requirements because several of the regulated toxic and flammable liquids may be present in quantities which exceed the regulatory thresholds for these substances. Accordingly, CHBI has prepared a Risk Management Plan under the U.S. EPA's predictive filing provisions.  CHBI will not exceed the threshold quantities for toxic and flammable gases.\r\n\r\nCHBI's accidental release prevention program involves a unified approach that integrates technologies, procedures and management practices.  The CHBI facility is designed, constructed, inspected, maintained and operated in a manner so as to minimize the risk of exposure to employees and the public to hazardous materials managed at the site, and in conformity with all governmental regulations.\r\n\r\nCHBI has a comprehensive inspection plan which requires daily, weekly, monthly, and annual inspections of its processes, equipment and management practices.\r\n\r\nCHBI has a Contingency Plan which prescribes procedures to be followed in the event of a fire or release at the facility.  The Contingency Plan includes procedures for notifying local, state and federal emergency response officials of incidents, and specifies arrangements which are made with emergency responders to ensure an effective response in the event of an emergency.\r\n\r\nCHBI has a training plan which ensures that each employee receives the training necessary to ena"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000091343,
      "SummaryText": "ble him/her to safely and effectively carry out their job responsibilities.  Included in the facility training plan are training modules which instruct employees on the hazards of the regulated substances stored at the site, the procedures for evacuation from the facility, procedures for responding to releases, and procedures for notification of incidents to both facility personnel and offsite emergency responders.  In addition to the initial training that all employees receive, each employee receives refresher training on an annual basis.\r\n\r\n1.2\tRisk Management System \r\n\r\nClean Harbors of Baltimore has developed a management system to implement and maintain compliance with the Accidental Release Prevention (ARP) and related chemical safety and emergency response programs.  This management system identifies lines of responsibility for the entire program and each of its key elements.  \r\n\r\nClean Harbors of Baltimore, Inc. Management Program\r\n\r\n\tAccidental Release Prevention Program\r\n\r\n\t\tEdmund Romeo, Facility General Manager\r\n\t\tSusan Richardson, Facility Compliance Manager\r\n\r\n\r\nOff-Site Hazard Assessment\r\n   Susan Richardson, Facility Compliance Manager \r\n\r\nPSM Program  (not applicable to facility)\r\n\r\n\t\tJohn Andrews, Environmental Safety Manager\r\n\t\tGary Neault, Process Engineer\r\n\r\n\r\nEmergency Response Program\r\n\r\n\t\tSusan Richardson, Facility Compliance Manager \r\n\r\n\r\n2.0   PROCESS AND SUBSTANCES SUBJECT TO 40 CFR PART 68\r\n\r\nCHBI receives, temporarily stores, consolidates, and ships materials that are classified as hazardous waste under the Resource Conservation and Recovery Act (RCRA).  A review of the records over the past several years indicate that portions of the waste streams may contain greater than one percent of one or more substances regulated under ARP, and may be received in sufficient quantity to result in CHBI storing greater than the applicable threshold quantity.  The substances and maximum concentrations that could be received are listed below:\r\n\r\nFlamma"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000091343,
      "SummaryText": "ble liquids:\r\n        \r\n             Ethyl Ether  (highest concentration = 70%)\r\n             Pentane (highest concentration = 70%)       \r\n        \r\nToxic liquids:\r\n        \r\n             Chloroform       (70%)\r\n                   \r\nNo regulated toxic or flammable gases are present above threshold quantities at the site.  Wastes that may contain more than 1% of any of these regulated substances would be transported to the facility via either enclosed trucks in 55-gallon drums or smaller containers, or in bulk transport vehicles.  These wastes may be temporarily stored on-site and then consolidated with other similarly classified waste streams or they may be directly transferred to other TSDF's for processing.    \r\n\r\n\r\nFlammable wastes are pumped from the drums and consolidated into larger tanks that contain  mixtures that have a NFPA rating of 3 or less.  Therefore, once a regulated flammable substance is pumped into a storage tank it is no longer subject to ARP.  \r\n\r\nToxic substances that are processed are temporarily stored.  The storage vessels are protected from the weather and surrounded by a dike to confine spills. \r\n\r\nThe EPA risk management regulation identifies three levels of requirements.  Program 2 applies to CHBI, since this facility is not subject to OSHA's Process Safety Management program. \r\n\r\n\r\n3.0   Off-Site Hazard Assessment\r\n\r\nFor the purposes of developing and maintaining adequate RMP's, the EPA has defined in its governing rules and guidance a series of modeling methods and assumptions which are to be utilized as administrative guides for planning purposes.  In order to standardize and simplify to a practical level the many factors that can potentially occur in an accidental release situation, some of these assumptions may not take into account the available preventive measures or mitigation methods that would diminish or even eliminate the implied risks that are suggested by \"worst-case\" analyses.  For that reason, both the results for the st"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000091343,
      "SummaryText": "andardized \"worst case\" defined by the EPA methods and an alternative case, which is believed by Clean Harbors to more realistically represent situations that may possibly occur within the lifetime of the facility, are presented and described.  The actual incident history for this facility over the last five years has been reviewed.  No accident has resulted in reportable on-site injury, off-site injury, emergency response, or damage to property or the environment\r\n\r\n3.1\tWorst-Case Release for Toxic Substances.\r\n\r\nAs defined by 40 CFR Part 68, a worst-case release for a toxic liquid is an instantaneous spill of the entire contents of a railcar, taking into account passive mitigation such as a dike and administrative controls that limit the maximum quantity.  Since the Baltimore facility does not process the following six chemicals: isopropyl chloroformate, methyltrichlorosilane, nitric acid, phosphorous oxychloride, phosphorous trichloride, and trimethylchlorosilane, a worst-case railcar release was not performed for those substances.  The worst-case release scenario for the Baltimore facility corresponds to a release from a railcar assumed to be filled with 26,800 gallons of 70% chloroform contained in a 5074 ft2 diked area.  Such a scenario is extremely unlikely because it would require that the integrity of the railcar would fail.\r\n\r\nEPA requires that worst-case analyses be conducted using stability class F and 1.5 m/sec wind speed. Meteorologists have defined six \"atmospheric stability classes,\" A through F, each representing a decreasing degree of turbulence in the atmosphere.  The most turbulent condition is stability A, which is associated with light winds and very strong solar heating.  Stabilities B and C are characterized by progressively weaker solar heating and stronger winds.  Neutral or D stability occurs when winds are strong or when the sky is overcast.  At night the earth's surface cools, causing the lower atmosphere to stabilize and become less tur"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000091343,
      "SummaryText": "bulent.  Stability E (moderately stable) corresponds to partly cloudy conditions with moderate winds.  Stability class F (very stable) represents a very low level of turbulence due to overnight radiational cooling and weak winds.\r\nTo describe the aerodynamic surface roughness for modeling purposes, EPA has established surface roughness categories based on land-use type. 'Urban' surface roughness indicates areas where there are many obstacles, such as industrial buildings, compact residential areas and trees.  'Rural' indicates that there are few buildings and that the terrain is generally flat and unobstructed by trees.  The Baltimore facility and vicinity are urban in nature.\r\n\r\nThe toxic endpoint selected by EPA for toxic substances is the Emergency Response Planning Guideline, Level 2 (ERPG-2), which was developed by the American Industrial Hygiene Association.  An ERPG-2 is \"the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to 1 hr without experiencing or developing irreversible or other serious health effects, or symptoms which could impair an individual's ability to take protective action.\"  \r\n\r\nWorst-case dispersion modeling to determine the distance to toxic endpoint was conducted using the U.S. EPA's RMP*COMP (Version 1.07) software.  RMP*COMP implements the consequence analysis calculations set forth in the EPA's Off-site Consequence Analysis Guidance (OCAG). The resulting emergency response planning zone is defined by a circle with a radius equal to 6.8 miles.  \r\n\r\nThe worst-case planning zone encompasses a resident population of approximately 844,271, based on the 1990 Federal Census, and estimated by applying EPA's LANDVIEW III program.  The potential worst-case planning zone includes schools, public recreation areas and commercial areas.  \r\n\r\n3.2\tAlternative Release for Toxic Substances.\r\n\r\nThe alternative release examined for all of the 18 regulated chemicals corresponds to a slow release"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000091343,
      "SummaryText": "of a 26,800 gallon railcar with 70% chloroform. The unconfined spill was modeled with RMPComp to estimate endpoint distances for the 18 regulated substances that may at some time be present at the site.  The alternative scenario was simulated using meteorological conditions that are typical of the Baltimore, Maryland area. In RMP*Comp, EPA uses meteorological conditions for alternative releases of D stability and a wind speed of 3 m/sec.  Stability Class D represents conditions of neutral stability, or moderate atmospheric turbulence.  Based on climatological data from the Baltimore airport, the average wind speed is about 3 m/sec, providing greater dilution than assumed in RMP*Comp.\r\n\r\nAlternative dispersion modeling to determine the distance to toxic endpoint was conducted using the U.S. EPA's RMP*COMP (Version 1.07) software.  As discussed in Section 3.1, the modeling was performed using the conservative assumption of urban surface roughness. The resulting planning zone is defined by a circle ranging from 0.1 to 0.3 miles, depending on the chemical spilled.  The public area within these radii is limited.  Public receptors within 0.3 miles include residences and commercial areas. No environmental receptors would be affected.\r\n\r\n3.3\tWorst Case Release for Flammable Substances\r\n\r\nThe worst case for flammable substance is defined as a vapor cloud explosion involving the largest  amount of a regulated substance in a single vessel.  The largest vessel containing a regulated flammable substance at the Baltimore facility is a 10,000 gallon tank.  Applying RMP*Comp results in an estimated worst-case endpoint distance of 0.3 miles for ethyl ether (85%).  This zone extends off-site, affecting adjacent commercial areas, but does not impact residential areas.\r\n\r\n4.0   ACCIDENT PREVENTION\r\n\r\nClean Harbors has procedures in place to prevent and mitigate potential releases of toxic and flammable substances.  These procedures are detailed in CHBI's RCRA Part B hazardous waste li"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000091343,
      "SummaryText": "cense.  The procedures include, but are not limited to the following:\r\n\r\n* An inspection program which requires daily, weekly, monthly and annual inspections of process equipment, alarm systems, and management practices, with a procedure for documenting and correcting any deficiencies identified in inspections.\r\n\r\n* A standard operating procedure for the transfer of flammable and combustible liquids.\r\n\r\n* A standard operating procedure for ensuring that incompatible materials are not consolidated together.\r\n\r\n* A waste analysis plan which ensures that the waste received by CHBI conforms to the waste as initially represented by each generator, and that each waste stream is managed correctly.\r\n\r\n* A security plan to prevent unknowing or unwanted access to the facility.\r\n\r\n* A training plan which ensures that each employee at the facility is adequately trained to perform their job duties knowledgeably and safely.\r\n\r\nIn addition, consistent with ARP regulations, Clean Harbors has instituted a level 2 prevention program consisting of the following elements:\r\n\r\n\t  Process Safety Information  including MSDS for regulated substances\r\n\r\n\t\tProcess Hazard Analysis, including a systematic evaluation of potential hazards associated with handling regulated substances and development of recommendations for improving safety\r\n\r\n\t\tOperating Procedures regarding transfer, storage and processing of regulated substances\r\n\r\n\t\tTraining  of workers on operating procedures\r\n\r\n\t\tMaintenance procedures to maintain mechanical integrity of equipment\r\n\r\n\t\tIncident Investigation  to document spills of regulated substances\r\n\r\n    \tCompliance Audits of the prevention program to be conducted every three years.\r\n\r\nAlso included are the following elements of OSHA's PSM program:\r\n\r\n* Management of Change\r\n* Pre-startup Review\r\n* Contractors\r\n* Employee Participation\r\n* Hot Work Permits\r\n\r\n\r\n\r\n5.0   FIVE-YEAR ACCIDENT HISTORY\r\n\r\nDuring the past 5 years (December 2005 to December 2010), there has been no"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000091343,
      "SummaryText": "accident involving any RMP regulated substance that qualifies for reporting under 40 CFR Part 68.  This means that no accident has resulted in reportable on-site injury, off-site injury, off-site evacuation or sheltering in place, or damage to property or the environment.\r\n\r\n\r\n6.0   EMERGENCY RESPONSE PROGRAM\r\n\r\nIt is the policy of Clean Harbors to place the highest priority on employee safety and health and on protection of the community from all plant-induced environmental conditions.  An emergency response plan has been developed which prescribes emergency procedures which the facility will implement in the event of a release or fire at the facility.\r\n\r\nCHBI's emergency response plan is identified as the facility Contingency Plan.  The purpose of this plan is to describe both the hazards associated with the management of waste materials at the facility and the steps which will be taken to minimize the risk associated with each hazard.  By ensuring that proper preventative measures are taken at all times and by providing for emergency response procedures to be followed in the event of any unexpected occurrence(s), CHBI intends to operate its facility in a manner that does not pose a significant threat to public health, safety or welfare of the environment.  CHBI's record in this regard has been exceptional and its overall contribution to the protection of human health and the environment far surpasses the risks associated with the type of activities performed at the facility.\r\n\r\nThe specific elements of CHBI's Contingency Plan include the following:\r\n\r\n* A general description of the facility operations and the types of hazardous wastes handled at the facility.\r\n\r\n* A list of the CHBI emergency coordinators who are responsible for overseeing implementation of the Contingency Plan, and their responsibilities.\r\n\r\n* Criteria for implementing the Contingency Plan.\r\n\r\n* Emergency Response Procedures, including identification and assessment of an imminent or actual emer"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000091343,
      "SummaryText": "gency, response procedures for facility personnel, and notification requirements.\r\n\r\n* A list of emergency equipment.\r\n\r\n* Coordination agreements between CHBI and local and state officials.\r\n\r\n* An evacuation plan.\r\n\r\n* Incident notification procedures, including procedures for, and content of, initial verbal notifications.  CHBI's Contingency Plan includes the names, addresses, and phone numbers of all local, state and federal emergency response organizations and agencies that are to be notified in the event of an emergency.\r\n\r\n\r\n\r\n\r\n7.0   PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nCHBI has organized its management system to effectively address all hazards and potential risks. Personnel training is necessary to support a continual improvement in facility safety.  CHBI's training plan achieves this goal.  These programs are all documented so that needed information about the safe handling of all chemicals present at the facility is available to employees, and can be readily interpreted by emergency response team staff and the Facility Emergency Coordinators when questions arise from public safety officials regarding potential risks to the community.  All of these features of the RMP and the integrated risk management program at this site lead to operations that meet or exceed the state and federal regulatory requirements applicable to the facility's operations."
    }
  ]
}