{
  "FacilityID": 1000045108,
  "FacilityName": "KAAPA Ethanol,L.L.C.",
  "FacilityStr1": "8450 KAAPA Lane",
  "FacilityStr2": null,
  "FacilityCity": "Minden",
  "FacilityState": "NE",
  "FacilityZipCode": "68959",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31099",
  "LEPC": "South Central Regional",
  "FacilityLatDecDegs": "40.483268",
  "FacilityLongDecDegs": "-099.075345",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "kaapaethanol.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 138253161,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Chuck Woodside",
  "OperatorStr1": "8450 KAAPA Lane",
  "OperatorStr2": null,
  "OperatorCity": "Minden",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68959",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tony Beam",
  "RMPTitle": "Plant Manager",
  "FTE": 43,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184267",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-09-03 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Adfministration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-04-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-04-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-04-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-04-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.48333,
  "FRS_Long": -99.08333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055848,
      "AltID": "Denaturant-Natural gas",
      "FacilityID": 1000045108,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056787,
          "ProcessID": 1000055848,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068150,
          "ProcessID": 1000055848,
          "ChemicalID": 155,
          "Quantity": 575000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000057818,
              "ProcessChemicalID": 1000068150,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000057819,
              "ProcessChemicalID": 1000068150,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000057820,
              "ProcessChemicalID": 1000068150,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000568150,
          "ProcessID": 1000055848,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045108,
      "SummaryText": "RMP Executive Summary\n\n\n\n1.    Facility Policy.  KAAPA Ethanol, L.L.C corporate policies place the utmost importance on worker, public, and environmental safety, which is reflected in facility plans and training activities.  The owners, management and employees of the KAAPA Ethanol facility are committed to the prevention of any accidental releases of hazardous materials.  If an accidental release should occur, the facility is prepared to work with the local fire department, Kearney County Emergency Management (Local Emergency Planning Committee), and/or other authorities, to mitigate and minimize the impacts of the release to the public and the environment.\n\n\n\n2.    Facility Information. The primary activity at the facility is the processing of grain into fuel-grade ethyl alcohol.  The ethyl alcohol manufacturing process involves the use of anhydrous ammonia and natural gasoline.  The natural gasoline is referred to as product denaturant and is used to make the ethyl alcohol unfit for human consumption.   \n\n\n\n3.    Five-Year Accident History.  No accidents have occurred within the most recent five-year period. \n\n\n\n4.    Emergency Response.  The emergency response program established by KAAPA Ethanol allows for personnel to respond to accidental releases of regulated substances in the event the release can be controlled using KAAPA Ethanol personnel and equipment in the area.  KAAPA Ethanol has identified additional resources to assist in mitigation, control and disposal of a release.  The local emergency response agencies will be relied upon to inform the public about the release. KAAPA Ethanol has developed an Emergency Action Plan outlining actions taken in the event of an accidental release of regulated substances as well as in the event of natural disasters.  The Emergency Action Plan is provided below for reference.  \n\n\n\n5.    KAAPA Ethanol has an Emergency Response Action Plan (ERAP) in place to respond to prevent and respond to chemical spills on site. The details in the E"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045108,
      "SummaryText": "RAP are provided after the Emergency Action Plan within this Executive Summary. \n\n\n\n6.    Accidental Release Prevention Program.   KAAPA Ethanol, L.L.C. plant has implemented several environmental, emergency, and safety programs at the facility.  These plans are crucial in our everyday operation and procedures.  Daily, weekly, and monthly checks are completed that affect our ability to respond to emergencies, including a Health and Safety Plan.   Spill Prevention, Control and Countermeasure (SPCC) and Storm Water Pollution Prevention (SWPP) plans have been prepared and implemented, with updates completed as needed to ensure compliance and effectiveness.   All implementation is accordance with the applicable regulatory standards and time frames.  KAAPA Ethanol has developed a Prevention Program in accordance with the requirements of 40 CFR Part 68 for a Program Level 3 facility.  The facility conducts weekly and monthly training as part of our normal activities.  Training consists of regulated safety requirements.  A Process Safety Management (PSM) program has been implemented in accordance to regulation.  Natural gasoline (denaturant) is a PSM-applicable chemical mixture on site.  The PSM program covers distillation tanks and piping, and storage tanks utilized for anhydrous ethanol and denatured ethyl alcohol.   Safety inspections are completed regularly, utilizing in-house and outside expertise to conduct.  Periodic reviews are completed on plans and procedures in place, with scheduling for additional training as part of the review process.  As previously mentioned in section 5 of this executive summary, KAAPA Ethanol implements an ERAP as part of the Spill Prevention Control & Countermeasure requirement to prevent and respond to chemical spills on site. In addition, KAAPA Ethanol has a Facility Response Plan (FRP) to respond to chemical spills on site. Both the ERAP and the FRP are regulated under the Oil Pollution Prevention regulation.\n\n\n\n7.    Planned changes to Impr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045108,
      "SummaryText": "ove Safety.  Safety improvements are an on-going process at KAAPA Ethanol.  Periodic evaluations are performed to assess the conditions of the facility.  KAAPA Ethanol has a metal integrity written plan in place to confirm chemical storage tanks are in proper working condition. A preventative system (ER Portal) is also used by KAAPA Ethanol to confirm chemical storage tanks are in proper working condition.\n\n\n\nEMERGENCY ACTION PLAN \n\nI)    Policy Statement: KAAPA Ethanol, LLC believes that its employees are its most important asset, and that their safety and health are among its greatest responsibilities.  Therefore, this Emergency Action Plan has been established in compliance with the OSHA standard, Title 29 CFR 1910.38(a), and posted for all employees.\n\nII)    Purpose: This Emergency Action Plan is intended to ensure the proper response to foreseeable emergencies and where necessary, ensure the orderly evacuation of employees from work locations to a safe area away from conditions that could be immediately dangerous to life and health. \n\nIII)    Responsibility and Authority\n\n   A)    A Program Coordinator has been assigned by the Chief Executive Officer to oversee:\n\n    1)    The development, implementation and ongoing improvement of this Emergency Action Plan. \n\n    2)    Development and posting of the Emergency Action Plan Posters and site exit diagram\n\n    3)    All emergency equipment is inspected at various intervals to ensure proper operation of all emergency equipment.\n\n    4)    Periodic drills of the emergency action plan.\n\n   B)    Visitors\n\n    1)    The following procedure will be followed by all visitors/contractors entering the facility\n\n      (a)    Monday through Friday between 7:30 a.m. and 4:30 p.m. all visitor/contractors will sign in and out at the administrative office ledger.  In the event work schedule starts or continues past normal office hours sign in will be completed at control room check/sign in ledger \n\n      (b)    Monday through Friday between 4:30 p.m. and 7:30 a.m. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045108,
      "SummaryText": "all visitor/contractors will check/sign in and out at the control room ledger\n\n         (i)    Contractors on site are required to supply information as to company name and total number of personnel on site at all times\n\n      (c)    Contractors, if not accompanied by a KAAPA employee, may be given a radio to communicate critical or emergency situations in the event one arises.  This will be determined during project planning, pre-job briefing, or heightened security risk.\n\n      (d)    If an evacuation is required, control room board operator will collect check /sign in ledger, located in control room as a means of identifying contractors on site.  Administrative office will collect check/sign in ledger and gather at the safe gathering location.  A role call will occur, in the event someone is presumed to be missing, attempts will be made through radio communication.  If unsuccessful, wait for emergency services to arrive before reentering the facility.\n\n\n\nSpill Prevention Control & Countermeasure/Facility Response Plan\n\nEMERGENCY RESPONSE ACTION PLAN (ERAP)\n\n\n\nThis ERAP contains a summary of facility information pertinent to responding to a release at the facility.\n\n\n\nThe standard response in the event of a spill involves:\n\nSecure area to prevent ignition sources;\n\nReduce or stop the leak if it can be done easily, and at little risk to personnel (i.e. close a valve);\n\nNotify the site personnel and spill response contractor as necessary, see Table 2;\n\nControl spread of oil to sensitive environments, see Table 3;\n\nInitiate recovery of oil by excavation of contaminated soil or pumping of liquids as appropriate, see     Table 3;\n\nComplete a discharge notification checklist (follows) and initiate spill notification requirements as necessary, reference Tables 4 and 5 for contact information and notification scenarios.\n\nImplement the recommendations and requirements of the Nebraska Department of Environmental Quality (NDEQ) regarding further investigation and cleanup related to soil"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000045108,
      "SummaryText": " and ground water, if impacted;\n\n\n\nTable #1 - Facility Information\n\nGeneral Information\n\nFacility Name:  KAAPA Ethanol, LLC Plant\n\nAddress:  8450 KAAPA Lane\n\nCity:  Minden                          State:  Nebraska                   Zip:  68959\n\nCounty:  Kearney\n\nPhone Number:  (308) 743-2217\n\nQualified Individual\n\nName:  Tim Vogt \n\nTitle:  Environmental/Safety Manager\n\nWork Address:  8450 KAAPA Lane, Minden, Nebraska 68959\n\nHome Address:  1003 10th Street  Gibbon, NE 68840\n\nWork Phone Number:  (308) 743-2217\n\nEmergency Phone Number (Cell):  (308) 293-2991\n\n\n\nTable #2 - Emergency Response Personnel and Duties\n\nOrganization (phone #)    Name    Response Duty\n\n    \n\nKAAPA (on-site) - Cell: 308.293.2991, Tim Vogt; Qualified Individual\n\n    \n\nKAAPA (on-site) - Cell:  308.293.2448, Tony Beam; Team Member\n\n\n\nKAAPA (on-site) - Crew Chief; Equipment Operator and Deployment\n\n\n\n308.384.1616, Safety Kleen; Cleanup, Liquid Pumping, Transport, Disposal\n\n\n\n308.995.8706, Olsson Associates; Assessment, Reporting, Oversight of Cleanup\n\n\n\n402.562.6590, Dewine Mechanical; Piping Repairs\n\n\n\n402.854.2533, Mid-Nebraska Land Developers; Excavation, Transport, Disposal\n\n\n\n\n\nTable #3 - Summary of Response Supplies and Equipment\n\n<Response Equipment;    Quantity/Size/Length;    Location>\n\nAbsorbent booms;    30 - 4\" diameter 100' length;    Maintenance building warehouse, southwest corner \n\nFront End Loader / Mobile Equipment;    1 - 2015 Cat 1 - 2013 Cat (Grains), skid steer, tele handler, scissor lift, extend boom lift;    Distillers Grain Loadout, plant site\n\nSoil for creating berms/drainage diversions;    quantity as needed;    Cultivated and vacant areas on-site\n\nPPE;    Several tyvek suits, pairs rubber boots, face shields, chemical gloves, and Multiple nitrile gloves;    Inside Process Building/Maintenance Building\n\nTransfer Pump;    1 - transfer pump (several);    Maintenance Area or Process Building\n\nVacuum Trucks;    Multiple as needed;    Spill Response Contractor\n\nAdditional Cleanup Materials/Equipment;    As Needed;    Spill Response Cont"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000045108,
      "SummaryText": "ractor\n\nFirefighting Equipment;    8 - nozzle hydrants;    Tank Farm\n\nFirefighting Equipment; 1 - stand pipe;    Silo\n\nFirefighting Equipment; 75 - fire extinguishers';    Throughout facility\n\nFirefighting Equipment; Multiple Fire Hydrants;    Throughout facility\n\nCommunication Equipment; Cell Phones and Intercom System (radio communication, ch3 direct to 911); Throughout the facility (ch3 control room)\n\n\n\n\n\n\n\nTable #4 - Spill Response Notifications\n\n<Agency / Organization;    Phone Number or Address; Circumstances    When to Notify>\n\n\n\nNebraska Department of Environmental Quality    NDEQ\n\nMon - Fri.\n\n8 am to 5 pm \n\n(402) 471-2186\n\n(877) 253-2603\n\n\n\nNebraska State Patrol Dispatch \n\nAfter hours, Weekends, and Holidays\n\n(402) 471-4545 \n\n\n\n    Any of the following:\n\n\n\n(1) Acute emergency situations, such as spills or releases of petroleum products or hazardous substances\n\n\n\n(2) Any oil release that impacts or threatens waters of the state or threatens the public health\n\n\n\n(3) Any release of oil upon the surface of the land  in a quantity that exceeds 25 gallons    Immediately (verbal) \n\n\n\nand Written notification within 15 days of discharge or as requested by the NDEQ\n\n\n\n--\n\n\n\nNational Response Center; 1-800-424-8802 (24-hour number); Discharge reaching navigable waters;    Immediately (verbal)\n\n\n\nEPA Region 7 (Hotline);    (913) 281-0991 (24-hour number); Discharge reaching navigable waters;    Immediately (verbal)\n\n\n\nEPA Region 7 Regional Administrator    \n\nMon - Fri.\n\n8 am to 4:30 pm\n\n913-551-7003\n\n1-800-223-0425\n\n\n\nA single discharge of 1,000 gallons or more; or two or more discharges of 42 gallons or more over a 12-month period    Written notification within 60 days of discharge\n\n\n\n\n\nTable #5 - Other Emergency Contacts\n\n<Agency / Organization; Circumstances to Contact; Phone Number>\n\nKearney County Hospital; Medical Emergency; call 911 first (308-832-1440)\n\n\n\nLocal Emergency Planning Committee (LEPC) - Jeff England - Axtell; In the event of a reportable spill or in case emergency response assistance is requi"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000045108,
      "SummaryText": "red; 308-743-2442\n\n\n\nState Emergency Response Commission (SERC); LEPC would contact SERC if they needed additional emergency response assistance; 402-471-7421\n\n\n\nState Highway Patrol - Troop C Headquarters in Grand Island; Assistance with traffic control rerouting along adjacent highways if necessary in an emergency; 308-385-6000\n\n\n\nNebraska State Fire Marshal (SFM) - Greg Rasmussen (Fuels) and Dave Berkstrom (District C Enforcement); LEPC and local fire department typically initiate notification to SFM as necessary.  SFM requests notification in the event of a major flammable liquids spill, ammonia release, and in the event of an explosion; 308-325-0527, 308-530-5292 (emergency only)\n\n\n\nBNSF - Resource Protection Operation Call Center; In case of emergency that requires stopping rail traffic.  Note:  Facility is on Hastings Sub-Division at Mile Post 195; 800-832-5452\n\n\n\nWeather Report - NOAA Dial-A-Forecast for Hastings, NE;    To receive weather information such as wind speed/direction, forecast for precipitation, and temperatures which may impact emergency response; 402-462-4287\n\n\n\nLocal TV - NTV;    KAAPA is responsible for evacuation of its employees and visitors at the facility.  LEPC and/or local fire department will initiate any requests for evacuations of public outside the bounds of the facility; 308-743-2494\n\n\n\nLocal Radio - KGFW 1340 AM, Y102 FM; 308-698-2100\n\n\n\n\n\n\n\n   \n\n"
    }
  ]
}