{
  "FacilityID": 1000006843,
  "FacilityName": "Emerald Carolina Chemical, LLC",
  "FacilityStr1": "8309 Wilkinson Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Charlotte",
  "FacilityState": "NC",
  "FacilityZipCode": "28214",
  "Facility4DigitZipExt": "9052",
  "FacilityCountyFIPS": "37119",
  "LEPC": "Mecklenburg County LEPC",
  "FacilityLatDecDegs": "35.241389",
  "FacilityLongDecDegs": "-080.981500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 26386107,
  "ParentCompanyName": "Emerald Performance Materials, LLC",
  "Company2Name": null,
  "CompanyDUNS": 619385586,
  "Company2DUNS": 0,
  "OperatorName": "Emerald Performance Materials, LLC",
  "OperatorStr1": "8309 Wilkinson Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Charlotte",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28214",
  "OperatorZipCodeExt": "9052",
  "RMPContact": "J. David Sikes",
  "RMPTitle": "HS&E Manager",
  "FTE": 48,
  "OtherEPAFacilityID": "28214MRCNC8309W",
  "EPAFacilityID": "100000114397",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "07-01V-595",
  "SafetyInspectionDate": "2007-04-11 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-11-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.24119,
  "FRS_Long": -80.9804,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "13",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000008026,
      "AltID": "Formaldehyde",
      "FacilityID": 1000006843,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000008212,
          "ProcessID": 1000008026,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008968,
          "ProcessID": 1000008026,
          "ChemicalID": 1,
          "Quantity": 94000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508968,
          "ProcessID": 1000008026,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006843,
      "SummaryText": "The Stationary Source and Regulated Substances Handled\n\nEmerald Carolina Chemical, LLC, located in Charlotte, NC is a specialty chemical manufacturing facility located eight miles west of downtown Charlotte and three miles east of Belmont in Mecklenburg County, North Carolina.  It is situated on a 74-acre property surrounded by light industry, commercial establishments, and residences.  We manufacture 10 different types of chemical products, 95 percent of which are consumed in the US, and the rest are sold on the international market.\n\nOur products include several chemicals used to solve problem properties of fabrics, so that fabrics are stronger, softer, shrink-free, and release soil easily; have durable press; have no dye migration or bleeding; and can be water repellant and flame retardant.  Other related products strengthen adhesives and paper products.  We also make sulfated oils, which are used extensively in making textile, leather, pulp and paper, paint and coatings, and personal care products.  They are useful as bleaching assistants, lubricants, defoamers, dyeing assistants, emulsifiers, dispersants, rheology modifiers, and emollients.  Much of the sulfated oil chemistry is based on naturally occurring oils which make them easily biodegradable.\n\nAt the Charlotte Plant, we have 48 employees with an annual payroll of $4 million, paying about $100,000 in city and county taxes annually.  Each year, we buy about $25 million in goods and services, and pay about $2 million for utilities and $1.8 million for freight services.\n\nOur plant uses one chemical that brings us under the EPA Risk Management Program (RMP) Rule.  This is a 50% formaldehyde solution, which poses a toxic vapor release hazard under the RMP Rule.  We have one 20,000 gallon storage tank of this solution on-site, which is the minimum practical quantity for our production processes.\n\nThe types of programs required by the RMP to prevent serious accidents and to plan emergency contingencies have long"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006843,
      "SummaryText": " been in place at the Charlotte Plant.  We have long understood the relationship between good safety and good business, as reflected by our exemplary safety performance.  For 2005, we received the North Carolina Department of Labor Safety Award, having an injury record 50% better than the state-wide average for our industrial classification.  Nevertheless, we welcome the EPA's RMP initiative and see it as an opportunity to continue and expand dialog with our community.\n\nThe Accidental Release Prevention Program and Emergency Response Policies at the Stationary Source\n\nIt is the policy the Charlotte Plant to meet and often exceed requirements established by applicable safety, health, and environmental regulations promulgated by federal, state, and local agencies.  Our safety policies and practices have historically preceded the regulation of such practices under, for example, the OSHA Process Safety Management (PSM) Standard and the EPA RMP Rule.  Our policy is to maintain at a practical minimum the potential for harm to on-site employees and contractors, the public, and the environment, and to have in place contingency actions, coordinated with local responding agencies, for the unlikely event of a serious accidental chemical release.\n\nAnother safety-related program in which we participate is Responsible CareA? under the American Chemistry Council, and we are certified under the ISO-9000:2000 International Standard for quality.\n\nThe General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe Charlotte Plant has in place a thorough, ongoing PSM Program.  This program calls for implementation and maintenance of procedural and engineered safeguards at the plant to minimize the likelihood of a significant release of a hazardous chemical, and to eliminate or reduce the effects of any release that might occur.\n\nWe are involved in day-to-day safety-focused activities under our program that include elements such as:\n\n(1) Process Hazard Analyses"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006843,
      "SummaryText": " - We routinely perform and maintain up-to-date, systematic, and thorough studies of our operations to identify what could go wrong, identify means of eliminating or reducing design or procedural weaknesses, and to implement improvements.\n\n(2) Process Design - Our processes and equipment are designed for safety in accordance with applicable industry standards and best engineering practices.  Designs include, as appropriate, automatic emergency shutdown systems, pressure relief devices, and/or ventilation systems.\n\n(3) Training - Our operations and maintenance personnel are trained thoroughly on their job tasks, on safe work practices as they apply to their jobs, and emergency contingency actions, before they may operate or maintain equipment.  They also receive refresher training periodically.  Our procedures for operating and maintaining processes, general safe work practices, and emergency response are fully documented and maintained up-to-date in light of any changes at the plant.  We have implemented a computer-based safety training system, which to date includes over 70 training modules.\n\n(4) Maintenance - Each item of equipment at our plant that is involved in maintaining safety or in responding to an abnormal situation is inspected, tested, and/or maintained on a frequency that reflects its service and condition.\n\n(5) Management of Change - No change to equipment or procedural practices can take place at the plant without a thorough review of the implications of that change to safety.  No change must adversely impact the safety built into the design and operations of our processes.\n\nOur PSM Program is tuned to reflect the specific hazards of the chemicals we use.  For example, our operating, maintenance, safe work, and emergency procedures address personal protective equipment appropriate to the chemicals being handled.  Also, equipment is selected based on its intended service and chemical exposures. \n\nThe Five-Year Accident History\n\nWe have had no events at"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000006843,
      "SummaryText": " the Charlotte Plant that would qualify for inclusion in the RMP Rule's five-year accident history.\n\nThe Emergency Response Program\n\nWe have in place a written Emergency Response Plan that we coordinate with the West Mecklenburg Volunteer Fire Department (VFD), which is backed up by the Charlotte Fire Department.  New personnel are trained on the plan; we conduct refresher training annually; and we train on any revisions to the plan.  The plan is in compliance with the RMP Rule requirements, as well as other applicable EPA and OSHA requirements.  The VFD has had on-site rescue training; we also invite local HAZMAT crews to the site.\n\nPlanned Changes to Improve Safety\n\nWe have invested and continue to invest substantial effort and capital in maintaining our strong safety performance.  Some examples of our investments include installing dock locks and safety gates at a cost of $105,000; updating our piping and instrumentation diagrams at a cost of $80,000; and purchasing confined space equipment at a cost of $20,000.  Several other investments include:\n\n- Chemical loading racks, at a cost of $220,000;\n- Formaldehyde thermal xxidizer, at a cost of $300,000; and\n- Reactor sprinkler system upgrade, at a cost of $28,000.\n"
    }
  ]
}