{
  "FacilityID": 1000048116,
  "FacilityName": "Puma Energy Caribe LLC-Bayamon LPG Terminal",
  "FacilityStr1": "Road #28, km. 2.0",
  "FacilityStr2": "Industrial Park Luchetti",
  "FacilityCity": "Bayamon",
  "FacilityState": "PR",
  "FacilityZipCode": "00961",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72021",
  "LEPC": "San Juan LEPC",
  "FacilityLatDecDegs": "18.417420",
  "FacilityLongDecDegs": "-066.133767",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.pumaenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78349064,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Puma Energy Caribe, LLC",
  "OperatorStr1": "P. O. Box 11961",
  "OperatorStr2": null,
  "OperatorCity": "San Juan",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00922",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carlos Ramos",
  "RMPTitle": "BayamonTerminal Manager",
  "FTE": 60,
  "OtherEPAFacilityID": "PRR12A243",
  "EPAFacilityID": "100000148057",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "51711103140209",
  "SafetyInspectionDate": "2013-10-21 00:00:00",
  "SafetyInspectionBy": "United States Coast Guard",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-12-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-29 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-12-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.2",
  "FRS_Lat": 18.4185,
  "FRS_Long": -66.13333,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060164,
      "AltID": "Butane Storage",
      "FacilityID": 1000048116,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061306,
          "ProcessID": 1000060164,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073688,
          "ProcessID": 1000060164,
          "ChemicalID": 118,
          "Quantity": 3473729.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000573688,
          "ProcessID": 1000060164,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000060165,
      "AltID": "Propane Storage",
      "FacilityID": 1000048116,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061307,
          "ProcessID": 1000060165,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073689,
          "ProcessID": 1000060165,
          "ChemicalID": 98,
          "Quantity": 8434497.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000573689,
          "ProcessID": 1000060165,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048116,
      "SummaryText": "                                                                    Executive Summary-amended\n\n                                                                 Puma Energy Caribe, LLC\n\n                                                                Puma Bayamon LPG Terminal\n\n                                                                 Risk Management Plan\n\n\n\n\n\nPuma Energy Caribe, LLC (Puma) is currently performing butane and propane storage and truck loading activities at its terminal site located at State Road #28, km. 0.2, Bayamon, Puerto Rico.  The Terminal is using the Guaynabo Puma dock facilities to receive and ship product. Puma is required to comply with United States Environmental Protection Agency (USEPA) Risk Management Program (RMP) regulations under 40 Code of Federal Regulations (CFR) Part 68 because the facility stores propane and butane on-site in quantities exceeding the rule threshold quantity for these substances.  The following executive summary is provided in accordance with the requirements of 40 CFR 68.155.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nPuma is committed to operating and maintaining its butane and propane operations (generically referred to as liquefied petroleum gas or LPG) in a safe and responsible manner.  Puma has developed and implemented accidental release prevention and emergency response provisions at the facility, including those required under the USEPA RMP rule and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard.  The facility is also subject to other emergency plan regulations such as those under the Oil Pollution Act (OPA) of 1990, state Emergency Planning and Community Right-to-Know Act (ECPRA), and United States Coast Guard (USCG) rules.\n\n\n\nDescription of Facility and Regulated Substances\n\nPuma operates a petroleum product terminal located in Bayamon, Puerto Rico, which handles butane and propane, which are regulated flammable substances "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048116,
      "SummaryText": "under RMP regulations.  Puma's butane and propane terminal loading activities consist of:\n\nButane transfer from barges to pressurized bullet tanks or spheres; \n\nButane transfer from pressurized bullet tanks or spheres to truck loading terminal;\n\nPropane transfer from barges to pressurized bullet tanks; \n\nPropane transfer from pressurized bullet tanks to truck loading terminal;\n\nPropane transfer from pressurized bullet tanks to dock terminal;\n\nButanizer skid to add butane to gasoline to increase the gasoline octane.\n\n\n\nThe following transfer rates are currently expected at the facility (for Phase 1):\n\nThe LPG (Propane & Butane) facility consists of a total of 25 bullet tanks, and one Sphere. \n\nThe propane bullets facilities consist of 10 bullet tanks located at north area of the plant. The total storage capacity of the bullets is 20,000 BBLS.\n\nThe LPG Facility has the capacity of trucks being loaded from the bullet tanks or sphere at a rate of 200 to 2,271.74 liters per minute.\n\nThe butane bullets facilities consist of 15 bullet tanks, and one Sphere, located at south area of the plant. Also, the 10 bullet tanks located at north area of the plant facilities can be used for butane storage. The total storage capacity of the bullets is 36,899 BBLS. \n\nEach bullet is connected to the dock's 10-inch pipeline for filling purpose and connected to butane pumps' 10-inch suction header. The sphere is connected also to the dock's 10-inch pipeline for filling purpose and connected to butane bullets filling pipe line for filling the butane bullets purpose. \n\nButane is transferred from the bullets to the truck loading terminal and, eventually, to tank trucks for distribution to customers.\n\nButane and propane transfer rate from barges to bullet tanks or sphere is 1,000 gal/min.\n\n\n\nPuma is now revising this RMP to include additional tanks and lines at the facility (Phase 2A) for the handling of butane and propane. This new storage capacity consists of eight (8) new bullets tanks loca"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048116,
      "SummaryText": "ted at the Southwest of the plant. The total storage capacity of these new tanks is 16,000 bbls. The added pipelines will connect the new storage tanks to the existing facilities such as dock and truck loading terminal. \n\n\n\nGeneral Accident Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe facility's general accident prevention program consists of compliance with USEPA's RMP and OSHA's PSM regulations. Key elements include the following:\n\nProcess Safety Information - Information regarding butane and propane hazards, process technology, and process equipment is complied, updated, and made available to operating personnel.\n\nProcess Hazard Analysis - Analyses are conducted every five years with the objective of identifying, evaluating, and controlling the process hazards, and findings and recommendations are promptly addressed.\n\nOperating Procedures - Procedures are developed and maintained up to date to provide instructions for safe operations of process equipment during various phases of operation.\n\nTraining - Initial and recurring training is provided to all employees involved in operating a regulated process.\n\nMechanical Integrity - Procedures are developed and implemented to maintain the on-going integrity of vessels, process piping, transfer hoses, and other process equipment. These include procedures for maintenance, training of maintenance employees, and inspection and testing.\n\nManagement of Change - Written procedures are used to manage changes to process-related chemicals, technology, equipment, and procedures, and other changes that may affect a regulated process.\n\nPre-Startup Review - Reviews are conducted for new or significantly modified processes to ensure the facilities and processes are adequate and safe for operation.\n\nCompliance Audits - Periodic audits are conducted at least every three years to verify compliance with RMP requirements, with prompt and appropriate responses following any finding and deficiencies identified durin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048116,
      "SummaryText": "g the audit.\n\nIncident Investigation - Incidents that result in or could reasonably result in catastrophic releases of butane or propane will be investigated within 48 hours of an incident, and findings will be addressed promptly.\n\nEmployee Participation - The facility has a program for involvement of employees in conducting and developing process hazard analyses and other process safety management elements.\n\nHot Work Permit - Permits will be required and issued for hot work operations conducted on or near a butane or propane process.\n\nContractor Safety - The facility has a program to evaluate contractors and ensure that contractors are properly trained, informed of all hazards, and performing work in a safe manner.\n\n\n\nFive-year Accident History\n\nPUMA Energy Caribe, LLC, purchased the Facility on May 11, 2011, which includes the LPG (Propane & Butane) facilities. The LPG consists of 25 existing bullet tanks, and one existing (1) Sphere. The existing butane and propane bullets were upgraded and processes and safety system are newly built.  No accident with the  operation Puma has been conducted since the acquisition and no record from previous owner operation has been recorded of an RMP regulated chemical.\n\n\n\nEmergency Response Program\n\nThe facility has developed an emergency response program, including a written emergency response plan with notification, emergency medical treatment, and emergency response procedures.\n\n\n\nPlanned Changes to improve Safety\n\nPUMA continually strives to improve process safety. The facility's butane and propane processes are newly built and designed in accordance with recognized safety industry standards and/or government requirements. PUMA expects that on-going programs such as process hazard analyses, compliance audits, and incident investigations will result in continual improvements to process safety.\n\n\n\n"
    }
  ]
}