{
  "FacilityID": 1000082625,
  "FacilityName": "Metalor Technologies USA Corporation",
  "FacilityStr1": "255 John L. Dietsch Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "North Attleboro",
  "FacilityState": "MA",
  "FacilityZipCode": "02761",
  "Facility4DigitZipExt": "0255",
  "FacilityCountyFIPS": "25005",
  "LEPC": "North Attleboro LEPC",
  "FacilityLatDecDegs": "41.98305",
  "FacilityLongDecDegs": "-071.30004",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.metalor.com",
  "FacilityEmailAddress": "musar@metalor.com",
  "FacilityDUNS": 199665142,
  "ParentCompanyName": "Metalor Technologies USA Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Samantha McCourt",
  "OperatorStr1": "255 John L. Dietsch Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "North Attleboro",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02761",
  "OperatorZipCodeExt": "0255",
  "RMPContact": "Deborah Westman",
  "RMPTitle": "Environmental H&S Manager",
  "FTE": 94,
  "OtherEPAFacilityID": "02760LCHGR255JO",
  "EPAFacilityID": "100000066064",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-05-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-09-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-09-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.97716,
  "FRS_Long": -71.29946,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103252,
      "AltID": "Cl2 Process (Miller)",
      "FacilityID": 1000082625,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000104525,
          "ProcessID": 1000103252,
          "NAICSCode": "33141",
          "_desc": {
            "NAICS_CODE": "33141",
            "NAICS_DESCRIPTION": "Nonferrous Metal (except Aluminum) Smelting and Refining"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129254,
          "ProcessID": 1000103252,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629254,
          "ProcessID": 1000103252,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000103253,
      "AltID": "Cl2 Process (HRP)",
      "FacilityID": 1000082625,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000104526,
          "ProcessID": 1000103253,
          "NAICSCode": "33141",
          "_desc": {
            "NAICS_CODE": "33141",
            "NAICS_DESCRIPTION": "Nonferrous Metal (except Aluminum) Smelting and Refining"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129255,
          "ProcessID": 1000103253,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629255,
          "ProcessID": 1000103253,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082625,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nIntroduction\n\n\n\nMetalor Technologies USA Corporation (Metalor) operates a precious metals refinery in North Attleboro, Massachusetts which is subject to U.S. EPA regulations governing Accidental Release Prevention (ARP) Requirements: Risk Management Programs under Section 112(r) of the Clean Air Act (40 CFR Part 68).  This Risk Management Plan (RMP) has been developed in accordance with the requirements specified under 40 CFR Part 68, Subpart G. The RMP certifies that Metalor has instituted a Risk Management Program at their facility that is in compliance with U.S. EPA RMP requirements. \n\n\n\nThe RMP includes an Executive Summary and Data Elements following the format published by U.S. EPA.  In addition to identifying the applicable corporate policies and risk management systems, the RMP identifies a set of worst case and alternative release scenarios, the potential off-site consequences of those releases, and the facility's five-year accidental release history.  This RMP certifies that prevention and emergency response programs are in place so as to minimize risks to both workers and the potentially affected public.\n\n\n\nAccident Release Prevention Program and Emergency Response Policy\n\n\n\nIt is the policy of Metalor management to implement the requirements of this RMP in accordance with the U.S. EPA regulations under 40 CFR Part 68.  The objective is to minimize the risk of a release of a hazardous material, and if a release occurs, to minimize the potential impact to Metalor employees, the public and the environment.  This objective will be accomplished by utilizing good operating procedures, providing appropriate training to all employees, and coordinating response activities with local emergency response providers. \n\n\n\nMetalor's management is committed to providing the resources necessary to implement this policy.  Further, Metalor recognizes that it has a duty to protect its employees and neighbors from the effects of all dangerous chemicals.  "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082625,
      "SummaryText": "\n\n\n\nMetalor has developed a management system to implement and maintain compliance with the RMP Program and related OSHA Process Safety Management (PSM) and emergency response programs. At Metalor, the Department Supervisor has primary responsibility for ensuring overall implementation and compliance with these programs. Other individual employees such as the Environmental Health and Safety Manager, Facilities Manager, and Production Manager are responsible for the technical implementation of individual sections of these programs.\n\n\n\nFacility Description\n\n\n\nThe Metalor facility in North Attleboro, Massachusetts is classified by the North American Industrial Classification System (NAICS) as industry number 331419 which includes primary smelting and refining of nonferrous metal (except copper and aluminum).  Metalor operates two process lines that utilize chlorine to separate base metals from materials containing high concentrations of precious metals. \n\n\n\nThrough the first process, precious metals are separated from the base metals by pyrometallurgically reacting chlorine with the base metals. The resulting base metal chlorides are collected in gas cleaning equipment or as a slag.  The precious metals remain in the molten metallic state and are cast into anodes for subsequent HRP processing.  The process is well established and has been used in the refining industry for over 100 years. \n\n\n\nThrough the second process, a precious metals containing alloy is hydrometallurgically dissolved into solution by reacting chlorine with the alloy suspension in an aqueous solution. Precious metals are selectively precipitated from the resulting aqueous metal chloride solution.   \n\n\n\nMetalor stores chlorine gas under pressure in vessels whose total capacity exceeds the RMP threshold amount of 2500 lbs.  Other hazardous compounds that are used at the site are either not of sufficient quantity to be regulated or are found at such a concentration that they are exempt from the RMP regu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082625,
      "SummaryText": "lations. \n\n\n\nProgram Level Identification\n\n\n\nThe EPA Risk Management Regulation identifies three levels of requirements defined as \"programs\".   Metalor's process has been identified as Program 3, which applies to all processes that are subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management Standard (PSM).  Metalor's Accident Prevention Program elements are adopted directly from the compliance program of the PSM standard and are consistent with the Program Level 3 RMP requirements. Program 3 related information is included in the Data Elements section of the Risk Management Plan\n\n\n\nHazard Assessment\n\n\n\nThe hazard assessment includes review of two chlorine release scenarios:  a worst case release and an alternative release.  Metalor used the U.S. EPA program RMP Comp to predict the zone of impact for the two scenarios.  The model predicts the maximum distance to the endpoint concentration for chlorine. The endpoint represents a safe level of exposure \"below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects.\"  The endpoint for chlorine is 0.0087 mg/l (3 parts per million) in ambient air.  \n\n\n\nPer changes in EPA requirements (40 CFR 68.155) a summary of the potential release scenarios is not included in the Executive Summary. \n\n\n\nAccidental Release Prevention Program\n\n\n\nMetalor is governed by a set of OSHA and U.S. EPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to the employees of the facility, the public and to the environment.  These regulations include:\n\n\n\n** 40 CFR Part 68, Accidental Release Prevention\n\n** CFR Part 119, Process Safety Management\n\n\n\nThe chlorine process subject to the Risk Management Regulation is also subject to the OSHA PSM standard.  The RMP Program"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000082625,
      "SummaryText": " 3 Prevention Program elements are:\n\n\n\n** Employee Participation\n\n** Process Safety Information\n\n** Process Hazard Analysis (PHA)\n\n** Standard Operating Procedures\n\n** Training\n\n** Contractors\n\n** Management of Change (MOC)\n\n** Pre-Startup Safety Reviews (PSSR)\n\n** Mechanical Integrity\n\n** Safe Work Practices\n\n** Incident Investigation\n\n** Compliance Audits\n\n\n\nFive Year Accident History\n\n\n\nMetalor has an Incident Investigation program in place to investigate and document incidents that occur in the plant due to the chlorine process that could lead to an accidental release.  The relevant information is documented on the Incident Investigation report and kept on file for five years. \n\n\n\nDuring the past five years, there have been no incidents involving chlorine gas that qualifies for reporting under 40 CFR Part 68.  The last incident occurred on November 7, 2008 and was reported previously.  \n\n\n\nEmergency Response Program\n\n\n\nConsistent with Program 3 requirements, Metalor has implemented an emergency response program that includes an emergency response plan, emergency response equipment procedures, employee training, and procedures to ensure the program is up to date.  Their detailed emergency response plan is part of the process safety management plan. Metalor has developed a detailed contingency plan to provide protection by providing prompt action to control an emergency and minimize the amount of toxic material released as well as lessen or eliminate the hazards to employees and the community.  Response activities are coordinated with the local fire department to ensure the appropriate level of response.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nMetalor, under the recent RMP program, as well as its existing PSM and earlier SARA Title III Community Right-to-Know Act compliance programs has organized its management system to effectively address all hazards and potential risks. Both the advanced planning aspects of process design, operating procedures, and emergency pr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000082625,
      "SummaryText": "eparedness, and the operational elements of system maintenance, safe operating practices and ongoing personnel training are necessary to support a continual improvement in facility safety.  These programs are thoroughly documented so that information about the safe handling of chemicals present at the facility is available to all employees, and can be readily interpreted by emergency response team staff and the Incident Commander. This is especially important when questions arise from public safety officials regarding potential risks to the community.  All of these features of the RMP and the PSM program at Metalor lead to operations that are safe today, but will be even safer tomorrow.\n\n\n\nMetalor's safety program incorporates continuous improvement through use of audits, inspections, and on-going evaluations of in-plant safety and program effectiveness. The information gathered is evaluated and improvements that are identified are incorporated into the program.\n\n"
    }
  ]
}