{
  "FacilityID": 1000104181,
  "FacilityName": "KraftHeinz Company",
  "FacilityStr1": "2035 E. Bennett Street",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "MO",
  "FacilityZipCode": "65804",
  "Facility4DigitZipExt": "1726",
  "FacilityCountyFIPS": "29077",
  "LEPC": "Greene County LEPC",
  "FacilityLatDecDegs": "37.188889",
  "FacilityLongDecDegs": "-093.256667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A3",
  "LatLongDescription": "ST",
  "FacilityURL": "2035 E. Bennett Street",
  "FacilityEmailAddress": "mark.chayer@kraftheinz.com",
  "FacilityDUNS": 39010590,
  "ParentCompanyName": "KraftHeinz Company",
  "Company2Name": "NA",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "KraftHeinz Company",
  "OperatorStr1": "2035 E. Bennett Street",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65804",
  "OperatorZipCodeExt": "1726",
  "FTE": 1050,
  "OtherEPAFacilityID": "MOD062713003",
  "EPAFacilityID": "100000035829",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "OP 2017-075",
  "SafetyInspectionDate": "2017-10-16 00:00:00",
  "SafetyInspectionBy": "Factory Mutual",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-02-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-02-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-02-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-02-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.19065,
  "FRS_Long": -93.2572,
  "FRS_Description": null,
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000129736,
      "AltID": null,
      "FacilityID": 1000104181,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000162633,
          "ProcessID": 1000129736,
          "ChemicalID": 56,
          "Quantity": 94000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131171,
          "ProcessID": 1000129736,
          "NAICSCode": "311514",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000111809,
              "Process_NAICS_ID": 1000131171,
              "SafetyReviewDate": "2022-12-07 00:00:00",
              "PHA_Date": "2020-06-08 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-01-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Ammonia alarms.",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water fog with hose.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-12-07 00:00:00",
              "TrainingReviewDate": "2022-12-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Online with IRC (Univ of Wis) and Garden City training.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Online with IRC (Univ of Wis) and Garden City training.",
              "MaintenanceReviewDate": "2022-09-07 00:00:00",
              "EquipmentInspectionDate": "2022-12-07 00:00:00",
              "EquipmentTested": "Ammonia alarms - Dec 2022",
              "ChangeMgmtDate": "2022-06-07 00:00:00",
              "ChangeMgmtReviewDate": "2022-06-07 00:00:00",
              "PreStartupReviewDate": "2022-04-22 00:00:00",
              "ComplianceAuditDate": "2022-06-01 00:00:00",
              "AuditCompletionDate": "2022-12-30 00:00:00",
              "IncidentInvestigationDate": "2018-03-18 00:00:00",
              "InvestigationChangeDate": "2019-03-11 00:00:00",
              "ParticipationPlansReviewDate": "2020-04-22 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-21 00:00:00",
              "ContractorSafetyReviewDate": "2020-04-22 00:00:00",
              "ContractorSafetyEvalDate": "2020-04-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000140392,
                  "PreventionProgram3ID": 1000111809,
                  "ProcessChemicalID": 1000162633
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104181,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-04-22 00:00:00",
    "ERTrainingDate": "2020-04-22 00:00:00",
    "CoordinatingAgencyName": "Springfield Fire Department",
    "CoordinatingAgencyPhone": "4178641500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "City of Springfield, MO Industrial User Wastewater Permit"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000104181,
      "SummaryText": "changes on the PHA table spreadsheet on in-house shared software platforms.  A Memorandum of Change (MOC) is completed each time a recommended action is completed to document the work and resulting safety improvements.  MOCs are recorded and tracked on in-house software platforms and can be accessed by any member of the in-house PSM Leadership Team.  Example improvements include new SOPs to improve safety, replacing or upgrading valves in the system, physical improvements to protect or provide better access to parts of the system such as bollards, access walls, and ventilation, and installation of new or upgraded ammonia alarms."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000104181,
      "SummaryText": "ident response personnel cannot be contacted.  \n\nThe Emergency Response Plan includes a description of the frequency of employee emergency response training and the detailed training content.  Specific procedures to be followed in the event of a fire and ammonia emergency are described in the plan.  Response team members participate in a mock spill cleanup annually.  All trained ER team members have pagers/phones that can be activated.\n\nIn case of an ammonia or fire emergency, the Incident Commander will determine if the Springfield Fire/Police Department will need to be called to provide emergency responders and equipment.  The Springfield Fire Department will also be called for all fire related emergencies.\n\n40 CFR 68.155(f) Planned Changes to Improve Safety\nKraftHeinz completed a full-plant PHA in 2020 and the next full-plant PHA will be completed in 2025.  PHAs have also been conducted each time there was a proposed or actual change to any system in the plant that impacts any piece of equipment that contains ammonia.  The PSM Manager and the KraftHeinz PSM Leadership Team maintains an excel spreadsheet on in-house shared software platforms that identifies each item, risk level, what if question, recommendations, actions, target date, status, person responsible, and revalidated years.  \n\n\n\n\n\n\nThe KraftHeinz plant has an in-house PSM team that includes the PSM Manager, the plant manager, EHS personnel, and members of the refrigeration team.  The Springfield plant is also part of the KraftHeinz corporate PSM Leadership Team, which can share documents, training, and other information related to PSM on company-wide shared software platforms.\n\nAs a result of the five-year PHA and ongoing equipment-specific PHA\u0092s, numerous changes have been implemented to improve the safety and reliability of the ammonia refrigeration system and various components including compressors, valves, piping, alarms, and access to critical parts of the system.  The PSM Manager documents these"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104181,
      "SummaryText": "year.  Training for personnel involved with ammonia refrigeration is completed and documented including online tests through the IRC and the Garden City (Kansas) Ammonia Program (GCAP), which is a third-party industrial utilities educational company that provide training, testing, and other educational services.  Preventative maintenance tasks and procedures are included in online modules and shared software that schedules specific maintenance tasks at four week (monthly) and 13 week (quarterly) intervals.  Inspections are completed daily by rotating refrigeration mechanics.  Ammonia alarms are tested every six months and Surge Relief Valves (SRVs) are replaced every five years or sooner if needed.   Management of Change procedures (MOCs) are kept current by the PSM manager on the shared online software system.  Each PSM element change is dated with the revision number.  \n\nCompliance audits are conducted routinely and the most recent audit was completed in June 2022.  Audits at the Springfield plant are performed by KraftHeinz personnel audit teams from other KraftHeinz plants.  MOC\u0092s are maintained for all Hot Work permits.  Contractors receive specific training if they are involved with any aspect of ammonia refrigeration equipment or systems.   \n\n40 CFR 68.155(d) Five-Year Accident History\nThere have been no reportable accidents involving the ammonia refrigeration system at the KraftHeinz plant in the last five years.\n\n\n40 CFR 68.155(e) Emergency Response Program\nThe KraftHeinz facility has an Emergency Response Program and written plan that identifies employees who would be involved in an emergency and how these employees are divided into various management and response teams.  The listed employees include the Incident Commander and Response Team Members.  The plan lists the names, email addresses, and office/cell phone numbers of the Response Team Members in case of an ammonia emergency.  Back-up personnel are also identified in the plan in case the primary inc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104181,
      "SummaryText": "ires an accident prevention program as well as additional hazard assessment, management, and emergency response requirements.  The PSM program for KraftHeinz includes the following twelve required elements:\n\n\u0095\tProcess Safety Information.\n\u0095\tProcess Hazard Analysis (PHA).\n\u0095\tOperating Procedures.\n\u0095\tTraining.\n\u0095\tMechanical Integrity.\n\u0095\tManagement of Change (MOC).\n\u0095\tPre-Startup Review.\n\u0095\tCompliance Audits.\n\u0095\tIncident Investigation.\n\u0095\tEmployee Participation.\n\u0095\tHot Work Permits.\n\u0095\tContractors.\n\nKraftHeinz completes a full-plant PHA every five years; the last PHA was completed in 2020 and the next PHA will be completed in 2025.  In addition, a PHA is conducted each time there is a proposed or actual change to any system in the plant that could impact any part of the ammonia refrigeration equipment.  There is an in-house Springfield PSM team that includes the PSM Manager, the plant manager, EHS personnel, and members of the refrigeration team.  The Springfield plant is also part of the KraftHeinz corporate PSM Leadership Team that that has access to documents, training, and other information related to PSM on company-wide shared software platforms.  KraftHeinz corporation has their own in-house ammonia refrigeration team and PSM specialists.  KraftHeinz is a member of the Industrial Refrigeration Consortium (IRC), which is a collaborative between the University of Wisconsin \u0096 Madison and industry to improve the safety and efficiency of ammonia refrigeration systems by conducting applied research, delivering knowledge transfer, and providing technical assistance.  \n\nThe plant has an extensive list of Standard Operating Procedures (SOPs) that are updated on a continuous basis and includes an inventory of over 4,000 plant valves.  The SOPs include process controls in use including automatic shutoffs, interlocks, and alarms; mitigation systems, and monitoring/detection systems.  PSM personnel track changes since the last PHA update and review operating procedures at least once a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104181,
      "SummaryText": "regulated substance, including any use, storage, manufacturing, handling, or onsite movement of such substances, or a combination of these activities.    \n\nThe KraftHeinz plant has a primary SIC code of SIC 2022 \u0096 Natural, Processed, and Evaporated Dairy Products and a primary NAICS code of 311514 \u0096 Dry, Condensed, and Evaporated Dairy Product Manufacturing.  Ammonia (Anhydrous), (CAS Number 7664-41-7) is used in the refrigeration systems at the plant.  The RMP threshold quantity is 10,000 pounds and the plant has a combined total of about 94,000 pounds of ammonia in refrigeration systems, so it is subject to RMP requirements as well as OSHA Process Safety Management (PSM) requirements.  Ammonia is included in the RMP program because it is classified as Toxic.  \n\nThe KraftHeinz plant began operation in 1953 producing Process Cheese and Natural Cuts.  The Dinners department was added in 1974 and there have been many expansions and changes in products produced since. The Plant operates seven days a week, twenty-four hours a day and employs about 1,050 people.  There are three different business units within the Plant: Dinners, Natural Cheese, and Cheese.  The Dinners department produces different varieties of Box Macaroni, varieties of Velveeta & Shells and Easy Mac.  The raw materials include flour and cheese powder.  The Natural Cheese department packages an array of shredded and chunk cheeses.  The Cheese department produces individually wrapped single sliced cheeses and bulk cheeses.  Cheese is produced from various types of milk which is piped from the intake area of the plant. The KraftHeinz facility has a utilities department that maintains all of the operating equipment needed to produce steam, air, vacuum, heating and cooling for the plant.\n\n40 CFR 68.155(c) General Accident Release Prevention Program and Chemical-Specific Prevention Steps\nThe KraftHeinz plant is a Program 3 facility, which is covered by OSHA Process Safety Management (PSM) standard that requ"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104181,
      "SummaryText": "Risk Management Plan \u0096 Executive Summary\nAs required by 40 CFR 68.155, KraftHeinz shall provide an executive summary in the Risk Management Plan (RMP) that includes a brief description of the following six sections:\n\n(a)\tThe accidental release prevention and emergency response policies at the stationary source.\n(b)\tThe stationary source and regulated substances handled.\n(c)\tThe general accident release prevention program and chemical-specific prevention steps.  \n(d)\tThe five-year accident history.\n(e)\tThe emergency response program.\n(f)\tPlanned changes to improve safety.\n\n40 CFR 68.155(a) - Accidental Release Prevention and Emergency Response Policies\nThe KraftHeinz Springfield, Missouri plant has extensive accidental release prevention policies and emergency response policies in place.  The KraftHeinz plant uses ammonia in refrigeration units and systems and is a Program 3 facility, which is covered by OSHA Process Safety Management (PSM) standard as the accident prevention program as well as additional hazard assessment, management, and emergency response requirements.  The PSM standard requires comprehensive accidental release prevention and emergency response policies.   The KraftHeinz parent corporation also has comprehensive ammonia refrigeration accidental release prevention and emergency response policies since most of their food plants have ammonia refrigeration systems.  A more detailed description of these policies is provided in paragraph 40 CFR 68.155(c) below.  \n\nIn general, KraftHeinz PSM personnel work closely with City of Springfield Fire Department and other first responders to be prepared to respond to an accidental ammonia release.  \n\n40 CFR 68.155(b) \u0096 Stationary Source and Regulated Substances Handled\nThe KraftHeinz facility meets EPA\u0092s definition of a stationary source that manufactures, uses, stores, or otherwise handles more than a threshold quantity of a regulated substance in a process.    A \u0093process\u0094 means any activity involving a listed"
    }
  ]
}