{
  "FacilityID": 1000079099,
  "FacilityName": "Dart Container Corporation of California",
  "FacilityStr1": "150 South Maple Street",
  "FacilityStr2": null,
  "FacilityCity": "Corona",
  "FacilityState": "CA",
  "FacilityZipCode": "92880",
  "Facility4DigitZipExt": "1704",
  "FacilityCountyFIPS": "06065",
  "LEPC": "City of Corona Fire Department",
  "FacilityLatDecDegs": "33.886667",
  "FacilityLongDecDegs": "-117.604722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 10862035,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dart Container Corporation of Calif",
  "OperatorStr1": "150 South Maple Street",
  "OperatorStr2": null,
  "OperatorCity": "Corona",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92880",
  "OperatorZipCodeExt": "1704",
  "RMPContact": "Scott Morris",
  "RMPTitle": "Interim Plant Manager",
  "FTE": 389,
  "OtherEPAFacilityID": "CAD981692775",
  "EPAFacilityID": "100000169131",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "003721",
  "SafetyInspectionDate": "2009-02-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.88269,
  "FRS_Long": -117.60271,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000098650,
      "AltID": "Polystyrene Foam Product",
      "FacilityID": 1000079099,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099889,
          "ProcessID": 1000098650,
          "NAICSCode": "32614",
          "_desc": {
            "NAICS_CODE": "32614",
            "NAICS_DESCRIPTION": "Polystyrene Foam Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000123723,
          "ProcessID": 1000098650,
          "ChemicalID": 115,
          "Quantity": 150000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000623723,
          "ProcessID": 1000098650,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079099,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies\n\nIn this production facility, Dart Container Corporation of California, located at 150 South Maple Street, Corona, California, we handle isopentane.  This material is considered hazardous by the EPA.  Our isopentane handling systems are designed with controls to prevent and minimize accidental release.  Written procedures for unloading shipments of isopentane, require supervision by specially trained workers.  This allows us to immediately detect equipment failures and prevent dangerous release situations.  Alarms, excess flow devices and automatic shutdown systems connected to isopentane detectors are part of our spill prevention program.  There is a strict no smoking, no flames policy in effect in all areas where isopentane is present and the areas are clearly marked with no smoking signs.\n\n\n\n2.  The Stationary Source and Regulated Substance Handled\n\nThis facility has several operational areas.  The two areas of concern for this program are the isopentane unloading area and the foam sheet extrusion area.  This facility uses isopentane to manufacture polystyrene foam sheet which is then (outside the scope of the RMP) processed into various end products such as food containers by thermoforming the sheet.  The isopentane is received in rail cars and stored in two 35,000 gallon underground storage tanks.  The isopentane is pumped through two pumping stations directly to the foam extruders where it is injected into melted polystyrene to form rolls of foam polystyrene sheet.  The maximum amount of isopentane stored on site will be 363,584 pounds.\n\n\n\n3.  The General Accidental Release Prevention Program and the Specific Prevention Steps\n\nThis facility has written procedures that are used to ensure the safe handling of isopentane.  There are detailed written procedures for unloading that will limit and/or prevent spills.  Personnel are trained in safe handling practices for the isopentane.  Smoking or open "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079099,
      "SummaryText": "flames are strictly forbidden in areas where flammable materials are likely to be present.  All company employees are trained to respect the flammable and explosive nature of isopentane.  This starts with the Hazard Communication training on the first day of employment, Emergency Action Plan training, and it continues to be reinforced with on the job training.  All visitors and contractors are advised of the hazardous nature of isopentane if they are visiting an area where isopentane is likely to be present.  Signs are used to reinforce the no smoking, no flames warnings for critical areas.  The site has multiple Lower Explosive Limit detector meters for hydrocarbons which trigger alarms in the event of a release.  The alarms alert personnel to action, to minimize the spill and minimize the hazard potential.  \n\n\n\n4.  Five Year Accident History\n\nThe facility has not had a reportable accident or release involving isopentane in the past five years.\n\n\n\n5.  Emergency Response Program\n\n  Our emergency response program is a combination of our local emergency response agencies and in house response by our employees who are trained to perform defensive actions in response to spills in accordance with 29CFR1910.120(q)(6)(ii) First Responder Operations Level training in addition to hazardous material handling for isopentane, and general fire control. We keep materials and equipment on site, to respond to, and contain accidental spills or releases. The local fire department is aware of the hazards at this facility and has visited the site to review emergency response needs.  \n\n\n\n6.  Planned Changes to Improve Safety\n\nThis facility reviews the emergency plan annually and updates the plan as needed anytime hazards change.  All new employees are trained about the emergency plan and all employees are notified when hazards in their work area change.  Our employees will continue to get annual update training and they will be updated anytime new hazards are introduced to the site.  We"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079099,
      "SummaryText": " will continue to maintain our emergency preparedness and general safety programs."
    }
  ]
}