{
  "FacilityID": 1000057099,
  "FacilityName": "Reddy Ice-Phoenix (203)",
  "FacilityStr1": "4626 South 40th Street",
  "FacilityStr2": null,
  "FacilityCity": "Phoenix",
  "FacilityState": "AZ",
  "FacilityZipCode": "85040",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.405000",
  "FacilityLongDecDegs": "-111.996390",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.reddyice.com",
  "FacilityEmailAddress": "information@reddyice.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Reddy Ice Corporation",
  "Company2Name": null,
  "CompanyDUNS": 364514133,
  "Company2DUNS": 364514133,
  "OperatorName": "Reddy Ice Corporation",
  "OperatorStr1": "5720 LBJ Freeway",
  "OperatorStr2": "Suite 200",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75240",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Chajewski",
  "RMPTitle": "Plant Manager",
  "FTE": 70,
  "OtherEPAFacilityID": "85040SPRKL4626S",
  "EPAFacilityID": "100000133526",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-02-06 00:00:00",
  "SafetyInspectionBy": "Fire Safety Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-07-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-04-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-04-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-04-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.40514,
  "FRS_Long": -111.99529,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000071328,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000057099,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000072530,
          "ProcessID": 1000071328,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000088156,
          "ProcessID": 1000071328,
          "ChemicalID": 56,
          "Quantity": 40500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000588156,
          "ProcessID": 1000071328,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057099,
      "SummaryText": "Executive Summary\n\n\n\nPROCESS SUMMARY\n\nReddy Ice-Phoenix (203), manufactures packaged ice for wholesale and retail distribution. The facility utilizes anhydrous ammonia as a refrigerant for ice manufacturing and cold storage. \n\n\n\nThe facility has two closed-circuit refrigeration systems, each consisting of compressors, condensers, thermosyphon vessels, high-pressure and low-pressure ammonia storage vessels, icemakers, and freezer evaporators. The systems have numerous protective controls including motor overload, high and low temperature and pressure, low oil pressure, high and low liquid level cutouts, and pressure relief valves on all equipment. The facility has multiple safeguards pertinent to the ammonia refrigeration system. These include an ammonia detection and alarm system, machinery room ventilation systems, controls which shut down the compressors if operating limits are exceeded, and the capability of remotely shutting the entire system down if required. Anhydrous ammonia, when properly used, has proven to be a safe and reliable refrigerant.\n\n\n\nReddy Ice-Phoenix has also developed an emergency action plan (\"EAP\") that includes: procedures for notification of emergency authorities/agencies and the public; evacuation of personnel; use of emergency alarms and equipment; employee training in evacuation procedures; and periodic review and updating of the written plan.\n\n\n\nRISK MANAGEMENT PREVENTION PROGRAM 3\n\nBased on the Reddy Ice-Phoenix facility ammonia inventory, location, and requirement to meet OSHA PSM standards, it has been determined the facility is subject to the Prevention Program 3 requirements. This accident prevention program is a way to make safe operations and accident prevention systematic throughout the facility. Reddy Ice is committed to operating a safe and compliant facility for the protection of its employees, the public, and the environment. A combined Process Safety Management/Risk Management (\"PSM/RMP\") Program has been developed to meet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057099,
      "SummaryText": " the accidental release prevention requirements of both EPA's Risk Management Program (40 CFR Part 68) and OSHA's Process Safety Management Standard (29 CFR 1910.119). The PSM/RMP Program contains fourteen elements, establishing requirements for: employee participation, process safety information, process hazard analysis, pre-startup safety review, operating procedures, training, management of change, mechanical integrity, hot work permits, contractors, incident investigation, compliance audits, emergency planning and response, and trade secrets. These elements are tied together by a management system to ensure plant-wide development, implementation and integration of all the Program requirements.\n\n\n\nMANAGEMENT SYSTEM\n\nA management system has been developed to oversee the implementation of the PSM/RMP Program elements. The Plant Manager has been identified as PSM/RMP Program Coordinator, with overall responsibility for developing, implementing, and integrating the Program requirements. Under the PSM/RMP Program, various responsibilities have been assigned to other individuals. The Maintenance Supervisor is responsible for portions of the program closely tied to the refrigeration equipment and operation. An established safety committee meets each month to present a safety meeting and address any safety issues brought up by employees during the month.\n\n\n\nHAZARD ASSESSMENT\n\nAs required by the Risk Management Program regulations, the Reddy Ice-Phoenix facility has conducted a hazard assessment including offsite consequence analyses (\"OCAs\") for potential accidental releases of anhydrous ammonia. The OCAs describe the potential offsite exposure to surrounding areas from an accidental release. A worst-case release scenario and alternative-case release scenarios from the facility, company, and industry history were studied and calculated using the EPA RMP*Comp modeling program, and the potentially affected offsite population and facilities were identified.\n\n\n\nFIVE-YEAR ACC"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057099,
      "SummaryText": "IDENT HISTORY\n\nThe Reddy Ice-Phoenix facility has not had any releases that would require reporting as part of a five-year accident history.\n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\nThe Reddy Ice-Phoenix facility operates under an Emergency Action Plan (\"EAP\") that includes procedures for: notifying plant personnel, the public, and local emergency responders; emergency evacuation/response procedures; use of emergency alarms and equipment; employee training in evacuation procedures; first aid for ammonia exposure; and periodic review and updating of the EAP. The plan is reviewed regularly for verification of data, and revised and updated as necessary to reflect changes in facility operations and personnel.\n\n\n\nAs required, the facility has coordinated emergency response activities with the Maricopa County Department of Emergency Management and the Phoenix Fire Department, and has appropriate mechanisms in place to notify emergency responders if needed. The ammonia inventory is verified and reported annually to state and local authorities as required under EPCRA, and the plant is incorporated into the community emergency response plan developed under 42 USC.\n\n\n\nPLANNED CHANGES\n\nThe Reddy Ice-Phoenix facility operates an ongoing program of facility preventive and predictive maintenance to identify and implement changes that may result in improved safety and operations. No current major system changes are planned.\n\n"
    }
  ]
}