{
  "FacilityID": 1000084163,
  "FacilityName": "Spoetzl Brewery, Inc.",
  "FacilityStr1": "603 East Brewery Street",
  "FacilityStr2": null,
  "FacilityCity": "Shiner",
  "FacilityState": "TX",
  "FacilityZipCode": "77984",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48285",
  "LEPC": "Lavaca County LEPC",
  "FacilityLatDecDegs": "29.433488",
  "FacilityLongDecDegs": "-97.167496",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.shiner.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Carlos Alvarez",
  "OperatorStr1": "14800 San Pedro Ave",
  "OperatorStr2": "Third Floor",
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78232",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Darilek",
  "RMPTitle": " Maintenance Manager",
  "FTE": 104,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170183",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-01-21 00:00:00",
  "SafetyInspectionBy": "OSHCON",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-12-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-12-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-12-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-12-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 29.43372,
  "FRS_Long": -97.16764,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105137,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000084163,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000106470,
          "ProcessID": 1000105137,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131646,
          "ProcessID": 1000105137,
          "ChemicalID": 56,
          "Quantity": 32148.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000631646,
          "ProcessID": 1000105137,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084163,
      "SummaryText": "Executive Summary \n\n\n\nA. Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe Spoetzl Brewery, located in Shiner, Texas is committed to protecting the public, its employees, and the environment from any accidental releases of hazardous materials used at its facilities. We have implemented safety, environmental protection, and risk management programs to prevent the release of hazardous materials.\n\n\n\nB. Regulated Substances\n\n\n\nThe Spoetzl Brewery produces and packages Shiner beer. The ammonia refrigeration system is a utility system supporting the plant by providing space conditioning for beer/intermediates tank storage and various brewing process areas. The system also provides cooling to generate chilled water or glycol through flooded heat exchangers which, in turn, supplies secondary media and/or direct product cooling.\n\n\n\nWe use and store quantities of Anhydrous Ammonia in excess of 10,000 pounds in our refrigeration system. The industry has used Anhydrous Ammonia for many years as a coolant because it is widely available, relatively inexpensive, and has an exceptional ability to remove large quantities of heat. Although it is designated as an Extremely Hazardous Substance by the Environmental Protection Agency if stored, and handled, properly it is relatively safe to use as a refrigerant.\n\n\n\nC. Accidental Release Prevention Program\n\n\n\nSpoetzl Brewery has adopted a program to meet the requirements of both the Occupational Safety and Health Act's Process Safety Management standard (PSM) and the EPA's RMP standard. Spoetzl Brewery maintains a release prevention program with the focus of protecting the public, employees, and the environment from hazards associated with an accident or release involving anhydrous ammonia.\n\n\n\nThe multi-faceted program includes:\n\n\n\n* The use of Process Safety Information to document safe process design;\n\n* Operating Procedures to ensure that the system is operated safely;\n\n* Maintenance, inspection and testing of all am"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084163,
      "SummaryText": "monia refrigeration equipment and piping to ensure that the system is maintained according to applicable standards and manufacturer's recommendations;\n\n* The Employee Participation Program and training to ensure that all employees and contractors working on and around the processes are aware of the hazards, can perform their job duties correctly and safely;\n\n* Procedures for Hot Work, Confined Space Entry, line breaks and other potentially hazardous processes and training in those procedures so that job duties can be performed safely;\n\n* Contractor Safety Program to ensure that all contractors performing work for Spoetzl Brewery are qualified to perform job duties correctly and safely;\n\n* Management of Change and Pre-startup Safety Reviews to ensure that changes are documented, analyzed and kept within the design basis; \n\n* Incident Investigation procedures that provide method to investigate each incident, including \"near misses\" to determine root causes and make needed safety improvements.\n\n\n\nThe program also provides for the required:\n\n* Process Hazard Analyses to evaluate the chemical and process hazards and to determine safeguards that could be added; \n\n* Compliance Audits to ensure that Process Safety Management requirements are met or exceeded and to address findings promptly; \n\n* Mechanical Integrity inspections to determine condition of process equipment so that deficiencies can be identified and corrected.\n\n\n\nD. Five Year Accident History\n\n\n\nWithin the past five years, the Spoetzl Brewery has not had any accidental releases that resulted in injuries or property damage or negative environmental impact. The plant has maintained an excellent safety record throughout its operating history with no major anhydrous ammonia releases that could have had adverse effects on the employees, the public, property, or the environment.\n\n\n\nE. Emergency Action Plan\n\n\n\nIf there is an accidental release, the Spoetzl Brewery has an emergency response program that coordinates the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084163,
      "SummaryText": " onsite HAZMAT team and emergency response with the Shiner Fire Department, Sheriff's Office, local EMS, and a backup HAZMAT team - Horizon Environmental. If such a release did occur, employees will immediately notify the Spoetzl HAZMAT team, and follow the phone tree to contact local response organizations and the  National Response Center, if necessary.\n\n\n\nOur Emergency Action Plan has been revised extensively to ensure that response to any emergency is swift and effective. It addresses measures to protect the lives of employees, contractors, and visitors at the facility. Training is provided to all employees regarding the Emergency Action Plan.\n\n\n\nF. Planned changes to improve safety\n\n\n\nSpoetzl Brewery continues to strengthen its safety program and continually works to effectively manage the hazards of anhydrous ammonia to protect the community we serve and our employees. Training is in the\n\nforefront of process safety management.\n\n\n\nPlant security has being improved with additional measures to provide accountability, limited access to critical areas, and monitoring of contractors and other visitors to the facility, including tourists.\n\n\n\nEmphasis is being placed on addressing findings and recommendations from PHA's, Compliance Audits, and Mechanical Integrity inspections to further improve safety.\n\n\n\nSafety in all aspects of Spoetzl Brewery operations is part of our culture. Safety is the top priority for our organization. We continue to improve processes, work practices, and enhance the ability of our personnel to assure safe and efficient control as well as management and operation of our plant.\n\n"
    }
  ]
}