{
  "FacilityID": 1000059920,
  "FacilityName": "Johnson Space Center White Sands Test Facility",
  "FacilityStr1": "14 mi E and 6 mi N of Las Cruces",
  "FacilityStr2": "Off Highway 70",
  "FacilityCity": "Las Cruces",
  "FacilityState": "NM",
  "FacilityZipCode": "88012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35013",
  "LEPC": "Dona Ana LEPC",
  "FacilityLatDecDegs": "32.483965",
  "FacilityLongDecDegs": "-106.613895",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.nasa.gov/centers/wstf/home/index.html",
  "FacilityEmailAddress": "robert.m.cort@nasa.gov",
  "FacilityDUNS": 194555207,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "NASA JSC White Sands Test Facility",
  "OperatorStr1": "Post Office Box 20",
  "OperatorStr2": null,
  "OperatorCity": "Las Cruces",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "88004",
  "OperatorZipCodeExt": "0020",
  "RMPContact": "Timothy J. Davis",
  "RMPTitle": "WSTF Environmental Office Chief",
  "FTE": 620,
  "OtherEPAFacilityID": "NM8800019434",
  "EPAFacilityID": "100000137871",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-05-18 00:00:00",
  "SafetyInspectionBy": "Voluntary Protection Program",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-09-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-09-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.52004,
  "FRS_Long": -106.59985,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074808,
      "AltID": "400 Area MMH",
      "FacilityID": 1000059920,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000075970,
          "ProcessID": 1000074808,
          "NAICSCode": "92711",
          "_desc": {
            "NAICS_CODE": "92711",
            "NAICS_DESCRIPTION": "Space Research and Technology"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092475,
          "ProcessID": 1000074808,
          "ChemicalID": 3,
          "Quantity": 79207.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 3,
            "ChemicalName": "Methyl hydrazine  [Hydrazine, methyl-]",
            "CASNumber": "60-34-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000592475,
          "ProcessID": 1000074808,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000074810,
      "AltID": "500 Area MMH Storage",
      "FacilityID": 1000059920,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000075972,
          "ProcessID": 1000074810,
          "NAICSCode": "92711",
          "_desc": {
            "NAICS_CODE": "92711",
            "NAICS_DESCRIPTION": "Space Research and Technology"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092477,
          "ProcessID": 1000074810,
          "ChemicalID": 3,
          "Quantity": 55005.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 3,
            "ChemicalName": "Methyl hydrazine  [Hydrazine, methyl-]",
            "CASNumber": "60-34-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000592477,
          "ProcessID": 1000074810,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059920,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThe purpose of this document is to provide the Environmental Protection Agency (EPA) with an updated Risk Management Plan to the previously submitted 2014 NASA White Sands Test Facility (WSTF) RMP, submitted on June 30, 2014, which was prepared, certified, and sent to the EPA on January 13, 2015. In accordance with 40 CFR Part 68.190(b)(5-6) and (c), WSTF is required to submit an updated RMP within 6 months of a change that requires a revised Process Hazard Analysis (PHA), within 6 months of a change that requires a revised offsite consequence analysis, and/or within 6 months for the de-registration of a stationary source no longer being covered. Since the last RMP submission (2014), WSTF has made changes to covered processes in order to improve the safety of personnel by moving large quantities of propellant out of the test areas and into a dedicated storage area. These changes have resulted in the elimination of a covered process in the 300 Area (2014 NASA WSTF RMP Process ID # 1000051777), changing the propellant storage capacity in the 400 Area (2014 NASA WSTF RMP Process ID # 1000051778), and transferring the propellant to the 500 Area Fuel Storage and Distribution Area (2014 NASA WSTF RMP Process ID # 1000051779). This 2016 NASA WSTF RMP update will include a revised PHA for the covered processes in the propulsion test areas; revised hazard assessments including offsite consequence analyses, worst-case analysis and alternative release modeling, for the 400 and 500 Areas Fuel Storage and Distribution systems; and changes to the emergency response program, specifically updating Emergency Contact information. \n\n\n\nA. Accidental Release Prevention and Emergency Response Policies\n\n\n\nWSTF is committed to providing a safe place of employment by meeting or exceeding applicable health and safety requirements to assure personnel, community, and environmental safety and preservation of resources. The Management System Manual (MSM) in the WSTF Safety S"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059920,
      "SummaryText": "ystem Responsibilities and Authorities emphasize the concept that safety is the individual and personal responsibility of everyone at WSTF. This safety concept is reinforced by WSTF's Star status in the OSHA Voluntary Protection Program (VPP). \n\n\n\nEmbedded within the management system processes, procedures, and instructions are key safety controls to properly contain and maintain the hazardous substances used and stored at WSTF. The primary controls are engineering controls focused on the safe design, build up, and operation of systems. Secondary controls, also embedded within the management system, include administrative controls such as the use of safety, caution and warning devices; training; and personal protective equipment. The application of controls follows WSTF's risk reduction hierarchy of controls. Embedded within the management system are emergency protocols to be followed in the event of an accidental release of a hazardous substance. WSTF's ISO 9001 registered management system establishes a strong basis for conformance to NASA policies and procedures and compliance with applicable Federal, State, and local regulations. \n\n\n\nWSTF's efforts to prevent accidental releases in the future begin with lessons learned from the past. WSTF has been conducting hazardous testing with liquid rocket propellants since the early 1960's. Our research and test experience have helped define hypergolic propellant hazards for the aerospace industry. Awareness of hazards is the first step in being able to design, build, operate and maintain safe, reliable systems. And designing, building, operating and maintaining safe, reliable systems is the key to preventing accidental releases. Prevention starts with good engineering practice.\n\nThe primary accidental release prevention measures are the primary engineering controls mentioned above-design, build up and operation. Each type of control has one or more management system documents dedicated to its implementation. These control"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059920,
      "SummaryText": "s are integral to WSTF's Process Safety Management instruction (WSI 25-SW-0005, Process Safety Management of Highly Hazardous Chemicals) which is based on 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals, and addresses each of the PSM elements.\n\n\n\nWSTF's Pressure Systems Program, which is based on ASME code and other relevant national consensus standards, is of paramount importance in establishing, implementing, and verifying mechanical integrity design standards. WSTF procedure WSP 25-0009, WSTF Emergency Preparedness Plan, provides directions for activities which: eliminate or reduce the probability of disaster; prepare measures which protect life, the environment, and property; respond appropriately during emergencies; and establish a recovery system returning the facility to normal or improved operation following an emergency. WSTF has chartered an Emergency Preparedness Planning Board which has the responsibility to continuously review the plan and assure its effective maintenance.\n\n\n\nB. Stationary Source and Regulated Substances Handled\n\n\n\nSeveral hazardous chemicals are essential in testing propulsion systems at WSTF. The EPA regulates one of these chemicals that WSTF possesses in an amount over the threshold quantity, the propellant monomethyl hydrazine (MMH). This propellant is used in several NASA, Department of Defense, and commercial aerospace propulsion subsystems. The hypergolic propellant MMH is used for engine testing and is contained in storage and run tanks. It is the only hypergolic propellant present at WSTF in quantities which exceed the Risk Management Program rule threshold quantity for the identified regulated substances. MMH storage containers (tanks, drums, cylinders, etc) are present in the 300, 400 and 500 Areas and are stored at ambient temperature and pressures up to 60-80 psig. Dump Tanks are used to receive propellant from run tanks not consumed during an engine test or as an emergency dump location as needed. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059920,
      "SummaryText": "Propellant in dump tanks is typically transferred back to run tanks or to longer term storage tanks, but can be stored in the dump tanks as well. Run tanks are present at the point of use and are used to store propellant for immediate use in engine testing. Propellants contained in run tanks can be saturated with helium up to 600 psia and temperature conditioned between 40 and 120 degrees F. Propellants can be pressure transferred between storage, run, and dump tanks. This RMP Update describes two processes that meet the definition of a covered process in which monomethyl hydrazine is stored in quantities above the regulated threshold of 15,000 pounds (~2,045 gallons [using the density of MMH unit 7.334 lbs/gal] ). The below brief descriptions of the RMP covered \n\nprocesses present the Maximum Intended Inventory for each identified RMP covered process. \n\n\n\n* The 400 Test Area Bi-Propellant Rocket Engine Testing - The Maximum Intended Inventory for this RMP covered process is 40,576 lbs (5,528 gallons). The bulk of the MMH is stored in the 400 Area RSU and the 400 Area Dump Tank. \n\n* The 500 Area Propellant Storage and Distribution - The 500 Area propellant storage location is used to store MMH in drums or DOT 4BW cylinders for long term storage. The storage area is separately fenced and access is controlled by lock and key. The Maximum Intended Inventory for MMH in the 500 Area Storage Area is 124,780 lbs (17,000 gallons). This can include mixtures of fuels that contain non-regulated substances such as hydrazine and Aerozine-50 (50/50 mixture of Hydrazine and Unsymmetrical Dimethylhydrazine (UDMH)). However, due to the construction of the area, the Maximum Intended Inventory of MMH per vessel is 24,222 lbs (3,300 gallons).  \n\n\n\nIn the 2014 NASA WSTF RMP submittal, Executive Summary, Section 9.0: Planned Changes to Improve Safety, NASA indicated that in 2015, the propellant storage and distribution systems will be removed from the 300 Area and 400 Area and relocated "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000059920,
      "SummaryText": "to the 500 Area Propellant Storage and Distribution Area. Despite a higher testing volume, NASA has successfully managed to lower the MMH storage capacity in the 300 Test Area. This volume reduction allowed a change in WSTF's testing philosophy, which includes moving large quantities of propellant out of the 300 Area test areas and into dedicated storage areas; removing large propellant quantities away from personnel located in the test areas, and utilizing smaller transport containers to provide only the quantity of propellant required for propulsion testing. Quantities of propellant, below regulated threshold volume, will be stored in the 300 Area Auxiliary Conditioning Units (ACUs) and Ready Storage Unit (RSU). To ensure the ACUs and RSU do not exceed the threshold quantities for MMH listed in Table 1 in Sec. 68.130, a Maximum Intended Inventory of 1,900 gallons was established in PTO-GEN-BSL-HAZA-008-PHA, Process Hazard Analysis for Propulsion Test Areas General Hazards (Including Highly Hazardous Chemicals).The volumes will be monitored and controlled through administrative working documents (WJI WJI-PROP-GEN-0002.J PROPELLANT AND PROPANE ACCOUNTABILITY) as well as liquid level indicators and tank labeling, preventing the exceedance of the regulated threshold level for MMH.  \n\n\n\nAs a prelude to the new propellant (MMH) storage configuration, WSTF procured a liquid propellant tanker which was designed to transport (on-site only), receive, offload, and store hypergolic fuels, such as MMH. The LT88 Fuel Tanker, consists of a dual-wheel, tandem axle, frameless chassis assembly, on which is mounted a 2,760 gallon liquid storage tank (2500-gal payload with 10 percent ullage) encapsulated in a protective jacket. It is also equipped with the associated fill and discharge piping and controls. The inner vessel is an American Society of Mechanical Engineers (ASME) lethal service pressure vessel with a certifying U-stamp. The inner vessel is constructed entirely of 304L st"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000059920,
      "SummaryText": "ainless steel. The outer vessel (jacket) completely surrounds and encapsulates the inner vessel. It is designed to be charged with a dry nitrogen blanket or a full vacuum to prevent corrosion of the inner vessel. The inner surface of the outer jacket is coated with an intumescent coating. This coating is an epoxy paint that is fire retardant and demonstrates insulating properties when exposed to extreme heat or flame. The tanker has been designed to meet the requirements of the DOT code MC-338. Detailed instructions for operating and performing maintenance operations for the tanker are provided in WJI-PROP-GEN-0048, Operations and Maintenance Procedure for Fuel Tanker LT88. The LT88 Fuel Tanker will transfer MMH between the 500 Area Interim Storage Area and onsite locations which include the storage tanks in the 300 Area and 400 Area. To ensure the LT88 Fuel Tanker does not exceed the threshold quantities for MMH listed in Table 1 in Sec. 68.130, a Maximum Intended Inventory of 2,000 gallons was established in PTO-GEN-BSL-HAZA-008-PHA, Process Hazard Analysis for Propulsion Test Areas General Hazards (Including Highly Hazardous Chemicals).\n\n\n\nC. General Accidental Release Prevention Program and Chemical-Specific Prevention\n\n\n\na.    WSTF Accidental Release Program\n\n\n\nThe White Sands Test Facility is strongly committed to safely conducting operations involving toxic and flammable substances, identifying and controlling to the greatest extent possible any hazards associated with these substances; and reducing any subsequent risk to the surrounding community and the environment. This commitment is inherent to the WSTF comprehensive accidental release prevention program that covers areas of design, installation, operations, maintenance, and employee training associated with the RMP covered processes. \n\nThe two RMP covered processes identified in Section B- Stationary Source and Regulated Substances, contain \"highly hazardous chemicals\" above the threshold quantities listed "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000059920,
      "SummaryText": "in 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals. Safety depends upon the manner in which WSTF handles these products combined with the safety devices inherent in the design of this facility. Thoroughly reviewed operating and maintenance procedures, safe work practices, and training of WSTF personnel supplement the inherent safe design of the MMH distribution systems.\n\nWSTF has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR 68, Chemical Accident Provisions. The facility has conducted a comprehensive review of all RMP covered processes, as well as a review of administrative, operating, and maintenance procedures, in addition to the other required program elements of the RMP Rule. WSTF developed and implemented the elements of the 40 CFR 68 Subpart D Program 3 Prevention Program for the RMP covered processes. These include:\n\n\n\n?68.65 Process safety information\n\n?68.67 Process hazard analysis\n\n?68.69 Operating procedures\n\n?68.71 Training\n\n?68.73 Mechanical integrity\n\n?68.75 Management of change\n\n?68.77 Pre-startup review\n\n?68.79 Compliance audits\n\n?68.81 Incident investigation\n\n?68.83 Employee participation\n\n?68.85 Hot work permit\n\n?68.87 Contractors\n\n\n\nThe following sections briefly describe the elements of the release prevention program that is in place at WSTF.\n\nProcess Safety Information - Detailed engineering drawings of the MMH distribution systems, chemical safety, operating parameters, and equipment safety information is compiled and readily available to operators and personnel involved in the operation and maintenance of the MMH distribution systems. The following information is compiled for each RMP covered process: \n\n* Hazards Information on the RMP regulated chemical (MMH) \n\n* Technology Information ( a block flow diagram or simplified process flow diagram, process  chemistry, maximum intended inventory, safe upper and lower limits for operating parameters, and an evalu"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000059920,
      "SummaryText": " facility and restoring the facility to normal operations. Examples of recovery actions are temporary relocation of offices disrupted by structural damage, restoration of non-vital government services, and reconstruction of damaged areas. \n\n\n\nAttachment Q, HAZMAT/ Hazardous Material/Waste Spill Response of the WSTF Emergency Preparedness Plan provides the policies and procedures for responding to emergency releases of hazardous material/waste and potential accidents that can have impact(s) on the environment. Individual area emergency response plans are developed to include specific hazards and responses in that area (such as the 300 Area, 400 Area, and 500 Area). The area plans indicate the individual (by function) in charge of local events and who is responsible for elevating the classification to an emergency status when the ability to safely contain the event is exceeded. Local plans are consistent with the WSTF Emergency Preparedness Plan (WSP 25-0009). Typically, the local area emergency response plans address incidental releases (minor spills) in that area. Provided below are some examples of local area emergency response plans (which interface with the WSTF Emergency Preparedness Plan): \n\n\n\n* WSI PROP-0044, Propulsion Test Area Spill Plan \n\n* WSI PROP-0055, 300 and 400 Area Propulsion Test Emergency Procedures Implementation \n\n\n\nIf an emergency situation is progressing towards a neighboring community, and has the potential to place them at risk, local authorities will be notified promptly by the Emergency Preparation Coordinator. \n\n\n\nAttachment I, Emergency Public Information of the WSTF Emergency Preparedness Plan provides for effective collection, control, and dissemination of emergency public information and for the minimization of confusion, misinformation, and rumors during times of emergency. WSTF is prepared to carry out initial emergency response and short-term actions on an independent basis. Should on-site resources prove to be inadequate during an"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000059920,
      "SummaryText": "ation of the consequences of deviation) \n\n* Equipment Information (materials of construction, electrical classification, relief system design and design basis, ventilation system design, design codes and standards, material and energy balances, and safety systems)\n\n\n\nThis Process Safety Information enables WSTF to perform a Process Hazard Analysis for each RMP covered process.\n\nProcess Hazard Analysis - WSTF conducts comprehensive studies to ensure hazards associated with the processes are identified and controlled efficiently. The methodology used to carry out these analyses is the What-If/Checklist to determine and evaluate the hazards of the process being analyzed (other appropriate hazard analysis methodologies may be used for subsystems). The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations, and are revalidated at least every 5 years after the initial analysis. Any findings related to the hazard analysis are addressed in a timely manner. \n\nA process hazard analysis (PTO-GEN-BSL-HAZA-008-PHA, Process Hazard Analysis for Propulsion Test Area General Hazards (Including Highly Hazardous Chemicals) includes the two RMP covered processes at WSTF. \n\nThis PHA was conducted in accordance with WSI 04-SW-0002, Hazard Analysis and WSI 25-SW-0005, Process Safety Management of Highly Hazardous Chemicals. The PHA addressed: \n\n\n\n* Hazards of the processes.\n\n* Identification of any previous incidents with relevance to the process which had a likely potential for catastrophic consequences. \n\n* Engineering and administrative controls applicable to the hazards. \n\n* Consequences of failure of the engineering or administrative controls. \n\n* Facility siting and hazardous area restrictions.\n\n* Human factors, such as ergonomics, fatigue, visibility.\n\n* Qualitative evaluations of potential health and safety effects. \n\n\n\nPHA recommendations and residual risks are addressed in accordance with WSP 04-0001, Design Control, WSI 04-S"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000059920,
      "SummaryText": "W-0003, System Safety Analysis, and the MSM Safety and Readiness Review Infrastructure Process. WSTF maintains the original analysis and resolution of recommendations for the life of the process. \n\n\n\nOperating Procedures - For the purposes of safely conducting activities within the RMP covered processes, WSTF maintains written operating procedures. Due to the nature of WSTF's operations, typically with a more short-term testing focus than long-term process focus, WSTF prepares specific testing operating procedures that utilize the RMP covered processes in the testing sequence. These test procedures are reviewed and approved by qualified NASA project managers and contractor project leaders prior to any testing operations. Test procedures no longer applicable are cancelled. WSTF also performs some longer-term testing which utilize the RMP covered processes such as the Peacekeeper Safing Program. In this case, these procedures are and will be reviewed annually until the testing requirements are cancelled. In addition to specific testing procedures, WSTF also maintains Test Area procedures that address area emergency response, propellant accountability, and facility setup and shutdown sheets. These Test Area procedures are readily accessible to employees who work in or maintain the process. The operating procedures may be reviewed more frequently to reflect current operating practice that results from changes in process chemicals, technology, equipment, and facilities. These procedures provide clear instruction for safely conducting activities which utilize the RMP covered processes and are consistent with the Process Safety Information and the Process Hazards Analysis. \n\n\n\nIn addition to test specific procedures, WSTF's framework for its accidental release prevention program includes: \n\n* Training of employees, from new hire status through in-depth system training, is accomplished and tracked in the SATERN Training Database. \n\n* System safety is accomplished in the des"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000059920,
      "SummaryText": "ign stages of programs through design review, system safety analyses, operational readiness inspections, and test readiness reviews. Integral to these reviews are the presentation of Failure Modes and Effects Analyses and Process Hazard Analyses. Changes to existing systems or processes require review and approval by appropriate personnel to ensure continued safe operations. \n\n* Process control is accomplished in the buildup and test phases of projects through step-by-step work instructions that are reviewed and authorized by project leaders and project managers. Emergency procedures are embedded within any instruction involving the use or handling of hazardous chemicals. WSTF pressure systems engineers approve appropriate standards of system construction, such as ASME pressure and piping codes for fluid systems. \n\n\n\nThese elements are described in greater detail in the following paragraphs.  \n\n\n\nTraining - Personnel whose job tasks are related to the operation and maintenance of the MMH distribution systems are given training on safe operation of the facility and safe use of the highly hazardous chemicals. Employees may be involved through self-managed learning (e.g., Hazard Communication training offered through SATERN), coaching and mentoring new employees, presenting training as subject matter experts, or on-the-job training. The training program includes both initial and refresher training. The training program is approved by NASA and is revised when process or equipment changes occur. Classroom training, written tests, demonstration and observation are types of training used to verify personnel understand the training material before they can resume work on the systems. WSTF has a comprehensive training program to ensure that employees operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every 3 years, and more frequently as needed. \n\nMechanical Integrity - NASA guidelines are fo"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000059920,
      "SummaryText": "llowed for maintaining the mechanical integrity of process equipment to help prevent equipment failures that could endanger personnel, public and the environment. The mechanical integrity program includes inspection, testing and re-certification of the storage systems and equipment to help identify equipment deterioration, malfunction and damage. Mechanical integrity requirements and the employee roles and responsibilities are documented in WSI 09-SW-0005, Legacy Pressure Systems and WSI 09-SW-0024, Pressure Systems. They provide instructions for the design, certification, repair, modification and decertification of ground-based pressure vessels and pressurized systems at or for WSTF, consistent with NASA-STD-8719.17, NASA Requirements for Ground-Based Pressure Vessels and Pressurized Systems (PV/S). \n\n\n\nEPA requires in 40 CFR 68.56(d) inspections and tests on process equipment. This regulation further identifies that the inspection and testing procedures utilized shall follow recognized and generally accepted good engineering practices (RAGAGEP). The frequency of inspections and tests of process equipment are consistent with applicable manufacturers' recommendations, industry standards or codes, good engineering practices, and prior operating experience. Similarly, OSHA requires in 29 CFR 1910.119(D)(3)(ii) documentation that equipment complies with recognized and generally accepted good engineering practices (RAGAGEP). WSTF has an ongoing process safety program to ensure facility design, construction, and maintenance uses good engineering practices consistent with recognized codes and standards. These national consensus codes and standards include those published by the National Fire Protection Association, American Society for Testing and Materials, American National Standards Institute, and American Petroleum Institute, where applicable. Equipment deficiencies, with regard to process operating parameters and hardware discrepancies, are recorded and corrected in "
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000059920,
      "SummaryText": "accordance with WSP 13 0001, Nonconformance Control. \n\n\n\nManagement of Change - Proposed changes to the equipment and operating procedures are evaluated and approved to ensure the change does not adversely affect the safety of operations. Processes are in place to manage changes in process chemicals, technology, equipment, procedures and process facilities. Essential to the success of the Management of Change system is the active participation of affected employees in the review and evaluation process to determine the impacts of proposed changes. Employees participate in the analysis, documentation, and implementation of changes to the process as described in WSI 25-SW-0005, Process Safety Management of Highly Hazardous Chemicals. Personnel whose job task will be affected are informed of and trained on changes made to a process and on the impacts of the changes prior to startup of the process. \n\n\n\nPre-startup Review - A safety review of a new or modified process is performed following NASA guidelines before the system is brought into service. This review confirms the design and construction of the equipment are in accordance with the design specifications; safety, operating, maintenance and emergency procedures are in place; employee training has been completed; and a process hazard analysis has been completed. The training cited previously, along with safety and readiness reviews such as Facility Readiness Reviews, System Readiness Reviews, and Test Readiness Reviews; the process operation briefings, and combined system validations are Pre-startup Reviews of the process conducted by management and the employees. \n\nCompliance Audit - Compliance audits of the MMH distribution systems are conducted per schedule as part of WSTF's internal audit program to ensure the prevention program effectively addresses the safety of the storage systems. The audits are conducted by trained auditors with knowledge of the process or similar processes and reviewed by NASA personnel. Au"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000059920,
      "SummaryText": "dit results are documented and recommendations are resolved following a developed schedule, and appropriate enhancements to the prevention program are implemented. Employees participate in compliance audits as internal auditors and interviewees. These audits are conducted at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner. \n\n\n\nIncident Investigation - WSTF promptly investigates all incidents that have resulted in or could reasonably have resulted in a serious injury to personnel, the public, or the environment so similar accidents can be prevented. An investigation team initiates an investigation to identify the situation leading to the incident, as well as any corrective actions to prevent the release from reoccurring. All reports are retained for the life of the process. Employees participate in the incident investigations as described in WSI 25-SW-0009, WSTF Mishap Preparedness and Contingency Plan. Specific training for mishap investigation team members is provided. Upon management acceptance of the report, all affected personnel are informed of any changes and may be involved in the implementation of recommendations. Resolutions and corrective actions are documented. Close calls are investigated at WSTF as described in WSI 25-SW-0028, Close Call Reporting, Tracking, and Corrective Action. The objective of the close call system is to correct the root cause of close call incidents in order to prevent incident recurrences and avoid potentially catastrophic results. \n\n\n\nEmployee Participation - WSTF believes process safety management and accident prevention is a team effort. The purpose of the WSTF Employee Participation Plan is to encourage employees and their representatives to participate, where applicable, on the development of the various elements contained within 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals. All employee concerns are addressed promptly. Al"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000059920,
      "SummaryText": "l employees have access to process documentation archived as management system records. In addition, WSTF employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular. \n\n\n\nHot Work Permits - WSTF employees request a Hot Work Permit for hot work operations on or near an RMP covered process per WSI 25-SW-0013, Hot Work Permit for Welding, Cutting, Open Flame or Spark Producing Operations. Hot Work is defined as work involving electric or gas welding, cutting, brazing, or similar flame or spark-producing operations. (Note: Cutting as used in the procedure means any spark-producing cutting, not the use of a hacksaw.) Employees ensure fire prevention and protection requirements have been implemented prior to starting the hot work. The job is physically inspected and the Hot Work Permit signed (approved) by a WSTF Emergency Services representative prior to beginning the operation. \n\n\n\nContractors - WSTF has a program with procedures to ensure contractor activities are performed in a safe manner. The safety record of contractors is reviewed annually. Employees participate in the Contractor element through the procurement process when contractors or subcontractors are needed. This includes evaluating performance before and after contract award, notifying personnel of potential hazards, and developing, implementing, and monitoring safe work practices. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur. Offsite or onsite contractors and service vendors performing maintenance, repair, renovation, or specialty work on or adjacent to a covered process must adhere to the requirements of WSI 25-SW-0005, Process Safety Management of Highly Hazardous Chemicals.\n\n\n\nb. WSTF Chemical-Prevention Steps \n\n\n\nIn addition to the Program Level 3 elements required for RMP covered processes, W"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000059920,
      "SummaryText": "STF has implemented safety features specific to the RMP regulated chemical (MMH) according to NASA guidelines. WSTF implements appropriate controls to prevent possible releases of regulated substances. The Preventive Program 3 provides extensive maintenance and operator training to ensure the mechanical integrity of the systems is maintained for the life of the RMP covered process. Program Level 3 also incorporates administrative controls when modifications are made to the covered process, so the training and preventative programs are updated as the system expands and changes. \n\n\n\nThe RMP covered MMH process is also regulated by Process Safety Management. WSTF's Process Safety Management instruction, WSI 25-SW-0005, Process Safety Management of Highly Hazardous Chemicals, addresses all 14 elements of 29 CFR 1910.119. Process hazard analyses are performed, utilizing the site instruction, WSI 04-SW-0002, Hazard Analysis. Mechanical integrity is achieved primarily through the site's pressure systems program as implemented by WSI 09-SW-0005, Legacy Pressure Systems, and WSI 09- SW-0024, Pressure Systems. The design review process includes thorough consideration of materials of construction and fluid compatibility. The Hypergol Material Approval Committee and the Pressure Systems Design Group coordinate on fluid/material evaluations and component and system level analyses. System configurations, review documentation, procedures, and maintenance records are controlled by an ISO certified quality management system. Employee training is extensive and is managed through NASA's online training database, SATERN. At the process level, the following are examples of additional risk mitigations employed: \n\n\n\n* Pressure system certification to NASA standards at defined interval (primarily based on degradation mechanisms, not to exceed 10 years). \n\n* Weekly propellant accountability checks.\n\n* Daily scans at random system locations with propellant vapor detectors to ensure systems a"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000059920,
      "SummaryText": "re leak tight.\n\n* Special cold weather protocols are in place to restrict personnel access and increase scans for chemical vapors particularly in process locations known to leak at temperatures below 35 degrees F. \n\n* Propellants are stored over concrete surfaces with secondary containment and water deluge systems.\n\n* Bulk quantity transports are coordinated with site Protective Services personnel, who then decide how to stage themselves, based on location and wind direction, to support an unplanned release.\n\n* Readiness reviews, dry runs of approved procedures, and pre-task safety briefings are performed to ensure personnel understand the task at hand, are aware of what to expect, and can recognize and respond to an upset condition when it occurs. \n\n\n\nChemical-specific prevention steps for MMH are detailed in several site documents. For example:\n\n\n\n* WSI PROP-0047, Special Requirements and Precautions for Conducting Toxic Propellant Operations details guidelines for the handling of the earth storable propellants, nitrogen tetroxide, and the hydrazine family of fuels.\n\n* WSI 09-SW-0012, Control of Materials Used in Hypergol Systems, details the materials of construction for fluid system piping and specifies the type of valve softgoods that may be used for the hydrazine family of fuels.\n\n* WSI 09-SW-0013, Chemical and Particulate Cleanliness for WSTF Fluids, specifies the level of cleanliness that must be obtained and maintained before wetting a system with MMH.\n\n* WSI 25-SW-0008, Toxic Propellant Safety provides instructions for temporary storage of propellants, for special handling, marking of system components used in hypergolic propellant systems, and instructions for scrapping, excessing, or loaning components or systems.\n\n* WSI 25-SW-0007, Personal Protective Equipment identifies the type of personal protective equipment required when working near MMH.\n\n\n\nD. The Five-Year Accident History\n\n\n\nWhen an RMP is updated as required by 40 CFR 68.190 of the rule, it mu"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000059920,
      "SummaryText": "st contain an updated Five-Year Accident History including all of the accidents that meet the reporting criteria and that occurred within five years of the date on which the updated RMP is submitted.\n\n\n\nThe Five-Year Accident History involves the reporting of significant accidental releases of RMP regulated substances from an RMP covered process in the five years prior to the submission of an initial or updated Risk Management Plan. The Five-Year Accident History covers only certain releases:\n\n\n\n* The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\n* The release must have caused at least one of the following:\n\n* On-site deaths, injuries, or significant property damage (40 CFR 68.42(a)); or\n\n* Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (40 CFR 68.42(a)).\n\n\n\nEPA identifies in EPA 555-B-04-001, General Guidance on Risk Management Programs for Chemical Accident Prevention that if there has been a release of a regulated substance from a process where the regulated substance is held below its threshold quantity, then a facility does need to report that release even if the release caused one of the listed impacts.\n\n\n\nAn incident investigation is a requirement of the rule (40 CFR 68.60 and 40 CFR 68.81). Since WSTF is a Prevention Program Level 3, each incident which resulted in, or could reasonably have resulted in, a catastrophic release of a regulated substance must be investigated. WSI 25-SW-0009, WSTF Mishap Preparedness and Contingency Plan provides instruction for notifications, investigation and documentation of mishaps and contains the WSTF Mishap Preparedness and Contingency Plan. A Mishap is defined as an event that causes death, injury, or unexpected property damage or environmental harm. Damage to a test article is not a mishap if the test article damage was expected to occur as a result of the test and the expectation is f"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000059920,
      "SummaryText": "ormally documented and customer agreement obtained (reference to NPR 8621.1, NASA Procedural Requirements for Mishap and Close Call Reporting, Investigating, and Recordkeeping). In Section 5.a(2)(g), this procedure identifies that once a mishap report has been accepted (endorsed), Supervisors submit a corrective action plan, including identification of individuals responsible for corrective action performance and estimated date of completion, to the appointing official for approval. \n\n\n\nIn Section 5.a.(4), this procedure identifies that NASA and/or contractor SM&A will verify corrective actions are implemented before closure and track all items to completion, noting specific results and rationale for closure. A file of mishap reports and closure rationale is maintained, and incident summaries, lessons learned, or alerts are distributed as determined appropriate by WSTF Management and S&MA. \n\nWSI 25-SW-0028, Close Call Reporting, Tracking, and Corrective Action provides instructions for reporting and investigating close calls. The objective of the close call system is to correct the root cause of close call incidents in order to prevent incident recurrences and avoid potentially catastrophic results. A close call is defined as an occurrence in which there is no injury (first aid or medical treatment), no significant equipment/property damage (less than $1,000), and no significant interruption of productive work, but which possesses a potential for Mishap. Anyone on site can use WSTF Form 412, WSTF Close Call Reporting to identify unsafe acts or conditions observed in the work place or on-site. The WSTF Form 412A, Close Call Response, Approval & Follow-up Form is used to address close calls and to document corrective actions (if any).\n\n\n\nOSHA's Log of Work-Related Injuries and Illnesses, OSHA Form 300, is used for recording and classifying recordable occupational injuries and illnesses, and for noting the extent and outcome of each case. The log shows when the occupat"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000059920,
      "SummaryText": "ional injury or illness occurred, to whom, what the injured or ill person's regular job was at the time of the injury or illness exposure, the kind of injury or illness, how much time was lost, and whether the case resulted in a fatality. \n\n\n\nThe WSTF Environmental Department documents spill/releases that occurred to the environment, which includes the RMP regulated substances from RMP covered processes. During the records review, it was identified there was a release of MMH to the environment from a RMP covered process (500 Area Storage and Distribution System). Spill Report (SPL-2016-316, dated 04/05/2016) documents a release of approximately 0.9 pound of MMH from a flange. It was determined that flange bolts were not torqued to specification and were then re-torqued to specification. Spill Report (SPL-2016-320) documents a release of approximately 1.0 ounce of MMH from the 300 Area Fuel Dump Tank cap. The cap was replaced and was checked with a fuel monitor verifying there is no residual fuel remaining. Spill Report (SPL-2016-325) documents a release of approximately 4.0 teaspoons of MMH from a connected fitting during a flex hose swap out. The fitting was re-connected and tightened. There were no off-site consequences or on-site consequences from this release of MMH that met the RMP requirements for inclusion in the RMP Five-Year Accident History. \n\n\n\nSummary\n\n\n\nThere has not been an accidental release of the RMP regulated substances from the RMP covered processes at WSTF in the last 5 years that has resulted in death, injury, or significant property damage on site, nor any deaths, injuries, evacuations, sheltering in place, property damage or environmental damage offsite. This determination was reached after reviewing the WSTF Mishaps, Close Calls, OSHA Form 300 Log of Work- Related Injuries and Illnesses, and the Environmental Spill Reports.\n\nIn accordance with 40 CFR 68.195(a), NASA will correct the 2014 WSTF Risk Management Plan with any new accident history"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000059920,
      "SummaryText": " information for any accidental release meeting the Five-Year Accident History reporting criteria of 40 CFR 68.42. NASA will submit the release data with respect to that accident within six months of the release or by the time the RMP is updated under 40 CFR 68.190, whichever is earlier.\n\n\n\nE. Worst-Case and Alternative Release Scenarios\n\n\n\nToxic plume dispersion modeling for WSTF's two identified regulated processes was performed for a Worst-Case Release Scenario and an Alternative Release Scenario using the software program TRACE 10.2 (Toxic Release Analysis of Chemical Emissions).\n\n\n\nTRACE 10.2 was used because it can simulate toxic chemical releases using a set of sophisticated algorithms for modeling tank failures, pipe leaks, physical phenomena at the release source, dense gas modeling and Gaussian dispersion. Released in December 2012, TRACE 10.2 features new modeling enhancements which include a new pool evaporation algorithm. This new algorithm is used to represent a pool shrinking phase based on a constant radius as opposed to a constant height. Additionally, the number of data points for the pool evaporation calculations were increased, which has the effect of smoothing the evaporation rate profiles and accommodating the dynamics more accurately\n\n\n\na. Worst-Case Release Scenario\n\n\n\nBoth RMP covered processes were modeled to determine which presented the greatest risk of exposure to public or environmental receptors. It should be noted that of all the Worst-Case Release scenarios analyzed for the 2016 WSTF Risk Management Plan Update, none of the toxic endpoint distances reached a public or environmental receptor.\n\n\n\nModeling results identified that the 400 Test Area Bi-Propellant Rocket Engine Testing covered process posed the greatest risk of the three RMP covered processes and is the covered process that will be reported. The 400 Area MMH Ready Storage Unit (RSU) is the largest storage tank in the 400 Test Area Bi-Propellant Rocket Engine Testing covere"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000059920,
      "SummaryText": "d process. It has a total storage volume of 6,220 gallons of MMH. \n\n\n\nThe Maximum Intended Inventory for this tank is less than the above described volume to allow for ullage and is controlled by the WSTF operating procedure PTO-GEN-BSL-HAZA-008-PHA, Process Hazard Analysis for Propulsion Test Areas General Hazards (Including Highly Hazardous Chemicals). The Worst-Case Release Scenario postulates a catastrophic release from the tank when the operating volume of 5,164 gallons (37,873 lbs) of MMH is instantaneously released from the RSU at ground level into a 1,230 sq. ft. concrete diked area. The total containment volume of the diked area was 1,230 cu. ft. Upon release of the MMH into the concrete diked area, there was subsequent vaporization of MMH into the air. \n\n\n\nMeteorological conditions used for the Worst-Case Release scenario were those specified by 40 CFR Part 68.22. The ambient and in-vessel fluid temperature used was 108 ?F and a 30% humidity with a wind speed of 3.4 mph was used in the model. An atmospheric stability class of \"F\" (very stable) was used. The topography was identified as rural for WSTF. EPA identifies that a rural terrain is one which is generally flat and unobstructed in the immediate area. \n\n\n\nThe MMH toxic endpoint from 40 CFR Part 68, Appendix A is 0.0094 mg/L. The Risk Management Program Guidance for Offsite Consequence Analysis (EPA 550-B-99-009), Exhibit B-2, indicates a converted value of 5 ppm which as used in the model. Once the MMH was released from the tank, it formed a pool within the concrete diked area. From the model output, the maximum evaporation rate from the pool was 6.4 lbs/min with a total pool evaporation time of 6,020.1 minutes. The TRACE model results indicate a maximum MMH toxic endpoint distance of 6,041 ft or 1.14 miles. \n\n\n\nDue to the large buffer zone surrounding WSTF, there are no public or environmental receptors within a 1.52 mile radius from the point of release to the toxic endpoint distance. \n\n \n\nb. Altern"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000059920,
      "SummaryText": "ative Release Scenario\n\n\n\nIn determining an Alternative Release Scenario, 40 CFR 68.28, Alternative Release Scenario Analysis identifies in ?68.28(a) that the facility shall identify and analyze at least one alternative release scenario for each regulated toxic substance held in a covered process(es) and at least one alternative release scenario to represent all flammable substances held in covered processes. \n\n\n\nUpon consideration of the credible releases, a shipping container mishandling scenario was selected for the 500 Area Propellant Storage and Distribution covered process. The Alternative Release Scenario chosen involves one 120-gallon 4 BW cylinder of MMH being transported from the 500 Area Interim Storage Area to the 400 Test Area. While loading or unloading the 120-gallon 4 BW cylinder of MMH onto the transport trailer, there is an accident that causes the cylinder to be physically dropped off the transport vehicle, resulting in a rupture of the drum and a release from the 120-gallon cylinder. An instantaneous release was predicted as the cylinder is under 50 psig (during transport). The response by the on-site Fire Department was estimated to be 15 minutes, which includes curtailment of the release from the cylinder.\n\nThe Alternative Release Scenario is a liquid release of 100 % MMH, which is identified as a toxic liquid. The postulated release resulted in 120 gallons (880 lbs) of MMH being released at ground level onto an unconfined soil area (not diked). Upon release of the MMH onto the unconfined soil area, there was subsequent vaporization of MMH into the air. Meteorological conditions used for the Alternative Release scenario were those selected as representative based on data from the WSTF Facility Master Plan. The shipping container mishandling scenario was modeled as a liquid stream released continuously at 108 ?F at ground level with 30% humidity with a wind speed of 15 mph. An atmospheric stability class of \"F\" (stable) was used. The topography "
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000059920,
      "SummaryText": "was identified as rural for WSTF. From the model output, the maximum evaporation rate from the released MMH was 4.0 lb/min with a total evaporation time of 233.7 minutes. The TRACE results indicate a maximum MMH toxic endpoint distance of 445.2 ft or 0.084 miles. \n\n\n\nDue to the large buffer zone surrounding WSTF, there are no public or environmental receptors within a 1.38-1.52 mile radius from the point of release to the toxic endpoint distance. \n\n\n\nF. Emergency Response Program\n\n\n\nThe WSTF Emergency Preparedness Plan (EPP; WSP 25-0009) is the basis for the WSTF emergency response program. This Plan provides direction to mitigate the effects of hazards, preserving life and minimizing damage to WSTF operations and infrastructure. This Plan directs response during emergencies, and establishes a recovery system in order to return the facility to normal operations after a major incident, such as a natural disaster or a technological accident. \n\n\n\nThe Plan, which is maintained at WSTF, establishes an Emergency Preparedness Coordinator, who is responsible for direction and control of emergency response elements at WSTF. The Plan establishes an Executive Group, top-level managers who are responsible for consultation of site issues and allocation of resources to contend with an emergency beyond those inherently provided to an Incident Commander. \n\nThe Emergency Services Section, which includes the WSTF Fire Department, provides the resources to deal with emergency situations related to firefighters, emergency medical response, hazardous materials response, and confined space rescue response. The WSTF Fire Department is responsible for the training and equipment of the team. The WSTF Fire Department coverage is provided full-time, 24-hours a day. \n\n\n\nWSTF has developed plans and procedures to protect life and property from the effects of hazardous events. In the EPP there is a Hazard/Threat Identification Analysis table that lists the possible hazards and the likelihood of "
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000059920,
      "SummaryText": "occurrence. The priority for the Plan follows the likelihood of a hazard occurrence. This policy is based upon the concept that emergency functions for various organizations involved in emergency management will generally parallel normal day-to-day functions. Activities that do not contribute directly to resolving the emergency may be postponed or redirected for the duration of any emergency, making labor, materials, and equipment available for emergency use. \n\n\n\nWSTF utilizes the Incident Command System (ICS) in the handling of emergencies. Fire, medical, and chemical spills that exceed WSTF local area capabilities to handle safely are examples of emergencies that will be handled using the ICS. Emergencies of all types will be dealt with at the lowest level that is practical and safe. When an incident is elevated to an emergency classification, there is a clear transition of authority to an Incident Commander once they arrive on the scene, and the local person in charge functions as a unified commander or technical advisor. WSTF follows an all-hazard approach and acknowledges that most responsibilities and functions performed during an emergency are not hazard specific. This approach accounts for activities before, during, and after the emergency. WSTF addresses emergency management in four phases:\n\n\n\n* Mitigation activities eliminate or reduce the probability of a disaster occurring. Included are those long-term activities that lessen the undesirable effects of unavoidable hazards, such as natural disasters.\n\n* Preparedness activities develop the response capabilities needed in the event of an emergency. Planning and training are among the activities conducted under this phase. \n\n* Response is the actual provision of emergency services during a crisis that helps to reduce casualties and damage and to speed recovery. Response activities include warning, evacuation, rescue, and other similar operations. \n\n* Recovery operations include restoring vital services to the"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000059920,
      "SummaryText": " emergency, requests for assistance from other local jurisdictions and other agencies may be made in accordance with existing or emergency negotiated mutual aid agreements. WSTF will coordinate help requested from off-site with outside agencies to fully establish a comprehensive plan to address hazards at WSTF. Such assistance may take the form of equipment, supplies, personnel, or other available capabilities. This coordination effort differs from those emergencies handled on a daily basis by WSTF firefighters, security, and medical services personnel. \n\n\n\nAttachment H, Medical and Occupational Health of the WSTF Emergency Preparedness Plan coordinates health and medical services during emergency situations to reduce death and injury. This attachment also outlines damage assessment and restoration of essential health and medical services within WSTF during and immediately following a disaster. The on-site Clinic and Emergency Medical Services are responsible for the day-to-day provision of medical services at WSTF. Provided in WJI-S&MA-0004, Emergency Medical Services are instructions for care for medical emergencies that are responded to by WSTF Fire and Emergency personnel. Additionally, in WSI S&MA-CLINIC-0001, WSTF Clinic Operating Plan instructions are provided for staffing, planning and performing duties in the WSTF Clinic in support of the occupational medicine activities at WSTF. \n\n\n\nThe WSTF HAZMAT Response Team consists of WSTF Fire Department personnel who are trained to the HAZMAT Technician level. The Fire Department is responsible for HAZMAT Response Team training and equipment. \n\nWithin the WSTF hazardous test areas, supervisors are responsible for writing plans for emergency response actions to secure the test systems, alert personnel, and evacuate personnel to assembly areas as directed by the cognizant Office Chief or Department Manager/Director. The HAZMAT Response Team will be called when it is determined by the local area person in charge that "
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000059920,
      "SummaryText": "the condition constitutes an emergency. Incidental spills (minor spills) are handled and controlled by appropriately trained personnel within the area. \n\n\n\nAttachment Q, HAZMAT/ Hazardous Material/Waste Spill Response of the WSTF Emergency Preparedness Plan provides the policies and procedures for responding to emergency releases of hazardous material/waste and potential accidents that can have impact(s) on the environment. \n\n\n\nAttachment A, Warning of the WSTF Emergency Preparedness Plan provides a plan for disseminating timely warnings to the WSTF community and its employees, including the ADF-SW and WSC (TDRSS) stations, and other jurisdictions who could be affected by an impending hazardous situation. All components of the warning system are tested at least monthly. For hazardous chemical spills, a siren is utilized to notify employees of a chemical release requiring evacuation to a designated assembly area (shelter in place). WSTF also has a \"ringdown\" phone system for communication between test areas and the NASA Dispatch Center. \n\n\n\nAttachment C, Shelter and Mass Care, and Accountability of the WSTF Emergency Preparedness Plan defines the areas at WSTF that will be used for the shelter and care of personnel in the event of short-duration emergencies and establishes employee accountability expectations and procedures. \n\n\n\nAttachment E, Evacuation of the WSTF Emergency Preparedness Plan provides for the orderly and coordinated evacuation of all or any part of, WSTF if it is determined that such action is the most effective means available for protecting employees from the effects of a disaster or hazardous material/waste release. \n\n\n\nAttachment T, Training of the WSTF Emergency Preparedness Plan provides planning for a comprehensive training program in emergency management for all departments and personnel who support the emergency services at WSTF.\n\n\n\nAll employees who work on-Site have the potential of being exposed to hazardous materials (such as the RMP reg"
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 1000059920,
      "SummaryText": "ulated chemical, MMH), and therefore must annually take WSTF-OHS-HAZCOMCBT, WSTF Hazard Communication and Emergency Response. After first taking an instructor-led class, employees take annual training through the on-line training class accessible through SATERN (System for Administration, Training, and Educational Resources at NASA). Employees that work directly with or routinely handle hazardous chemicals receive additional substance-specific chemical training depending upon their job duties. \n\n\n\nAttachment P, Hazard Mitigation of the WSTF Emergency Preparedness Plan describes hazard mitigation planning and implementation measures to accomplish the long-term prevention or reduction of the adverse impact of natural and other hazards at WSTF.\n\n\n\nWSTF emergency plans are updated as necessary based upon deficiencies identified by drills and exercises, changes in local management structure, and technological changes. Exercises of the Emergency Response Program are performed annually.\n\n\n\nWSTF has an Emergency Preparedness Planning Board which is appointed by the NASA WSTF Manager with responsibility for maintenance and review of the WSTF Emergency Preparedness Plan, the goal is to ensure that WSTF emergency preparedness is in a continual state of readiness. Additional responsibilities (not an exhaustive list) are 1) to ensure WSTF local area emergency response plans and procedures are consistent with the WSTF Emergency Preparedness Plan; and 2) develop, plan, and conduct emergency exercises to effectively challenge and improve individual and collective response to an emergency at WSTF. \n\n\n\nAdditionally, 40 CFR 68.95(c) identifies the emergency response plan must be coordinated with the community plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA, also known as SARA Title III). The Dona Ana County/City of Las Cruces LEPC receives the annual SARA Title III Emergency and Hazardous Chemical Inventory Tier II Report from WSTF. In addition, at t"
    },
    {
      "ESSeqNum": 28,
      "FacilityID": 1000059920,
      "SummaryText": "he request of local emergency planning or response officials, a facility must provide any information necessary for developing and implementing the community plan.  \n\n\n\nWSTF recognizes the need for public awareness where hazardous chemicals are concerned. Representatives from WSTF participate in the Dona Ana County/Las Cruces Local Emergency Planning Committee (LEPC). They brief the committee on what chemicals are located on site, what processes they are involved in, and what safety precautions are taken to ensure the safety of employees as well as the public. The Dona Ana County/City of Las Cruces All-Hazard Emergency Operations Plan identifies the WSTF Fire Department as a critical resource dependency for Emergency Medical Services transport and for HAZMAT Response. \n\n40 CFR 68.195(b) identifies that within one month of any change in the RMP emergency contact information required under ?68.160(b)(6), WSTF shall submit a correction of that information. 40 CFR 68.160(b)(6) identifies that the RMP must include the name, title, telephone number, 24-hour telephone number, and the e-mail address (if an e-mail address exists) of the emergency contact. WSTF will update emergency contact information identified in the 2014 WSTF Risk Management Plan within one month of any change of the required contact information.\n\n\n\nG. Planned Changes to Improve Safety\n\n\n\na. Improvements for Water Deluge System for Propellant Storage Tanks\n\n\n\nRemotely actuated water deluge systems are installed throughout the test areas to protect storage vessels and equipment in the case of fire. The majority of locations that house permanent storage tanks of hypergolic propellants are provided with water deluge systems. These water deluge systems are systematically tested per WJI PROP-300-0027, 300 Area Firex System Check Out Procedure and WJI PROP- 400-0007, 400 Area Firex System Check Out Procedure. For the storage locations that do not have a water deluge system, the on-site Fire Department can quick"
    },
    {
      "ESSeqNum": 29,
      "FacilityID": 1000059920,
      "SummaryText": "ly respond to any fires. Routine inspections of the storage areas and test areas are performed during off-hours by Security and Fire Department personnel. \n\n\n\nAn improvement is planned for the 300 Area MMH Dump Tank water deluge system. Currently this tank is only partially covered by the water deluge system. This item is identified and tracked in the Safety Inspection Management System (SIMS) database as item #6706. The risk related to this item was covered in the PTOGEN- BSL-HAZA-008-PHA, Process Hazard Analysis for Propulsion Test Areas General Hazards (Including Highly Hazardous Chemicals) and is also being tracked in the open action tracking TPS (webPAPER Record # 104789). The scheduled completion date for this improvement is March 1, 2017.\n\n\n\n\n\n"
    }
  ]
}