{
  "FacilityID": 1000104574,
  "FacilityName": "Burdick & Jackson",
  "FacilityStr1": "1953 South Harvey Street",
  "FacilityStr2": null,
  "FacilityCity": "Muskegon",
  "FacilityState": "MI",
  "FacilityZipCode": "49442",
  "Facility4DigitZipExt": "6184",
  "FacilityCountyFIPS": "26121",
  "LEPC": "Muskegon County LEPC",
  "FacilityLatDecDegs": "43.216667",
  "FacilityLongDecDegs": "-086.206667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.honeywell.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 139691877,
  "ParentCompanyName": "Honeywell International, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Honeywell International, Inc.",
  "OperatorStr1": "855 South Mint Street",
  "OperatorStr2": null,
  "OperatorCity": "Charlotte",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28202",
  "OperatorZipCodeExt": null,
  "FTE": 72,
  "OtherEPAFacilityID": "MID72575731",
  "EPAFacilityID": "100000098592",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-09-27 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-03-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-05-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-05-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-05-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.216667,
  "FRS_Long": -86.206667,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000130420,
      "AltID": "North Tank Farm",
      "FacilityID": 1000104574,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000163560,
          "ProcessID": 1000130420,
          "ChemicalID": 4,
          "Quantity": 130000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000163561,
          "ProcessID": 1000130420,
          "ChemicalID": 92,
          "Quantity": 61000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131815,
          "ProcessID": 1000130420,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000112369,
              "Process_NAICS_ID": 1000131815,
              "SafetyReviewDate": "2022-07-28 00:00:00",
              "PHA_Date": "2022-07-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-07-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire monitor nozzles with AFFF foam",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Heat sensors in North Tank Farm",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-01-06 00:00:00",
              "TrainingReviewDate": "2022-03-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-07-28 00:00:00",
              "EquipmentInspectionDate": "2024-03-04 00:00:00",
              "EquipmentTested": "Still 7 Pressure Transmitter",
              "ChangeMgmtDate": "2024-03-05 00:00:00",
              "ChangeMgmtReviewDate": "2024-03-01 00:00:00",
              "PreStartupReviewDate": "2024-02-01 00:00:00",
              "ComplianceAuditDate": "2023-02-03 00:00:00",
              "AuditCompletionDate": "2026-02-03 00:00:00",
              "IncidentInvestigationDate": "2024-01-10 00:00:00",
              "InvestigationChangeDate": "2024-05-10 00:00:00",
              "ParticipationPlansReviewDate": "2023-01-06 00:00:00",
              "HotWorkPermitReviewDate": "2023-10-17 00:00:00",
              "ContractorSafetyReviewDate": "2022-09-12 00:00:00",
              "ContractorSafetyEvalDate": "2022-09-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000141202,
                  "PreventionProgram3ID": 1000112369,
                  "ProcessChemicalID": 1000163560
                },
                {
                  "PrimaryKey": 1000141203,
                  "PreventionProgram3ID": 1000112369,
                  "ProcessChemicalID": 1000163561
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104574,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-01-18 00:00:00",
    "ERTrainingDate": "2022-09-08 00:00:00",
    "CoordinatingAgencyName": "City of Muskegon Fire Department",
    "CoordinatingAgencyPhone": "2317246792",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "OSHA 29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000104574,
      "SummaryText": "ent who would direct all community response activities in conjunction with the site Incident Commander. The site organizes emergency response drills and conducts them at least annually. Plant tours are offered annually for public emergency responders to become familiarized with the facility layout, potential hazards and emergency response plans.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nHoneywell Muskegon maintains a commitment to continuously improve the safety of plant processes through improvement initiatives and employee input. One example of a major safety initiative is described below.\n\nA recommendation from the 2020 Honeywell Corporate Process Safety Management Audit was to install an early warning/detection of a release system throughout the facility. The site installed point-source LEL monitors and Chloroform monitors in applicable processing areas with local audible and visual alarms. These alarms are also tied into a new PLC system with displays in the main Production offices."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104574,
      "SummaryText": "reviews; and h) a thorough area-specific training program for process operators and maintenance personnel. \n\nChemical specific prevention steps include: a) developing an understanding among the operators regarding the hazardous properties of chloroform and ethyl ether, the process chemistry, and inadvertent mixing of incompatible chemicals; b) establishing safe operational process limits such as temperature, pressure and flow; b) understanding and preventing the consequences of unsafe chemical handling and process deviations; c) having knowledge of the requirements, capabilities and limitations of both personal protective and emergency response equipment and maintaining easily accessible inventories of each; d) designing the process technology and process equipment based on a thorough understanding of the hazardous properties of chloroform and ethyl ether; and e) providing operators with specialized training for chloroform and ethyl ether with proper handling procedures.\n\nFIVE YEAR ACCIDENT HISTORY\nNo accidental releases from chloroform (toxic) or ethyl ether (flammable) stationary sources, that would have an effect beyond the property line, have occurred at the Honeywell Muskegon site in the past five (5) years.\n\nEMERGENCY RESPONSE PLAN\nHoneywell Muskegon has an emergency planning and response program with a written Emergency Response Plan designed to address responding to accidental releases and other unplanned events that could occur at the facility, specifically those involving chloroform and ethyl ether. The Plan provides for both internal site and external community emergency alerting and notification processes with multiple means of communication. The Plan also addresses emergency medical care, sheltering in place, evacuation, emergency responsibilities, response and control procedures, and emergency equipment.  The site utilizes an Incident Command System to direct and coordinate response activities. The Plan has been developed with the Muskegon Fire Departm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104574,
      "SummaryText": "olicy at the facility involves integration of Honeywell Standards along with senior management commitment to safety and implementation of safe procedures and safe practices. Some of these elements include: employee participation in all PSM elements, safety devices and technologies inherent in the design of the processes, safe operational procedures and management practices, operator training, emergency response plans, maintenance of emergency response equipment, coordination with local emergency response services and communicating with the community. The site's PSM program is outlined in HSE procedure 12-301, Process Safety Management System.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nThe general accidental release prevention and emergency response policy associated specifically with the facility's use of chloroform and ethyl ether involves integration of Honeywell Standards with the OSHA PSM standard and EPA RMP Regulation. This policy includes the following elements: a) established process safety management system for oversight and control of the chloroform and ethyl ether processes; b) development and implementation of accurate procedures for safe operation and maintenance of the process; c) an on-going mechanical integrity program that ensures critical process equipment is designed, constructed and installed in accordance to codes and standards and is also inspected, tested and proactively maintained; d) performance of process hazards analyses with resolution of recommendations and revalidating for inherently safer processes/technologies; e) use of safety shutdown, relief and vent systems, interlocks, dikes, and other secondary containment installations, control instrumentation and process monitoring for early warning and detection; f) implementation of procedures designed to review and manage changes to the process; g) performance of incident investigations, process safety compliance audits, and pre-startup safety"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104574,
      "SummaryText": "rage, processing and packaging. Solvents can be processed using distillation, blending or filtration/adsorption and then packaged in a wide variety of innovative packaging solutions for distribution. The final products, high purity solvents, are used in a variety of different industries for laboratory testing, pharmaceutical or electronic component manufacturing. \n\nChemicals used at the facility that exceed the RMP threshold quantity include chloroform (toxic) and ethyl ether (flammable). The RMP threshold quantity of chloroform is 20,000 lbs; the site can store up to 123,000 lbs. The stationary source of chloroform consists of a tanker unloading area and a bulk storage tank. Chloroform is purchased on an as needed basis, delivered via a tanker truck and unloaded by plant operators into an above-ground bulk storage tank which is located in the North Tank Farm. The RMP threshold quantity of ethyl ether is 10,000 lbs; the site can store up to 59,000 lbs. The stationary source of ethyl ether consists of a tanker unloading area and a bulk storage tank. Ethyl ether is purchased on an as needed basis, delivered via a tanker truck and unloaded by plant operators into an above-ground bulk storage tank which is also located in the North Tank Farm.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nIt is the policy of Honeywell Muskegon to operate a safe and environmentally sound facility by identifying and controlling health, safety or environmental risks related to its operations; by designing its processes to protect people, property and the environment; by managing all aspects of process safety through employee participation at all levels in the organization; by conducting and continually reviewing and improving programs for health, safety and environmental excellence; and by establishing processes to ensure that all laws and regulations applicable to its operations and products are known and observed. The accidental release prevention and emergency response p"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104574,
      "SummaryText": "RMP Executive Summary\nHoneywell Muskegon, MI\n\nHoneywell Muskegon is located on approximately 19 acres in Muskegon, Michigan. The facility is a subsidiary of the Performance Materials and Technology sector of Honeywell International, headquartered in Charlotte, North Carolina. The Muskegon plant was initially built in 1959 as Burdick & Jackson. The company became part of AlliedSignal Specialty Chemicals in 1996 which merged with Honeywell in 1999 keeping the Honeywell name. \n\nHoneywell Muskegon is committed to managing health, safety and the environment as a core business value to ensure compliance with all applicable government standards and regulations. The facility also integrates health, safety and environmental management into our business as a way of achieving profitable growth and accelerated productivity. Participation in the Responsible Care, program of the American Chemistry Council, has been achieved and the certification has been maintained since 2005. The Responsible Care is a chemical industry program focused on achieving improvements in health, safety and environmental performance beyond levels required by the U.S. government. The program directs companies to adopt practices for the safe use of materials, perform regular audits and to reach out and communicate with the communities in which the company operates.\n\nIn 2019, the site received recommendation for the Rising Star status in Michigan’s OSHA Voluntary Protection Program (MVPP) and has received Star status in 2022. This voluntary program is a partnership between MIOSHA and industry to recognize and encourage excellence and continuous improvement in safety programs.  STAR certification represents the highest form of recognition MIOSHA can give a company for outstanding safety performance.\n\nTHE FACILITY AND REGULATED SUBSTANCES HANDLED\nThe plant is a high purity solvent manufacturing facility that has 72 fulltime equivalent employees. There are three main operating steps; raw material receiving/sto"
    }
  ]
}