{
  "FacilityID": 1000000307,
  "FacilityName": "Equistar Chemicals, LP Matagorda Plant",
  "FacilityStr1": "Highway 60, 13 miles S of Bay City",
  "FacilityStr2": null,
  "FacilityCity": "Wadsworth",
  "FacilityState": "TX",
  "FacilityZipCode": "77414",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48321",
  "LEPC": "Matagorda County LEPC",
  "FacilityLatDecDegs": "28.787500",
  "FacilityLongDecDegs": "-095.943056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "debra.timbeross@lyondellbasell.com",
  "FacilityDUNS": 111481511,
  "ParentCompanyName": "Equistar Chemicals, LP",
  "Company2Name": null,
  "CompanyDUNS": 969557263,
  "Company2DUNS": null,
  "OperatorName": "Equistar Chemicals, LP",
  "OperatorStr1": "P.O. Box 2100",
  "OperatorStr2": null,
  "OperatorCity": "Bay City",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77414",
  "OperatorZipCodeExt": null,
  "FTE": 180,
  "OtherEPAFacilityID": "77483CNCHM13MIL",
  "EPAFacilityID": "100000037417",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-01635",
  "SafetyInspectionDate": "2007-10-22 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 28.7875,
  "FRS_Long": -95.943056,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000347,
      "AltID": "High Density Polyethylene",
      "FacilityID": 1000000307,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000364,
          "ProcessID": 1000000347,
          "ChemicalID": 51,
          "Quantity": 85000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000000365,
          "ProcessID": 1000000347,
          "ChemicalID": 95,
          "Quantity": 260000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000000366,
          "ProcessID": 1000000347,
          "ChemicalID": 154,
          "Quantity": 350000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000000367,
          "ProcessID": 1000000347,
          "ChemicalID": 149,
          "Quantity": 29616.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000000381,
          "ProcessID": 1000000347,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000232,
              "Process_NAICS_ID": 1000000381,
              "SafetyReviewDate": "2009-05-14 00:00:00",
              "PHA_Date": "2009-04-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "full HAZOP",
              "PHACompletionDate": "2009-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-05-14 00:00:00",
              "TrainingReviewDate": "2009-03-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training (CBT)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-04-22 00:00:00",
              "EquipmentInspectionDate": "2009-04-22 00:00:00",
              "EquipmentTested": "G-141 G-Component Tank",
              "ChangeMgmtDate": "2009-04-22 00:00:00",
              "ChangeMgmtReviewDate": "2008-10-13 00:00:00",
              "PreStartupReviewDate": "2009-04-30 00:00:00",
              "ComplianceAuditDate": "2007-10-22 00:00:00",
              "AuditCompletionDate": "2008-04-30 00:00:00",
              "IncidentInvestigationDate": "2009-05-28 00:00:00",
              "InvestigationChangeDate": "2009-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2009-05-14 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-14 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-14 00:00:00",
              "ContractorSafetyEvalDate": "2009-05-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000000246,
                  "PreventionProgram3ID": 1000000232,
                  "ProcessChemicalID": 1000000364
                },
                {
                  "PrimaryKey": 1000000247,
                  "PreventionProgram3ID": 1000000232,
                  "ProcessChemicalID": 1000000365
                },
                {
                  "PrimaryKey": 1000000248,
                  "PreventionProgram3ID": 1000000232,
                  "ProcessChemicalID": 1000000366
                },
                {
                  "PrimaryKey": 1000000249,
                  "PreventionProgram3ID": 1000000232,
                  "ProcessChemicalID": 1000000367
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000307,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-05-14 00:00:00",
    "ERTrainingDate": "2009-05-27 00:00:00",
    "CoordinatingAgencyName": "Matagorda County LEPC",
    "CoordinatingAgencyPhone": "9792455526",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000307,
      "SummaryText": "Risk Management Plan Executive Summary\nEquistar Chemicals, LP\nMatagorda Plant\n\n1.  Accidental Release Prevention and Emergency Response Policies\nEquistar is committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at Equistar.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  Unforeseeably, if such a release does occur, our trained emergency response personnel are stationed at the plant at all times to control and mitigate the effects of the release.  \n\n2.  The Stationary Source and the Regulated Substances Handled\nEquistar's primary activity at the Matagorda site is the production of high density polyethylene.  High density polyethylene is utilized in making a variety of plastic products such as grocery bags, plastic cups and plastic containers.  We utilize four (4) regulated substances at Equistar; ethylene, butene, hydrogen, and titanium tetrachloride.  \n\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nMethodology given in the RMP Offsite Consequence Analysis Guidance by the EPA using tables and equations has been employed by Equistar to perform worst case and alternative case release scenarios.  The following paragraphs provide details of the chosen scenarios.\n\nThe worst case release scenario submitted for Program 3 toxic substances involves a catastrophic release of titanium tetrachloride from a delivery truck while unloading.  The scenario involves the release of 45,000 pounds of titanium tetrachloride.  Passive mitigation controls such as dikes are taken into account to calculate the scenario.  Under worst case weather conditions, a vapor c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000307,
      "SummaryText": "loud could form and travel approximately 2.9 miles from the point of release before the EPA determined toxic endpoint of 0.02 mg/l is reached.\n\nThe worst case release scenario submitted for Program 3 flammable substances involves a catastrophic failure of the pipeline supplying ethylene to the manufacturing process.  The scenario involves the release of approximately 260,000 pounds of ethylene.  It is assumed that the entire quantity is released as a vapor, which finds an ignition source, with 10 percent of the released quantity participating in a vapor cloud explosion.  Under worst case weather conditions, the maximum distance of approximately 0.5 miles is obtained corresponding to an EPA defined endpoint of 1 psi overpressure.  \n\nThe alternative release scenario submitted for Program 3 toxic substances involves the failure of a hose unloading titanium tetrachloride from a delivery truck to a storage tank.  This scenario involves the release of approximately 7,200 pounds of titanium tetrachloride in 10 minutes.  Passive mitigation controls such as dikes are taken into account to calculate the scenario.  Under neutral weather conditions, a vapor cloud could form and travel approximately 0.4 miles from the point of release before the EPA determined toxic endpoint of  0.02 mg/l.\n\nThe alternative release scenario submitted for Program 3 flammable substances involves a leak in the pipeline supplying ethylene to the manufacturing process.  This scenario involves the release of approximately 130,000 pounds of ethylene in 10 minutes.  Under neutral weather conditions, the maximum distance of approximately 0.3 miles is obtained corresponding to an EPA defined endpoint of 1 psi overpressure.  \n\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nEquistar has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  This facility was designed and constructed in accordanc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000307,
      "SummaryText": "e with strict engineering standards and the facility is subject to the OSHA Process Safety Management standard under 29 CFR 1910.119.\n\nThe following sections briefly describe the elements of the release prevention program in place at Equistar.\n\nProcess Safety Information\nEquistar maintains a record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with the process.\n\nProcess Hazard Analysis\nEquistar conducts studies to ensure that hazards associated with the process are identified and controlled efficiently.  The methodology used to carry out these analyses is referred to as a unit Process Hazard Analysis (PHA).  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated on an as needed basis, but at a minimum every five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting operations activities, Equistar maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\nTraining\nEquistar has a training program in place to ensure that employees that are operating processes are competent in the operating procedures associated with these processes.  New employees receive basic training in process operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity\nEquistar carries out documented maintenance checks on process equipment to ensure proper functions.  Process equipment examined by these checks incl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000307,
      "SummaryText": "udes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance is carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Equistar to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and are trained to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Equistar.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nEquistar conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nEquistar investigates any incident that has resulted in, or could reasonably result in, an employee injury or a catastrophic release of a hazardous material.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Investigation reports are retained for a minimum of 5 years.\n\nEmployee Participation\nEquistar believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000307,
      "SummaryText": "eir views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation to the RMP rule, particularly information resulting from process hazard analyses.\n\nEquistar is a member of the OSHA Voluntary Protection Program.  As VPP Star Work Site, this facility has gone above and beyond the normal safety requirements to provide employees with a safe working environment. \n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Equistar has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.  The date of the last program review by an outside agency (OSHA)was October, 2007 and the date of the last field audit was October, 2007.\n\n5.  Five-year Accident History\nThere have been no accidents and reportable releases of RMP regulated substances during the last five years.\n\n6.  Emergency Response Plan\nEquistar carries a written emergency response plan to manage accidental releases of hazardous materials.  The plan includes many aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.  The facility's emergency response plan has been coordinated with the Matagorda County Local Emergency Planning Committee (LEPC).  National Incident Management System (NIMS)has been incorporated in our Emergency Response Procedures and training.  Equistar has been involved with the establishment of a Mutual Aid Group for the area to organize assistance in a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000000307,
      "SummaryText": "n emergency situation.  Members to South East Texas Mutual Aid Gorup (SETMAT)include industry in the area and membership by the City of Bay City and Matagorda County.  In addition, there is an initiave to develop and participate in a Recpricol Aid agreement between adjoining Mutual Aid groups along the Gulf Coast that the facility is supporting. \n \nTo ensure proper functioning, emergency response equipment is regularly inspected and serviced.  New response vehicles were added to the inventory of equipment in 2007 to improve the Emergency Response teams ability to respond.  In addition, the plan is updated to reflect any pertinent changes taking place within our process that would require a modified emergency response.\n\n7.  Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Improvements to the hydrocarbon detection system were made to increase the areas of the facility monitored for gas leaks and improve the type of gas detectors being used.   These improvements will allow the facility to promptly detect and respond to gas leaks before they become serious.  Low flow switches were installed on the oxygen analyzers for all four production lines to improve the accuracy of the readings and reducing the potential for a potential explosive environment.  An electronic entry system was installed at the facility to control security access and improve accuracy and timeliness of personnel accounting in the plant.   A visual Management system consisting of TV screens were placed throughout the plant to improve communication to employees and contractors. Lab vent hoods were replaced to eliminate asbestos, improve venting and included the addition of alarms in the vents.  A program was implemented to replace all mercury thermometers with digital thermometers."
    }
  ]
}