{
  "FacilityID": 1000096562,
  "FacilityName": "Grace Pasdena Catalyst Site",
  "FacilityStr1": "10001 Chemical Road",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77507",
  "Facility4DigitZipExt": "1607",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Pasadena  LEPC",
  "FacilityLatDecDegs": "29.616000",
  "FacilityLongDecDegs": "-095.051778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.grace.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1367846,
  "ParentCompanyName": "W.R. Grace & Co. - Conn.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "W.R. Grace & Co. - Conn.",
  "OperatorStr1": "10001 Chemical Road",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77507",
  "OperatorZipCodeExt": "1607",
  "RMPContact": "David Fontaine",
  "RMPTitle": "Senior EHS Specialist",
  "FTE": 130,
  "OtherEPAFacilityID": "TXD077874634",
  "EPAFacilityID": "100000130164",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-1473",
  "SafetyInspectionDate": "2021-09-07 00:00:00",
  "SafetyInspectionBy": "U.S. Department of Homeland Security",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-12-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-10-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-10-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-10-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.61444,
  "FRS_Long": -95.05306,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "21",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119749,
      "AltID": "Epichlorohydrin Tank",
      "FacilityID": 1000096562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000121123,
          "ProcessID": 1000119749,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000149991,
          "ProcessID": 1000119749,
          "ChemicalID": 21,
          "Quantity": 29550.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000649991,
          "ProcessID": 1000119749,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000119750,
      "AltID": " Propylene Storage Tank",
      "FacilityID": 1000096562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000121122,
          "ProcessID": 1000119750,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000149992,
          "ProcessID": 1000119750,
          "ChemicalID": 129,
          "Quantity": 41936.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000649992,
          "ProcessID": 1000119750,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000119751,
      "AltID": "TitaniumTetrachloride Stg",
      "FacilityID": 1000096562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000121124,
          "ProcessID": 1000119751,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000149993,
          "ProcessID": 1000119751,
          "ChemicalID": 51,
          "Quantity": 715000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 51,
            "ChemicalName": "Titanium tetrachloride  [Titanium chloride (TiCl4) (T-4)-]",
            "CASNumber": "7550-45-0",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000649993,
          "ProcessID": 1000119751,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096562,
      "SummaryText": "W.R. GRACE & CO.- CONN.  - GRACE PASADENA CATALYST SITE \n\nPASADENA, TX 77507\n\nRISK MANAGEMENT PLAN (RMP) EXECUTIVE SUMMARY\n\n\n\nW.R. Grace & Co. - Conn. (Grace) has a long tradition of operating its facilities in the safest possible manner. It is the policy of Grace to be a responsible corporate citizen and maintain open, constructive dialogue with our neighbors. These principles are an integral part of our corporate vision statement and values. We believe that sharing this information with our neighbors makes good sense. By doing so, we believe the community will better understand how safe and ecologically sound are Grace operations.\n\n\n\n ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\n\n\nW.R. Grace & Co. - Conn. has a long-standing commitment to the safety of our employees as well as the safety of our surrounding community.  This commitment is evident by the resources invested in accident prevention, such as employee training and consideration of safety in the design, installation, operation, and maintenance of our processes. To prevent accidental releases, this facility fully complies with the EPA Risk Management Program (RMP) and the OSHA Process Safety Management (PSM) standard. Extensive efforts have been made to avoid situations that could provide the conditions which could lead to the release of any chemical used on site. \n\n\n\nIt is the policy of this site to train employees to respond to emergencies including fire and chemical spill. The site maintains an Emergency Response Team trained as per the applicable standards. This Team drills periodically to maintain effectiveness and be ready should an accident occur.\n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\nW.R. Grace & Co. - Conn. - Pasadena Catalyst Site is located in the Bayport Industrial Complex in Pasadena, Texas. The site manufactures catalysts used for the production of polyolefin. The uses the following chemicals that appear on the EPA regulated chemicals list, and hav"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096562,
      "SummaryText": "e been identified as having the potential to cause significant off site consequences in the event of a substantial accidental release:\n\n \n\nToxics: Titanium Tetrachloride and Epichlorohydrin\n\n \n\nFlammables:  Propylene\n\n \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM STEPS\n\n\n\nThe following is a summary of the General Accidental Release Prevention Program in place at Grace. Processes at this facility are regulated by the EPA RMP and are also subject to the OSHA PSM standard. Grace fully complies with these regulations. This summary describes the management system in place to prevent the Accidental Release of Highly Hazardous chemicals from the facility processes. \n\n\n\nGrace has a comprehensive program to ensure that hazards associated with the various processes are identified and controlled in all phases of design, construction, and operation within this facility. Each process is systematically examined to identify hazards and verify that adequate controls and safeguards are in place to manage and/or mitigate these hazards. \n\n \n\nDuring the initial project reviews, Grace used the Hazard and Operability (HAZOP) analysis technique to perform process hazard analysis (PHA) to determine failure potential of different processes and equipment. HAZOP analysis is recognized as one of the premier systematic and thorough hazard evaluation techniques. The analyses were conducted using a team of people who have operating and process experience as well as engineering expertise. The PHAs have been updated and revalidated to confirm that process controls and/or hazards have not deviated significantly from the original design safety features.  \n\n\n\n To ensure compliance to written Standard Operating Procedures, Grace has implemented a thorough training program for all employees involved in an operating process.  All new employees receive basic training in an overview of plant operations in addition to job specific training. Operation teams verify the process is maintained within limits s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000096562,
      "SummaryText": "pecified in PHAs and Standard Operating Procedures using process controls and monitoring instruments, and automated shutdown systems. These procedures can be used as a reference by Process Technicians and provide a basis for consistent training of new Process Technicians.  These procedures are regularly reviewed and certified as current and accurate. The procedures are maintained current and accurate by revising them as necessary to reflect changes via the Management of Change (MOC) process.\n\n \n\nThe facility purchases equipment that meets requirements for the intended service as specified by Grace engineering standards.  The Site inspects, and maintains equipment and piping as recommended by the codes applicable for that equipment and service. All Grace engineering and inspection practices standards are based on Recognized And Generally Accepted Engineering Practices (RAGAGEP). This is our first and most effective prevention program against chemical leaks within the site.\n\n \n\nAll changes to the process are thoroughly evaluated through the Management of Change (MOC) process before implementation. A Pre-Startup Safety Review (PSSR) is conducted for any new facility or modification to the existing facility that requires a change in the process safety information.  A PSSR is conducted prior to startup to ensure that: (1) all equipment is installed per design, (2) all procedures are updated to reflect changes, (3) all affected employees are trained on the new procedures, (4) and if a PHA was performed, all action items are closed or that the change was handled under the MOC program. The PSSR review team uses checklists to verify all aspects of readiness. In addition, a PSSR requires field verification of the construction and serves as a quality assurance function.\n\n\n\nGrace promptly investigates all incidents, or near misses that did or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  T"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000096562,
      "SummaryText": "he goal of each investigation is to perform a root cause analysis and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to management for resolution.  Corrective actions are tracked until these items have been resolved.  \n\n\n\nRELEASE PREVENTION STEPS\n\nTo prevent or mitigate the consequences of potential accident scenarios that could be caused by equipment failures and/or human errors, Grace has put several safety systems in place to help contain/control a release, quickly detect a release, and mitigate the consequences of a release. The following types of safety features are used throughout the facility:\n\n\n\nRelease Containment/Control\n\nAll processes discharge to the flare\n\nAutomated Shutdown Systems for specific process parameters\n\nRedundant equipment and instrumentation\n\nUninterruptible Power Supply (UPS) for process control instrumentation\n\nRelief Valve Maintenance Procedures\n\n\n\nRelease Detection\n\n-Gas Detectors (%LEL) with Alarms\n\n \n\n \n\nRELEASE MITIGATION\n\nFire Suppression and Extinguishing Systems\n\nDeluge System for specific equipment\n\nStructural/Equipment Fire Proofing\n\nWater Curtains to Disperse Vapor Release\n\nEmergency Isolation Valves\n\n\n\nTrained Emergency Response Personnel\n\nPersonal Protective Equipment\n\n- Flame Retardant Clothing\n\n- Chemical Protective Clothing\n\n- Self Contained Breathing Apparatus\n\n- Turnout Gear for Firefighting\n\nEmployee Evacuation System\n\nFire and Gas Alarm Panel \n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no accidents within the last 5 years that that meet the definition of an RMP accident.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nGrace maintains a written Emergency Response Program that will be the form of an Integrated Contingency Plan.  The overall Emergency Response Program is coordinated with the Southeast Regional (Pasadena) Local Emergency Planning Committee (L"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000096562,
      "SummaryText": "EPC). The program is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including the following: proper first-aid and medical treatment for exposures; evacuation plans and accounting for personnel after an evacuation; notification of local emergency response agencies and the public if a release occurs; and post-incident cleanup and decontamination requirements. Employees receive training in these procedures as necessary to perform their specific emergency response duties. Grace has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., Channel Industries Mutual Aid and the Pasadena Fire Department). In addition to periodic LEPC meetings, Grace conducts periodic emergency drills that involve contacting the LEPC and emergency response organizations. \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThis Grace facility always encourages all employees and contract personnel to report any hazards and investigates ways to improve and enhance the Site Safety program. Additionally periodic safety audits by facility employees, W.R. Grace & Co. - Conn. audit teams, and external risk management experts are designed to find areas to and suggest actions to improve facility risk management.\n\n"
    }
  ]
}