{
  "FacilityID": 1000032537,
  "FacilityName": "P Chem, Inc.",
  "FacilityStr1": "3985 US Hwy. 287 North",
  "FacilityStr2": null,
  "FacilityCity": "Latexo",
  "FacilityState": "TX",
  "FacilityZipCode": "75849",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48225",
  "LEPC": "Houston County LEPC",
  "FacilityLatDecDegs": "31.3947",
  "FacilityLongDecDegs": "-95.4779",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.weatherford.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Lubrizol Oilfield Solutions",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "P Chem, Inc.",
  "OperatorStr1": "3985 US Highway 287 North",
  "OperatorStr2": null,
  "OperatorCity": "Latexo",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75849",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lois Waits",
  "RMPTitle": "Procurement Manager",
  "FTE": 60,
  "OtherEPAFacilityID": "75849PCHMN100OL",
  "EPAFacilityID": "100000128783",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-01-27 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-01-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-01-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-06-01 00:00:00",
  "DeRegistrationEffectiveDate": "2017-06-01 00:00:00",
  "AnniversaryDate": "2018-01-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 31.395,
  "FRS_Long": -95.4738,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000039705,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 1000032537,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000040110,
          "ProcessID": 1000039705,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000047709,
          "ProcessID": 1000039705,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000547709,
          "ProcessID": 1000039705,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000039706,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 1000032537,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000040113,
          "ProcessID": 1000039706,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000047710,
          "ProcessID": 1000039706,
          "ChemicalID": 1,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000547710,
          "ProcessID": 1000039706,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000032537,
      "SummaryText": "Facility Name: P Chem, Inc.\n\n\n\nEPA 1000 0012 8783\n\n\n\n_______________________________________________________________________________________________________Executive Summary for P Chem, Inc.\n\n\n\nFacility Policy \n\nWe at P Chem, Inc. are strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with processes at out facility. It is our policy to implement appropriate controls prevents possible releases of regulated substances. Should an accidental release occur, P Chem, Inc. has worked with the local fire departments so they can plan for a response and minimize the impact of the release to people and the environment.\n\n\n\nThe Stationary Source and the Regulated Substances Handled \n\nP Chem, Inc. primary activities are chemical manufacturing. Two regulated substances are contained in the facility in quantities greater than the threshold amount: ammonia (anhydrous) and formaldehyde (formalin solution). \n\n\n\nWorst Case Release Scenario and the Alternative-Case Scenario\n\nP Chem, Inc. has developed a worse-case and alternative-case scenario, however it has been withheld form this Executive Summary as security-sensitive information as required by the EPA.\n\n\n\nAccident Release Program  \n\nOur facility has taken steps to comply with the accidental release prevention requirements set out under 40 CFR 68 of EPA. This facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition. The following sections briefly describe the elements of the release prevention program that is in place at out stationary source.  Anhydrous ammonia is stored and handled in accordance with the provisions of OSHA 29 CFR 1910.111.  \n\n\n\nProcess Safety Management\n\nPChem, Inc. maintains a detailed record of safety information that describes the chemical hazard, operating parameters, and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000032537,
      "SummaryText": " equipment designs with the affected processes.\n\n\n\nProcess Hazard Analysis\n\nP Chem, Inc. conducts studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out the process hazard analyses (PHA) is HAZOP. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations are revalidated at least every 5 years. The findings related to the PHA are addressed in a timely manner. The most recent PHA revalidations were completed 8-28-12.\n\n\n\n\n\nOperating Procedures\n\nFor the purpose of safety conducting activities within our covered processes, PChem, Inc. maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown operations, and normal shutdown. The information is regularly reviewed and is readily accessible to personnel involved in the process.\n\n\n\nTraining\n\nP Chem, Inc. has a comprehensive training program in place to ensure that employees who are competent in the operating in the operating procedure associated with these processes. Refresher training is provided at least annually and more frequently as needed.\n\n\n\nMechanical Integrity\n\nP Chem, Inc. carries out documented maintenance checks on process and storage equipment to ensure proper operations. Process equipment examined by these checks includes among others; process vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel trained in maintenance practices. Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely matter.\n\n\n\nPre-Startup Review\n\nPre-start up safety reviews related to new processes and to processes and to modifications in established processes are conducted as a regular practice at PChem, Inc. These reviews are conduc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000032537,
      "SummaryText": "ted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nIncident Investigation\n\nP Chem, Inc. has procedures in place for investigating any incident that has resulted in or could reasonably result in a catastrophic release of a regulated substance. Investigations including a root cause analysis for any loss of primary containment are undertaken to identify the situation leading to the incident as well as any corrective action to prevent the release from reoccurring.\n\n\n\nEmployee Participation\n\nP Chem, Inc. believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to the information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\n\n\n\nContractors\n\nP Chem, Inc. hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, an evaluation of safety performance of the contractor is carried out. P Chem,Inc. informs the contractors of known hazards related to the contractor's work and the processes. Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\nFive Year Accident History  \n\nP Chem, Inc. has had no reportable accidental release during the last 5 years. \n\n\n\nEmergency Response Plan\n\nP Chem, Inc. has prepared and implements a written emergency response plan to deal with accidental releases of hazardous materials. The plan addresses first aid and medical treatment, evacuations, notification of local response agencies and the public. The plan is updated to reflect a change within the affected processes that would require a modified emergency response. The emergency respons"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000032537,
      "SummaryText": "e plan has been coordinated with the Latexo Volunteer Fire Department.  \n\n\n\nPlanned Changes to improvement Safety\n\nSafety improvement is an on-going process at P Chem, Inc. Periodic inspections and evaluations are performed to assess the maintenance of safe practices and operations. There are no additional specific safety recommendations for anhydrous ammonia or formaldehyde solution handling processes for implementation at this time."
    }
  ]
}