{
  "FacilityID": 1000000943,
  "FacilityName": "Huntington Sanitary Board Wastewater Treatment Plt",
  "FacilityStr1": "Vinson Road and Floodwall",
  "FacilityStr2": null,
  "FacilityCity": "Huntington",
  "FacilityState": "WV",
  "FacilityZipCode": "25704",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54099",
  "LEPC": "Cabell/Wayne County LEPC",
  "FacilityLatDecDegs": "38.404444",
  "FacilityLongDecDegs": "-082.529278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": "huntingtonsb.com",
  "FacilityEmailAddress": "lakers@huntingtonsb.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Huntington Sanitary Board",
  "OperatorStr1": "P.O. Box 7098",
  "OperatorStr2": null,
  "OperatorCity": "Huntington",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "25775",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mayor Steve Williams",
  "RMPTitle": "Chairman of Huntington Sanitary Bd.",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129728",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.41262,
  "FRS_Long": -82.47703,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001154,
      "AltID": "Wastewater Treatment",
      "FacilityID": 1000000943,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001241,
          "ProcessID": 1000001154,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001201,
          "ProcessID": 1000001154,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501201,
          "ProcessID": 1000001154,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000943,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe Huntington Sanitary Board Wastewater Treatment Plant located at Vinson Road and Floodwall, Huntington, West Virginia, provides primary and secondary treatment of wastewater prior to the chlorination of the effluent before being discharged into the Ohio River. The RMP regulations cover the chlorination process at this facility.  The chlorination system provides destruction of pathogenic microorganisms in the water.\n\n\n\nIt is the Huntington Sanitary Board Wastewater Treatment Plant's policy to adhere to all applicable federal and state rules and regulations.  Safety depends on the manner in which we handle chlorine, the safety devices inherent in the design of this facility, the safe handling procedures that we use, and the training of our personnel.\n\n\n\nTHE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\nAn evaluation of chemical usage, accident histories, and worst-case release scenarios at the Huntington Sanitary Board Wastewater Treatment Plant indicates that Program 2 requirements of the Risk Management Program (RMP) apply to this plant.  The Huntington Sanitary Board Wastewater Treatment Plant has the potential to maintain up to 24,000 pounds of chlorine, CAS Number 7782-50-5, at the plant at one time.  This is in excess of the threshold value for RMP applicability.  The threshold value for chlorine is 2,000 pounds.  The Huntington Sanitary Board Wastewater Treatment Plant maintains no other regulated substances above the threshold value for RMP applicability.\n\n\n\nTHE WORST-CASE RELEASE SCENARIO AND THE ALTERNATE RELEASE SCENARIO, INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO.\n\n\n\nWorst-Case Scenario - The worst-case release scenario would be the loss of the entire contents of a 1-ton cylinder of chlorine over a period of 10 minutes at a historically high temperature of 102 degrees F with winds of only 1.5 mete"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000943,
      "SummaryText": "rs per second.  A total of 1,650 pounds of chlorine is assumed to be released into the atmosphere.  The distance to the endpoint for worst-case scenario is 2.8 miles.  A release of chlorine will impact offsite areas of Wayne and Cabell Counties in West Virginia and Lawrence County Ohio.  However, this scenario is highly unlikely, due to regular inspections, proper training of personnel, and past historical data and is reported here only as required by provisions of the RMP regulations.  A much more realistic scenario is presented as the alternative release scenario.\n\n\n\nAlternative Release Scenario - The Alternate Release Scenario is based on a vapor release of chlorine as a result of a supply line failing  between the chlorine cylinder and the chlorinator.  The release would occur inside the enclosed chlorinator room. A total of 1,650 pounds of chlorine is assumed to be released into the atmosphere, but over 11 minutes at an average temperature of 55.96 degrees F with winds at 2.9 meters per second.  Based on these more likely dispersion variables, the distance to the endpoint for the alternative release scenario is only 1.6 miles.  A release of chlorine will impact offsite areas of Wayne and Cabell Counties in West Virginia and Lawrence County Ohio.\n\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND SPECIFIC PREVENTION STEPS\n\n\n\nThe Huntington Sanitary Board Wastewater Treatment Plant has in place a prevention program encompassing elements consistent with the U.S. EPA Clean Air Act 112(r)(7) Accidental Release Prevention Requirements:  Risk Management Programs (RMP) (40 CFR Part 68).\n\n\n\nThe facility has implemented the following:\n\n\n\n1.  A comprehensive Prcess Safety Information program ensures complete and accurate written information concerning process chemicals, process technology, and process equipment.  This information is included in the employee training programs.\n\n\n\n2.  Process Hazard Analysis (PHA) is conducted to identify and analyze the potential haz"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000943,
      "SummaryText": "ards associated with the processing or handling of highly hazardous chemicals.\n\n\n\n3.  Operating procedures have been prepared to describe tasks to be performed, operating conditions to be maintained, data to be recorded, and safety precautions to be taken.\n\n\n\n4.  An employee training program has been developed to ensure that all employees, including maintenance and contractor employees involved with chemicals, fully understand the potential hazards of each chemical.\n\n\n\n5.  A maintenance program assures the integrity of process equipment.  It ensures that all maintenance personnel are trained and that the equipment is tested and inspected as recommended.\n\n\n\n6.  Compliance Audits are conducted to review all relevent documentation, verify process safety information, inspect the physical facilities and interview representative plant personnel.\n\n\n\n7.  An Incident Investigation is to be conducted in the event of any chemical release or \"near miss\" by a team of experienced individuals familiar with the process.  Any recommendations are to be documented and discussed.\n\n\n\n8.  An Emergency Response Program for the entire facility has been developed for use in the event of a chemical release.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nDuring the past five years, the Huntington Sanitary Board Wastewater Treatment Plant has had no chemical releases which created an emergency situation outside the plant boundaries or resulted in any onsite deaths, injuries, significant property damage onsite, known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\n\n\nThe Huntington Sanitary Board Wastewater Treatment Plant has \"Emergency Procedures\" in place to inform employees how to communicate with local agencies and how to respond to an accidental release.  Plant personnel are trained in emergency procedures and emergency notifications.  Trained personnel respond to emergencies in their area with the local Fire Depart"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000943,
      "SummaryText": "ment as a back up.  This program has been discussed with the Local Emergency Planning Committee (LEPC) and the Huntington Fire Department to ensure good communication and operational effectiveness.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nthe Huntington Sanitary Board Wastewater Treatment Plant plans to continue to evaluate the regulated process as required under the RMP standards to ensure safe operations."
    }
  ]
}