{
  "FacilityID": 1000073802,
  "FacilityName": "AMVAC Chemical Corporation",
  "FacilityStr1": "4100 E. Washington Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Los Angeles",
  "FacilityState": "CA",
  "FacilityZipCode": "90023",
  "Facility4DigitZipExt": "4406",
  "FacilityCountyFIPS": "06037",
  "LEPC": "Los Angeles County Fire Dept.",
  "FacilityLatDecDegs": "34.009444",
  "FacilityLongDecDegs": "-118.188056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 56446388,
  "ParentCompanyName": "American Vanguard Corporation",
  "Company2Name": null,
  "CompanyDUNS": 49343924,
  "Company2DUNS": 0,
  "OperatorName": "AMVAC Chemical Corporation",
  "OperatorStr1": "4100 E. Washington Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Commerce",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90023",
  "OperatorZipCodeExt": "4406",
  "FTE": 60,
  "OtherEPAFacilityID": "90023MVCCH4100E",
  "EPAFacilityID": "100000130574",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-11-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.00959,
  "FRS_Long": -118.1886,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092061,
      "AltID": "Metam Sodium Process",
      "FacilityID": 1000073802,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000114971,
          "ProcessID": 1000092061,
          "ChemicalID": 8,
          "Quantity": 358000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000114972,
          "ProcessID": 1000092061,
          "ChemicalID": 97,
          "Quantity": 103013.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000093283,
          "ProcessID": 1000092061,
          "NAICSCode": "32532",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000078236,
              "Process_NAICS_ID": 1000093283,
              "SafetyReviewDate": "2018-08-24 00:00:00",
              "PHA_Date": "2018-05-18 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-10-05 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "Fail Safe Control Valves & ESDVs",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Water Layer Under Reactor & CS2 Storage Tank, ESD System & Alarms",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Remote Shutoff Actuators, Administrative Controls & Procedures",
              "OpProceduresReviewDate": "2018-05-15 00:00:00",
              "TrainingReviewDate": "2018-07-03 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-04-10 00:00:00",
              "EquipmentInspectionDate": "2018-11-04 00:00:00",
              "EquipmentTested": "Reactor, Rotating Equipment (Pumps & Agitators), heat exchangers, Hoses, ESDVs, Emergency Power Generator",
              "ChangeMgmtDate": "2018-09-28 00:00:00",
              "ChangeMgmtReviewDate": "2016-02-09 00:00:00",
              "PreStartupReviewDate": "2018-05-25 00:00:00",
              "ComplianceAuditDate": "2017-06-15 00:00:00",
              "AuditCompletionDate": "2017-08-24 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-05-28 00:00:00",
              "HotWorkPermitReviewDate": "2018-08-27 00:00:00",
              "ContractorSafetyReviewDate": "2018-06-25 00:00:00",
              "ContractorSafetyEvalDate": "2018-02-06 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Metam Sodium/K-Pam Unit has been designed with several features whose function is to prevent an accidental release involving methylamine or carbon disulfide.  These include the handling and storage equipment systems, containment dikes, recovery and process control systems.  All systems were built according to recognized and accepted codes and regulatory standards. The unit is built according to best control standards and includes both automated and manual features",
              "_chemicals": [
                {
                  "PrimaryKey": 1000097095,
                  "PreventionProgram3ID": 1000078236,
                  "ProcessChemicalID": 1000114971
                },
                {
                  "PrimaryKey": 1000097096,
                  "PreventionProgram3ID": 1000078236,
                  "ProcessChemicalID": 1000114972
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000073802,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-07-31 00:00:00",
    "ERTrainingDate": "2018-07-31 00:00:00",
    "CoordinatingAgencyName": "Los Angeles County Fire Dept.",
    "CoordinatingAgencyPhone": "3238904000",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "South Coast Air Quality Management District, Cal-EPA/Department of Toxic Substance Control, Los Angeles County Sanitation District, Department of Public Works, State Water Resources Control Board"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000073802,
      "SummaryText": "EXECUTIVE SUMMARY\n\nRISK MANAGEMENT PLAN (RMP)\n\nAMVAC CHEMICAL CORPORATION\n\nCOMMERCE, CALIFORNIA\n\n\n\nThis Risk Management Plan (RMP) has been prepared for AMVAC's pesticide manufacturing plant located at 4100 East Washington Boulevard in Commerce, California.  It has been prepared in accordance with section 112A&reg; of the Clean Air Act Standard (40 CFR Part 68), RMP.  The intent of this legislation is to protect the public health and safety and the environment from the accidental release of acutely hazardous materials.  The preparation and implementation of this RMP by AMVAC Chemical Corporation, a handler of acutely hazardous materials, meets the intent of the RMP rule and relevant portions of the California Health and Safety Code.\n\n\n\nThe Hazard and Operability Study (HazOps) and hazard analysis conducted for AMVAC's pesticide manufacturing units found the units to contain multi-layers of safeguards against the possibility of acutely hazardous material (AHM) release, and concluded that the units are well designed.\n\n\n\n1.0 Accidental Release Prevention and Emergency Response Policies\n\n\n\nMission Statement: AMVAC Chemical Corporation (AMVAC) is committed to the following:\n\n1. Providing its customers with environmentally friendly, cost-effective and high-quality products on time.\n\n2. Providing a safe and secure working environment for its employees.\n\n3. Operating in a manner which meets or exceeds existing laws and regulations and reflects the high level of concern and respect for the local community.\n\n4. Investing in its future through aggressive research and development of new products and markets.\n\n5. Providing its investors with higher than normal returns.\n\n\n\nSafety First Policy: Amvac will provide a safe and secure environment for its employees while maintaining a high level of concern and respect for the community.  Safe conditions and full environmental regulatory compliance will be maintained at all of its facilities. All unsafe conditions/actions will be immedi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000073802,
      "SummaryText": "ately corrected and management notified.\n\n\n\nEnvironmental, Health and Safety Mission Statement: AMVAC Chemical Corporation's Environmental, Health and Safety (EH&S) departments are committed to ensuring that facility operations are conducted in full compliance with existing environmental, health and safety regulations.  To achieve this, we follow a four-point plan based on Training, Auditing, Reporting and Enforcement.\n\n\n\n2.0 Facility Description and Regulated Substances Handled\n\n\n\nAMVAC Chemical Corporation manufactures agricultural chemical pesticides at its plant located at 4100 East Washington Boulevard in Commerce, California.  The facility consists of various type buildings, chemical reactors, above-ground storage tanks, truck loading/unloading stations, rail car loading/unloading stations, peripheral tanks, a warehouse and various ancillary equipment.  The plant currently employs sixty full-time employees and operates on a three shift, twenty four-hour basis.\n\nAMVAC Chemical Corporation has a North American Industrial Classification System (NAICS) Code of 32532 for Pesticides and Agricultural Chemicals Manufacturers, a Primary Standard Industrial Classification (SIC) Code of 2879 for Agricultural Chemical Manufacturers.  It has Secondary SIC Codes of 2869 (Chemical Industrial Organics) and 5191 (Farm Supplies).  The plant is involved in the manufacture of pesticides which require the handling of Acutely Hazardous Materials (AHMs) in quantities which make them subject to the Risk Management Plan Rule (RMPR) requirements of the Clean Air Act (40 CFR 68).  \n\n\n\n* Toxic Substances:\n\n\n\n1. Carbon Disulfide, CAS 75-15-0 used in the Metam Sodium/K-Pam manufacturing process.\n\n* Flammable Substances: \n\n1. Monomethylamine, CAS 74-89-5 used in the Metam Sodium/K-Pam manufacturing process\n\n\n\nMetam Sodium/K-Pam Manufacturing Process:\n\n\n\nAHMs associated with this process are Carbon Disulfide and monomethylamine (for Metam Sodium/K-Pam manufacturing).  There are no by-product"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000073802,
      "SummaryText": "s or off-gas produced in the reaction.\n\n\n\n3.0 The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nIn addition to the capabilities, design features and back up of the systems handling the regulated chemicals, AMVAC recognizes that the safe operation of the plant requires a thorough understanding of the physical and chemical properties of all materials and the implementation of safe handling practices.\n\n\n\n4.0 The Five Year Accident History\n\n\n\nThere were no accidents or incidents involving Acutely Hazardous Materials in the past five years.  \n\n\n\n5.0 The Emergency Response Program\n\n\n\nAll units are equipped with multiple levels of protection.  The potential for spills or releases  is low.  However, in the event that a spill or release occurs, there are established written procedures for the handling of any emergency.\n\n\n\nThese include the Emergency Response Plan and the Operating Procedures Manuals.  The Emergency Response plan for the AMVAC facility (last revised 07/31/2018) includes written procedures for handling releases and spills of hazardous materials in any area and contains more specific emergency response procedures, including procedures for earthquake, bomb threat, riot, offsite emergencies, evacuation procedures, evacuation routes, fire prevention, emergency equipment, portable radio use and neighborhood information.  The operating procedure manuals for each process contain more specific emergency response information for each area.\n\n\n\nTo maintain and upgrade our emergency response capability, AMVAC conducts regularly scheduled inspections of this facility and equipment, and conducts emergency response drills for personnel.  The Emergency Response Plan is reviewed annually and/or when:\n\n\n\nA. There is a major change in the facility operation that changes the potential for fires, explosions, release of hazardous substances, such that changes in the response are necessary for any emergency.\n\nB. The plan fails in an emergenc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000073802,
      "SummaryText": "y.\n\nC. There is a change of emergency coordinators/responders.\n\nD. There is a change of emergency equipment.\n\n\n\nAny incident or emergency, which results in a chemical release that exceeds its Reportable Quantity (RQ) is reported to the following or corresponding agencies, as applicable:\n\n\n\nLos Angeles County Fire Department, Los Angeles Fire Prevention-Conservation Bureau, Department of Toxic Substance Control (DTSC), National Response Center, South Coast Air Quality Management District (SCAQMD), Cal-OSHA, Los Angeles County Sanitation District, California Office of Emergency Services, U.S. Environmental Protection Agency (EPA), U.S. Department of Fish and Game, Los Angeles County Department of Public Works (Environmental Programs and Flood Maintenance), and State Warning Center for Release Reporting.\n\nAny serious work-related injury, illness or death is reported to the Cal-OSHA office immediately, but no longer than 8 hours after employer's knowledge of incident.  All incidents will be reviewed and investigated as to its cause and methods for future prevention.\n\nAll plant personnel receive training on the implementation of the emergency response plan upon hire and periodic refresher training on the various aspects of the plan.\n\nFurthermore, copies of the Emergency Response plan have been submitted to the local Fire Department, City of Commerce Emergency Preparedness Officer, Los Angeles County Sheriff's Department and the nearby hospitals. These agencies are therefore informed of and in agreement with the content and approach of the plan.\n\n\n\n6.0 Planned Changes to Improve Safety\n\n\n\nAMVAC currently has no additional detailed or defined plans for any changes such as installation of additional mitigation or control equipment, technology, organizational changes, etc.  However, there is an on going program that identifies such opportunities as part of the safety committee, which formally addresses any and all employee safety related issues and suggestions.  AMVAC will c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000073802,
      "SummaryText": "ontinue to improve the safety performance accordingly."
    }
  ]
}