{
  "FacilityID": 1000028160,
  "FacilityName": "Nuplex Resins LLC",
  "FacilityStr1": "4730 Crittenden Drive",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40209",
  "Facility4DigitZipExt": "1518",
  "FacilityCountyFIPS": "21111",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "38.180278",
  "FacilityLongDecDegs": "-085.753611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Nuplex Resins LLC",
  "OperatorStr1": "4730 Crittenden Drive",
  "OperatorStr2": null,
  "OperatorCity": "Louisville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40209",
  "OperatorZipCodeExt": "1518",
  "FTE": 70,
  "OtherEPAFacilityID": "40209RLNCN4730C",
  "EPAFacilityID": "100000082395",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "40-08-F",
  "SafetyInspectionDate": "2011-10-31 00:00:00",
  "SafetyInspectionBy": "Emergency Management Agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-05-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-05-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-05-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-08-14 00:00:00",
  "DeRegistrationEffectiveDate": "2020-02-13 00:00:00",
  "AnniversaryDate": "2017-05-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.180278,
  "FRS_Long": -85.753611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034371,
      "AltID": "Amino resin manufacturing",
      "FacilityID": 1000028160,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041541,
          "ProcessID": 1000034371,
          "ChemicalID": 1,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000034672,
          "ProcessID": 1000034371,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000030021,
              "Process_NAICS_ID": 1000034672,
              "SafetyReviewDate": "2010-01-05 00:00:00",
              "PHA_Date": "2009-05-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-07-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "High/Low temperature alarm",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-04-24 00:00:00",
              "TrainingReviewDate": "2011-06-23 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-04-24 00:00:00",
              "EquipmentInspectionDate": "2009-04-15 00:00:00",
              "EquipmentTested": "Tank cleaned and inspected.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2012-04-24 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2011-10-31 00:00:00",
              "AuditCompletionDate": "2012-05-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-08-11 00:00:00",
              "HotWorkPermitReviewDate": "2009-02-09 00:00:00",
              "ContractorSafetyReviewDate": "2012-02-15 00:00:00",
              "ContractorSafetyEvalDate": "2011-06-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000035805,
                  "PreventionProgram3ID": 1000030021,
                  "ProcessChemicalID": 1000041541
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000028160,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-06-08 00:00:00",
    "ERTrainingDate": "2012-01-18 00:00:00",
    "CoordinatingAgencyName": "Heritage Environmental",
    "CoordinatingAgencyPhone": "5024730368",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028160,
      "SummaryText": "Executive Summary for Nuplex Resins LLC\r\n\r\n1.0\tAccidental Release Prevention and Emergency Response Policies\r\nNuplex Resins is committed to employee, public, and environmental safety.  Our actions are guided by the Nuplex Resins LLC HSE policy which states:\r\n\r\nCommitment to managing the health, safety, and environmental aspects of our business in a responsible manner is an integral part of Nuplex Resins LLC business policy.  We are committed to compliance with all relevant regulatory requirements.  We fully support the global Health, Safety, and Environmental performance targets as set forth by Nuplex Resins.  We pursue the following objectives in close cooperation with our employees, distributors, customers, and suppliers;\r\n\r\nHealth: Nuplex Resins LLC is committed to conducting its activities in such a way as to prevent harm to the health of its employees and other stakeholders.\r\n\r\nSafety: Nuplex Resins LLC is committed to providing a working environment that protects the safety of our employees and prevents injuries.  Nuplex resins LLC encourages employees to extend these same principles of safety to their own homes and families.\r\n\r\nEnvironment: Nuplex Resins LLC is committed to the prevention of pollution and the protection of the environment by preventing or minimizing the environmental impact of its activities and products through appropriate design, manufacturing, distribution, use, and disposal practices.  We are committed to the pursuit of continuous improvement in the management of our environmental aspects.\r\n\r\nOur commitment is further demonstrated by our certification to the ISO 14001 standard.  These efforts guide us in the development and implementation of a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated su"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028160,
      "SummaryText": "bstances.\r\n\r\n\r\n2.0\tPrimary Facility Activities and the Regulated Substances Handled\r\nOur facility's primary activities encompass Synthetic Resin Manufacturing.  We have one regulated substance present at our facility, that being formaldehyde solution.  Formaldehyde solution is used as a reactant in the manufacture of urea formaldehyde (amino) resins.  The maximum inventory of formaldehyde solution at our facility is 54,210 lb (16,263 lb of that being formaldehyde).  \r\n\r\n3.0\tAccidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 of the EPA.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\r\n\r\nProcess Safety Information\r\nNuplex Resins LLC maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\r\n\r\nProcess Hazard Analysis\r\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every five (5) years or whenever there is a change in the process.  Any findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures\r\nFor the purposes of safely conducting activities within our covered processes, Nuplex Resins LLC maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028160,
      "SummaryText": "s readily accessible to operators involved in the processes.\r\n\r\nTraining\r\nNuplex Resins LLC has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided routinely as a part of ongoing operations.  Operating procedures are an integral part of batch reaction processing instructions and are modified as needed through technical and engineering review.\r\n\r\nMechanical Integrity\r\nNuplex Resins LLC has a written Mechanical Integrity Program and carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\nWritten procedures are in place at Nuplex Resins LLC to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Nuplex Resins LLC.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits\r\nNuplex Resins LLC conducts audits on a regular basis to determine whether the provisions"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028160,
      "SummaryText": "set out under the RMP rule are being implemented.  These audits are carried out at least every 5 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\r\n\r\nIncident Investigation\r\nNuplex Resins LLC promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation\r\nNuplex Resins LLC truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\r\n\r\nContractors\r\nOn occasion, our company hires contractors to conduct specialized maintenance and/or construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Nuplex Resins LLC has a written program, HSE Rules for Contractors, to help manage this activity.  Nuplex Resins LLC has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.  Nuplex Resins LLC does not use contractors for normal maintenance activities or for operation of covered RMP processes.\r\n\r\n4.0\tFive-year Accident History\r\nNuplex Resins LLC has had an excellent record of preventing accidental releases over the last 5 years.  There have been no accidental releases of cove"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000028160,
      "SummaryText": "red hazardous materials during this period.\r\n\r\n5.0\tEmergency Response Plan\r\nNuplex Resins LLC has in place a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\r\n\r\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\r\n\r\nLouisville and Jefferson Co. LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\r\n\r\n6.0\tPlanned Changes to Improve Safety\r\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  The bulk formaldehyde solution storage tank system has undergone significant safety improvements in the past.  These improvements included an increase in the  of the passive containment system, installation of adequate agitation to insure uniformity of temperature, high and low temperature indicators and alarms, high level alarms, installation of an additional manual shutoff device, and updated operating procedures. These improvements remain in place."
    }
  ]
}