{
  "FacilityID": 1000043616,
  "FacilityName": "Baton Rouge Blending and Storage",
  "FacilityStr1": "1476 Hwy 61",
  "FacilityStr2": null,
  "FacilityCity": "Jackson",
  "FacilityState": "LA",
  "FacilityZipCode": "70748",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22037",
  "LEPC": null,
  "FacilityLatDecDegs": "30.719211",
  "FacilityLongDecDegs": "-91.273569",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Colonial Pipeline Company",
  "OperatorStr1": "1476 Highway 61",
  "OperatorStr2": null,
  "OperatorCity": "Jackson",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70748",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Peeler",
  "RMPTitle": "Operations Manager",
  "FTE": 43,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000225874",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-09-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-09-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-09-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053881,
      "AltID": "Butane Storage",
      "FacilityID": 1000043616,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054686,
          "ProcessID": 1000053881,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        },
        {
          "Process_NAICS_ID": 1000054688,
          "ProcessID": 1000053881,
          "NAICSCode": "48691",
          "_desc": {
            "NAICS_CODE": "48691",
            "NAICS_DESCRIPTION": "Pipeline Transportation of Refined Petroleum Products"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065586,
          "ProcessID": 1000053881,
          "ChemicalID": 118,
          "Quantity": 7700000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565586,
          "ProcessID": 1000053881,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043616,
      "SummaryText": "Colonial Pipeline Company (Colonial) Baton Rouge Facility, located near Jackson, Louisiana, has a standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, training of highly qualified personnel, and considering safety in the design, installation, operation and maintenance of our processes.  Colonial policy is to implement reasonable controls to prevent chemical releases.  However, if a release does occur, trained personnel will respond to control, contain, and mitigate the release. Industrial Emergency Services and local fire departments will also respond to releases.\n\n\n\nColonial Baton Rouge Facility includes a gasoline blending operation.  The blending operation consists of additional storage capacity and the ability to blend butane and other components into gasoline.  The blending operations utilize butane, naphtha, and/or natural gasoline as blending components.  Butane is sourced via a pipeline connecting to a truck supplied storage facility located near the facility and/or the Transmontaigne barge dock. Naphtha and natural gasoline are sourced via the Transmontaigne barge dock, Colonial Line 01, or the truck supplied storage facility.  Butane is the only chemical maintained on site and listed on the EPA's list of flammable chemicals above EPA's threshold quantity.    Naphtha and natural gasoline, flammable chemical mixtures, are also maintained on site but do not meet the regulatory definition (NFPA) of flammable mixtures and are therefore not subject to RMP.\n\n\n\n\n\n1    Process Safety Information\n\nColonial compiles and maintains written information pertaining to chemicals, technology and equipment used in Colonial Process Safety Management (PSM) covered processes to enable assessment of the hazards of those processes. This information is made available to affected employees and applies to all Colonial employees working in or near PSM-covered areas within Colonial facilities. Contractors must"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043616,
      "SummaryText": " have programs that meet the regulatory standards for the activities they perform and will comply with these programs as a minimum.\n\n\n\nThe written information pertaining to the hazards of the highly hazardous chemicals includes but is not limited to toxicity information, permissible exposure limits, physical data, reactivity data, corrosivity data, thermal and chemical stability data, and hazardous effects of inadvertent mixing of different materials that could foreseeably occur. Colonial complies with the OSHA Hazard Communication Standard, which provides information on the hazards of chemicals through Safety Data Sheets (SDSs), employee training and container labeling. Other physical and chemical property data is maintained and made available to employees as the need arises. Information on the hazards and safeguards associated with hazardous materials is covered in Hazardous Communication Training and training on job-specific operating and maintenance procedures.\n\n\n\nThe written information pertaining to process technology includes but is not limited to block flow diagrams or simplified process flow diagrams, process chemistry, maximum intended inventory, safe upper and lower limits for such items as temperatures, pressures, flows or compositions, and evaluations of the consequences of deviations, including those affecting the safety and health of personnel. Documentation of process design, operating parameters and procedures are maintained and made available to employees who have need for this information. The documentation is updated when significant process changes occur in accordance with Colonial's Management of Change (MOC) Process.\n\n\n\nThe written information pertaining to equipment in the process includes but is not limited to materials of construction, piping and instrument diagrams (P&IDs), electrical classifications, relief system design and design basis, ventilation system design, design codes and standards employed, material and energy balances for proc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043616,
      "SummaryText": "esses, and safety systems (e.g., interlocks, detection or suppression systems). Information concerning the design, construction and fabrication of PSM-covered equipment will be maintained and made available to employees who have need for this information. The information will be updated when new equipment is purchased or significant changes are made to existing equipment in accordance with the Colonial MOC Process.\n\n\n\n2    Process Hazard Analysis\n\nColonial has a comprehensive program that establishes requirements for documented hazard reviews of the PSM-covered process at Colonial's Baton Rouge Junction facility. These hazard reviews, often referred to as Process Hazard Analyses (PHAs), must be completed initially and re-validated every five (5) years. A PHA is an organized and systematic effort to identify and analyze the significance of potential hazards associated with the processing or handling of highly hazardous chemicals. It provides management and facility personnel with information that will aid in improving safety and reducing the consequences of unplanned spills or releases of hazardous materials. A PHA is directed toward analyzing potential causes and consequences of fires, explosions, releases of toxic or flammable chemicals and major spills of hazardous materials. A PHA focuses on equipment, instrumentation, utilities, human action (routine and non-routine) and external factors that might impact the process. These considerations assist in determining the hazards and potential failure-point or failure modes in a process.\n\n\n\nPHAs are performed using a team approach with at least one member of the team being knowledgeable of the process under review. Facility personnel and personnel who serve as PHA team members are trained in the content and requirements of the program. The PHA facilitator is trained in PHA methodologies to be utilized. PHA team members receive an orientation on the PHA methodology and Risk Ranking System to be utilized.\n\n\n\nFuture PHAs and "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043616,
      "SummaryText": "PHA Revalidations use one or more of the following hazard analysis methodologies depending on the complexity of the process:\n\n\n\n?    What-If;\n\n?    Checklist;\n\n?    What-If/Checklist;\n\n?    Hazard and Operability Study (HAZOP);\n\n?    Failure Mode and Effects Analysis (FMEA);\n\n?    Fault Tree Analysis; and\n\n?    An appropriate equivalent methodology.\n\n\n\nThe PHA team findings are forwarded to management for review and resolution. Recommendations are tracked until resolved, addressing each PHA recommendation in a timely manner. Management must agree and implement the recommendation, reject if recommendation is not warranted, or agree in principle with the recommendation but suggest an alternative.  A recommendation is considered complete when it has been physically implemented or rejected, with proper documentation. A schedule for completion of action items is published noting each action item, responsible party, and target date for completion.\n\n\n\n3    Operating Procedures\n\nOperators, supervisors, and other qualified personnel work together to develop, publish and follow operating procedures for each PSM-covered process task.  These procedures define how tasks related to process operations are safely performed.  Colonial uses operating procedures to train employees and serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Procedures are kept in easily accessible areas for personnel who may work on process equipment. Operating procedures include:\n\n\n\n?    Steps for safely conducting activities during all phases of operations, including initial startup, normal operation, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown, and temporary operations.\n\n?    Applicable process safety information, such as safe operating limits, consequences of deviation outside normal limits, and steps required to correct or avoid deviations.\n\n?    Safety and health considerations, such as chemical hazards, personnel protective equipm"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043616,
      "SummaryText": "ent required, steps to take if exposed to a particular chemical, safe work practices, control of hazardous chemical inventories, and special hazards and equipment associated with the job. \n\n?    Description of safety systems and their functions, including computer and instrument safety interlocks.\n\n\n\n4    Training\n\nColonial trains its workers to safely and efficiently perform their assigned tasks.  The training program includes both initial and refresher training.\n\n\n\nAll personnel receive comprehensive training before being assigned to a specific operating area.  This training includes training on general overview of the process and in the operating procedure with emphasis on the specific safety and health hazards and emergency operations, including shutdown and safe work practices applicable to the individual's job tasks. Skills demonstrations using operations and maintenance-related checklists and/or written quizzes are used to verify personnel are capable of performing their assigned tasks. Refresher training shall be provided for personnel performing PSM-covered tasks at least every three years.\n\n\n\n5    Management of Change \n\nThe Colonial Management of Change (MOC) process establishes requirements for making changes to any PSM-covered processes and activities. It is intended to ensure such changes are implemented safely and appropriately documented.  The MOC process involves:\n\n\n\n?    Review of proposed changes by personnel with appropriate knowledge;\n\n?    Approval of proposed changes by applicable decision-makers;\n\n?    Consideration of environmental, health & safety, process safety management (PSM), regulatory compliance, asset integrity and system reliability;\n\n?    Identification of activities and tasks required before, during and after implementation;\n\n?    Communication of changes to all affected parties, and\n\n?    Documentation of the changes\n\n\n\nThe program evaluates and approves all proposed changes to chemicals, equipment, and procedures for covered processes to help ensure that "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000043616,
      "SummaryText": "a change does not negatively affect safe operations.  Process changes that are determined to be a replacement in kind (e.g. replacing a valve with an identical valve) are allowed without completing a full management of change program. Emergency MOCs are only used when the normal MOC process cannot be used because the change must be implemented in a timely manner in order to mitigate safety, integrity, or operational continuity risks.\n\n\n\n6    Pre-Startup Safety Review (PSSR)\n\nColonial conducts a Pre-Startup Safety Review (PSSR) in accordance with its PSM program to all new and modified equipment in the PSM-covered areas within Colonial facilities. PSSRs are completed for all new PSM-covered equipment and/or modified PSM-covered equipment where the modification is significant enough to require a change to the Process Safety Information or at the direction of the Operations Manager. \n\n\n\nColonial's PSSR procedure describes the requirements for conducting these reviews in accordance with its PSM program. The purpose of the PSSR is to verify the following before equipment is placed in service:\n\n1)    Construction and equipment meets the design specifications;\n\n2)    Safety, operating, maintenance, and emergency procedures are in place and adequate;\n\n3)    For new facilities, a PHA has been performed and recommendations have been resolved or implemented;\n\n4)    For modified facilities, the requirements of the Management of Change procedure have been completed; and\n\n5)    Training of each employee and/or contractor employee operating and maintaining the PSM-covered equipment has been completed.\n\n\n\nAll site personnel and resident contractors are trained in the content and requirements of the PSSR procedure. Upon completion of a project and before the equipment is placed in service, a PSSR is initiated using the PSSR Checklist to ensure compliance with Colonial's PSM program and OSHA requirements.  The PSSR Checklist is reviewed and approved prior to startup of affected equipment.\n\n\n\n7    Mechani"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000043616,
      "SummaryText": "cal Integrity\n\nThe mechanical integrity requirements of the Baton Rouge Junction PSM Program are closely aligned with Colonial's Integrity Management Program (IMP). The IMP establishes the foundation for assessing, repairing, and maintaining the integrity of Colonial's assets, with the targets of error-free operations, improving asset performance and reliability, ensuring compliance and managing risks, reducing impacts to the environment, and dedication to providing for the safety and security of personnel and the surrounding community. Colonial's IMP provides well-established practices and procedures to maintain the pipeline and related systems such as relief, control systems, emergency shutdown systems, and rotating equipment in safe operating condition.\n\n\n\nThe IMP and related documents meet the written procedures requirements of 1910.119(j)(2) and fully describe the inspection and testing requirements of OSHA mechanical integrity under 29 CFR 1910.119(j)(4). These internal documents also cover the requirements for equipment deficiencies at 1910.119(j)(5) and provide the information needed to address the requirements for quality assurance 1910.119(j)(6).\n\n\n\nAll site personnel who perform inspection, testing and service or repair work on PSM-\n\ncovered equipment are trained on the content of this procedure. Each person performing maintenance activities on critical equipment is trained on the applicable procedure(s). Training is documented in accordance with the Conduct of Operations Manual.\n\n\n\nThe mechanical integrity element of a PSM plan requires a listing of all critical equipment, written procedures, maintenance training documentation, inspection, testing and calibration documentation and quality assurance of construction and maintenance. Equipment critical to operations or identified in the process hazards analysis as a safeguard has been installed at Colonial's Baton Rouge Junction.\n\n\n\nWritten procedures to enable personnel to consistently perform equipment ma"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000043616,
      "SummaryText": "intenance tasks are contained in Colonial's Equipment Maintenance Manual.  Procedures in this manual have been divided into two categories, System Integrity and General. The categories define the rationale for performing maintenance as outlined by regulatory agencies, manufacturer's and Colonial's experience. Specific procedures outlining maintenance procedures, inspection, testing and other references are listed for all critical equipment.\n\n\n\nEquipment inspections, tests and/or calibrations are outlined in Colonial's Equipment Maintenance Procedures. Specific procedures for inspections, tests or calibration are listed for all critical equipment. Each specific procedure describes the frequency of the maintenance event. Documentation for each inspection, test or calibration is recorded on forms for each specific piece of equipment. Forms are either manual or embedded within Colonial's Maximo Asset Management system (Maximo).\n\n\n\nColonial has a substantial volume of internal documentation that addresses the pipeline integrity, operations, and record keeping requirements under the Pipeline and Hazardous Materials Safety Administration (PHMSA) found in 49 CFR Part 195 and also requirements for mechanical integrity under OSHA regulations found in 29 CFR 119(j)(6).\n\n\n\nMitigation of the risk of accidents begins with reliable design. Approximately 76 Engineering Standards are used to support and standardize pipeline system design and construction. Colonial's Engineering Standards are based on regulatory requirements, industry standards, and best practices. These standards call for preventive measures such as increased depth of cover, additional pipe wall thickness and concrete pipe coating in high risk areas including waterway, road and railroad crossings. Pipeline, tank, and facility engineering standards are published on Colonial's Intranet.\n\n\n\n8    Safe Work Practices\n\nColonial has a safe work program in place to ensure worker safety.  Examples of the program include:\n\n1)    Pr"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000043616,
      "SummaryText": "ocedures for identification and listing of all existing or potential hazardous and possible reactions to failure for job tasks (i.e. hazard exposure assessment or job safety analysis (JSA));\n\n2)    Lockout/tagout procedures to ensure isolation of energy sources for equipment undergoing maintenance;\n\n3)    Procedures for safe removal of hazardous materials before process piping or equipment is opened (i.e. line separation);\n\n4)    A permit and procedures to conduct work or equipment that may generate sparks, excessive heat or open flames (i.e. hot work); and\n\n5)    A permit and procedures to ensure that adequate precautions are in place before entry into a confined space.\n\n\n\nThese procedures, along with other procedures not specifically listed here and training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely. Colonial requires completion of a Daily Work Permit and Safety Checklist for any work that may affect the integrity of the pipeline and associated systems and any other hazardous work or work performed in hazardous areas. \n\n\n\n9    Incident Investigation\n\nColonial investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so similar incidents can be prevented.  Employees at the facility are trained to identify and report any incident requiring investigation.  The investigation is initiated immediately, or no less than 24 hours after the incident.  Depending on the incident, an investigation team may be formed.  Results of the investigation are documented and appropriate changes are made through training that incorporates the findings of the incident investigation.\n\n\n\n10    Employee Participation\n\nColonial maintains a written employee participation program to help ensure compliance with the requirements of the OSHA PSM standard.  The minimum requirements for employee participation in PSM are established in Colonial's PSM Employee Participation pro"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000043616,
      "SummaryText": "cedure. Process Safety Team members are trained and knowledgeable on the requirements of this procedure and actively participate in PSM-related activities.  The procedure applies to all Colonial employees and contract employees working in or near PSM covered areas within Colonial facilities. All Colonial and contractor employees working in or near PSM-covered areas are informed of the provisions of this procedure upon initial assignment. Contractors must have programs that meet the regulatory standards for the activities they perform and will comply with those programs as a minimum.\n\n\n\nIn addition to this written plan, Colonial shall consult with employees and their representatives on the conduct and development of process hazard analyses (PHAs) and on the development of the other elements of PSM; and shall provide to employees and their representatives access to PHAs and to all other information required to be developed under the PSM standard.\n\n\n\nAll Colonial and contractor employees working in or near PSM covered areas are encouraged to participate in the following activities when trained and requested to do so:\n\n1)    Review and update maintenance and operating procedures;\n\n2)    Serve on PHA teams;\n\n3)    Serve on PSM Incident Investigation teams;\n\n4)    Serve on audit teams;\n\n6)    Participate in the review and/or development of PSM related training materials;\n\n7)    Assist in training new employees; and\n\n8)    Participate in Management of Change reviews.\n\n\n\nResults of PHAs, PSM audits, incident investigations and associated open action items are shared with and accessible to all affected employees and contractors. \n\n\n\n11    Compliance Audits\n\nColonial audits the covered processes to evaluate the effectiveness of the PSM activities and to comply with the requirements of 29 CFR 1910.119(o)(1) which requires a compliance audit at least every three years.  An audit team of members who are trained on the OSHA PSM Standard and audit techniques is assembled. At least one (1) member of the a"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000043616,
      "SummaryText": "udit team must be knowledgeable of the processes being audited.  The audit report will document that all 14 elements of the OSHA PSM Standard have been evaluated. Any noted deficiencies are listed in the audit report. The Operations Manager will evaluate each audit finding and develop an action plan which will establish target dates for completion of action items with assigned responsibilities. Audit results and proposed action items are promptly reviewed with all affected facility and contractor personnel. Action items are tracked to completion and documented.\n\n\n\n12    Contractors\n\nColonial has established a program to help ensure that contractor activities are performed in a safe manner.  This program reviews the safety record of the contractors to ensure the facility only hires contractors who can safely perform the desired task.  The facility communicates to the contractor supervisor the hazards of the process on which they and their employees will work, the facility's safe work practices, and the facility's emergency response procedures.  Colonial requires that the contractor supervisors train each of their employees on hazards and procedures specific to the facility.\n\n\n\n13    Five Year Accident History\n\nColonial began operation of its PSM covered process in 2014 and as of the date of this plan, has experienced zero events which had offsite impacts.\n\n\n\n14    Emergency Response Program\n\nAn Emergency Action Plan (EAP) has been established to direct employees of Colonial and on-site contractors in the event of an incident or emergency and meets the requirements of OSHA 29 CFR 1910.38. The plan addresses procedures to follow in the event of fires or explosions, hurricanes, tornadoes, floods, and other emergencies such as security threats, nuclear plant accident (Entergy River Bend), and any unforeseen incident or accident that threatens personnel safety.  The plan also covers procedures for reporting a fire or other emergency, emergency evacuation, employees who remain to o"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000043616,
      "SummaryText": "perate critical operations before they evacuate, accounting for all employees after evacuation, and procedures to be followed for employees performing rescue or medical duties.\n\n\n\nTraining covering all aspects of the EAP is conducted with all employees when hired or initially assigned to facility. Employees are also trained when an employee's responsibilities or designated actions under the plan change or whenever new equipment, materials, or processes are introduced into the workplace. In addition, training is conducted when changes are made to the plan, or changes made to the facility layout or design. Refresher training is conducted annually.\n\n\n\n15    Planned Changes to Improve Safety\n\nColonial constantly strives to improve safety and reduce risk through audits, suggestions from employees, incident investigations, and the use of proper engineering standards and specifications.\n\n \n\n"
    }
  ]
}