{
  "FacilityID": 1000015260,
  "FacilityName": "Arab Water Treatment Plant",
  "FacilityStr1": "66 Water Works Road",
  "FacilityStr2": null,
  "FacilityCity": "Guntersville",
  "FacilityState": "AL",
  "FacilityZipCode": "35976",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01095",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "34.365833",
  "FacilityLongDecDegs": "-086.350639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "NA",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Water Works Board of the City of Arab",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Arab Water Works",
  "OperatorStr1": "526 Cullman Road",
  "OperatorStr2": null,
  "OperatorCity": "Arab",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35016",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael W. Mann",
  "RMPTitle": "Chief Operator",
  "FTE": 3,
  "OtherEPAFacilityID": "AL0001600766",
  "EPAFacilityID": "100000101882",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-03-03 00:00:00",
  "SafetyInspectionBy": "Plant Manager - Albertville",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-08-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-08-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-03-26 00:00:00",
  "DeRegistrationEffectiveDate": "2019-11-25 00:00:00",
  "AnniversaryDate": "2015-08-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.36217,
  "FRS_Long": -86.35205,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000019147,
      "AltID": "Water Treatment",
      "FacilityID": 1000015260,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000019489,
          "ProcessID": 1000019147,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000022752,
          "ProcessID": 1000019147,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000522752,
          "ProcessID": 1000019147,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000015260,
      "SummaryText": "Arab Water Treatment Plant\nEPA ID:  AL0001600766\n\nThe Arab Water Works facility (Arab Filter Plant (AFP) treats an average of 3.5 million gallons per day of water from nearby Guntersville Lake, located approximately 3 miles west of the city of Guntersville, Alabama.  The AFP consists of several water purification treatment processes, including chlorination, filtration, flocculation and sedimentation.\n\nCurrently the AFP maintains a maxium inventory of 8,000 pounds of chorine gas.  Under EPA's Risk Management Program, Clean Air Act 112(r), any industry utilizing a regulated gas above its threshold level (2500 pounds for chlorine), must develop a Risk Management Plan and implement a Risk Management Program.\n\nIn the spirit and law of the RMP, the AFP recognizes and is pursuing optimal public involvement in response to regulated substance emergencies.  The AFP acknowledges that as a result of being in compliance with RMP Rule, the safety of the surrounding community as well as that of on-site workers will be significantly enhanced.  Improved record-keeping, training, operating procedures and better engineering design will minimize the risk of using chlorine gas and improve the quality of local services.\n\nChlorine  gas is required at the AFP for disinfection surface water pumped in from nearby Lake Guntersville, as well to add a \"polish of residual chlorine\" to finished drinking water leaving the facility.  The AFP recognizes that chlorine gas accidentally released into the surrounding environment may cause severe injury and death for a significant distance from the source.  The AFP policy under its RMP is to prevent and prepare for the uncontrolled release of a regulated toxic gas from the AFP.\n\nThe AFP is currently owned by Arab Water Works Inc., Arab, Alabama.  The Arab Water Works General Operations Manager is Mr. David Campbell (256-586-3159).  Primary responsibility for the implementation of the RMP is under the direction of the Chief Operator of the AFP, Mr. Michae"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000015260,
      "SummaryText": "l W. Mann.  Mr. Mann's primary responsibility under the RMP will be to oversee the training and execution of the facility's health, safety and environmental programs.  Additional individuals may be assigned responsibility for implementing individual requriements and will report to Mr. Mann on delegate matters.  Responsible indibiduals will communicate information to other employees involved in operation and maintenance of the regulated process involving chlorine gas as required.  All responsible individuals so involved will be listed by name, title and duties, in the RMP located on site at this facility.\n\nAny material changes in the design or maintenance [except for [\"replacement in kind\"] of the current process will be introduced into the RMP by those delegated that authority under the guidelines of the RMP.  The public may contact the AFP by calling (256) 582-3633 or the Arab Water Works office at (256) 586-3159 for information regarding more details about the Risk Management Plan.\n\nThe AFP currently maintains up-to-date safety information related to the regulated substance, process, and equipment, including Material Safety Data Sheets for chlorine, maximum intended inventories, and safe upper and lower temperatures, pressures, and process flows for the regulated substance.  Equipment specifications and process design Codes and Standards are also maintained in the RMP document on site.\n\nIn the case of an uncontrolled release of chlorine gas from the AFP, an integrated Emergency Response Plan has been adoped involving the coordinated effort of several organizations, including the local Fire Department, Emergency Management Agency, local Police, Sheriff's office and local Medical Emergency services and hospitals.  The AFP is prepared to assess and repair incidental or controlled leaks of the regulated material but is currently not authorized to respond to uncontrolled releases of chlorine from the facility.  Instead, the AFP has coordinated first response assistance"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000015260,
      "SummaryText": " from federally regulated Hazardous Materials (HazMat) specialists.  Currently the Arab, Guntersville, and Alberville Fire Departments have joined together for first response action should an uncontrolled release of chlorine gas occur on the AFP site.  In coordination with local and nearby Police and Sheriff departments, residents will be evacuated systematically, and as soon as decisions are made by the Emergency Coordinator (Fire Department) and others in the Emergency Chain-of-Command.\n\nEPA requires each regulated facility to analyze a Worst-Case Scenario release (the release of the entire contents of a regulated substance container) as well as an Alternative-Case Scenario in which the released regulated gas is brought under control at some point following release events.\n\nInd the Worst-Case Scenario, detailed within the facility's RMP, a scenario is considered in which the uncontrolled release of the entire contents of a ton container of chlorine gas occurs.  There are no mitigation features included in this Worst-Case analysis, such as enclosed buildings or other structures, for the uncontrolled release of the regulated substance.  The endpoint radius for such a release, in which injury to those exposed is potentially possible , was calculated using parameters which are facility specific as well as criteria provided by EPA.  The endpoint radius was calculated to be 3.0 miles for the loss of a one ton container of chlorine gas.  Serious injury is high closer to the source of the release of cholrine gas.\n\nThe safety mechanisms in place at the AFP designed to prevent this scenario from occurring include vacuum regulator valves located on the ton containers.  These valves release chlorine gas only when a vacuum is applied, hence, if a line should break in the chlorine process manifold system the valves on the source will automatically shut off when the vacuum is lost.\n\nAlthough the potential for an entire ton container of the gas to escape the plant's boundaries is"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000015260,
      "SummaryText": " unlikely, it can happen.  The EPA requires all responders to such a release to coordinate with the local Emergency Management Agency, the Fire Department, HazMat specialists and other local authorities such as the Police Department and Sheriff's office, in order to effectuate the best plan for evacuation efforts, if needed, and other requirements to assure the greatest protection for those who may be exposed to the gas.  As described below, recommendations have been submitted regarding improved maintenance and safety, the introduction of a community siren system, as well as improving on initial response activities coordinated through the efforst of the participating agencies and rescue organizations.  In the analysis of the Worst-Case scenario release the AFP did not include mitigation features such as enclosed buildings or other physical parameters which might otherwise reduce the calcuated endlpoint radius.\n\nAs part of the Worst-Case scenario Emergency Response Action the cooperating agencies considered, and is currently implementing procedures for responding to sensitive receptors within the endpoint distance of the reguated gas.  For example, local schools, hospitals, and other sensitive receptor sites are currently being integrated into the community's Emergency Response Plan through the efforts of the Fire Department, LEPC, Police Department, and others.  Cooperative interaction between the various rescue organizations is enhanced undr the RMP Program.  An evaluation of the potential impact of released gas on the surrounding environment is also included in the RMP.  USGS maps showing the effected areas within the endpoint distance are filed within the facility's RMP.  The estimated population within the 3.0 mile endpoint radius is 2,400 persons.\n\nIn the Alternative Release Scenario the AFP adopted conditions of uncontrolled release in which the failure of a check valve results in the release of the regulated gas for a  period of approximately 30 minutes.  At "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000015260,
      "SummaryText": "this time the gas is assumed to be arrested and brought under control by emergency response personnel.  The endpoint radius for chlorine gas was calculed to be 1.2 miles (AFP choose a scenario provided by the AWWA's Compliance Guidance and Model Risk Management Program for Water Treatment Plants.  Mitigation features which impeded the dispersal of the released gas, such as an enclosed building, were integrated into the Alternative Release Scenario calculations.  The population of Guntersville affected within the 1.2 mile radius is estimated at 420 persons.\n\nCurrently the regulated gas, chlorine, is connected to the chlorine process within the \"Chlorine Room\" a fire proof enclosed room located approximately 50 feet from the Main Office at the AFP.  The AFP maintains a modern chlorine detector which is set to activated an alarm system at one parts per million concentration.  This dectector is tested on a monthly basis.  The chlorine building is equipped with standard doors and the internal atmosphere is environmentally controlled.  In the event of a partial release of chlorine gas it is anticipated that the bulk of the gas will be contained within the immediate vicinity of the chlorine room.  A substantial portion of the released gas should be captured and treated within the immediated area of the chorine room.  In addition, there is a substantial tree line with thick under-brush in which considerable dispersion and quenching of the released gas is anticipated.\n\nThere have been no accidental release of chlorine gas beyond incidental events, such as minor leaks, in the last five years.\n\nAs a result of the safety inspection on November 29, 2004, no reccomendations were made to improve the AFP's RMP Program.  On-going operator training for chlorine gas application and handling is held on a rountine basis.  The AFP uses a standard operating procedure for the operation and maintenance of the chlorine gas disinfection system."
    }
  ]
}