{
  "FacilityID": 1000023333,
  "FacilityName": "WAUNA MILL",
  "FacilityStr1": "92326 Taylorville Road",
  "FacilityStr2": null,
  "FacilityCity": "CLATSKANIE",
  "FacilityState": "OR",
  "FacilityZipCode": "97016",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41007",
  "LEPC": "Oregon LEPC",
  "FacilityLatDecDegs": "46.155556",
  "FacilityLongDecDegs": "-123.407778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.gp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1381524,
  "ParentCompanyName": "GP Consumer Products Holdings LLC",
  "Company2Name": null,
  "CompanyDUNS": 46156626,
  "Company2DUNS": 9020777,
  "OperatorName": "Georgia-Pacific Consumer Products L",
  "OperatorStr1": "133 PEACHTREE STREET NE",
  "OperatorStr2": null,
  "OperatorCity": "ATLANTA",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30303",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "VP, Mill Manager",
  "FTE": 1000,
  "OtherEPAFacilityID": "97016JMSRVWAUNA",
  "EPAFacilityID": "100000056976",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "04-0004",
  "SafetyInspectionDate": "2014-10-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-07-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-08-11 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-08-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-08-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 46.15667,
  "FRS_Long": -123.40694,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000028500,
      "AltID": "R-8 GENERATOR",
      "FacilityID": 1000023333,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000028803,
          "ProcessID": 1000028500,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034109,
          "ProcessID": 1000028500,
          "ChemicalID": 71,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 71,
            "ChemicalName": "Chlorine dioxide  [Chlorine oxide (ClO2)]",
            "CASNumber": "10049-04-4",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534109,
          "ProcessID": 1000028500,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000028501,
      "AltID": "NOx CONTROL SYSTEM",
      "FacilityID": 1000023333,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000028804,
          "ProcessID": 1000028501,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034110,
          "ProcessID": 1000028501,
          "ChemicalID": 56,
          "Quantity": 47000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534110,
          "ProcessID": 1000028501,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023333,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Wauna Mill is committed to operating in a manner that is safe for the Wauna Mill workers, the public, and the environment. As part of this commitment, the company has established a system to help ensure safe operation of the hazardous chemical processes at this facility. One component of this system is a Risk Management Program (RMP) that helps manage the risks at the facility and addresses compliance with the requirements of the Environmental Protection Agency's (EPA) Regulation 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule). One of the requirements of the RMP rule is to submit a Risk Management Plan (RMPlan) describing the Risk Management Program at the Wauna Mill. This document is intended to satisfy the RMPlan requirements of the RMP Rule and to provide the public with a description of the Risk Management Program at the facility.\n\nThe Risk Management Program at the facility consists of three elements:\n\n1.    A hazard assessment to help understand (a) the potential off site consequences of hypothetical accidental releases and (b) accidents that may have occurred during the last five years associated with the use of the substances regulated by the RMP rule - see topic 1.2\n    \n2.    A prevention program to help maintain and safely operate the processes containing more than the threshold quantity of the regulated substances (covered processes) -see topic 1.4\n    \n3.    An emergency response program to help respond to accidental releases of the regulated substances from the covered processes - see topic 1.6\n\nInformation further describing these elements is provided in this RMPlan summary.\n\nAlthough the Risk Management Program at the facility helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the safety program at The Wauna Mill. In fact, the facility has a comprehensive safety program in place establishing many levels of safeguards that are designe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023333,
      "SummaryText": "d to minimize the potential for the release of any hazardous substance and injuries and damage resulting from the release of a hazardous substance.\n\nThe Wauna Mill minimizes the potential releases of the hazardous substances used at the facility. When hazardous substances are used at the facility, the equipment is carefully designed, built, and operated to reduce the likelihood of an accidental release. Industry and government standards are closely adhered to in design, construction, and operation of the equipment.\n\nThe Wauna Mill limits damage from a release, if such a release occurs. The facility trains workers to respond to upset conditions, reducing the consequences of a release if it occurs. In addition, the facility participates with the Local Emergency Planning Commission (LEPC) to help ensure that injuries and/or environmental damage will not occur in the event that a release does occur.\n\nThe safety program at The Wauna Mill consists of a number of elements, only some of which are required by the RMP rule. This RMPlan is primarily intended to describe those parts of the safety program at the facility that are required by the RMP rule.\n\n1.1    Accidental Release Prevention and Emergency Response Policies\n\nThe Wauna Mill is committed to the safety of workers and the public, as well as the preservation of the environment through the prevention of accidental releases of hazardous substances. The facility implements reasonable controls to prevent foreseeable releases of the hazardous substances. These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of the processes; and programs to evaluate the hazards at the facility.\n\nIn the event of an accidental release, the facility will control and contain the release in a manner that will be safe for workers and will help prevent injury to the public and/or the environment. The Wauna Mill provides response training for upset conditions to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023333,
      "SummaryText": " facility personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local emergency response organizations.\n\nIn order to effectively implement these policies, the facility has established a management system directed by the Vice President/Mill Manager.\n\n1.2    The Wauna Mill and Its Regulated Substances\n\n1.2.1    Mill Description\n\nThe Georgia-Pacific Consumer Products LP Wauna Mill is located on 1200 acres adjacent to the Columbia River in Clatsop County, Oregon.  This site was originally developed in 1909 for a lumber mill operation. The Wauna mill began its current business of producing pulp and paper in 1965.  The pulp and paper mill was originally built and operated by Crown Zellerbach Corporation.  In 1986, James River acquired Crown Zellerbach.  In 1997 the ownership of the facility changed to Fort James Operating Company when James River merged with Fort Howard.  The Wauna Mill is owned and operated by Georgia-Pacific Consumer Products LP as in November 2000, Georgia Pacific Corporation acquired all stock shares of Fort James, and in December 2005 Koch industries acquired all stock shares of Georgia-Pacific Corporation. \n\nThe Wauna mill is a fully integrated pulp and paper mill that uses the following general processes: The Mill produces a variety of paper products.  These products include towel and tissue products for retail stores and the commercial market, uncoated printing papers. The Wauna mill employs about 1,000 people from the local area. \n\nSawdust, wood chips, and purchased pulp are transported to the mill by barge or by truck. Sawdust and wood chips are stored in piles prior to processing.\n\nWauna uses the kraft process to convert wood into pulp.  The kraft process uses a sodium hydroxide and sodium sulfide solution under heat and pressure to dissolve the lignin component of wood. The dissolved lignin and spent pulping chemicals are separated from unbleached pulp by washers and sent to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000023333,
      "SummaryText": " chemical recovery. After washing, unbleached pulp goes through a multi-stage bleach plant. The bleaching process uses sodium hydroxide, oxygen, chlorine dioxide, and hydrogen peroxide to remove residual lignin from the pulp and whiten it to commercial brightness levels. The chlorine dioxide solution is produced on-site from sodium chlorate, sulfuric acid, methanol, and water.\n\nThere are five papermachines at the Wauna mill.  They all produce towel and tissue grades. \n\nBleached pulps derived from different wood species, as well as purchased pulp and secondary fiber recycled from waste paper are blended to produce a mixture tailor-made for each paper grade.  The rolls of paper from the towel and tissue papermachines are converted on-site into napkins, towels, bathroom tissue, or facial tissue.\n\nWastewaters from the mill are collected and pumped to an air activated biological treatment facility. The facility includes a primary clarifier, a stabilization basin, an aeration pond, and two secondary clarifiers. Primary and secondary sludges are dewatered together and burned, along with other wood wastes, in a state-of-the-art fluid bed boiler. The mill operates an on-site landfill for solid waste disposal. The treated wastewater is discharged into the Columbia River.\n\nMost processes operate 24 hours a day, 7 days a week, and 52 weeks a year.   Portions of the production equipment are shut down periodically for maintenance or cleaning.  The entire facility is generally shut down only once per year for maintenance.\n\n1.2.2    Substances and Processes Regulated Under RMP\n\nThe Wauna mill stores two chemicals above the threshold limits of 40 CFR 68.130.  A summary of the RMP-regulated processes and substances is given below.  \n\nTable ES-1\nAnhydrous Ammonia (Program 3): Fluid bed boiler NOx control system, includes storage of anhydrous ammonia\nChlorine Dioxide (Program 3): R-8 reactor system including storage system for dilute, aqueous chlorine dioxide solution.\n\nChlorine Dioxide G"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000023333,
      "SummaryText": "enerator and Associated Chlorine Dioxide Storage:  An R8 process is used to generate chlorine dioxide on-site for subsequent use in the kraft bleach plant.  In this process, methanol is added to a heated solution of sodium chlorate and sulfuric acid in a reaction vessel which is under a vacuum.  The resultant chlorine dioxide gas is absorbed in cold water and then stored as a nominal 1% solution.  The maximum chlorine dioxide solution strength could be as high as 1.1%.  \n\nFluid Bed Boiler NOx Control and Associated Ammonia Storage:  The Fluid Bed Boiler at Wauna uses ammonia injection as part of its Fluid Bed Boiler (FBB) Selective Non-Catalytic Reduction (SNCR) Nitrogen Oxides (NOx) control system which is part of the pollution control equipment package.  Liquid ammonia is purchased and stored on-site in a 12,000 gallon tank.  From the storage tank, ammonia is added to the mill's fluid bed boiler as needed to control emissions.\n\n1.2.3    Additional Substances Used at Wauna That Are Not Subject to RMP\n\nIn addition to the substances listed in Table ES-1 that are subject to the RMP program, the Wauna mill uses other chemicals that are not regulated under RMP.  The following substances that are used at the mill could conceivably be released to the atmosphere as a result of a major accident.  Georgia-Pacific Consumer Products LP rigorously maintains all of the equipment at the mill, and employs safe operating procedures for the handling and use of all chemicals.  Therefore any major accident involving these processes is considered to be highly unlikely. \n\nPropane:  Small tanks of propane are used at various locations at the mill. All of the propane tanks were installed and are maintained in accordance with local fire codes. It is extremely unlikely that even a large release would affect any public areas or residences.\n\nMethanol: Liquid methanol is stored in a 10,000 gallon tank for use in generating chorine dioxide.  It is unlikely that an accidental spill of even a very l"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000023333,
      "SummaryText": "arge amount of methanol, followed by a fire, would result in a fire that would extend to the facility boundary nor impact areas beyond the mill boundary.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n \nWauna Mill has always used a prevention program to help prevent accidental releases of hazardous substances. Beginning in 1992, the facility formalized this prevention program for the Chlorine Dioxide Solution System to comply with the Occupational Safety and Health Process Safety Management (PSM) prevention program. In 1996, the EPA RMP rule established that a Program Level 3 Prevention Program would become a requirement for these processes as well. The facility's Program Level 3 Prevention Program under the RMP rule is essentially the same as the OSHA PSM Program, except that the program also focuses on protecting the public and the environment.\n  \nThe following sections briefly describe the elements of the Wauna Mill Program Level 3 Prevention Program that addresses the EPA RMP rule prevention program requirements.\n\n1.0 INTRODUCTION\n    \nAt the Wauna Mill, the facility takes a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  The management systems address each of the key features of successful accident prevention programs including:\n    \n    A?    Process safety information (PSI)\n    A?    Process hazard analysis (PHA)\n    A?    Operating procedures (OP)\n    A?    Training (Trg)\n    A?    Mechanical integrity (MI)\n    A?    Management of change (MOC)\n    A?    Pre-startup review (PSSR)\n    A?    Compliance audits (CA)\n    A?    Incident investigation (II)\n    A?    Employee participation (EP)\n    A?    Hot work permits (HW)\n    A?    Contractors (Contr)\n    \nThe individual elements of the accident prevention program work together to prevent accidental chemical releases.  The company and employees are committed to the standard that these management systems set for the way the facility does business, and have specific accountabilities and controls to ensure that the facility is meeting their own high standards f"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000023333,
      "SummaryText": "or accident prevention.\n    \n2.0 PROCESS SAFETY INFORMATION\n    \nIn accordance with Section 68.65 of the RMP rule, the facility systematically controls the creation, updating, and retention of written documentation associated with the process chemicals, process technology, and process equipment. This information is essential for supporting all of the other elements of the risk management program. The facility also uses this information directly to ensure that the equipment is suitable for its intended use.\n    \n2.1 Process Safety Information Details\n    \nThe facility maintains the following chemical process information for each regulated substance in a covered process as well as for other hazardous materials in both covered and non-covered processes:\n    \nA?    Toxicity information\nA?    Permissible exposure limits\nA?    Physical data\nA?    Reactivity data\nA?    Corrosivity data\nA?    Thermal and chemical stability data\nA?    Hazardous effects of inadvertent mixing of different materials that could foreseeably occur\n    \nThe facility uses material safety data sheets (MSDSs) to provide most of the process chemical information.  Whenever required information, such as corrosivity data or hazardous effects of inadvertent mixing, is not available in MSDSs, the facility develops the missing data from other sources and provides it in separate documents.\n    \n    The facility maintains the following required process technology information:\n    \nA?    Block flow or simplified process flow diagram\nA?    Process chemistry\nA?    Maximum intended inventory\nA?    Safe upper and lower limits for parameters such as temperature, pressure, flow, or composition\nA?    Evaluation of the consequences of deviations from established operating limits\n    \nMost of this information comes from the engineering design documents for the processes, but in some cases, the facility has developed such information through special projects. Additionally, operating limits, maximum intended inventories, and consequences of deviations not available from engineering desi"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000023333,
      "SummaryText": "hemical information, and for process technology information.  The Utilities/Fiber Supply Maintenance Manager has responsibility for equipment information. The Chemical Process Safety Coordinator has the responsibility of ensuring that all of this information is readily accessible for use.\n\n3.2 Process Hazard Analysis\n\nIn accordance with Section 68.67 of the RMP rule, the Chemical Process Safety Coordinator has the responsibility for ensuring that process hazard analyses (PHAs) are scheduled, conducted, and documented by trained personnel for all regulated processes. The Chemical Process Safety Coordinator identifies candidate PHA team leaders from within the facility and ensures that they receive appropriate training before leading PHAs.  Other members of the PSM/RMP Committee are responsible for (1) ensuring that the information and personnel necessary to conduct PHAs are available according to the PHA implementation schedule and (2) resolving recommendations that are assigned to their respective areas.\n\n3.3 Operating Procedures\n\nIn accordance with Section 68.69 of the RMP rule, the Operations Utilities Manager and Operations Fiber Manager have the responsibility for ensuring that complete and accurate operating procedures are in place for all regulated processes. The Safety Manager develops and maintains the facility's safe work practices.\n\n3.4 Training\n\nIn accordance with Section 68.71 of the RMP rule, the Operations Utilities Manager and the Operations Fiber Manager have the responsibility for (1) ensuring that operations employees receive and understand training applicable to their specific jobs and the associated processes and (2) documenting the training. The Safety Manager has the responsibility for (1) ensuring that all facility employees receive and understand training in safe work practices applicable to their jobs and (2) documenting the training. The Utilities/Fiber Supply Maintenance Manager addresses training for maintenance workers under the mechanic"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000023333,
      "SummaryText": "gn documentation were developed as part of PHAs.\n    \nThe facility also maintains the following information pertaining to equipment in the regulated processes (as well as for many of the non-regulated processes):\n    \nA?    Materials of construction\nA?    Piping and instrument diagrams (P&IDs)\nA?    Electrical classification\nA?    Relief system design and design basis\nA?    Ventilation system design\nA?    Design codes and standards employed\nA?    Material and energy balances for processes built after 5/26/92\nA?    Safety systems (interlocks, detection, or suppression systems)\n    \nAgain, most of this information comes from the engineering design documents for the processes as well as from the facility's own maintenance files. Whenever required information was not available, the facility obtained the information from equipment vendors and plant engineering. In conjunction with the equipment information collection efforts, the facility documented that the equipment complies with recognized and generally accepted good engineering practices.\n    \n3.0 PROCESS HAZARD ANALYSIS\n    \nIn accordance with Section 68.67 of the RMP rule, the facility uses process hazard analyses (PHAs) to systematically identify, evaluate, and control process hazards. The most important products of the PHA are recommendations for reducing the most significant risks of accidental chemical releases. The facility ensures that all recommendations from the PHAs are resolved appropriately, and the facility ensures that information from the PHAs (including recommendation resolutions) is communicated to all potentially affected employees.\n    \n3.l    Process Hazard Analysis Details\n    \nThe facility conducts systematic PHAs of the regulated processes and other hazardous processes at the facility according to an established schedule. This schedule ensures that the facility (1) address each process in a prioritized order (based on the extent of process hazards, the number of potentially affected employees and/or off site population, the age of the proce"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000023333,
      "SummaryText": "ss, and the operating history of the process) and (2) update/revalidate each PHA at least every five years (or more often if necessary because of process changes). The facility also conducts PHAs of all new processes before those processes are placed in service.\n    \nThe facility primarily uses the \"What-If' and \"HAZOP\" techniques to perform PHAs, although the facility can use other EPA/OSHA-approved techniques when they are more appropriate for specific applications.\n    \nThe facility PHA teams are composed of personnel with engineering and process operating experience, including at least one person who has knowledge and experience in the process to be evaluated and a PHA team leader trained in the application of the hazard evaluation technique used for the PHA.\n    \nThe facility has a system in place to promptly resolve PHA team findings and recommendations, and communicate findings/recommendation resolutions to potentially affected personnel.\n    \nPHAs are implemented in a written report for each analysis soon after the analysis meetings are completed. The managers review and resolve the PHA recommendations after receiving the report. The facility maintains a written action plan tracking the resolution status of each recommendation, including an individual responsible for resolving each recommendation and a target completion date. The facility documents the final resolution of each recommendation, and advises the PHA team of any recommendations that are rejected.\n    \n4.0 OPERATING PROCEDURES\n    \nIn accordance with Section 68.69 of the RMP rule, the facility uses operating procedures to define how process-related job tasks assigned to personnel should be performed to avoid incidents. The facility uses these procedures to (1) train employees before they perform tasks in the field, (2) serve as reference guides for personnel performing tasks, and (3) specify what to do if a process upset or operating emergency occurs.\n    \n4.1    Operating Procedure Details\n    \nThe facility's engineers, op"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000023333,
      "SummaryText": "erators, and shift supervisors work together to develop and maintain operating procedures for all phases of operations including:\n    \nA?    Initial start up\nA?    Normal operations\nA?    Temporary operations\nA?    Emergency shutdown, including the conditions under which emergency shutdown is required and assignment of shutdown responsibility to qualified operators to ensure that emergency shutdown is executed in a safe and timely manner\nA?    Emergency operations\nA?    Normal shutdown\nA?    Start up following a turnaround or after an emergency shutdown\n    \nThe facility development teams use PSI, information from process designers/equipment manufacturers, and their own experience to create and validate the procedures.\n    \nThe procedures address the following information:\n    \nA?    Steps for safely conducting activities\nA?    Safe operating limits\nA?    Consequences of process deviations, as well as steps required to correct or avoid such deviations\nA?    Safety and health considerations including (1) properties of; and hazards presented by, the chemicals used in the process, (2) precautions necessary to prevent exposure, including engineering controls, administrative controls, and personal protective equipment, (3) control measures to be taken if physical contact or airborne exposure occurs, (4) quality control for raw materials and control of regulated substance inventory levels, and (5) any special or unique hazards\nA?    Safety systems and their functions\n    \nIn addition to the process-specific procedures, the facility also develops and maintains more widely applicable safe work practices addressing issues such as lockout/tag out, confined space entry, opening process equipment or piping, and control over entry to processes. These safe work practices apply to employees and contractors.\n    \nThe facility has a formal review process to approve procedures and changes to procedures. Furthermore, the facility annually reviews existing procedures, makes any needed revisions, and certifies the procedures as current and"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000023333,
      "SummaryText": " accurate. The facility keeps procedures in locations that are readily accessible to employees who may need the procedures.\n    \n5.0 TRAINING\n    \nIn accordance with Section 68.71 of the RMP rule, the facility trains employees to safely perform their assigned tasks. The training program includes initial training as well as periodic refresher training and training updates when major process/equipment changes are made. As part of the training, the facility includes provisions for ensuring that employees understand the training (written tests, field demonstrations, etc.).\n\n5.1 Training Details\n    \nThe facility provides the operators with initial and refresher training, which includes a general overview of the process, properties of chemicals in the process, and safety and health hazards, as well as a detailed understanding of the process operating procedures and safe work practices. The facility provides initial training to new operators before they are allowed to work independently as operators.\n    \nPeriodically, at least every three years, the facility provides the operators with refresher training that, depending on job classification, can include operating procedures training, equipment-specific training, and/or advanced (beyond HAZCOM) chemical-specific training. The refresher training courses empha process overview information, safe work practices, operating procedures that are rarely used such as emergency shutdown, emergency operation and start up following an emergency shutdown, and any operating issues requested by the shift group. \n    \nSome form of evaluation to verify that the training has been understood certifies all training. The facility uses a combination of physical demonstration of skills, oral reviews using a one-on-one format, and written tests. The facility reviews the information missed by an employee who does not pass all testing requirements, and does not allow resumption of work until minimum testing requirements are met.\n    \nAll training is documented and "
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000023333,
      "SummaryText": "includes the employee's name, date of training, and the means used to verify that the employee understood the training.\n    \n6.0 MECHANICAL INTEGRITY\n    \nIn accordance with Section 68.73 of the RMP rule, the facility maintains the mechanical integrity (MI) of the process equipment using an inspection and testing program and a quality assurance program, and ensures that the equipment is designed and installed correctly so that it operates properly. The facility trains maintenance personnel in the hazards of the process, and also provides additional training on procedures for maintaining the ongoing integrity of the process equipment so those job tasks are performed safely.\n\n6.1 Mechanical Integrity Details\n    \nThe facility considers all process-related equipment and safety systems that are critical for preventing and/or mitigating releases of regulated substances to be covered by the MI program. Examples include:\n    \nA?    Pressure vessels and storage tanks\nA?    Piping systems including valves\nA?    Relief and vent systems and devices\nA?    Emergency shutdown Systems\nA?    Controls such as monitoring devices, sensors, alarms, and interlocks Pumps\n    \nThe MI program uses preventive maintenance activities to identify equipment that is deteriorating and needs repair or replacement before failure occurs. This program also specifies the repairs (or parts replacement) needed to return deteriorated equipment to acceptable specifications. The facility maintains written procedures that support the MI program as follows:\n    \nA?    Standard maintenance procedures describe the methods that mechanics use to perform repairs, replacements, and installations.\n    \nA?    Procedures for safe work practices and safety policies specify safe practices for performing maintenance tasks such as lockout/tag out, hot work, confined space entry, line or equipment opening, and control over entry for a covered process by plant and/or contract maintenance personnel.\n    \nA?    The inspection, test, and preventive maintenance procedures d"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000023333,
      "SummaryText": "escribe the methods used by mechanics to perform inspections, tests, and preventive maintenance tasks on process equipment. These procedures follow generally accepted good engineering practices. The equipment inspection and test frequency is based on mean time to failure estimates provided by the manufacturer, adjusted by the facility's own experience.\n    \nThe facility documents all inspection, test, and preventive maintenance activities including:\n    \nA?    Date of inspection, test, or preventive maintenance\nA?    Person performing the activity\nA?    Equipment identifier\nA?    Description of the activity performed\nA?    Results of the activity (including any deficiencies noted)\n    \nThe facility identifies equipment deficiencies through the inspection, test, and preventive maintenance activities or from routine operating and maintenance tasks and correct them promptly. If the facility cannot immediately correct identified equipment deficiencies, the facility implements protective measures to ensure safe operation until repairs can be made.\n    \nThe facility has a quality assurance program that addresses new facilities, equipment, maintenance materials, and spare parts. The program seeks to verify proper fabrication of new equipment, proper installation of new or repaired/replaced equipment, and use of suitable maintenance materials and spare parts in the preventive maintenance and repair tasks.\n    \nThe facility has a comprehensive training program covering all MI issues. The program uses the procedures described previously. For example, all mechanics, maintenance supervisors, and maintenance engineers are trained on hazards for all RMP-covered processes and on safe work practices. The maintenance personnel also receive training on safe maintenance procedures, preventive maintenance practices, and special skills requiring craft certification. All training, as described above, occurs before employees perform tasks in RMP-covered areas independently.\n    \n7.0 MANAGEMENT OF CHANGE\n    \nIn accordance w"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000023333,
      "SummaryText": "ith Section 68.75 of the RMP rule, the facility evaluates and approves all proposed changes (i.e., modifications that are not replacements in kind) to covered process chemicals, technology, equipment, and procedures prior to implementation through the management of change (MOC) program. This program helps ensure that inadvertent or unintended changes are prevented, that any safety and health impacts are addressed, that affected procedures are updated, and that employees and contract employees are informed of and trained in the approved changes. The facility uses this close scrutiny of all changes to help ensure that changes do not adversely impact employees, public safety, or the environment.\n    \n7.1 Management of Change Details\n    \nThe facility analyzes each proposed change and confirms that:\n    \nA?    The technical basis for the change is appropriate\nA?    The safety and health impacts of the change are understood and appropriate controls are in place\nA?    The procedures are modified as appropriate for the change\nA?    The permissible time period is established for temporary changes.  The change is authorized by appropriate personnel\n    \nThe Management of Change (MOC) procedure contains a step-by-step description of the confirmation process. It defines and provides examples of changes and replacements in kind.  Also, it describes in detail the requirement for each confirmation step based on the type of change being considered.  The facility uses an MOC form to document each step in the confirmation process. Changes that pass the confirmation criteria are communicated to the employees who are affected by the change before the change is implemented. When approved changes require updates to the process safety information and/or operating procedures, the facility revises these documents and trains employees on these changes before operations resume. All training is documented as formal operator training.\n    \n8.0 PRE-STARTUP REVIEW\n    \nIn accordance with Section 68.77 of the RMP rule, the fa"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000023333,
      "SummaryText": "cility performs pre-startup safety reviews as a final check to ensure the safety of a new or modified process before it is placed in service.\n8.1 Pre-Startup Review Details\n    \nThe facility performs pre-startup reviews on new stationary sources and on modified stationary sources when the modification is significant enough to require a change in the process safety information. The pre-startup review is completed before regulated substances are brought into the process and only after the facility has confirmed that:\n    \nA?    Construction and equipment are in accordance with design specifications\nA?    Safety, maintenance, operating, and emergency procedures are in place and are adequate\nA?    PHAs have been performed on new stationary sources and all recommendations have been resolved\nA?    MOC requirements have been satisfied for modified processes\nA?    Training has been completed (and documented) for affected employees\n    \nThe facility uses a Pre-Startup Safety Review Checklist as an aid in documenting the performance of the pre-startup reviews. The checklist contains a list of safety questions covering process considerations that must be addressed prior to start up. The person responsible for the project prepares the Pre-Startup Safety Review Checklist and Approval Form and provides the names of the reviewer responsible for confirmation of each of the pre-startup review safety questions. Each reviewer signs off on the checklist and approval form when satisfied that all assigned safety questions are complete and no problems exist. All reviewers must sign off on the Pre-Startup Safety Review Checklist and Approval Form before start up can be authorized.\n    \n9.0 COMPLIANCE AUDITS\n    \nIn accordance with Section 68.79 of the RMP rule, the facility audits the RMP-covered processes to be certain that the prevention programs are effective. The compliance audit program seeks to confirm that RMP prevention program practices for the covered process are consistent with written programs, that the pro"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000023333,
      "SummaryText": "grams adequately address all requirements of the RMP regulations, and that management systems are in place to ensure continued compliance.\n\n9.1    Compliance Audit Details\n    \nThe facility conducts and certifies compliance audits of the prevention program for RMP-covered processes at least every three years. The facility integrates these audits into PSM audits. The audit teams consist of a team leader and an appropriate number of team members based on the  and complexity of the processes to be audited. The audit team collectively possesses the following skills and knowledge:\n    \nA?    Ability to understand the prevention program requirements of the RMP regulation (49 CFR Part 68)\nA?    Capability to conduct interviews and collect audit data\nA?    Capability to document audit results\nA?    Knowledge of the process to be audited\n    \nThe audit team members receive training in RMP regulatory requirements, interview techniques, and methods for data collection before participating in an audit. They use a protocol or a check sheet that contains a series of questions that systematically address each requirement of the RMP regulation. The team leader assigns each auditor specific RMP elements to cover in the audit. Information obtained through field observations, interviews, and document reviews is documented, and deficiencies or noncompliances are identified. At the conclusion of the audit, the audit team prepares a report that identifies any specific noncompliance issues that need to be addressed.\n    \nThe facility promptly reviews the audit findings, determines an appropriate response for each finding, assigns responsibility for implementation of a corrective action, and assigns a target completion date. The corrective actions are placed in a tracking system and progress is monitored quarterly until open issues are resolved. The facility retains the two most recent audit reports.\n\n10.0 INCIDENT INVESTIGATION\n    \nIn accordance with Section 68.81 of the RMP rule, the facility performs incident inves"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000023333,
      "SummaryText": "tigations to help ensure that incidents with catastrophic magnitude or potential are thoroughly investigated, root causes are identified and corrected, and relevant findings are communicated throughout the organization to help prevent a recurrence.\n\n10.1 Incident Investigation Details\n    \nThe facility investigates all incidents (including near misses) that result in, or could reasonably have resulted in, a large uncontrolled release of a regulated substance, serious injuries to employees or the public, and/or damage to the environment. The facility trains employees to identify occurrences requiring investigation and to notify the appropriate person should such an event occur. If the incident meets RMP-classification criteria, the facility initiates an investigation within 48 hours. The facility assembles an investigation team consisting of:\n    \nA?    At least one person knowledgeable in the process or activity involved\nA?    A contract employee if the incident or near miss incident involved the work of a contractor or had acute, adverse health effects on contract employees\nA?    Others with appropriate knowledge and skills to thoroughly investigate and analyze the event\n    \nThe facility trains investigation team leaders in investigation techniques, including root cause analysis. The investigation team follows a written investigation protocol that addresses the key steps of fact finding, determination of cause, and development of recommendations/actions to be taken. From the raw data collected, the incident investigation team prepares the text for an incident summary report, which contains:\n    \nA?    Date and time of the event\nA?    Date and time the investigation started\nA?    Description of the event\nA?    Identification of contributing factors\nA?    Recommendations from the investigation\n    \nThe facility resolves the report recommendations and develops action plans that are tracked to completion. The facility reviews the incident investigation report and action plan items with employees (and contr"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000023333,
      "SummaryText": "act employees, as appropriate) who work in the affected area and/or perform job tasks relevant to the investigation findings. The facility accomplishes this review by discussing the event at the next safety meeting, in shift meetings, or through electronic means. The facility retains incident reports for at least five years.\n\n11.0 EMPLOYEE PARTICIPATION\n    \nIn accordance with Section 68.83 of the RMP rule, the employee participation plan helps ensure that all employees have appropriate involvement in developing and implementing RMP.\n\n11.1 Employee Participation Details\n    \nThe facility has a written employee participation program that meets RMP requirements. In this document, the facility describes in detail the many different ways that employees participate in each element of the RMP regulations. The facility periodically updates this document as changes occur.\n    \nThe facility consults with employees and their representatives on ways to improve participation in the RMP.\n    \n12.0 HOT WORK PERMITS\n    \nIn accordance with Section 68.85 of the RMP rule, the facility uses a hot work permit program to ensure that OSHA's fire prevention and protection precautions, specified in 29 CFR 1910.252(a), are in place before hot work (work involving electric or gas welding, cutting, brazing, or similar flame or spark-producing operation) begins on or near an RMP-covered process.\n\n12.1    Hot Work Permit Details\n    \nThe facility studied OSHA's fire prevention and protection regulation 29 CFR 1910.252(a) and developed a procedure that addresses these requirements. The facility also created a Hot Work Permit Form to document job requirements, the dates for the hot work, and the object on which the work is to be performed. The facility's Property Protection Supervisor audits completed Hot Work Permit Forms to ensure that any errors in preparation or approval are identified and brought to the attention of those involved to prevent recurrence.\n    \n13.0 CONTRACTORS\n    \nIn accordance with Section 68.87 of t"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000023333,
      "SummaryText": "he RMP rule, the facility has a contractor screening procedure to help ensure that the facility hires and uses only contractors who accomplish the desired job tasks without compromising the safety and health of plant employees, the public, or the environment.\n\n13.1    Contractor Details\n    \nThe facility has a detailed contractor safety program that applies to contractors performing maintenance or repair, turnaround, major renovation, or specialty work on or adjacent to an RMP-covered process. \n    \nThe facility selects contractors based on prior site work history and on information that they are required to provide as part of the bid process. The bid information includes their current safety programs (i.e., safety organization, employee education and training, and accident prevention program) and their prior safety performance (i.e., OSHA injury rates, property loss experience, regulatory compliance history, and worker's compensation insurance experience). Bidders that do not provide all of the requested information, that do not have the desired skills, or that have an unsatisfactory safety record are dropped from further consideration. Contractors that meet the minimum safety requirements are then selected based on who can do a quality job in the most cost effective manner. If a contractor currently working in the plant is under consideration, the facility reviews recent safety audits and contacts the facility's people on the job site to verify satisfactory job performance before the facility authorizes the purchase order.\n    \nThe facility provides a site orientation for Contractor Supervisors before they begin work on site. (The facility requires these Contractor Supervisors to provide an overview of the materials covered in this orientation to their employees who will work in the facility.) The facility uses the orientation meeting to familiarize contractors with the type of operations and associated hazards in the areas in which they will be working. The facility can p"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000023333,
      "SummaryText": "rovide MSDSs for the hazardous materials that may affect the contractor work area, copies of plant safe work practices and policies, and emergency response actions associated with the contractor's work.  The facility provides information on site safety orientation materials and the process for completion.  The contracting companies then have the responsibility to provide the site safety orientation to their employees.  The facility then takes the Contractor Supervisors on a tour of the job site to point out the hazards discussed in the meeting, introduce personnel with whom they will communicate, and show where medical attention may be provided.\n    \nThe facility requires contractors to perform the following tasks to help ensure process safety:\n    \nA?    Train each of their employees in the work practices necessary to safely perform the contracted work\nA?    Provide each of their employees with the same site orientation that the facility provided for contractors and supervisors\nA?    Orient their employees on the site safety orientation information.\nA?    Provide documentation that each of their employees has received and understands the training noted above\nA?    Ensure that each of their employees follows the plant safety rules and safe work practices\nA?    Report to the facility's staff any hazards created or found by their employees at the job site\nA?    Provide access and responses to the facility's personnel who may appear at the job site to evaluate contractor safety performance\nA?    Provide information on contract employee job site injuries/illnesses to the facility's designated representative\n \n\nFIVE - YEAR ACCIDENT HISTORY\n    \nGeorgia-Pacific Consumer Products LP has demonstrated a good record of accident prevention.  There have been no RMP reportable accidental releases at the Wauna mill during the past five years.    \n \n\nEMERGENCY RESPONSE PROGRAM\n\n1.0 INTRODUCTION\nIn accordance with Sections 68.90 and 68.95 of the RMP rule, the Wauna Mill maintains an Emergency Response Plan. The Em"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000023333,
      "SummaryText": "ergency Response Plan provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations. Furthermore, the facility coordinates with applicable community emergency response plans and local responders.\n\n2.0 EMERGENCY RESPONSE PLAN ELEMENTS\n    \nThe Wauna Mill's emergency response plan was developed using a comprehensive emergency response plan guidance and addresses all of the elements of a comprehensive, integrated plan, including:\n    \nA?    Current Revision Date\nA?    Table of Contents\nA?    Plan introduction\nA?    Emergency Response\n    Including:\n-    Procedure for calling outside emergency response teams\n-    Means for reporting to applicable government agencies\n-    Evacuation procedures\nA?    Incident Response Operations\nA?    Planning, Logistics, Contract Services\nA?    Incident Follow-up\nA?    Other Information including the following:\n    - Facility and locality information\n    - Notifications for public authorities and corporate management\n    - Response management system\n    - Incident documentation\n    - Training and exercises/drills\n    - Response critique, plan reviews, and modification process\n    - Prevention\n    - Regulatory compliance and cross-reference matrixes\n    \nThe facility has designed a strategy for implementing these elements to work together to provide effective planning for and control of emergency response actions.\n\n2.1 Plan Introduction\n    \nThe plan begins with a brief overview of facility operations and describes the physical area and nature of hazards/events to which the plan is applicable. This overview helps plan users quickly assess the relevance of the plan to particular types of emergencies in specific locations. The facility maintains a list of applicable emergency response regulations to be certain that the facility meets the regulatory obligations. The facility also maintains a brief profile of the facility and its key personnel to facilitate rapid identification of key administrative information that may be needed during an emergenc"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000023333,
      "SummaryText": "y.\n\n2.2 Emergency Response\n    \nThe core of the plan focuses on the range of emergency response actions from discovery of an incident through termination and follow-up actions at the end of emergency response.\n\n2.2.1 Emergency Recognition and Warning\n    \nThe facility emphas recognition, basic assessment, and initial reporting/notification of incidents by employees in the plan. The facility's goal is to ensure that all employees effectively identify and report incidents for further response action under the plan.\n\n2.2.2 Initial Response\n    \nThe facility plan outlines detailed procedures and protocols for initial responses to reported incidents that vary according to incident types. Specific initial response issues that the facility will address are included in the plan:\n    \nA?    Internal/external notifications\nA?    Response management systems\nA?    Preliminary assessment of the situation\nA?    Objectives and priorities for response to specific incidents (such as tactical planning, mitigation actions, and resources required for response)\nA?    Implementation of a tactical plan\nA?    Mobilization of resources\n\n2.2.3 Sustained Actions\n    \nThe facility plan addresses the transition from initial response tasks to sustained response actions where more prolonged mitigation and recovery are in progress under a response management structure.\n\n2.2.4 Termination and Follow-Up\n    \nFinally, the plan addresses how and when a response action ends (and potentially other regulatory requirements begin). The plan also outlines demobilization of response resources (including decontamination), as well as follow-up activities such as incident investigation, response critique, plan review, and follow-up reports.\n\n3.0 COORDINATION\n\nThe facility coordinates with the local emergency response officials, providing information as appropriate.\n\n4.0 CHEMICAL-SPECIFIC PREVENTION STEPS\n    \nIn addition to the required prevention program elements, the Wauna Mill has implemented safety features specific to the Chlorine Dioxide Solut"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000023333,
      "SummaryText": "ion System. Chlorine Dioxide is produced at the facility and stored as a diluted aqueous solution to avoid the necessity of transporting large quantities of the solution. Chlorine dioxide is produced in the chlorine dioxide generator and piped to an absorber column, where an aqueous solution of nominal 1% strength is produced.  For purposes of the Risk Management Plan, it is assumed that the solution strength can range as high as 1.1% (11 grams per liter).\n    \nIn addition to the required prevention program elements, the Wauna Mill has also implemented safety features specific to the Fluid Bed Boiler (FBB) Nitrous Oxide (NOx) Control System.  In this system, anhydrous ammonia is piped from a storage tank to the mill's Fluid Bed Boiler to control NOx emissions, as required by the mill's Title V air operating permit. \n\n5.0 SUMMARY OF SAFETY FEATURES AT REGULATED PROCESSES \n\nThe processes at the mill have been designed to minimize the potential for accidental releases. Table ES-2 briefly summarizes the key safety features for each of the processes regulated under the ARPP. \n\nTABLE ES-2\nSummary of Safety Features at RMP-Regulated Mill Processes\n\nChlorine Dioxide\n    Release Detection: \n          1.    Process area monitors\n    Release Containment or Control: \n          1.    Containment curb around the ClO2 storage tanks with drain\n          2.    Automatic isolation valves between storage tanks\n\nAnhydrous Ammonia\n    Release Detection:\n          1.    Excess flow detection \n          2.    Pressure relief valve\n          3.    Process area monitors    \n    Release Containment or Control:\n          1.    Containment dike around storage tank\n          2.    Emergency scrubber to control releases from pressure relief valves.\n\n\nMANAGEMENT SYSTEM\n\n1.0 OVERALL RESPONSIBILITY\n\nThe Wauna Mill Vice President/Mill Manager has the overall responsibility for ensuring that the facility operates in a safe and reliable manner. This responsibility includes overseeing the implementation of the elements of our Risk "
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000023333,
      "SummaryText": "Management Program. To ensure that our risk management program is appropriately developed and implemented, the Mill Manager has assigned a Chemical Process Safety Coordinator, who reports to the facility's Safety Manager, the responsibility for the development, implementation, and integration of the EPA RMP elements and the elements of OSHA's PSM program as required under Section 68.15 of the RMP rule. \n\nThe Chemical Process Safety Coordinator serves as the chairman of the facility's PSM/RMP Committee. This committee comprises members with responsibilities for developing and managing specific elements of the Risk Management and Process Safety Management programs. The members of this committee are assigned by affected area managers with recommendations from the PSM/RMP Coordinators.\n\nThe following sections identify the specific responsibilities for each aspect of the Risk Management and Process Safety Management programs.\n\n2.0 HAZARD ASSESSMENTS\n\nThe Chemical Process Safety Coordinator has the responsibility for (1) ensuring that off site consequence analysis for each regulated process are consistently performed and documented in accordance with Sections 68.20 through 68.39 and (2) selecting the scenarios that will be reported in the facility RMP as required under Section 68.165. The Chemical Process Safety Coordinator is responsible for ensuring that the accident history for each covered process is appropriately documented and maintained in accordance with Section 68.42 and 68.168 of the RMP rule.\n\n3.0 PREVENTION PROGRAMS\n\nThe Safety Manager has the responsibility for ensuring that the facility has an integrated, effective, and compliant prevention program that meets EPA RMP (Sections 68.65 through 68.87 of the RMP rule) and OSHA PSM requirements.\n\n3.1 Process Safety Information\n\nThe responsibility for process safety information (PSI) (Section 68.65 of the RMP rule) is divided into three areas. The Chemical Process Safety Coordinator has responsibility for process c"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000023333,
      "SummaryText": "al integrity program.\n\n3.5 Mechanical Integrity\n\nIn accordance with Section 68.73 of the RMP rule, the Utilities/Fiber Supply Maintenance Manager has the responsibility for the overall mechanical integrity program, with specific emphasis on written procedures, maintenance training, the equipment and instrumentation inspection/test program and documentation, and equipment deficiency resolution. The Mechanical Integrity Coordinator works with the Utilities/Fiber Supply Maintenance Manager to define and maintain appropriate quality assurance procedures for all types of equipment acquisitions/installations/repairs.\n \n3.6 Management of Change\n\nIn accordance with Section 68.75 of the RMP rule, the Chemical Process Safety Coordinator has the responsibility for the overall management of change (MOC) program in the regulated processes.\n\n3.7 Pre-Startup Review\n\nIn accordance with Section 68.77 of the RMP rule, the Chemical Process Safety Coordinator has the responsibility for the overall pre-startup safety review program for the regulated processes, which is closely related to the MOC program.\n\n3.8 Compliance Audits\n\nIn accordance with Section 68.79 of the RMP rule, the Chemical Process Safety Coordinator has the responsibility for ensuring that compliance audits regularly occur (and are documented) to verify that the prevention program is working and meets EPA/OSHA requirements.\n\n3.9 Incident Investigation\n\nIn accordance with Section 68.81 of the RMP rule, the Safety Manager has the responsibility for designing the incident investigation program. The Safety Manager also has the responsibility of ensuring that only trained personnel lead the investigations. The Operations Utilities Manager and Operations Fiber Manager have the responsibility for ensuring that all incidents in their areas are reported and investigated, and the investigations findings are resolved, documented, and communicated to affected personnel.\n\n3.10 Employee Participation\n\nIn accordance with Section 68.83"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000023333,
      "SummaryText": " of the RMP rule, the Chemical Process Safety Coordinator, working with the employee representatives on the PSM/RMP Committee, have the responsibility of involving employees in the planning and implementation of the facility's prevention program elements.\n\n3.11 Hot Work Permits\n\nIn accordance with Section 68.85 of the RMP rule, the Property Protection Coordinator, working closely with the Chemical Process Safety Coordinator, the Fiber Supply Manufacturing Operations Manager, the Power and Recovery Manager, and Utilities/Fiber Supply Maintenance Manager, has the responsibility of developing and maintaining the facility's hot work permit program.\n \n3.12 Contractors\n\nIn accordance with Section 68.87 of the RMP rule, the Manager of Engineering and Maintenance has the overall responsibility for the contractor program; however, the Safety Manager is responsible for ensuring that the requirements of the safety program are implemented in the areas of his responsibility.\n\n4.0 EMERGENCY RESPONSE PROGRAM\n\nThe Property Protection Supervisor is responsible for (1) designing, implementing, and maintaining the facility's emergency response plan, in accordance with Sections 68.90 and 68.95 of the RMP rule, (2) ensuring that all associated training is conducted and documented as necessary, and (3) responding to local emergency planners/responders when questions arise. \n\n5.0 RMPlan PREPARATION AND SUBMISSION\n\nThe Chemical Process Safety Coordinator, in coordination with the Safety Manager and Environmental Engineering Manager, is responsible for preparing the RMPlan for the facility. After review and approval by the Wauna Mill Vice President/Mill Manager, the Chemical Process Safety Coordinator will submit the RMPlan as required under Sections 68.150 through 68.185 of the RMP rule.\n\n6.0 RMPlan COMMUNICATION\n\nThe Property Protection Coordinator, in coordination with the Chemical Process Safety Coordinator, Safety Manager, and Environmental Engineering Manager has the responsibility of"
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 1000023333,
      "SummaryText": " providing RMPlan information (other than the required EPA submission) to employees and the public as required under Section 68.210 of the RMP rule. The RMPlan documentation will be maintained in the PSM/RMP Center.\n"
    }
  ]
}