{
  "FacilityID": 1000094345,
  "FacilityName": "Ultra Dairy, LLC",
  "FacilityStr1": "6750 West Benedict Road",
  "FacilityStr2": null,
  "FacilityCity": "East Syracuse",
  "FacilityState": "NY",
  "FacilityZipCode": "13057",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36067",
  "LEPC": "Onondaga County LEPC",
  "FacilityLatDecDegs": "43.083",
  "FacilityLongDecDegs": "-76.055",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "6750 Benedict Rd. West",
  "FacilityEmailAddress": "thomas.corp@byrnedairy.com",
  "FacilityDUNS": 828368378,
  "ParentCompanyName": "Byrne Dairy",
  "Company2Name": null,
  "CompanyDUNS": 13246939,
  "Company2DUNS": 0,
  "OperatorName": "Byrne Dairy",
  "OperatorStr1": "2394 U.S. 11",
  "OperatorStr2": null,
  "OperatorCity": "LaFayette",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13284",
  "OperatorZipCodeExt": "3373",
  "RMPContact": "Tom Corp",
  "RMPTitle": "EHS Director",
  "FTE": 215,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000211914",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-11-17 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-07-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-07-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-07-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117107,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000094345,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000118522,
          "ProcessID": 1000117107,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146499,
          "ProcessID": 1000117107,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000646499,
          "ProcessID": 1000117107,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094345,
      "SummaryText": "The Ultra Dairy, LLC (Ultra) facility manufactures extended shelf life milks, creams, and other dairy and related products.  As part of its manufacturing operation, Ultra operates an anhydrous ammonia refrigeration system which is used for process cooling.  Ultra recently replaced two of its four ammonia compressors with larger units and extended the ammonia cooling to a new building area.  These changes included the addition of 3,503 pounds of anhydrous ammonia bringing the total amount in the upgraded system to approximately 19,663 pounds.  \n\n\n\nSince the quantity of anhydrous ammonia at Ultra exceeds the Risk Management Plan (RMP) threshold of 10,000 lbs., the facility has prepared this RMP to meet the requirements of Section 112(r)(7) of the Clean Air Act (CAA) pursuant to the United States Environmental Protection Agency (USEPA) regulations contained in Part 68 of Code 40 of the Federal Regulations (40 CFR Part 68), Sections 68.1-68.220, Accidental Release Prevention Provisions.  The facility also has a Process Safety Management (PSM) plan in place to meet the Occupational Safety and Health Administration (OSHA) requirements of 29 CFR1910.119.  The RMP and PSM plans complement one another to meet both sets of regulations.\n\n\n\nGiven the larger volume of ammonia in the system with the recent plant expansion, the accidental release modeling was updated as required by 40 CFR 68.  The modeling did not drive the toxic endpoint distance of an accidental release to more than two times the distance of the last RMP submission.  Additionally, Ultra did perform a Process Hazard Analysis (PHA) Review, triggering a revision to this analysis and the need to resubmit the RMP update per 68.190(b)5.  The PHA did not result in any significant changes to Ultra's anhydrous ammonia refrigeration system's safety systems, operation or maintenance program.\n\n \n\nUltra goes to great lengths to maintain its ammonia refrigeration system to prevent releases.  An inspection and maintenance prog"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094345,
      "SummaryText": "ram is in place that includes daily, monthly, quarterly, semi-annual and annual activities to monitor and maintain the system by trained personnel in an effort to ensure proper, safe operation.  Ultra also performs periodic non-destructive examination of vessels and piping systems to ensure mechanical integrity. The last full exam was completed in May 2020.\n\n\n\nVarious safeguards and detection measures are in place to identify a potential problem and to minimize the effect of one should it occur.  The ammonia refrigeration system is located in an enclosed and secured room. The facility is equipped with ammonia detection sensors in critical locations to detect ammonia leaks.  Refrigeration system alarms (both visual and audible) are available for high pressure, high temperature and both high and low ammonia levels. Pressure relief valves are in place to relieve the system in the event of an over-pressurization in order to prevent a catastrophic failure.  All of the pressure relief valves are vented external to the building and most are directed through a water diffusion tank to further mitigate an ammonia release.  Additional pressure relief valves have been added as the ammonia refrigeration system has expanded to provide appropriate protection.\n\n\n\nUltra provides specific training on the ammonia system to site Maintenance personnel involved in maintaining the ammonia refrigeration system.  Additionally, more advanced, training is in process for applicable Maintenance Department personnel in 2021.  Awareness training on the hazards of anhydrous ammonia are provided to all site personnel.  Ultra has an Emergency Action Plan in place to provide guidance in the event of a release.  All employees and site workers receive training on the plan and drills are held to evaluate its effectiveness.  Ultra Dairy works with local emergency response personnel to ensure that they are familiar with the key features of the facility, including the ammonia refrigeration system.  Represe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094345,
      "SummaryText": "ntatives from the local fire department, local Haz Mat team and County Department of Emergency Management were most recently at the site in October 2020 for a familiarization refresh visit. Discussions have initiated concerning future tabletop and practice drills.  Annual reviews are in place to accommodate for changes in support service staffing and to maintain familiarity and accommodate for local jurisdiction code requirements.\n\n\n\nUltra Dairy strives to promote safety and awareness of the risks associated with anhydrous ammonia and will work to continually improve the RMP/PSM program and the safety of its ammonia refrigeration system.\n\n"
    }
  ]
}