{
  "FacilityID": 1000097647,
  "FacilityName": "HEB Kirby Distribution Center",
  "FacilityStr1": "5711 FM 78",
  "FacilityStr2": null,
  "FacilityCity": "San Antonio",
  "FacilityState": "TX",
  "FacilityZipCode": "78244",
  "Facility4DigitZipExt": "1005",
  "FacilityCountyFIPS": "48029",
  "LEPC": "Bexar County LEPC",
  "FacilityLatDecDegs": "29.476346",
  "FacilityLongDecDegs": "-098.376182",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "HEB.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "H.E. Butt Grocery Company",
  "Company2Name": null,
  "CompanyDUNS": 7924756,
  "Company2DUNS": null,
  "OperatorName": "H. E. Butt Grocery Company",
  "OperatorStr1": "4300 Industry Park",
  "OperatorStr2": null,
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78218",
  "OperatorZipCodeExt": "5401",
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000170502",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-11-12 13:06:16",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-11-12 13:06:16",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-11-12 13:06:16",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-11-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.475064,
  "FRS_Long": -98.377165,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000120921,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000097647,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000151363,
          "ProcessID": 1000120921,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000122294,
          "ProcessID": 1000120921,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000103798,
              "Process_NAICS_ID": 1000122294,
              "SafetyReviewDate": "2021-09-15 00:00:00",
              "PHA_Date": "2021-09-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-09-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-12-01 00:00:00",
              "TrainingReviewDate": "2019-03-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-09-20 00:00:00",
              "EquipmentInspectionDate": "2021-09-20 00:00:00",
              "EquipmentTested": "Engine Room All Vessels",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2020-03-25 00:00:00",
              "PreStartupReviewDate": "2020-04-09 00:00:00",
              "ComplianceAuditDate": "2019-09-26 00:00:00",
              "AuditCompletionDate": "2022-09-27 00:00:00",
              "IncidentInvestigationDate": "2018-12-08 00:00:00",
              "InvestigationChangeDate": "2019-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2017-09-26 00:00:00",
              "HotWorkPermitReviewDate": "2021-02-24 00:00:00",
              "ContractorSafetyReviewDate": "2021-06-18 00:00:00",
              "ContractorSafetyEvalDate": "2018-03-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000130357,
                  "PreventionProgram3ID": 1000103798,
                  "ProcessChemicalID": 1000151363
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000097647,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-06-15 00:00:00",
    "ERTrainingDate": "2021-11-04 00:00:00",
    "CoordinatingAgencyName": "Bexar County LEPC",
    "CoordinatingAgencyPhone": "2103350300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000097647,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies:\r\n\r\nWe at HEB Kirby Distribution Center San Antonio, Texas are committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as the design, installation, operating procedures, maintenance, and employee training associated with the Ammonia (anhydrous) refrigeration system at our facility.  It is our policy to implement appropriate control measures to prevent possible releases of Ammonia (anhydrous).  In the event that an accidental release did occur, our highly trained employees are available to control and mitigate the effects of the release.  We are also completely coordinated with the San Antonio/Kirby Fire Department, who provides our on-site emergency response services.\r\n\r\n2. The Stationary Source and the Regulated Substances Handled:\r\n\r\nWe have one substance that is regulated by the Process Safety and Risk Management regulations at our facility.  That substance is Ammonia (anhydrous).  The maximum inventory of Ammonia (anhydrous) that is expected to be present in this facility, based on process and operational requirements is 17,000 pounds.\r\n\r\n3. The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps:\r\n\r\nHEB Kirby Distribution Center San Antonio, Texas has taken the following steps as required by 40 CFR Part 68 of the EPA's Clean Air and Emergency Planning and Community Right To Know Acts.  Our Ammonia (anhydrous) refrigeration system is also subject to the OSHA Process Safety Management regulation 29 CFR 1910.119.  The following sections will briefly describe the elements of the accidental release prevention program that is in place at our facility.\r\n\r\nProcess Safety Information:\r\n\r\nOur facility conducts comprehensive analyses to ensure that all of the hazards associated with our Ammonia (anhydrous) refrigeration system are identified and controlled sa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000097647,
      "SummaryText": "fely.  The methodology used to carry out these analyses is the What-If Checklist.  The analyses are completed by a team of qualified personnel with expertise in the engineering, maintenance, operation and safety of the system and are updated at an interval of at least every 5 years.  Any corrective actions noted in these analyses are addressed in a timely manner.\r\n\r\nOperating Procedures:\r\n\r\nHEB Kirby Distribution Center San Antonio, Texas maintains written operating procedures.  These procedures address various modes of operation including initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround.  The information in these procedures is reviewed at least annually by personnel who operate and/or maintain the Ammonia (anhydrous) refrigeration system.\r\n\r\nTraining:\r\n\r\nHEB Kirby Distribution Center San Antonio, Texas has a comprehensive training program to ensure that personnel who operate and/or maintain the Ammonia (anhydrous) refrigeration receive initial and refresher training and evaluations.  New personnel receive basic classroom training in the operation and maintenance of the process, followed by on-the-job training and supervision, until they are evaluated as competent to work independently.  Refresher training is provided at an interval of at least every three years.\r\n\r\nMechanical Integrity:\r\n\r\nHEB Kirby Distribution Center San Antonio, Texas completes preventive maintenance inspections and tests of the Ammonia (anhydrous) refrigeration system to ensure proper operation.  The equipment examined by these inspections and tests includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  All personnel who inspect or test the Ammonia (anhydrous) refrigeration system are given initial training and subsequent refresher training at a frequency of at least every three years.\r\n\r\nManagement of Change:\r\n\r\nWritten"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000097647,
      "SummaryText": "procedures are in place at HEB Kirby Distribution Center San Antonio, Texas to manage change in the Ammonia (anhydrous) refrigeration system chemicals, technology, equipment and processes.  A Process Safety Committee, consisting of personnel who design, install, maintain and operate the system, review all changes that would or could affect the safety and/or mechanical integrity of the Ammonia (anhydrous) refrigeration system.\r\n\r\nPre-Startup Reviews:\r\n\r\nPre-Startup Safety Reviews related to new processes, and to modifications of established processes, are conducted by the Process Safety Committee for all changes that would or could affect the safety and/or mechanical integrity of the Ammonia (anhydrous) refrigeration system.  \r\n\r\nCompliance Audits:\r\n\r\nHEB Kirby Distribution Center San Antonio, Texas conducts regulatory compliance audits on a regular basis to determine whether the requirements of both the Process Safety and Risk Management Planning regulations are implemented.  These compliance audits are completed at a frequency of at least every three years.\r\n\r\nIncident Investigation:\r\n\r\nHEB Kirby Distribution Center San Antonio, Texas promptly investigates any accident that has resulted in, or incident that could reasonably have resulted in a catastrophic release of Ammonia (anhydrous).  These investigations are conducted to identify the circumstances leading up to the accident or incident, as well as any corrective actions to prevent the accident or incident from recurring.  All accident/incident reports are retained for a minimum of 5 years.\r\n\r\nEmployee Participation:\r\n\r\nHEB Kirby Distribution Center San Antonio, Texas believes that Process Safety and Risk Management require a team effort.  Personnel who design, install, maintain or operate the Ammonia (anhydrous) refrigeration system are included in a Process Safety Committee to oversee the safety and mechanical integrity of the system.  Both employees and non-employees have access to all information related to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000097647,
      "SummaryText": "our Ammonia (anhydrous) refrigeration system, including our process hazard analyses.\r\n\r\nContractors:\r\n\r\nOccasionally, HEB Kirby Distribution Center San Antonio, Texas hires contractors to conduct specialized construction or maintenance activities.  Prior to selecting a contractor, a thorough evaluation of the contractor's safety performance and competency is completed.  HEB Kirby Distribution Center San Antonio, Texas has a strict policy of informing contractors of the hazards related to the contractor's work at our facility.  Contractors are also trained in the procedures for emergency notification, evacuation and personnel accountability, should an accidental release of Ammonia (anhydrous) occur.\r\n\r\n4. 5-Year Accident History:\r\n\r\nNo reportable accidents or incidents have occurred at this facility during the past 5 years.\r\n\r\n5. Emergency Response Plan:\r\n\r\nHEB Kirby Distribution Center San Antonio, Texas is included in the written community emergency response plan.  The facility also has it's own emergency response plan.  The emergency response plan includes specific actions to be taken in response to the accidental release of Ammonia (anhydrous).  The emergency response plan includes procedures for informing the public and the local response agencies regarding a release of Ammonia (anhydrous).  The emergency response plan also includes information on emergency health care.\r\n\r\nThe date of the most recent review and/or update of our emergency response plan was June 15, 2021.\r\n\r\nThe date of the most recent emergency response plan training of employees was November 4, 2021.\r\n\r\nThe local agency coordinating our emergency response plan is the San Antonio Fire Department.  Their non-emergency telephone number is (210) 207-7744.\r\n\r\n6. Planned Changes to Improve Safety:\r\n\r\nSeveral developments and changes have resulted from the implementation of the various elements of our Process Safety and Risk Management Plans.  We will continue our annual facility emergency notification"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000097647,
      "SummaryText": ", evacuation and accountability training and drills.  All visitors, vendors, contractors and employees sign or check in and out of our facility.  In addition, they all receive emergency notification, evacuation and accountability training, or are the responsibility of another HEB Kirby Distribution Center partner, when they enter our facility."
    }
  ]
}