{
  "FacilityID": 1000089630,
  "FacilityName": "Absolute Energy, L.L.C.",
  "FacilityStr1": "1372 State Line Road",
  "FacilityStr2": null,
  "FacilityCity": "St. Ansgar",
  "FacilityState": "IA",
  "FacilityZipCode": "50472",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19131",
  "LEPC": "NCREPD",
  "FacilityLatDecDegs": "43.497147",
  "FacilityLongDecDegs": "-092.953019",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.absenergy.org",
  "FacilityEmailAddress": "absenergy@hotmail.com",
  "FacilityDUNS": 794106463,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Rick Schwarck",
  "OperatorStr1": "1372 State Line Road",
  "OperatorStr2": null,
  "OperatorCity": "St. Ansgar",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50472",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tyler Schwarck",
  "RMPTitle": "EHS Manager",
  "FTE": 45,
  "OtherEPAFacilityID": "110027236621",
  "EPAFacilityID": "100000202318",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "13-TV-007R1",
  "SafetyInspectionDate": "2020-07-31 00:00:00",
  "SafetyInspectionBy": "ERI Solutions",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-09-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-09-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-09-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111438,
      "AltID": "Ammonia",
      "FacilityID": 1000089630,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000112748,
          "ProcessID": 1000111438,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139261,
          "ProcessID": 1000111438,
          "ChemicalID": 56,
          "Quantity": 78795.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000639261,
          "ProcessID": 1000111438,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000111439,
      "AltID": "Denaturant",
      "FacilityID": 1000089630,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000112749,
          "ProcessID": 1000111439,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000139262,
          "ProcessID": 1000111439,
          "ChemicalID": 155,
          "Quantity": 1019148.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000122923,
              "ProcessChemicalID": 1000139262,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000122925,
              "ProcessChemicalID": 1000139262,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000639262,
          "ProcessID": 1000111439,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089630,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\nAbsolute Energy, LLC\n\n\n\nAbsolute Energy, LLC (AE) is providing this resubmission to satisfy the 5-year requirement.\n\n\n\nACCIDENTIAL RELEASE PREVENTION AND RESPONSE POLICIES:\n\nAE owns and operates an ethanol manufacturing plant, permitted to produce up to 150 million gallons of denatured fuel-grade ethanol and industrial grade undenatured ethanol. AE has an ongoing commitment to the health and safety of onsite employees and the surrounding community. This commitment is demonstrated by AE's investment in accident prevention such as personnel training for the proper operation and maintenance of plant equipment and preventative maintenance programs. \n\n\n\nStaff is trained on spill prevention and control methods as well as emergency response plants in place at the facility. It is AE policy to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, plant personnel will respond to contain the release, as necessary. AE management is dedicated to safety, spill prevention, and proper emergency response.\n\n\n\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES:\n\nAE is located in approximately 0.6 miles south of Lyle, MN and 9 miles north of St. Ansgar, Mitchell County, Iowa. The facility operates 24 hours per day, 7 days per week for the purpose of manufacturing fuel grade ethanol from corn.  The regulated substances stored at the facility are anhydrous ammonia and a flammable mixture - natural gasoline (denaturant). \n\n\n\nWORST CASE AND ALTERNATIVE CASE SCENARIOS:\n\nWorst Case Scenarios:\n\n1.  Anhydrous Ammonia:  Anhydrous ammonia is stored as a gas liquefied by pressure in an aboveground steel tank. The worst-case scenario used is a release of the entire contents of the storage vessel, creating a toxic cloud. RMP Comp was used to determine the worst-case distance to endpoint; the model results were 5.1 miles radius.  Population data was obtained using Circular Area Profiles"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089630,
      "SummaryText": " (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. hospitals, schools, etc) was obtained using Google Earth. Public receptors are located within the worst-case distance to endpoint for ammonia.  \n\n\n\n2. Flammable Mixture (Denaturant): The flammable mixture stored onsite is natural gasoline, typically referred to as denaturant. Natural gasoline is used onsite to denature ethanol prior to shipment offsite. Denaturant is stored in a steel tank in the facility tank farm. The tank is in a diked containment structure that contains an impermeable liner with gravel overlay. A representative Natural Gasoline SDS  was used to determine RMP applicability and the entire mixture was assumed to be Pentane. The worst-case scenario used is the release of the entire contents of the denaturant tank, causing a vapor cloud explosion. RMP Comp was used to determine the worst-case distance to endpoint; the model results were 0.8-mile radius. Population data was obtained using Circular Area Profiles (CAPS)which incorporates 2010 U.S. Census Data. Public receptor information (i.e. hospitals, schools, etc.) was obtained using Google Earth. Public receptors are located within the worst-case distance to endpoint for denaturant.  \n\n\n\nAlternative Scenario:\n\n1.  Anhydrous Ammonia: The alternative scenario used for anhydrous ammonia is a release due to a vessel leak. This scenario is considered the most likely cause of an ammonia release onsite. RMP Comp was used to determine the alternative distance to endpoint; the model results were 0.3 miles. Population data was obtained using Circular Area Profiling System (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals) was obtained using Google Earth.  Public Receptors are located within the alternative case distance to endpoint for ammonia.  \n\n\n\n2.  Flammable Mixture (Denaturant): The alternative scenario used for the flammable mixture is the release of natural gasoline "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089630,
      "SummaryText": "due to a tanker truck loadout spill, causing a vapor cloud fire. The endpoint used was an over pressurization of 1 PSI, a worst-case option. Denaturant deliveries at the facility typically occur during normal business hours with a facility staff member overseeing loadout operations via camera - therefore a release at the loadout area could be ceased within minutes by manual overrides. For this scenario, passive and active mitigation was not considered, as the mitigation strategies currently in place would not contain a vapor cloud fire. RMP Comp was used to determine the alternative distance to end point; the model results were 0.1 miles. Area Profiling System (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals) was obtained using Google Earth.  No public receptors are located within the alternative case distance to endpoint for denaturant.  \n\n\n\nThe AE facility qualifies as a Program 3 for anhydrous ammonia, the facility includes the flammable mixture as a Program 3 for RMP/PSM purposes for consistency throughout the facility. \n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nAE is fulfilling its duties to comply with the EPA requirements of 40 CFR Part 68.115(d) through the completion of this RMP and similar efforts regulated by OSHA's Process Safety Management Standard (29 CFR 1910.119). AE has complied with process safety information, safe work practices such as Hot Work, Confined Space Entry, and Lockout/Tagout, and operations and maintenance procedures are documented on-site. Periodic functions such as process hazard analyses (PHA), training, management of change, pre-startup safety reviews, and incident investigation are conducted on a regular basis.  \n\n\n\nThe denaturant tank is equipped with tank sensors and alarms to provide notification to AE staff if an issue arises due to content of the tank. The tank is also within a bermed containment structure. The anhydrous ammon"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089630,
      "SummaryText": "ia tank is equipped with a manual shut off valve. These chemical specific prevention measures minimize the risk for an RMP reportable incident. Compliance audits of the RMP Prevention Program will be conducted on a regular basis to assure compliance with EPA and OSHA regulations. \n\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\nThere have been no reportable accidents associated with RMP covered processes at the AE facility.\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\nAE is registered with the Mason City, IA LEPC and therefore does not have its own Emergency Response Plan for emergencies requiring a high level of emergency support. In the case that an incident occurs which requires a high level of emergency response, AE will call 9-1-1 for the necessary fire, medical, or other emergency support. \n\n\n\nAE ethanol plant has several safety programs in place at the facility that incorporate emergency response.  AE has evacuation and response procedures for fires, explosions, spills, etc. outlined in the facility Emergency Action Plan. The Plans listed as part of this Executive Summary have been prepared in accordance with the applicable regulations, as necessary.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nAE is committed to protecting its employees, the greater community, and the environment from the release of hazardous substances used in the ethanol fuel production process. AE management is committed to promoting a safe work environment and will continue to provide its employees with the necessary training, tools, and ongoing support to operate the ethanol production facility in a safe and efficient manner. Periodic audits will be conducted to provide assurance AE is doing everything reasonable to minimize the effects of an accidental release. \n\n"
    }
  ]
}