{
  "FacilityID": 1000015564,
  "FacilityName": "Sun-Maid Growers of California-Ripperdan",
  "FacilityStr1": "27400 Avenue 6",
  "FacilityStr2": null,
  "FacilityCity": "Madera",
  "FacilityState": "CA",
  "FacilityZipCode": "93637",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06039",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.836497",
  "FacilityLongDecDegs": "-120.053247",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "www.sunmaid.com",
  "FacilityEmailAddress": "smaid@sunmaid.com",
  "FacilityDUNS": 9234378,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sun-Maid Growers of California",
  "OperatorStr1": "13525 South Bethel Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Kingsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93631",
  "OperatorZipCodeExt": "9232",
  "RMPContact": "Tim Parker",
  "RMPTitle": "Director of Continuous Improvement",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106057",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-04-20 00:00:00",
  "SafetyInspectionBy": "Madera County Environmental Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-08-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-08-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-08-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.83676,
  "FRS_Long": -120.06034,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000019504,
      "AltID": "Sulfur Dioxide Dehydrator",
      "FacilityID": 1000015564,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000019886,
          "ProcessID": 1000019504,
          "NAICSCode": "311423",
          "_desc": {
            "NAICS_CODE": "311423",
            "NAICS_DESCRIPTION": "Dried and Dehydrated Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000023211,
          "ProcessID": 1000019504,
          "ChemicalID": 49,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000523211,
          "ProcessID": 1000019504,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000015564,
      "SummaryText": "EXECUTIVE SUMMARY\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\nSun-Maid - Ripperdan has a long standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Sulfur Dioxide Process.  Sun-Maid - RipperdanA?s policy is to implement reasonable controls to prevent foreseeable releases of regulated substance.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\nThe facility utilizes sulfur dioxide for their system. At most, 7 One-Ton Cylinders are kept on-site for a total of 14,000 pounds.  During the downseason, major maintenance issues are handled to ensure the safe operation of the Sulfur Dioxide Process.\n\nHAZARD ASSESSMENT SUMMARY/OFF-SITE CONSEQUENCE ANALYSIS\nWorst-Case Release Scenario Results Summary\nScenario Description: Per the CalARP Regulations, one worst-case analysis has been defined for the Sulfur Dioxide Process.  The results can be found in the Hazard Assessment documentation located in the CalARP Compliance Workbook.\nAlternative Release Scenario Results Summary\nScenario Description: A realistic alternative release scenario was defined for the Sulfur Dioxide Process.  The results can be found in the Hazard Assessment documentation located in the CalARP Compliance Workbook.\n\nRISK CONSIDERATIONS\nAlthough the storage and use of sulfur dioxide has inherent potential risks, and worst-case release scenarios can potentially reach the community; Sun-Maid - Ripperdan has recognized these potential risks and structured its safety programs to make the worst-case type of event non-credible.  In addition to the safety practices of the company and facility personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000015564,
      "SummaryText": "., In the event of a release, sudden rupture and flashing of sulfur dioxide would be highly turbulent. Turbulence causes entrainment of air and the released vapor dilutes much more quickly than is shown in the model).\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with a sulfur dioxide release:\n- There are process valves to permit isolation of any leaks in place.\n- The system undergoes scheduled maintenance to reduce the likelihood of catastrophic failures.\n- Personal Protective Equipment (PPE) is used by facility personnel, as necessary.\nThe history of Sun-Maid - Ripperdan (i.e., no CalARP-applicable sulfur dioxide releases in the last five years) reflects the adequacy of the design and diligence of the plant staff in safely operating the system.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM \nAs part of the implementation of CalARP Program 3, key Prevention Program elements were documented and implemented by Sun-Maid - Ripperdan to manage process safety issues associated with the use of sulfur dioxide. Prevention Program 3 elements are listed in the table on the following page:\n \n\nCalARP (19 CCR)\nCompliance Workbook Tab\n2760.1    Process Safety Information (PSI) \n2760.2    Process Hazard Analysis (PHA)\n2760.3    Operating Procedures (OP)\n2760.4    Training (TRN)\n2760.5    Mechanical Integrity (MI)\n2760.6    Management of Change (MOC)\n2760.7    Pre-Startup Review (PSSR)\n2760.8    Compliance Audits (CA)\n2760.9    Incident Investigation (II)\n2760.10 Employee Participation (EP)\n2760.11 Hot Work Permit (HWP)\n2760.12 Contractors (CON)\nArticle 7 Emergency Planning & Response (EP&R)\n\nFIVE-YEAR ACCIDENT HISTORY\nThere have been no CalARP-applicable releases of sulfur dioxide at the facility in at least the past five years.  \n \nEXTERNAL EVENTS ASSESSMENT \nPursuant to the requirements of California Health & Safety Code, Title 19, Division 2, Chapter "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000015564,
      "SummaryText": "4.5, Section 2745.7(q), general events external to the plant that can conceivably cause a release of sulfur dioxide were addressed by the 2010 Process Hazard Analysis for the sulfur dioxide system.  Specifically, the external events requirements were met with the following actions:\nDescription of the types of natural and human caused external events considered in PHA Section 2760.2 or Hazard Review Section 2755.2.  \n-  During the Process Hazard Analysis, a broad list of external events was considered by the Team.  However, the Team only deemed some of these events as being credible, and fully developed those scenarios that present an opportunity for sulfur dioxide release.  \nThe estimated magnitude or scope of external events which were considered. If not known, the owner or operator of the stationary source shall work closely with the AA to determine what is required. If seismic events are applicable, the parameters used in the consideration of the seismic analysis and which edition of the Uniform Building Code was used when the process was designed.\n-  The magnitude of the external events considered are detailed within the Process Hazard Analysis Worksheets.\nFor each external event, with a potential to create a release of a regulated substance that will reach an endpoint offsite, apply  \n- The expected date of completion of any changes resulting from the PHA;\n- Major hazards identified;\n- Process controls in use;\n- Mitigation systems in use;\n- Monitoring and detection systems in use; and,\n- Changes since the last PHA.\n\n- The recommendations precipitating from the Process Hazard Analysis are summarized in Attachment B of the Process Hazard Analysis report.  All recommendations were assigned an expected completion date.\n- The Human Factors discussed in the Process Hazard Analysis as a separate node.  The worksheets can be found in Attachment C of the Process Hazard Analysis report, including major hazards identified, process controls in use, mitigation systems in us"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000015564,
      "SummaryText": "e, and monitoring and detection systems in use.\n- There were no significant changes since the last Process Hazard Analysis.\nThe date of the most recent field verification that equipment is installed and maintained as designed.\n- The most recent field verification of equipment will be conducted before system startup in August 2010 as part of facilityA?s routine inspection and walk down schedule.\n\nFLAMMABLES: WORST-CASE \nThe use of flammable materials at Sun-Maid - Ripperdan facility is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable. \n\nFLAMMABLES: ALTERNATIVE RELEASE\nThe use of flammable materials at Sun-Maid - Ripperdan facility is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable.\n\nEMERGENCY RESPONSE PROGRAM \nSun-Maid - Ripperdan has implemented an Emergency Action Plan and does not assume the role of first responder during an emergency. Sun-Maid - Ripperdan has filed a Business/Emergency Response Plan, which can be found in Attachment A of the EMERGENCY PLANNING & RESPONSE Tab, and this plan includes:\n- Emergency Alarm Procedures\n- Evacuation Procedures\n- Safety and Health Considerations\n- Notification Procedures\n\nPLANNED CHANGES TO IMPROVE SAFETY \nSun-Maid - Ripperdan is extremely diligent in the handling of sulfur dioxide. Planned changes to improve safety are listed as recommendations in the PHA Report."
    }
  ]
}