{
  "FacilityID": 1000052040,
  "FacilityName": "412th Test Wing (412 CEG/CEV-Env Mgt Div)",
  "FacilityStr1": "120 North Rosamond Blvd",
  "FacilityStr2": "Bldg 3735, Suite A",
  "FacilityCity": "Edwards AFB",
  "FacilityState": "CA",
  "FacilityZipCode": "93524",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "34.922600",
  "FacilityLongDecDegs": "-117.899100",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.edwards.af.mil/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Edwards Air Force Base",
  "Company2Name": "United States Air Force",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "412th Test Wing (412 CEG/CEV-Env Mg",
  "OperatorStr1": "120 North Rosamond Blvd",
  "OperatorStr2": "Bldg 3735, Suite A",
  "OperatorCity": "Edwards AFB",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93524",
  "OperatorZipCodeExt": null,
  "FTE": 15000,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230779",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "9002-V-2000-1",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-09-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-09-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-09-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-06-07 00:00:00",
  "DeRegistrationEffectiveDate": "2016-11-01 00:00:00",
  "AnniversaryDate": "2020-09-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 34.9226,
  "FRS_Long": -117.8991,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000065700,
      "AltID": "AFRL 1-125 MMH Storage",
      "FacilityID": 1000052040,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000081307,
          "ProcessID": 1000065700,
          "ChemicalID": 3,
          "Quantity": 51000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000066842,
          "ProcessID": 1000065700,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000065699,
      "AltID": "AFRL 1-125 HY Storage",
      "FacilityID": 1000052040,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000081306,
          "ProcessID": 1000065699,
          "ChemicalID": 38,
          "Quantity": 59000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000066841,
          "ProcessID": 1000065699,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000065701,
      "AltID": "AFRL 1-125 UDMH Storage",
      "FacilityID": 1000052040,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000081308,
          "ProcessID": 1000065701,
          "ChemicalID": 2,
          "Quantity": 46000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000066843,
          "ProcessID": 1000065701,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000065702,
      "AltID": "AFRL 1-39 HY Storage",
      "FacilityID": 1000052040,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000081309,
          "ProcessID": 1000065702,
          "ChemicalID": 38,
          "Quantity": 35000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000066844,
          "ProcessID": 1000065702,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000065703,
      "AltID": "AFRL 1-39 MMH Storage",
      "FacilityID": 1000052040,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000081310,
          "ProcessID": 1000065703,
          "ChemicalID": 3,
          "Quantity": 31000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000066845,
          "ProcessID": 1000065703,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000065704,
      "AltID": "AFRL 1-39 UDMH Storage",
      "FacilityID": 1000052040,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000081311,
          "ProcessID": 1000065704,
          "ChemicalID": 2,
          "Quantity": 28000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000066846,
          "ProcessID": 1000065704,
          "NAICSCode": "92811",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000052040,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-01-02 00:00:00",
    "ERTrainingDate": "2015-01-02 00:00:00",
    "CoordinatingAgencyName": "Kern Co. Environmental Health Servs",
    "CoordinatingAgencyPhone": "6618612521",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000052040,
      "SummaryText": "1. THE ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT YOUR FACILITY\r\nThe Edwards Air Force Base (AFB) accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices.  Applicable procedures of the State of California and US-EPA are adhered to, including training, systems management, and emergency response procedures.\r\n\r\nEdwards AFB recognizes its responsibility to make employee, community and environmental protection an integral part of daily operations.  Edwards AFB is committed to being a responsible member within the community by giving top priority to conducting operations in a safe and environmentally sound manner.  The base is committed to working closely with local communities, environmental groups, and local governmental agencies to meet its obligations.\r\n\r\nIt is the policy of Edwards AFB that every employee is entitled to a safe and healthful place in which to work and live.  Edwards AFB incorporates the concepts of environmental responsibility and with safety into all aspects of base operations.  As part of Edwards AFB's obligation to protect the integrity of human, environmental, physical, and financial resources, and to conserve and efficiently utilize those resources, Edwards AFB will: comply fully with laws regulating environmental protection and employee health and safety; furnish work places free of recognized hazards likely to cause injury to people and the environment; train employees in safe and environmentally conscious practices and require compliance with environmental, health, and safety regulations, policies, and procedures; and provide professional staff to maintain and support environmental, health, and safety programs.\r\n\r\n \r\n2. YOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\r\nEdwards AFB is a United States Air Force (USAF) facility under the Department of Defense (DoD), and is the home of th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000052040,
      "SummaryText": "e Air Force Test Center.  Edwards AFB is located in southern California, the main base complex being approximately 13 miles east of Rosamond, California.  Edwards AFB is situated in the counties of Los Angeles, San Bernardino, and Kern.  The bulk of the base is in Kern County.  Edwards AFB covers over 301,000 acres of largely open high desert land and has a population of approximately 15,000 people, including military personnel and dependents, government civilian employees and contractor personnel.  \r\n\r\nHydrazine (HY), Chemical Abstracts Services (CAS) registry number 302-01-2; Mono-Methyl Hydrazine (MMH), CAS registry number 60-34-4; and Unsymmetrical Di-Methyl Hydrazine (UDMH), CAS registry number 57-14-7, are stored and used at Edwards AFB as rocket fuel propellant in rocket-engine testing performed at the Air Force Research Laboratory (AFRL).  These chemicals are stored and/or used in their pure form at AFRL Areas 1-125 and 1-39.\r\n\r\nAFRL Area 1-125 is located in the northeastern section of the base and is 3.6 miles south of Boron (the closest population center).  The source location latitude/longitude is: 34o 54' 57'' N / 117o 40' 56\" W (approximate center of Area 1-125).  The closest offsite point to Area 1-125 is 2.4 miles due north.  The maximum amount of HY stored (the covered process) is 59,000 pounds.  The maximum amount of MMH stored (the covered process) is 51,000 pounds.  The maximum amount of UDMH stored (the covered process) is 46,000 pounds. The maximum amount of each regulated chemical is stored in two 3,500 gallon tanks. The worst case release is from a single 3,500 gallon tank into a diked area. \r\n\r\nAFRL Area 1-39 is located in the middle-eastern section of the base and is 6.4 miles south of Boron (the closest population center).  The source location latitude/longitude is: 34o 54' 08'' N / 117o 39' 49\" W.  The closest offsite point to Area 1-39 is 5.6 miles due north.  The maximum amount of HY stored (the covered process) is 35,000 pounds.  The ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000052040,
      "SummaryText": "ximum amount of MMH stored (the covered process) is 31,000 pounds.  The maximum amount of UDMH stored (the covered process) is 28,000 pounds.  The maximum amount of each regulated chemical is stored in multiple 700 gallon portable tanks. The worst case release is from a single 700 gallon tank into a collection sump. The maximum amount of each regulated chemical is stored in multiple 700 gallon portable tanks. The worst case release is from a single 700 gallon tank into a collection sump. \r\n\r\n\r\n3. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\nEdwards AFB has an established accidental release prevention program. The key concepts in the base accidental release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees.\r\n\r\nEdwards AFB encourages and supports employee participation in the accidental release prevention through safety meetings, safety down days, and marquee and email communication.\r\n\r\nEdwards AFB policy is to construct all new equipment, systems, and facilities in accordance with the most current building and safety codes.  This ensures that the appropriate safety and release prevention systems are included from the beginning of each project.  Edwards AFB maintains logs of maintenance activities to ensure that key systems are maintained appropriately to minimize the risk of any accidental release.\r\n\r\nEdwards AFB is committed to providing appropriate training to all employees regarding safety procedures.  New employees are provided comprehensive on-the-job safety training for the systems they will be using during their initial orientation.  In addition, Edwards AFB conducts regularly scheduled safety training for all employees each year. Additional training is provided to maintenance personnel for the systems for which they are responsible.\r\n\r\n\r\n4. THE FIVE-YEAR ACCIDENT HISTORY\r\nEdwards AFB has not had an accidental release of HY, MMH, UDM"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000052040,
      "SummaryText": "H, or any other regulated substance, within the past five years that has resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\n\r\n5. THE EMERGENCY RESPONSE PROGRAM\r\nThe Edwards AFB Installation Emergency Management Plan (IEMP) 10-2, dated January 2014, identifies procedures to be followed in the event of major accidents, including any accidental releases of any hazardous material (HAZMAT).  All Edwards AFB organizations are required to implement emergency procedures and responses in accordance with IEMP 10-2.  The plan is maintained by the base Civil Engineering Group Emergency Management Branch (412 CEG/CEXX, 661-277-4840).  The plan outlines and describes specific actions to be accomplished during an event or contingency that would negatively impact Edwards AFB or surrounding areas.  In the event of a HAZMAT release subject to a federal RMP and CalARP, or any HAZMAT release for that matter, the HAZMAT response activities and actions detailed in IEMP 10-2 would be activated and procedures within implemented, including immediate communication and coordination with affected local emergency planning organizations.  \r\n\r\nEdwards AFB is an active flying base in the USAF.  As such, Edwards AFB has extensive emergency response capabilities that greatly exceed the capabilities of the communities that immediately surround Edwards AFB.  The base has onsite capabilities ready to respond to any HAZMAT emergency, and is executed under the direction of the base Fire Chief.  The Edwards AFB Fire Department and HAZMAT response teams have established mutual aid agreements with the Fire Departments in Kern, Los Angele, and San Bernardino Counties. These agreements allow for mutual assistance between Edwards AFB emergency response capabilities and surrounding offsite communities. IEMP 10-2 includes specific procedures and contacts for engaging with county eme"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000052040,
      "SummaryText": "rgency response agencies when mutual assistance is required.  \r\n\r\n\r\n6. PLANNED CHANGES TO IMPROVE SAFETY\r\nEdwards AFB approaches improvements to safety as a continuous process.  The very nature of operations at Edwards AFB dictates that as safety issues or problems are uncovered in an operation, and then addressed, the lessons learned are applied to similar operations.  This process is ongoing within the DoD and USAF safety culture.  As such, improvements to all aspects of operational safety are accomplished on a continuous and not necessarily planned basis.\r\n\r\nAll Edwards AFB operations are subject to periodic inspections by base safety organizations to assess safe operation, and note problem areas and solutions.  However, any operation that may be deemed unsafe, or potentially unsafe, can be halted at the discretion of the affected personnel and not allowed to continue until corrective actions are implemented.  Again, it is the approach to safety as a continuous process that is essential to improving the safety of all Edwards AFB operations."
    }
  ]
}