{
  "FacilityID": 1000098107,
  "FacilityName": "Hill Brothers Chemical Co. - San Jose Facility",
  "FacilityStr1": "410 Charcot Avenue",
  "FacilityStr2": null,
  "FacilityCity": "San Jose",
  "FacilityState": "CA",
  "FacilityZipCode": "95131",
  "Facility4DigitZipExt": "1190",
  "FacilityCountyFIPS": "06085",
  "LEPC": "Santa Clara County Env. Health",
  "FacilityLatDecDegs": "37.382000",
  "FacilityLongDecDegs": "-121.913889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.hillbrothers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 53233631,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 56599178,
  "Company2DUNS": 0,
  "OperatorName": "Hill Brothers Chemical Company",
  "OperatorStr1": "3000 E. Birch Street",
  "OperatorStr2": null,
  "OperatorCity": "Brea",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92821",
  "OperatorZipCodeExt": null,
  "RMPContact": "Rick Hill",
  "RMPTitle": "Corporate EHS Manager",
  "FTE": 13,
  "OtherEPAFacilityID": "Cad 980736896",
  "EPAFacilityID": "100000067287",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-08-03 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-12-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-12-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-12-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-12-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.38217,
  "FRS_Long": -121.91509,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000121514,
      "AltID": "Anyhdrous Ammonia System",
      "FacilityID": 1000098107,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000122888,
          "ProcessID": 1000121514,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000152160,
          "ProcessID": 1000121514,
          "ChemicalID": 56,
          "Quantity": 160485.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000652160,
          "ProcessID": 1000121514,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000121515,
      "AltID": "Aqua Ammonia System",
      "FacilityID": 1000098107,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000122889,
          "ProcessID": 1000121515,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000152161,
          "ProcessID": 1000121515,
          "ChemicalID": 57,
          "Quantity": 464656.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000652161,
          "ProcessID": 1000121515,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000098107,
      "SummaryText": "RISK MANAGEMENT PLAN - SAN JOSE FACILITY\n\n\n\nEXECUTIVE SUMMARY\n\n\n\nHill Brothers Chemical Company has established a risk management plan according to Federal EPA's (40 CFR Part 68), OSHA Process Safety Management (29 CFR 1910.119), and California Accidental Release Prevention (CalARP) regulations to enhance already existing safety and emergency response programs for the Anhydrous Ammonia System and Aqueous Ammonia Manufacturing and Storage processes at its San Jose Facility.\n\n\n\nHill Brothers Chemical Company is extremely cautious in the handling of all chemicals and is very diligent about safety for its employees, the communities where its facilities are located, and customers.  Hill Brothers Chemical Company staff is well trained and utilizes modern equipment to monitor its facilities to provide safeguards, while effectively employing these chemicals.  \n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nHill Brothers Chemical Company has an emergency action plan in effect to handle potential emergency situations at this facility.  This plan was designed to meet the following objectives:\n\n\n\n1.) To save lives.\n\n2.) To minimize and avoid injuries.\n\n3.) To protect the environment.\n\n4.) To minimize property damage.\n\n \n\nHill Brothers Chemical Company policy is to conduct all operations in a safe and conscientious manner to prevent accidental releases of any hazardous material, including substances regulated through the Federal Accidental Release Prevention Program and CalARP.  Hill Brothers Chemical Company trains its employees at this facility to properly handle and store hazardous materials to minimize the possibility of adversely affecting its worker's health, the workplace, the public, and the environment.  Hill Brothers Chemical Company Accidental Release Prevention policy is implemented through the management system contained in its RMP.\n\n\n\nIn the event of an emergency, Hill Brothers Chemical Company will contact the Fire Department to respond.  A "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000098107,
      "SummaryText": "designated emergency contact for the plant initiates emergency notifications.  The San Jose Facility maintains a cooperative relationship with the Fire Department to ensure a full understanding of normal storage practices and emergency response and evacuation procedures related to regulated substances.  \n\n\n\n\n\nStationary Source and Regulated Substance\n\n\n\nAnhydrous ammonia and aqueous ammonia are the two regulated substances managed at this plant and covered by the Federal Accidental Release Prevention Program and CalARP.  The Anhydrous Ammonia System is used for repackaging ammonia cylinders.   In the Aqueous Ammonia System, commercial grade anhydrous ammonia is used to manufacture aqueous ammonia (ammonium hydroxide) in grades ranging from 20% and 30% for distribution to customers.  Anhydrous ammonia is a gas liquefied under pressure and stored at ambient temperature at the San Jose Facility.  Aqueous ammonia is stored as a liquid at ambient pressure and temperature.  \n\n\n\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nHill Brothers Chemical Company has a PSM program in place to manage handling of regulated substances, which complies with Federal RMP, CalARP and PSM requirements.  The program includes strict requirements for written operating procedures, personnel training, contractor safety, equipment maintenance, incident investigation, process hazard analysis, management of change and periodic review or audit of program elements.  Management of change element addresses proper implementation of system updates to ensure that all changes are reviewed properly by knowledgeable persons, all engineering documents and operating procedures reflect the change, and personnel are trained on the change.   Process Safety Management also requires a pre-startup safety review to ensure that the system is properly reviewed before it is put back into service after a major change.   \n\n\n\nHill Brothers Chemical Company prevention program emphasizes r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000098107,
      "SummaryText": "isk management through the use of equipment rated for ammonia service; training for its employees in hazard communication; proper operating procedures for the repackaging of anhydrous ammonia; level, pressure and temperature limits for process equipment and storage tanks; implementation of programs to maintain the mechanical integrity of equipment; internal auditing and inspection programs; procedures to address change within the parameters of this RMP; and awareness level emergency response.  \n\n\n\nHill Brothers Chemical Company standard operating procedures include routine observation of equipment condition during daily start-up procedures, production procedures, and daily shutdown procedures.  Two trained operators are always present during bulk transfer to ensure safe operation and movement of trucks on the property and the integrity of hoses used for filling.  Operators are always present during repackaging operations to observe pressure and temperature gauges on tanks and pipes and to be alert for any releases of pressure relief valves installed on tanks or hydrostats on piping systems.  Hill Brothers Chemical Company trains their operators carefully before allowing them to take the lead in repackaging operations.  A key training method for process operations involves on-the-job supervision over extended periods, using repeated demonstration of correct process steps in accordance with written procedures. \n\n\n\n\n\nFive Year Accident History\n\n\n\nThe five-year accident history (December 2016 to December 2021) for the Hill Brothers Chemical Company San Jose Facility reveals that there were no reportable accidents during this period.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nHill Brothers Chemical Company is taking additional steps to further public safety.  Several studies have been conducted recently to examine mitigation measures and additional steps to further ensure public safety at the Hill Brothers Chemical Company San Jose Facility.  The changes primarily include"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000098107,
      "SummaryText": " detailed reviews and updates of formal operating, maintenance, and emergency response procedures to address comments and recommended actions identified through various analyses.  All recommended changes from the Process Hazard Analysis, Pre-Startup Safety Review and Seismic Assessment have been reviewed and are being implemented."
    }
  ]
}