{
  "FacilityID": 1000085823,
  "FacilityName": "Wyckoff Farms, Inc",
  "FacilityStr1": "164806 W Lemley",
  "FacilityStr2": null,
  "FacilityCity": "Prosser",
  "FacilityState": "WA",
  "FacilityZipCode": "98930",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.150716",
  "FacilityLongDecDegs": "-119.502751",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David Pierce",
  "OperatorStr1": "165808 W Lemley",
  "OperatorStr2": null,
  "OperatorCity": "Grandview",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98930",
  "OperatorZipCodeExt": null,
  "RMPContact": "Cash Smallwood",
  "RMPTitle": "Maintenance Manager",
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000228522",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-01 00:00:00",
  "SafetyInspectionBy": "Prosser Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-03-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-03-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-03-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107150,
      "AltID": "Refrigerated Berry Wrhse",
      "FacilityID": 1000085823,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000108423,
          "ProcessID": 1000107150,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000134012,
          "ProcessID": 1000107150,
          "ChemicalID": 56,
          "Quantity": 22014.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000634012,
          "ProcessID": 1000107150,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000085823,
      "SummaryText": "This correction was due to the change in the name of the person responsible for the RMP.  Full Resubmission is not necessary 3/17/2020.\n\n\n\nThis Resubmission is due to the 5-Year anniversary for submitting Wyckoff Farms last submission. Wyckoff Farms, Inc, a Washington Corporation, built this facility in 2012.  The facility receives, chills, freezes and stores berries.  The system consists of two Engine Rooms that use Anhydrous Ammonia as a refrigerant.  Anhydrous Ammonia is classified as a toxic chemical by EPA, with a threshold of 10,000 lbs.  Upon completion of construction, the total ammonia inventory at the facility was under 10,000 lbs so Risk Management Plan reporting to EPA was not required.  In 2014, equipment was added and additional ammonia was required to operate the facility.  The ammonia inventory then was over 10,000 lbs and the Risk Management Plan was reported on 1/30/2015 to EPA.\n\n\n\nThe facility consists of two engine rooms with a total ammonia inventory of approximately 22,014 lbs.  It is the policy of Wyckoff Farms to operate in compliance with all applicable federal and state rules and regulations.  Inspections show the design and construction of this facility was in accordance with published standards, tests or recommended methods of trade, industry and governmental agencies.\n\n\n\nThe safety of our employees, neighbors and the environment are very important.  While the design of the facility incorporates a multitude of safety devices, Standard Operating Procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.  Some safety devices utilized are:\n\n    Suction trap hi-level floats\n\n    High discharge pressure shut down\n\n    Low suction pressure shut down\n\n    High discharge temperature shut down\n\n    Oil pressure failure shut down\n\n    250 psi relief valves on high pressure side (to prevent overpressure situations)\n\n    High amperes shut down\n\n    Automatic timer to prevent short cycling\n\n  "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000085823,
      "SummaryText": "  Oil filters plugged shut down\n\n\n\nWe have a written Process Safety Management (PSM) plan that complies with the regulations stipulated by WAC 296-67-017, including an Emergency Action Plan, developed in compliance with the Emergency Response provisions of WAC 296-62-3112.  The Emergency Action Plan includes pre-emergency planning and coordination with local emergency responders.  It is the policy of Wyckoff Farms not to respond to large releases of ammonia.  Therefore, employees will be trained on evacuation procedures at least once every year.  The responding fire or hazmat team will take control of the situation upon their arrival.  Other preventative steps are found in our Process Hazard Assessment, Hazard Analysis, Pre-Startup Safety Review, Mechanical Integrity, Management of Change, Hot Work Permits Procedure and Compliance Audits.\n\n\n\nAccess to the facility is restricted to authorized employees, management personnel and contractors.  All visitors and contractors are required to sign in and wear a guest badge while on premises.  Contractors are required to provide evidence of experience and training in ammonia safety before working around the system.  This training uses guidelines developed by the International Institute of Ammonia Refrigeration (IIAR) and the Refrigeration Engineers Technology Association (RETA).  Only qualified maintenance personnel operate and interact with the refrigeration system.  This minimizes the chances of inadvertent error in operation that could lead to a release of ammonia.  All system components were designed with specifications approved by ANSI/IIAR.  All pressure vessels and oil separator overpressure protection were built according to American Society of Mechanical Engineers (ASME) Boiler and Pressure Vessel Code.  PRVs are in accordance with ASHRA 15 Safety Code.  There are no incompatible materials of construction, and only iron and steel piping, fittings and valves are used.  Ammonia piping conforms to ASNE B31.5.  The engi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000085823,
      "SummaryText": "ne rooms fully meet the requirements under NEC to be classified as non-hazardous.\n\n\n\nThere has been no significant release of ammonia or any event at this facility since it's completion in 2012.\n\n\n\n "
    }
  ]
}