{
  "FacilityID": 1000041638,
  "FacilityName": "Lucite International",
  "FacilityStr1": "2665 Fite Road",
  "FacilityStr2": null,
  "FacilityCity": "Memphis",
  "FacilityState": "TN",
  "FacilityZipCode": "38127",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47157",
  "LEPC": "Shelby County LEPC",
  "FacilityLatDecDegs": "35.270833",
  "FacilityLongDecDegs": "-089.976944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I7",
  "LatLongDescription": "NW",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6266563,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lucite International",
  "OperatorStr1": "7275 Goodlett Farms",
  "OperatorStr2": null,
  "OperatorCity": "Cordova",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38018",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tom Eubank",
  "RMPTitle": "Environmental Manager",
  "FTE": 175,
  "OtherEPAFacilityID": "TND 98-778-9583",
  "EPAFacilityID": "100000100231",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "00475-01TV",
  "SafetyInspectionDate": "2009-11-05 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.27327,
  "FRS_Long": -89.9827,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051290,
      "AltID": "Acetone Cyanohydrin",
      "FacilityID": 1000041638,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000051799,
          "ProcessID": 1000051290,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062224,
          "ProcessID": 1000051290,
          "ChemicalID": 113,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 113,
            "ChemicalName": "Trimethylamine [Methanamine, N,N-dimethyl-]",
            "CASNumber": "75-50-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562224,
          "ProcessID": 1000051290,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000051291,
      "AltID": "Spent Acid Regeneratioin",
      "FacilityID": 1000041638,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000052965,
          "ProcessID": 1000051291,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062225,
          "ProcessID": 1000051291,
          "ChemicalID": 69,
          "Quantity": 3000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 69,
            "ChemicalName": "Oleum (Fuming Sulfuric acid)  [Sulfuric acid, mixture with sulfur trioxide]",
            "CASNumber": "8014-95-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562225,
          "ProcessID": 1000051291,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041638,
      "SummaryText": "OVERALL RESPONSIBILITY\n\n\n\nOur Site Manager has the overall responsibility for ensuring that our facility operates in a safe and reliable manner. This responsibility includes overseeing the implementation of the elements of our risk management program. To ensure that our risk management program is appropriately developed and implemented, our Site Manager has assigned the role of PSM/RMP Coordinator to a staff member with the necessary background, training, and experience. The PSM/RMP Coordinator, acting with the authority delegated directly from the Site Manager, has the responsibility for the development, implementation, and integration of the EPA RMP elements and the elements of OSHA's PSM program (where applicable) as required under Section 68.15 of the RMP rule.\n\n\n\nThe PSM/RMP Coordinator oversees the implementation of the PSM, and the risk management program. This is done by giving responsibilities to select employees to develop and manage specific elements of our risk management and process safety management programs. The members of this group are assigned by the Site Manager based on recommendations from the PSM/RMP Coordinator, the Environmental Engineer, and the site Safety Manager. Currently, the members of the PSM/RMP group include the following:\n\n\n\nRMP members\n\n?    PSM/RMP Coordinator - Nichole Bradford\n\n?    Environmental Manager - Tom Eubank\n\n?    Site Safety Manager - Floyd Billings\n\n\n\nProcess Safety Management \"Element Champions.\"\n\n\n\n?    Employee Participation Plan - Tom Eubank, Environmental Manager and North  \n\n        American SHE Director\n\n?    Process Safety Information - Dan Janke, Technical Manager\n\n?    Process Hazard Analysis - Dennis Foeller, MMA Area Manager, PSM Coordinator\n\n?    Operating Procedures and Safe Practices - Doug Whitehead, Training Supervisor, PSM/RMP Coordinator\n\n?    Training and Performance - James Moody, Training Supervisor, PSM/RMP Coordinator\n\n?    Contractor Safety - John Wilkins, Contractor Specialist\n\n?    Pre-Startup Safety Review  - Dennis Fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041638,
      "SummaryText": "eller, Training Supervisor, PSM/RMP Coordinator\n\n?    Mechanical Integrity/Quality Assurance - Don Jenks, Site Maintenance Manager\n\n?    Hot Work - Rex Kerby, Maintenance Supervisor\n\n?    Management of Change - Dennis Foeller, MMA Area Manager, PSM/RMP Coordinator, Steve Jones, Sheeting Area Manager\n\n?    Incident Investigation - Dennis Foeller, MMA Area Manager\n\n?    Emergency Planning and Response - Floyd Billings, Site Safety Manager, Doug Whitehead, Training Supervisor\n\n?    Auditing - Dennis Foeller/Doug Whitehead, Training Supervisor, PSM/RMP/Training Coordinator\n\n?    Trade Secrets - Dennis Foeller, MMA Area Manager\n\n\n\nThe following sections identify the responsibilities for each aspect of our risk management and process safety management programs.\n\n\n\nHAZARD ASSESSMENTS\n\n\n\nThe PSM/RMP Coordinator has the responsibility for (1) ensuring that offsite consequence analysis for each regulated process are consistently performed and documented in accordance with Sections 68.20 through 68.39 and (2) selecting the scenarios that will be reported in the facility RMPlan as required under Section 68.165. The PSM/RMP Coordinator also is responsible for ensuring that the accident history for each covered process is appropriately documented and maintained in accordance with Section 68.42 and 68.168 of the RMP rule.\n\n\n\nPREVENTION PROGRAMS\n\n\n\nThe PSM/RMP Coordinator has the responsibility for ensuring that the facility has an integrated, effective, and compliant prevention program that meets EPA RMP (Sections 68.65 through 68.87 of the RMP rule) and OSHA PSM requirements. Although the PSM/RMP Manager has some specific individual responsibilities, many of the responsibilities for specific program elements are assigned to other members of the PSM element champion list (as listed in the following sections).\n\n\n\nPROCESS SAFETY INFORMATION\n\n\n\nThe responsibility for process safety information (PSI) (Section 68.65 of the RMP rule) is held by the Technical Manager, Dan Janke.  The information is gathered "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041638,
      "SummaryText": "from process engineers close to the operations.  Mr. Janke is a member of the Process Hazard Review Team and manages the process engineers in the operating areas.\n\n \n\nPROCESS HAZARD ANALYSIS\n\n\n\nIn accordance with Section 68.67 of the RMP rule, the Site Manager has ultimate responsibility for ensuring that process hazard analysis (PHAs) are scheduled, conducted, and documented by trained personnel for all regulated processes. The Plant Managers (MMA & Sheeting) identifies the candidate PHA team leaders from within the facility and ensures that they receive appropriate training before leading PHAs. Outside contractors may also be used to lead PHAs when appropriate. The Hazard Study Leader is responsible for (1) ensuring that the information and personnel necessary to conduct PHAs are available according to the PHA implementation schedule and (2) resolving recommendations that are assigned to their respective areas, Corrective Actions Recordkeeping System (CARS).\n\n\n\nOPERATING PROCEDURES\n\n\n\nIn accordance with Section 68.69 of the RMP rule, the site PSM/RMP/Training Coordinator has the responsibility for ensuring that complete and accurate operating procedures are in place for all regulated processes. The Training Supervisor works closely with the Site SHE Manager, and the Maintenance Manager to develop and maintain the facility's safe work practices for both operations and maintenance.\n\n\n\nTRAINING\n\n\n\nIn accordance with Section 68.71 of the RMP rule, the PSM/RMP/Training Supervisor has the responsibility for (1) ensuring that operations employees receive and understand training applicable to their specific jobs and the associated processes and (2) ensuring that all facility employees receive and understand training in a safe work practices applicable to their jobs and (3) documenting the training. (The Maintenance Manager addresses training for maintenance workers under the mechanical integrity program.)\n\n\n\nMECHANICAL INTEGRITY\n\n\n\nIn accordance with Section 68.73 of the "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041638,
      "SummaryText": "RMP rule, the Maintenance Manager has the responsibility for the overall mechanical integrity program, with specific emphasis on written procedures, maintenance specific training, the equipment and instrumentation inspection/test program and documentation, and equipment deficiency resolution. Project Engineering, Maintenance Manager, and the Purchasing work with to define and maintain appropriate quality assurance procedures for all types of equipment acquisitions/installations/repairs.\n\n\n\nMANAGEMENT OF CHANGE\n\n\n\nIn accordance with Section 68.75 of the RMP rule, the PSM Coordinator and PSM/RMP/Training Supervisor has the responsibility for the overall management of change (MOC) program; however, the Production Manager, the Maintenance Manager, the Project Engineer, and the Purchasing each have responsibility for ensuring that the overall MOC program is effectively implemented in their areas.\n\n\n\nPRE-STARTUP REVIEW\n\n\n\nIn accordance with Section 68.77 of the RMP rule, the PSM Coordinator and the PSM/RMP/Training Supervisor has the responsibility for the overall pre-startup review program, which is closely related to the MOC program. However, the Site Manager has the primary responsibility for ensuring that this program is effectively implemented before affected operations begin.\n\n\n\nCOMPLIANCE AUDIT\n\n\n\nIn accordance with Section 68.79 of the RMP rule, the PSM Coordinator has the responsibility for ensuring that compliance audits regularly occur (and are documented) to verify that the prevention program is working and meets EPA/OSHA requirements. Each Element Champion of PSM has responsibility for resolving and identified deficiency in their area.  Additional support is received from the PSM Committee that meets on a monthly basis to discuss PSM Topics and Programs.\n\n\n\nINCIDENT INVESTIGATION\n\n\n\nIn accordance with Section 68.83 of the RMP rule, the Site Environmental/North American Lucite Safety Manager has the responsibility for designing and managing the incident invest"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000041638,
      "SummaryText": "igation program, including tracking resolution of investigation findings and recommendations. Part of this responsibility is ensuring that only trained personnel lead our investigations. The Production Manager and Maintenance Manager each have responsibility for ensuring that all incidents in their areas are reported and investigated, and the investigations findings are resolved, documented, and communicated to affected personnel.\n\n\n\nEMPLOYEE PARTICIPATION\n\n\n\nIn accordance with Section 68.83 of the RMP rule, the Site Environmental/North American Lucite Safety Manager, working with the site SHE Manager, and the PSM/RMP/Training Coordinator, has the responsibility of involving employees in the planning and implementation of the facility's prevention program elements.\n\n\n\nHOT WORK PERMITS\n\n\n\nIn accordance with Section 68.85 of the RMP rule, the Maintenance Supervisor, working closely with the Production Manager, Maintenance Manager, and the SHE Manager, has the responsibility of developing and maintaining the facility's hot work permit program.\n\n\n\nCONTRACTORS\n\n\n\nIn accordance with Section 68.87 of the RMP rule, the Contractor Specialist has the overall responsibility for the contractor program; however, the Maintenance Manager, and the Production Manager, are responsible for ensuring that the requirements of the program are implemented in their areas of responsibility.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nIn accordance with Sections 68.90 and 68.95 of the RMP rule, the SHE Manager is responsible for (1) designing, implementing, and maintaining the facility's emergency response plan, (2) ensuring that all associated training is conducted and documented as necessary, (3) coordinating the site emergency response plan with the community emergency response plan, and (4) responding to local emergency planners/responders when questions arise.\n\n\n\nRMPLAN PREPARATION AND SUBMISSION\n\n\n\nThe PSM/RMP Coordinator is responsible for preparing and submitting the RMPlan for the facility (aft"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000041638,
      "SummaryText": "er review and approval by the Site SHE Manager and the Environmental Manager) as required under Sections 68.150 through 68.185 of the RMP rule.\n\n\n\nRMPLAN COMMUNICATION\n\n\n\nThe PSM/RMP Coordinator and the Environmental Manager has the responsibility of providing RMPlan information (other than the required EPA submission) to employees and the public as required under Section 68.210 of the RMP rule.  \n\n\n\n\n\n\n\n"
    }
  ]
}