{
  "FacilityID": 1000040722,
  "FacilityName": "CITGO Petroleum Corporation - Louisville Terminal",
  "FacilityStr1": "4724 Campground Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40216",
  "Facility4DigitZipExt": "4612",
  "FacilityCountyFIPS": "21111",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "38.206667",
  "FacilityLongDecDegs": "-085.850833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "AO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.CITGO.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 175743087,
  "ParentCompanyName": "CITGO Petroleum Corporation",
  "Company2Name": null,
  "CompanyDUNS": 102417268,
  "Company2DUNS": 0,
  "OperatorName": "CITGO Petroleum Corporation",
  "OperatorStr1": "P.O. Box 4689",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4689",
  "RMPContact": "Mr. Bill Lindsey",
  "RMPTitle": "Assistant Terminal Manager",
  "FTE": 2,
  "OtherEPAFacilityID": "Plant ID 0225",
  "EPAFacilityID": "100000077043",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-11-05 00:00:00",
  "SafetyInspectionBy": "Local environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-07-23 00:00:00",
  "DeRegistrationEffectiveDate": "2021-07-15 00:00:00",
  "AnniversaryDate": "2019-04-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10",
  "FRS_Lat": 38.20611,
  "FRS_Long": -85.85,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000050170,
      "AltID": "Chloroform Loading",
      "FacilityID": 1000040722,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000050632,
          "ProcessID": 1000050170,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000060695,
          "ProcessID": 1000050170,
          "ChemicalID": 4,
          "Quantity": 13538968.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 4,
            "ChemicalName": "Chloroform  [Methane, trichloro-]",
            "CASNumber": "67-66-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000560695,
          "ProcessID": 1000050170,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000040722,
      "SummaryText": "CITGO Petroleum Corporation - Louisville, Kentucky Terminal\n\n\n\nThis Risk Management Plan (RMP) has been developed and reviewed in accordance with the requirements found in Title 40 of the Code of Federal Regulations (CFR) Part 68 and the Lousiville Metro Air Pollution District Regulation 5.15.  The purpose of the plan is to review the storage and handling of chloroform at the facility in order to ensure that safe and compliant procedures and programs are in place and that effective precautions are taken to prevent an accidental release of chloroform that could affect CITGO personnel, the public, or the environment.   This revised and updated plan is being submitted on April 16, 2014, which is within five years of the last updated plan.\n\n\n\nThe CITGO Louisville Terminal meets the requirements for a Program Level 2 facility.  Therefore, the revised plan includes a review and update of the off-site consequence analysis (OCA) for both the worst-case and alternate case scenarios, the site prevention programs (safety information, hazard review, training, maintenance, compliance audits, incident investigation procedures, and operating procedures), and the site emergency response procedures.  A worst case flammable scenario is not applicable because the site does not store any of the listed flammable chemicals above the program thresholds.\n\n\n\nFACILITY DESCRIPTION AND OPERATIONS (SOURCE AND REGULATED SUBSTANCE)\n\n\n\nCITGO Petroleum Corporation owns and operates the Louisville Terminal, a bulk petroleum terminal located on the far west side of Louisville near the Ohio River.  The facility's primary operation is to receive gasoline and other fuels by barge and pipeline, transfer them into bulk storage tanks, and then fill over-the-road tanker trucks through use of a loading rack.  The facility operates 24/7 and has two full-time employees.\n\n\n\nChloroform is also delivered to the Louisville Terminal by barge.  The chloroform is transferred from the supply barge via pipeline to thre"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000040722,
      "SummaryText": "e above-ground storage tanks (tank numbers 9, 10 and 11).  These tanks temporarily store the chloroform until it is piped off-site to the nearby DuPont Chemical facility.  The chloroform is received by CITGO and delievered to DuPont in accordance with a signed contract between the two companies.\n\n\n\nChloroform is a regulated hazardous substance as defined and listed in 40 CFR 68 with a storage threshold of 20,000 pounds.   The three chloroform storage tanks have working capacities of 340, 956 gallons (Tank 9), 374,514 gallons (Tank 10), and 374,010 gallons (Tank 11) for a total capacity of 1,089,480 gallons and an on-site maximum storage of 13,538,968 pounds.\n\n\n\nRELEASE PREVENTION PROGRAM OVERVIEW\n\n\n\nCITGO has historically taken many precautions and actions to prevent the release of hazardous materials from its operations.  These include: (1) careful design and use of appropriate standards for tank and piping systems; (2) design and use of appropriate secondary containment for all storage tanks; (3) high level alarms, overfill alarms, chloroform detectors, and remote motor operated shutoff valves; (4) the development of safe operating procedures for loading chloroform tanks and transferring chloroform off-site to the end user; (5) classroom and on-the-job training designed to prepare personnel for safe operation and emergency response situations; (6) preventive maintenance programs which include periodic inspections and integrity testing of storage tanks and associated equipment; (7) complete perimeter fencing to prevent vandalism and unauthorized entry or use of equipment; and (8) a careful review and process hazard assessment that was conducted in preparation for the updating of the site's RMP.  Specific details about these preventive measures are identified and discussed in separate sections of the RMP.   The site relies on a combination of technological systems (equipment, process design, and control) and management systems (safe operating procedures, maintenance"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000040722,
      "SummaryText": ", and training) to protect CITGO's employees and the community at large from an accidental release.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nAt the heart of CITGO's commitment to preventing accidental releases is the site's Integrated Contingency Plan (ICP) that details the actions that CITGO on-site personnel will take in the event of an emergency, as well as those taken company wide.  The ICP addresses full compliance with the prevention activities and emergency response procedures from all applicable regulations (i.e., certain applicable sections of the Resource Recovery and Conservation Act (RCRA),  EPA's Oil Pollution Prevention Regulations found in 40 CFR 112, United States Coast Guard (USCG) Facility Response Plan (33 CFR Part 154), Department of Transportation/Research and Special Programs Administration (DOT/RSPA) Facility Response Plan (49 CFR Part 194), Occupational Safety and Health Administration (OSHA) Emergency Action Plans (29 CFR 1910.138(a), and OSHA Hazardous Waste Operations and Emergency Response (HAZWOPER) regulations found in 29 CFR 1910.120.  \n\n\n\nThe ICP is coordinated with local emergency management agencies in Louisville.  All terminal employees are trained to the OSHA \"Hazardous Material Technician\" level, and the Terminal Manager has received Incident Command training.  In the event of a major spill or release, all terminal employees are trained to exercise proper \"Site Control\" measures and assist in making emergency notifications to local, state, federal, and corporate emergency contacts.  These emergency notifications include: (1) Terminal Manager; (2) State and Local Emergency Response Agencies; (3) Primary Response Contractor (if needed); (4) CITGO Corporate Hotline; (5) EPA's National Response Center (NRC); and (6) CITGO's Regional Environmental and Safety Manager.  Notification of these people and/or groups simultaneously starts a series of response actions.  The notification process is critical in responding to a spill or release.  To ens"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000040722,
      "SummaryText": "ure that the situation is being handled in the most efficient and direct manner, CITGO's Crisis Resource Center (CRC) will make any and all notifications as requested by the site Incident Commander.\n\n\n\nCITGO's corporate organizational infrastructure to manage response actions is fully defined in CITGO's Crisis Management Plan (CMP).  The CMP explains CITGO's Incident Command System and details how it adopts the fundamental principles of the National Inter-Agency Management System (NIMS).  CITGO has designated the following personnel to activate, implement, and assess the response actions to an incident.  This command structure ensures the most efficient response to an incident.\n\n\n\nThe Incident Commander is responsible for conducting an initial assessment of the incident and taking all steps necessary to ensure the safety of the personnel, property, public, and environment.\n\n\n\nThe Logistics Section Chief is responsible for managing personnel, equipment, and supplies required to respond to the incident.  All secondary notifications both internal and external are the sole responsibility of the Logistics Section Chief.\n\n\n\nThe Planning Section Chief is responsible for the gathering and analysis of all data regarding the incident operations and assigned resources, developing alternatives for tactical operations, conducting the planning meetings, and preparing the action plan for each operational period.  The Planning Section Chief shall coordinate with any additional response groups or organizations during the incident response and is responsible for supervising the activities of the situation, resources, documentation, demobilization units, and the technical specialists.\n\n\n\nThe Finance Section Chief is responsible for all financial and cost analysis aspects of the incident and for supervising members of the finance section.  \n\n\n\nThe Operations Section Chief is responsible for supervising the development of the tactical response plans, the deployment of response equipment"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000040722,
      "SummaryText": ", and the operation of all response equipment.  The Operations Section Chief shall coordinate with any additional response groups or organizations during the activities of the Shoreside or Marine Recovery Groups.\n\n\n\nThe Marine Operations Supervisor is responsible for deploying containment booms, product recovery operations, and/or waste storage devices as directed by the Operations Section Chief.\n\n\n\nThe Shoreside Supervisor is responsible for carrying out shoreside activities pertaining to containment.\n\n\n\nIn preparing the ICP for the Louisville Terminal, CITGO identified some common response scenarios that could occur on-site.  CITGO understands the benefit of being prepared and its personnel are trained to handle the following scenarios is a step-by-step response action: tank overfill; tank failure; piping rupture; piping leak; explosion and/or fire; equipment failure; and operational errors.\n\n\n\nIn the event that a spill incident did occur at the Louisville Terminal, CITGO's ICP and Emergency Response Procedures should be implemented and coordinated with the local emergency responders and the Louisville Metro Air Pollution Control District.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThe CITGO Louisville Terminal is proud to report that there have been no accidental releases of chloroform in the past five years.  There has not been an accidental release of chloroform at this facility since it has been operated by CITGO."
    }
  ]
}