{
  "FacilityID": 1000020517,
  "FacilityName": "Arlington Agronomy",
  "FacilityStr1": "18491 CR 182",
  "FacilityStr2": null,
  "FacilityCity": "Arlington",
  "FacilityState": "OH",
  "FacilityZipCode": "45814",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39063",
  "LEPC": "Hancock County LEPC",
  "FacilityLatDecDegs": "40.899444",
  "FacilityLongDecDegs": "-083.613611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.bvfcoop.com",
  "FacilityEmailAddress": "jbormuth@bvfcoop.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Blanchard Valley Farmers Cooperative, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 18023770,
  "Company2DUNS": 0,
  "OperatorName": "Blanchard Valley Farmers Co-op",
  "OperatorStr1": "18491 CR 182",
  "OperatorStr2": null,
  "OperatorCity": "Arlington",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45814",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joe Hochstettler",
  "RMPTitle": "Risk Coordinator",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000069784",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-07-13 00:00:00",
  "SafetyInspectionBy": "Ohio Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-02-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-02-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-02-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-02-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.86104,
  "FRS_Long": -83.68842,
  "FRS_Description": "OTHER",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025005,
      "AltID": "Ammonia Storage",
      "FacilityID": 1000020517,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000025367,
          "ProcessID": 1000025005,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000029769,
          "ProcessID": 1000025005,
          "ChemicalID": 56,
          "Quantity": 545000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000529769,
          "ProcessID": 1000025005,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000020517,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies:\n    Arlington Agronomy complies with the 1989 ANSI K 61.1 A?Safety Requirements for the Storage and Handling of Anhydrous AmmoniaA?.  In addition, it is our policy to adhere to all applicable federal, state and local laws.\n    Blanchard Valley Farmers Co-opA?s A?Safety and Health PolicyA? states, A?The personal safety and health of each employee A? is of primary importance.A?  In keeping with this policy we have an active Safety Committee that assists the full-time Risk Coordinator in administering all environmental, health and safety, and transportation programs in the company.\n    Employees (including supervisors) are required to undergo annual training in the safe handling of hazardous materials, especially employees who are involved with the handling of anhydrous ammonia.\n    The branch manager of Arlington Agronomy is held accountable for implementing proper procedures for handling hazardous materials.  He insures that employees are provided with personal protective equipment and training for handling these materials.  He also makes an effort to have the local fire department, along with the county Emergency Management Agency director, conduct a walk-through of the facility every year.  This is a means of gaining familiarity with our facility by our emergency responders.  Recommendations from the fire chief and the director are acted on in a timely manner.\n    The General Manager has assigned A?SafetyA? as a portion of his annual evaluation of branch managers.  Regulatory compliance is a large part of that safety evaluation and has an impact on salary and advancement.\n    The Board of Directors has established a portion of their annual planning meeting to safety and invites the Risk Coordinator to update them on the various issues related to safety.  Among those issues are timely and properly implemented responses to accidental releases and how they can be improved upon.\n\nA General Description of the Facility and the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000020517,
      "SummaryText": " Regulated Substances Handled\n    Arlington Agronomy is a retail farm supply business that deals with supplying dry and liquid fertilizers, herbicides, insecticides and seed to area grain farmers along with custom application and agronomic advice.  Among the products handled, is one Extremely Hazardous Substance (EHS) A? anhydrous ammonia.  Anhydrous ammonia is the most economical source of nitrogen fertilizer available.  In order to serve the customerA?s need for this product, Arlington Agronomy has storage vessels capable of holding more than 100,000 gallons of product.\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n    The anhydrous ammonia system is designed, installed and maintained in accordance with ASME codes.  Arlington Agronomy complies with the ANSI K 61.1 standards (1989), OSHA (29 CFR 1910.111), EPAA?s Accidental Release Prevention Rule, and all applicable federal, state and local codes and regulations.\n    The system is protected from major releases by internal excess flow valves, check valves, relief valves, manual shutoffs, and emergency shutoff valves.  The load out risers used for the purpose of filling the nurse tanks are protected by excess flow valves and fill line breakaways to immediately stop the flow of ammonia if a line or a hose fails.  All main storage tank valves and riser valves are locked when not in use.\n    Our ammonia system is inspected on a regular basis with maintenance and preventive maintenance scheduled and documented.  Liquid and vapor valves, hoses, excess flow valves, gauges and pressure relief valves are replaced when necessary and according to the guidelines in the ANSI standards and enforced by the Ohio Department of Agriculture.\n    Training is provided to all employees at least annually, whenever there is a change in the process, or whenever competency with the regulations is questioned.  The training consists of classroom lecture, current videos, Powerpoint presentations, testing (oral and written), ce"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000020517,
      "SummaryText": "rtification of completion and on-the-job training.  Supervisors are instructed to verify competency through observation of employees handling of the product. \n\nFive-year Accident History\nThere have been no accidents involving anhydrous ammonia that caused death, injuries, property or environmental damage, including evacuations on or off-site.\n\nEmergency Response Program\n    In the event of an emergency involving our ammonia system, it is our policy to notify the local fire department and request that they respond to the emergency.  In preparation for this, we have coordinated with all of the local response agencies by providing information and facility tours to ensure that they are familiar with and properly prepared for an incident at our facility.  This will help to make certain that our community has the strategy for responding to and mitigating the threat posed by an ammonia release.  This complies with the requirement for our facility to be included in the community emergency response plan prepared under EPCRA and coordinated with the Hancock County Local Emergency Planning Committee.\n\nPlanned Changes to Improve Safety\nThere are plans to make any changes to the physical site.  Arlington Agronomy will continue to provide our employees with ongoing annual training, to make sure that they are current with safe ammonia transfer and handling procedures.  We will also provide regular inspection and maintenance on all of the ammonia equipment"
    }
  ]
}