{
  "FacilityID": 1000023446,
  "FacilityName": "Cargill, Inc.",
  "FacilityStr1": "1710 16th St., S.E.",
  "FacilityStr2": "N/A",
  "FacilityCity": "Cedar Rapids",
  "FacilityState": "IA",
  "FacilityZipCode": "52401",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19113",
  "LEPC": "Linn County LEPC",
  "FacilityLatDecDegs": "41.970278",
  "FacilityLongDecDegs": "-091.644444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 94783594,
  "ParentCompanyName": "Cargill, Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 6249189,
  "Company2DUNS": null,
  "OperatorName": "Christina Marie Venne",
  "OperatorStr1": "1710 16th St., S.E.",
  "OperatorStr2": "PO Box 1467",
  "OperatorCity": "Cedar Rapids",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52401",
  "OperatorZipCodeExt": "1467",
  "FTE": 244,
  "OtherEPAFacilityID": "IAD 098 026545",
  "EPAFacilityID": "100000127267",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "07-TV-006-M001",
  "SafetyInspectionDate": "2006-04-03 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-12-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-12-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-12-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-12-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 41.97089,
  "FRS_Long": -91.64764,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000028634,
      "AltID": "Propylene Oxide",
      "FacilityID": 1000023446,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034239,
          "ProcessID": 1000028634,
          "ChemicalID": 12,
          "Quantity": 65265.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000028915,
          "ProcessID": 1000028634,
          "NAICSCode": "311221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000024720,
              "Process_NAICS_ID": 1000028915,
              "SafetyReviewDate": "2010-12-13 00:00:00",
              "PHA_Date": "2010-11-24 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-05-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Underground storage, Diversion to reactor vessel",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Underground storage, Diversion to reactor vessel",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-10-27 00:00:00",
              "TrainingReviewDate": "2011-01-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-03-01 00:00:00",
              "EquipmentInspectionDate": "2011-10-24 00:00:00",
              "EquipmentTested": "PO stripper 2 fan",
              "ChangeMgmtDate": "2011-09-13 00:00:00",
              "ChangeMgmtReviewDate": "2011-10-17 00:00:00",
              "PreStartupReviewDate": "2010-09-01 00:00:00",
              "ComplianceAuditDate": "2009-08-27 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2011-10-21 00:00:00",
              "InvestigationChangeDate": "2011-12-23 00:00:00",
              "ParticipationPlansReviewDate": "2009-10-01 00:00:00",
              "HotWorkPermitReviewDate": "2010-06-24 00:00:00",
              "ContractorSafetyReviewDate": "2011-03-23 00:00:00",
              "ContractorSafetyEvalDate": "2010-09-29 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000029346,
                  "PreventionProgram3ID": 1000024720,
                  "ProcessChemicalID": 1000034239
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000023446,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-11-04 00:00:00",
    "ERTrainingDate": "2011-04-01 00:00:00",
    "CoordinatingAgencyName": "Cedar Rapids Fire Department",
    "CoordinatingAgencyPhone": "3192865200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023446,
      "SummaryText": "Cargill Inc. owns and operates a wet corn milling facility in Cedar Rapids, Iowa which is subject to U.S. EPA\r\nregulations governing Accidental Release Prevention Requirements: Risk Management Programs under\r\nSection 112(r) of the Clean Air Act (40 CFR Part 68). The December 2011 Risk Management Plan (RMP)\r\nupdate was developed in accordance with the requirements specified under 40 CFR Part 68. The plan\r\ncertified that Cargill Corn Milling Division has instituted a RMP at the Cedar Rapids, Iowa facility.\r\n\r\nThe only covered process and regulated substance on-site is Propylene Oxide (PO) which is stored in an\r\nunderground storage tank. Only the accidental release of PO is included in this December 2011 update\r\nto the RMP. Because the PO is contained in a underground storage tank the worst case analysis was\r\nconducted by analyzing a release from a filling line connected to the PO tank rather than the entire contents\r\nof the tank being released.\r\n\r\nCargill's policy is to conduct all business activities in a manner that protects the environment and the health\r\nand safety of our employees, contractors, customers and the public.\r\n\r\nEnvironment. Cargill will comply with all applicable environmental requirements, prevent pollution, and\r\ncontinually improve performance on criteria relevant to its businesses and operations.\r\n\r\nHealth and Safety. Cargill will comply with all applicable occupational health and safety, process safety,\r\nand product safety requirements, continually improve performance on criteria relevant to its businesses\r\nand operations, and insist that all work, however urgent, be done safely.\r\n\r\nFood and Product Safety. Cargill is committed to providing safe food and animal feed products and\r\nservices. We will use only those product development, procurement, supply chain, transportation, storage\r\nproduction, manufacturing, and distribution systems and suppliers that ensure the safety and regulatory\r\ncompliance of our products. We will communicate relevant food"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023446,
      "SummaryText": "safety matters both internally and\r\nexternally. We will adhere to the food safety requirements we have mutually agreed to with our customers.\r\nEvery Cargill Business Unit, Function, and employee has a responsibility to ensure the production of safe\r\nproducts that comply with the applicable laws, regulations and Corporate Food Safety and Regulatory\r\nAffairs requirements. Cargill management will provide the resources and support necessary to enable our\r\nemployees to fulfill this responsibility and continually improve our programs and processes.\r\n\r\nThe Cargill Foods Corn Milling Division facility in Cedar Rapids is designed, maintained and operated so as to\r\nminimize adverse impacts to its employees, local communities and the environment. Plant management\r\nmakes information available to the local community regarding the hazards and risks in operating the facilities\r\nand the prevention techniques in place. This includes insuring that all regulatory requirements are met.\r\n\r\nPlant management is fully informed as to the materials that are stored or used on-site and aware of the\r\npossible risk associated with their handling, storage, use, disposal or accidental release. Material Safety Data\r\nSheets (MSDS) for all materials utilized at the facility are maintained on-site. The facility maintains inspection\r\nrecords and up-to-date procedures to insure the proper control of hazardous materials. Procedures and\r\nsystems are devised which include provisions for the periodic testing, review, and update of the emergency\r\nresponse programs.\r\n\r\nEmployees are trained and periodically retrained in the methods of detection of hazardous material releases,\r\nthe potential physical and health risks associated with the materials, and methods for protecting themselves,\r\nco-workers, and the public. The facility investigates, corrects, and reports in writing all incidents involving\r\nhazardous materials having caused, or having the potential for causing, injury or loss.\r\n\r\nThe processes subject"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023446,
      "SummaryText": "to the risk management regulations are also subject to Occupational Safety and Health\r\nAdministration (OSHA) Process Safety Management Standard (PSM). Cargill has a PSM program utilized for\r\nthe prevention of accidental chemical releases of propylene oxide at the Cedar Rapids Corn Milling facility that\r\nincludes the following elements: Employee Training and Participation, Process Safety, Information, Process\r\nHazards Analysis, Operating Procedures, Training, Contractors, Pre-Startup Safety Review, Mechanical\r\nIntegrity, Hot Work Permit, Management of Change, Incident Investigation, Emergency Planning and Response\r\nand Compliance Audits. Cargill Cedar Rapids Corn Milling facility's safety program incorporates continuous\r\nimprovement through use of on-going evaluations of safety and programs.\r\n\r\nIn conjunction with the current RMP and PSM programs in place at the Cedar Rapids Corn Milling facility,\r\nthere is a standard management practice that requires internal reporting of unusual events, including those\r\nin which any abnormal emission of regulated chemicals is observed or suspected. The incident information is\r\nreviewed and a determination is made as to whether a reportable quantity on any chemical listed as\r\nrequiring reports to regulatory authorities is involved. If so, the appropriate authorities are notified.\r\n\r\nDuring the past 5 years (December 2006 to December 2011), there has been no accidents involving any RMP\r\nregulated substance that qualifies for reporting under 40 CFR Part 68. This means that no accident has\r\nresulted in reportable on-site injury, off-site injury, evacuations, sheltering in place, or damage to property or\r\nthe environment.\r\n\r\nCargill's Cedar Rapids Corn Milling facility has established an Emergency Action Plan to ensure appropriate\r\nsteps are taken to protect the public health and the environment, as well as the safety of the plant\r\nemployees. The EAP is designed to address foreseeable emergency situations at the facility and provide\r\nap"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000023446,
      "SummaryText": "propriate hazard and emergency preparedness information to employees, contractors, emergency\r\nresponse personnel, and the community. Emergency situations can include fire, explosion, chemical release\r\nor spill, bomb threats, weather emergencies and other natural emergencies. Cargill has developed\r\nprocedures to be followed in the event of an emergency and a command structure to evaluate an emergency\r\nto determine the appropriate action to be taken to remedy it. Cargill staff have a First Response capability\r\nand are able to administer basic first aid and CPR. Cargill will rely on the Cedar Rapids Fire Department, CRFD\r\nor Linn County HAZ-MAT team, and Area Ambulance/Paramedic Services for assistance as required to control\r\nand resolve emergencies.\r\n\r\nCargill's Cedar Rapids Corn Milling facility, under the RMP program, as well as its existing PSM and earlier\r\nSARA Title III Community Right-to-Know Act compliance programs has organized its management system to\r\neffectively address foreseeable hazards and potential risks. Both the advanced planning aspects of process\r\ndesign, operating procedures, and emergency preparedness, and the operational elements of system\r\nmaintenance, safe operating practices and ongoing personnel training are necessary to support a continual\r\nimprovement in facility safety. These programs are documented so that information about safe handling of\r\nchemicals at the facility is readily available to all employees and in the event questions arise from public\r\nofficials regarding potential risks to the community. All of these features of the RMP and the integrated risk\r\nmanagement program at the Cedar Rapids Corn Milling facility lead to operations that are safe today, but will\r\nbe even safer tomorrow."
    }
  ]
}