{
  "FacilityID": 1000025477,
  "FacilityName": "AGRX Santa Maria",
  "FacilityStr1": "609 So. Depot St.",
  "FacilityStr2": null,
  "FacilityCity": "Santa Maria",
  "FacilityState": "CA",
  "FacilityZipCode": "93458",
  "Facility4DigitZipExt": "5625",
  "FacilityCountyFIPS": "06083",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.946417",
  "FacilityLongDecDegs": "-120.443861",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "agrx.com",
  "FacilityEmailAddress": "johnnym@agrx.com",
  "FacilityDUNS": 145886409,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "NH3 Service Company of Santa Maria",
  "OperatorStr1": "P.O. Box 5577",
  "OperatorStr2": null,
  "OperatorCity": "Santa Maria",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93456",
  "OperatorZipCodeExt": "5577",
  "RMPContact": "Robert Hendricks",
  "RMPTitle": "Operations Manager",
  "FTE": 30,
  "OtherEPAFacilityID": "CAL000358955",
  "EPAFacilityID": "100000027464",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-09-29 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-12-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-12-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-12-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-02-11 00:00:00",
  "DeRegistrationEffectiveDate": "2014-01-21 00:00:00",
  "AnniversaryDate": "2016-12-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 34.9475,
  "FRS_Long": -120.44387,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "No longer manufacturing Ammonia above TQs or for any operation.",
  "_processes": [
    {
      "ProcessID": 1000031286,
      "AltID": "10-34 Reactor",
      "FacilityID": 1000025477,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000031587,
          "ProcessID": 1000031286,
          "NAICSCode": "115112",
          "_desc": {
            "NAICS_CODE": "115112",
            "NAICS_DESCRIPTION": "Soil Preparation, Planting, and Cultivating"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000037909,
          "ProcessID": 1000031286,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000537909,
          "ProcessID": 1000031286,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000025477,
      "SummaryText": "AGRX Santa Maria, is located in a very environmentally sensitive county.  Agriculture in general is very heavily regulated in the State of California.  Therefore our company is ruled and guided by numerous government organizations, namely the State and County Agricultural Commissions, the State Board of Underground Water Control, Air Quality, Country Hazardous Materials-Protection Services Division, and the Fire Department.  All These agencies inspect our facility and require training for our employees.\n\n In 1974 a 10-34-0 liquid fertilizer formulation facility was constructed.  The system consists of a 14,000-gallon anhydrous ammonia storage tank, tow heat exchangers, a pipe reactor, a 3,000 gallon mixing tank and other associated process piping and equipment.  The ammonia is combined with phosphoric acid and water in the pipe reactor to produce 10-34-0, a neutral fertilizer solution.  The 10-34-0 product is cycled through two heat exchangers and an air-cooling unit prior to being pumped to storage in eight vertical storage tanks at the site.  The storage tanks are in their own dike enclosed area. The ammonia is stored in a 14,000 gallon steel storage tank with appropriate safety valves to control overpressure in the tank.  There are excess flow valves to control leaks that could be caused by potential breaks in the piping. The system operates at pressures of 35 to 150 psig and temperatures of 50 to 600 F.\n\nBecause anhydrous is considered an extremely hazardous material the County of Santa Barbara Department of Environmental Health required the company to prepare a Risk Management Prevention Program (RMPP) in 1993.  A team of NH3 Service Company and Science & Engineering Analysis Corporation (SEACOR) personnel performed a hazard and operability study (HAZOP).  A HAZOP report containing recommended process improvements was submitted.  All the recommended improvements have been completed at this time.  In addition, an offsite consequence analysis was conducted and do"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000025477,
      "SummaryText": "cumented in a report which was submitted separately.  A seismic assessment was conducted on the ammonia tank, the foundation of the ammonia storage tank and the system control building.  All of these documents are presented in the RMPP.  The RMPP also contains auditing and inspection procedures, recordkeeping, the emergency response, and employee training.  \n\nThe county also requires a separate emergency response plan and chemical inventory.  In this document are the original facility and site maps, all chemical training programs, general safety rules, safety training, and recordkeeping; along with the facility evacuation plan, and shutdown procedures. Also included is the management system to oversee and implement the process with documentation in the 10-34-0 Audit and Inspection Book, and the chain of command is documented in our Hazardous Materials Emergency Response Plan.  All this information has been submitted to the local fire department, and is accessible to them in the firebox located on the front of the office.  Lastly AGRX Santa Maria has a written Injury and Illness Prevention Program governed by the State and implemented by the County.  To improve the safety of the process a T.V. camara has been installed to monitor the unloading of rail cars. \n\nAGRX Santa Maria, is very proud of its safety programs, and can report that there have been no accidents in the past ten years related to the 10-34-0 reactor.  This is due in large part to an excellent training program, ongoing modernization of the reactor and its safety controls and little employee turnover.\n\n"
    }
  ]
}