{
  "FacilityID": 1000066684,
  "FacilityName": "Gold Creek Foods LLC. - GC3, White Sulphur Rd.",
  "FacilityStr1": "2255 White Sulphur Rd",
  "FacilityStr2": null,
  "FacilityCity": "Gainesville",
  "FacilityState": "GA",
  "FacilityZipCode": "30501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13139",
  "LEPC": "Hall County LEPC",
  "FacilityLatDecDegs": "34.327500",
  "FacilityLongDecDegs": "-083.791389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "2255 White Sulphur Rd.",
  "FacilityEmailAddress": "cory.hirsch@goldcreekfoods.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Gold Creek Foods LLC.",
  "Company2Name": "Gold Creek Foods LLC.",
  "CompanyDUNS": 143349988,
  "Company2DUNS": 143349988,
  "OperatorName": "Gold Creek Foods LLC.",
  "OperatorStr1": "2255 White Sulphur Rd",
  "OperatorStr2": null,
  "OperatorCity": "Gainesivlle",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30501",
  "OperatorZipCodeExt": null,
  "RMPContact": "W. Daryl Butterworth",
  "RMPTitle": "E,H&S Director",
  "FTE": 524,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000109009",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-11-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-01-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-01-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-01-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.32693,
  "FRS_Long": -83.79134,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2.64",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "130",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000083604,
      "AltID": "Ammonia for refrigeration",
      "FacilityID": 1000066684,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000084806,
          "ProcessID": 1000083604,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000104272,
          "ProcessID": 1000083604,
          "ChemicalID": 56,
          "Quantity": 33573.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000604272,
          "ProcessID": 1000083604,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000066684,
      "SummaryText": "Gold Creek PSM - Executive Summary\n\nGold Creek Foods, LLC (\"Gold Creek\") is an industry leader in poultry processing and innovation. Gold Creek provides products for its customers ranging from sized chicken & MSC to fully cooked, ready to eat product.\n\nThis Executive Summary informs all interested parties that this facility is participating in the OSHA Process Safety Management (PSM) program defined in 29 CFR ? 1910.119 and the EPA Risk Management Program (RMP) defined in 40 CFR Part 68. These programs provide for the implementation of detailed prevention and response procedures when storing and handling hazardous chemicals. The program objectives are to ensure worker and public safety and to provide environmental protection.\n\nPursuant to the Risk Management Program (RMP) (40 CFR Part 68) and Process Safety Management (PSM) (29 CFR ? 1910.119) regulations, Gold Creek has developed a comprehensive RMP/PSM written program to protect our employees and the surrounding community from exposure to the hazardous chemicals onsite.  Anhydrous ammonia is the only substance at the facility that is regulated under the PSM and RMP programs. This is the same type of ammonia commonly sprayed on fields by farmers to fertilize crops. The ammonia at the facility is kept entirely within the refrigeration system, much as the refrigerant in your car air-conditioner.  Anhydrous ammonia is used as a refrigerant throughout the plant to maintain desired temperatures in coolers, freezers and working areas for the preservation of food products.  The system expels heat through altering the ammonia between a liquid and a gas state creating refrigeration in the facility.  This refrigeration system consists of a series of compressors, condensers, evaporators, vessels, piping and valves.\n\nAs part of the RMP requirements, Gold Creek undertook a review of the potential offsite consequences of the accidental release of the largest vessel in the systems.  The offsite consequences of analysis were deter"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000066684,
      "SummaryText": "mined utilizing RMP comp and the population data is based upon information pulled from MARPLOT on 09/21/2017.  How to determine the WCS & ACS was derived from the EPA Approved MARPLOT software & Gaussian Dispersion.  \n\nGold Creek's implementation of the RMP/PSM programs includes employee education in the hazards of ammonia and measures that can be used to reduce employee and community exposure to accidental releases of ammonia. The ammonia refrigeration system is operated with a variety of safety devices employed within the system, including high and low level automated shutdown systems and high and low pressure automated shutdown systems. Alarm systems are utilized to provide early detection of problems within the system before shutdowns occur.\n\nThis facility's emergency action plan is designed to ensure the safety of employees and surrounding community in the event of an incident associated with the ammonia refrigeration system. In the event a regulated hazardous substance is released from the facility in excess of a reportable quantity within a 24-hour period, the National Response Center (1-800-424-8802) (and, as necessary or as required by law, the Fire Department) will be notified in accordance with federal law so that they can provide assistance during an incident. If it is necessary to contact the public regarding an ammonia release, the local fire department will be contacted to coordinate with the police department. The police department will notify residents and business locations.\n\nThis facility has not had a reportable release in the past five years.  The facility utilizes Process Hazard Analysis, Compliance Audits, Pre-Startup Safety Reviews, Mechanical Integrity inspections, Preventative Maintenance activity, equipment inspections, management of change procedures and training to ensure mitigation and control of potential incidents.\n\nThe facility will make changes to the system and train as necessary to resolve items noted during the Process Hazard Ana"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000066684,
      "SummaryText": "lysis, Compliance Audit, Pre-Startup Safety Reviews, and Mechanical Integrity inspections to improve the safety of the system. Changes will be placed on an action list, evaluated, and implemented in a timely manner.\n\n"
    }
  ]
}