{
  "FacilityID": 1000043775,
  "FacilityName": "Lemoore Wastewater Treatment Plant",
  "FacilityStr1": "1145 S. 18 1/2 Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Lemoore",
  "FacilityState": "CA",
  "FacilityZipCode": "93245",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06031",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.280889",
  "FacilityLongDecDegs": "-119.794583",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lemoore.com",
  "FacilityEmailAddress": "publicworks@lemoore.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Lemoore",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Lemoore",
  "OperatorStr1": "711 Cinnamon Drive",
  "OperatorStr2": null,
  "OperatorCity": "Lemoore",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93245",
  "OperatorZipCodeExt": "9404",
  "RMPContact": "David Wlaschin",
  "RMPTitle": "Public Works Director",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000139263",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-09-18 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.2902,
  "FRS_Long": -119.8313,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054087,
      "AltID": "wastewater chlorinator",
      "FacilityID": 1000043775,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054876,
          "ProcessID": 1000054087,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065844,
          "ProcessID": 1000054087,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565844,
          "ProcessID": 1000054087,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043775,
      "SummaryText": "Executive Summary\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe City of Lemoore is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the chlorine treatment system equipment at the City of Lemoore Wastewater Treatment Plant. \n\n\n\nThe City of Lemoore facility has independently coordinated emergency response efforts with the local Fire Department.  In the event of a chlorine related emergency, it is the policy of the City of Lemoore to evacuate the employees and to allow the fire department/HazMat team to respond to the emergency.\n\n\n\nCity of Lemoore personnel circulate throughout the wastewater plant, taking note of unusual conditions in any portion of the treatment system.  In the event that a chlorine leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger, and the City of Lemoore Public Works Superintendent and/or their supervisor.  The Public Works Superintendent and/or supervisor will determine what procedures and personnel are necessary to remedy the problem. Emergency agencies will also be notified as necessary as outlined in the Emergency Action Plan.\n\n  \n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe City of Lemoore's primary activity using chlorine is wastewater treatment. The City of Lemoore Wastewater Treatment Plant is located at 1145 S. 18 ? Avenue in Lemoore, California, which is located approximately 0.5 miles south of Highway 198 and 0.6 miles east of Highway 41.  The area immediately surrounding the facility is rural with a mixture of farmland and residential areas. The maximum inventory of chlorine at the facility is 12,000 pounds. The facility stores a maximum of six (6) one-ton cylinders of chlorine onsite.\n\n\n\nACCIDENTAL RELEASE PREVENTION P"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043775,
      "SummaryText": "ROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the California Occupational Safety and Health Administration (Cal-OSHA) Process Safety Management (PSM) standard (Section 5189 of Title 8, CCR) and the EPA Risk Management Program.  This prevention program covers those processes that handle chlorine above the threshold quantity of either PSM or RMP rules.\n\n\n\nThe prevention program provides a structured approach to preventing accidents. Some of the specific activities in the prevention program include:\n\n\n\n?    Process safety information is provided to all applicable employees upon hire and is accessible at all times.\n\n?    In depth process hazard analyses are completed every five years by qualified personnel using techniques approved under the PSM standard.\n\n?    Written operating procedures (kept up to date) are used for training and guiding the work of operators.\n\n?    Training is provided to all employees upon hire, and refresher training is given at least every three years or upon request.\n\n?    Operators, mechanics, and contractor personnel are qualified, trained in the general hazards in the facility, and informed of any temporary situations affecting safety.\n\n?    Pre-startup safety reviews are conducted to ensure that conditions for safe operation have been satisfied prior to starting new or modified equipment.\n\n?    A program is in place to maintain the mechanical integrity of the process, which includes written procedures, training requirements, equipment deficiency requests for employees, work orders, scheduled maintenance, and documentation.\n\n?    A hot work permit system assures that work is done safely and properly.\n\n?    A management of change system is in place to ensure that changes are managed safely.\n\n?    Incidents are investigated and actions are taken as part of a continuous improvement effort.\n\n?    Routine audits are conducted to assure that safe practices are being followed."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043775,
      "SummaryText": "\n\n\n\nThis systematic approach to process safety involves employees and strives for continuing improvements in overall safety.  The training, qualifications, and safety awareness of the operations, maintenance, and management personnel are a key element in reducing and mitigating accidents.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe City of Lemoore Wastewater Treatment Plant has an emergency action plan in effect. This Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nThe City of Lemoore Wastewater Treatment Plant maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, chlorine health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. This Plan is reviewed and updated to ensure compliance with the PSM and RMP regulations.\n\n\n\nIn the event of a chlorine emergency, the City of Lemoore plans to evacuate all employees at the Wastewater Treatment Plant and alert the local emergency responders (fire department).  The City of Lemoore plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nEPA's RMP regulation defines \"accident\" as the following: \n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. The release must have caused at least one of the following: \n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\" \n\n\n\nAn investigation into the facility's acci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043775,
      "SummaryText": "dent history during the OCA Revalidation study performed on May 30, 2014, revealed that there have been no releases of chlorine over the past five years (May 2009 - May 2014) that exceeded the Federal Reportable Quantity of 10 pounds in 24 hours or that meet the EPA reporting criteria for the Five-Year Accident History as specified above. In addition, there have been no releases or \"near misses\" that warranted an internal incident investigation.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazards Analysis, including a Hazard and Operability (HAZOP) study and a Facility Inspection, conducted April 2013, provided mitigation measures to improve safety at the City of Lemoore Wastewater Treatment Plant. The City of Lemoore Wastewater Treatment Plant safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. Continue to train all employees in the facility safety plan/programs.\n\n2. Continue to have employee involvement in safety plan development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n"
    }
  ]
}