{
  "FacilityID": 1000011126,
  "FacilityName": "Desert Star Energy Center",
  "FacilityStr1": "701 Eldorado Valley Drive",
  "FacilityStr2": null,
  "FacilityCity": "Boulder City",
  "FacilityState": "NV",
  "FacilityZipCode": "89005",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Boulder City Fire Department",
  "FacilityLatDecDegs": "35.788250",
  "FacilityLongDecDegs": "-114.994583",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 90012373,
  "ParentCompanyName": "San Diego Gas and Electric",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "San Diego Gas and Electric",
  "OperatorStr1": "P.O. Box 62470",
  "OperatorStr2": null,
  "OperatorCity": "Boulder City",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89006",
  "OperatorZipCodeExt": null,
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168711",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "A00652",
  "SafetyInspectionDate": "2011-08-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-10-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-09-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-09-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-09-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.78821,
  "FRS_Long": -114.99415,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013252,
      "AltID": "Aqueous Ammonia System",
      "FacilityID": 1000011126,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015270,
          "ProcessID": 1000013252,
          "ChemicalID": 57,
          "Quantity": 31396.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000013613,
          "ProcessID": 1000013252,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011126,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-12-11 00:00:00",
    "ERTrainingDate": "2009-09-24 00:00:00",
    "CoordinatingAgencyName": "Boulder City Fire Department",
    "CoordinatingAgencyPhone": "7022939226",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011126,
      "SummaryText": "irements. This process is covered under the federal RMP Program I and CAPP tier B, program level I requirements, based on the storage of 15,000 gallons of aqueous ammonia with an ammonia concentration of 28 percent by weight. There have been no changes to the facility or regulated process since the date of the original RMP submittal that would affect the RMP program level for this facility. \n1.1\tAccident Release Prevention Program and Emergency Response \nEDE has a long-standing commitment to worker and public safety and is committed to operating and maintaining all of the processes in a safe and responsible manner.  To help ensure the safety of its employees and the public, as well as to protect the environment, EDE has implemented a combination of accident release prevention programs and emergency response planning programs. The objective is to minimize the risk of a release of a hazardous material, and if a release occurs, to minimize the potential impact to employees, the public, and the environment.  EDE management is committed to providing appropriate training to employees and coordinating response activities, as necessary, with the local emergency response providers to ensure a safe operation. \n1.2\tStationary Source Description \nThere have been no significant changes to the facility since the original RMP was developed in 1999. The facility is an electric generating station consisting of one 175 megawatt (MW) steam turbine and two 165 MW combustion turbine generators capable of generating 490 MW of electricity.  The two 165 MW turbines burn pipeline quality sweet dry natural gas exclusively and are equipped with Selective Catalytic Reduction (SCR) systems for the control of nitrogen oxide (NOx) emissions. The SCRs employ ammonia injection technology that reduces NOx to the targeted level of 3.5 parts per million volume (ppmv) at 15 percent oxygen (O2). The ammonia source for the SCRs is aqueous ammonia with an ammonia concentration of 28 percent by weight.\n1.2"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011126,
      "SummaryText": "ing alarms are installed on the ammonia storage tank and skids.  Should an alarm be triggered, an operator will be sent to evaluate the situation and take the appropriate action of either shutting down the piece of equipment or initiating a clean up of discharged material.\n1.3.3\tAmmonia Loading/Unloading Procedures\nIn order to assist in the prevention of an accidental release of ammonia, EDE implements ammonia loading and unloading procedures.  The procedures are as follows:\n1.\tUpon arrival of the driver at the facility, he/she shall report to EDEÂ¿s Control Room Operator (CRO) to confirm arrival of load and location of storage tank.\n2.\tDrive to loading/unloading area, stop the truck, set air brake, and shut off engine.  Upon exiting cab of tractor, driver must turn on Emergency Air Switch located at the front of the trailer directly behind the driverÂ¿s door.  With the switch in the Â¿onÂ¿ position, the trailerÂ¿s internal valve(s) will open and the trailerÂ¿s air brakes will lock.  Chock wheels to prevent vehicle movement during product transfer.  The driver shall give EDEÂ¿s receiving employee the Emergency Shut-Off Remote transmitter and assure that he/she has a full understanding of the Emergency Shut-Down Procedures.  Hold a safety briefing.\nSafety Note:  All of Air GasÂ¿s delivery vehicles have air-operated Emergency Shut-Off Valves with multiple Shut-Off Switch locations.  All delivery vehicles are also equipped with hand-held remote transmitters that are capable of completely shutting down the off-loading procedure from a distance of up to 300 feet.\n3.\tThe driver shall park the truck on the pavement (a solid, level surface), directly to the West of the ammonia storage tank.  This positioning will allow for unrestricted access to the receiving storage tank filling connections.  This position will also allow for a connection of the liquid and vapor delivery hoses to the storage tank filling connections without straining the hose by stretching or excessive ben"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011126,
      "SummaryText": "ding.\n4.\tThe driver and EDEÂ¿s receiving employee shall perform a visual inspection of piping leading to receiving storage tank, to ensure no midstream valves are closed or isolated.  Check liquid level gauge on tank to confirm amount of product tank can safely receive.  Check pressure gauge to prevent over-pressure situations.\nSafety Note:  The driver and EDEÂ¿s receiving employee shall hold a brief safety meeting including:  communicating emergency shutdown procedures, verifying that eyewash and safety shower are operational, and checking wind direction prior to any connections being made or product being moved.\n5.\tThe driver shall have gas mask accessible, and all individual in area shall put on protective apparel.\n6.\tThe driver shall open bleeder valves at hose connections on truck to make certain no pressure exists on trailer.  Repeat this procedure for the storage tank fill connections.\nSafety Note:  Stand upwind when opening bleeder valves.  Observe whether there is an actual discharge (gas or liquid) to assure bleed valve is not plugged.  Some storage tank fill connections may not contain bleeder valves.  IN these cases, protective line caps should be removed slowly and cautiously.  \n7.\tThe driver will remove liquid hose and vapor hose from hose tubes.  The driver will handle each hose with a firm grip on the hose and shall not allow hose end connectors to be damaged by hitting the ground.\n8.\tThe driver shall connect liquid hose and vapor hose to trailer and storage tank fill connections.  All connections shall be secured using the safety latches and pins.  Assure that hoses have no sharp bends.\n9.\tAfter all connections have been made, close bleeder valves.\n10.\tThe driver shall get confirmation from EDE before opening any valves.\nSafety Note:  Prior to transferring product, driver must ensure that Emergency Shut-Offs is operational.\n11.\tThe driver will slowly open the liquid discharge valve on the trailer.  Slowly open the vapor valve on the trailer.  Slowly"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000011126,
      "SummaryText": "open the liquid valve at the storage tank fill connection.  Slowly open vapor valve at the storage fill connection.\n12.\tIf any leaks should occur while opening any valve, shut off that valve and make connections to stop leak.  When corrected, open valve\nSafety Note:  Double check every valve in loading/unloading line for proper valve position.\n13.\tThe driver shall start load-off pump motor to begin transfer of product.\n14.\tDuring the transfer of aqua ammonia, the driver shall remain in continuous attendance and shall observe the transfer operation.  The driver shall not leave truck unattended. The driver shall not sit in truck cab.  If a leak develops, use standard or emergency shut-off to stop aqua ammonia flow.  A spill kit stocked with sorbent materials is located nearby and is readily accessible in the case of a leak or spill.\n15.\tOnce all aqua ammonia has been off-loaded, immediately turn off the pump and close all liquid and vapor valves.\n16.\tConnect air supply from trailer to liquid line to blow residual liquid from hose into storage tank.  Open air valve and then open liquid valve at the storage tank fill connection.  Lift and walk hose from trailer to the storage tank fill connection.\n17.\tClose liquid valve at the storage tank fill connection.\n18.\tTurn off air supply.  Disconnect air hose.\nSafety Note:  Verify again that all valves are closed at storage tank fill connection and on the trailer.\n19.\tSlowly open bleeder valves on liquid and vapor hose connections and allow vapor to escape in lines between valves to depressurize.\n20.\tAfter it has been determined that liquid and vapor hoses have been depressurized, disconnect hoses.  Close bleeder valves on trailer liquid and vapor lines.  Replace line caps on trailer and receiving storage tank.\n21.\tReturn liquid and vapor hoses to hose tubes on trailer.  Return air hose to storage.\n22.\tRemove protective apparel and return apparel to appropriate storage location.\n23.\tRemove chock blocks from wheels and return t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011126,
      "SummaryText": ".1\tRegulated Substances Handled\nThere have been no significant changes to the ammonia storage and handling system since the development of the original RMP. \nThe ammonia storage and handling system at the facility is comprised of a single storage tank, pumps, piping, and a vaporizer. Following the vaporizer, there are two blowers (for each SCR) that deliver the vaporized ammonia stream to the SCRs. \nThe tank is a horizontally-oriented cylindrical tank, rounded on each end. The tank is constructed of carbon steel which is compatible with aqueous ammonia. The tank has a total capacity of 16,400 gallons and is equipped with pressure relief valves, a flame arrestor, and temperature, pressure and level indicators. The maximum capacity of the tank is administratively limited to 15,000 gallons. \nThe tank is installed within a concrete secondary containment structure. The containment structure has a surface area of 1,123.5 square feet (53.5 feet by 21 feet) and a wall height of 3.5 feet. The total containment capacity is 29,415 gallons. \nThe piping from the tank to the vaporizer is also carbon steel, 1 to 2 inches in diameter, depending on the service. \n1.3\tAccidental Release Prevention Program and Chemical Specific Steps\nThe facility has onsite spill prevention and control procedures, including daily visual inspections and planned maintenance activities, which help to reduce the potential for hazardous material releases to the soil or surface waters. The following sections provide a summary of the Accidental Release Prevention Program.\n1.3.1\tDischarge Detection by Personnel\nThe facility operators perform a visual inspection of the facility during each shift. During the inspection, deficiencies are noted on a checklist and corrections are initiated either immediately or a work request is generated depending on the nature of the problem. Records of the inspection checklist are kept in the Control Building.\n1.3.2\tAmmonia Automatic Detection \nAutomatic ammonia vapor level sens"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000011126,
      "SummaryText": "o proper storage area.\n24.\tSign off on bill of lading. Make final check of truck and loading/unloading area.  The EDE CRO shall be notified when the driver is leaving the site, and that the loading/unloading activity is complete.\nNote: Aqueous ammonia trailers are equipped with the following \na.)\tPressure relief valves set at 25 psig.\nb.)\tRemote controlled emergency shutoff.\n1.4\tFive Year Accident History\nThere have been no accidents involving the release of aqueous ammonia in the past five years or since the original RMP was developed d in 1999. \n1.5\tEmergency Response Program\nThere have been no significant changes to the EDE facilityÂ¿s emergency response program since the RMP was originally developed in 1999 other than emergency contact information. The Emergency Response Plan was last updated in December 2008.  Based on the accident history, no changes are recommended at this time. \nEl Dorado Energy facilityÂ¿s emergency response program includes the following core elements: \nÂ¿\tSpecific actions to be taken in response to an accidental release of aqueous ammonia. \nÂ¿\tProcedures to notify local and public agencies including the Boulder City Fire Department, the NDEP, and the National Response Center, as necessary. \nÂ¿\tInformation on emergency health care. \nÂ¿\tInformation regarding the emergency response training of employees. \nÂ¿\tA list of the other federal and state emergency response requirements to which this facility is subject. \nThis RMP has been coordinated with the Boulder City Fire Department (702-293-9266). A copy of the plan is provided in Appendix II. \nIn addition to the contact information for emergency services provided in the Emergency Response Plan, contact information for environmental regulatory organizations is provided.  These regulatory agencies may need to be contacted in the event of an ammonia release.\n1.6\tPlanned Changes to Improve Safety\nSince there have been no accidents involving the release of aqueous ammonia in the past five years or"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011126,
      "SummaryText": "El Dorado Energy, LLC (EDE) operates the El Dorado Energy Power Plant (facility) located approximately 15 miles southwest of Boulder City, Nevada.  EDE has prepared this Risk Management Plan (RMP) Update for the facility in accordance with Title 40 of the Code of Federal Regulations (CFR) Part 68 Section 190 (Â§68.190).  In accordance with Â§68.190(b)(1), this update has been prepared within 5 years from the date of the most recent update, which occurred in September 2004. The plan was originally submitted to the Administering Agency, the Nevada Department of Environmental Protection (NDEP) in September 1999.\nThe federal RMP regulations require periodic updating of the RMP program information, but do not require that the entire plan be recreated in its entirety. In fact, the RMP regulations require that many of the program documents be retained for the life of the plan. The RMP is expected to change and evolve as the facility changes, as new information on chemical hazards is developed, as the affected system is modified, and as the surrounding community changes. In some instances, new program elements supersede previous versions; in other cases, the new program element supplements the previous version. To ease the administrative burden for the facility, the previous version of the RMP is incorporated by reference into this RMP update. \nPursuant to the regulations outlined in the Nevada Administrative Code (NAC) Chapter 459.9542, the Clean Air Act Section 112(r), and 40 CFR 68, this RMP has been prepared and submitted by El Dorado Energy, L.L.C. This program is implemented under the Chemical Accident Prevention Program (CAPP) of the Bureau of Waste Management (BWM) NDEP.\nThe scope of the RMP is based on discussion with NDEP and the Boulder City Fire Department to ensure that all issues are resolved and to incorporate state requirements. The aqueous ammonia storage and handling process at the facility was identified as the only process that triggers the RMP/CAPP requ"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000011126,
      "SummaryText": "since the original RMP was developed in 1999, no additional changes are planned to improve safety other that what is currently performed. \n1.7\tOffsite Consequence Analysis \nIn light of security concerns, and consistent with United States Environmental Protection Agency (EPA) policy, discussion of the offsite consequence analysis (OCA) has been omitted from the text of this RMP Update. The OCA is provided in Appendix IV."
    }
  ]
}