{
  "FacilityID": 1000043354,
  "FacilityName": "Culebrinas Filtration Plant",
  "FacilityStr1": "State Road PR-443 Km-5.9",
  "FacilityStr2": "Palmar Ward",
  "FacilityCity": "Aguadilla",
  "FacilityState": "PR",
  "FacilityZipCode": "00603",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72005",
  "LEPC": "Aguadilla LEPC",
  "FacilityLatDecDegs": "18.407028",
  "FacilityLongDecDegs": "-067.141075",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "LF",
  "FacilityURL": "acueductospr.com",
  "FacilityEmailAddress": "ciecentral@acueductospr.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Puerto Rico Aqueduct and Sewer Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "P.R. Aqueduct and  Sewer Authority",
  "OperatorStr1": "PO Box 7066",
  "OperatorStr2": null,
  "OperatorCity": "San Juan",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00916",
  "OperatorZipCodeExt": "7066",
  "RMPContact": "Irma M. Lopez Santos",
  "RMPTitle": "Compliance and QC Director",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208081",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-03-28 00:00:00",
  "DeRegistrationEffectiveDate": "2015-09-02 00:00:00",
  "AnniversaryDate": "2019-05-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053477,
      "AltID": "Chlorination",
      "FacilityID": 1000043354,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054244,
          "ProcessID": 1000053477,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064963,
          "ProcessID": 1000053477,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564963,
          "ProcessID": 1000053477,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043354,
      "SummaryText": "Culebrinas Filtration Plant is located at the State Road 443 kilometer5.9  Bo. Palmar Aguadilla, Puerto Rico, 00603.  This water treatment plant is owned by Puerto Rico Aqueduct and Sewer Authority (PRASA) which is a Government Agency.  PRASA has developed the RMP following the Program #3 for the Management and Prevention of Risks associated with the storage and handling of the toxic substance used as for water disinfection: Chlorine.  The RMP was prepared in compliance with EPA 40 CFR Part 68.  The Prevention Program was prepared in accordance with OSHA Process Safety Management (PSM) regulation, as established in 29 CFR Part 1910.119.\n\n\n\nAccidental Release:\n\nIt is PRASA policy to comply with EPA and OSHA Federal and State applicable requirements. Chlorine is a toxic substance regulated by EPA, for that reason Culebrinas Filtration Plant has undergone some engineering controls.  Changes have been put in place to improve safety and as a part of the Prevention Plan implanted to protect the wellness of workers, employees, contractors, visitors and immediately surrounding areas and inhabitants.\n\n\n\nThe Stationary Source and Regulated Substance handled.\n\nCulebrinas Filtration Plant is located close to the area where the plants supply the potable water.  The chlorine is used as a disinfectant to destroy the microorganism that could cause illness in humans.\n\n\n\nThe chlorine is delivered from the PRASA Chlorine Warehouse and Distribution Center in Puerto Nuevo at the plant in one (1) ton containers.  Culebrinas Filtration Plant  have a storage capacity of 24,000 pounds of chlorine distributed in twelve (12) containers.  Only two (2) containers are connected to a system and from which the chlorine flows to two chlorinators and from it the chlorine flows to the ejectors, and then the chlorine solution go to two points of disinfection.   \n\n\n\nWorst Case Scenario:\n\nThe Worst Case Scenario was determined as indicated in the EPA Wastewater Treatment Plant, as per Appendix F Supplem"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043354,
      "SummaryText": "ental Risk Management Program Guidance for Wastewater Treatment Plants.  This guidance considers the release of the Chlorine Gas of the entire container (2,000 lbs) during 10 minutes and other specifications related to the weather conditions and a radio of 1.3 miles, for a chlorine concentration equal or higher than 3 ppm, which is the American Industrial Hygiene Association exposure limit above which it is determined human health will be affected.  Using the Landview 6 Simulator and the US Census 2010, it was identified that 6,380 residents and school are inside the 1.3 miles radio.  No known environmental receptors (state parks, or official designated wildlife preserves) are located within this radio area.  The ALOHA Modeling Dispersion Program was used to simulate the gas dispersion.\n\n\n\nAlternative Case Scenario:\n\nThe more realistic scenario was also simulated as per EPA Wastewater Treatment Plants parameters, as a release of the total content of a 2,000 lbs container, but throughout a valve rupture.  In the case the end point distance is calculated at 0.1 miles no public receptors were identified over the most recent map.  Also no known environmental receptors are located within this radio area.\n\n\n\nGeneral Accident Release Prevention Program \n\nPRASA is actually in a very aggressive operation to implement a Prevention Plan to ensure the maintenance and mechanical integrity of the facility which will improve significantly the safety scope of the current prevention plans.  Standard Operational Procedures (SOPs) are already in place to comply the OSHA and PROSHO requirements in order to keep all the involved parties aware of the hazardous and risk related to the chlorine.  List of all SOPs are indicated in the PSM report and are located in the plant.\n\n\n\nEmergency Response Program:\n\nPRASA has various SOPs to manage emergency programs associated to a release of the chemical and also related to the emergency actions to be taken before and after hurricanes and other atm"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043354,
      "SummaryText": "ospherics events.\n\n\n\nFive years Accident History:\n\nNo mayor release of chlorine in excess of ten (10) lbs has been reported during the last five years, because the plant was recent begins operations. \n\n\n\nPlanned Changes to Improve Safety:\n\nIt is planned to install a fire alarm in the chlorine room."
    }
  ]
}