{
  "FacilityID": 1000103706,
  "FacilityName": "Norfolk LPG Terminal",
  "FacilityStr1": "100B Remington Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Norfolk",
  "FacilityState": "NY",
  "FacilityZipCode": "13667",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36089",
  "LEPC": "St. Lawrence County LEPC",
  "FacilityLatDecDegs": "44.808314",
  "FacilityLongDecDegs": "-74.995719",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "nglenergypartners.com",
  "FacilityEmailAddress": "info@nglep.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "NGL Supply Terminal Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "NGL Supply Terminal Company, LLC",
  "OperatorStr1": "6120 South Yale Ave",
  "OperatorStr2": "Suite #805",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74136",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000249867",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-11-10 00:00:00",
  "SafetyInspectionBy": "Local building inspector",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-01-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-12-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-12-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-12-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000129091,
      "AltID": "Propane Wholesale Storage",
      "FacilityID": 1000103706,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000161583,
          "ProcessID": 1000129091,
          "ChemicalID": 98,
          "Quantity": 4800000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000130484,
          "ProcessID": 1000129091,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000111026,
              "Process_NAICS_ID": 1000130484,
              "SafetyReviewDate": "2022-08-17 00:00:00",
              "PHA_Date": "2022-08-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-12-08 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Process controls with system isolation and emergency shutdown",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Low melting temperature instrument air piping which actuates all emergency shutoff valves",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-12-08 00:00:00",
              "TrainingReviewDate": "2023-01-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Web based",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-01-04 00:00:00",
              "EquipmentInspectionDate": "2023-01-04 00:00:00",
              "EquipmentTested": "All equipment inspected as part of PSSR",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2023-01-04 00:00:00",
              "PreStartupReviewDate": "2023-01-05 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2022-09-13 00:00:00",
              "HotWorkPermitReviewDate": "2022-09-13 00:00:00",
              "ContractorSafetyReviewDate": "2022-11-23 00:00:00",
              "ContractorSafetyEvalDate": "2022-09-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000139485,
                  "PreventionProgram3ID": 1000111026,
                  "ProcessChemicalID": 1000161583
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000103706,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-12-14 00:00:00",
    "ERTrainingDate": "2022-11-03 00:00:00",
    "CoordinatingAgencyName": "Norfolk Volunteer Fire Department",
    "CoordinatingAgencyPhone": "3153846182",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "29 CFR 1910.119, API 510 (Pressure Vessel Inspection) and API 570 (Piping Inspection)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000103706,
      "SummaryText": "facility complies\nwith all the elements of the EPA 40 CFR Part 68 Accidental Release Prevention\nRequirements, Program 3 Risk Management Plan (RMP), all the elements of OSHA 29 CFR Part\n1910.119 Process Safety Management (PSM) of Highly Hazardous Chemicals regulation, and the\nrequirements of the National Fire Protection Association NFPA-58 Liquefied Petroleum Gas Code\nrequirements for LP-Gas Storage and all applicable codes and regulations.\n\nFive-year Accident History:\nNo release of a regulated substance has occurred in the last 5 years.\n\nEmergency Response Program Information:\nThe Norfolk Terminal Emergency Response Plan is site-specific. It includes required actions by\nplant employees as well as required notification and coordination with local responders and\nagencies. All employees are trained in the execution of the Emergency Response Plan and drills are conducted.\nEmergency response program changes are administered through the MOC process.\n\nTrade Secrets:\nThere are no trade secrets applicable to the Norfolk Terminal processes.\n\nPlanned Changes to Improve Safety:\nNGL Supply Terminal Company, LLC will continually strive for safety improvement. Periodic process safety inspections and Process Hazard Analyses will be conducted followed with timely response."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000103706,
      "SummaryText": "red processes are qualified to perform the work and are informed of the potential hazards. The Norfolk Terminal personnel monitor the contractor activities throughout all maintenance, renovation or specialty work on or new RMP / PSM covered processes.\n\nPre-startup Safety Reviews (PSSR):\nThe Norfolk Terminal requires a pre-startup safety review (PSSR) to be performed and\ndocumented for any physical modification in the PSM covered processes. Additionally, any new\nunits added at the Norfolk Terminal which is considered PSM covered processes will also require a PSSR to be performed and documented.\n\nMechanical Integrity:\nThe Norfolk Terminal has developed and implemented procedures to maintain the on-going\nmechanical integrity of critical process equipment in accordance with National Fire Protection\nAssociation NFPA-58 Liquefied Petroleum Gas Code requirements for LP-Gas Storage and industry recognized and generally accepted good engineering practices.\nInspections and tests are documented and deficiencies outside of the acceptable limits are corrected before further use or in a safe and timely manner.\n\nHot Work Permits:\nThe Norfolk Terminal has developed and implemented a hot work permit system in accordance\nwith the OSHA 29 CFR Part 1910 requirements for hot work operations conducted on or near a\ncovered process.\n\nManagement of Change: \nThe Norfolk Terminal requires that a management of change (MOC) be performed for any\nmodification to equipment, procedures, products, and process parameters of a PSM covered process.\n\nIncident Investigation:\nThe Norfolk Terminal requires that any incidents that resulted in the release of regulated\nsubstances, or a near miss, must be investigated as soon as possible, but no later than 48 hours\nfollowing the incident. The Norfolk Terminal has established a system to promptly address and\nresolve incident investigation findings and recommendations.\n\nCompliance Audits:\nThe Norfolk Terminal conducts audits on a regular basis to ensure that the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000103706,
      "SummaryText": "s for each operating phase,\nincluding: (1) initial start-up, (2) normal operations, (3) temporary operations, (4) emergency\nshutdown, (5) emergency operations, (6) normal shutdown, and (7) start-up after turnaround.\nThe Norfolk Terminal written operating procedures state the operating limits including the\nconsequences of deviation and the steps required to correct or avoid the deviation.\nThe Norfolk Terminal written operating procedures describe all the process safety systems and\ntheir functions.\nThe Norfolk Terminal written operating procedures are reviewed and certified annually for current practices and accuracy.\n\nSafe Work Practices and Procedures:\nThe Norfolk Terminal has developed and implemented safe work practices in accordance with the OSHA 29 CFR Part 1910 requirements that include methods for controlling plant entry, presence and exit of support personnel, and lockout/ tagout procedures to ensure isolation of energy sources for equipment undergoing maintenance, hot work procedures and permits for work with the potential for generating ignition sources in the presence of flammable or combustible material, and confined space entry permits and procedure to ensure that adequate precautions are in place before entry is allowed into a permit required confined space.\n\nTraining:\nThe Norfolk Terminal has developed and implemented formal operator and maintenance training programs. Initial training ensures that new or reassigned personnel are trained in an overview of the process and operating procedures. Refresher training is performed at least every three (3) years to ensure that the operator understands and adheres to the current operating procedures of the process. Employees are tested to demonstrate their understanding of the training and competency.\n\nContractors:\nThe Norfolk Terminal has developed and implemented a program to ensure that contractors used to supplement its workforce to perform maintenance, renovation, or specialty work on or near RMP / PSM cove"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000103706,
      "SummaryText": "afety information enables the Norfolk Terminal employees\ninvolved in operating and maintaining the terminal to identify and understand the hazards of the process. Process safety information is used to conduct process hazard analysis on the existing process or a proposed modification to a process.\n\nProcess Hazard Analysis (PHA):\nThe Norfolk Terminal is committed to performing a detailed hazard analysis of each covered\nprocess to identify, evaluate, and control hazards involved in the processes. Each process is\nsystematically examined to identify potential hazards, controls in place to manage these hazards, and recommend additional controls, as appropriate.\nThe Norfolk Terminal uses the hazard and operability (HAZOP) and check list PHA methodologies, which are conducted by a team of people who have operating and maintenance experience, engineering expertise and PHA facilitator training. The PHA team identifies and evaluates potential hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and / or mitigation measures.\nAt a minimum the Norfolk Terminal performs periodic PHA reviews or revalidations every 5 years as long as the process is operating.\nPHA findings and recommendations and their resolution are documented. The Norfolk Terminal\nhas implemented a system to address and resolve all PHA findings and recommendations in a\ntimely manner through a written schedule. All PHA findings and recommendation resolutions are communicated to all affected employees. All recommendations must be resolved and documented by management.\n\nOperating Procedures (OP):\nThe Norfolk Terminal has developed and implemented written operating procedures that describe the tasks that terminal operators and transport drivers must perform, the safe process operating parameters that must be maintained, and safety precautions for operations and maintenance activities.\nThe Norfolk Terminal written operating procedures address step"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000103706,
      "SummaryText": "Accidental release prevention and emergency response policies:\nThe Norfolk Terminal has implemented all the elements of an EPA 40 CFR Part 68 Accidental\nRelease Prevention Requirements, Program 3 Risk Management Plan (RMP) and all the elements\nof OSHA 29 CFR Part 1910.119 Process Safety Management (PSM) of Highly Hazardous\nChemicals regulation. The Norfolk Terminal complies with National Fire Protection Association\nNFPA-58 Liquefied Petroleum Gas Code requirements for LP-Gas Storage, and it is company policy to adhere to all applicable federal, state, and local laws. If an emergency were to occur, it is company policy to notify the Norfolk Fire Department and request that they respond to the\nemergency.\n\nThe Stationary Source and Regulated substances:\nThe Norfolk Terminal is a bulk liquefied petroleum gas terminal that receives propane by rail car and truck transport. Propane is stored at the Norfolk Terminal in two (2) 90,000 gallon tanks and distributed by customer truck transports.\n\nGeneral Accidental Release Prevention Program:\nThe Norfolk Terminal has developed and implemented all the elements of the EPA 40 CFR\nPart 68 Accidental Release Prevention Requirements, Program 3 Risk Management Plan (RMP)\nand all the elements of OSHA 29 CFR Part 1910.119 Process Safety Management (PSM) of Highly\nHazardous Chemicals regulations. The Norfolk Terminal adheres to the National Fire Protection\nAssociation NFPA-58 Liquefied Petroleum Gas Code requirements for LP-Gas Storage and all\napplicable federal, state, and local laws.\n\nProcess Safety Information (PSI):\nThe Norfolk Terminal has compiled written process safety information for all PSM covered\nprocesses. The process safety information includes the hazards of chemicals used or produced in the process, process technology information, and process equipment data. The process safety information is updated whenever process changes are made using management of changes and pre-startup safety reviews.\nAccurate and complete process s"
    }
  ]
}