{
  "FacilityID": 1000069140,
  "FacilityName": "Tyson Farms, Inc.- Temperanceville, VA",
  "FacilityStr1": "11224 LANKFORD HWY.",
  "FacilityStr2": "PO BOX 8",
  "FacilityCity": "TEMPERANCEVILLE",
  "FacilityState": "VA",
  "FacilityZipCode": "23442",
  "Facility4DigitZipExt": "2445",
  "FacilityCountyFIPS": "51001",
  "LEPC": "Accomack County LEPC",
  "FacilityLatDecDegs": "37.885000",
  "FacilityLongDecDegs": "-075.555278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.tyson.com",
  "FacilityEmailAddress": "sarah.harrison@tyson.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Tyson Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6903702,
  "Company2DUNS": 0,
  "OperatorName": "Tyson Farms, Inc.",
  "OperatorStr1": "PO BOX 8",
  "OperatorStr2": "11224 Lankford Hwy",
  "OperatorCity": "TEMPERANCEVILLE",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23442",
  "OperatorZipCodeExt": "2445",
  "RMPContact": "Reginald Cubbage",
  "RMPTitle": "Plant Manager",
  "FTE": 1300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000051454",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "VA40333",
  "SafetyInspectionDate": "2019-06-18 00:00:00",
  "SafetyInspectionBy": "Marsh Insurance Audit",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "COMPLETE",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-12-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-04-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-04-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-04-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.8869,
  "FRS_Long": -75.55284,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086671,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000069140,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000087893,
          "ProcessID": 1000086671,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108164,
          "ProcessID": 1000086671,
          "ChemicalID": 56,
          "Quantity": 108654.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000608164,
          "ProcessID": 1000086671,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069140,
      "SummaryText": "EPA RISK MANAGEMENT PLAN\n\n\n\nEXECUTIVE SUMMARY\n\n\n\nTYSON FOODS    TEMPERANCEVILLE, VA.\n\n\n\n1.  Accidental release prevention and emergency response polices. To insure safe operation and release prevention at Tyson Foods TEMPERANCEVILLE, VA., this facility has implemented The Occupational Safety and Health Administrations Chemical Process Safety Management Program 29 CFR 1910.119.  All operators of systems containing the threshold amount of hazardous chemicals will undergo Chemical Process Safety Management training and operator training specific to the system. \n\nTo insure proper response to emergency situations, Tyson Foods TEMPERANCEVILLE, VA., has implemented Emergency Action Plans as required by The Occupational Safety and Health Administrations 29 CFR 1910.38(a) and Emergency Response Plans 29 CFR 1910.120. All safety personnel and operators of the process will be trained in these emergency procedures.\n\n\n\n2.  The stationary source and regulated substances handled.\n\n     Poultry slaughter plant & fresh processing\n\n     Regulated substances: Ammonia \n\n    \n\n3.  The general accidental release prevention program.\n\n      This facility complies with the Occupational Safety and Health Administrations Chemical Process Safety Management 29 CFR 1910.119 and the Environmental Protection Agencies Risk Management Program 40 CFR Part 68.  For ammonia systems \n\n    Tyson Foods, Inc. has adopted the International Institute of Ammonia Refrigeration guidelines for system operation and maintenance.  Tyson Foods Inc. uses the IIAR Basic Ammonia Refrigeration Training Series for all operators. \n\n \n\n4.  Five-year accident history.\n\nThe Tyson Farms, Inc. - Temperanceville, VA facility (Temperanceville Plant) had no accidental releases within five years prior to Sep 25, 2017 resulting in deaths, injuries, significant property damage, offsite evacuations or sheltering in place.\n\n \n\n5.   The emergency response program.    \n\nA fully trained and equipped Emergency Response Team is on site.  This te"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069140,
      "SummaryText": "am is trained to the Hazardous Materials Responder-Technician response capability in accordance with OSHA 29 CFR 1910.120 (q).  The team is capable of affecting all control measures (both confinement operations and containment operations) required to remediate the incident.\n\n\n\nA written Emergency Response Plan has been developed and is on record at the Facility.  This plan includes Pre-Emergency Planning with Outside Agencies, Personnel Roles and Lines of Incident Command Authority, Facility Hazard Analysis and Emergency Prevention, Safe Distances and Places of Refuge, Site Security and Control, Evacuation Routes and Procedures, Decontamination Procedures, provisions for Emergency Medical Treatment, Emergency Notification Procedures, Chemical Response Procedures, Post Incident Critique, and Personal Protective Clothing and Emergency Equipment.\n\n\n\nAll Hazmat courses at Tyson Foods, Inc., are designed to meet training requirements of the OSHA 29 CFR 1910.120 (q) (7) and (8).  \n\nAll TEMPERANCEVILLE, VA. Hazmat Team Members are trained 24 hours initially to the Technician level followed by 8-24 hours of refresher training per year under the direction of the on-site Hazmat Instructor at the facility. Each Instructor receives an initial 40 hours of training and 8-16 hours per year re-certification training that goes to I.C. level. \n\n\n\nThe training is designed to teach both theory and hands-on training giving the person an overall understanding of the nature of hazardous materials and the ability to assess and safely respond to the incidents in the Incident Command structure.  Technician level training includes but is not limited to the following:\n\n? Knowledge of basic hazards and risk assessment techniques\n\n? Proper selection and use of appropriate and required PPE for the chemical hazard\n\n? Terminology associated with Hazmat\n\n? Advanced site control/security procedures\n\n? Advanced Containment/Control/Decon procedures\n\n? Use of Atmospheric Monitoring Equipment and Contami"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069140,
      "SummaryText": "nant Test Procedures\n\n? Incident Command Structure Roles and Line of Authority\n\n? Interaction with Local and State Officials\n\n? Standard Operating Procedures for Clean-up and termination \n\n? Critique\n\n\n\nOn Site facility Instructors have completed in excess of 40 hours of Instructor's training, achieving the Incident Command level, over the past 5 years and have instructed their team in approximately 60 hours of training.  \n\n\n\nAll training materials, hands-on drills and response procedures have been developed under the direction of the Tyson Total Safety Department\n\n\n\nAll Team members are taught in Hazard Communication to report any observed chemical leaks/spills and odors to their supervisor or lead person immediately.  Supervisors and Leads are taught to report the above to the Safety or Process Manager immediately for\n\nfurther investigation and action by the Hazmat team.  MSDS information books are accessible to all team members for review.\n\n     \n\n6.  Planned changes to improve safety. Update Equipment as needed."
    }
  ]
}