{
  "FacilityID": 1000061198,
  "FacilityName": "Dorada Poultry LLC, Ponca City",
  "FacilityStr1": "2000 Hall BLVD",
  "FacilityStr2": null,
  "FacilityCity": "Ponca City,",
  "FacilityState": "OK",
  "FacilityZipCode": "74601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40071",
  "LEPC": "Ponca City Fire Department",
  "FacilityLatDecDegs": "36.725994",
  "FacilityLongDecDegs": "-97.110749",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dorada Poultry LLC.",
  "OperatorStr1": "2000 Hall BLVD",
  "OperatorStr2": null,
  "OperatorCity": "Ponca City,",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74601",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Eckholt",
  "RMPTitle": "General Manager",
  "FTE": 500,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000016813",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-11-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-11-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-11-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.7245,
  "FRS_Long": -97.1166,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000076442,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000061198,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077624,
          "ProcessID": 1000076442,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094733,
          "ProcessID": 1000076442,
          "ChemicalID": 56,
          "Quantity": 67000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594733,
          "ProcessID": 1000076442,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061198,
      "SummaryText": "This document has been prepared to demonstrate how Dorada Poultry, LLC, complies with the requirements set forth under EPA's Chemical Accidental Prevention Provisions (40 CFR 68).  This plan has been developed specifically to address the requirements applicable to the use of anhydrous ammonia at the Dorada Poultry facility located in Ponca City, Oklahoma.  Each of the following sections provides a general overview of the facility requirements and defines design attributes, documentation, and actions that are established to comply with those requirements.  Dorada Poultry has already developed measures and systems that provide compliance with 40 CFR Part 68 rules as a result of other regulatory programs and requirements.  This document does not replicate that information but rather provides cross-references to the applicable existing documentation.  In those instances where information was developed specifically to comply with the Part 68 requirements, that information is contained in this document.\n\n\n\nCommitment to Safety\n\nThe health and safety of our partners, contractors, and visitors is the most important aspect of our operations which include the protection of the environment and our surrounding communities.  Our commitment to safety is more than words; it is the core value we live and work by at Dorada Poultry, LLC.  The success of our safety culture and environmental commitment is based on our belief that every partner must and will be actively engaged both in safety and the protection of the environment. It is the policy of Dorada Poultry to:\n\n-Provide safe working conditions, proper tools, and personal protective equipment.\n\n-Comply with all federal, state, and local occupational health and safety laws and regulations.\n\n-Provide and sustain a high level of commitment to ensuring that all employees have a safe and healthy work environment in which to work.\n\n-Ensure, through training and when necessary disciplinary action, that all employees work in a safe mann"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061198,
      "SummaryText": "er.\n\n-Educate and/or train all employees in safe work practices, and ensure that each employee fully understands their job, equipment, techniques, and methods to reduce the risk to themselves and their co-workers.\n\n-Encourage all employees to \"Think Safety\", so that safety habits developed and practiced at work carry through to non-work related activities.\n\n\n\nDorada Poultry's aim is to provide a professional service as efficiently as possible while minimizing the use of toxic materials where ever and whenever possible.  In this effort our highest priority will be the proactive pursuit of cost-effective process changes that reduce or eliminate the use and/or generation of hazardous toxics at the endpoint of service.  Where hazardous toxics cannot be eliminated, improving controls to handle these substances will be explored and implemented whenever and wherever possible. Dorada Poultry has prepared a safety policy and procedures program specifically tailored for the facility in addition to establishing a Process Safety Management Program.  It is the responsibility of the facility's management personnel to carry out these programs.The first duty of Dorada Poultry employees is to exercise care in the performance of their work tasks to prevent an accident to themselves, co-workers, the general public or equipment.  Safety-consciousness must take precedence over expedience, and is required as a condition of continued employment of all employees at all levels of the organization.\n\n\n\nAnhydrous ammonia, which is regulated under 40 CFR Part 68, is utilized at Dorada Poultry in the facilities refrigeration system. Approximately 67,000 pounds of anhydrous ammonia is utilized within the refrigeration system. The ammonia is contained in various vessels, piping, chillers, condensers, compressors and miscellaneous refrigeration equipment located throughout the facility.  \n\n\n\nAs a result of a recognized highly toxic chemical used at Dorada Poultry, the facility has developed and imp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061198,
      "SummaryText": "lemented Prevention Program 3 in accordance with EPA's Risk Management Program.  Also in place at the Dorada Poultry facility is a Process Safety Management program as required by OSHA Standard 29 CFR1910.119. \n\n\n\nWorst/Alternate Case Release Scenarios\n\nAlthough engineering controls incorporated into the refrigeration process would normally prevent such releases, the possibility of a \"catastrophic release\" does exist.  Based on that premise, the facility has modeled two off site consequence analyses: a worst case scenario and an alternate case scenario. For all scenarios, EPA's RMP Comp (Revision 1.07) modeling software was used to determine Off-Site Consequence Analysis.  The distance to the toxic endpoint for such a release and potential receptors are discussed in Section 3.2 and shown on the map in Appendix B of this document.\n\n\n\nEmergency Action & Response Program\n\nDorada Poultry is equipped with an emergency warning system.  Alarms are strategically placed throughout the facility to alarm personnel of an emergency relating to the accidental release of anhydrous ammonia or other emergencies that may be encountered.  There are specific procedures that all employees will follow in the event of release.  These procedures can be found in the Emergency Action Plan on file at the facility. These procedures include immediate notification to authorities and evacuation of facility personnel.  In the event that an ammonia release or spill does occur, off-site responders, specifically the Ponca City Fire Department or the Kay County LEPC will be notified. \n\n"
    }
  ]
}