{
  "FacilityID": 1000033144,
  "FacilityName": "Brenntag Southwest Inc., Houston 1-13 Update",
  "FacilityStr1": "14826 Hooper Road",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77047",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-",
  "FacilityLatDecDegs": "29.588669",
  "FacilityLongDecDegs": "-095.405263",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "Brenntag.com",
  "FacilityEmailAddress": "gcunningham@brenntag.com",
  "FacilityDUNS": 117432922,
  "ParentCompanyName": "Brenntag, Inc",
  "Company2Name": null,
  "CompanyDUNS": 92963644,
  "Company2DUNS": 0,
  "OperatorName": "Greg Cunningham",
  "OperatorStr1": "206 East Morrow Road",
  "OperatorStr2": null,
  "OperatorCity": "Sand Springs",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74063",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Taylor",
  "RMPTitle": "President",
  "FTE": 41,
  "OtherEPAFacilityID": "TXD062128004",
  "EPAFacilityID": "100000042884",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-12-14 00:00:00",
  "SafetyInspectionBy": "FDA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-02-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-02-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-02-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-12-04 00:00:00",
  "DeRegistrationEffectiveDate": "2018-11-28 00:00:00",
  "AnniversaryDate": "2018-02-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 29.59106,
  "FRS_Long": -95.40526,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility has been shutdown. Brenntag does not operate a facility at this address",
  "_processes": [
    {
      "ProcessID": 1000040457,
      "AltID": "Repack Store Handle",
      "FacilityID": 1000033144,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000040858,
          "ProcessID": 1000040457,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048643,
          "ProcessID": 1000040457,
          "ChemicalID": 31,
          "Quantity": 100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 31,
            "ChemicalName": "Cyclohexylamine  [Cyclohexanamine]",
            "CASNumber": "108-91-8",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000548643,
          "ProcessID": 1000040457,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000040459,
      "AltID": "Storage & Handling",
      "FacilityID": 1000033144,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000040860,
          "ProcessID": 1000040459,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048645,
          "ProcessID": 1000040459,
          "ChemicalID": 57,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000548645,
          "ProcessID": 1000040459,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033144,
      "SummaryText": "INTRODUCTION\n\n\n\nBrenntag Southwest, Inc. is a chemical distribution company headquartered in Longview, Texas with Corporate Regulatory Offices in Tulsa, Oklahoma, which has several branches located in Kansas, Oklahoma, Texas, Louisiana, and Alabama.  Brenntag Southwest participates in the Responsible Distribution Program (RDP) of the National Association of Chemical Distributors (NACD). The Community Outreach and Emergency Response Plan of RDP bring chemical distribution plants and local communities together through communication and cooperative emergency planning.  The company is also a long-term member of the Chlorine Institute, a worldwide organization that focuses on the safe handling of chlorine and other chemicals. Brenntag Southwest is an ISO 2001:9008 certified company with Health, Safety, and Environmental policies and procedures in place designed to prevent emergencies such as fires, explosions, and accidental chemical releases. \n\nBrenntag Southwest is a Business Unit of Brenntag, Inc., which serves customers worldwide with products, chemicals, and advanced materials. The company ranks among the top chemical distribution firms in North America. It is the worldwide policy of Brenntag to safely blend and distribute its products and to handle materials throughout their life cycle in a manner that protects the environment and safeguards employees, customers and the public from unacceptable risk. \n\n\n\nPLANT DESCRIPTION\n\n\n\nThe Brenntag Southwest facility is located in the City of Pearland, TX, on the south side of Houston.  The company employs 60 full-time employees who carry out distribution activities that include the storing and handling of Ammonia Solution 30% and the repackaging, storage and handling of Cyclohexylamine in compliance with the Prevention Program Level 2.  The Environmental Protection Agency (EPA) considers these products to be hazardous.  The facility provides this and other quality products to customers in Texas and surrounding states.\n\n\n\nPRO"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033144,
      "SummaryText": "DUCTS\n\n\n\nAmmonia solutions are commonly used as cleaning compounds, emissions reducing agents, and in the treatment of water. Cyclohexylamine is commonly used as a corrosion inhibitor in boiler systems. The same properties that make these chemicals valuable as a commodity also make it necessary to observe certain safety precautions in handling to reduce the threat to nearby members of our community as well as to the employees of the company.  It is our policy to adhere to all applicable Federal, State, and Local regulations. \n\nACCIDENTAL RELEASE & EMERGENCY RESPONSE POLICIES\n\nBrenntag Southwest owns emergency equipment that aids in the ability to stop leaks from containers of these products and has employees who are trained in the use of this equipment. Along with these internal programs, Brenntag also maintains agreements with area emergency response companies.  \n\nThe Emergency Programs in place at the facility include an Emergency Response Plan, Fire Prevention Plan, and a Transportation Emergency Plan.  These plans require the facility to maintain an open door policy with local fire departments and other emergency agencies in the area, and to invite emergency responders from both the public and private sectors to tour the facility annually in order to gain knowledge of the physical setup and processes of the plant.  This information becomes very valuable in the event of an emergency incident.  These plans also direct the facility to maintain a working relationship with area clinics and hospitals in order to be prepared during an emergency event.   \n\nACCIDENT PREVENTION PROGRAM & CHEMICAL SPECIFIC ACCIDENT PREVENTION PROGRAM\n\nBrenntag Southwest, Inc. maintains Health, Safety, and Environmental policies for Risk Management, Training, Product Stewardship, Community Outreach, Hazard Communication, and Process Safety Management. These policies require careful review of the hazards and determine the safeguards that must be implemented to prevent releases of regulated c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033144,
      "SummaryText": "hemicals. In conjunction with these numerous training programs, the company also complies with container specifications, inspections, and testing requirements of the Department of Transportation regulations.  Still other programs such as the NACD's Responsible Distribution Program, and guidance implemented based on EPA's SARA Title III regulations along with BOCA Building and Fire Codes have aided the company in designing and operating a safe plant.  These programs and regulations coupled with company policy help to ensure the safe operation of the facility, protecting employees, neighbors, and the general public from chemical exposure. \n\n\n\nFIVE-YEAR ACCIDENTAL RELEASE HISTORY\n\n\n\nThe Brenntag Southwest Houston branch has never had a release resulting in evacuation of the facility. \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThis facility has emergency plans which are coordinated with local fire departments and the Local Emergency Planning Committee (LEPC).  For toxic and flammable products, the company's emergency response plans are based on information from the manufacturers of these materials. The emergency response plans for all company facilities include procedures for notification of potentially affected neighbors, the local fire authority, Federal, State, and Local agencies.\n\n\n\nSUMMARY\n\n\n\nIn order to continue to improve upon its safety record, Brenntag Southwest requires all of its facilities to conduct incident investigations, safety compliance audits, continuous training on normal and emergency procedures, and continuous community outreach actions including: educating and training neighbors, customers, fire departments, and emergency response teams.  These policies, along with improvements that have originated from internal programs such as the Employee Suggestion Program and from external sources such as industrial associations, aid the company in its continuous effort to enhance the safe handling and storage of all of its products.\n\n"
    }
  ]
}