{
  "FacilityID": 1000037509,
  "FacilityName": "Terminal Freezers LLC a Lineage Logistics Company",
  "FacilityStr1": "2525 Ewald Ave SE",
  "FacilityStr2": null,
  "FacilityCity": "Salem",
  "FacilityState": "OR",
  "FacilityZipCode": "97302",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41047",
  "LEPC": "Mid-Valley LEPC",
  "FacilityLatDecDegs": "44.905592",
  "FacilityLongDecDegs": "-123.011745",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.lineagelogistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Lineage Logistics LLC",
  "Company2Name": null,
  "CompanyDUNS": 176869584,
  "Company2DUNS": 0,
  "OperatorName": "Lineage Logistics / Joe Griesenauer",
  "OperatorStr1": "2525 Ewald Ave SE",
  "OperatorStr2": null,
  "OperatorCity": "Salem",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97302",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joe Griesenauer",
  "RMPTitle": "General Manager",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000223395",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-10-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-11-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-11-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-11-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-11-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045958,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000037509,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000046359,
          "ProcessID": 1000045958,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000055581,
          "ProcessID": 1000045958,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000555581,
          "ProcessID": 1000045958,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000037509,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nLineage Logistics operates a refrigerated warehouse facility in Salem, Oregon. As stated on the company's website, \"As the 2nd largest warehousing and logistics provider in the U.S., Lineage Logistics has the scope to serve highly varied customer needs across many different regions. With 60+ facilities and 290 million cubic feet, we already provide solutions for many of the largest food customers in the U.S. We have demonstrated the ability to grow our platform, expand our capabilities, and increase our markets served quickly to meet the needs of our customer base. Built upon a legacy of family values and integrity, our mission is to provide innovative, world-class customer service and a safe, enjoyable workplace. Our vision is to be the world's most dynamic temperature-controlled logistics company.\"\n\n\n\nLineage Logistics senior management is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. Lineage Logistics' safety and environmental policies are administered by the Safety Director. Weekly inspections of the facility are conducted by the facility Operations Manager, Chief Engineer, and Maintenance Operators to ensure compliance and oversee the entire safety and environmental programs. These programs include forklift safety, hazard communications, lockout/tagout, employee safety manuals, manufacturers' documentation, Emergency Action Plan, as well as the Risk Management Plan.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Lineage Logistics facility is located at 2525 Ewald Ave SE, in Salem, Oregon, which is approximately 1.3 miles west of Interstate 5. The area immediately surrounding the facility is mostly urban with some industrial and residential areas. The facility was constructed and began operating in 1984.\n\n\n\nThe primary business of the Lineage Logistics fa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000037509,
      "SummaryText": "cility is to provide refrigerated warehousing and storage for various food products. In order to conduct operations, the facility maintains a refrigeration system containing 11,565 pounds of anhydrous ammonia, a regulated substance. The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for cooler and freezer storage, dock, and production area operations. Typical operating conditions range from 3 psig on the low pressure side of the system to 160 psig on the high side of the system.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n\n\n-EPA's Risk Management Program (RMP); and\n\n-OSHA's Process Safety Management (PSM)\n\n\n\nAdministrative Measures:\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\n-IIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie ins\"\n\n-IIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\"\n\n-IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\n\n-IIAR, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\"\n\n\n\nThe Lineage Logistics ammonia refrigeration system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. For example, the Lineage Logistics facility operates in accordance with the Process Safety Management (PSM) and Risk Management Program (RMP). It is important to note that the refrigeration system has been designed with several safety features"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000037509,
      "SummaryText": " to prevent the accidental release of ammonia. For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits. Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.\n\n\n\nEngineering Measures:\n\nOther safety features of the ammonia refrigeration system include: emergency shutdown switches that kill power to the engine room equipment (located outside the main Engine Room exit door and remotely), relief valves on all pressure vessels, and emergency ventilation in the Engine Room to prevent explosions. The facility has also installed ammonia sensors at strategic locations throughout the facility.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nEPA's RMP regulation defines \"accident\" as the following:\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\nThe release must have caused at least one of the following:\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nA review of the facility's accident history revealed that there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (November 2008 - November 2013). In addition, there have been no releases of ammonia that meet the RMP definition of \"accident\" as described above.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an Emergency Action Plan (plan) in effect at the facility. This Plan was designed to meet the following objectives:\n\n\n\n-save lives;\n\n-minimize and avoid injuries;\n\n-protect the environment; and\n\n-minimize property damage.\n\n\n\nLineage Logistics maintains a PSM committee who meets quarterly. The designated eme"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000037509,
      "SummaryText": "rgency coordinators for the facility are also included within the committee. The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM/RMP regulations.\n\n\n\nLineage logistics maintenance personnel circulate throughout the plant, taking note of unusual conditions in any portion of the system. In the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger, and the Chief Engineer. The Chief Engineer will contact the General Manager, Lineage Logistics Safety Director, and Senior Vice President of Engineering to evaluate and ascertain the significance of the leak. If the ammonia leak is considered minor and/or minimal, the repair will be conducted by the Lineage Logistics refrigeration maintenance staff. An outside refrigeration contractor may be contracted to further assist with the potential repairs to the equipment pertaining to the ammonia system. For major ammonia leaks, emergency agencies will also be notified as necessary as outlined in the Emergency Action Plan. Action is promptly taken to mitigate the leak so normal operations can resume.\n\n\n\nPLAN CHANGES TO IMPROVE SAFETY\n\n\n\nA Process Hazard Analysis (PHA) was performed on August 14, 2012 at the Lineage Logistics facility. This study generated mitigation measures (recommendations) to improve safety at the Lineage Logistics facility located in Salem, Oregon. The mitigation measures include additional training and key maintenance-related tests/inspection. The Lineage Logistics PSM committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000037509,
      "SummaryText": "safe work environment for their employees. These changes include the following items:\n\n\n\n1.    Continue to train all employees in the facility Safety/PSM Plan/Programs\n\n\n\n2.    Continue to have employee involvement in Safety/PSM Plan Development.\n\n\n\n3.    Continue employee involvement through safety team/PSM committee participation.\n\n\n\n4.    Continue internal and external safety/PSM audits/inspections and implement changes as needed.\n\n"
    }
  ]
}