{
  "FacilityID": 1000076793,
  "FacilityName": "Reser's Fine Foods, Inc. - Topeka Baked Plant",
  "FacilityStr1": "3167 SE 10th Street",
  "FacilityStr2": null,
  "FacilityCity": "Topeka",
  "FacilityState": "KS",
  "FacilityZipCode": "66607",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20177",
  "LEPC": "Shawnee County LEPC",
  "FacilityLatDecDegs": "39.036944",
  "FacilityLongDecDegs": "-095.635806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.resers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9026642,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Reser's Fine Foods, Inc.",
  "OperatorStr1": "3167 SE 10th Street",
  "OperatorStr2": null,
  "OperatorCity": "Topeka",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66607",
  "OperatorZipCodeExt": null,
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000128391",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-02-04 00:00:00",
  "SafetyInspectionBy": "Zurich Insurance",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-03-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.0371,
  "FRS_Long": -95.63591,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000095519,
      "AltID": null,
      "FacilityID": 1000076793,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000119400,
          "ProcessID": 1000095519,
          "ChemicalID": 56,
          "Quantity": 25418.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000096783,
          "ProcessID": 1000095519,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000081410,
              "Process_NAICS_ID": 1000096783,
              "SafetyReviewDate": "2019-01-28 00:00:00",
              "PHA_Date": "2016-03-11 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Air Diffusion",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-01-03 00:00:00",
              "TrainingReviewDate": "2018-09-11 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Self study",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-12-14 00:00:00",
              "EquipmentInspectionDate": "2019-02-04 00:00:00",
              "EquipmentTested": "Refrigeration system",
              "ChangeMgmtDate": "2016-03-07 00:00:00",
              "ChangeMgmtReviewDate": "2018-10-29 00:00:00",
              "PreStartupReviewDate": "2017-09-17 00:00:00",
              "ComplianceAuditDate": "2017-12-14 00:00:00",
              "AuditCompletionDate": "2019-10-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-10-01 00:00:00",
              "HotWorkPermitReviewDate": "2018-10-29 00:00:00",
              "ContractorSafetyReviewDate": "2018-10-01 00:00:00",
              "ContractorSafetyEvalDate": "2018-08-26 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000100876,
                  "PreventionProgram3ID": 1000081410,
                  "ProcessChemicalID": 1000119400
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000076793,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "0000000911",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000076793,
      "SummaryText": "1.    EXECUTIVE SUMMARY\n\n\n\n1.1.    Accidental Release Prevention And Emergency Action Policies\n\n\n\n1.1.1.    The Reser's Fine Foods, Inc. Topeka Baked Plant (Reser's Topeka Baked) refrigeration system uses pure anhydrous ammonia (a commonly used refrigerant for industrial systems) as the refrigerant.  Given the quantity handled, anhydrous ammonia is considered a hazardous substance by EPA.  Many of the properties that make ammonia valuable as a refrigerant also requires that precautions and procedures be in place to protect employee and public health and safety during a chemical emergency.  It is the policy of Reser's Topeka Baked to be in compliance with all applicable federal and state rules and regulations.    \n\n\n\n1.1.2.    Safety at our facility is inherent on the manner in which anhydrous ammonia is handled.  While the design of the facility incorporates a multitude of safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.\n\n\n\n1.1.3.    We have a written Process Safety Management (PSM) plan that complies with state and federal regulations.  A crucial component of this plan is the Emergency Action Plan, developed in compliance with the Emergency Action provisions.  The Emergency Action Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.\n\n\n\n1.2.    Facility Description And Substances Handled\n\n\n\n1.2.1.    Reser's Topeka Baked is a food manufacturing facility that stores and distributes refrigerated foods.  Production requires the use of a refrigeration system to preserve the integrity of processed foods.  This refrigeration process uses ammonia as a refrigerant.  Access to the facility is restricted to authorized employees only. Management personnel, visitors and contractors are accompanied by trained personnel of the refrigeration team.\n\n\n\n1.2.2.    The regula"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000076793,
      "SummaryText": "ted substance handled at this facility is anhydrous ammonia.\n\n\n\n1.2.3.    The ammonia refrigeration system maximum inventory is 25,418 pounds of anhydrous ammonia.  There is no standby make-up inventory kept on-site.\n\n\n\n1.3.    The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\n\n\n1.3.1.    Release scenarios were modeled using RMP*Comp (Version 2.01), a software program developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA.  Offsite receptors were defined using the Marplot Map Server.  This system was used to estimate the residential population within the circle defined by the endpoint of the worst-case and alternative release scenarios.  \n\n\n\n1.3.2.    Worst-Case Scenario.  Catastrophic failure of the High Pressure Receiver located outside the compressor room when filled to the greatest amount would release 12,619 pounds of liquid ammonia.  This scenario presumes that the entire contents are released.  \n\n\n\n1.3.3.    The distance to the toxic endpoint for the worst-case scenario is 2.2 miles from the point of release.  This distance extends beyond the facility fence line, and would encompass an estimated population of 26,282.  Within this distance, there are many school, parks, and multiple businesses inside the release zone.\n\n\n\n1.3.4.    This worst-case scenario would not likely occur unless an act of nature (e.g., earthquake) by physically compromising the tank. The structural integrity of the tank is safeguarded by periodic inspection for mechanical integrity to prevent a rupture due to tank degradation.  The tank is also safeguarded from rupture from over-pressurization.  It is a rated pressure vessel hydro-tested to 325 psi and equipped with 250 psi pressure relief valves. The design specification of the tank only allows a maximum capacity of 80% at 95&#61616;F, limiting the total amount of ammonia in the system.  During hi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000076793,
      "SummaryText": "gh demand, the High Pressure Receiver may only be filled to a fraction (~30%) of capacity.  In addition, predominant winds are significantly stronger than input into the modeling program, helping to dispense the vapors more rapidly.  The worst case weather scenarios are uncommon.  \n\n1.4.    Alternative Scenario. \n\n\n\n1.4.1.    Several alternative scenarios can generate the equivalent of a 1\" opening in a high pressure liquid line.  Alternative scenarios could include an opening created by a valve sheared off, a large gasket leak, or a pressure relief valve release.  This scenario presumes a release duration of 10 minutes resulting in a loss of 1,260 pounds of liquid ammonia.  This scenario was selected because a release of this type would occur outdoors resulting in the highest potential exposure to offsite receptors.\n\n\n\n1.4.2.    The distance to the toxic endpoint for the alternative scenario is 0.8 miles from the point of release.  This distance extends beyond the facility fence line, and would encompass an estimated population of 2,965 with the closest residence and schools inside the release zone.  \n\n\n\n1.4.3.    The severity of release from this scenario would likely be less since safety system provisions are in place to limit the release duration to less than ten minutes through the use of appropriately placed isolation valves.  In addition, predominant winds are significantly stronger than input into the modeling program, helping to dispense the vapors more rapidly and effectively reducing the distance to toxic endpoint.\n\n\n\n1.5.    General Accidental Release Prevention Program And Chemical-Specific Prevention Steps \n\n\n\n1.5.1.    Reser's Topeka Baked complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations. The design and construction of this facility was in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.  \n\n\n\n1.5.2.    Reser's written PSM plan incorporates many poli"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000076793,
      "SummaryText": "cies and procedures to ensure safe operation and maintenance of this facility. This plan will be reviewed annually and updated as necessary by the Reser's Topeka Baked PSM Team.\n\n\n\n1.5.3.    Training is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures, and safety considerations. Only qualified maintenance personnel operate and interact with the refrigeration system.  This minimizes the chances of inadvertent error in operation that could lead to a release of ammonia. Startup, shutdown, and any onstream adjustments are handled by these qualified persons.  \n\n\n\n1.6.    Five-Year Accident History\n\n\n\n1.6.1.    There have been no accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage at the Reser's Fine Foods, Inc. Topeka, KS. Baked facility.\n\n\n\n1.7.    Emergency Action Program\n\n\n\n1.7.1.    Reser's Topeka Baked has a written Emergency Action Plan developed to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  It shall comply with provisions Emergency Action regulations.  The Emergency Action Plan includes pre-emergency planning and coordinating with outside parties. This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.  This plan will undergo review with the Topeka Fire & Rescue Department.\n\n\n\n1.7.2.    The approach in the development of this plan has been to identify the ammonia emergencies most likely to occur at Reser's Topeka Baked and establish precautions and procedures to protect life safety and health during an emergency.  The refrigeration process has back-up prevention systems to keep processing malfunctions from becoming ammonia release emergencies.\n\n\n\n1.7.3.    All Reser's personn"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000076793,
      "SummaryText": "el will be trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with plan actions and identify plan elements requiring improvement.\n\n\n\n1.7.4.    This plan will be reviewed annually and updated as necessary by the Reser's Topeka Baked PSM Team.\n\n\n\n1.8.     Planned Changes To Improve Safety\n\n\n\n1.8.1.    All system components meet design specifications for equipment, design, and installation of ammonia mechanical refrigerating systems. All pressure vessels are built according to the appropriate pressure vessel codes. Any upgrades or extensive maintenance work performed in the future will be in compliance with those standards applicable at that time.  \n\n"
    }
  ]
}