{
  "FacilityID": 1000001358,
  "FacilityName": "CEREX Advanced Fabrics, Inc.",
  "FacilityStr1": "610 Chemstrand Road",
  "FacilityStr2": null,
  "FacilityCity": "Cantonment",
  "FacilityState": "FL",
  "FacilityZipCode": "32533",
  "Facility4DigitZipExt": "6857",
  "FacilityCountyFIPS": "12033",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "30.591667",
  "FacilityLongDecDegs": "-087.252222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "OT",
  "FacilityURL": "www.cerex.com",
  "FacilityEmailAddress": "wwhitfield@cerex.com",
  "FacilityDUNS": 877181768,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CEREX Advanced Fabrics, Inc.",
  "OperatorStr1": "610 Chemstrand Road",
  "OperatorStr2": null,
  "OperatorCity": "Cantonment",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32533",
  "OperatorZipCodeExt": "6857",
  "RMPContact": "Bart Warner",
  "RMPTitle": "Engineering & ESH Manager",
  "FTE": 90,
  "OtherEPAFacilityID": "32533JMSRV610CH",
  "EPAFacilityID": "100000155529",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-05-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.57006,
  "FRS_Long": -87.26064,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001755,
      "AltID": "Hydrogen Chloride",
      "FacilityID": 1000001358,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001843,
          "ProcessID": 1000001755,
          "NAICSCode": "31323",
          "_desc": {
            "NAICS_CODE": "31323",
            "NAICS_DESCRIPTION": "Nonwoven Fabric Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001889,
          "ProcessID": 1000001755,
          "ChemicalID": 54,
          "Quantity": 155650.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 54,
            "ChemicalName": "Hydrogen chloride (anhydrous) [Hydrochloric acid]",
            "CASNumber": "7647-01-0",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501889,
          "ProcessID": 1000001755,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001358,
      "SummaryText": "This RMP is submitted by CEREX Advanced Fabrics, Inc. for its nylon nonwoven manufacturing process which uses a regulated substance, anhydrous Hydrogen Chloride (aHCl).  This nonwoven manufacturing process, has been in continuous operation since January, 1970.  The process was originally developed by Monsanto Company in the late '60s and operated by Monsanto until sold to James River Corporation in September, 1985.  Since 1985, the ownership of the nylon manufacturing operation has changed from James River to Fiberweb North America, to CEREX Advanced Fabrics, L.P. (CEREX) in 1994 and purchased as CEREX Advanced Fabrics, Inc. by a holding company in 2000.  During this almost 35 year period of continuous operation, there have been no (zero) accidental releases of aHCl that have had any off-site consequences or required any medical treatment of a CEREX employee.\n\nThis excellent safety record is the result of a proactive safety process that is guided by an overall safety principle to \"...create an injury free work environment and preserve the environment in which we live.\"  The safety process utilizes a team oriented, continuous improvement approach that is based on 3 key elements:\n\n*    Requiring safety planning in the design and implementation of major process upgrades and site projects,\n*    Regularly scheduled training and certification of the aHCl system with our employees, the aHCl supplier and the local emergency response team, and \n*    Seeking out and upgrading the aHCl system with proven technology that reduces the potential for accidental release.\n\nThe CEREX manufacturing site is located adjacent to the Solutia, Inc. (formerly known as Monsanto Company) Pensacola site.  CEREX is an integral part of the Solutia site emergency response system which includes a site wide emergency alarm system, emergency radio communications and first response from Solutia's highly trained industrial emergency response team that has the equipment needed to handle aHCl tank car em"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001358,
      "SummaryText": "ergencies.\n\nThe CEREX aHCl system is registered with the Escambia County Emergency Management and CEREX is actively involved with the Region I Local Emergency Planning Committee through the membership and participation of CEREX's Safety, Health and Environment Manager.\n\nThe anhydrous HCl is transported to CEREX, and stored, in 21,000 gallon, specially designed tank cars that according to the supplier have never had a catastrophic \"burst\" failure such as required to be used in the \"Worst Case Scenario\".  These tank cars are insulated, double steel wall, pressure rated vessels that are maintained in excellent condition by the supplier. CEREX uses one tank car approximately every three (3) months, and reorders when the tank car is estimated to be near empty.  This limits the maximum amount of aHCl on site at any one time to be approximately the same as the full tank car (21,000 gallons or 155,650 pounds).\n\nOver the years, CEREX has implemented system upgrades to prevent an accidental aHCl release including:\n\n*    pressure monitoring of tank car each shift and twice a week reporting of the tank car pressure to the supplier ( a requirement for supplier certification),\n*    a \"drowning/scrubber\" system and an aHCl re-condensing system that can safely reduce tank car pressure without an untreated release to the atmosphere,\n*    installation of new \"bellows seal\" outlet valves on the tank car to eliminate potential fugitive packing leaks commonly associated with the previous type of valve,\n*    Installation, upon railcar arrival of orifice nipples in the outlet valves that limit flows well below the flow capacity of the tank car outlet valves \n*    annual operator training and tri-annual emergency response training with the supplier and Solutia emergency response team, \nand\n*    use of special alloy flexible connection hoses that minimize the potential for hose failures.\n*\n\nIn addition, CEREX has implemented emergency response systems that are designed to detect a minor lea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001358,
      "SummaryText": "k (before it becomes a major release) and provide the means to mitigate the impact of a release on the surrounding community.  These emergency response systems and procedures include:\n\n*    an aHCl multi-point vapor detection and alarm system that surrounds the tank car with 7 independent sensors      \ncalibrated to trigger an alarm at an aHCl concentration of 10 parts per million,\n*    redundant rupture disk and pressure relief valves on both the tank car and the supply pipe system (which would prevent an over pressure \"burst\" scenario),\n*    a remotely activated \"fail safe\" emergency block valve that can isolate the supply piping system in the event of a pipe system failure, \n*    being an integral part of the site wide Solutia emergency alarm system providing very fast response of the highly trained emergency response team, \n*    installed emergency block valves at the inlet end of the flexible hoses to provide the capability of isolating the flex hose from the tank car and \n*    on site emergency response equipment including the \"C\" kit for containing tank car dome leaks.\n\nAs dictated by the requirements of the Risk Management Rule, CEREX has developed a \"WORST CASE SCENARIO\" for the HCl tank car that would release the entire 21,000 gallons of aHCl in a 10 minute time frame without any response action or mitigation.  In this highly unlikely scenario, the resulting release could impact the community up to 16 miles from CEREX's site.  CEREX believes the worst case scenario to be an extremely remote possibility due to the incredible release rate required (over 15,000 pounds per minute) which significantly exceeds the evaporation rate for the liquid aHCl and the fact that according to the supplier, no aHCl tank car has ever \"burst open\" as would be required in this scenario.\n\nThe \"ALTERNATIVE SCENARIO\", which CEREX believes is much more realistic, is failure of the flexible tank car unloading hose (1A?).  In this scenario, the release rate would be limited by the sa"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000001358,
      "SummaryText": "fety orifice nipples installed by CEREX in the tank car outlet valves. The maximum time for this release would be limited by the actions required to activate an on-site emergency response. The ALTERNATIVE SCENARIO is dependent on a A?doubleA? failure; 1) unloading hose failure and 2) failure of the manually activated Emergency Block Valves (EBV's) to close.  CEREX believes that a 30 minute time frame is adequate for the emergency response team to be notified, respond, assess the situation and shut off the manual tank car valves in the event our EBV's have failed to shut off tank car flow.   The total release would be approximately 600 pounds, potentially impacting a surrounding radius of 0.1 miles.\n"
    }
  ]
}