{
  "FacilityID": 1000049324,
  "FacilityName": "Penske Logistics",
  "FacilityStr1": "2842 Spiegel Dr",
  "FacilityStr2": null,
  "FacilityCity": "Groveport",
  "FacilityState": "OH",
  "FacilityZipCode": "43125",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39049",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "39.84044",
  "FacilityLongDecDegs": "-82.93274",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Penske Logistics",
  "Company2Name": null,
  "CompanyDUNS": 126949747,
  "Company2DUNS": 0,
  "OperatorName": "Penske Logistics",
  "OperatorStr1": "2842 Spiegel Drive",
  "OperatorStr2": null,
  "OperatorCity": "Groveport",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43215",
  "OperatorZipCodeExt": null,
  "RMPContact": "Christopher Hawk",
  "RMPTitle": "Environmental Engineer",
  "FTE": 200,
  "OtherEPAFacilityID": "560501074",
  "EPAFacilityID": "100000211255",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-03-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-10-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-04-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-04-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-04-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061840,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000049324,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000063000,
          "ProcessID": 1000061840,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000075942,
          "ProcessID": 1000061840,
          "ChemicalID": 56,
          "Quantity": 15600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000575942,
          "ProcessID": 1000061840,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000049324,
      "SummaryText": "This document contains all required information to meet compliance with EPA's 40 CFR 68, Risk Management Program, including an Executive Summary and RMP data elements (68.155 through 68.185). \n\n\n\n1.0   Release Prevention and Emergency Response Policies\n\nThe Penske Logistics facility in Groveport, Ohio has a very good record in preventing and minimizing releases of anhydrous* ammonia. The facility has not had any ammonia releases. The facility has conducted and documented PHA and self-audits and responded to the findings by making appropriate compliance enhancements as they are identified. In addition, DHL has implemented, and Penske Logistics Groveport has incorporated it's own Ammonia Refrigeration Management System (ARMS). \n\n* From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\n\nThe emergency response policies at this facility ensure that there is emergency response coverage 24 hours A 7 days per week. There are also adequate provisions for coordination with outside agencies in the event of an emergency. Each year a team of facility associates and the Groveport Fire department participates in a facility walk through / familiarization at the Penske Logistics facility.\n\n\n\n2.0   Process Description and Regulated Substances\n\nThe Groveport DHL facility is a warehouse/distribution center for Penske Logistics food products. The North American Industry Classification System (NAICS) code for the primary process at this facility is 49312. Several areas of the plant are refrigerated to store the finished products.  Penske Logistics has one regulated substance under 40 CFR 68: Anhydrous ammonia. Ammonia is used as a refrigerant in the refrigeration of the stored products in the various locations within the facility.\n\n\n\n3.0   General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThis facility has developed an OSHA PSM program for their ammonia refrigeration system. Ammonia falls under the RMP Program 3 pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000049324,
      "SummaryText": "evention program, which is identical to the OSHA PSM program. EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP Program.   Thus, Penske Logistics ammonia PSM has been reviewed and determined to be complete for the RMP document.\n\n\n\nThere are several aspects of the prevention program that are key:\n\n1. To protect the piping and evaporators from being impacted by heavy machinery or plant personnel the piping has been installed on the roof of the building.\n\n2. The plant maintains good training, certification and employee awareness of operating procedures.\n\n3. The ammonia system contains state of the art controls and equipment.\n\n4. The plant has installed an ammonia detection system that controls all refrigerated spaces, in the machine room, and on the relief line. The ammonia detection system also monitors the exhaust fans.\n\n5. The plant is monitored by monitoring company 24 hours a day and 7 days a week, to insure access to the plant is limited to Penske Logistics and authorized personnel.\n\n6. The ammonia detection alarms are monitored by a contracted alarm company.\n\n7. The ammonia system is visually inspected on a regular basis and is self-monitoring.\n\n8. The ammonia system controls can be monitored at home or any location by the primary system operator through a personal computer.\n\n9. All the relief valves located inside the Machine Room are piped to a common header that releases to the atmosphere.\n\n10. The ammonia detection system is inspected on an annually basis by a certified contractor and the fire system equipment on a quarterly basis.\n\n\n\n4.0   Five-year Accident History\n\nTo date, there have been no reportable accidents involving the ammonia process.\n\n\n\n5.0   Emergency Response Program\n\nThe Penske Logistics Groveport plant has developed an emergency response program comprised of three elements: emergency communications, emergency evacuation procedures and an off-site plan. Separate documents, or plans, were produc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000049324,
      "SummaryText": "ed to define the policies and procedures at the Groveport Plant. The plans were also written to identify to the plant employees what precautions and steps should be taken in the event of the release of a hazardous substance. The combination of the three documents yields a comprehensive Emergency Response Program document. The following paragraphs discuss briefly the contents of each of the three specified documents.\n\nThe emergency communications document is written to establish procedures to notify appropriate agencies (like the Madison Township Fire Department) and trained emergency response team members in the event of an emergency. Company response team members can be notified by phone and through alarm company monitors. The emergency evacuation procedures are designed to provide an orderly, effective plan of action for protecting employees in emergency situations when an evacuation is necessary.\n\nThe off-site plan was written to identify the hazardous chemicals on-site and their respective quantities; the primary emergency responder site diagrams; support available at/from the facility; and a hazard analysis (off-site consequences and affected area, including receptors).\n\n\n\n6.0   Planned Changes to Improve Safety\n\nThe facility will continue to utilize PSM / RMP Audits, PHA programs and protocols as well as the Penske Logistics (ARMS) Ammonia Refrigeration Management System to capture and respond to opportunities to enhance the safety and operation of the system.\n\n"
    }
  ]
}