{
  "FacilityID": 1000104626,
  "FacilityName": "Belridge Gas Processing Plant and Cogen Facility",
  "FacilityStr1": "20322 7th Standard Road",
  "FacilityStr2": null,
  "FacilityCity": "McKittrick",
  "FacilityState": "CA",
  "FacilityZipCode": "93251",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.449111",
  "FacilityLongDecDegs": "-119.733414",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.aeraenergy.com",
  "FacilityEmailAddress": "rmpinformation@aeraenergy.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Aera Energy LLC",
  "Company2Name": null,
  "CompanyDUNS": 615055985,
  "Company2DUNS": null,
  "OperatorName": "Aera Energy LLC",
  "OperatorStr1": "P.O. Box 11164",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93389",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": "CAD000627992",
  "EPAFacilityID": "100000151006",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "S-1547-151",
  "SafetyInspectionDate": "2021-02-18 00:00:00",
  "SafetyInspectionBy": "County Environmental Health",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Belridge Gas Plant and Cogen",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-03-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-03-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-03-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-03-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 35.44941,
  "FRS_Long": -119.735012,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R02",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000130446,
      "AltID": "Cogen Ammonia",
      "FacilityID": 1000104626,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000163594,
          "ProcessID": 1000130446,
          "ChemicalID": 56,
          "Quantity": 155000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131883,
          "ProcessID": 1000130446,
          "NAICSCode": "21112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000112395,
              "Process_NAICS_ID": 1000131883,
              "SafetyReviewDate": "2021-09-13 00:00:00",
              "PHA_Date": "2018-05-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "External events, Human Factors",
              "PHACompletionDate": "2019-05-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Concrete secondary containment, Fire monitors, and NH3 detectors",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-12-02 00:00:00",
              "TrainingReviewDate": "2022-03-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Worker competency through Learning Solutions",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-02-28 00:00:00",
              "EquipmentInspectionDate": "2022-02-28 00:00:00",
              "EquipmentTested": "Ammonia Storage Detectors calibration",
              "ChangeMgmtDate": "2019-10-05 00:00:00",
              "ChangeMgmtReviewDate": "2022-01-27 00:00:00",
              "PreStartupReviewDate": "2019-10-05 00:00:00",
              "ComplianceAuditDate": "2021-09-23 00:00:00",
              "AuditCompletionDate": "2022-04-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-06-29 00:00:00",
              "HotWorkPermitReviewDate": "2020-09-30 00:00:00",
              "ContractorSafetyReviewDate": "2022-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2022-05-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000141220,
                  "PreventionProgram3ID": 1000112395,
                  "ProcessChemicalID": 1000163594
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000130447,
      "AltID": "Secondary Refrigeration",
      "FacilityID": 1000104626,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000163595,
          "ProcessID": 1000130447,
          "ChemicalID": 98,
          "Quantity": 22458.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131884,
          "ProcessID": 1000130447,
          "NAICSCode": "21112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104626,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-03-31 00:00:00",
    "ERTrainingDate": "2022-03-31 00:00:00",
    "CoordinatingAgencyName": "Kern County Fire Department",
    "CoordinatingAgencyPhone": "6613917000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104626,
      "SummaryText": "Aera Energy LLC, Belridge Operations\nBelridge Gas Processing Plant and Cogen Facility\nRisk Management Plan Executive Summary\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nAera Energy's Belridge Gas Processing, Secondary Refrigeration System (Program Level 1) and Cogen Facility SCR Ammonia (Program Level 3) has a commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our gas processing facility. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, plant personnel will respond to control and contain the release.\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Gas Plant and Cogen Facility located near 19590 7th Standard Rd in McKittrick , California compresses and dehydrates natural gas products from oil and gas wells at Aera Energy's Belridge production field and produces steam and electricity from the Cogeneration plant. The natural gasoline products are removed from the produced gas and sent to a treating facility and blended with the crude oil. The Cogen facility produces electricity and steam from gas turbines and stores Anhydrous Ammonia for use in NOx reduction of Turbine exhaust. \n\n\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\n\nAmmonia\nThe EPA RMP Comp worst-case scenario (WCS) is a release of 51,667 lbs of anhydrous ammonia in 10 minutes, having a release endpoint of 4 miles. The EPA RMP Comp alternative release scenario (ARS) is a transfer hose failure with a release rate of 695 lbs per minute, for 30 minutes with a distance end point of 0.26 miles.\n\nSecondary Refrigeration \nThe secondary refrigeration system utilizes propane as the refrigerant, to dehydrate and drop out light liquid hydrocarbons from the produced natural gas.  The light ends consist of water, butane, pentane and he"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104626,
      "SummaryText": "xanes.  The EPA RMP Comp WCS is a release of 17,880lbs of propane from the accumulator with a Vapor Cloud Explosion (VCE) end point of 1psi at 0.2 miles.  The EPA RMP Comp ARS is a transfer loading hose failure with a vapor cloud fire at less than 0.1 mile (approximately 190 feet).\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the facility, which is regulated by Environmental Protection Agency's (EPA) risk management program (RMP) Cal/OSHA's process safety management (PSM). This summary addresses each of the PSM elements and describes the management system in place to implement the accident prevention plan.\n\nMANAGEMENT SYSTEM FOR RMP\n\nAera Belridge gas plant/Cogen has developed a management system to define all elements required by the process safety standard and risk management program. The management system defines for each program element the following:\n\n1.\tPurpose and scope of element\n2.\tSpecific procedures\n3.\tResponsible and accountable personnel using a RACI (responsible, accountable, consult, and inform) chart\n4.\tVerification and measurement metrics\n5.\tFeedback mechanism\n6.\tDocument locations for applicable documents\n\nThe management system is available for review at either facility.  This requirement is also met by the Injury and Illness Prevention Program.\n\nEmployee Participation\n\nThe Belridge Gas Plant and Cogen encourages employees to participate in all facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information, to participating as a member of a process hazard analysis (PHA) team and MOCs. Employees have access to all information created as a part of the Belridge gas plant accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in the employee participation plan that is maintained at the facility and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104626,
      "SummaryText": "addresses each accident prevention program element. \nProcess Safety Information\n\nThe Belridge Gas Plant and Cogen keep a variety of technical documents that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. Specific personnel within the facilities are assigned responsibility for maintaining up-to-date process safety information. \n\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations is provided in safety data sheets (SDS's). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals. For specific process areas, the facility has documented safety-related limits for specific process parameters (e.g. pressure, tank levels, temperature) in a key process parameter document. The facility ensures that process is maintained within these limits using process controls, and monitoring instruments, trained personnel, automated shutdown systems.\n\nThe facility maintains numerous technical documents that provide information about the design and construction of process equipment. The information includes materials of construction, design pressure, temperature ratings, and electrical ratings of equipment. This information, in combination with written procedures and trained personnel, provides the basis for establishing inspection and maintenance activities, as well as evaluating proposed process and facility changes to ensure that safety features are not compromised.\n\nProcess Hazard Analysis (PHA)\n\nThe Belridge Gas Plant and Cogen have a comprehensive program to ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to id"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104626,
      "SummaryText": "entify hazards and ensure that adequate safeguards are in place to manage these hazards.\n\nAera\u0092s Section 32 Cogen Facility uses the hazard and operability (HAZOP) analysis technique to perform these evaluations. HAZOP analysis in recognized as one of the most systematic and thorough hazard evaluation techniques. The Gas Plant uses HAZOP methodology for its hazard evaluation technique. The analyses are conducted by a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures. The team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. \n\nThe PHA team\u0092s findings are forwarded to local management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. The ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options are tracked until they are completed. The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from original design safety features, the facility periodically update and revalidate the hazard analysis results. The periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. \n\nIn 2016, the Gas Plant Processing and Storage process stream was deactivated, placed out of service and delisted from EPA RMP and Cal ARP programs.  The process units were purged and inerted.   In March 2023, the Secondary Refrigeration system was reactivated.  This system dehydrates the gas and drops out natural gasoline liquids.  The liquids are sent to a oil treating facility.  The dehydrated gas is consumed as fuel fo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000104626,
      "SummaryText": "r field operations.\n\nThe remainder of the process, fractionation, storage, and loading are idle and out of service.\n\nOperating Procedures\n\nThe Belridge Gas Plant and Cogen maintain written procedures that address various modes of process operations, such as (1) unit start up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process, (7) safe upper and lower operating limits, (8) consequence of deviation. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process.\n\nSecondary Refrigeration operating procedures were reviewed and revalidated prior to commissioning this system.\n\nTraining\n\nTo complement the written procedures for process operations, Aera's facilities have implemented a comprehensive training program for all employees involved in operating a process. New employees receive basic training in plant operations, if they are not already\nfamiliar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. After operators demonstrate (e.g. through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years. All this training is documented for each operator, including the means used to verify the operator understood the training.\n\nOperating personnel were trained on the Secondary Re"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000104626,
      "SummaryText": "frigeration operating procedures and other affected procedures prior to commissioning this system.\n\n\nContractors\n\nAera Energy uses contractors to supplement its workforce for maintenance, inspection, and construction activities. Because some of the contractors work on or near process equipment, Aera's facilities have procedures in place to ensure contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand and follow site safety rules, and (5) inform gas plant personnel of any hazards that they may find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work. In addition, Aera evaluates contractor safety programs and performance during the selection of a contractor. Plant personnel periodically monitor and audit contractor performance to ensure that contractors are fulfilling their safety obligations through the internal safety and environmental auditing process.\n\nPre-startup Safety Reviews (PSSR's)\n\nAera Energy conducts a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing equipment into service. The review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention programs are properly implemented.\n\nMaintenance and Mechanical Integrity\nAera's facilities hav"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000104626,
      "SummaryText": "e established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems are in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a process that maintains the mechanical integrity of the process.\n\nPersonnel involved in maintenance activities receive training on (1) overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to ensure that they can perform their job in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g. adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back in service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance. Aera Operations incorporate quality assurance measures into the equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\nSafe Work Practices\nAera's safe work practices are in place to help ensure worker and process safety. Examples of these include: (1) control of the entry/presence/exit of support personnel, (2) an energy control  procedure to ensure the safe isolati"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000104626,
      "SummaryText": "on of energy sources for equipment undergoing maintenance, (3) procedures for safe removal of hazardous substances before process piping or equipment is opened, (4) a Hot Work Permit and procedure to control spark-producing activities, and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training affected personnel, form a system to help ensure that operations and maintenance activities are performed safely through Aera\u0092s Control of Work Process. \n\nManagement of Change\n\nAera has a comprehensive system to manage changes to all covered processes. The system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to: (1) ensure adequate controls are in place to manage any new hazards, and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change.\n\nIncident Investigation\nAera investigates incidents that result in or could have potentially resulted in a serious injury or fatality, which includes near misses. The goal of each investigation is to determine the facts, identify causal factors and root causes, and then develop corrective actions to prevent a recurrence of the incident or a similar incident. Aera uses the Taproot Root or Cause Mapping methodology for this level of incident investigation. The investigation team documents its findings, develops recommendations to prevent recurrence, and forwards these results to local management for resolution. Corrective actions taken in response to the investigation teams"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000104626,
      "SummaryText": "findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so reports can be reviewed during future PHA's and PHA revalidation.\n\nCompliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, Aera periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. Both hourly and staff personnel participate as audit team members. The audit team develops findings that are forwarded to local management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are\nretained.\n\n\nCHEMICAL-SPECIFIC PREVENTION FEATURES\nThe Belridge Gas Plant and Cogen facility is managed to ensure continued safe operation. The following is a description of the existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUNIVERSAL PREVENTION ACTIVITIES\n\nThe accident prevention program summarized previously is applied to all RMP-covered processes at Aera\u0092s Belridge Operations. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nSPECIALIZED SAFETY FEATURES\n\nThe Belridge Cogen facility has safety features to help (1) contain/control a release, (2) quickly detect a release, and (3) to reduce the consequences of a release. The following types of safety features are used in the covered processes:\n\nRELEASE DETECTION\n1.\tAmmonia fixed gas detectors are located at the Cogen"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000104626,
      "SummaryText": "Ammonia Storage area that activate deluge system on high detection limit\n2.\tLow pressure alarms and subsequent actuation of shutdown valves (SDV\u0092s).\n3.\tLEL Gas detection sensors are located at the compressor section and secondary refrigeration system, and cooling tower.\n4.\tUV/IR flame detection in the process area\n\nRELEASE CONTAINMENT / CONTROL\n1.\tAutomated shutdown systems for specific process parameters\n2.\tSecondary containment for anhydrous ammonia storage\n3.\tRedundant equipment and instrumentation (UPS for process control system, generator, process monitoring and actuation capability)\n4.\tFlare system for relief and depressurization\n5.\tAn 8 psi overpressure control room was installed per API 752\n6.\tFixed deluge system back up by fire monitors \n\nRELEASE MITIGATION\n1.\tFixed deluge system back up by fire monitors at the Cogen Ammonia Storage Area \n2.\tVideo Surveillance of plant operations\n3.\tFixed monitors and hydrants at the gas processing areas.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Belridge Gas Plant and Cogen facility has had an excellent record of accident prevention over the last 5 years with no reportable incidents.\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\nAera Energy maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment. The program includes Pre-Incident Planning and Emergency Response procedures (PIPERs) for responding to a release. The plans address response for credible events, including proper first aid and medical treatment for exposures, evacuation plan and accounting for personnel after an evacuation, notification of local emergency response agencies, post incident clean up and decontamination. Primary public response agencies are the Kern County Fire Department and Kern County Environmental Health.\n\nIn addition, personnel assigned Incident Command duties are trained in Incident Command system and participate in drills and simulations. In addition, both plants have scheduled proce"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000104626,
      "SummaryText": "dures that address the maintenance, testing, and inspection of emergency response equipment. All Aera operation personnel attend annual health and safety training which involves classroom, field simulations and scenarios. The emergency action plan is updated when necessary, based upon modifications to the plants or facilities.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\nThere are no planned changes to the Belridge Gas Plant or Cogen processes."
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000104626,
      "SummaryText": null
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000104626,
      "SummaryText": null
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000104626,
      "SummaryText": null
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000104626,
      "SummaryText": null
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000104626,
      "SummaryText": null
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000104626,
      "SummaryText": null
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000104626,
      "SummaryText": null
    }
  ]
}