{
  "FacilityID": 1000094272,
  "FacilityName": "R & F Ag Center",
  "FacilityStr1": "4002 West 600 North",
  "FacilityStr2": null,
  "FacilityCity": "Anderson",
  "FacilityState": "IN",
  "FacilityZipCode": "46011",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18095",
  "LEPC": "Madison County LEPC",
  "FacilityLatDecDegs": "40.193611",
  "FacilityLongDecDegs": "-085.748333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Co-Alliance Cooperative, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Co-Alliance Cooperative, Inc.",
  "OperatorStr1": "5250 E US Hwy 36",
  "OperatorStr2": null,
  "OperatorCity": "Avon",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46123",
  "OperatorZipCodeExt": null,
  "RMPContact": "Julie Lamberson",
  "RMPTitle": "Safety Coordinator",
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000037925",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-27 00:00:00",
  "SafetyInspectionBy": "Indiana State Chemist",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.19368,
  "FRS_Long": -85.77294,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117005,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 1000094272,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000118416,
          "ProcessID": 1000117005,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146376,
          "ProcessID": 1000117005,
          "ChemicalID": 56,
          "Quantity": 607999.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000646376,
          "ProcessID": 1000117005,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094272,
      "SummaryText": "              Risk Management Plan (RMP) - Ammonia\n\n                       Executive Summary\n\n                      R & F Ag Center \n\n                      Anderson, Indiana         \n\n                                \n\n                                \n\n  1. Accidental Release Prevention and Emergency Response Policies\n\nWe at R & F Ag Center in Anderson, Indiana are strongly committed to employee, public, and\n\nenvironmental safety.  This commitment is an inherent part of our comprehensive accidental release\n\nprevention program that covers areas such as design, installation, operating procedures, maintenance,\n\nand employee training associated with the processes at our facility.  It is our policy to implement\n\nappropriate controls to prevent possible releases of regulated substances.  We coordinate our\n\nresponse efforts with the Frankton Fire Department, which provides additional emergency response\n\nexpertise.\n\n\n\n  2. Stationary Source and Regulated Substances Handled\n\nOur facility's primary activities include support services for crop production.  We have anhydrous\n\nammonia stored in one 30,000-gallon stationary tank, one 60,000-gallon stationary tank, one 40,000 gallon tank, forty 1,000-gallon nurse tanks and forty-six\n\n1,500-gallon nurse tanks at our facility in Anderson, Indiana (Figure 1).  The maximum amount\n\nstored is 203,150 gallons (947,451 pounds).   The largest single storage vessel at our\n\nfacility (the 60,000 gallon tank) contains 237,854 pounds at  85% standard maximum storage capacity.\n\n\n\n  3. Worst Case Release and Alternative Release Scenarios\n\n  4. General Accidental Release Prevention Program\n\nOur facility has taken all the necessary steps to comply with the EPA's accidental release prevention\n\nrequirements as set forth in 40 CFR part 68.  The following sections briefly describe the elements\n\nof the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nR & F Ag Center maintains a detailed record of safety"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094272,
      "SummaryText": " information that describes the chemical\n\nhazards, operating parameters, and equipment designs associated with all processes (Appendix E).\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\n\nidentified and controlled effectively.  Any findings from the hazard analysis are addressed in a timely\n\nmanner.\n\n\n\nOperating Procedures\n\nR & F Ag Center maintains written operating procedures to ensure that activities within our\n\ncovered processes are conducted safely.  These procedures address various modes of operation; the\n\ninformation is regularly reviewed and is readily accessible to operators involved in the processes\n\n(Appendix B).\n\n\n\nTraining\n\nR & F Ag Center has a comprehensive training program in place to ensure that employees who\n\nare operating processes are competent in the operating procedures associated with these processes.\n\n\n\nMechanical Integrity\n\nR & F Ag Center conducts documented maintenance checks on process equipment to ensure\n\nproper operation.  Maintenance checks are conducted by qualified personnel with previous training\n\nin maintenance practices.  Examples of process equipment that would receive maintenance checks\n\ninclude:  pressure vessels, storage tanks, piping systems, relief and vent systems, emergency\n\nshutdown systems, controls, and pumps.  Any equipment deficiencies identified by the maintenance\n\nchecks are corrected in a safe and timely manner (Appendix C).\n\n\n\nManagement of Change\n\nWritten procedures are in place at R & F Ag Center to manage changes in process chemicals,\n\ntechnology, equipment, and procedures.  Process operators, maintenance personnel or other\n\nemployees whose job tasks are affected by a modification in process conditions are promptly notified\n\nof the modification and offered training to deal with it.\n\n\n\nPre-startup Reviews\n\nR & F Ag Center routinely conducts pre-startup safety reviews related to new processes and\n\nmodifications in established process"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094272,
      "SummaryText": "es.  These reviews are conducted to confirm that construction,\n\nequipment, and operating and maintenance procedures are suitable for safe startup prior to placing\n\nequipment into operation.\n\n\n\nCompliance Audits\n\n R & F Ag Center conducts compliance audits on a regular basis to determine whether the plan's\n\nprovisions, set out under the 40 CFR part 68, are being implemented.  Any non-compliance issue\n\ndiscovered during the audit is promptly corrected.\n\n\n\nEmployee Participation\n\n R & F Ag Center truly believes that process safety management and accident prevention is a team\n\neffort.  Company employees are strongly encouraged to express their views concerning accident\n\nprevention issues and to recommend improvements.  In addition, our employees have access to all\n\ninformation created as part of the facility's implementation of the RMP, particularly information\n\nresulting from process hazard analyses.\n\n\n\n  5. Five-year Accident History\n\nR & F Ag Center has had an excellent record of preventing accidental releases over the last 5\n\nyears.  Due to our stringent release prevention policies, no accidental release has occurred during this\n\nperiod.\n\n\n\n  6. Emergency Response Plan\n\nR & F Ag Center maintains a written emergency action plan to deal with accidental releases of\n\nhazardous materials.  The plan addresses all aspects of emergency response including first aid and\n\nmedical treatment, evacuations, and in the event of an accidental release, R & F Ag Center will\n\ncontact local emergency response agencies and the public (Appendix A). R & F Ag Center\n\nmaintains a written emergency action plan which is coordinated with the local fire department and\n\nthe LEPC.  The plan is intended to assist responding agencies to address all aspects of emergency\n\nresponse including first aid and medical treatment, evacuations, and notification of local emergency\n\nresponse agencies and the public.\n\n\n\n  7.  Planned Changes to Improve Safety\n\nWe will continue to provide our employees with ongoin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094272,
      "SummaryText": "g annual training to ensure that they are\n\ncurrent with all of the safe ammonia transfer and handling procedures, and provide regular inspection\n\nand maintenance on all of the ammonia equipment.  Authorized personnel will make changes to the\n\nfacility if any audits of the facility identify non-compliance with Section 112 (r)(7), Accidental\n\nRelease Prevention Requirements of the Clean Air Act."
    }
  ]
}