{
  "FacilityID": 1000049497,
  "FacilityName": "Aleutian Propane Sales, Inc.",
  "FacilityStr1": "156 Biorka Dr.",
  "FacilityStr2": "P.O. Box 920046",
  "FacilityCity": "Dutch Harbor",
  "FacilityState": "AK",
  "FacilityZipCode": "99692",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "02016",
  "LEPC": "Director Jamie Sunderland",
  "FacilityLatDecDegs": "53.2253",
  "FacilityLongDecDegs": "-166.3",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 829182484,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pamalee S. Gilman",
  "OperatorStr1": "113 Chernofski Dr",
  "OperatorStr2": "P.O. Box 920046",
  "OperatorCity": "Dutch Harbor",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99692",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000229326",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "N/A due to rural area",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-05-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-05-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-05-06 00:00:00",
  "DeRegistrationEffectiveDate": "2019-09-03 00:00:00",
  "AnniversaryDate": "2020-05-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000062648,
      "AltID": "Propane",
      "FacilityID": 1000049497,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000077414,
          "ProcessID": 1000062648,
          "ChemicalID": 98,
          "Quantity": 53633.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000063771,
          "ProcessID": 1000062648,
          "NAICSCode": "45431",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000049497,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2015-03-01 00:00:00",
    "ERTrainingDate": "2015-04-01 00:00:00",
    "CoordinatingAgencyName": "PERS",
    "CoordinatingAgencyPhone": "8007282482",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000049497,
      "SummaryText": "\n\nRMP EXECUTIVE SUMMARY\n\n\n\nAleutian Propane Sales facility is located in the southwestern area of Alaska, on Unalaska Island in the Aleutian Islands, eight hundred forty air miles southwest of Anchorage, Alaska.\n\n\n\nAleutian Propane Sales is a full service propane dealer. At our facility we fill propane tanks and cylinders of various sizes for homeowners, contractors, and the seafood industry. We provide delivery service to homeowners, restaurants, and other businesses.\n\n\n\nThe regulated substance that is handled and stored at our facility is propane (LP Gas).  Our facility has the capacity to store 53,633 gallons of propane, although we normally store approximately 20,000 gallons at one time.  Our inventory varies depending on receipt of propane shipment and seasonal high and lows usage rates throughout the year.\n\n\n\nOur worst case scenario would be if a hose or valve were to leak on our 10,800-gallon tank.  This tank when filled to maximum capacity eighty seven per-cent (87%) would have nine thousand-four hundred and fifty gallons (9,450) of propane.  \n\n\n\nWe have conducted our own modeling along with our supplier and believe that there would not be any off site impact to the community if there were a propane leak.  We have based this on the following, the wind conditions in our area are constant in that there is always a breeze coming off the ocean, which would dissipate the propane vapor reducing the chances of an explosion or fire.  Secondly the only time propane gas is transferred from tank to tank is when a trained person is doing it.  At no time is any propane valve ever opened unless a trained individual is present and is performing the transfer.\n\n\n\nIf a leak were to occur, the amount to propane would be less than one hundred gallons (100) due to the onsite individual that is overseeing the process of transferring of propane.  All of our personal are trained in the operation of emergency shut off valves, and their location.  All of our tanks are equipped with e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000049497,
      "SummaryText": "mergency shut off valves.  All of the propane storage tanks at our facility are protected from vehicular contact.  Our thousand (1000) gallon tanks and our ten thousand-eight hundred water capacity (10,800) gallon tanks along with all equipment are protected by a fence.\n\n\n\nAll equipment is checked on a daily basis and again prior to its use.  All of our equipment is inspected on a regular basis and is documented on a maintenance form.  \n\n\n\nAll procedures for transferring propane or using propane-related equipment are written in the company procedures.\n\n\n\nThe layout of our facility is in accordance with the State of Alaska Fire Marshall, the City of Unalaska's Fire Department and NFPA 54.  \n\n\n\nAll of our propane transferring is in accordance with NFPA and OSHA.\n\n\n\nIn over twenty (20) years of operation, there has never been a reportable accident at the APS Facility.\n\n\n\nIf a propane leak were to occur our procedures require that the onsite individual that observes the leak is to stop the leak by operating the emergency shut off valve.  When the leak has been stopped then notify the company owners and the local Public Safety Department.  If the leak is unable to be shut down then the Public Safety Department is to be notified immediately.  The local Public Safety Department would perform any public alert notification.  \n\n\n\nOperational safety and public safety is a primary concern at Aleutian Propane Sales.  We are continually reviewing our maintenance and safety procedures, and we are continually seeking ways to improve our operation in the areas of safety.\n\n\n\nA copy of our operational procedures, safety procedures, and maintenance forms are available for review by contacting Aleutian Propane Sales at the following:\n\n\n\nAleutian Propane Sales, Inc.\n\nPO Box 920046\n\nDutch Harbor, AK  99692-0046\n\n\n\nEMERGENCY PROCEDURES\n\n\n\nIF A PROPANE LEAK OCCURS\n\n\n\n1. Shut down tank as quickly as possible.\n\n2. Shut off all equipment (i.e. Pumps or Compressors)\n\n3. Make sure that the leak "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000049497,
      "SummaryText": "has been stopped.\n\n4. Contact and notify: Jim Gilman @359-3683, Pam Gilman @359-3684, Celia Abarca @359-5048.\n\n5. If the leak cannot be stopped contact the Unalaska Department of Public Safety @581-1233 and tell them, YOU HAVE A PROPANE LEAK THAT YOU CAN NOT CONTROL AND STOP or call 911. Then call Jim Gilman @359-3683, Pam Gilman @359-3684, or Celia Abarca @359-5048.\n\n6. While the leak is present, DO NOT turn on or use any equipment that uses or is powered by electricity.\n\n7. Stand by until the Public Safety Department personal arrive and let them know where the leak is and cooperate with them in any way they ask or that you can.\n\n8. Keep all vehicles and people away from the area while leak is being stopped.\n\n9. Document (write down) what you were doing when the problem occurred, the time of the problem and what you did to correct the problem.\n\n\n\nWorkplace Safety Program \n\n\n\nALEUTIAN PROPANE SALES, INC.\n\n\n\nElement 1 - Safety Orientation:  Each employee will be given a safety orientation by James Gilman when first hired.  The orientation will cover the following items:\n\n\n\n1. A description of the workplace safety program:\n\n? We have a formal written workplace safety program.\n\n? It consists of this safety orientation and employee safety meetings as described below.\n\n? We also have basic safety rules that all employees must follow. They are:\n\n\n\n? Never do anything that is unsafe in order to get the job done.  If a job is unsafe, report it to your supervisor.  We will develop a safe way to do that job.\n\n? Do not remove or disable any safety device!  Keep guards in place at all times on operating machinery. \n\n? Never operate a piece of equipment unless you have been trained and are authorized.\n\n? Use your personal protective equipment whenever it is required.\n\n? Obey all safety warning signs.\n\n? Working under the influence of alcohol or illegal drugs or using them at work is prohibited.\n\n? Do not bring firearms or explosives onto company property.\n\n? Smoking is not permi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000049497,
      "SummaryText": "tted on company premises or in company vehicles.\n\n? Horseplay, running and fighting are prohibited.\n\n? Clean up spills immediately.  Replace all tools and supplies after use.  Do not allow scraps to accumulate where they will become a hazard. Good housekeeping helps prevent accidents.\n\n\n\n2. How and when to report injuries.  Where first aid facilities are located.\n\n? If you are injured or become ill on the job, report this to Pamalee Gilman, President of Aleutian Propane Sales, Inc.\n\n? There is a first aid kit located in the office and in each vehicle.\n\n? We require all supervisors to have first-aid/CPR training effective 1/1/2014.\n\n? We have also posted emergency phone numbers in the office and shop.\n\n\n\n3. How to report unsafe conditions and practices.\n\n? If you see something that is unsafe or someone working unsafely, immediately report it to Pamalee Gilman.\n\n\n\nFire Emergency\n\n? You will be trained on how to use a fire extinguisher as part of your orientation.\n\n? If you discover a fire:  Tell another person immediately.  Call or have them call 911 and a supervisor.\n\n? If the fire is small (such as a wastebasket fire) and there is minimal smoke, you may try to put it out with a fire extinguisher (only if you have been trained on how to use fire extinguishers)\n\n? If the fire grows or there is thick smoke, do not continue to fight the fire.\n\n? Tell other employees in the area to evacuate.  \n\n? Go to the designated assembly point outside the building.  Currently the assembly point is at the entrance to Sitka Spruce Park.  \n\n\n\nEarthquake Emergency\n\n? During an earthquake:\n\nIf you are inside a building: \n\n? Drop under a desk or table, cover your head and hold on.  Stay away from windows, heavy cabinets, bookcases or glass dividers.\n\n? When the shaking stops, supervisors are to check for damage and available evacuation routes then begin an evacuation of their area to the designated assembly location.\n\n? Evacuation should proceed as quickly as possible since there may be a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000049497,
      "SummaryText": "ftershocks.\n\n? Supervisors must account for each employee in their work group as quickly as possible.\n\n? First aid certified employees should check for injuries and help evacuate injured employees.  Do not attempt to move seriously injured persons unless they are in immediate danger of further injury.\n\n? If a gas odor is in the building, tell a supervisor to turn off the gas at the tank.  Open windows.  All supervisors are trained in the gas shut off procedure.\n\n? Supervisors and first aid employees must not re-enter the building once evacuation is complete.\n\n? Do not approach or touch downed power lines or objects touched by downed power lines.\n\n? Do not use the phone except for emergency use.\n\n? Turn on a radio and listen for public safety instructions.\n\n? If you are outside:  Stand away from buildings, trees, telephone and electric lines.\n\n? If you are on the road:  Drive away from underpasses/overpasses. Stop in a safe area.  Stay in the vehicle.\n\n\n\n4. Identification of hazardous chemicals used at this location.  \n\n? Safe use and emergency actions to take following an accidental exposure.\n\n? We use several chemicals, including solvents and cleaners.  You will receive a separate orientation as part of our chemical hazard communication program on the hazards of these chemicals before you work with them or work in an area where they are used.\n\n\n\n5. Use and care of required personal protective equipment (PPE).\n\n? Some tasks in our company require an employee to wear PPE to protect against injury.\n\n? You will be instructed by James Gilman in the proper use and care of PPE prior to being assigned work tasks requiring personal protective equipment. \n\n\n\n\n\n6. On-the-job training about what you need to know to perform the job safely.\n\n? Before you are first assigned a task, James Gilman will show you what to do along with safety instructions and required PPE.  \n\n? We have established safety rules and personal protective equipment (PPE) requirements based upon a hazard ass"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000049497,
      "SummaryText": "essment for each task.\n\n? Do not use equipment or attempt to do any of these tasks until you have received the required training and PPE.\n\n\n\n\n\nEmployee Safety Meetings  \n\n? They are typically held on the first Wednesday following the first Monday of each month in the office of Aleutian Propane Sales at 2:00pm\n\n? All full time employees are required to attend.  Part time employees are encouraged to attend.  If an employee is unable to attend, then at the beginning of their next shift, James Gilman will review the topic with them and provide them all material presented in the meeting.\n\n? The leader of the meeting will designate a person to document attendance and the topics discussed. \n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}