{
  "FacilityID": 1000107282,
  "FacilityName": "Raft River Energy I LLC",
  "FacilityStr1": "2960 South 2100 East",
  "FacilityStr2": null,
  "FacilityCity": "Malta",
  "FacilityState": "ID",
  "FacilityZipCode": "83342",
  "Facility4DigitZipExt": "8754",
  "FacilityCountyFIPS": "16031",
  "LEPC": "Cassia County LEPC",
  "FacilityLatDecDegs": "42.099330",
  "FacilityLongDecDegs": "-113.382565",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.ormat.com",
  "FacilityEmailAddress": "assetmanagement@ormat.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Ormat Nevada",
  "Company2Name": "N/A",
  "CompanyDUNS": 929315661,
  "Company2DUNS": null,
  "OperatorName": "Raft River Energy 1 LLC",
  "OperatorStr1": "2960 South 2100 East",
  "OperatorStr2": null,
  "OperatorCity": "Malta",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83342",
  "OperatorZipCodeExt": "8754",
  "FTE": 5,
  "OtherEPAFacilityID": "031-00030",
  "EPAFacilityID": "100000203512",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-08-30 00:00:00",
  "SafetyInspectionBy": "3D Fire Protection Inc.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-10-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-10-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-10-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-10-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 42.100133,
  "FRS_Long": -113.386062,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000134149,
      "AltID": "Geothermal Electric Power",
      "FacilityID": 1000107282,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000168071,
          "ProcessID": 1000134149,
          "ChemicalID": 115,
          "Quantity": 233100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000135562,
          "ProcessID": 1000134149,
          "NAICSCode": "221116",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000107282,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-11-01 00:00:00",
    "ERTrainingDate": "2023-05-16 00:00:00",
    "CoordinatingAgencyName": "Cassia County",
    "CoordinatingAgencyPhone": "2088782251",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000107282,
      "SummaryText": "ion Plan are located at Raft River and in the company\u0092s electronic database.\n\nEvacuation of Personnel: \nIn the event of an emergency determined to be motive fluid-system related and evacuation is deemed necessary, the control room operator or other designated personnel will sound the plant evacuation alarm. Activation of fire and gas detectors are also interlocked to sound the alarms automatically.\n\nFirst Aid: \nAll personnel have been trained in adult CPR and basic first aid procedures.\n\nControl Room Operator: \nUpon notification from the site that an emergency has occurred, the Control Room Operator shall verify that appropriate response activities have been initiated and emergency response teams have been called. The Control Room Operator assumes initial communications with the site over emergency situations until relieved by either the Plant Manager or Regional Manager.\n\nEmergency Response Personnel: \nFire, police, and/or ambulance crews will be called if necessary. The senior employee on site at the time of the incident will give a report to the person in charge of the emergency teams. The emergency response personnel assume the role of incident commander upon arrival on scene."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000107282,
      "SummaryText": "by the controls system is evaluated during the Process Hazard Analysis. \n\nRelief system design: \nRelief valves are located on the motive fluid storage tanks, vaporizers, and condensers. Each pressure relief valve relieves directly to atmosphere at a safe location. \n\nVentilation System Design:\nIs not applicable as the system is located outdoors. \n\nSafety Systems: \nBeyond the relief systems at Raft River, the OEC has fire protection, gas and flame detection, and an alarm system. These protective systems, in conjunction with the administrative control system, mitigate hazardous and environmental impactful incidents.\n\nThe fire detection system includes gas monitors, which continuously monitor the area surrounding the OEC's, and flame detectors are located throughout the plant. The facility has a fire water system installed in a continuous loop around the generating units. The fire water system can reach the motive fluid storage tanks and major process equipment in the event of a fire. The fire water systems consist of fire monitors and a deluge system. A diesel driven fire pump draws water from the cooling tower basin. Operators are trained in the proper use of the installed fire protection equipment.\n\nFive-Year Accident History:\nRaft River has had no accidents reportable pursuant to the RMP criteria.  \n\nEmergency Response Program:\nThe Emergency Response Program is intended to identify and coordinate personnel in the event there is an emergency. The EAP procedures apply to all personnel working at the Raft River facility. \n\nImplementation, Control and Compliance: \nThe Regional Manager has overall responsibility for the development and implementation of the Emergency Action Plan. The Emergency Response Program is periodically reviewed, updated, and employees notified of any changes in conformance with 40 CFR 68.95. The EAP may also be reviewed, as part of any Incident Investigations or when deemed required during Management of Change. Current copies of the Emergency Act"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000107282,
      "SummaryText": "uirements of the EAP procedure prior to working at the Raft River site. Training includes the following items but is not limited to: (a) Location of the alarms; (b) Expectations of response to injuries and emergencies by personnel on site; and (c) Evacuation routes and locations. Refresher training for all personnel is conducted annually at a minimum.\n\nSafety Training: \nSome equipment at the Raft River Geothermal Power Plant poses potential fire, explosion, and electrical hazards that could cause serious personal injuries and costly property damage if safety procedures are not followed. Safety training is conducted monthly and required of all employees to participate. The subjects covered include but are not limited to the Emergency Action Plan (EAP), motive fluid hazards, fire prevention and hot work, lock out and tag out procedures, hazard communication, confined space, hearing conservation, personal protective equipment, accident, injury, and incident reporting. Safety training is supplemented by the use of the Standard Safety Procedures.\n\nOEC Unit Control: \nThe OEC units are controlled and monitored by Human Machine Interfaces (HMIs) and Programmable Logic Controllers (PLCs). The HMI and PLC receive discrete (logic) and analog signals from the input devices (e.g. switches and measuring sensors), processes the signals according to pre-loaded Ormat software, and then outputs logic and analog command signals to local and field devices. All parameters needed for proper operation of the OEC units, such as pressure, temperature, voltage, current, power, speed, etc. are measured by the proper measuring instruments. Deviation from the operating parameters will immediately be detected by the HMI and/or PLC and the HMI/PLC will initiate correction or automatic shutdown of the related OEC unit. Under normal circumstances, no releases or other dangerous situations are expected to result from these automatic actions. Appropriate manual override is provided. The actions taken"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000107282,
      "SummaryText": "conformance with Office of Emergency Management guidance, the OCA for worst-case and/or alternative release scenario(s) has not been included in this Executive Summary and can be found in the RMP esubmit documentation.\n\nAccident Prevention Program\nGiven the lack of proximity to offsite receptors and lack of accidents, Raft River is being reclassified as a program level 1 stationary source. Notwithstanding the program level, Ormat maintains a complete accident prevention program as specified for a program level 3 facility at all processes and per OSHA\u0092s PSM requirements.\n\nSafe Work Practices: \nSafe work practices have been developed and implemented to provide for the control of hazards during work activities such as lock out/tag-out, confined space entry, opening process equipment or piping, and control over entrance into a facility by maintenance, contractor, laboratory, or other support personnel. These safe work practices apply to both employees and contractors.\n\nMaintenance Procedures: \nThe mechanical integrity program at the Raft River facility implements  periodic preventative and corrective maintenance of the OEC systems. The preventative maintenance tasks include visual inspection, lubrication of rotating parts, system cleaning, replacing liquids and filters, and periodic tests to verify that the system is in proper operating condition. Preventative maintenance tasks and procedures are scheduled to be undertaken over a series of maintenance intervals.  \n\nTraining: \nInitial training for personnel is given before an employee is allowed to either handle motive fluid, operate, or work on or within the facility's process area or work on process equipment.  \n\nEmployee refresher training is conducted annually, at a minimum, or when additional training is deemed necessary.  Initial and refresher training, associated with the Risk Management Program, is documented, and maintained per the requirements of the Training Program. Contract employees, are trained in the req"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000107282,
      "SummaryText": "nd tube heat exchangers via feed pumps to form a closed-loop process. The cooled geothermal brine exiting the process is pumped back into the geothermal reservoir through dedicated injection wells.\n\nThe process consists of an Integrated Two-Level Unit (ITLU) Ormat Energy Converter (OEC).  The OEC levels are differentiated by the operating pressure of the heat exchangers and turbines. The OEC incorporates one double ended shaft generator driven by two direct coupled special organic fluid turbines and associated auxiliary systems. \n\nRaft River is operated by Ormat's Eastern Great Basin Operations Group. The organization is comprised of management, administration, maintenance, and operations personnel. EGB operates the Raft River and Neal Hot Springs power generation facilities owned by Ormat.\n\nAll the Northwest Region power plants operate continuously, 24 hours per day and 365 days per year (excluding scheduled maintenance downtime or plant upsets). Raft River is operated locally during normal business hours: 0700-1900 Monday-Sunday. During off hours, Raft River is remotely operated by the Neal Hot Springs staff.\n\nRegulated Substance Handled\nIn addition to the motive fluid inventory present in the OEC, the facility has dedicated storage tanks for the on-site motive fluid. The tanks provide evacuation capacity that is necessary to facilitate removal of motive fluid from the OEC for maintenance activities. The storage tanks have a maximum capacity of  14,681 gallons, which is only ever filled to 90% maximum per NFPA regulation, for a capacity of 13,213 gallons of isopentane. During normal operation, the tanks are essentially empty. The registered quantity of motive fluid for the process includes the quantity charged to the OEC plus a nominal amount of residual fluid in the storage tanks, approximately 183,000 gallons.\n\nWorst Case Scenario: \nWorst case scenario assessment has been conducted and the potential off-site consequence analysis (OCA) was undertaken. However, in"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000107282,
      "SummaryText": "Raft River Risk Management Plan\nExecutive Summary\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is Raft River facility\u0092s policy to adhere to all applicable federal, state, and local laws. In addition, Ormat undergoes several audit processes to ensure all facilities are pursuing the highest quality, safety, and environmental standards. Ormat is committed to handling the isopentane (generally referred to as motive fluid) systems regulated by the Risk Management Program in a safe manner to protect the environment. Copies of the emergency action plan, process hazard analyses,  process safety management plans, and all technical drawing (P&IDs) for process equipment are maintained onsite for reference.\n\nFacility Description\nThe Raft River Geothermal Power Plant (Raft River) is wholly owned by Ormat Technologies, Inc (Ormat), a publicly traded company. The power plant is in Cassia County and encompasses approximately 1,800 acres. The physical plant is located about 15 miles south of Malta, about 5 miles off Highway 81. The facility grounds include the defined geothermal resource area and receptive injection zones.\n\nThe physical address is:      2960 South 2100 East\n                                                Malta, ID 83342\n                                                \nThe process is a geothermal electric power generation facility. Raft River was built on a former DOE project and was commissioned by US Geothermal in 2008. The process starts with hot brine that is pumped from a geothermal reservoir. The hot geothermal brine is used to drive an organic Rankine Cycle process. The hot geothermal brine vaporizes the process motive fluid in shell and tube heat exchangers. The process utilizes isopentane as its motive fluid. The hot, high pressure motive fluid exits the heat exchangers to drive a turbine/generator set to produce electricity. The motive fluid exhausted from the turbine is condensed in a water-cooled condenser and returned to the shell a"
    }
  ]
}