{
  "FacilityID": 1000068447,
  "FacilityName": "Green Plains Fairmont LLC",
  "FacilityStr1": "1125 Bixby Road",
  "FacilityStr2": null,
  "FacilityCity": "Fairmont",
  "FacilityState": "MN",
  "FacilityZipCode": "56031",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27091",
  "LEPC": "District 5 - MN RRC",
  "FacilityLatDecDegs": "43.665579",
  "FacilityLongDecDegs": "-094.498506",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.gpreinc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79206047,
  "ParentCompanyName": "Green Plains Inc.",
  "Company2Name": null,
  "CompanyDUNS": 186380718,
  "Company2DUNS": 0,
  "OperatorName": "Green Plains Fairmont LLC",
  "OperatorStr1": "1125 Bixby Road",
  "OperatorStr2": null,
  "OperatorCity": "Fairmont",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56031",
  "OperatorZipCodeExt": null,
  "FTE": 58,
  "OtherEPAFacilityID": "5603WBFFLL1125B",
  "EPAFacilityID": "100000202489",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-02-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-03-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-03-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-03-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085866,
      "AltID": "Denaturant Storage",
      "FacilityID": 1000068447,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107199,
          "ProcessID": 1000085866,
          "ChemicalID": 155,
          "Quantity": 740000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000093725,
              "ProcessChemicalID": 1000107199,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000093726,
              "ProcessChemicalID": 1000107199,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000087068,
          "ProcessID": 1000085866,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000072512,
              "Process_NAICS_ID": 1000087068,
              "SafetyReviewDate": "2018-01-19 00:00:00",
              "PHA_Date": "2016-08-01 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-03-10 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-01-19 00:00:00",
              "TrainingReviewDate": "2018-01-19 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-12-29 00:00:00",
              "EquipmentInspectionDate": "2018-01-29 00:00:00",
              "EquipmentTested": "Tank 6104",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2013-11-22 00:00:00",
              "PreStartupReviewDate": "2013-12-26 00:00:00",
              "ComplianceAuditDate": "2017-05-04 00:00:00",
              "AuditCompletionDate": "2018-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-02-01 00:00:00",
              "HotWorkPermitReviewDate": "2018-01-01 00:00:00",
              "ContractorSafetyReviewDate": "2018-02-04 00:00:00",
              "ContractorSafetyEvalDate": "2017-10-30 00:00:00",
              "CBI_Flag": 0,
              "Description": "Denaturant Storage",
              "_chemicals": [
                {
                  "PrimaryKey": 1000090132,
                  "PreventionProgram3ID": 1000072512,
                  "ProcessChemicalID": 1000107199
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068447,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fairmont Volunteer Fire Department",
    "CoordinatingAgencyPhone": "5072355289",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068447,
      "SummaryText": "RMP Executive Summary: \n\n\n\nThis Executive Summary briefly reviews the major elements of the Risk Management Plan (RMP) for Green Plains Fairmont, LLC ethanol production facility located in city of Fairmont, Martin County, Minnesota (Green Plains Ethanol).  This summary is presented in response to the requirements of the United States Environmental Protection Agency (EPA) under Title 40 of the Code of Federal Regulations, Part 68 (40 CFR 68) and Section 112(r) of the Clean Air Act.  The Green Plains Ethanol facility is subject to the RMP rule due to the storage of natural gasoline, a regulated flammable mixture, above the threshold quantities.  Green Plains Ethanol is the owner and operator of the ethanol production facility; however, the facility's bulk storage tanks including the natural gasoline storage tank and the land on which the tanks are located is owned by Green Plains Ethanol Storage, LLC. Storage tank operational responsibility and compliance with RMP requirements resides with Green Plains Ethanol personnel.\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies \n\nGreen Plains Ethanol is committed to protecting the environment and operating facilities in a manner that promotes the safety of employees and the general public.  Management has adopted and implemented policies that adhere to all applicable federal and state rules and regulations.  The design and construction of the facility has incorporated physical and operational safeguards to prevent accidental releases.  Through the proper design, installation, operation and maintenance of the equipment, and the training of our personnel, Green Plains Ethanol has minimized the hazard to human health and the environment from fires, explosions, or any unplanned sudden or non-sudden release of hazardous materials.  \n\n\n\nIn the event that a release does occur, the facility's emergency response is described in its emergency action plan.  The emergency action plan includes procedures to coordinate re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068447,
      "SummaryText": "sponse actions with local emergency response personnel (i.e., law enforcement, fire, and rescue departments, emergency medical services, hospital and government personnel, etc.) as well as any potentially affected neighbors.  In addition, the emergency action plan is used to familiarize local emergency response personnel with the types of material handled and internal emergency response procedures.\n\n\n\n2. Facility Description and Regulated Substances Handled\n\nThe Green Plains Ethanol facility is a corn-based denatured ethanol fuel production plant.  Ethanol is produced through the conversion of corn starch to sugars and then conversion of the sugars to ethanol (i.e., grain alcohol) through a continuous fermentation and distillation process. \n\n\n\nRegulated substances stored at the facility include natural gasoline, which is used as a denaturant in the ethanol fuel product.\n\n\n\n3. Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nGreen Plains Ethanol has programs in place to address accidental release prevention measures required by EPA, process safety management (PSM) requirements from the Occupational Safety and Health Administration (OSHA), and notification requirements of EPA's Emergency Response and Community Right-to-Know regulations.  The facility complies with PSM for the management of ethanol, fuel additives and denaturant (natural gasoline).\n\n\n\nEmployee Participation\n\nGreen Plains Ethanol has developed an employee participation program.  All process safety information, process hazard analysis (PHA) results, recommendations, and action items, incident investigations, compliance audits, operating procedures, emergency response plan, and records of management of change are available to the operating personnel.\n\n\n\nProcess Hazard Analysis and Process Safety Information\n\nThe facility utilizes the HAZOP and What If process hazard analysis (PHA) methodologies.  The PHA identified the following potential major hazards: fire, explosion, overpr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068447,
      "SummaryText": "essurization, overfilling and equipment failure.  The facility utilizes process controls such as vents, manual shutoffs, interlocks, alarms and procedures, grounding equipment and excess flow devices to prevent or limit releases.  \n\n\n\nGreen Plains Ethanol keeps a variety of technical documents that are used to help maintain safe operation of the facility.  The facility also maintains technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, piping and instrument drawings.\n\n\n\nOperating Procedures and Training\n\nGreen Plains Ethanol maintains written procedures that address all modes of process operations, including normal operations, manual operation, regeneration, and emergency shutdown. The facility has developed and implemented a comprehensive training program for all employees involved in facility operations.  \n\n\n\nContractors\n\nThe contractor safety procedures establish minimum guidelines and activities in order to assure that the contractor's employees follow safe work practices and procedures.  The procedure includes a contractor screening process and hazard awareness, safety and emergency procedures training.\n\n\n\nPre-Startup Safety Reviews\n\nGreen Plains Ethanol conducts a pre-startup safety review (PSSR) for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service.\n\n\n\nMechanical Integrity\n\nThe facility's mechanical integrity program includes written procedures, training, and regular inspections and equipment testing procedures to maintain pressure vessels, piping systems, relief systems, pumps, emergency shutdown systems, and controls in a safe operating condition.  \n\n\n\nMan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068447,
      "SummaryText": "agement of Change\n\nThe facility's management of change (MOC) program reviews all proposed changes to process chemicals, technology, equipment, procedures, materials, and design conditions prior to implementation of the change.  Changes are reviewed to ensure that adequate controls are in place to manage any new hazards, and to verify that existing controls have not been compromised by a process change.  \n\n\n\nIncident Investigation\n\nGreen Plains Ethanol has procedures to promptly investigate any incident that has resulted in, or could reasonably result in a release of a regulated substance.  The procedure establishes the minimum guidelines and activities of the incident investigation program in order to reduce the likelihood of repetitive occurrences of events which could reasonably lead to catastrophic releases.  Investigations will be undertaken to identify the situation leading to the incident as well as any corrective actions to prevent a similar release in the future.\n\n\n\nCompliance Audits\n\nThe facility conducts audits of the provisions of RMP to verify that procedures and practices developed under the standard are adequate and are being followed.  The audits include a review of documentation and process safety information, inspection of the physical facilities, and interviews with all levels of plant personnel.\n\n\n\n4. Accident History\n\nThe facility has not had any accidents reportable under RMP within the past five years.  \n\n\n\n5. Emergency Response Program\n\nGreen Plains Ethanol maintains a written emergency response program in its emergency action plan.  The purpose of the emergency action plan is to protect worker and public safety as well as the environment.  The emergency action plan addresses aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000068447,
      "SummaryText": "p and decontamination requirements.  In addition, Green Plains Ethanol has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  We work with the local fire department and emergency responders to ensure the proper execution of our plan.  The emergency response program will be updated when necessary based on modifications made to facility processes. \n\n\n\n6. Planned Changes to Improve Safety\n\nThe Green Plains Ethanol facility has been designed and constructed to meet existing construction and process safety requirements.  Green Plains Ethanol will continue to evaluate and implement changes as necessary to improve safety at the facility.   \n\n    "
    }
  ]
}