{
  "FacilityID": 1000118683,
  "FacilityName": "Foster Farms Livingston Deli",
  "FacilityStr1": "843d Davis St.",
  "FacilityStr2": null,
  "FacilityCity": "Livingston",
  "FacilityState": "CA",
  "FacilityZipCode": "95334",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06047",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "37.393428",
  "FacilityLongDecDegs": "-120.726596",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9178856,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Foster Farms",
  "OperatorStr1": "843 Davis Street",
  "OperatorStr2": null,
  "OperatorCity": "Livingston",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95334",
  "OperatorZipCodeExt": null,
  "FTE": 352,
  "OtherEPAFacilityID": "CAD039467865",
  "EPAFacilityID": "100000255779",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-05-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-11-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-11-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-11-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-11-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000148130,
      "AltID": "DeliAmmoniaRefrigeration",
      "FacilityID": 1000118683,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000185112,
          "ProcessID": 1000148130,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000149763,
          "ProcessID": 1000148130,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000126639,
              "Process_NAICS_ID": 1000149763,
              "SafetyReviewDate": "2023-09-19 00:00:00",
              "PHA_Date": "2023-09-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2026-03-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-11-21 00:00:00",
              "TrainingReviewDate": "2023-03-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-03-21 00:00:00",
              "EquipmentInspectionDate": "2024-11-18 00:00:00",
              "EquipmentTested": "Daily system Inspection",
              "ChangeMgmtDate": "2024-11-18 00:00:00",
              "ChangeMgmtReviewDate": "2023-03-21 00:00:00",
              "PreStartupReviewDate": "2024-11-18 00:00:00",
              "ComplianceAuditDate": "2024-04-01 00:00:00",
              "AuditCompletionDate": "2025-10-01 00:00:00",
              "IncidentInvestigationDate": "2024-07-07 00:00:00",
              "InvestigationChangeDate": "2024-08-12 00:00:00",
              "ParticipationPlansReviewDate": "2023-07-20 00:00:00",
              "HotWorkPermitReviewDate": "2022-07-26 00:00:00",
              "ContractorSafetyReviewDate": "2021-10-11 00:00:00",
              "ContractorSafetyEvalDate": "2023-03-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000158698,
                  "PreventionProgram3ID": 1000126639,
                  "ProcessChemicalID": 1000185112
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000118683,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-03-21 00:00:00",
    "ERTrainingDate": "2024-03-13 00:00:00",
    "CoordinatingAgencyName": "Livingston Fire Department",
    "CoordinatingAgencyPhone": "2093947919",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000118683,
      "SummaryText": "FOSTER FARMS\nDELI RISK MANAGEMENT PROGRAM AND\nPROCESS SAFETY MANAGEMENT PROGRAM\nAnhydrous Ammonia Refrigeration System                                                     \n\nEXECUTIVE SUMMARY\n\nFoster Farms Livingston Deli prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations.  The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2735.1, et.  Seq.  The Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances.  The federal regulations are codified in Title 40 of the Code of Federal Regulations (CFR), Part 68.  Finally, both CalOSHA and OSHA regulate facilities with certain acutely hazardous materials under the PSM regulations, as defined in CCR Title 8 Section 5189 and CFR Title 29 Part 1910 Section 119, respectively.\n\nFoster Farms prepared their initial RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate anhydrous ammonia handling and practices at the facility. \n\nMany state-of-the-art safety features were incorporated into the ammonia refrigeration system at the facility as part of the original system construction and system modifications.  Foster Farms will continue to improve ammonia handling safety through the implementation of the prevention program elements of the RMP/PSM.  In the unlikely event that a ammonia release does occur at the facility, Foster Farms personnel are trained in the appropriate response measures and do not rely on support services provided by the local fire department and/or hazardous materials response team to end the release.\n\nThe Livingston Deli is located at 843d Davis Street in Livingston, California.  The facility is approximately ¼ mile east of Highway 99 in the northeast portion of Livingston.  Restaurants, a hotel, a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000118683,
      "SummaryText": "gasoline station, and other small retail facilities are located along Highway 99 in the vicinity of the complex.  Residential properties are also located near the site.  The Merced River is approximately ½ mile north and northwest of the facility.  Retention basins and unimproved property lie to the north and northeast of the facility.  Railroad tracks border the facility on the west.  Agricultural lands generally surround the Livingston area.  The facility is surrounded by a security fence, prohibiting unauthorized access.  Additionally, the entrance is staffed by plant security personnel 24 hours-per-day, 365 days-per-year.\n\nOperations at the Deli include the production of deli products.  Corn dogs are produced and packaged at the Corn Dog Plant, which is part of the Deli.   The Deli is immediately adjacent with a common wall separating the operations.  The Deli is located in the northwest corner of the Complex, approximately 200 feet north of Plant 2.  \n\nAll equipment is operated and maintained by a single team of trained refrigeration system technicians who are managed and dispatched by a single maintenance management team.  \n\nAnhydrous ammonia is used in closed-loop refrigeration system at the facility.  A Central computer system monitors and controls the refrigeration system.  The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, transfer pumps, and compressor controls.  \n\nThe RMP/PSM regulations require a review of the five-year accident history at the regulated facility.  The facility has experienced no reportable ammonia release within the past five years.  \n\nThe RMP regulations require facilities to identify and evaluate chemical release scenarios resulting from potential failures of the chemical handling systems covered by the RMP.  Program 3 requirements of the RMP apply to the Livingston Deli due to the quantity of ammonia used.  Program 3 facilities are required to eva"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000118683,
      "SummaryText": "luate one worst-case release scenario (release parameters are defined by the regulations) for a facility and an alternative release scenario for each covered chemical.  The regulations define a worst-case release scenario as \"...the greatest amount held in a single vessel...released as a gas over 10 minutes.\"  An alternative release scenario is identified as a release that is more likely to occur at the facility.  For facilities with multiple processes, the regulations require that the worst case scenario with the greatest distance to the toxic endpoint must be modeled.  Additional worst case scenarios are not required if the affected populations from worst case release scenarios from other processes are within the populations affected by the selected scenario.  \n\nThis facility has prepared worst-case and alternative release scenarios.  These are not summarized herein as recommended by EPA, but are presented in the RMP.\n\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility.  Foster Farms has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases.\n\nThe predominant safety concern with closed-loop ammonia system is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion.  The Foster Farms ammonia system is continuously monitored by automated control systems that shut down components if deviations from normal operating conditions occur.    Ammonia from the vessels can be mixed with water (neutralized) and discharged to the sewer system to prevent over-pressurization of the vessels.  Further, all pressure vessels in the system are equipped with pressure relief valves.\n\nOther safety features of the ammonia refrigeration system include: \n- The facility is equipped with ammonia leak detection system that provide an early warning in the event of an am"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000118683,
      "SummaryText": "monia release and they alarm at multiple locations including security that is manned 24 hours-per-day, 365 days-per-year.  \n- Emergency shutdown system\n- Component specific safety shutdowns\n- Safety shutdowns are tested annually\n- The ammonia pipes, valves and components are labeled\n- Pressure relief valves are replaced at least every five years\n- Fire alarm and sprinkler system exist at the facility\n- Emergency fire diffusion panels to protect vessels from over-pressurization - manually invoked\n- A passive diffusion system connected to all pressure relief valves to protect against over-pressurization\n\nIn addition to the physical features of the ammonia refrigeration system at the facility, Foster Farms has extensive administrative controls in place to maintain safe operation of the system.  Administrative controls include, but are not limited to formal training programs for system operators and mechanics, emergency training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity program, management of change program, pre start-up safety review program, and a RMP/CalARP/PSM auditing and inspection program.  Written standard operating procedures (SOPs) have been prepared for the ammonia system at the facility.  The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the system.\n\nFoster Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration system.  A preventive maintenance system is utilized to manage the maintenance of the refrigeration system.  Preventive maintenance at the facility includes shift, daily, weekly, and periodic inspection; calibration; testing; and overhaul of equipment in the ammonia system.  The system is used to track equipment performance and to create reports that are used by maintenance personnel to monitor the frequency of repairs and deviations from normal operating para"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000118683,
      "SummaryText": "meters.\n\nChanges to improve safety at the facility are ongoing. Foster Farms currently has no changes planned for the ammonia refrigeration processes at this time.   However, the processes will be subjected to periodic process hazard analysis reviews for the purpose of identifying potential hazards and implementing the necessary improvement to provide a safer system. Foster Farms personnel will also periodically review all potential opportunities to improve the safety of our personnel, the surrounding community, and the ammonia refrigeration process. \n\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility.  As such, this document and related attachments and program elements will evolve as Foster Farm continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community.  Foster Farms will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations.  However, minor improvements/modifications to the RMP/PSM and related attachments and program elements will be incorporated consistent with Foster Farms' internal review practices and Foster Farms will maintain the most current versions on site.  Thus, the most current version RMP/PSM, related documents and elements maintained on site may vary slightly from the information submitted to the EPA and other regulatory agencies."
    }
  ]
}