{
  "FacilityID": 1000075463,
  "FacilityName": "Solenis LLC",
  "FacilityStr1": "2301 Wilroy Road",
  "FacilityStr2": null,
  "FacilityCity": "Suffolk",
  "FacilityState": "VA",
  "FacilityZipCode": "23434",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51800",
  "LEPC": "Suffolk LEPC",
  "FacilityLatDecDegs": "36.77736",
  "FacilityLongDecDegs": "-76.54321",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "vmelton@solenis.com",
  "FacilityDUNS": 79436434,
  "ParentCompanyName": "Solenis LLC",
  "Company2Name": null,
  "CompanyDUNS": 79436434,
  "Company2DUNS": 0,
  "OperatorName": "Solenis LLC",
  "OperatorStr1": "3 Beaver Valley Road, Suite 500",
  "OperatorStr2": null,
  "OperatorCity": "Willington",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19803",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": "VAD076670959",
  "EPAFacilityID": "100000064459",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-07-14 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-03-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.7751,
  "FRS_Long": -76.54283,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000093943,
      "AltID": "Acrylamide Manufacture",
      "FacilityID": 1000075463,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000117591,
          "ProcessID": 1000093943,
          "ChemicalID": 25,
          "Quantity": 1354000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000095222,
          "ProcessID": 1000093943,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000080060,
              "Process_NAICS_ID": 1000095222,
              "SafetyReviewDate": "2013-12-19 00:00:00",
              "PHA_Date": "2013-10-24 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-07-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": "foam system",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 1,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Foam system, fire cladding",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "A PHA was completed in October 2013 on the new process which will be commissioned in July 2014",
              "OpProceduresReviewDate": "2013-06-28 00:00:00",
              "TrainingReviewDate": "2012-06-27 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Web-based",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-11-05 00:00:00",
              "EquipmentInspectionDate": "2014-05-09 00:00:00",
              "EquipmentTested": "Mechanical Integrity completed on acrylonitrile storage tanks, internal and external inspection",
              "ChangeMgmtDate": "2014-04-08 00:00:00",
              "ChangeMgmtReviewDate": "2013-11-19 00:00:00",
              "PreStartupReviewDate": "2013-11-18 00:00:00",
              "ComplianceAuditDate": "2011-08-11 00:00:00",
              "AuditCompletionDate": "2012-12-18 00:00:00",
              "IncidentInvestigationDate": "2011-01-24 00:00:00",
              "InvestigationChangeDate": "2012-02-03 00:00:00",
              "ParticipationPlansReviewDate": "2011-10-18 00:00:00",
              "HotWorkPermitReviewDate": "2012-07-10 00:00:00",
              "ContractorSafetyReviewDate": "2013-12-06 00:00:00",
              "ContractorSafetyEvalDate": "2014-03-31 00:00:00",
              "CBI_Flag": 0,
              "Description": "This prevention program applies to the Acrylamide Plant",
              "_chemicals": [
                {
                  "PrimaryKey": 1000099432,
                  "PreventionProgram3ID": 1000080060,
                  "ProcessChemicalID": 1000117591
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000075463,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-05-14 00:00:00",
    "ERTrainingDate": "2014-06-03 00:00:00",
    "CoordinatingAgencyName": "City of Suffolk Fire Department",
    "CoordinatingAgencyPhone": "7575144550",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075463,
      "SummaryText": "Facility Description\n\n\n\nBASF Corporation, formally Ciba Corporation, in Suffolk Virginia was established in 1983. Currently the site employees approximately 100 employees and 40 to 70 contractors. The facility is operated 24 hours a day, seven days a week.  Our two finished product plants produce chemicals that are used in all phases of water treatment, from municipal wastewater treatment to paper making.  Additionally, our Monomers group produces raw materials used by the finished product plants.  The site covers 222 acres on the west side of Wilroy Road, ? mile north of the Wilroy Industrial Park.  \n\n\n\nRMP Chemicals on Site\n\n\n\nWe have several chemicals on our site that are listed under the RMP rule: acrylonitrile, propane, acetylene, sulfur dioxide and ammonia solution.  All but acrylonitrile are stored at levels below the RMP thresholds.  Acrylonitrile is used in the manufacture of acrylamide our main raw material used in at the site.  \n\n\n\nProcess Description\n\n\n\nIn January 1997 BASF began to produce acrylamide monomer from acrylonitrile with a process called catalytic hydration.  This process was discontinued in September of 2013 and will be replaced by a biocatalytic process in July 2014. The new operation is a batch process that operates under ambient pressure and temperatures. Acrylamide is produced by feeding acrylonitrile into a biocatalyst slurry until the batch concentration achieves 50% acrylamide and negligible AN \n\n\n\nAcrylonitrile is delivered to the site exclusively in rail cars designed to be off-loaded from the top into a closed system. The rails cars and the unloading apparatus were designed to meet NFPA 497A requirements for highly flammable materials. The material is unloaded into one of three storage tanks in rotation, which are never filled to more than 80% capacity. The storage tanks are equipped with the following alarms; high and low level, high and low pressure and high and high/high temperatures. Storage tank levels are monitored remotely d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075463,
      "SummaryText": "uring the entire off-loading process \n\n\n\nAccidental Release Prevention Measures\n\n\n\nThe probability of a significant release of acrylonitrile is extremely remote based on the design, construction, operation and testing associated with acrylonitrile offloading and storage.  Prevention measures include the following:\n\n\n\nA derailer is placed on the railroad track in front of the railcar being offloaded, which prevents any other railcar mistakenly placed on the track from reaching the offloading car.\n\n\n\nTransfer hoses are inspected and pressure tested before each offload.\n\n\n\nThe initial step in the off-loading process is to pressurize the rail car and the transfer line to the pump. In this manner any problems with equipment would be detected quickly and a minimal amount would be released.\n\n\n\nDuring the entire railcar offloading process, the rail car, the offloading line and the storage tank diked areas are monitored by remote tilt/zoom cameras from the process control room which is manned throughout the off-loading operation. If required, the off-loading process can be halted remotely from the control room\n\n\n\nAn acrylonitrile detector is mounted beneath the offloading station for detecting any spillage. There is also a sensor in the diked area to provide early warning of a leak. \n\n\n\nEach storage tank is equipped with an independent high-level shutoff mechanism to prevent overfilling.  \n\n\n\nShould a leak occur, a remotely operated shutdown switch is in place, which would close all transfer lines, shut down the transfer pump and close the storage tank fill lines.\n\n\n\nA remotely operated sprinkler system can be employed in the offloading area in case of a spill, which would reduce the amount of vapor released.\n\n\n\nThe storage tank diked area can immediately be covered in foam in the evident of a leak, which suppresses vapor formation.  This foam system operates automatically in case of fire, but can also be operated remotely from the process control room if a leak were detecte"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075463,
      "SummaryText": "d.  \n\n\n\nFive Year Accident History\n\n\n\n1 .Catalytic Oxidizer fire: \n\n1.    Date and Time: January 24, 2011 at 10:45 \n\n2.    Chemical released: Acrylonitrile vapor \n\n3.    Amount: Approximately 10 pounds\n\n4.    NAICS code: 325199\n\n5.    The vapor within the catalytic oxidizer on the acrylamide plant ignited and burned the insulation around the catalytic oxidizer. \n\n6.    Weather conditions: cloudy, 10oF, winds 4 mph from the SW\n\n7.    On-site impacts: Damage to the facility was estimated at $37,000. The event required a site wide evacuation. \n\n8.    No off-site impacts were reported\n\n9.    Initiating event: The catalytic oxidizer shut down due to high temperature due to high acrylonitrile vapor. The apparatus was re-started while excess vapor was still present, the vapor ignited and the installation on the system caught on fire.\n\n10.    Offsite responders: The Suffolk City Fire Department, Virginia Emergency Manager and the Virginia Department of the Environment\n\n11.    Implemented automation conditions to ensure safe re-start conditions are present in the apparatus before the system can be brought back on line \n\n\n\nSafety Philosophy\n\n\n\nThe BASF Suffolk site has a strong safety culture, led by our site manager.  Our guiding principles are the six codes of management practice found in the Chemical Manufacturer's Association's Responsible Care initiative.  Three of the codes are particularly relevant to this discussion Process Safety (PS); Employee Health and Safety (H&S); and: Community Awareness and Emergency Response (CAER).\n\n \n\nOur process safety efforts are managed via the site's Process Safety Management (PSM) Committee, which is comprised of employees from each production area, engineering and maintenance as well as environmental, health and safety personnel.  The committee, which meets monthly, monitors PSM issues, hosts training activities and performs PSM audits.  Regarding employee H&S, the Suffolk site has been a Virginia Occupational Safety & Health Voluntary Protection Program (VPP) STAR f"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075463,
      "SummaryText": "acility since October 2001.   The site's Safety Committee completes a site wide safety audit quarterly and a self-evaluation of the site's VPP program performance is conducted annually.  \n\n\n\nCommunication with stakeholders is BASF Community Advisory Panel (CAP), the Suffolk Local Emergency Planning Committee (LEPC) and other community outreach efforts.  The CAP is comprised of BASF employees, residents of our neighborhood, civic leaders and emergency services representatives.  \n\n\n\nEmergency Response\n\n\n\nThe Suffolk site has an on site Emergency Response Team (ERT) which is composed of production, maintenance, technical and EH&S employees. Our ERT is currently comprised of approximately 60 BASF emergency responders and support personnel.  Of the 60 personnel, there are  6 people certified as Emergency Medical Technicians (EMTs).  Normally there is a minimum of 7 fully trained responders on-site at all times which are certified in Basic First Aid, AED, CPR and Blood born pathogens.\n\n\n\nOn-site drills are held five times each year: four drills during shift rotation and the fifth is a full site drill.  Additionally, we have participated in a drills held by the Suffolk LEPC, which includes local emergency services and other local industry.  We have an automated on-site emergency notification system for coordinating emergency response efforts.  Off-site emergency response is initiated via the site's Emergency Response Plan, and is coordinated by the Suffolk Department of Emergency Services in conjunction with the Suffolk Fire Department. \n\n"
    }
  ]
}