{
  "FacilityID": 1000047139,
  "FacilityName": "City of Fergus Falls Wastewater Treatment Plant",
  "FacilityStr1": "311 South Kennedy Park Road",
  "FacilityStr2": null,
  "FacilityCity": "Fergus Falls",
  "FacilityState": "MN",
  "FacilityZipCode": "56537",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27111",
  "LEPC": "Fergus Falls LEPC",
  "FacilityLatDecDegs": "46.280461",
  "FacilityLongDecDegs": "-96.111056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "LC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Fergus Falls",
  "OperatorStr1": "112 Washington Ave W",
  "OperatorStr2": null,
  "OperatorCity": "Fergus Falls",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56537",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": "MND985697044",
  "EPAFacilityID": "100000037159",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-08-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-10-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-10-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-10-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-10-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 46.280461,
  "FRS_Long": -96.111056,
  "FRS_Description": "LOADING AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058827,
      "AltID": "Disinfection",
      "FacilityID": 1000047139,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071812,
          "ProcessID": 1000058827,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000071813,
          "ProcessID": 1000058827,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000059851,
          "ProcessID": 1000058827,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000048941,
              "Process_NAICS_ID": 1000059851,
              "SafetyReviewDate": "2017-09-13 00:00:00",
              "PHA_Date": "2014-09-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-01-09 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-05-31 00:00:00",
              "TrainingReviewDate": "2017-09-13 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-09-13 00:00:00",
              "EquipmentInspectionDate": "2017-09-13 00:00:00",
              "EquipmentTested": "All process equipment is inspected daily as part of normal operations.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2017-09-13 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2017-09-13 00:00:00",
              "AuditCompletionDate": "2017-12-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-09-13 00:00:00",
              "HotWorkPermitReviewDate": "2017-09-13 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2017-09-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000059504,
                  "PreventionProgram3ID": 1000048941,
                  "ProcessChemicalID": 1000071812
                },
                {
                  "PrimaryKey": 1000059505,
                  "PreventionProgram3ID": 1000048941,
                  "ProcessChemicalID": 1000071813
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000047139,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Fergus Falls Fire Department",
    "CoordinatingAgencyPhone": "2187366983",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047139,
      "SummaryText": "City of Fergus Falls\r\nWastewater Treatment Plant\r\nRisk Management Program\r\nExecutive Summary\r\n\r\n\r\n\r\n1.0  Accidental Release Prevention and Response Policies\r\n\r\nThe City of Fergus Falls has a long-standing commitment to operating our facilities in a manner that is safe for our employees, the public, and the environment.  A primary aspect of this commitment is the City of Fergus Falls Wastewater Treatment Plant system to help ensure the safe operation of the water disinfection process.  Our commitment is also demonstrated by the resources invested in accident prevention, such as considering safety in the design, installation, operation and maintenance of our process, as well as, extensive training of our operating personnel. \r\n\r\nIn the event of an accidental release, the City of Fergus Falls Wastewater Treatment Plant has procedures that are designed to control and contain the release in a manner that will be safe for our employees and will help prevent injury to the public and the environment.  The City of Fergus Falls Wastewater Treatment Plant's emergency response personnel receive thorough training in handling accidental releases.  An emergency response coordinator has been assigned to oversee response activities and to coordinate response efforts with local emergency agencies.  Communications with the Local Emergency Planning Committee (LEPC) have been ongoing throughout the preparation of this plan and policies.\r\nIn order to effectively implement these policies, the City of Fergus Falls Wastewater Treatment Plant established a management system headed by the Plant Superintendent to ensure the proper implementation and effectiveness of our Risk Management Program.\r\n\r\n\r\n2.0  City of Fergus Falls Wastewater Treatment Plant and Regulated Substances\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant handles two substances regulated by the EPA Risk Management Program Rule (RMP Rule) rule in quantities above the Threshold Quantity. \r\n\r\nProcess Description: Disinfec"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047139,
      "SummaryText": "tion\r\nProgram Level: 3\r\nRegulated Substances: Chlorine and Sulfur Dioxide\r\n\r\n\r\n\r\n3.0  Hazard Assessment Results\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant performed an offsite consequence analysis to estimate the potential impacts of accidental releases of the Chlorine and Sulfur Dioxide from our process. The regulated substances were evaluated for two possible worse-case release scenarios and alternative release scenarios to account for both urban and rural topography.  It is important to understand that the City of Fergus Falls Wastewater Treatment Plant has invested extensive resources to prevent releases, and the potential for a worse-case release is extremely small.  The alternative release scenario represents a more realistic potential for occurrence and is based on historical data from our process or other similar processes.  By identifying these potential releases, the City of Fergus Falls Wastewater Treatment Plant has developed an extensive program to prevent such an occurrence.  This program is discussed in detail in the Prevention Program section of this plan.\r\n\r\nThe primary objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public and/or the environment as a result of an accidental release.  This point is called the endpoint distance.  At distances less than the endpoint distance, the effects would be greater; at distances farther than the endpoint, the effects would be less.\r\n\r\n3.1  Hazard Assessment - Toxic Substances\r\n\r\nThe worst-case scenario (WCS) associated with Regulated Toxic Substances is a failure of a full, one ton (2000 lb) cylinder of liquid chlorine or sulfur dioxide.  A toxic cloud formed by the evaporating chlorine or sulfur dioxide would reach offsite endpoints and public receptors.\r\nAn alternative release scenario (ARS) for chlorine releases is a release from a vessel leak.  The modeled release lasted for 30 minutes before it is stopped.  A toxic"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047139,
      "SummaryText": "cloud formed by the evaporating chlorine would reach offsite endpoints and public receptors.\r\n\r\n\r\n4.0  Accidental Release Prevention Program - Program 3\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant Disinfection Process is required by state law, to implement a Program Level 3 Prevention Program which is similar to the OSHA Process Safety Management standard.  The requirements of the OSHA Process Safety Management standard are nearly identical to the RMP Rule Program 3 Prevention Program requirements.  The Disinfection Process Prevention Program consists of the following elements.\r\n\r\n4.1  Process Safety Information\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant maintains a variety of technical documents that help ensure the safe operation of our processes.  These documents address:\r\n\r\n* physical properties of hazardous substances handled,\r\n* chemical properties and associated hazards of those substances,\r\n* operating parameters and limitation(s) of the process equipment,\r\n* design basis and configuration of the equipment, and\r\n* specific chemical inventories.\r\n \r\nThe City of Fergus Falls Wastewater Treatment Plant ensures that the process safety information is available to all City of Fergus Falls Wastewater Treatment Plant employees, the Local Emergency Planning Committee (LEPC), and the local fire department.  The EHS & T Coordinator is responsible for maintaining and updating this information, as needed.\r\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  This information is supplemented by other technical information specific for these chemicals.  Continuous attention is given to revisions and updates on the hazards of chlorine, sulfur dioxide and other chemicals used in our process.  Information regarding toxicity, environmental impacts, corrosion concerns, inadvertent mixing hazards, and other safety and health concerns are add"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000047139,
      "SummaryText": "ressed and communicated to the appropriate parties.\r\nThe City of Fergus Falls Wastewater Treatment Plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes:\r\n \r\n* materials of construction,\r\n* design pressures,\r\n* temperature ratings,\r\n* electrical ratings,\r\n* flow limits,\r\n* block flow diagrams,\r\n* consequences of deviation from operating limits,\r\n* safety systems,\r\n* applicable design codes and standards,\r\n* process chemistry, and\r\n* design basis for relief and ventilation systems.\r\n\r\nMany of the operating parameters are included in the operating procedures to aid in the safe and proper operation of the process.  These documents are used to:\r\n\r\n* train employees,\r\n* perform Process Hazard Analyses (PHAs), and\r\n* help maintain the equipment.\r\n\r\nAll the above mentioned information, in combination with written procedures and trained personnel, provide a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the Disinfection Process are not compromised.\r\n\r\n4.2  Process Hazard Analysis\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant performed and will periodically update process hazard analyses (PHAs) of the Disinfection Process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  Within this program, the Disinfection Process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\nTo perform the PHAs, the City of Fergus Falls Wastewater Treatment Plant primarily uses the \"What-if/Checklist\" technique.  The PHAs are conducted using a team of people with experience in engineering and Disinfection Process operation and a leader with experience in process hazard analysis techniques. This team identifies and evaluates hazards of the proces"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000047139,
      "SummaryText": "s as well as accident prevention and/or mitigation measures, when appropriate.  The team then prepares a written report describing the results of the analysis, including a list of recommendations ranked according to relative risk ratings assigned by the team.  Responsibility to resolve the recommendations is assigned to the EHS Committee and is tracked through completion.  The final resolution of each finding is documented and retained.\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the City of Fergus Falls Wastewater Treatment Plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the Disinfection Process is no longer in operation.  The results and findings of these updates are documented and retained.  The team findings are forwarded to the EHS Committee for consideration, and the final resolution of the findings is documented and retained.\r\n\r\n4.3  Operating Procedures\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant engineers, operators, and management work together to develop and maintain written operating procedures to define how tasks related to the Disinfection Process operation should be safely performed.  These written procedures address various modes of process operations, such as:\r\n\r\n* normal startup,\r\n* normal operations,\r\n* temporary operations,\r\n* emergency shutdown,\r\n* normal shutdown, and\r\n* initial startup of a new process.\r\n \r\n\r\n\r\n The written operating procedures include:\r\n \r\n* steps for safely conducting process tasks,\r\n* applicable process safety information, such as safe operating limits and consequences of process deviations, and\r\n* safety and health considerations, such as chemical hazards, personal protective equipment requirements, and action(s) to take in the event of an exposure to a hazardous substance.\r\n\r\n4.4"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000047139,
      "SummaryText": "Training\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant trains workers to safely and effectively perform their assigned tasks.  The City of Fergus Falls Wastewater Treatment Plant training program includes both initial and refresher training that covers:\r\n\r\n* a general overview of the Disinfection Process,\r\n* the properties and hazards of the substances in the process, and\r\n* a detailed review of the process operating procedures and safe work practices.\r\n\r\nIn addition to the above mentioned classroom training, each operator is required to work for a period of time with an experienced operator until clear understanding of the operating procedures is demonstrated.  Refresher training is conducted annually as part of the City of Fergus Falls Wastewater Treatment Plant's ongoing safety training effort.\r\n\r\n4.5  Mechanical Integrity\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant maintains the mechanical integrity of Disinfection Process equipment to help prevent failures that could endanger workers, the public, or the environment.  The City of Fergus Falls Wastewater Treatment Plant mechanical integrity program includes:\r\n\r\n* an inspection and testing program to help identify equipment deterioration and damage before the equipment fails,\r\n* a quality assurance program to help ensure that the new and replacement equipment meet the design standards required for service in our process,\r\n* procedures for safe work practices such as lockout/tagout, hot work, confined space entry and line or equipment opening,\r\n* training of maintenance personnel, and\r\n* documentation of maintenance activities.\r\n\r\n\r\n4.6  Management of Change\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant has a comprehensive program to manage changes to processes.  Under this program, all proposed changes to chemicals, equipment, and procedures for the Disinfection Process must be evaluated and approved to help ensure the change does not negatively affect safe operations.  Changes are rev"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000047139,
      "SummaryText": "iewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, and procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided with any necessary training related to the change.\r\n\r\n4.7  Pre-startup Review\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant performs a safety review of all new or modified processes prior to their being placed into service to ensure that these processes have been prepared to operate safely.  This review is designed to confirm:\r\n\r\n* construction and equipment are in accordance with design specifications,\r\n* adequate safety, operating, maintenance, and emergency procedures are in place,\r\n* employee training has been completed, and\r\n* for covered processes, a PHA has been performed for new processes and management of change requirements have been completed for modified processes.\r\n \r\nA pre-startup review team uses checklists to verify all aspects of readiness.  The review involves field verification of the construction elements and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n \r\n4.8  Compliance Audit\r\n \r\nThe City of Fergus Falls Wastewater Treatment Plant conducts periodic audits of the Disinfection Process to ensure the City of Fergus Falls Wastewater Treatment Plant Prevention Program has been effectively implemented and addresses the safety issues of our operations.  Compliance audits are conducted at least every three years by a team of hourly and management personnel who are knowledgeable of the RMP Rule and the Disinfection Process.  The team evaluates the City of Fergus Falls Wastewater Treatment Plant Prevention Program and other aspects of the City of Fergus Falls Wastewater Treatment Plant Ris"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000047139,
      "SummaryText": "k Management Program.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the Prevention Program are implemented.  The City of Fergus Falls Wastewater Treatment Plant maintains records of at least the last two audits conducted.\r\n \r\n4.9  Incident Investigation\r\n \r\nThe City of Fergus Falls Wastewater Treatment Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\r\n \r\n4.10  Employee Participation\r\n \r\nThe City of Fergus Falls Wastewater Treatment Plant developed a written employee participation program for the Disinfection Process and other aspects of our operations to ensure that the safety concerns are addressed.  The City of Fergus Falls Wastewater Treatment Plant encourages the active participation of our employees in the Prevention Program for all processes and tasks at our facility.  Employees are consulted on and informed of all aspects of the City of Fergus Falls Wastewater Treatment Plant Risk Management Plan (RMP) and participate on PHA and Compliance Audit teams.\r\n \r\n4.11  Hot Work Permits\r\n \r\nThe City of Fergus Falls Wastewater Treatment Plant established a Safe Work Permit program to control spark or flame producing activities that could result in fires or explosions in the processes at our facility.  The City of Fergus Falls Wastewater Treatment Plant utilizes a Safe Work Permit form designed after the OSHA fire prevention and protection requirements found in 29 CFR 1910.252(a).  Personnel who are to perform the Hot Work are required to complete the form which is reviewed by the area s"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000047139,
      "SummaryText": "upervisor.  The form must be approved before work can proceed.  Training in the use of the Safe Work Permit form is provided to all affected personnel.\r\n \r\n4.12  Contractors\r\n \r\nThe City of Fergus Falls Wastewater Treatment Plant established a program to help ensure that contractors who are used to supplement the workforce during periods of increased maintenance or construction conduct their work in a safe manner.  Under the program, the record of all contractors is reviewed to ensure that the City of Fergus Falls Wastewater Treatment Plant hires contractors who can safely perform work on or near covered process equipment.  Our program ensures that contractors:\r\n \r\n* perform their work in a safe manner,\r\n* have the appropriate knowledge and skills,\r\n* are aware of the hazards in the workplace,\r\n* understand what to do in the event of an emergency,\r\n* understand and follow the City of Fergus Falls Wastewater Treatment Plant's safety rules, and\r\n* inform the City of Fergus Falls Wastewater Treatment Plant personnel of any hazards identified during their work.\r\n \r\nProgram efforts are accomplished by providing contractors with:\r\n \r\n* a process overview,\r\n* information about safety and health hazards,\r\n* emergency response plan requirements, and\r\n* safe work practices prior to beginning work.\r\n \r\n\r\n5.0  Chemical Specific Prevention Steps\r\n \r\nIndustry standards are followed at the City of Fergus Falls Wastewater Treatment Plant to help ensure safe handling of chlorine and sulfur dioxide.  The vendor supplies chlorine via a Department of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The disinfection process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works Association, ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to t"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000047139,
      "SummaryText": "he guidelines required by the City of Fergus Falls Wastewater Treatment Plant. \r\n\r\n\r\n6.0  Emergency Response Programs\r\n \r\nThe City of Fergus Falls Wastewater Treatment Plant maintains a written emergency response/action plan, which is in\r\nplace to protect worker and public safety as well as the environment. \r\n\r\n\r\n7.0  Five Year Accident History\r\n\r\nThere has been no accidents or incidents that resulted in injuries to employee, the public, or the environment at The City of Fergus Falls Wastewater Treatment Plant in the past five years.\r\n\r\n\r\n8.0  Planned Changes to Improve Safety\r\n\r\nThe City of Fergus Falls Wastewater Treatment Plant continuously strives to improve the safety of our processes through incident investigation, Process Hazard Analysis, and employee suggestions.  Our engineering and technical personnel stay abreast of technology advancements which may improve the safety of our processes."
    }
  ]
}