{
  "FacilityID": 1000013775,
  "FacilityName": "Delta St. Gabriel",
  "FacilityStr1": "3950 Highway 30 South",
  "FacilityStr2": null,
  "FacilityCity": "St. Gabriel",
  "FacilityState": "LA",
  "FacilityZipCode": "70776",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22047",
  "LEPC": "Iberville Parish LEPC",
  "FacilityLatDecDegs": "30.249722",
  "FacilityLongDecDegs": "-091.084722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.deltacogroup.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Delta Petroleum Company",
  "Company2Name": "Grief",
  "CompanyDUNS": 8176364,
  "Company2DUNS": 8176364,
  "OperatorName": "Delta St. Gabriel",
  "OperatorStr1": "3950 Highway 30 South",
  "OperatorStr2": null,
  "OperatorCity": "St. Gabriel",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70776",
  "OperatorZipCodeExt": null,
  "RMPContact": "Christi Nelson",
  "RMPTitle": "Plant Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192702",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-11-29 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-01-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-01-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-01-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-01-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017220,
      "AltID": "Warehousing and Packaging",
      "FacilityID": 1000013775,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017622,
          "ProcessID": 1000017220,
          "NAICSCode": "49319",
          "_desc": {
            "NAICS_CODE": "49319",
            "NAICS_DESCRIPTION": "Other Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 1000017623,
          "ProcessID": 1000017220,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020500,
          "ProcessID": 1000017220,
          "ChemicalID": 26,
          "Quantity": 938250.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 26,
            "ChemicalName": "Ethylenediamine  [1,2-Ethanediamine]",
            "CASNumber": "107-15-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000020501,
          "ProcessID": 1000017220,
          "ChemicalID": 20,
          "Quantity": 266424.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 20,
            "ChemicalName": "Toluene 2,6-diisocyanate  [Benzene, 1,3-diisocyanato-2-methyl-]",
            "CASNumber": "91-08-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000020502,
          "ProcessID": 1000017220,
          "ChemicalID": 44,
          "Quantity": 1062696.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520500,
          "ProcessID": 1000017220,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520501,
          "ProcessID": 1000017220,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520502,
          "ProcessID": 1000017220,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013775,
      "SummaryText": "1.0    EXECUTIVE SUMMARY AND CERTIFICATION\n\n\n\n\n\n1.1    SITE INFORMATION\n\nThe main operation of Delta Chemical Services (DCS) - St. Gabriel is the packaging, warehousing and distribution of numerous chemicals used in various industries.  Facility construction was completed in 2002 and packaging operations commenced immediately afterwards.  The facility is situated on approximately 20 acres located at 3950 Highway 30 South, St. Gabriel, Louisiana 70776.\n\n\n\nThe site is located in Iberville Parish.  The property is bound on the north side by Highway 30\n\nSouth, on the west side by Harcros Chemicals and on the east side by Hydro-Chem. On the North side of the facility, across Hwy 30, is a truck stop.  The area is heavily industrial primarily related to chemical manufacturing and transportation.\n\n\n\n1.2    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICES\n\nDCS - St. Gabriel is committed to employee, public and environmental safety.  This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the process at our facility.   It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  If such a release does occur, our trained emergency response personnel are at hand to control and mitigate the effects of the release.\n\n\n\n1.3    THE STATIONARY SOURCE AND THE REGULATED SUBSTANCE HANDLED\n\nThe DCS - St. Gabriel facility's primary activities are repackaging and warehousing of chemicals. DCS - St. Gabriel either repackages or warehouses regulated substances at this facility.  The regulated substances are listed below.  DCS - St. Gabriel receives the regulated substances in bulk and packages the products for customer distribution.   Packaged products are then warehoused or shipped depending on customer specifications.  Inventory is dependent upon customer orders and not all regulated substances a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013775,
      "SummaryText": "re always present onsite. Typical Safety Data Sheets (SDS) are provided for all predicted regulated substances in Appendix A.  \n\n\n\nChemical                    CAS No.\n\nToxic Substances:    \n\nEthylenediamine                    107-15-3\n\nToluene 2,4 Diisocyanate    584-84-9\n\nToluene 2,6 Diisocyanate    91-08-7\n\n\n\n1.4    THE WORST CASE RELEASE SCENARIOS AND THE ALTERNATIVE RELEASE SCENARIOS\n\nDCS - St. Gabriel is the operator of a stationary source that has more than the threshold quantity of a regulated substance in a process, as determined under 40 CFR 68.115 and therefore is subject to 40 CFR Part 68 - Chemical Accident Prevention Provisions.  DCS - St. Gabriel is a Program 2 level facility.\n\nTo evaluate the worst case and alternative scenarios, EPA's RMP*Comp&trade; program was used to evaluate off-site consequences.  RMP*Comp&trade; is based on the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  The following paragraphs provide details of the chosen scenarios.\n\n\n\nThe worst-case scenario for the regulated chemicals involves the catastrophic failure of the largest vessel containing the regulated substance at the facility and is either a rail car (est. 20,600 gallons) or a tanker truck (est. 6,000 gallons), depending on the regulated chemical, but for conservatism all worst-case scenarios assume catastrophic failure of a rail car.  Worst-case scenarios for the regulated chemicals were run at the highest daily maximum temperature ever recorded in the St. Gabriel area, 104 degrees Fahrenheit (?F), according to the National Weather Service.\n\n\n\nThe alternative release scenarios include:\n\n?    3\" hose with 1\" puncture while filling at 90?F that leaks for 15 minutes.  \n\n?    3\" hose separation flange at 90?F that leaks for 15 minutes.  \n\n?    drum punctured in warehouse that releases all contents within three minutes at 90?F.\n\n?    four drums falling off the loading dock and contents leaking within one minute at 100?F.  \n\n?    overfilling of a drum at the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013775,
      "SummaryText": " filler for 1 minute at 90?F.  \n\n\n\nNone of these scenarios are likely to result in the full amount of the regulated substances being released because of onsite personnel and other mitigation techniques, but for the worst-case and alternative scenarios these situations were used as potential possibilities that could have offsite consequences, as required by 40 CFR 68.25 and 40 CFR 68.28. \n\n\n\n1.5    THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\n\nDCS - St. Gabriel has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  DCS - St. Gabriel is subject to EPCRA Section 302 and 313 notification requirements.  The following sections briefly describe elements of the release prevention program that is in place at the stationary source.  Each of these elements are discussed in more detail later in this RMP.\n\n\n\nProcess Safety Information\n\nDCS - St. Gabriel maintains a record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the process. \n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within the covered process, DCS - St. Gabriel maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency operations, normal shutdown and startup after maintenance. The information is regularly reviewed and is readily accessible to operators involved in the process.\n\n\n\nTraining\n\nDCS - St. Gabriel has a training program in place to ensure that employees are competent in the operating procedures associated with those processes. New employees receive training before starting work. Operating procedures are reviewed annually or more frequently as needed. \n\n\n\nMechanical Integrity \n\nDCS - St. Gabriel carries out documented maintenance checks on process equipment to ensure proper operations. Process "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013775,
      "SummaryText": "equipment examined by these checks include among others; pressure valves and systems, hoses and piping systems, relief and vent systems, emergency shutdowns systems and controls. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. These personnel receive specialized on the job training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a timely manner. \n\n\n\nManagement of Change\n\nWritten procedures are in place at DCS - St. Gabriel to manage changes in chemicals being packaged, technology, equipment and procedures. Process operators and maintenance personnel whose job tasks are affected by a change or modification of process conditions are made aware of the changes. \n\n\n\nCompliance Audits\n\nDCS - St. Gabriel conducts compliance audits to determine whether the provisions set out under the RMP rule are being implemented. These audits will be carried out annually or whenever there is a change in the process.  Any corrective actions identified as a result of the audits will be undertaken promptly. \n\n\n\nIncident Investigation\n\nDCS - St. Gabriel promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the root cause of the incident as well as any corrective actions to prevent the incident from recurring. Reports are retained in the DCS intraweb-based Compliance Management System (CMS).  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nDCS - St. Gabriel believes that incident prevention is a team effort and involves employees in the incident prevention process. Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  Furthermore, DCS - St. Gabriel employees have access to the information created as part of facility's implementation of the RMP rule, including "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013775,
      "SummaryText": "information resulting from process hazard analyses. \n\n\n\nContractors\n\nOn occasion, the company hires contractors to conduct specialized maintenance and construction activities. DCS - St. Gabriel has a policy of informing the contactors of known potential hazards related to the contactor's works. Contractors are also informed of emergency procedures should an accidental release of a regulated substance occur.\n\n\n\n1.6     FIVE-YEAR ACCIDENT HISTORY\n\nThere has been no release of RMP chemicals at the DCS - St. Gabriel site over the past 5 years.\n\n\n\n1.7    EMERGENCY RESPONSE PLAN\n\nDCS - St. Gabriel has a written emergency response plan for responding to accidental releases of hazardous materials. The plan covers the aspects of emergency response including adequate first aid and medical treatment, evacuations, notifications of local emergency response agencies and the public, as well as post-incident return to work procedure. \n\n\n\nThe plan is updated regularly to reflect relevant changes taking place within the process that would require a modified emergency response.\n\n\n\n1.8    PLANNED CHANGES TO IMPROVE SAFETY\n\nDCS - St. Gabriel has a continuous improvement policy in place that includes safety improvement. \n\n\n\n1.9    CERTIFICATION STATEMENT\n\nTo the best of my knowledge, information and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.\n\n\n\n__________________________        _______________________\n\nSignature                    Name\n\n\n\n____________________________        ________________________\n\nHSE Manager                    Date\n\n\n\n\n\n"
    }
  ]
}