{
  "FacilityID": 1000113153,
  "FacilityName": "Calumet Karns City Refining, LLC",
  "FacilityStr1": "138 Petrolia Street",
  "FacilityStr2": null,
  "FacilityCity": "Karns City",
  "FacilityState": "PA",
  "FacilityZipCode": "16041",
  "Facility4DigitZipExt": "9299",
  "FacilityCountyFIPS": "42019",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "40.996111",
  "FacilityLongDecDegs": "-079.724167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 63745020,
  "ParentCompanyName": "Calumet Specialty Products Partners, L.P.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Calumet Karns City Refining, LLC",
  "OperatorStr1": "138 Petrolia Street",
  "OperatorStr2": null,
  "OperatorCity": "Karns City",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16041",
  "OperatorZipCodeExt": "9299",
  "FTE": 140,
  "OtherEPAFacilityID": "PAD065626822",
  "EPAFacilityID": "100000077935",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "10-00027",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Homeland Security",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-04-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-04-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-04-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-04-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.996111,
  "FRS_Long": -79.724167,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000140957,
      "AltID": "White Oil Oleum Process",
      "FacilityID": 1000113153,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000176366,
          "ProcessID": 1000140957,
          "ChemicalID": 69,
          "Quantity": 720000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000142453,
          "ProcessID": 1000140957,
          "NAICSCode": "32419",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000113153,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-12-29 00:00:00",
    "ERTrainingDate": "2023-08-24 00:00:00",
    "CoordinatingAgencyName": "Butler County EMA",
    "CoordinatingAgencyPhone": "7242845211",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000113153,
      "SummaryText": "ast five years.\n\nThe emergency response program [40 CFR 68.155(e)]:\nCalumet has developed a comprehensive emergency response plan which is regularly used to train both in-house and local area responders. Calumet is prepared to handle a worst-case release by training its emergency responders in HAZWOPER Level 3, 40 CFR, Section 1910.120.\n\nPlanned changes to improve safety [40 CFR 68.155(f)]:\nCalumet refining at Karns City, PA continually strives to improve its safety related systems. Its policies and procedures provide efficient means to minimize environmental impacts onsite and to the public. The facility restricts access to the Oleum storage tank to authorized personnel only, while surveillance cameras closely monitor operations for added security. Additionally, regular inspections, preventative maintenance, and internal and external audits of the system and safety mechanisms are conducted. A structured process is in place for the management team to review all potential process changes, including recommendations following process hazard analysis and compliance audits. These improvements, coupled with periodic reviews of current safety protocols, significantly reduce the risk of future incidents at Calumet in Karns City, PA.\n\nCalumet Karns City Refining, LLC has prepared this report to offer the public insights into our operations at this facility. We have confidence that the numerous safety measures we have implemented, coupled with our commitment to continuous improvement, make it highly unlikely for any incident to impact our employees or the surrounding area."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000113153,
      "SummaryText": "tors. Therefore, the facility qualifies for Program Level 1 compliance in accordance with the RMP regulation. No offsite population or sensitive receptors are within the zone of influence (toxic endpoint) as defined by the EPA.\n\nThe general accidental release prevention program and chemical-specific prevention steps [40 CFR 68.155(c)]:\nCalumet is not required to implement the Program Level 3 prevention program requirements under the RMP regulations because they are eligible for RMP Program Level 1. However, protecting the environment and the safety and health of employees, customers, contractors, communities, and the public is fundamental to the way Calumet conducts its business. To integrate environmental, safety, and health management into business activities, Calumet will:\n\n1.\tPursue excellence in the design, construction, operation, and restoration of all properties and facilities;\n2.\tBe a responsible steward of all products and services;\n3.\tTrain and prepare employees for emergencies and other contingencies;\n4.\tCommunicate openly regarding business activities;\n5.\tAssign clear responsibilities to all employees and contractors;\n6.\tProvide employees with resources and training to meet assigned responsibilities;\n7.\tAssess the potential risks of business activities;\n8.\tComply with all applicable laws and regulations;\n9.\tParticipate in the development of new laws, regulations, and technologies;\n10.\tReview performance and communicate progress; and\n11.\tExpect continuous improvement.\n\nThe facility stores Oleum in an aboveground storage tank. Mitigation measures to control the release include a concrete dike six feet in height that would be capable of containing more than 100% of the volume of the storage tank. Further, the tank is located approximately in the geographic center of the Calumet facility (not at the property border).\n\nThe five-year accident history [40 CFR 68.155(d)]:\nThe refining facility has had no accidents meeting the definition in 40 CFR 68.42 in the p"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000113153,
      "SummaryText": "This is an executive summary of the policies, procedures, and activities for compliance with the EPA's Accidental Release Prevention Requirements - Risk Management Program pursuant to Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) for Calumet Refining facility at Karns City, Pennsylvania. \n\nThe accidental release prevention and emergency response policies at the stationary source [40 CFR 68.155(a)]:\nCalumet is strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that encompasses design, installation, operating procedures, maintenance, and employee training. Robust engineering controls are in place to prevent possible releases of regulated substances. The Karns City facility is a responding facility for releases of the RMP-listed chemicals, so the site utilizes an Emergency Response Plan.\n\nThe stationary source and regulated substances handled [40 CFR 68.155(b)]:\nOleum is used in the white oil oleum process. The acid treatment process of white oil consists of two operating systems designed to contact white oil with fuming sulfuric acid (Oleum) and separate the acid sludge from the treated white oil or sour oil by means of a centrifugal contactor (pod) or stainless-steel agitator. This sour oil is then neutralized in one of five agitators with soda ash (sodium carbonate) or caustic (sodium hydroxide). The acid sludge is sent to storage before it is sent off-site to be regenerated into oleum for reuse. Oleum has 20% free sulfur trioxide and is the only chemical used in a process at the site, at any one time, in quantities above the RMP threshold applicability level.  \n\nWorst-Case Scenario review was performed with the ALOHA dispersion model. The results indicated that a potential release of oleum could not affect offsite receptors under release conditions mandated by the RMP rule. The area potentially impacted also does not contain any sensitive recep"
    }
  ]
}