{
  "FacilityID": 1000082222,
  "FacilityName": "Rapid Xchange",
  "FacilityStr1": "6280 Hobbton Hwy.",
  "FacilityStr2": null,
  "FacilityCity": "Clinton",
  "FacilityState": "NC",
  "FacilityZipCode": "28328",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37163",
  "LEPC": null,
  "FacilityLatDecDegs": "35.092714",
  "FacilityLongDecDegs": "-78.322111",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PP",
  "FacilityURL": "www.rapidxchange.com",
  "FacilityEmailAddress": "dparker@parkergas.com",
  "FacilityDUNS": 54411483,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David Parker",
  "OperatorStr1": "214 McLamb Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Newton Grove",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28366",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike McDonald",
  "RMPTitle": "Operations Manager",
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000242739",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-05-23 00:00:00",
  "SafetyInspectionBy": "NCDA-CS",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-08-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-08-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-11-26 00:00:00",
  "DeRegistrationEffectiveDate": "2019-11-15 00:00:00",
  "AnniversaryDate": "2024-08-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Source is cylinder exchange plant and is exempt from RMP.",
  "_processes": [
    {
      "ProcessID": 1000102737,
      "AltID": "2 OR MORE CONNECTED VESSE",
      "FacilityID": 1000082222,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000104006,
          "ProcessID": 1000102737,
          "NAICSCode": "42472",
          "_desc": {
            "NAICS_CODE": "42472",
            "NAICS_DESCRIPTION": "Petroleum and Petroleum Products Merchant Wholesalers (except Bulk Stations and Terminals)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128698,
          "ProcessID": 1000102737,
          "ChemicalID": 98,
          "Quantity": 126000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000628698,
          "ProcessID": 1000102737,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082222,
      "SummaryText": "Parker Gas Company, Inc. DBA Rapid X Change's.  Parker Gas Company has an excess of the threshold quantity of propane gas on its site and is therefore subject to the requirements of US EPA's Risk Management Program.\n\nThis document was prepared to satisfy the requirements of US EPA Section 112(r) of the Clean Air Act and 40 CFR, part 68, Chemical Accident Prevention Provisions (See US EPA website: https://www.epa.gov/rmp), North Carolina 15A NCAC 02D .2100 Applicability.  The owner/operator has completed the OSHA Process Safety Management (PSM) standard (29 CFR 1910.119) in May, 2019.  Owner has conducted a NFPA 58 Fire Safety Analysis.\n\n\n\nI)    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\nIn this distribution facility, we handle propane which is considered a regulated flammable substance by the US EPA.  The same properties that make propane valuable as a fuel also make it necessary to observe certain safety precautions in handling propane to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community.  It is our policy to adhere to all applicable federal, state and local rules and regulations.  Safety depends upon the manner in which we handle propane combined with the safe handling procedures that we use and the training of our personnel.\n\nOur emergency response program is based upon the NPGA's LP-Gas Safety Handbook, \"Guidelines for Developing Plant Emergency Procedures\" and \"How to Control LP-Gas Leaks and Fires\".  The emergency response plan, if required, includes procedures for notification of the local fire authority and notification of any potentially affected neighbors.\n\n\n\nII)    THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED:\n\nThe primary purpose of this facility is to repackage in 20 to 33 pound refurbished cylinders and distribute propane cylinders to wholesale customers.  Propane is also used at this facility for motor vehic"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082222,
      "SummaryText": "le fuel for the company's motor vehicles only (no public motor vehicle refueling).  Propane can be received by truck transports and stored in two aboveground tank(s).  Full propane cylinders are distributed to wholesale customers by truck transports.  This facility has equipment for propane motor fuel dispensing, unloading transports and cylinders refurbishing and refueling equipment.  Access to the site is restricted to authorized facility employees, authorized management personnel and authorized contractors.  The regulated substance handled at this distribution facility is propane. The maximum amount of propane per bulk tank, which can be stored at this plant is 100,800 pounds.\n\n\n\nIII)    THE WORST-CASE RELEASE SCENARIO(S) AND THE ALTERNATIVE RELEASE SCENARIO(S), INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO.\n\nWorst-Case Scenario: - Failure of largest tank when filled to the greatest amount allowed would release 100,800 pounds of propane.  Company policy limits the maximum filling capacity of largest tank to 80% at 60? F.  It is assumed that the entire contents are released as a vapor which finds an ignition source, 10% of the released quantity is assumed to participate in the resulting explosion.\n\nThe distance to the endpoint of a 1 psi overpressure for the worst case scenario is 0.40 miles.  This distance extends beyond the facility boundary, encompasses several residences, and several poultry barns. There are no High Valve Population Sources within alternative radius.\n\nAlternative Scenario: - The alternative/credible case scenario (truck pullaway) indicates that a 251 ft. radius for propane vapor to ignition sources exists.  If the vapor cloud is ignited within the 251 ft. radius, than the explosion/fireball hazard radius is 111 ft. (0.03 miles). There are no High Valve Population Sources within alternative radius.\n\n\n\nIV)    THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEP"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082222,
      "SummaryText": "S.\n\nThis distribution facility complies with EPA's Accidental Release Prevention Rule and with all applicable federal, state and local codes and regulations.  This facility was designed and constructed in accordance with NFPA-58.  All drivers have been thoroughly trained using NPGA's Certified Employee Training Program (CETP) or facility specific training.\n\nV)    FIVE-YEAR ACCIDENT HISTORY.\n\nThere has been an accidental release or ignition of propane in the last five years.\n\n\n\nVI)    THE EMERGENCY RESPONSE PROGRAM.\n\nWe have agreed to evacuate the facility employees in the event of a propane gas emergency.  Therefore, \n\nno emergency response plan is required.  However, for facilities with 11 or more employees, a written Emergency Action Plan and a Fire Prevention Plan must be implemented in accordance with OHSA 1910.38.  For facilities with 10 or fewer employees the plans may be communicated orally and the employer need not maintain a written plan on site.\n\n\n\nVII)    PLANNED CHANGES TO IMPROVE SAFETY.\n\nComplete this RMP and all requirements per inspection and maintenance procedures.  At our next available opportunity to do maintenance work, we will install a temperature & pressure gauge and update to NFPA 1998 standards as needed.\n\n \n\n"
    }
  ]
}