{
  "FacilityID": 1000014058,
  "FacilityName": "Monocacy Water Treatment Plant",
  "FacilityStr1": "1950 North Market St",
  "FacilityStr2": null,
  "FacilityCity": "Frederick",
  "FacilityState": "MD",
  "FacilityZipCode": "21701",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24021",
  "LEPC": "County Emergency Service Dpt.",
  "FacilityLatDecDegs": "39.445151",
  "FacilityLongDecDegs": "-077.391241",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cityoffrederick.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Frederick, MD",
  "Company2Name": null,
  "CompanyDUNS": 74927054,
  "Company2DUNS": null,
  "OperatorName": "City of Frederick",
  "OperatorStr1": "101 North Court",
  "OperatorStr2": null,
  "OperatorCity": "Frederick",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21702",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120255",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-03-18 00:00:00",
  "SafetyInspectionBy": "Ohio Casulatly Insurance Company",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-18 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.445151,
  "FRS_Long": -77.391241,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017607,
      "AltID": null,
      "FacilityID": 1000014058,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020931,
          "ProcessID": 1000017607,
          "ChemicalID": 62,
          "Quantity": 6300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000017991,
          "ProcessID": 1000017607,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000014499,
              "Process_NAICS_ID": 1000017991,
              "SafetyReviewDate": "2010-05-19 00:00:00",
              "PHA_Date": "2010-05-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-10-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "fusible plugs relieve pressure / heat",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-05-19 00:00:00",
              "TrainingReviewDate": "2010-05-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-05-19 00:00:00",
              "EquipmentInspectionDate": "2010-04-08 00:00:00",
              "EquipmentTested": "chlorination system",
              "ChangeMgmtDate": "2005-08-15 00:00:00",
              "ChangeMgmtReviewDate": "2005-04-08 00:00:00",
              "PreStartupReviewDate": "2005-08-15 00:00:00",
              "ComplianceAuditDate": "2010-05-18 00:00:00",
              "AuditCompletionDate": "2010-10-05 00:00:00",
              "IncidentInvestigationDate": "2005-02-13 00:00:00",
              "InvestigationChangeDate": "2005-02-13 00:00:00",
              "ParticipationPlansReviewDate": "2010-05-19 00:00:00",
              "HotWorkPermitReviewDate": "2010-05-19 00:00:00",
              "ContractorSafetyReviewDate": "2010-05-19 00:00:00",
              "ContractorSafetyEvalDate": "2010-05-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000017403,
                  "PreventionProgram3ID": 1000014499,
                  "ProcessChemicalID": 1000020931
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014058,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-05-19 00:00:00",
    "ERTrainingDate": "2010-03-12 00:00:00",
    "CoordinatingAgencyName": "Frederick Cty Div Fire-Rescue",
    "CoordinatingAgencyPhone": "3016001536",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 9,
      "FacilityID": 1000014058,
      "SummaryText": "ating procedures for potential safety improvements for all of its operations.  Currently, the City of Frederick management team and process safety team are reviewing potential upgrades to the existing design of the chlorine operations to make the system even safer to prevent a release and minimize consequences in the event of a release of chlorine.\nThe City of Frederick Water Treatment Plants compiled the EPA required Vulnerability Assessment.  Recommendations from the VA Report improve site security and safety over all including that of the chlorine system"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000014058,
      "SummaryText": "factor.  There are six each 150 pound cylinders on line, and one bank of six 150 cylinders on standby.  There is an automatic switchover within the vacuum pressure regulator.  One bank is in service and the other is on standby. \nThe low pressure system operates under a vacuum pressure of 13 inches of mercury.  A pressure relief valve downstream of the regulator vents if the pressure in the line reaches above 12 inches of water pressure.  All the pipe, tubes, and equipment are also chlorine compatible.  The system is designed to 150 psig or complete vacuum giving it a large safety factor over the typical vacuum or positive pressure in it.  A chlorine monitors detect the presence of chlorine in the storage/chlorine control room. \n5.\tFIVE YEAR ACCIDENT HISTORY (E)\nThe plant has been chlorine reportable and release free since 1992 to the present, 18 years as defined by 40.CFR-68.    \n6.\tEMERGENCY RESPONSE PROGRAM (F)\nEmergency response procedures are contained in both the Plant Emergency Response Policy and City Emergency Response Plan which is coordinated with the Frederick County Contingency Plan (Emergency Response Plan).  The plan includes an emergency response Â¿decision treeÂ¿ and a notification plan.  The Plant also has site specific emergency actions for small and large (reportable) release defined in the plants operating procedures and Emergency Response Plan.  Emergency response drills and drill evacuations are conducted annually by the operating department.  Emergency operation and response procedures are also reviewed annually.\nThe emergency response program (contingency plan) is coordinated (reviewed by) with the water plant Safety Committee, the City Fire and Police Departments.  The Water Plant and Fire Department coordinates with Local Frederick County Emergency Response Planning Committee (LEPC) and the Frederick County HazMat Team.  All are located in Frederick County, Maryland.  Copies of the program are given to key local agencies including: fire, me"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000014058,
      "SummaryText": "dical, rescue, management, and police departments.  Besides the specific emergency response program, key elements of the prevention programs are incorporated in the operating culture of the City water plant.\nThe Emergency Response or Contingency Plan procedures detail the actions and responses to chlorine spills (releases).  The plan includes training of all chlorine-area operators.  The primary response team includes the Frederick County Fire and Rescue, and Frederick County Haz Mat Teams.  All of these respond to severe chlorine leak situations.  Actions include response to: catastrophic, severe, and moderate leaks.  A Chlorine Â¿BÂ¿ Leak Repair Kit is maintained at the chlorine storage area to aid in stopping leaks.  Public notification is facilitated through the City Police and County SheriffÂ¿s Office, which has an automated emergency dialing message system for public notification.\n7.\tPERSONNEL (F) (1)\nPersonnel are the key resource of the City of FrederickÂ¿s prevention program.  City employees make up the operators and emergency first response teams.  The City of Frederick fosters a high level of involvement in every aspect of the chlorine system operations including participation in:\nÂ¿\tPSM/RMP safety teams, \nÂ¿\tDevelopment of the operation procedures, \nÂ¿\tHazard evaluations \nÂ¿\tProcess Hazards Analysis and  \nÂ¿\tOn-going training of the operators and other involved staff.\n8.\tCHANGES TO IMPROVE SAFETY (G)\nChanges to improve safety (recommended actions) were identified in the internal safety HazOp, tour, and audit of the RMP program to meet requirements of the Risk Management Prevention Program.  These recommended actions have now been evaluated and implemented as required.  Another major change was made to improve safety in 2005.  An Audit was conducted to review the RMP program in 1999 and April 2005 and 2010.  The key safety action items were completed.  See the Â¿UpdateÂ¿ Section 6 of this report.  The City of Frederick continually reviews implemented oper"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014058,
      "SummaryText": "failure of the regulator of the pressure system or the pipes/valves connected to one of the one-ton containers.  This failure was defined during the recent Process Hazards Analysis.  This failure is equal to creating a 0.004 square inch hole in the whip tube, a pipe, or even the container itself.  Modeling using the EPA/RMP Comp and EPAÂ¿s guidance demonstrated the rate of chlorine release is 14.8 lb. /minutes for a period of 30 minutes releasing a total of 150 pounds of chlorine from one container with the potential of release up to 440 lbs from a bank of 6 containers.  The toxic endpoint distances were determined using the following assumptions:\nÂ¿\tLargest single contains size 150 lb\nÂ¿\tA gas is liquefied under pressure, \nÂ¿\t14.8 lb/min release\nÂ¿\tquantity release 144 lbs from a single cylinder\nÂ¿\turban surroundings, \nÂ¿\t30 minute duration\n?\tno mitigation measure \n?\twind speed 3 meters/second\n?\tstability class D\n?\tAir temperature 77Â° F\nThe toxic endpoint is *** miles and in the process safety information.  The residential population that would be impacted by this release is *** and is recorded in the process safety information.  Receptors in this area were identified as residences, industrial areas, etc. (*Data is in PSI)\n4.\tACCIDENTAL RELEASE PREVENTION PROGRAM (D)\nThe City of Frederick accidental release prevention program is based on OSHAÂ¿s PSM program and EPAÂ¿s RMP Level 3 prevention program.  The PSM program has been effectively used for many years.  It and the RMP programs are part of the plants operating culture.  There are two parts to the program.  The first is the general overall Water and Sewer Division wide program and the Water Treatment Plant site program.  The second is the chlorine-specific actions within the site program.  Both are coordinated with the Frederick County Fire/Rescue Department (including the Haz Mat Team) and the Regional LEPC.\n4.1.\tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM   (D) (1)\nPlant-wide, many elements of the preventi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000014058,
      "SummaryText": "on program are used for all operations.  An overview of the generally written programs is listed below:\nThe City of Frederick has detailed process safety information on each of its operations. \nThe document maintenance system is integral to the management of change for all operations on site control.  This system is computer based.\nTraining is the backbone of employee knowledge, job operations and is ongoing in each area.  Employee training in operations and maintenance emphasizes awareness of the hazardous and toxic properties of all chemicals used. \nMaintenance and preventive maintenance are used for all operations making mechanical integrity a part of each piece of equipment.  The maintenance program uses a computer based work order system for scheduled mechanical integrity as well as for unplanned repairs and maintenance. \nIncident investigations of accidents and near-miss incidents ensure we learn from each event as well as correct the causes of the incident.  If there is a chlorine release, significant injury, or property damage; an investigating team is formed and reviews the incident within 48 hours of the determination of the occurrence. \nEmployees participate in all aspects of the plant as listed below under emergency response.  Employees are also safety committee members Process Hazards Review members and developers of the various P&PÂ¿s.\nSafe work practices are used throughout the facility including:  1) Hot Work Permits, 2) Lock Out Tag Out Permits, 3) Vessel Entry Permits, 4) Site Security, and 5) Breaking Into Chemical Lines. \nContractors must meet The City of FrederickÂ¿s high safety and technical standards as part of selection and ongoing evaluations.  In addition, City of Frederick demands training of contractors to our standards. \n4.2.\tCHLORINE SPECIFIC RESPONSE PROGRAM (D) (2)\n4.2.1.\tChlorine-Specific Operating Safety Information\nChemical-specific prevention features of the plant include: the policies and procedures listed above and those of the"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000014058,
      "SummaryText": "chlorine specific program.  These include:\n4.2.2.\tSpecific procedures for the management of the chlorine process \nThere is a specific procedure for the Completion of a Management of Change for all modified and/or new processes.  This is followed by Completion of a Pre-startup Safety Review prior to startup of the modified chlorine system.   \nThere are specific emergency response procedures for chlorine releases as outlined below under both operating procedures for small releases and in the emergency response procedures for large releases.  See the Emergency Response Program manual. \nThere is specific training in the properties, hazards, handling requirements, and leak repair for chlorine. \nFinally, the details of both facility and equipment design are key in the operations manual of the chlorine system.\n4.2.3.\tFacility Design\nThe plant includes a combined chlorine storage feed room / control room which meet and exceed design codes standards and good engineering practices.  The storage area / control building room is equipped with exhaust fan ventilation system.  There is a chlorine area monitor inside the room.  If chlorine is detected, the monitor alarms and a flashing red light illuminates as well as in the water plant control room.  The alarm system is tied into the security system which alerts management.   \n4.2.4.\tEquipment Design\nThere are two types of chlorine pipe systems, high pressure and low (vacuum) pressure.  The high pressure chlorine piping system consists of a yoke attached to each of the six 150 lb cylinders.  A flexible tube that connects to the header that has a main block valve end feeds into the strainer followed by an angle valve and vacuum/pressure regulator.  These parts are made of anhydrous (elemental) chlorine compatible materials; steel, copper or chlorine compatible non-metallic compound (not corroded by chlorine) rated to 500 psig.  The maximum pressure of the chlorine in the high pressure system is only 150 psig giving a 3 to 1 safety"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014058,
      "SummaryText": "1.3.\tPREVENTION PROGRAM LEVEL 3 (A) (2)\nThe City of Frederick maintains policies, procedures and systems as part of their prevention program.  These are applied to each treatment plant and specifically the Monocacy Water Treatment Plant.  The program addresses each of the EPA Program Level 3-listed 12 elements, and RMP elements needed to implement the program, and the like elements in place in the plantsÂ¿ OSHA PSM program which the City has been in compliance.  These documents are maintained City of FrederickÂ¿s water plant Superintendent and the CityÂ¿s Risk Coordinator.\n2.\tSTATIONARY SOURCE AND REGULATED SUBSTANCE \nThe City of Frederick Water Treatment Plant employs six (6) full-time employees engaged in water treatment plant and field operations.  Chlorine is used as part of the treatment process.\n2.1.\tSITE DESCRIPTION (B) (1)\t\nThe site is owned and operated by The City of Frederick and managed by its Public Works Department.  The site is located at 1950 North Market Street, Frederick, Frederick County, Maryland.  The site is located in an industrial area on North Market Street.\nThe Plant includes a separate chlorine storage feed room control room which also houses the injection feed distribution system.  The chlorinated water feeds various injector points in the plant.  Chlorinated water beyond the chlorine control room is outside in the boundaries of this process. \nThe boundaries of the chlorine system subject to the RMP regulation include the 150 pound Chlorine Cylinder Storage Feed Control /Chlorination Control Room, associated vent makeup, exhaust systems and chlorine injection units in the area that supports the system.  These are detailed in the Process and Instrument Drawings (P&ID) which are part of the plant Process Safety Information (PSI).  All drawings are maintained in the plants RMP Process Safety Information.\n2.2.\tREGULATED SUBSTANCE (B) (2)\nChlorine is the only regulated substance on site which exceeds the EPA 40 CFR-68 rule threshold quantity"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014058,
      "SummaryText": "of 2500 pounds.  The City of Frederick chlorine process was installed as part of the process of purifying water for public consumption.  It operates under permit from the State of Maryland Department of Environmental Protection (MD DEP).  The chlorine is received, stored in 150 pound cylinders.  It is then distributed to several process control systems. \nChlorine is an EPA and OSHA-listed toxic chemical.  It is an irritant and corrosive.  Chlorine is a halogen with the formula Cl2.  Chlorine is an oxidizing agent that is non-flammable.  It has a 1 ppm OSHA ceiling 15 minute permissible exposure limit (PEL) and a NFPA health rating of 4, severe; with an immediately dangerous health hazards (IDLH).  Chlorine is not a carcinogen.\nThe maximum threshold quantity stored on site is forty-two (42) containers.  This equals 6,300 pounds.  The immediate dangerous health (IDLH) level is 10 ppm and a lethal concentration (LC-5O) of 250 ppm.\n3.\tHAZARD ASSESSMENT\nA hazard assessment was performed to determine the effects a release would have on the public and environment surrounding the plant.  For chlorine, the distance to the endpoint concentration of the gas was determined.  In addition, an estimate of the population that could be affected by a release of chlorine was determined, and sensitive receptors such as hospitals, schools, and nursing homes were identified.  The hazard assessment considers two release scenarios a worst case and an alternative case.  The City maintains a five-year accident history for the WTP chlorine system (see section 4 below: five year accident history).\nTwo offsite consequence analyses were conducted which include two chlorine release scenarios.  The first is a worst case release.  The second is a more probable alternative release scenario.  The first scenario is defined by EPA, which states that Â¿the operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes due to an unspecified failure."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014058,
      "SummaryText": "The alternative scenario is defined as more likely to occur than the worst-case scenario.\nAtmospheric dispersion modeling was performed to determine the distance traveled by the chlorine released before its concentration decreases to the toxic endpoint.  The EPA specified endpoint for chlorine is 0.0087 mg/l which equals 3 ppm.  The 3 ppm endpoint is the Emergency Response Planning Guideline Level 2 (ERPG-2).  This is defined by the American Industrial Hygiene Association (AIHA) as the Â¿maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.  The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined, to estimate the population potentially affected.\n3.1.\tWORST CASE   (C) (1)\nAtmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions and EPAÂ¿s RMP Comp air dispersion program.  Data and assumptions used were: \nÂ¿\tlargest single container size 150 lb\nÂ¿\tA gas is liquefied under pressure, \nÂ¿\tCylinder release of  150 lbs, \nÂ¿\tDuration of release is 10 minutes   \nÂ¿\tNo passive mitigation measure\nÂ¿\tTopography: urban surroundings (many structures in area)\nÂ¿\tWind speed 1-5 meters/second\nÂ¿\tStability Class F\nÂ¿\tAir temperature 77 degrees F.  \nResults demonstrate a distance to the toxic endpoint of *** miles containing *** square miles of area assuming an urban topography without an enclosure.  The residential population that could potentially be affected by the release is *** individuals based on the U. S. Census 2000 demographic data.  There are residences and other receptor sites included in that release area (schools, commercial facilities and parks) (data is in PSI).\n3.2.\tALTERNATIVE CASE   (C) (2)\nThe alternative release scenario involves the"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014058,
      "SummaryText": "CITY OF FREDERICK\nFREDERICK MONOCACY WATER TREATMENT PLANT\nRISK MANAGEMENT PROGRAM RE-SUBMITTAL\nEXECUTIVE SUMMARY\n\n1.\tEXECUTIVE SUMMARY INTRODUCTION 68.155                                                                        \nThe City of Frederick Utilities Department operates the Monocacy Water Treatment Plant at 1950 North Market Street, Frederick, Frederick County, Maryland.  This plant is one of four water plants operated by the City.  The City also operates one wastewater treatment plant.  The Monocacy water plant as well as the Lingamore water plant and the wastewater plant have quantities of regulated hazardous chemicals above the EPA threshold.  The City has a unified Risk Management Program which applies to each plant.  Only the Monocacy Water Treatment Plant operations and policies are presented in this Plan.\n1.1.\tACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE POLICIES     (A)\nThe City of Frederick Water Treatment Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures and management practices.  The plant prevention program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR-68 Prevention Program under the Clean Air Act Amendments of 1990.\n1.2.\tMANAGEMENT SYSTEMS (A) (1)\nThe City of Frederick has a management system in place which is lead by the CityÂ¿s Mayor, who delegates implementation and on-going use of the RMP elements to the Public Works Department Director.  The Director delegates the RMP program to the Utilities Acting Deputy Director who has responsibility for water treatment plant operations and RMP Program implementation.  This program, along with other City-wide and plant-specific policies, eliminates and /or reduces the likelihood of a hazardous chemical release at the plant.  An organizational chart defining the lines of authority and responsible staff is included in the plants RMP Process Safety Information."
    }
  ]
}