{
  "FacilityID": 1000078281,
  "FacilityName": "Trinity Manufacturing, Inc.",
  "FacilityStr1": "11 E.V. Hogan Drive",
  "FacilityStr2": null,
  "FacilityCity": "Hamlet",
  "FacilityState": "NC",
  "FacilityZipCode": "28345",
  "Facility4DigitZipExt": "8821",
  "FacilityCountyFIPS": "37153",
  "LEPC": "Richmond County LEPC",
  "FacilityLatDecDegs": "34.918889",
  "FacilityLongDecDegs": "-079.673333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "LF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 555424019,
  "ParentCompanyName": "Trical, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 28715530,
  "Company2DUNS": null,
  "OperatorName": "Daryl Mitzel",
  "OperatorStr1": "PO Box 1519",
  "OperatorStr2": null,
  "OperatorCity": "Hamlet",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28345",
  "OperatorZipCodeExt": "1519",
  "FTE": 105,
  "OtherEPAFacilityID": "28345TRNTY11EVH",
  "EPAFacilityID": "100000059278",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-01-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-07-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2022-09-21 00:00:00",
  "DeRegistrationEffectiveDate": "2022-09-16 00:00:00",
  "AnniversaryDate": "2024-07-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.918889,
  "FRS_Long": -79.673333,
  "FRS_Description": "LOADING FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097532,
      "AltID": "Pesticide Manufacturing",
      "FacilityID": 1000078281,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122084,
          "ProcessID": 1000097532,
          "ChemicalID": 62,
          "Quantity": 720000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000098782,
          "ProcessID": 1000097532,
          "NAICSCode": "32532",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000082824,
              "Process_NAICS_ID": 1000098782,
              "SafetyReviewDate": "2017-04-05 00:00:00",
              "PHA_Date": "2017-04-05 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "C Kit and water tub to absorb chlorine vapors coming from tank vent",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-04-26 00:00:00",
              "TrainingReviewDate": "2018-01-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-07-17 00:00:00",
              "EquipmentInspectionDate": "2019-07-15 00:00:00",
              "EquipmentTested": "T-1308 CL2 Air Separation Tank",
              "ChangeMgmtDate": "2015-07-10 00:00:00",
              "ChangeMgmtReviewDate": "2019-05-13 00:00:00",
              "PreStartupReviewDate": "2010-12-01 00:00:00",
              "ComplianceAuditDate": "2017-11-09 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": "2018-08-17 00:00:00",
              "InvestigationChangeDate": "2018-09-05 00:00:00",
              "ParticipationPlansReviewDate": "2018-01-18 00:00:00",
              "HotWorkPermitReviewDate": "2019-02-18 00:00:00",
              "ContractorSafetyReviewDate": "2019-04-03 00:00:00",
              "ContractorSafetyEvalDate": "2018-01-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000102868,
                  "PreventionProgram3ID": 1000082824,
                  "ProcessChemicalID": 1000122084
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000078281,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-07-04 00:00:00",
    "ERTrainingDate": "2018-10-24 00:00:00",
    "CoordinatingAgencyName": "LEPC, Richmond County",
    "CoordinatingAgencyPhone": "9109978238",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Hazardous Materials Management Plan",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078281,
      "SummaryText": "ounty Sheriff's Department, the NC Highway Patrol, and the Richmond County Emergency Medical Services.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY:\r\n\r\nThis facility is constantly looking for ways to improve upon the existing safety systems and on safety for both the employees and members of the surrounding area.  In 2012, this facility joined the American Chemistry Council and committed to its Responsible Care (Product Stewardship) program. In 2016, Trinity achieved full certification of its Responsible Care Management System by third party audit and maintains its commitment to continuous improvement going forward."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078281,
      "SummaryText": "STATUS SUMMARY\r\n\r\nIn June 2008, a continuous process to manufacture commodity and agricultural chemicals using electrolyzer technology to produce chlorine was constructed and started up at Trinity. This allowed the shutdown of the older batch processes requiring the purchase of liquid chlorine in railcars. From a safety standpoint, the continuous process consumes chlorine as soon as it is produced.  There are no chlorine liquefaction or storage capabilities and therefore chlorine inventory levels are below the threshold quantities. \r\n\r\nHowever, the capability to perform batch processing with liquid chlorine was maintained along with Trinity's Risk Management Plan. In 2010, the need arose to supplement Trinity's on-site chlorine production with purchased liquid chlorine in railcars. A vaporizer was installed to facilitate feed from railcars into the continuous process. A PHA was completed as well as a Pre-Startup Safety Review (PSSR). By December 2010, Trinity once again received and processed liquid chlorine from railcars. \r\n\r\nTrinity has increased its on-site chlorine production capacity since 2010, and in 2016 a chlorine compression and drying system was installed. This installation has eliminated the need to purchase liquid chlorine in railcars. The chlorine that is produced, compressed, and dried at Trinity continues to be consumed immediately with no on-site storage, and Trinity has calculated 670.4 lbs as the maximum amount of chlorine that may be help up in process equipment. Although the on-site inventory levels are below the threshold quantities, the vaporizer and all associated equipment will continue to be maintained along with the Risk Management Plan in the event Trinity needs to bring a chlorine railcar back on-site. To date, Trinity has not had a liquid chlorine railcar on-site since October 2017.\r\n\r\nNOTE:  In the event Trinity has the need to bring a chlorine railcar back on-site to meet business needs, a Chlorine Railcar Return Checklist has been de"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078281,
      "SummaryText": "veloped to document the requirements to be met prior to putting that railcar into service.  A new Pre-Startup Safety Review (PSSR) is included in that checklist.\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\r\n\r\nChlorine is a toxic chemical regulated by EPA and other governmental agencies; therefore, certain safety precautions are observed when handling chlorine to prevent unnecessary human exposure, to reduce the threat to the health of the employees at this facility, and to reduce the threat to nearby members of the community. Safety precautions followed by the facility in the use and handling of chlorine come from the recommendations of the Chlorine Institute as well as the recommendations of many of the equipment and systems manufacturers.\r\n\r\nIt is this facility's policy to adhere to applicable federal, state, and local laws and regulations. This facility complies with the OSHA Process Safety Management standard and trains its employees to perform emergency response to hazardous materials incidents in accordance with the OSHA HAZWOPER standard. In addition to the facility Emergency Response Plan, the facility has implemented a Hazardous Materials Management Plan, which address prudent management of the facility's hazardous materials as well as emergency response procedures. These plans outline who should be contacted and what steps should be taken in the event of an emergency. If an emergency were to occur, it is this facility's policy to alert the following outside agencies: Hamlet Fire Department, Richmond County Sheriff's Dept, the NC Highway Patrol, Richmond County Medical Services, and the Richmond County Local Emergency Planning Committee.\r\n\r\nTHE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED:\r\n\r\nThis facility is a chemical manufacturer of agricultural chemicals and commodity chemicals such as bleach and caustic. Chlorine is an ingredient used in the manufacture of these products. Liquid chlorine may be brought onsite in railcars"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078281,
      "SummaryText": ". These railcars are maintained inside the fenced area of the facility. Only one railcar is hooked up to supply batch processes at any one time. Chlorine detectors are installed at each railcar unloading point. In addition, chlorine has a strong, distinct odor; therefore, a leak should be detected within seconds of occurring by the detectors as well as by human senses. Since detection should occur soon after a leak begins, offsite impacts should be minimal, if any occurs at all.\r\n\r\nThe liquid chlorine supply system consists of the railcars onsite and associated piping, valves, and detection equipment. In accordance with the recommendations of the Chlorine Institute and our chlorine suppliers, there is a safety shutoff device at the unloading valve on the railcar being unloaded, a safety shutoff valve where the railcar transfer hose attaches to the fixed piping of the plant system, and a safety shutoff valve midway to the process in the event of a problem. These valves can be activated from multiple remote areas of the facility thereby shortening the release time involved with potential chlorine releases. There are two chlorine \"C\" kits available for handling railcar emergencies. Piping has been labeled and color-coded to minimize misidentification.\r\n\r\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS:\r\n\r\nThis manufacturing facility complies with EPA's accident prevention rule, OSHA's PSM rule and other applicable federal, state, and local laws. The facility follows the guidelines of the Chlorine Institute and its suppliers in the use and handling of chlorine. This includes the design of piping installations, materials of construction, release detection equipment, maintenance procedures, emergency response procedures, and release mitigation equipment and installations as well as normal process activities. The emergency response plan deals with the safety of the employees in the event of an accident and minimizing the release of any c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078281,
      "SummaryText": "hemical onsite, including chlorine.\r\n\r\nEach employee receives hands on training in the use of emergency mitigation equipment, personal protective equipment, and communications equipment. Each employee receives training in all aspects of the emergency plan and program, and drills are performed at least once a year. Training is conducted throughout the year on various aspects of the routine handling and emergency response aspects associated with chlorine. Written procedures have been developed that address all chlorine handling activities from bringing the railcar onto the facility, connecting to and disconnecting from the railcar, to transferring chlorine from the railcar into the process, and includes what to do if abnormal circumstances occur. Employees are observed when performing tasks related to the process and given feedback on their understanding and adherence to written procedures.\r\n\r\nOn-site training has been conducted with outside agencies that would be responding to emergencies. This facility provides the outside agencies familiarization of the facility and potential hazards. The agencies that would be contacted for an emergency are the Hamlet Fire Department, the Richmond County Sheriff's Department, the NC Highway Patrol, Richmond County Emergency Medical Services, and the Richmond County Local Emergency Planning Committee.\r\n\r\nFIVE YEAR ACCIDENT HISTORY:\r\n\r\nThere has not been an incident involving chlorine that caused death, injury, property or environmental damage, or evacuations at this facility in the past five years. \r\n\r\nTHE EMERGENCY RESPONSE PROGRAM:\r\n\r\nIn the event of an emergency involving chlorine, employees can immediately shutdown the transfer operation from a remote location, which sounds an on-site emergency alarm. If further action is required to stop a railcar release, employees can install a C-kit on the railcar. It is this facility's policy to notify the following outside agencies in event of emergency: Hamlet Fire Department, Richmond C"
    }
  ]
}