{
  "FacilityID": 1000013717,
  "FacilityName": "CLMSD Wastewater Treatment Plant",
  "FacilityStr1": "795 Linda Ln",
  "FacilityStr2": null,
  "FacilityCity": "Lakeport",
  "FacilityState": "CA",
  "FacilityZipCode": "95453",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06033",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "39.014772",
  "FacilityLongDecDegs": "-122.924528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Lakeport",
  "OperatorStr1": "225 Park St.",
  "OperatorStr2": null,
  "OperatorCity": "Lakeport",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95453",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dan Buffalo",
  "RMPTitle": "Compliance Officer",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000211102",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-08-01 00:00:00",
  "SafetyInspectionBy": "Lake County CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017096,
      "AltID": null,
      "FacilityID": 1000013717,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017490,
          "ProcessID": 1000017096,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000020324,
          "ProcessID": 1000017096,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000520324,
          "ProcessID": 1000017096,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013717,
      "SummaryText": "The City of Lakeport has instituted a Risk Management Program for their wastewater treatment plant, containing chlorine, a regulated substance (RS) as required by Federal Accidental Release Prevention (ARP) Program regulations at 40 CFR Part 68.  The Risk Management Program identifies the equipment, procedures, maintenance, inspection, and training associated with Regulated Substances (RS's) handled at this facility in excess of Federal threshold quantities; describes the structured assessment of hazards which was conducted to assess possible effects on employees and offsite public and environmental receptors; provides the results of an offsite consequences analysis; defines a prevention program, emergency response program, and mitigation measures to reduce the probability and magnitude of accidental releases of RS's; and establishes a schedule and responsibilities for implementation of mitigation measures and auditing of program elements.  This Risk Management Plan(RMP) is being filed as required by Federal ARP and CalARP regulations in order to report the elements of the current Risk Management Program and to describe further measures planned to mitigate or prevent accidental releases of RS's.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nThe City of Lakeport Wastewater Treatment Plant is located at 795 Linda Lane, Lakeport, CA in Lake County, and uses chlorine, a RS, for disinfection in quantities greater than the California threshold quantity for this RS.  The facility is located in a low density residential area.  There are no full-time employees at this site.  City operators visit the site daily.  Chlorine is received in 2000lb. (ton) containers by truck, handled with a crane, and stored secured by chains to the tunnions inside the building.  The chlorine is used to disinfect the treated water.   Automatic switchover vacuum regulator valves are attached to the gas valves of two cylinders, one on line and one standby.  Up to two full ton containers are c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013717,
      "SummaryText": "hained to the trunnions in the same room.  Chlorine under vacuum is metered through a rate valve in a chlorinator, and drawn into water solution by the passage of pressurized water through an injector.\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nIt is the policy of the City of Lakeport that the receipt, storage and handling of chlorine at its facility be done in a manner which meets regulatory requirements and minimizes the probability and severity of accidental releases of chlorine to the atmosphere, in order to protect the health and safety of its workers, the public, and the environment.  In order to accomplish this goal, the City of Lakeport has gathered safety information on chlorine and on the process, equipment and procedures involving chlorine; performed a structured assessment of hazards of the process and external events which might affect the process; performed an offsite consequences analysis of defined release scenarios; established a written program for prevention and mitigation of accidental releases; and established a written emergency response program coordinated with emergency response agencies.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAMS\n\nGeneral accidental release prevention programs instituted by the City of Lakeport are categorized as administrative (management) programs; procedures, training, and engineering controls; and emergency response programs.  The City of Lakeport has instituted a Process Safety Management (PSM) Program meeting OSHA requirements at 29 CFR 1910.119 and Cal/OSHA requirements at 8 CCR A?5189 covering the chlorine process at its Wastewater Treatment Facility utilizing chlorine in ton containers.  The program and document management procedures included in the PSM Program are used as the management system for the Risk Management Program.\n\nCHEMICAL-SPECIFIC RELEASE PREVENTION STEPS\n\nRelease prevention steps specific to chlorine have been identified and implemented.  These include, among other things, c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013717,
      "SummaryText": "reation of written procedures for chlorine receiving and cylinder changing.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidents involving chlorine at this facility within the past five years resulting in injuries or offsite consequences.\n\nEMERGENCY RESPONSE PROGRAM\n\nThe City of Lakeport's Emergency Response Program applicable to chlorine has been coordinated with Lake County Environmental Health Division, the local agency responsible for hazardous materials inventory reporting and release response coordination.  The emergency response plan for chlorine releases is to evacuate the area and call public agency First Responders.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nAll of the improvements and mitigation measures identified in the Process Hazard Analysis which the City of Lakeport committed to accomplish have been completed or are in progress.  Any other measures identified by employees during workplace hazard surveys, or as a result of audit activities, will be thoroughly reviewed and considered for implementation."
    }
  ]
}