{
  "FacilityID": 1000014285,
  "FacilityName": "Reese Micronutrient Operations",
  "FacilityStr1": "2405 W. Vassar Road (M-15)",
  "FacilityStr2": null,
  "FacilityCity": "Reese",
  "FacilityState": "MI",
  "FacilityZipCode": "48757",
  "Facility4DigitZipExt": "0383",
  "FacilityCountyFIPS": "26145",
  "LEPC": "Saginaw County LEPC",
  "FacilityLatDecDegs": "43.441111",
  "FacilityLongDecDegs": "-083.752778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79809555,
  "ParentCompanyName": "Advanced Micronutrient Products, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 249568056,
  "Company2DUNS": 0,
  "OperatorName": "Terry Hart",
  "OperatorStr1": "2405 W. Vassar Road (M-15)",
  "OperatorStr2": null,
  "OperatorCity": "Reese",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48757",
  "OperatorZipCodeExt": "0383",
  "RMPContact": "Terry Hart",
  "RMPTitle": "Operations manager",
  "FTE": 30,
  "OtherEPAFacilityID": "MID061895090",
  "EPAFacilityID": "100000112585",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-09-08 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.44171,
  "FRS_Long": -83.75048,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017862,
      "AltID": "Fertilizer Blending",
      "FacilityID": 1000014285,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018194,
          "ProcessID": 1000017862,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021177,
          "ProcessID": 1000017862,
          "ChemicalID": 56,
          "Quantity": 73440.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521177,
          "ProcessID": 1000017862,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014285,
      "SummaryText": "RMP  2015\n\nExecutive Summary\n\nReese Operations\n\n\n\n1. Corporate Prevention and Emergency Response Approach\n\nAdvanced Micronutrient Products, Reese Operations is committed to employee and public safety as well as environmental stewardship.  The operation has implemented measures intended to prevent possible releases of regulated substances. In the unlikely event of a release, the Reese Operation has an emergency response plan in place to minimize the potential effects of a release.\n\n\n\n2. Description of Stationary Source\n\nThe facility's primary activities encompass Manufacturing and blending of Micronutrients, Nitrogen, Phosphate and Potash Fertilizers.  Ammonia (anhydrous) is used for blending with Phosphate Fertilizers. The maximum inventory of Ammonia (anhydrous) at our facility is 73,440 lb.\n\n\n\n3. Prevention Program\n\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements\n\nset out under 40 CFR part 68 of the EPA. The following sections briefly describe the elements of the release\n\nprevention program that is in place at our stationary source.\n\nEmployee Participation:\n\nCompany employees are encouraged to express their views concerning accident prevention issues and to\n\nrecommend improvements. In addition, our employees have access to all information created as part of the\n\nfacility's implementation of the RMP rule, including information resulting from process hazard analyses in\n\nparticular.\n\nProcess Safety Information:\n\nAdvanced Micronutrient Products, Reese Operations maintains a detailed record of safety information associated with the covered process, which includes P&IDs, Flow Diagrams, and Operating Procedures.\n\nProcess Hazard Analysis:\n\nThe facility conducts comprehensive studies as per the regulatory requirements to ensure that hazards associated with our processes are identified and controlled. The methodology used to carry out these analyses is the What If methodology. The studies are undertaken by a team "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014285,
      "SummaryText": "of qualified personnel with expertise in process operations led by an outside engineering consultant who specializes in RMP's.\n\nOperating Procedures:\n\nFor the purposes of safely conducting activities within our covered processes, Advanced Micronutrient Products, Reese Operations maintains written operating procedures. The information is readily accessible to operators involved in the processes.\n\nTraining:\n\nAdvanced Micronutrient Products, Reese Operations has a training program in place to ensure that employees who are operating the processes under our RMP are competent in the operating procedures associated with these processes.  All procedures are reviewed by the employees annually.\n\n  \n\nContractors:\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.\n\nAdvanced Micronutrient Products, Reese Operations has a policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\nPre-startup Reviews:\n\nPre-start up safety reviews will be conducted as a regular practice as new processes are implemented and as\n\nmodifications are made within established processes as per out MOC requirements. These reviews are to be conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nMechanical Integrity\n\nAdvanced Micronutrient Products, Reese Operations carries out documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014285,
      "SummaryText": "training as needed. Any equipment deficiencies identified by the maintenance checks are\n\ncorrected in a safe and timely manner.\n\nManagement of Change:\n\nWritten procedures are in place at Advanced Micronutrient Products, Reese Operations to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are made aware of and offered training to deal with the modification.\n\nIncident Investigation\n\nAdvanced Micronutrient Products, Reese Operations investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\n\n\n\nCompliance Audits:\n\nAdvanced Micronutrient Products, Reese Operations conducts audits at least every three years to determine whether the provisions set out under the RMP rule are being implemented.\n\n\n\n4. Accident History\n\nAgrium, Reese Operations has had an excellent record of preventing accidental releases for more than 10 years.\n\nDue to our stringent release prevention policies, there has   been no accidental release that resulted in on-site\n\nor off-site injuries during this period.\n\n\n\n5. Emergency Response Plan\n\nAgrium, Reese Operations carries a written emergency response plan to deal with accidental releases of\n\nhazardous materials. The plan includes all aspects of emergency response including adequate first aid and\n\nmedical treatment, evacuations, notification of local emergency response agencies and the public.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In\n\naddition, the plan is updated to reflect any pertinent changes taking place within our processes that would\n\nrequire a modified em"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014285,
      "SummaryText": "ergency response plan. Saginaw County LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n"
    }
  ]
}