{
  "FacilityID": 1000102534,
  "FacilityName": "Advario Texas City LP",
  "FacilityStr1": "2800 Loop 197 South",
  "FacilityStr2": null,
  "FacilityCity": "Texas City",
  "FacilityState": "TX",
  "FacilityZipCode": "77590",
  "Facility4DigitZipExt": "4621",
  "FacilityCountyFIPS": "48167",
  "LEPC": "Galveston County LEPC",
  "FacilityLatDecDegs": "29.361667",
  "FacilityLongDecDegs": "-094.918056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.advario.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Advario Texas City LP",
  "OperatorStr1": "P.O. Box 29",
  "OperatorStr2": null,
  "OperatorCity": "Texas City",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77592",
  "OperatorZipCodeExt": "0029",
  "FTE": 86,
  "OtherEPAFacilityID": "TXR000059501",
  "EPAFacilityID": "100000129933",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-01422",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-10-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-10-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-10-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-10-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 29.360344,
  "FRS_Long": -94.907173,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000127341,
      "AltID": "Marine Terminal",
      "FacilityID": 1000102534,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000159491,
          "ProcessID": 1000127341,
          "ChemicalID": 29,
          "Quantity": 50000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000128734,
          "ProcessID": 1000127341,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000079117,
              "Process_NAICS_ID": 1000128734,
              "SafetyReviewDate": "2022-03-15 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2017-11-05 00:00:00",
              "ChangeCompletionDate": "2020-01-20 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Electrical storm/lightning; Movement of vessel",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-04-14 00:00:00",
              "TrainingReviewDate": "2022-04-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-03-15 00:00:00",
              "EquipmentInspectionDate": "2015-02-19 00:00:00",
              "EquipmentTested": "TAnk 3735",
              "ComplianceAuditDate": "2020-11-06 00:00:00",
              "AuditCompletionDate": "2020-11-06 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2018-08-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000079824,
                  "PreventionProgram2ID": 1000079117,
                  "ProcessChemicalID": 1000159491
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000102534,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-08-18 00:00:00",
    "ERTrainingDate": "2022-08-18 00:00:00",
    "CoordinatingAgencyName": "Galveston County LEPC",
    "CoordinatingAgencyPhone": "2813095002",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000102534,
      "SummaryText": "EXECUTIVE SUMMARY\n\nAdvario Texas City\nMarine Terminal\n2800 Loop 197 South\nTexas City, Texas 77590\n\n|====================|\n|RISK MANAGEMENT PLAN|\n|====================|\n\nAdvario Texas City, L.P. (Advario Texas City) operates a marine terminal that stores chemicals including specialty polymers, solvents, intermediates, monomers and industrial products.  Operations occurring at Advario Texas City are marine/overland vessel loading/unloading, storage, transportation, and distribution of chemicals.  U.S. Environmental Protection Agency (EPA) regulations presented in Title 40 Code of Federal Regulations Part 68 (40 CFR 68), the Chemical Accident Prevention Provisions, require Advario Texas City to comply with the Risk Management Program (RMP) rule because the quantity of vinyl acetate monomer stored onsite exceed threshold quantities.\n\nThe RMP rule requires a facility to report the unit inventory for each RMP substance that exceeds threshold quantities, along with an EPA-approved chemical release prevention program.  In addition, 40 CFR 68 requires all RMP-covered facilities to update its Risk Management Program Plan (\"RMP Plan\") at certain intervals, among which is the onsite presence of a new chemical in an amount greater than its threshold quantity.  The initial RMP Plan for Advario Texas City was submitted to the EPA in November 2004.  The June 2007 revision included updates to terminology to more clearly reflect operations at Advario Texas City, stylistic and grammatical corrections, and expansions of the assumptions made and techniques employed in the evaluation of release quantities, release rates, and impacts.  The August 2007 revision contains changes and updates that resulted from an EPA RMP inspection in June 2007.  The September 2008 revision contains changes and updates that resulted from the Permit By Rule (\"PBR\") 83949 authorization of three new products that contain isopentane, pentane, and 1 pentene.  This revision contains products to be introduced by a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000102534,
      "SummaryText": "recent amendment of TCEQ Air Permit No. 4804 and the potential pending storage of crude oil, which is already authorized by Permit 3284.  As a result of changes authorized by the amendment of Permit 4804, threshold amounts of the flammable substances 1,3-butadiene, ethylene, and 1-butene were added.  However, the pressurized bullet tanks authorized in Permit 4804 to store propylene, 1,3-butadiene, ethylene, and 1-butene no longer exists at the site; therefore, these compounds have been removed.  Also, due to the pending storage of crude oil, the toxic substance hydrogen sulfide was added to the RMP.  Due to revised H2S concentrations in crude oil, it was determined that H2S is <1.0% in the crude oil mixture.  Therefore, per 40 CFR 68.115(b)(1) H2S is not required to be included. \n\nPotential offsite consequences of hypothetical Worst-Case Scenarios (WCS) and Alternative Releases Scenarios (ARS) were conducted using the EPA program RMP*Comp as well as the RMP Guidance for Offsite Consequence Analysis.  Although numerous controls are in place to prevent chemical releases and manage such consequences should an incident occur, no credit for active mitigation measures was taken into account in evaluating the worst case and alternative release scenarios.\n\nAs required by the RMP regulations, worst-case and alternative release scenarios were generated for toxic releases.  Details regarding the worst-case and alternative release scenarios for Advario Texas City are provided in the RMP Plan.\n\nAdvario Texas City currently holds the following RMP-regulated substances above threshold quantities:\n\nRegulated Chemical\tCAS Number\tCharacteristic\tThreshold (lbs)\nVinyl Acetate Monomer\t108-05-4\t\tToxic chemical\t15,000\n\n|================================|\n|KEY OFFSITE CONSEQUENCE ANALYSIS|\n|================================|\n\n40 CFR 68 requires all facilities subject to the Chemical Accident Prevention Provisions rule to conduct an Offsite Consequence Analysis (OCA) to provide information to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000102534,
      "SummaryText": "the public as well as state and federal environmental agencies about any potential consequences of an accidental chemical release.  OCA's are essential in identifying potential hazards of accidental release.  OCA's can consist of 2 elements, a worst-case scenario (WCS) and an alternative release scenario (ARS) for each type of chemical (either flammable or toxic) handled at the facility in a quantity greater than that chemical's threshold as listed in 40 CFR §68.130.\n\n|==========================|\n|FIVE-YEAR ACCIDENT HISTORY|\n|==========================|\n\nThe Advario Texas City Marine Terminal, in the past five (5) years, has not incurred any chemical releases that resulted in any known onsite or offsite deaths, injuries, significant damage, evacuations or sheltering in place, property damage, or environmental damage.  \n\n|======================================|\n|ACCIDENTAL RELEASE PREVENTION POLICIES|\n|======================================|\n\nThe plans for evacuation and accounting for personnel after an evacuation at the Advario Texas City Marine Terminal are located onsite for all personnel to review. \n\nIf a release occurs, arrangements are described in the Emergency Response Plan/Integrated Contingency Plan for notification of local emergency response agencies and the public.\n\nAdvario Texas City is committed to operate and maintain its facility in a safe and environmentally-friendly manner.  Advario Texas City complies with the RMP rules and regulations set forth by the U.S. EPA and even some elements of OSHA's Process Safety Management Program to ensure the safety of employees and public surroundings.  \n\nThe Advario Texas City Marine Terminal designed its accident prevention program to comply with both the EPA RMP rules and utilizes portions of OSHA's PSM as a guideline, even though OSHA's PSM is not applicable to the Terminal.  Advario Texas City incorporates elements addressing the following:\n\n* Equipment Design - Vessels (including shipping containers) and ot"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000102534,
      "SummaryText": "her process equipment are designed according to recognized industry standards and/or governmental requirements.\n\n* Process Safety Information - Chemical hazard, process technology, and equipment information is documented, maintained up-to-date, and available to operating personnel.\n\n* Process Hazard Analysis (PHA) - PHAs are conducted every three (3) years to identify major process hazard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\n\n* Episodic Risk Management - Periodic reviews are conducted to identify hazards which could have significant community impact and to recommend corrective action(s) needed to prevent their occurrence.  These reviews utilize advanced quantitative risk assessment techniques.\n\n* Operational Safety Standards - Design requirements for active and passive mitigation controls used to prevent major process hazards are documented in operational safety standards.\n\n* Operating Procedures - Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.\n\n* Operator Training Program - The plant has a training and testing program, which provides operators with the proper skills and knowledge prior to allowing them to independently operate a process.\n\n* Technical Staff Training and Support - Trained technical staff employees are available 24 hours a day to support operations.\n\n* Maintenance Procedures - The plant has specific procedures for maintaining process equipment so that it operates safely.\n\n* Maintenance Training - The plant trains persons who perform routine maintenance tasks on process equipment.\n\n* Mechanical Integrity Program - Vessels (including shipping containers) and other process equipment are periodically tested and/or inspected to ensure safe operation of process equipment, following recognized industry standards and/or governmental requirements.\n\n* Incident Investigation - The plant has a program to ensure that accidents and incidents are properly investigat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000102534,
      "SummaryText": "ed to determine the cause(s) and to implement corrective action(s) that are needed to prevent the event from reoccurring.\n\n* Employee Participation - The plant has a program to involve employees in prevention program elements.\n\n* Hot Work Permit - The plant has a procedure to ensure that welding, cutting, and brazing are safely performed in areas where flammables or combustible material may be present. \n\n* Compliance Audits - Periodic corporate and plant-led audits are conducted to ensure that process operations comply with governmental and corporate requirements.\n\n* Operational Safety Program - Advario  Texas City has a comprehensive program to ensure that all the elements listed above are implemented at every Advario Texas City location. This program includes accountability for timely and proper implementation of the program elements.\n\n\nThese general prevention elements are parts of an overall management system to prevent accidental chemical releases.  Advario Texas City and its employees are committed to the standards that these management systems set, and have specific accountability and controls to ensure that they are meeting their own high standards for accident prevention. \n\n|==========================|\n|EMERGENCY RESPONSE PROGRAM|\n|==========================|\n\nAdvario  Texas City maintains a written emergency response program to protect worker and public safety, as well as the environment.  The program consists of procedures for responding to releases of hazardous substances, including fire or explosion, and is updated when necessary based on modifications made to the facility.\nThe procedures address all aspects of emergency response including:\n\n* Proper first aid and medical treatment for exposures.\n* Evacuation plans and accounting for personnel after an evacuation.\n* Notification of local emergency response agencies and the public if a release occurs.\n* Post-incident cleanup and decontamination requirements.\n* Inspecting, testing, maintaining, and using"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000102534,
      "SummaryText": "emergency response equipment.\n\nAdvario Texas City maintains a trained emergency squad to handle fire, explosions, toxic vapor releases, spills, and medical emergencies.  The facility trains and drills with local emergency responders to enhance their skills and tactics for responding to an accidental chemical release.  Critiques are held on drills and actual events.  The emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Detailed emergency response plans are developed and coordinated with the Galveston County Local Emergency Planning Committee (LEPC).\n\n|=================================|\n|PLANNED CHANGES TO IMPROVE SAFETY|\n|=================================|\n\nAdvario Texas City continually strives to improve its safety related systems.  Its policies and procedures provide the most efficient means to minimize environmental impacts onsite and to the public.  Advario Texas City also continues to improve by implementing an incident investigation database to monitor potential risks of future incidents.  The improvements made by Advario Texas City, along with monthly reviews of current safety protocols, reduce the risk of future incidents."
    }
  ]
}