{
  "FacilityID": 1000078346,
  "FacilityName": "Tujunga Wells Chlorination Station",
  "FacilityStr1": "8801 Arleta Ave",
  "FacilityStr2": null,
  "FacilityCity": "Sun Valley",
  "FacilityState": "CA",
  "FacilityZipCode": "91352",
  "Facility4DigitZipExt": "2958",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.228333",
  "FacilityLongDecDegs": "-118.414444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ladwp.com",
  "FacilityEmailAddress": "water@ladwp.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Los Angeles Department of Water and Power",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Department of Water and Power",
  "OperatorStr1": "111 North Hope Street",
  "OperatorStr2": "Room 1449",
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": "2607",
  "RMPContact": "Steve Torres",
  "RMPTitle": "Manager of Treatment Operations",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145247",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-11-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.2285,
  "FRS_Long": -118.41328,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097632,
      "AltID": "Chlorination",
      "FacilityID": 1000078346,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000098879,
          "ProcessID": 1000097632,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122218,
          "ProcessID": 1000097632,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000622218,
          "ProcessID": 1000097632,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078346,
      "SummaryText": "Chlorine is the most commonly used substance for disinfecting drinking water.  The addition of chlorine or chlorine compounds to water is called chlorination.  Chlorination is considered to be the most important process for preventing the spread of waterborne disease in drinking water.  The Los Angeles Department of Water and Power (LADWP) also uses chlorine for drinking water disinfection purposes at the Tujunga Wells Complex to protect public health per state and federal water quality standards. Storing and handling large quantities of chlorine can create hazardous situations. The LADWP takes safety obligations in storing and using chlorine as seriously as it takes in providing safe drinking water.\n\n\n\nThe LADWP Tujunga Wells Complex Chlorination Station (TWCS) chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan and also to the California Accidental Release Prevention (CalARP) Program requirements. The facilities subject to the EPA and the CalARP regulations are required to prepare and update Risk Management Plans (RMPs). The RMP is to include policies and procedures followed to safely operate the facility and the actions, which will be taken by the facility in an event of an emergency.\n\n\n\nThe LADWP prepared and submitted RMPs for the Tujunga Wells Complex Chlorination Station in June 1999, June 2004, June 2009, June 2014 and October 2016. PHA for the TWCS was again performed on February 22, 2019. The LADWP prepared Program Level 2 RMPs in 1999 and 2004 because Tujunga Wells Complex Chlorination Station was not subject to PSM standard.  However, recent construction projects related to the Tujunga Wells Complex facility resulted in the LADWP employees working more frequently on the property. The construction activities do not involve the chlorination station's operations, but staff has been assigned to work in portable buildings, which are located near the chlorination station.  Therefore, it appear"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078346,
      "SummaryText": "s that Tujunga Wells Complex Chlorination Station became subject to PSM requirements in June 2009 and the LADWP implemented a PSM Program for the TWCS in June 2009 that increased the RMP Program Level requirements from Level 2 to Level 3. The 2014 update of the 2009 update also demonstrated compliance with the Program Level 3 requirements. This document is an update of the June 2014 RMP for the Tujunga Wells Complex chlorination Station. \n\n\n\nThe following information is specifically required in the RMP Update Executive Summary: \n\n\n\n?    Accidental release prevention and emergency response policies.\n\n?    General facility and regulated substances information.\n\n?    Summary of the accidental release prevention program and chemical-specific prevention steps.\n\n?    Five-year accident history summary.\n\n?    Emergency response program summary.\n\n?    Planned changes to improve safety.\n\n\n\nThe above information for the Tujunga Wells Complex Chlorination Station is provided below.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe LADWP accidental release prevention policy involves a unified approach that integrates the use of proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices. All applicable requirements of the State of California and the EPA's Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\n\n\nThe LADWP emergency response policy involves the preparation of emergency response plans for hazardous materials, which are tailored to each facility and to the emergency response services available in the community, and is in compliance with the EPA and the CalARP Program Emergency Response Program Requirements. The LADWP has prepared an Emergency Response Plan for the Tujunga Wells Complex Chlorination Station to facilitate coordination and emergency planning with offsite response officials and facilities in the event of "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078346,
      "SummaryText": "an emergency. The Emergency Response Plan has been coordinated with the local response agency (City of Los Angeles Fire Department). The Tujunga Wells Complex Chlorination Station has an excellent record in preventing accidents from occurring.\n\n\n\nGeneral Facility and Regulated Substance Information\n\n\n\nThe Tujunga Wells Complex Chlorination Station is located at 8801 Arleta Avenue in Sun Valley, California.  The facility is located approximately one-quarter mile east of the Hollywood Freeway (State 170) and immediately south of the Tujunga Wash River. This facility is a groundwater well field and pumping station complex. The facility injects chlorine into a collector pipeline before entering or after leaving a 3-million gallon water contact tank. The station consists of a chlorine storage room, a chlorination room, a chlorine control room, a tool room, a dry media chlorine scrubber (main scrubber), and a dry media chlorine mini-scrubber. The facility currently stores chlorine, a regulated toxic substance under the EPA and the CalARP Program rules. A maximum of twelve ton chlorine containers can be stored at the Tujunga Wells Complex Chlorination Station.  Eight of these containers can be connected to the chlorination process to feed chlorine gas and the other four containers are stored as spares. The ton container is the largest vessel (container) online. The maximum quantity of chlorine present at the Tujunga Wells Chlorination Station at any given time exceeds the listed threshold quantities in the EPA and the CalARP regulations. It also exceeds the listed threshold quantities in the federal and the CalOSHA PSM Standard. The recent construction projects related to the Tujunga Wells facility resulted in the LADWP employees working more frequently on the property.  The construction activities do not involve chlorination station's operations, but staff has been assigned to work in portable buildings, which are located near the chlorination station. Therefore, it appea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078346,
      "SummaryText": "rs that TWCS became subject to PSM requirements in June 2009.\n\n\n\nAs mentioned above, eight ton containers are manifolded in two banks of four ton containers to supply chlorine gas. These eight ton containers are equipped with Halogen actuators on the angle valves and will close the valves when a chlorine concentration of 10 ppm is detected in the room. The facility has two additional ton containers that rest on load cells. However, a maximum of only four ton containers with Halogen actuators are used for chlorination at the TWCS. All of these eight ton containers rest on load cell scales, which allow the operators to monitor the chlorine weight in the containers. There are trunnions for storage of four additional full or empty ton containers without process connections. \n\nChlorine gas is withdrawn from a bank of ton containers through pigtails, which are attached to the ton container gas valves.  Chlorine flows under pressure to a chlorine header then to the automatic switchover vacuum regulating valves with check-relief unit.  The switchover valves are triggered by the rise in vacuum pressure in the chlorine feed line between the switchover valve and the chlorinator.  The rise in vacuum occurs when the chlorine container pressure approaches zero, which happens when the container is empty.  If this occurs, the switchover valve will open the alternate chlorine connection, demanding chlorine gas from the alternate chlorine containers.  Chlorine gas then leaves the switchover valve under vacuum to the chlorinators in the adjacent room.  From the chlorinators, the gaseous chlorine then travels under vacuum to three chlorine injectors in a cabinet located adjacent to an underground vault outside the station.  At the injectors, chlorine mixes with a high-pressure water supply to form a chlorine solution, which then travels to diffuser tubes located in the pipelines. It is important to note that in case of loss of vacuum downstream of the vacuum regulating valve with check"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078346,
      "SummaryText": "-relief unit, air would be drawn in rather than chlorine being released and the vacuum regulating valve with check-relief unit will shut down the chlorine supply to the chlorinator, operating as a shut-off valve.\n\nProcess control is by a programmable controller that determines the feed rate relative to the residual and water flow rates.  Flow signals are transmitted to the controller.  Chlorine residual analyzers continuously monitor and record the treated water residuals.\n\n\n\nMultiple chlorine leak detectors have been installed inside the chlorine building, which alarm locally as well as at the LADWP Los Angeles Aqueduct Filtration Plant (LAAFP) Control Room at Sylmar. \n\n\n\nThe Tujunga Wells Complex Chlorination Station has a dry-media type chlorine scrubber (main-scrubber). The main-scrubber is actuated by the chlorine detectors at a chlorine concentration of 3 ppm that can neutralize up to one-ton of chlorine. The manufacturer makes performance claims of a maximum chlorine concentration of 25 ppb on the scrubber discharge under design chlorine loading rates.  The discharge stack is located on the roof of the building.\n\n\n\nA dry media chlorine \"mini-scrubber\" unit (MS) has also been installed at the Tujunga Wells Complex Chlorination Station. The MS is an emergency chlorine scrubber intended to protect personnel working in the building or immediate area from a chlorine gas release from the pressure safety relief vent provided in the automatic switch over vacuum regulating valves with check-relief unit. Mini-scrubber can neutralize up to 25 lbs of chlorine, and the media manufacturer specifies chlorine removal to less than 5 parts per billion. The mini-scrubber is activated automatically at a chlorine concentration of 1 ppm.\n\n\n\nA backup generator is provided for the scrubbers as well as for the entire chlorination system. All other chlorine alarms, communication systems, mitigation devices, and facility controls have backup power supplies or batteries that would allow"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000078346,
      "SummaryText": " them to operate if normal electrical power was interrupted and until the backup generator comes on line. \n\n\n\nThe ventilation systems of the facility consist of the fresh air ventilation system, main scrubber system, and the Mini-scrubber exhaust system. All the three systems are interconnected through the facility chlorine leak system sensors and controllers.\n\n\n\nIn the event power is lost at the chlorination facility, an alarm will alert the LAAFP control room. Chlorine flow will continue unaffected, with no safety consequences.\n\n\n\nThe facility is normally unoccupied; water treatment operators visit the facility daily.  A response team coordinated from the LADWP Los Angeles Aqueduct Filtration Plant responds to any trouble alarms which may occur.  Access to the facility is through gates, which are kept locked all the time.\n\n\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe LADWP accidental release prevention program is based on the following key elements:\n\n\n\n?    Detailed management system and clear levels of responsibilities and team member roles.\n\n?    Comprehensive process safety information that are readily available to staff, emergency responders, and contractors.\n\n?    Comprehensive preventive maintenance program.\n\n?    Performance of process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\n\n?    State-of-the-art process and safety equipment.\n\n?    Accurate and effective operating procedures, written with the participation of the station operators.\n\n?    High level training for the operators and maintenance staff.\n\n?    A State of California Water Treatment Facility Staff Certification is required to operate the station.\n\n?    An incident investigation, inspection, and auditing program using qualified staff.\n\n\n\nChemical-specific prevention steps for the chlorination system include the following: availability of self-contained breathing apparatus (SCBA), worn by the operators dur"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000078346,
      "SummaryText": "ing connection/disconnection of chlorine supply; awareness of the hazardous and toxic properties of chlorine; presence of chlorine detectors with remote monitoring; use of Halogen actuators on ton containers; a chlorine main scrubber; and a chlorine mini-scrubber.\n\n\n\nProcess and Chemical Safety Information\n\n\n\nComprehensive chemical data has been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine.  This information includes chlorine background information and Safety Data Sheets.\n\n\n\nEquipment safety information was compiled on the chlorination process. Specifications for the chlorination process are collected and provided in one place for easy reference. Details (such as maximum intended inventory; safe upper and lower temperatures; and safe upper and lower pressures for the chlorination facility) are on file at the facility.  The LADWP also has procedures in place that are triggered to update process safety information if there is a major change that makes existing information inaccurate.\n\n\n\nProcess Hazard Analysis\n\n\n\nIn 1990, a detailed hazard review/Process Hazard Analysis (PHA) was conducted for the chlorination system equipment and procedures.  The 1990 hazard review/PHA was further reviewed in April 1999. In March 2004, a hazard review/PHA was again performed for the whole chlorination system.  The 2004 hazard review/PHA for the facility was further reviewed in February 2009. The 2009 PHA was reviewed again on August 17, 2012 in order to evaluate the change from a caustic soda based chlorine scrubber to a dry media chlorine scrubber. The 2012 PHA was further reviewed on February 28, 2014. The 2014 PHA was further reviewed in October 2016 for increasing the number of online chlorine ton containers from six to eight. A PHA was again performed for the TWCS on February 22, 2019, and will be updated again within a five-year period or whenever there will"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000078346,
      "SummaryText": " be a major change in the process. A list of recommended actions was developed in February 2019 to further improve the chlorine safety. All of these recommendations are being evaluated for implementation. The LADWP staff will document the completion of the recommended actions.\n\n\n\nA seismic assessment, including the walkthrough on February 5, 2019 was completed for the chlorination station in April 2019. No additional recommendations were made based on this seismic assessment. The seismic assessment was performed following the Local Emergency Planning Committee (LEPC) Region 1 guidance document.\n\n\n\nOperating Procedures\n\n\n\nThe LADWP has prepared written operating procedures for Tujunga Wells Chlorination Station that provide clear instructions or steps for safely conducting activities relating to chlorination process. They are consistent with the chlorine safety information. Written operating procedures included in the facility's Operation and Maintenance (O&M) Manual are as follows:\n\n\n\n?    Delivery of Chlorine.\n\n?    Ton Container Connections.\n\n?    Initial Startup Procedure.\n\n?    Normal Operation.\n\n?    Normal Shutdown.\n\n?    Temporary Operations.\n\n?    Emergency Operations.\n\n?    Emergency Shutdown.\n\n?    Startup Following Emergency Shutdown.\n\n\n\nTraining \n\n\n\nThe LADWP ensures that each employee operating or maintaining the chlorination process, and each employee newly assigned to these processes, are trained and tested for competency in the operating procedures listed above. LADWP employee training documentation files include training records for each employee assigned to operate or maintain the chlorination process. The training ensures that the employee has the required knowledge, skills, and abilities to safely perform the duties and responsibilities, including chlorine emergency response, as provided in the operating procedures.  Employee training includes as a minimum the following elements:\n\n\n\n?    Safety Information.\n\n?    Process Technology and Process Equipment, including safety systems"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000078346,
      "SummaryText": ".\n\n?    Maintenance Procedures.\n\n?    Operating Procedures for the chlorine system.\n\n?    RMP Program contents.\n\n?    Emergency Response Plan and Procedures.\n\n\n\nRefresher training is provided at least every three years to each employee operating the chlorination process to ensure that the employee understands and adheres to the current operating procedures. In addition, the LADWP ensures that operators are trained in any updated or new procedures prior to startup of a process after major modifications.  \n\n\n\nContractors\n\n\n\nThe LADWP Contractor's procedures specify the information required to be provided to the contractors performing work on or near the chlorination process, the training requirements for contractor employees, and mechanism to obtain assurance from contractors that they have informed their employees of the appropriate safety rules.  The LADWP provides information and explanations concerning the hazards and processes. \n\n\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\n\n\nThe LADWP has procedures in place to ensure that a pre-startup safety review is conducted prior to starting a new covered process or prior to making modifications to the chlorination systems that require a Management of Change (MOC) procedure implementation.  The required conditions prior to startup include the following:\n\n\n\n?    Construction and/or equipment are in accordance with design specifications.\n\n?    Safety, operating, maintenance, and emergency procedures are in place and are adequate.\n\n?    A PHA has been performed for any new facilities and recommendations have been resolved or implemented prior to startup.\n\n?    At modified facilities, MOC requirements have been met.\n\n?    Training of each operating and maintenance employee involved in the process is complete.\n\n\n\nThese procedures ensure that no new and/or new/significantly modified process will startup and no regulated substances will be introduced into such a process before the pre-startup safety review. This constitutes a final check t"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000078346,
      "SummaryText": "hat the process and equipment are ready to go and that the recommendations of the PHA have been implemented or adequately addressed. This will ensure that the design and construction of a new or modified process is safely executed and that the facility is prepared to operate it. \n\n\n\nMechanical integrity procedures for the plant ensure that written maintenance procedures are implemented and documented, including training of maintenance personnel.\n\n\n\nMaintenance \n\n\n\nThe LADWP operates a MAXIMO, an asset management program that generates a preventive maintenance work order at a designated frequency. Description of the work to be performed is included with the printed work order. In addition, the written maintenance procedure is provided in the O&M Manuals as follows: Preventive maintenance schedules are provided which summarize inspection, test, and maintenance schedules on a daily, weekly, bi-monthly, monthly, biannual, and annual, every 2 to 10 years, and as-needed basis. These procedures allow the operator to rapidly review what maintenance is necessary. The schedules are supplemental to the log sheets on-site and provide a summary and quick reference to manufacturer's O&M manuals. A maintenance log book is provided on-site for Operator quick reference.\n\n\n\nThe LADWP documents inspection, testing, and maintenance of chlorination equipment and assures the performance is performed in accordance with the recommendations of the manufacturer and industry groups.\n\n\n\nHot Work Permits and Management of Change \n\n\n\nHot work refers to work involving electric or gas welding, cutting, brazing, or similar flame or spark producing operations. The hot work procedures require the issuance of a hot work permit whenever it is conducted on or near the chlorination process and other areas deemed appropriate as described in these procedures. Fire prevention and protection systems are in place before a hot work permit is issued. The permit indicates the dates the work is authorized for, th"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000078346,
      "SummaryText": "e location, and specific operational requirements, and it is kept on file in the administrative office. \n\n\n\nThe LADWP Management of Change procedures include steps required to be taken by plant personnel before implementing changes to chlorination equipment, procedures, raw materials, and processing conditions.  Training, process safety information, operating procedures, and maintenance procedures are updated according to the changes made.\n\n\n\nInternal Compliance Audits\n\n\n\nThe LADWP has been certifying every three years (or earlier) that compliance with Program 2 Prevention Program requirements for the chlorination station is met and that procedures and practices developed are adequate and being followed. Starting June 2009, the LADWP certified compliance with Program 3 Prevention Program requirements. The two most recent audit reports and a list of the recommendations are retained in the LADWP's files.\n\n\n\nThe compliance audit consists of separating the RMP program elements or sections, and auditing each element to determine compliance and effectiveness. For each internal audit, the audit team completes a Compliance Audit Certification Page and a Compliance Audit Checklist. The Compliance Audit Certification Page provides process identification, the dates of the audit, team members, and certification by the audit leader. The Compliance Audit Checklist details the requirements of each RMP element and contain questions that may assist with the auditing process. The audit checklist for each element consists of the following three sections:\n\n\n\n?    Records Review: A review of the RMP written Prevention Program.\n\n?    On-Site Conditions: The audit team reviews the program elements based on observation of the plant conditions and safety practices.\n\n?    Interviews:  The program elements are evaluated by interviewing personnel from appropriate functions including operations, maintenance, management, and contractors.\n\n    Compliance Auditor records RMP program deficiencies identified du"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000078346,
      "SummaryText": "ring the audit on the checklist.\n\n\n\nIncident Investigation\n\n\n\nThe LADWP incident investigation procedures describe incident reporting, investigation, and investigation reporting steps to be followed by plant personnel. The incident investigation is started promptly but no later than 48 hours after the event. The LADWP promptly addresses and resolves all recommendations and implements the recommendations in a timely manner to prevent an incident recurrence. All incident investigation reports are retained in the LADWP's file for at least a period of five years from the date the reports are completed.\n\n\n\nFive-year Accident History Summary\n\n\n\nNo chlorine release that could have caused safety or health hazard (deaths, injuries, property or environmental damage evacuations, or sheltering in place) occurred at the Tujunga Wells Complex Chlorination Station during the last five years.\n\n\n\nEmergency Response Program Summary\n\n\n\nThe LADWP is a first responder, its employees respond to chlorine accidental release. In the event an accidental release that could result in offsite consequences occurs, external resources, such as the City of Los Angeles Fire Department will also be solicited to respond.  \n\n\n\nAs part of the emergency response program, the LADWP has developed and implemented an emergency response plan for the purpose of protecting public health and the environment. The following elements are included:\n\n\n\n(a)    Emergency response plan, maintained at the Tujunga Wells Complex Chlorination Station and at the Los Angeles Aqueduct Filtration Plant (LAAFP) containing:\n\n\n\n?    Organizational structure (chain-of-command) and responsibilities of various LADWP personnel.\n\n?    Procedures for planning and coordination with off-site emergency response organizations.\n\n?    Details of the training programs for all employees involved with the chlorination process, contractor training, and medical surveillance of LADWP personnel who respond to chlorine release.\n\n?    Details of emergency recognitio"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000078346,
      "SummaryText": "n and prevention at the LADWP.\n\n?    Procedures for informing the public and local emergency response agencies about accidental releases.\n\n?    Documentation of proper first aid and emergency medical treatment necessary to treat accidental human exposures and the detailed information on emergency health care.\n\n?    Procedures and measures for emergency response after an accidental release.\n\n\n\n(b)    Procedures for the use of emergency response equipment and for its inspection, testing, and maintenance. \n\n(c)    Training in relevant procedures for all employees involved with the chlorination process.\n\n(d)    Procedures to review and update, as appropriate, the emergency response plan to reflect changes and ensure that employees are informed of changes.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nBased on the February 2014 and October 2016 PHAs, a few recommendations were made for the TWCS. All the above recommendations have been evaluated by the LADWP. Additionally, ten recommendations to further improve the chlorine safety were identified in February 2019, when PHA was again performed for the TWCS. \n\n\n\nBased on the February 2014 seismic assessment, two recommendations were made for the TWCS. All the above recommendations have been evaluated and implemented by the LADWP. Based on the 2019 seismic assessment, no additional recommendations were made for the chlorination station. \n\n\n\nIt is expected that all the above 2019 recommendations will be evaluated and implemented by August 2021. The implementation of these recommendations will further improve the safety of the chlorination system. \n\n\n\n\n\n"
    }
  ]
}