{
  "FacilityID": 1000084844,
  "FacilityName": "NBLLC_Parrish",
  "FacilityStr1": "500 Old Baltimore Road",
  "FacilityStr2": null,
  "FacilityCity": "Parrish",
  "FacilityState": "AL",
  "FacilityZipCode": "35580",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01127",
  "LEPC": "Walker County LEPC",
  "FacilityLatDecDegs": "33.727432",
  "FacilityLongDecDegs": "-87.272226",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": "820 Shades Creek Pkwy, Suite 2000",
  "FacilityEmailAddress": "tnewton@nelbro.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Nelson Brothers, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nelson Brothers, LLC",
  "OperatorStr1": "820 Shades Creek Pkwy, Suite 2000",
  "OperatorStr2": null,
  "OperatorCity": "Birmingham",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35209",
  "OperatorZipCodeExt": null,
  "FTE": 38,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000241437",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-12-03 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-01-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "2.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000106012,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 1000084844,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132745,
          "ProcessID": 1000106012,
          "ChemicalID": 56,
          "Quantity": 52000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000107285,
          "ProcessID": 1000106012,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000089859,
              "Process_NAICS_ID": 1000107285,
              "SafetyReviewDate": "2019-11-04 00:00:00",
              "PHA_Date": "2019-11-04 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 1,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-01-17 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "24-hour surveillance",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-01-07 00:00:00",
              "TrainingReviewDate": "2019-12-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-01-14 00:00:00",
              "EquipmentInspectionDate": "2020-01-14 00:00:00",
              "EquipmentTested": "TK80543",
              "ChangeMgmtDate": "2020-01-14 00:00:00",
              "ChangeMgmtReviewDate": "2020-01-29 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-12-27 00:00:00",
              "HotWorkPermitReviewDate": "2019-12-27 00:00:00",
              "ContractorSafetyReviewDate": "2019-12-27 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000111918,
                  "PreventionProgram3ID": 1000089859,
                  "ProcessChemicalID": 1000132745
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000084844,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-01-27 00:00:00",
    "ERTrainingDate": "2019-12-17 00:00:00",
    "CoordinatingAgencyName": "Walker County LEPC",
    "CoordinatingAgencyPhone": "2563868558",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084844,
      "SummaryText": "1.0    INTRODUCTION\n\nThis Risk Management Plan/Process Safety Management Manual (RMP/PSM Manual) has been prepared for Nelson Brothers, LLC in accordance with the EPA regulations 40 CFR 68, \"Chemical Accident Prevention Provisions\" and OSHA regulations 29 CFR 1910.119, \"Process Safety Management of Highly Hazardous Chemicals\". The purpose of this RMP/PSM Manual is to assist with the prevention of accidental releases of toxic and flammable substances that can cause harm to the public, facility employees, and to the environment.\n\n\n\n1.1    Operations\n\nNelson Brothers, LLC is located at 500 Old Baltimore Road in Parrish, Alabama. The site consists of 8 reactors and 60+ bulk storage tanks of raw materials and finished products.  The facility operates on a 24-hour, 7 day per week schedule. \n\n\n\nThe ammonia storage facility at the plant consists of a 10,000-gallon storage tank located on a concrete pad adjacent to the R-800 tank farm. Vapor and liquid connections are provided for receiving bulk ammonia deliveries by tank truck.  The deliveries are made and handled by a company (Tanner Industries) that has been manufacturing and transporting anhydrous ammonia for over 100 years.\n\n\n\n1.2    Applicability\n\nAnhydrous ammonia is stored on site as a pressurized liquid in a 10,000-gallon aboveground storage tank (TK80543). The presence of approximately 52,000 pounds (i.e., greater than 10,000 pounds) of anhydrous ammonia requires compliance with EPA's RMP rules (Risk Management Program, 40 CFR 68) and OSHA's PSM rules (Process Safety Management, 29 CFR 1910.119). Details and drawings of the Alkyl Succinic Anhydride (ASA) manufacturing process that uses ammonia are available upon request\n\n\n\nThe facility is subject to RMP Program 3 requirements as specified in 40 CFR 68.10 based on the determination that the toxic endpoint for a worst-case release of anhydrous ammonia is within the vicinity of public receptors. \n\n\n\nThe facility submitted the initial Risk Management Plan to the EPA on January "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084844,
      "SummaryText": "31, 2020. Nelson Brothers will fully update and re-submit the RMP at least once every five years. \n\n2.0    PROCESS SAFETY INFORMATION\n\nNelson Brothers, LLC. maintains current safety information regarding the storage, use and off-loading of anhydrous ammonia in accordance with 40 CFR 68.65. Safety information is presented in the following sections.\n\n2.1    Hazards of Regulated Substance\n\nThe following information has been compiled and provided in this manual to identify the hazards of anhydrous ammonia:\n\n?    SDS (Anhydrous Ammonia)\n\n?    A Basic Understanding of Anhydrous Ammonia, developed by Airgas Inc.\n\n\n\nThe information provided in also includes the following information:\n\n?    Toxicity information\n\n?    Permissible exposure limits\n\n?    Physical data\n\n?    Reactivity data\n\n?    Corrosivity data\n\n?    Thermal and chemical stability data\n\n?    Hazardous effects of inadvertent mixing of different materials that could foreseeably occur\n\n\n\n2.2    Safety Information - Technology of the Process\n\n2.2.1    Block Flow Diagram\n\nA simplified Process Block Flow Diagram has been created and identifies the Ammonia Process and its location relative to the ASA tank and other components of the process. \n\n\n\n \n\n2.2.2    Process Chemistry\n\nThe basic chemistry of the ASA process is a included in the descriptions of the ASA System.\n\n\n\n2.2.3    Maximum Intended Inventory 2.2.3\n\nThe maximum intended inventory of anhydrous ammonia is 43,775 lbs. based on the following:\n\n?    Tank TK80543 is a 10,000-gallon storage tank.\n\n?    The maximum fill setting is 85% (per SOP: DM-200-1). The contents of TK80543 is limited by administrative controls to be 8,500 gallons of liquid.\n\n?    At 5.15 lb./gal for anhydrous ammonia at 60 ?F and 92.9 psi, the maximum liquid content of TK80543 is 43,775 pounds.\n\n2.2.4    Safe Upper and Lower Limits\n\nThe following information was provided to Nelson Brothers, LLC. for the safe upper and lower limits for the system: \n\n?    Tank TK80543: 265 psig @ 150 &#8304;F; 10,000-gallon gross\n\n?    The system contains a vaporizer, air"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084844,
      "SummaryText": " mixer, air heater, and other components typically associated with the storage and use of anhydrous ammonia. \n\n2.2.5    Consequences of Deviation \n\nConsequences of deviation could potentially result in releases to the environment or exposure of anhydrous ammonia to employees or to the public as detailed in Section 4.0, Hazard Assessment, of this manual.\n\nWhen anhydrous ammonia is cooled or compressed, it is in the liquid form. Storing it under pressure prevents it for vaporizing and makes it available for use in large volume. One cubic foot of anhydrous ammonia in a liquid state produces 855 cubic feet of ammonia gas\n\nWhen anhydrous ammonia is released from compression in a storage tank (200 psi) to the atmosphere (0 psi), the temperature drops from 100 &#8304;F to minus 28 &#8304;F. At this temperature, ammonia will freeze/burn human skin on contact and clothing can be frozen to the skin. Since anhydrous ammonia is stored under high pressure, a sudden rupture can shoot ammonia 10 to 20 feet from the point of release.\n\n\n\n2.3    Safety Information - Equipment in the Process\n\n2.3.1    Materials of Construction\n\nThe following materials were used in the construction of the ammonia tank and supply lines:\n\n?    Tank shell     SA-212-B-FO\n\n?    Pipe    Stainless Steel 316L\n\n?    Bolts    SA-193-B7\n\n?    Nuts    SA-194-2H\n\n?    Gaskets    Garlock Nylon\n\nNote: Ammonia is corrosive to brass, copper and galvanized components and fittings. When these components and fittings come in contact with ammonia liquid or vapor, the metal will corrode and will fail. \n\n2.3.2    Piping and Instrumentation Diagrams\n\nPiping and Instrumentation Diagrams (P&ID) relevant to the Ammonia process are provided and include: \n\n?    PID-NH3:  Ammonia Tank Drawing; \n\n?    PID-R-800: R-800 Reactor Drawing and ASA Product flow diagram\n\n2.3.3    Relief System Design & Design Basis\n\nRelief valves, located on the top of the ammonia storage tanks, were designed in accordance with the following guidelines:\n\n?    American National Standard Institute (ANSI) K61.1 "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084844,
      "SummaryText": "- Safety Requirements for the Storage and Handling of Anhydrous          Ammonia\n\n?    OSHA 29 CFR 1910.111 Storage and Handling of Anhydrous Ammonia.\n\n2.3.4    Ventilation System Design \n\nA ventilation system has not been designed for the Ammonia system since none of the process is located in an enclosed area.\n\n\n\n\n\n\n\n2.3.5    Design Codes and Standards Employed\n\nThe following design codes and standards were employed in the construction of the Ammonia system:\n\n?    American National Standard Institute (ANSI) K61.1 - Safety Requirements for the Storage and Handling of Anhydrous Ammonia (1999 Edition)\n\n?    OSHA 29 CFR 1910.111 Storage and Handling of Anhydrous Ammonia\n\n\n\n2.3.6    Material and Energy Balances\n\nThe quantity of anhydrous ammonia needed for each reaction of the ASA process can be approximated by the following equation:\n\n?    Ammonia per batch &#8776; (ASA lb.) * (AV #) * (0.000318) lb./batch. \n\nThere is no pump on the ammonia process and the flowrate of ammonia from tank TK80543 is adjusted using a solenoid control valve (AV8600).\n\n\n\n2.3.7    Safety Systems\n\nGuidelines from the 1999 edition of ANSI K61.1, Safety Requirements for the Storage and handling of Anhydrous Ammonia were reviewed regarding the use of water on ammonia spills. It was determined that a deluge system should not be used during a significant spill. \n\n\n\n\n\n \n\n3.0    PROCESS HAZARD ANALYSIS \n\nThe initial Process Hazard Analysis (PHA) was completed on December 4, 2019 with a review team of personnel from Tanner Industries, Inc. and Nelson Brothers, LLC. The report summarizes the findings and recommendations that were developed.\n\n\n\nIn accordance with 40 CFR 68.67, the process hazard analysis shall address the following:\n\n?    The hazards of the process\n\n?    The findings from all incident investigations required under 40 CFR 68.81, as well as any other potential failure scenarios\n\n?    Engineering and administrative controls applicable to the hazards and their interrelationships such as appropriate application of detection me"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084844,
      "SummaryText": "thodologies to provide early warning of releases. (Acceptable detection methods might include process monitoring and control instrumentation with alarms, and detection hardware such as hydrocarbon sensors.)\n\n?    Consequences of failure of engineering and administrative controls\n\n?    Stationary source siting\n\n?    Human factors\n\n?    A qualitative evaluation of a range of the possible safety and health effects of failure of controls\n\n?    For processes in NAICS 322, 324, and 325, safer technology and alternative risk management measures applicable to eliminating or reducing risk from process hazards.\n\no    The owner or operator shall consider, in the following order of preference inherently safer technology or design, passive measures, active measures, and procedural measures. A combination of risk management measures may be used to achieve the desired risk reduction.\n\no    The owner or operator shall determine the practicability of the inherently safer technologies and designs considered.\n\n\n\n\n\n6.0    TRAINING\n\n6.1    Initial Training\n\nTraining for employees that are involved with operating the ASA system has been completed.  The training was completed by Nelson Brothers personnel. In addition, the training included a review of the operating procedures. The training shall include an emphasis on specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the employee's job tasks. Additional training will be provided to Nelson Brothers, LLC. personnel by Tanner Industries, Inc.\n\n\n\nFor employees responsible for maintaining the ASA system, training will include operating procedures associated with maintenance of the equipment's mechanical integrity.\n\n\n\n6.2    Intermittent Training - Change of Process or Materials\n\nTraining will be required for employees involved with operating the ASA system when it is determined that a process, procedure, or material has changed that would affect the operation of equipment or storage of anhydrous ammonia (Sect"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000084844,
      "SummaryText": "ion 8.0).\n\n\n\n6.3    Refresher Training\n\nRefresher training shall be provided at least every 3 years, and more often if necessary, to each employee involved in operations involving ammonia to assure that employees understand and adhere to the operating procedures. The content of the refresher training will be similar to the information provided during initial training.\n\n\n\n6.4    Training Documentation\n\nNelson Brothers, LLC. shall document that each employee involved in operating or maintaining the ASA system has received and understood the training described above. Employee training records are maintained in the facility's Safety Manager's filing cabinet.\n\n\n\n\n\n \n\n7.0    MECHANICAL INTEGRITY\n\nNelson Brothers, LLC. maintains the on-going integrity of the ASA system by completing maintenance activities as specified in documents provided by the manufacturer of the components of the ASA system. Specifically, the following manufacturer's maintenance programs are used on specific components of the ASA system:\n\n\n\n?    The tank and piping should be visually inspected at least every three months.\n\n?    Valve stems should be protected and occasionally lubricated with a light coating of grease or petroleum jelly.\n\n?    Safety relief valves are provided with caps to keep out rain, snow, dirt, etc. \n\n?    Safety relief valves are stamped with a 5 year expiration date. These valves will be replaced prior to their date of expiration.\n\n?    Hose connections must have protective caps.\n\n\n\nThe activities include inspection and testing of pressure vessels, emergency shutdown, controls, pumps, and other equipment associated with operating the system.\n\n\n\nInspection and testing procedures have been developed by Nelson Brothers, LLC. that follow recognized and generally accepted good engineering practices. The frequency of inspections and tests of process equipment will be consistent with applicable manufacturers' recommendations, industry standards or codes, good engineering practices and prior operating experienc"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000084844,
      "SummaryText": "e.\n\n\n\nEmployees responsible for the on-going integrity of process equipment on the ASA system will be trained in an overview of the process. Training will include a review of the hazards associated with anhydrous ammonia as well as operating procedures associated with maintaining the equipment integrity.\n\n\n\nNelson Brothers, LLC. has developed a checklist to document each inspection and test that is required to be completed on the system. The checklist identifies the following information:\n\n\n\n?    date of the inspection or test\n\n?    the name of the person who performed the inspection or test\n\n?    the serial number or other identifier of the equipment on which the inspection or test was performed\n\n?    a description of the inspection or test performed\n\n?    the results of the inspection or test\n\nWhen deficiencies are identified during inspections, Nelson Brothers, LLC. will correct the problem to return the ASA system to acceptable parameter limits specified in the process safety information (Section 2.0). Corrections will occur before further use or in a safe and timely manner, when necessary means are taken to assure safe operation.\n\n\n\nNelson Brothers, LLC. has constructed the ASA system and assured that the equipment, as it is fabricated, is suitable for the process application. Appropriate checks and inspections are performed to assure that equipment is installed properly and consistent with design specifications and the manufacturer's instructions. \n\n\n\n\n\n8.0    MANAGEMENT OF CHANGE\n\nNelson Brothers, LLC. has established and implemented written procedures to manage changes to the ASA system equipment and associated procedures. These procedures as assures that the following considerations are addressed prior to any change:\n\n\n\n?    The technical basis for the proposed change\n\n?    Impact of change on safety and health\n\n?    Modifications to operating procedures\n\n?    Necessary time period for the change\n\n?    Authorization requirements for the proposed change\n\n\n\nThe ASA system equipment and assoc"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000084844,
      "SummaryText": "iated procedures will be reviewed annually to ensure that documentation included in this manual reflects current personnel and actual operating conditions.\n\n\n\nNelson Brothers, LLC. employees, as well as contract employees, involved in operating or performing maintenance on the ASA system will be informed of, and trained in, the change prior to start-up of the process or affected part of the process (Section 6.0).\n\n\n\nIf a change covered by this section results in a change in the process safety information (Section 2.0), such information shall be updated accordingly. If a change described above results in a change in the operating procedures or practices required by 40 CFR 68.69 (Operating Procedures), such procedures or practices shall be updated accordingly.\n\n\n\n&#8195;\n\n9.0    PRE-STARTUP SAFETY REVIEW (PSSR) \n\nA pre-startup safety review will be completed by Nelson Brothers, LLC. on the ASA process prior to initial startup or when a modification is significant enough to require a change in the process safety information. The pre-start-up safety review will confirm the following information prior to the introduction of anhydrous ammonia to the process:\n\n\n\n?    Construction and equipment are in accordance with design specifications\n\n?    Safety, operating, maintenance, and emergency procedures are in place and are adequate\n\n?    For new stationary sources, a process hazard analysis has been performed and recommendations have been resolved or implemented before startup\n\n?    Modified stationary sources meet the requirements contained in Management of Change (Section 8.0)\n\n?    Training of each employee involved in operating the process has been completed.\n\n?    Operating procedures have been developed for initial startup and startup following an emergency shutdown (Section 5.0).\n\n\n\n\n\n&#8195;\n\n10.0    COMPLIANCE AUDITS\n\nIn accordance with 40 CFR 68.79, Nelson Brothers, LLC will evaluate compliance with the provisions of the RMP/PSM Plan at least once every 3 years to verify that the procedure"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000084844,
      "SummaryText": "s and practice are adequate and being followed. The audit's findings will be documented. Written reports of the findings and corresponding corrective actions taken will be maintained for five (5) years.\n\nThe following are key elements of ?68.79:\n\n?    Compliance Audit conducted at least once every 3 years\n\n?    Audit report developed of the findings\n\n?    Determine and document an appropriate response to each finding \n\n?    Document that deficiencies have been corrected \n\n?    Retain the 2 most recent audit reports\n\n\n\nA Compliance Audit has been conducted by Grace Engineering on January 29, 2020. A summary of the findings and recommendations are provided. \n\n\n\n&#8195;\n\n11.0    INCIDENT INVESTIGATION\n\nNelson Brothers, LLC. will investigate each incident which resulted in, or could have reasonably resulted in, a catastrophic release, in accordance with 40 CFR 68.81. An incident investigation will be initiated as soon as possible, but not later than 24 hours after the incident occurred. Nelson Brothers, LLC. will promptly address and resolve the investigation findings and recommendations, and resolutions and corrective actions will be documented and maintained for five (5) years.\n\n\n\nAn EHS Incident Report is used by Nelson Brothers, LLC. to document, address, and resolve the findings of the investigation. The report includes the following information:\n\n?    Date of incident\n\n?    Date investigation began\n\n?    A description of the incident\n\n?    The factors that contributed to the incident\n\n?    Any recommendations resulting from the investigation.\n\n\n\nThe EHS Incident Report also includes fields for documenting resolutions and corrective actions. Upon completion, the report will be reviewed with all affected personnel whose job tasks are relevant to the incident findings including contract employees, where applicable.\n\n\n\n\n\n15.0    EMERGENCY RESPONSE\n\nNelson Brothers, LLC. has developed an emergency response program for the purpose of protecting public health and the environment from releases of hazardous "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000084844,
      "SummaryText": "materials. Details of the program are provided in the Nelson Brothers, LLC, Emergency Response Plan and includes the following elements:\n\n\n\n?    Procedures for informing the public and local emergency response agencies about accidental releases\n\n?    Documentation of proper first-aid and emergency medical treatment necessary to treat accidental human exposures\n\n?    Procedures and measures for emergency response after an accidental release of a regulated substance\n\n?    Procedures for the use of emergency response equipment and for its inspection, testing, and maintenance \n\n?    Training for all employees in relevant procedures\n\n?    Procedures to review and update, as appropriate, the emergency response plan to reflect changes at the facility and ensure that employees are informed of changes.\n\n\n\nAn Emergency Response Plan (ERP) specific to an anhydrous ammonia release has been developed. Evacuation procedures are detailed in the ERP and include the identification of evacuation routes and muster areas.\n\n\n\nThe Local Emergency Planning Committee (LEPC) and other emergency response organizations will be provided with copies of this RMP/PSM Manual as well as the ERP procedure referenced above in order to assist local organizations in developing and implementing the community emergency response plan. \n\n\n\nEMERGENCY RESPONSE TO AN ANHYDROUS AMMONIA RELEASE\n\nThe objective of this Emergency Response Anhydrous Ammonia Release Procedure is to identify the appropriate actions to take when a release of anhydrous ammonia occurs from the storage tank, lines, or vaporization equipment located on the south side of facility. The intent is to minimize the health, safety and environmental impacts from a release of anhydrous ammonia at the facility and surrounding community and to restore the facility to normal operating conditions as quickly as possible.\n\n1. Ammonia has a strong, pungent odor that makes even the smallest of leaks easily detectable by smell. A medium to large leak of ammonia could be det"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000084844,
      "SummaryText": "ectable from a safe distance through a visual white cloud escaping from the source leak. 2. A release is controllable if the ammonia flow can be shut-off or contained without employees being exposed to health or safety risks, or where the rate of release does not pose immediate danger (e.g., a faint ammonia odor is evident). In this situation, notification should be made immediately to CONTROL ROOM to alert First Responders who are properly trained to shut down required processes, if necessary, and/or the ammonia gas flow. 3. A release is uncontrollable if attempts to shut-off or control the ammonia flow would place a person at a health or injury risk. In this situation, persons should not attempt to contain the release. Instead, they should evacuate the immediate area of the release by moving laterally or upwind of the release area and initiate notifications as indicated below. In the event of an uncontrollable release, the public will be notified and evacuated by the police and fire department.\n\n4. After personnel move to a location lateral or upwind from the release area, they should call the CONTROL ROOM and inform the CONTROL ROOM of the location (inside or outside) of the release and wind direction or direction in which the vapors appear to be moving (if known).\n\n5. The CONTROL ROOM shall dispatch the First Responders to the scene. The Responder(s) will approach the area from an upwind or lateral direction to secure the area and determine whether evacuation of the Plant is necessary and/or outside resources are needed to control the release.\n\n6. If evacuation is required, First Responders shall follow the Evacuation Procedure and direct employees along evacuation routes and to a rally point that would not be exposed to the ammonia vapors.\n\n7. Upon evaluation of the release at a safe distance, Management will request the CONTROL ROOM to notify fire department (external 911) and/or National Response Center to control the release. The CONTROL ROOM will provide th"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000084844,
      "SummaryText": "e outside responders with directions to approach the incident safely. If these outside resources are called in, Management shall also request the CONTROL ROOM notify the Safety Coordinator and Emergency Coordinator.\n\n8. If it is safe to do so, First Responders shall coordinate with plant personnel to shut off any ventilation systems and close windows and doors in the area to prevent the spread of the ammonia vapors to other areas of the building.\n\n9. Emergency Coordinator report to the scene, if necessary, and coordinate with fire department and/or hazardous waste contractor to determine if additional evacuation of the facility and any off-site, downwind locations is necessary. Management will open the Emergency Operations Center, if necessary, and coordinate the response efforts from there or an alternative location.\n\n10. The Safety Coordinator will evaluate the need for regulatory reporting (if the release exceeds the reportable quantity or there is an off-site threat) and contact the Emergency Coordinator if regulatory notification is required.\n\n11. Responders shall continually evaluate the need for medical services, rescue operations, and additional evacuation. Indication of potential serious health effects from ammonia vapors may include convulsive coughing, difficult and painful breathing, and/or eye irritation. Direct skin contact with liquid anhydrous ammonia can produce chemical and freeze burns requiring prompt medical attention.\n\n12. After the ammonia release has been controlled and ammonia vapors have dissipated, Management shall meet with the Responders to determine that no threat to health or safety exists and then give the all clear signal.\n\n13. After the incident is terminated, Management will document response actions and conduct a debriefing/critique of the Anhydrous Ammonia Release procedure.\n\nPERSONNEL SPECIFIC DUTIES:\n\nControl Room\n\n? Management until relieved.\n\n? Serve as communications coordinator, log all communications.\n\n? Notify the First R"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000084844,
      "SummaryText": "esponders.\n\n? Notify additional resources as directed by Management.\n\nFirst Responders\n\n? Respond to all real and potential emergencies as directed by the CONTROL ROOM and/or Management.\n\n? Provide security.\n\n? Provide traffic and crowd control. Direct response vehicles.\n\n? Coordinate/assist with other Responders.\n\n? Assist with evacuation.\n\n? Provide medical assistance.\n\n? Assist with closing windows and doors and shutting down the building ventilation system if it is safe to do so.\n\n? Assist in keeping people away from the affected area until the all clear signal is given by Management.\n\n? Perform hazard evaluation.\n\n? Report to the location of the emergency as reported by the CONTROL ROOM and/or Management.\n\n? Perform hazard evaluation.\n\n? Coordinate with/assist other responders.\n\n? Direct response vehicles.\n\n? Assist with evacuation.\n\n? Assist with closing windows and doors and shutting down the building ventilation system if it is safe to do so.\n\n? Assist in keeping people away from the affected area until the all clear signal is given by the\n\nManagement.\n\n? Coordinate with/assist other Responders.\n\n? Serve as Management, if necessary.\n\n? Request CONTROL ROOM to notify Safety Coordinators, on-site hazardous waste contractor, fire department, and Emergency Coordinator, if necessary.\n\n? Assist with closing windows and doors and shutting down the building ventilation system if it is safe to do so.\n\n? Provide assistance with utility shut off and control.\n\n? Assign personnel to proceed to gate to direct Responders to scene.\n\n? Assist in keeping people away from the affected area until the all clear signal is given by Management.\n\nMaintenance Personnel\n\n? Perform any necessary immediate process or ammonia flow shut downs, check for leaks, make minor repairs (e.g., tighten valves, fittings, etc.) if qualified and it is safe to do so.\n\n? Provide assistance with utility shut off and control.\n\n? Assist with closing windows and doors and shutting down the building ventila"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000084844,
      "SummaryText": "tion system if it is safe to do so.\n\n? Assist in keeping people away from the affected area until the all clear signal is given by Management.\n\nEnvironmental Health and Safety\n\n? Safety Coordinator and other EHS personnel patrol the area at a safe distance to identify additional safety and environmental hazards.\n\n? Serve as Management, if necessary.\n\n? Evaluate the need for regulatory reporting and make regulatory notifications as directed by Emergency Coordinator.\n\n? Assist with evacuation.\n\n? Assist in keeping people away from the affected area until the all clear signal is given by Management.\n\nManagement\n\n? Coordinate with other Responder(s).\n\n? Serve as Management, if necessary.\n\n? Direct regulatory notifications.\n\n? Coordinate with regulatory agencies if evacuation is necessary. Management\n\n? Coordinate Responders.\n\n? Request CONTROL ROOM to make notifications for additional resources.\n\n? Notify Emergency Coordinator of any property damage, injuries, or hospitalization.\n\n? Coordinate with fire department.\n\n? Provide the all clear signal once the incident is resolved.\n\n? Document response actions and conduct debriefing/critique of the procedure. \n\nOff-site Hazardous Waste Contractor\n\n? Contain or control the ammonia release using appropriate measures wearing appropriate PPE level.\n\n? Take defensive measures to prevent any water used for defensive measures from reaching storm drains.\n\n? Assist with closing windows and doors and shutting down the building ventilation system if requested by Management if PPE is required to perform the tasks.\n\nFire Department\n\n? Provide a water deluge spray, if required, to control an ammonia vapor release.\n\n? Provide medical assistance.\n\n? Conduct search and rescue operations.\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}