{
  "FacilityID": 1000095717,
  "FacilityName": "UNI-KOOL PARTNERS",
  "FacilityStr1": "730 WEST MARKET ST",
  "FacilityStr2": null,
  "FacilityCity": "SALINAS",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": "3140",
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36.68425",
  "FacilityLongDecDegs": "-121.672944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "UNI-KOOL PARTNERS",
  "OperatorStr1": "373 West Market",
  "OperatorStr2": null,
  "OperatorCity": "SALINAS",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": "3140",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000056994",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-04-20 00:00:00",
  "SafetyInspectionBy": "county health department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-08-26 17:42:41",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-08-26 17:42:41",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-08-26 17:42:41",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-08-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.1.5",
  "FRS_Lat": 36.68425,
  "FRS_Long": -121.672944,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "2.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "5",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000118692,
      "AltID": null,
      "FacilityID": 1000095717,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000148328,
          "ProcessID": 1000118692,
          "ChemicalID": 56,
          "Quantity": 46766.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000120044,
          "ProcessID": 1000118692,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000101727,
              "Process_NAICS_ID": 1000120044,
              "SafetyReviewDate": "2014-04-07 00:00:00",
              "PHA_Date": "2015-08-04 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "equipment anchors",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-11-06 00:00:00",
              "TrainingReviewDate": "2014-07-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "safety meetings",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "safety meetings",
              "MaintenanceReviewDate": "2015-11-06 00:00:00",
              "EquipmentInspectionDate": "2015-05-13 00:00:00",
              "EquipmentTested": "Refrigeration Units",
              "ChangeMgmtDate": "2015-01-12 00:00:00",
              "ChangeMgmtReviewDate": "2015-11-06 00:00:00",
              "PreStartupReviewDate": "2015-03-09 00:00:00",
              "ComplianceAuditDate": "2015-11-03 00:00:00",
              "AuditCompletionDate": "2016-07-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-11-06 00:00:00",
              "HotWorkPermitReviewDate": "2014-06-09 00:00:00",
              "ContractorSafetyReviewDate": "2015-11-06 00:00:00",
              "ContractorSafetyEvalDate": "2015-11-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000127639,
                  "PreventionProgram3ID": 1000101727,
                  "ProcessChemicalID": 1000148328
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000095717,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-07-11 00:00:00",
    "ERTrainingDate": "2014-07-25 00:00:00",
    "CoordinatingAgencyName": "MARK McVEIGH",
    "CoordinatingAgencyPhone": "5303128838",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000095717,
      "SummaryText": "ystem. They are also trained in emergency response procedures in the event of an\r\nammonia release. An alarm and detection system monitors the facility for unsafe ammonia\r\nconcentration levels and for operating conditions outside of safety set points. Monitoring is\r\ndone 24 hours per day. Relief valves are installed to protect both the high and low sides from an\r\noverpressure situation. Relief valves are currently piped to a diffusion tank which provides a\r\nsystem-wide mitigation measure. Compressors have control panels, which will automatically\r\nshut down the compressors if pressure and temperature set points are exceeded. An emergency\r\ncontrol box allows system pressures to be relieved without releasing to the ambient. Additional\r\ninformation about the ammonia detection system, the sensor locations and accompanying\r\nequipment specifications sheets can be found in Appendix P.\r\n4. Process Hazard Analysis\r\nA thorough review of the system including a What If Process Hazard Analysis (PHA) was\r\nperformed for this facility on July 29 & Aug 4, 2015 and is included in Appendix D. Prior to\r\nstartup, an engineering walkthrough was performed that included a thorough review of the\r\nrefrigeration equipment and safety systems. In addition to visual inspections, code compliance\r\nreviews were performed. These reports are included in Seismic Review and Code and\r\nRisk Management Plan with Process Safety Management November, 2015\r\nUni-Kool Partners II-4\r\nSalinas, CA\r\nCompliance Audits. Recommendations for follow-up were made on the basis of criticality to the\r\nsafe and efficient operation of the system. Equipment corrections and updates were made for\r\nthose items determined to have the highest potential for offsite releases.\r\n5. Training\r\nSafety and equipment operational training will be conducted on a yearly basis and includes\r\nequipment operational procedures, emergency response procedures, review of Risk Management\r\nPlan procedures, Hazardous Materials Business Plan procedures, a"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000095717,
      "SummaryText": "ntacts\r\n· Notification procedures\r\n· Hazardous material incident response to ammonia releases and other incidents\r\n· Coordinator and personnel responsibilities\r\n· Releases to be reported\r\n· Evacuation plans\r\n· Emergency response checklist\r\n· Emergency shutdown procedures\r\n· Emergency response training\r\nRisk Management Plan with Process Safety Management November, 2015\r\nUni-Kool Partners II-5\r\nSalinas, CA\r\nSee Section V and Appendix L for additional information about the program.\r\n9. Planned Changes to Improve System Safety\r\nAdditional risk reduction measures may be implemented to further reduce the potential for an\r\naccidental release. These measures may include installation of upgraded piping and equipment\r\nsupports, installation of equipment labeling, and implementation of a program aimed\r\nspecifically at the maintenance, training, and emergency response procedures for the ammonia\r\nbased refrigeration equipment."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000095717,
      "SummaryText": "A. EXECUTIVE SUMMARY\r\n[40 CFR 68.155; CalARP Article 3, 2745.3]\r\nThe Risk Management Program at Uni-Kool Partners is designed to prevent the occurrence and\r\nminimize the consequences of releases of anhydrous ammonia from the refrigeration process.\r\nThe following is a summary of the programs, policies, and procedures in place to reduce the risk\r\nof a hazardous materials release.\r\nThe purpose of the RMP is threefold: 1.) to prevent unwanted releases of hazardous chemicals,\r\nespecially into locations that could expose employees and others to serious hazards, 2.) to\r\nidentify hazards associated with the use of anhydrous ammonia, and 3.) to provide procedures\r\nto minimize the risks involved with handling this material.\r\nUni-Kool Partners has implemented the RMP at the Salinas, CA facility in order to comply with\r\nregulations, and to fulfill this facility's responsibility to protect its employees, equipment,\r\nproperty, the surrounding community, and the environment from accidental releases of\r\nanhydrous ammonia.\r\n1. Release Prevention and Emergency Response Policy\r\nUni-Kool Partners will maintain a release prevention program to eliminate or minimize any\r\nreleases. The program will include regular inspections, monitoring equipment and logging\r\nconditions, scheduled maintenance, and operator training. There is a program to analyze\r\nreleases for ways to prevent a similar future release, see Incident Investigation Forms. A Risk\r\nManagement Program, which includes accident prevention procedures for the ammonia\r\nrefrigeration system, is maintained on-site along with this RMP.\r\nThe ammonia refrigeration system has specific safety procedures to prevent a release.\r\nOperators and mechanics are trained for safe operation and maintenance of the refrigeration\r\nsystem. They are also trained in emergency response procedures in the event of an ammonia\r\nrelease. There are emergency shut off switches for shutting down the system. Personnel will\r\nautomatically be notified if any detector e"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000095717,
      "SummaryText": "nd evacuation procedures.\r\nAdditional items requiring further review, correction, and/or updating are identified and\r\npresented at tailgate meetings. Training documentation and forms are included in Appendix E.\r\n6. Updates\r\nAs required in Section VI, Updates, refrigeration equipment will be inspected and reviewed\r\nperiodically and as new equipment becomes operational onsite. When a significant change\r\noccurs, the RMP shall be updated to reflect the change. Any management changes must also be\r\nupdated. This RMP, which includes accident prevention procedures for the ammonia\r\nrefrigeration system, is maintained onsite, and is also submitted electronically to the EPA\r\nCentral Data Exchange (CDX). A copy of the most recent registration is included in Appendix I\r\n7. Five-Year Accident History\r\nAccording to Uni-Kool Partners personnel, in the past five years there have been no releases of\r\nanhydrous ammonia resulting in reportable quantities or injuries. Releases of ammonia, should\r\nthey occur, will be responded to in accordance with company policy and the procedures outlined\r\nin this RMP.\r\n8. Emergency Response Program\r\nThe facility has implemented the State and County mandated emergency response plan\r\n(Business Response Plan). This plan outlines procedures for emergency ammonia release\r\nresponse, as well as general facility response, see Appendix L for the program.\r\nIn event of a release, certain personnel are designated to determine the potential hazard and\r\ncoordinate response procedures. The emergency coordinator is responsible for contacting\r\nemergency response agencies, schools, daycare centers, and acute care facilities that may be\r\naffected by the release. The coordinator will also be responsible for evacuation of employees if\r\nnecessary and for coordination with community emergency responders if offsite evacuations are\r\nrequired.\r\nThe emergency response program consists of the following elements:\r\n· Contact phone numbers for emergency coordinator and emergency co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000095717,
      "SummaryText": "xceeds set point. Monitoring is 24 hours a day. An\r\nemergency control box and diffusion tank allows system pressure to be relieved manually. All\r\nrelief valves for the fixed equipment at W. Market are tied to the ammonia diffusion tank to\r\nprevent high pressure releases to ambient.\r\nOnsite personnel provide initial emergency response. Onsite personnel will make a preliminary\r\nassessment in the event of a release and will provide first response. First response may include\r\nemergency equipment shutdown, system isolation, or controlled operation such as pump down\r\nto prevent or reduce an offsite release with full face cartridge mask. First response does not\r\ninclude wearing a self-contained breathing apparatus and entry into the area where leak occurs.\r\nUni-Kool personnel are not certified to perform this type of safety response.\r\nNo emergency operations will be performed that are beyond the\r\ncapabilities of the operators or other onsite personnel.\r\nRisk Management Plan with Process Safety Management November, 2015\r\nUni-Kool Partners II-2\r\nSalinas, CA\r\nLocal fire and police departments with mutual aid response will provide emergency response for\r\na major release event. The refrigeration contractors would also be on-call to provide emergency\r\nresponse.\r\nEmergency response training will be conducted yearly for current employees and as required for\r\nnew employees. Records will be kept of all training performed at the site for a minimum of five\r\n(5) years.\r\n2. Description of Stationary Source and Substance Handled\r\nUni-Kool Partners, located at West Market St. Facilities, Salinas, CA, utilizes anhydrous\r\nammonia as a refrigerant in their operations. The facility was constructed under applicable\r\ncodes and industry standards at the time of construction.\r\nThis facility utilizes anhydrous ammonia as a refrigerant in their vacuum cooling, produce\r\ncooling, and ice making operations as well as cold storage prior to shipment. Fresh product is\r\nbrought from the fields and cooled"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000095717,
      "SummaryText": "to remove field heat. The produce is then packaged and\r\nstored in a cold storage warehouse prior to shipment form the refrigerated docks. Ammonia is\r\nthe only listed material used at this facility. The plant operates with a total charge of\r\napproximately 44,805 lbs. of ammonia distributed throughout the West Market St. facilities and\r\nequipment. The refrigeration systems for each facility are independent of one another. The\r\nlargest single system charge is 13,905 lbs. at 730 West Market St. facility.\r\nThe Uni-Kool Partners West Market St. Facilities have both fixed and portable refrigeration\r\nsystems onsite composed of compressors with common thermosiphon receivers, evaporative\r\ncondensers, vacuum tubes, evaporative cooling coils, pressure vessels, ammonia pumps, water\r\nchillers, ice generators and a diffusion tank. All compressors have safety switches that would\r\nshut down the compressors upon detection of unsafe operating conditions. Pressure vessels,\r\nwith the exception of some oil separators, and the compressors are protected by safety relief\r\nvalves against high pressure situations. There are ammonia detectors in most of the cold rooms\r\nand in the mechanical room/areas for alarming. There is a list of responders experienced with\r\nammonia refrigeration that would respond and determine specific responses for any incident.\r\nSafeties and detection equipment are tested and maintained by experienced maintenance\r\npersonnel as spelled out in the SOPs (Standard Operating Procedures) and testing and\r\ninspection\r\nThe refrigeration systems at this facility are single stage vapor compression cycles. In general,\r\nthe process chemistry for single-stage systems is shown in Section IV.\r\nThe refrigeration systems consist of the following equipment:\r\n· Reciprocating and screw compressors,\r\n· Low pressure receivers,\r\n· High pressure receivers,\r\n· Evaporative cooling condensers,\r\n· Air cooling evaporators,\r\n· Freeze evaporators,\r\n· Ammonia diffusion tanks\r\n· Ammonia pumps,\r\n· Water"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000095717,
      "SummaryText": "pumps,\r\n· Water chillers,\r\nRisk Management Plan with Process Safety Management November, 2015\r\nUni-Kool Partners II-3\r\nSalinas, CA\r\n· Ammonia purgers,\r\n· Pressure coolers,\r\n· Suction traps (knockout drums),\r\n· Liquid subcooler,\r\n· Oil separators,\r\n· Oil coolers,\r\n· Electric controls\r\n· A refrigeration control panel, and\r\n· An emergency electric switch.\r\nThe Ammonia Refrigeration Safety Inspection (IIAR) Checklists, located in Appendix A,\r\ndescribe equipment details. A complete set of system drawings is in Appendix B. Included in\r\nthis section are the equipment layout and process and instrumentation diagrams (P&IDs).\r\nThe substance handled at Uni-Kool Partners, anhydrous ammonia (NH3), is a gas in its natural\r\nstate and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and\r\nmay cause suffocation, as shortness of breath and labored breathing can develop if inhaled.\r\nProlonged inhalation of high concentrations may cause bronchitis and/or pneumonia, with some\r\nresidual reduction in pulmonary functions. Repeated or prolonged contact of high\r\nconcentrations of ammonia to the skin can cause frostbite, redness, pain, and serious skin burn.\r\nA Globally Harmonized System for Classification and Labelling Chemicals (GHS) Safety Data\r\nsheet for ammonia is included in Appendix C. Written in both Spanish and English, the GHS\r\ndata sheet details the chemical properties and health hazards of anhydrous ammonia.\r\n3. Accidental Release Prevention Program\r\nUni-Kool Partners maintains an accidental release prevention program designed to eliminate or\r\nminimize ammonia releases. The program includes equipment monitoring, regular inspections\r\nand maintenance, and log keeping of operating conditions, scheduled maintenance, emergency\r\nresponse, and operator training.\r\nThe ammonia refrigeration system has specific safety measures in place to prevent accidental\r\nrelease. Operators and mechanics are trained for safe operation and maintenance of the\r\nrefrigeration s"
    }
  ]
}