{
  "FacilityID": 1000042189,
  "FacilityName": "Olathe Water Treatment Plant No. 2",
  "FacilityStr1": "27065 W. 83rd Street",
  "FacilityStr2": null,
  "FacilityCity": "Lenexa",
  "FacilityState": "KS",
  "FacilityZipCode": "66227",
  "Facility4DigitZipExt": "3502",
  "FacilityCountyFIPS": "20091",
  "LEPC": "Johnson County LEPC",
  "FacilityLatDecDegs": "38.974200",
  "FacilityLongDecDegs": "-094.899400",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.olatheks.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 826949513,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Olathe",
  "OperatorStr1": "27065 W. 83rd Street",
  "OperatorStr2": null,
  "OperatorCity": "Lenexa",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66227",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joe Foster",
  "RMPTitle": "Water & Wastewater Superintendent",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000025251",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-03-13 00:00:00",
  "SafetyInspectionBy": "KDHE",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-02-06 00:00:00",
  "DeRegistrationEffectiveDate": "2016-10-27 00:00:00",
  "AnniversaryDate": "2019-05-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.97794,
  "FRS_Long": -94.89776,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051982,
      "AltID": "Water Treatment",
      "FacilityID": 1000042189,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000052599,
          "ProcessID": 1000051982,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000063051,
          "ProcessID": 1000051982,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000563051,
          "ProcessID": 1000051982,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042189,
      "SummaryText": "The City of Olathe operates two water treatment plant facilities.  Water Treatment Plant No. 2 is a 36 million gallon a day lime softening plant.  This Risk Management Plant (RMP) covers the Section 112r of the Clean Air Act regulating substances maintained at Water Treatment Plant No. 2, which will be referred to herein as the Plant.\n\n\n\nApplicable Sources and Regulated Substances\n\nThe regulated hazardous substance stored at this facility is chlorine. Chlorine is used in the Plant for treating raw water to drinking water standards.  The chlorine is stored on site in one-ton cylinders.\n\n\n\nRelease Scenarios\n\nThe analysis of the worst-case release scenario assumed that 2,000 pounds of chlorine were released to the atmosphere over a 10-minute period. No active mitigation may be considered.  The resulting plume was modeled using RMP*Comp (Version 2.01). The distance at which the chlorine concentration in the plume falls below the regulatory endpoint concentration was determined to be 3.0 miles. It was further determined that within this distance of the facility there is a population of 6,946 people. The following public receptors were identified within this distance of the facility: schools, residences, a hospital, recreational areas, and commercial/industrial areas. \n\n\n\nThe alternative release scenario examined a release of chlorine resulting from overpressurization during a fire scenario. The scenario considered that a single fusible plug in the vapor space of the container vented to relieve the overpressure. In this scenario, 450 pounds of chlorine are released over a 30-minute period. This alternative release scenario would occur inside the chlorine building. The building enclosure was considered as a passive mitigation system for this release scenario; however it was assumed that the chlorine scrubber was not operational at the time of the release.  The resulting plume was modeled using RMP*Comp (Version 2.01).   The distance to the regulatory endpoint was calculate"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042189,
      "SummaryText": "d to be 0.2 miles.  It was further determined that within this distance of the facility there is a population of 85 people.  \n\n\n\n\n\nPrevention Program\n\nThe Plant maintains a training schedule for all employees in the areas of technical expertise, safety procedures, and emergency response. The amount of chlorine stored at the Plant requires the Plant to implement a Risk Management Plan Level 2 Prevention Program. The Plant has implemented the prevention program requirements and has completed hazard reviews and compliance audits.  In addition, the Plant has also implemented operating procedures, training, maintenance activities, and incident investigation procedures. The employees at the Plant are efficient at performing their duties in a manner that prevents incidents and injuries. The Plant has been working on evaluating and improving safe operations for many years.\n\n\n\nThe Plant has an operation, maintenance and inspection system designed to review each element of the chlorination system routinely.  There are operations and maintenance manuals for each piece of major equipment, and personnel receive significant training before being allowed to work on the system.  \n\n\n\nAt the beginning of each of the shifts and as each cylinder is changed, the valves and piping are tested for leaks and checked visually.  There are SOPs for startup, shutdown, normal operation, and emergency operation.  The SOPs are written and posted in the appropriate areas.  Personnel are trained routinely on safety concerns and general operation procedures as well as emergency procedures.  \n\n\n\nThe system is equipped with chlorine detectors, a chlorine scrubber, and chlorine cylinder block valves to ensure safe operation and protection.  Continuous ventilation is provided when a worker is present in the room by means of a ventilation switch external to the room.  \n\n\n\nEmergency Response Program\n\nPlant personnel are allowed and trained to respond to leaks that can be managed by turning off a valve.  An"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042189,
      "SummaryText": "y response requiring entry in a dangerous atmosphere or use of a chlorine repair kit is to be managed by the Olathe Fire Department.  The Plant has an agreement in place with the Fire Department.  The City of Lenexa Fire Department will assist with a worker rescue only.  A complete copy of the emergency plan is available on Site.  \n\n\n\nFive-Year Accident History and Planned Changes to Improve Safety\n\nThe system and its safeguards, along with the Plant employees' professional approach to prevent accidents with this and other chemicals used at the Plant, has proven to be very effective at attaining a record of very few releases and minimal amounts of chemical lost during an emergency event. In the past five years, the Plant has not had an accident involving chlorine that resulted in any onsite deaths, injuries, or significant property damage, evacuations, or shelterings in place. It is the focus of the Plant to maintain that record and look into ways to improve the engineering, operations, and training of employees whenever possible."
    }
  ]
}