{
  "FacilityID": 1000036239,
  "FacilityName": "ExxonMobil Baton Rouge Resin Finishing Plant",
  "FacilityStr1": "12480 Scenic Highway",
  "FacilityStr2": null,
  "FacilityCity": "Baton Rouge",
  "FacilityState": "LA",
  "FacilityZipCode": "70807",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22033",
  "LEPC": "East Baton Rouge LEPC",
  "FacilityLatDecDegs": "30.5572361",
  "FacilityLongDecDegs": "-91.2005611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.exxonmobil.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 155267545,
  "ParentCompanyName": "ExxonMobil Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1213214,
  "Company2DUNS": 1213214,
  "OperatorName": "ExxonMobil Chemical Company",
  "OperatorStr1": "12480 Scenic Highway",
  "OperatorStr2": null,
  "OperatorCity": "Baton Rouge",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70807",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jacob L. Talbot",
  "RMPTitle": "Environmental Coordinator",
  "FTE": 36,
  "OtherEPAFacilityID": "70807XXNCH1248",
  "EPAFacilityID": "100000143597",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-06-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-11-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-09-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-09-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 30.55722,
  "FRS_Long": -91.19722,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044427,
      "AltID": "Resin Manufacturing",
      "FacilityID": 1000036239,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000044849,
          "ProcessID": 1000044427,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053471,
          "ProcessID": 1000044427,
          "ChemicalID": 125,
          "Quantity": 3600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000553471,
          "ProcessID": 1000044427,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036239,
      "SummaryText": "The accidental release prevention and emergency response policies at the stationary source\n\n\n\n   The accidental release prevention and emergency response policies can best be summarized by ExxonMobil Operations Integrity Management Systems (OIMS).  This is a structured approach to managing the safety, health, and environmental risks, which are inherent in our business.  While OIMS was not designed to meet a specific regulation, each section of the Process Safety Management (PSM)/Risk Management Program (RMP) standard can be mapped directly to an OIMS system.  The OIMS system is the overall guidance, while specific operating, mechanical, technical and / or SHE procedures support the system by providing more detailed information.\n\n\n\nThe stationary source and regulated substances handled\n\n\n\n   The ExxonMobil Baton Rouge Finishing Plant (BRFP) is a quality producer of hydrocarbon resins.  Our products are used throughout the adhesives industry to provide \"tack\" to such familiar products such as bandaids, tape, glue sticks, and diaper tabs.  The plant, located at 12480 Scenic Highway, Baton Rouge, La., has been in business at the same location since 1968.  Only the physical separation of resin from solvent occurs at BRFP.  All process chemistry occurs at the ExxonMobil Baton Rouge Chemical Plant.  A brief description of the physical separation process is as follows: \n\n   1) resin concentrate (feed) is shipped via pipeline from the Baton Rouge Chemical Plant and is received in the BRFP storage tanks; \n\n   2) the feed is then pumped to stripping towers where solvent and light molecular weight resins are taken overhead and returned to the chemical plant; \n\n   3) the molten resin product is taken off the bottom of the towers and pumped to molten resin storage tanks; \n\n   4) the molten resin is then processed into various finished packaged forms.\n\n   Pentane is a colorless liquid with a \"gasoline\" odor.  It is used as a raw material component in the resin production and exist"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036239,
      "SummaryText": "s on site as a recovered overhead from the stripping process.  Total loss of containment of Tank 502 (which contains as much as 3,600,000 lbs of flammable mixture containing pentane) under worst possible weather conditions, and an ensuing vapor cloud explosion of this mixture, would be the worst case scenario for a flammable at the BRFP.  Offsite impact for this scenario as determined by the EPA Offsite Consequence Analysis Guidelines would extend for 1.2 miles.  The alternative release scenario for the BRFP would be a tank or piping leak within the Tank 502 dike wall and a subsequent pool-fire.  Distance of concern for this scenario would be 0.14 miles.  The amount of flammable mixture available would be 68,000 lbs.  There are no toxic chemicals on site that exceed threshold limits.\n\n\n\nThe general accidental release prevention program and chemical-specific prevention steps\n\n\n\n   The following is a general overview of the OIMS elements supporting the PSM/RMP program at BRFP.\n\n\n\nPSM/RMP Element - Employee Participation [29 CFR 1910.119(c), 40 CFR 68.83]\n\n   OIMS 1.1 - Management, Leadership, Commitment, and Accountability:  This system provides the framework for management to set expectations, establish standards and goals, provide resources, and ensure that performance is measured, communicated, and continuously improved.  Assurance of operations integrity requires management leadership and commitment visible to the organization and accountability at all levels. Operations Integrity addresses all aspects of operations that can impact safety, security, health and environmental performance (SSH&E).\n\n   OIMS 5.1 - Personnel Safety:  This system is in place to ensure that safety is a core value and will be considered in every decision that is made.  No business objective is so important that it will be pursued at the sacrifice of safety.  Each employee has a personal responsibility for our safety and the safety of others. Accidents, injuries, and occupational illnesses "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036239,
      "SummaryText": "are preventable through the application of effective systems, procedures, and practices to ensure the safety of personnel.\n\n\n\nPSM/RMP Element - Process Safety Information [29 CFR 1910.119(d), 40 CFR 68.65]\n\n   OIMS 2.1 - Risk Analysis, Assessment, and Management:  This system is in place to ensure that risk assessments reduce risks to safety, security, health and the environment and mitigate the consequences of incidents by providing essential information for decision-making.  This process involves hazard identification, assessment of probabilities and consequences, and evaluation of risk prevention and mitigation measures.  The process applies to ongoing operations, projects, and products.\n\n   OIMS 3.1 - Facility Design and Construction:  This system ensures that inherent safety and security can be enhanced and risk to health and the environment minimized by using sound standards, procedures, and management systems for facility design, construction, and start-up.\n\n   OIMS 4.1 - Documentation / Information:  This system ensures accurate information on the configuration and capabilities of processes and facilities, properties of products and materials handled, potential safety, security, health, and environmental hazards, and regulatory requirements is essential to assess and manage risk.\n\n   OIMS 5.2 - Occupational Health:  The purpose of this system is to protect the health of employees, contractors, and the community from adverse effects that may result from operations.\n\n   OIMS 6.1 - Operating and Maintenance Procedures:  This system ensures that operation of our facilities within established operating and regulatory parameters.  Operations and maintenance procedures provide guidance for plant personnel for work activities which are complex, critical, or infrequent and thus should be formalized to ensure consistent and effective execution.\n\n\n\nPSM/RMP Element - Process Hazard Analysis [29 CFR 1910.119(e), 40 CFR 68.67]\n\n   OIMS 2.1 - Risk Analysis, Assessment, and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036239,
      "SummaryText": " Management:  This system is in place to ensure that risk assessments reduce risks to safety, security, health and the environment and mitigate the consequences of incidents by providing essential information for decision-making.  This process involves hazard identification, assessment of probabilities and consequences, and evaluation of risk prevention and mitigation measures.  The process applies to ongoing operations, projects, and products.\n\n\n\nPSM/RMP Element - Operating Procedures [29 CFR 1910.119(f), 40 CFR 68.69]\n\n   OIMS 6.1 - Operating and Maintenance Procedures:  This system ensures that operation of our facilities within established operating and regulatory parameters.  Operations and maintenance procedures provide guidance for plant personnel for work activities which are complex, critical, or infrequent and thus should be formalized to ensure consistent and effective execution.\n\n\n\nPSM/RMP Element - Training [29 CFR 1910.119(g), 40 CFR 68.71]\n\n   OIMS 5.4 - Training:  This system ensures that personnel whose work could affect the operations integrity of the site have, and maintain, the necessary knowledge and skills to execute their job in a manner consistent with the safe and environmentally sound operation of the site.\n\n\n\nPSM/RMP Element - Contractors [29 CFR 1910.119(h), 40 CFR 68.87]\n\n   OIMS 8.1 - Third Party Services:  This system ensures that third parties doing work on ExxonMobil's behalf perform in a manner consistent and compatible with ExxonMobil's policies and business objectives.\n\n\n\nPSM/RMP Element - Pre-Startup Safety Review [29 CFR 1910.119(i), 40 CFR 68.77]\n\n   OIMS 3.1 - Facility Design and Construction:  This system ensures that inherent safety and security can be enhanced and risk to health and the environment minimized by using sound standards, procedures, and management systems for facility design, construction, and start-up.\n\n   OIMS 7.1 - Management of Change:  This system ensures that changes in operations, procedures, applicable "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036239,
      "SummaryText": "standards, facilities, and personnel are evaluated and managed to ensure that safety, security, health, and environmental risks arising from these changes remain at an acceptable level.\n\n\n\nPSM/RMP Element - Mechanical Integrity [29 CFR 1910.119(j), 40 CFR 68.73]\n\n   OIMS 5.4 - Training: - This system ensures that personnel whose work could affect the operations integrity of the site have, and maintain, the necessary knowledge and skills to execute their job in a manner consistent with the safe and environmentally sound operation of the site.\n\n   OIMS 6.1 - Operating and Maintenance Procedures:  This system ensures that operation of our facilities within established operating and regulatory parameters.  Operations and maintenance procedures provide guidance for plant personnel for work activities which are complex, critical, or infrequent and thus should be formalized to ensure consistent and effective execution.\n\n   OIMS 6.3 - Safety Critical Equipment:  This system is in place to ensure that critical equipment is designed to prevent, mitigate, detect, or respond to process incidents that could result in loss of containment of flammable or toxic materials, potential severe injuries or deaths, or a release of materials that could have a serious environmental impact.  Critical equipment also includes devices which protect against breaches of security access that have the potential for serious consequences.  This system is intended to help ensure this equipment operates when called upon.\n\n   OIMS 6.4 - Mechanical Integrity:  The mechanical integrity system protects the safety and health of personnel, the environment, equipment, and satisfies applicable laws, regulations, and approved standards.  It addresses the mechanical integrity of all equipment that can impact SSH&E with a focus on prevention of loss of containment.  It applies to existing facilities, new construction, modifications to existing facilities, and replacements-in-kind.\n\n\n\nPSM/RMP Element - Hot Work Pe"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000036239,
      "SummaryText": "rmits [29 CFR 1910.119(k), 40 CFR 68.85]\n\n   OIMS 6.4 - Mechanical Integrity:  This system ensures that each site has a work permit system in place to protect personnel (employees and contractors), site facilities, and the surrounding community.  The purpose of a work permit system is to ensure that jobs are planned, equipment is prepared, personnel are informed of hazards and procedures, precautions are taken, and work is executed in a manner to protect safety, security, health, and the environment.\n\n\n\nPSM/RMP Element - Management of Change [29 CFR 1910.119(l), 40 CFR 68.75]\n\n   OIMS 7.1 - Management of Change:  This system ensures that changes in operations, procedures, applicable standards, facilities, and personnel are evaluated and managed to ensure that safety, security, health, and environmental risks arising from these changes remain at an acceptable level.\n\n\n\nPSM/RMP Element - Incident Investigation [29 CFR 1910.119(m), 40 CFR 68.81]\n\n   OIMS 9.1 - Incident Investigation:  This system is in place to ensure that effective incident investigation, reporting, analysis and follow-up are undertaken to provide the opportunity to learn from incidents, to use the information to take corrective action, and prevent recurrence.\n\n\n\nPSM/RMP Element - Emergency Planning & Response [29 CFR 1910.119(n), 40 CFR 68.95]\n\n   OIMS 10.1 - Emergency Preparedness:  This system is in place to ensure that, in the event of an incident, all necessary actions are taken for the protection of the public, employees, contractors, the environment, and assets.\n\n\n\nPSM/RMP Compliance Audits [29 CFR 1910.119(o), 40 CFR 68.79]\n\n   OIMS 11.1 - Assessment and Improvement:  This system is in place to improve Operations Integrity by measuring performance relative to requirements.  This is accomplished through a process of internal and external assessments and follow-up.\n\n   OIMS 6.6 - Regulatory Compliance:  This system ensures compliance with safety, security, health, and environmental laws, regulat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000036239,
      "SummaryText": "ions, permits and other governmental requirements, including Consent Decrees/Agreed Government Orders (CD/AGOs).\n\n\n\nThe five-year accident history\n\n\n\n   The end result of BRFP's accident prevention program is no RMP qualified accidents in the history of the RMP program.\n\n\n\nThe emergency response program\n\n\n\n   As previously stated, OIMS 10.1 (Emergency Preparedness) is in place to ensure that, in the event of an incident, all necessary actions are taken for the protection of the public, employees, contractors, the environment, and assets.  This is achieved through comprehensive response procedures that coordinate on-site responders with Local Emergency Planning Committee (LEPC), industry, and public agencies.  Fixed fire protection equipment is maintained on-site with additional capability provided by area ExxonMobil resources.\n\n\n\nPlanned changes to improve safety\n\n\n\n   As previously discussed, OIMS 11.1 (Assessment and Improvement) is in place to improve Operations Integrity by measuring performance relative to requirements.  Since OIMS supports PSM / RMP elements as discussed above, the assessment and improvement process under OIMS 11.1, by definition, improves overall process safety at the site.  This is accomplished through a process of internal and external OIMS assessments and follow-up.  Internal assessments are conducted annually utilizing personnel trained in the expectations OIMS.  External assessments are conducted periodically by personnel from outside the affected operation.  Team composition and frequency are consistent with the complexity of operations, regulations, and performance history.\n\n"
    }
  ]
}