{
  "FacilityID": 1000061921,
  "FacilityName": "Inland Empire Energy Center, LLC",
  "FacilityStr1": "26226 Antelope Road",
  "FacilityStr2": null,
  "FacilityCity": "Menifee",
  "FacilityState": "CA",
  "FacilityZipCode": "92585",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.737910",
  "FacilityLongDecDegs": "-117.170565",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": "frank.escobedo@ge.com",
  "FacilityDUNS": 107161213,
  "ParentCompanyName": "Inland Empire Holding Limited I, Inc.",
  "Company2Name": "Inland Empire Holding Limited II, Inc.",
  "CompanyDUNS": 1367960,
  "Company2DUNS": 0,
  "OperatorName": "Inland Empire Energy Center, LLC",
  "OperatorStr1": "26226 Antelope Road",
  "OperatorStr2": null,
  "OperatorCity": "Menifee",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92585",
  "OperatorZipCodeExt": null,
  "RMPContact": "Francisco Escobedo",
  "RMPTitle": "Director, Asset Management",
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199741",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "129816",
  "SafetyInspectionDate": "2014-10-14 00:00:00",
  "SafetyInspectionBy": "Riverside County Dept. of Environmental Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Program Level 1",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-06-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-06-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "200",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077609,
      "AltID": "SCR",
      "FacilityID": 1000061921,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000078810,
          "ProcessID": 1000077609,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096478,
          "ProcessID": 1000077609,
          "ChemicalID": 57,
          "Quantity": 60082.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000596478,
          "ProcessID": 1000077609,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061921,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nInland Empire Energy Center, LLC is committed to providing a safe environment to its employees and surrounding communities.  This commitment is reflected in the safety and environmental programs that are implemented at the facility.  For example, written procedures have been created for operating the selective catalytic reduction (SCR) systems.  Only trained operators are permitted to perform system operations.  Inland Empire Energy Center, LLC has also developed a robust maintenance program to ensure the equipment is in good operating condition.  All of these programs are geared towards the prevention of an accidental release at the facility.  In addition, these programs incorporate emergency procedures to mitigate the effects of a release if it does occur.  At such an event, emergency coordinators will assess the situation and notify outside responding agencies as necessary.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nInland Empire Energy Center, LLC is a combined-cycle power generation facility based on two General Electric (GE) 107H gas turbines.  \n\n\n\nInland Empire Energy Center, LLC utilizes aqua ammonia (29.4%) within the selective catalytic reduction (SCR) systems to reduce nitrogen oxides (NOx) emissions.\n\n\n\nThe aqua ammonia is stored in two 16,200 gallon (35,940 lbs) storage tanks as a liquid solution, re-gasified, and injected into the SCR reaction chamber. The two storage tanks are located within a single containment berm and all process equipment is located outside.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nInland Empire Energy Center, LLC has developed an accidental release prevention program for compliance with EPA regulations.  The program includes but is not limited to the following elements:\n\n\n\n?    Safety information regarding the chemical hazards, and operating and technical specifications for the equipment;\n\n?    Written procedures for operating and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061921,
      "SummaryText": "maintaining the process;\n\n?    Training for personnel involved with system operations and maintenance;\n\n?    Written procedures for safely introducing modifications to the covered process;\n\n?    Investigating releases and near misses and implementing measures to prevent recurrence; \n\n?    Written procedures for conducting hot work on or near the covered process;\n\n?    Contractor management policies to ensure contract employee safety while on facility premises;\n\n?    Audit procedures for ensuring that the programs are being implemented in accordance to the regulations; and\n\n?    Employee involvement in program development and implementation. \n\n\n\nIn addition, engineering controls have been implemented to reduce the chance of an accidental release to the environment.  These are comprised of equipment monitoring systems and safety cutouts to shut off the equipment when operating parameters exceed safe operating limits. Regular inspections and tests are performed to ensure these controls are in good working order.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nA review of the facility's five year accident history showed that there have been no incidents at the facility that meet the RMP criteria for a reportable accident (onsite deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place).  In addition, there have been no incidents at the facility in the last five years that resulted in a release of more than the Federal Reportable Quantity (100 pounds).\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nInland Empire Energy Center, LLC has developed an Emergency Action Plan (EAP) for the purpose of protecting employees and the surrounding community.  The EAP covers procedures for: 1) evacuating and accounting for visitors and employees, 2) dealing with an aqua ammonia release and other foreseeable emergencies that could occur onsite, 3) notifying external agencies and emergency response personnel, and 4) administering first aid"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061921,
      "SummaryText": " measures for aqua ammonia exposure.  Employees are informed of the elements of the EAP.  In the event of an aqua ammonia release, employees will evacuate or shelter-in-place, depending on the nature of the release, and the facility will coordinate response procedures by contacting the Riverside Fire Department.  Ammonia sensors are present near the equipment and automatic shut down systems are in place.  \n\n\n\nEmployees within the building are to shelter in place or evacuate to a point upwind of the facility.  Evacuation drills are performed annually.  This Plan will be reviewed and updated at least once per year to ensure compliance with the CalARP and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nPHA's and Compliance Audits have been performed on the aqua ammonia SCR systems, and these studies have resulted in action items to improve safety at the facility.  The recommendations mainly consist of formalizing procedures, implementing practices consistent with industry standards, and performing inspections and tests to maintain the integrity of the equipment.  Inland Empire Energy Center, LLC has implemented several of these action items and is moving forward with completing the remaining outstanding recommendations.   In addition, the facility plans to continue providing employees with a safe work environment through continued training on current policies and procedures, and conducting audits to identify deficiencies and make improvements."
    }
  ]
}