{
  "FacilityID": 1000036067,
  "FacilityName": "San Leandro Milk",
  "FacilityStr1": "2000 Adams Ave.",
  "FacilityStr2": null,
  "FacilityCity": "San Leandro",
  "FacilityState": "CA",
  "FacilityZipCode": "94577",
  "Facility4DigitZipExt": "1008",
  "FacilityCountyFIPS": "06001",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "37.724180",
  "FacilityLongDecDegs": "-122.192253",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.safeway.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39047964,
  "ParentCompanyName": "Safeway Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9137209,
  "Company2DUNS": 9137209,
  "OperatorName": "Safeway San Leandro Milk",
  "OperatorStr1": "2000 Adams Avenue",
  "OperatorStr2": null,
  "OperatorCity": "San Leandro",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94577",
  "OperatorZipCodeExt": null,
  "RMPContact": "Craig Vevoda",
  "RMPTitle": "Plant Manager",
  "FTE": 114,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061808",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-04-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-12-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-08-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-08-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-08-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.72367,
  "FRS_Long": -122.19154,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044233,
      "AltID": "Milk Manufacturing",
      "FacilityID": 1000036067,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000044652,
          "ProcessID": 1000044233,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000053256,
          "ProcessID": 1000044233,
          "ChemicalID": 56,
          "Quantity": 17500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000553256,
          "ProcessID": 1000044233,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036067,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe management and staff of the San Leandro Milk Plant are committed to operating the Plant with the highest regard for the safety of the public, Plant personnel, and the environment.  To ensure the safety of the public, Plant personnel, and the environment, the Plant has implemented a management system that integrates the elements of OSHA's Process Safety Management (PSM) standard, 29 CFR 1910.119 and EPA's Risk Management Program (RMP) rule, 40 CCFR Part 68.  The policies and procedures integrated under the Plant's management system specifically address prevention of the release of anhydrous ammonia, and emergency response to an accidental release of ammonia.\n\n\n\nDescription of Processes, and Regulated Substances Handled at the San Leandro Milk Plant\n\n\n\nThe San Leandro Milk Plant produces fluid milk and other products that require refrigeration.  Anhydrous ammonia is used as a refrigerant in the mechanical compression refrigeration system at the San Leandro Milk Plant.  Ammonia is handled in a closed-loop process that consists of the following general stages: Liquid storage; Expansion; Evaporation; Compression; and Condensation.\n\n\n\nMechanical refrigeration is a physical process, rather than a chemical process: the ammonia undergoes no chemical changes in the refrigeration cycle.  Heat is removed from the product being refrigerated or frozen as ammonia changes phase from liquid to vapor.  By reliquefying the ammonia vapor, the ammonia can be used continuously in the refrigeration cycle.\n\n\n\nThe ammonia refrigeration system is the only process at the San Leandro Milk Plant, which is subject to the EPA RMP rule (and the OSHA PSM standard, and the CalARP program).  Anhydrous ammonia is the only regulated substance handled in the ammonia refrigeration system.\n\n\n\nAt ambient temperature and pressure, ammonia is a colorless gas with a characteristic, irritating odor.  Ammonia is highly soluble in water.  Ammon"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036067,
      "SummaryText": "ia is the third highest-volume chemical produced in the United States.  The chemical formula of ammonia is NH3.  Anhydrous ammonia is handled both as a pressurized liquid at ambient temperature and as a refrigerated liquid within the San Leandro Milk Plant refrigeration system.\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe San Leandro Milk Plant facility has an Emergency Action Plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nThe San Leandro Milk Plant maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes.\n\n\n\nThe San Leandro Milk Plant has coordinated emergency response efforts with the local fire department and with the contracted refrigeration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of San Leandro Milk Plant to evacuate and to allow the fire department and the refrigeration contractors to respond to the emergency. The Fire Department will notify the public in the event of a release, and indicate the need to evacuate, shelter in place, or take other actions as appropriate.\n\n\n\nDescription of Processes, and Regulated Substances Handled at the San Leandro Milk Plant\n\n\n\nT"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036067,
      "SummaryText": "he San Leandro Milk Plant produces fluid milk and other products that require refrigeration.  Anhydrous ammonia is used as a refrigerant in the mechanical compression refrigeration system at the San Leandro Milk Plant.  Ammonia is handled in a closed-loop process that consists of the following general stages: Liquid storage; Expansion; Evaporation; Compression; and Condensation.\n\n\n\nMechanical refrigeration is a physical process, rather than a chemical process: the ammonia undergoes no chemical changes in the refrigeration cycle.  Heat is removed from the product being refrigerated or frozen as ammonia changes phase from liquid to vapor.  By reliquefying the ammonia vapor, the ammonia can be used continuously in the refrigeration cycle.\n\n\n\nThe ammonia refrigeration system is the only process at the San Leandro Milk Plant, which is subject to the EPA RMP rule (and the OSHA PSM standard, and the CalARP program).  Anhydrous ammonia is the only regulated substance handled in the ammonia refrigeration system.\n\n\n\nAt ambient temperature and pressure, ammonia is a colorless gas with a characteristic, irritating odor.  Ammonia is highly soluble in water.  Ammonia is the third highest-volume chemical produced in the United States.  The chemical formula of ammonia is NH3.  Anhydrous ammonia is handled both as a pressurized liquid at ambient temperature and as a refrigerated liquid within the San Leandro Milk Plant refrigeration system.\n\n\n\nAccidental Release Prevention Program\n\n\n\nThe San Leandro Milk Plant ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the San Leandro Milk Plant facility operates in accordance with OSHA's Process Safety Management regulation.\n\n\n\nThe San Leandro Milk Plant facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036067,
      "SummaryText": "for the safe operation of the ammonia refrigeration system.  These safety features include the emergency underground diffusion tanks. Ammonia can be dumped to the underground diffusion tanks, if needed during an emergency, such as fire. All pressure vessels are equipped with pressure relief valves that relieve to atmosphere.\n\n\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.  In particular, the IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems.\"\n\n\n\nFive-year Accident History\n\n\n\nEPA's RMP Program defines \"accident\" as the following:\n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nA review of the facility's accident history revealed that there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (December 2008 - December 2013). In addition, there have been no releases of ammonia that meet the RMP definition of \"accident\" as described above.\n\n\n\nEmergency Response Program\n\n\n\nThe San Leandro Milk Plant has an Emergency Action Plan (plan) in effect at the facility.  This Plan is detailed in the PSM/RMP document maintained at the facility.  The Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nSan Leandro Milk Plant maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036067,
      "SummaryText": " notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations. \n\n\n\nIn the event of an ammonia release, supervisors or ranking engineers will initiate plant evacuations. If a supervisor is unavailable, any employee can initiate a plant evacuation by activating the Internal Alarm System, by dialing \"86\" and leaving the telephone off the hook. Personnel will attempt to shut off equipment if possible, and proceed to the meeting place upwind of the facility by observing the windsock on top of the Raw Milk Tank (RT-5). The primary meeting place is at the Truck Repair Shop, in the southwest corner of the property. The secondary meeting place is the front parking lot between the office and Raw Milk Receiving Bays. A supervisor or ranking engineer will conduct a headcount to be sure everyone is accounted for utilizing the daily employee schedules, sign in book, and on site contractor list. \n\n\n\nAmmonia is a strongly alkaline substance that can result in irritation or damage to skin, eyes, and mucous membranes. Liquid ammonia can also cause freeze burns to unprotected skin. In the event that an employee is injured on the job, the Senior Person in Charge will be notified to determine the necessary course of action. If the injury is life threatening, 911 will be called immediately. If an employee is exposed to ammonia enough that it has caused burning and irritation, the area of exposure will be flushed with cool water for 15 minutes or longer. Employees will not attempt to remove clothing from a victim with ammonia frost. \n\n\n\nSan Leandro Milk Plant has coordinated emergency response efforts with the local fire department (Alameda County Fire Department, 510-618-3490) and with the contracted refrig"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000036067,
      "SummaryText": "eration operation and maintenance firm.  In the case of an ammonia-related emergency, it is the policy of San Leandro Milk Plant to evacuate and to allow the fire department and the refrigeration contractors to respond to the emergency. The Fire Department will notify the public in the event of a release, and indicate the need to evacuate, shelter in place, or take other actions as appropriate. The Plant Engineer or Maintenance supervisor is responsible for notification of necessary agencies. All employees at San Leandro Milk Plant will be given emergency response training during New Employee Orientation and Department Safety Meetings.  At least annual emergency evacuation drills are held at the facility.\n\n&#8195;\n\nPlanned Changes to Improve Safety\n\n\n\nThe PSM/RMP prevention program elements have been integrated into the San Leandro Milk Plant's management system framework, in accordance with internationally recognized principles of total quality management.  The management system is designed to ensure implementation of each program element, in compliance with the OSHA PSM standard, and the EPA RMP rule.  Authority, responsibility, and accountability are clearly and specifically assigned to Plant management, supervision, and staff.  The means of documenting compliance have been improved for each prevention program element.\n\n\n\n"
    }
  ]
}