{
  "FacilityID": 1000040573,
  "FacilityName": "Cogeneration Facility 38",
  "FacilityStr1": "28601 Hovey Hills Road",
  "FacilityStr2": null,
  "FacilityCity": "Taft",
  "FacilityState": "CA",
  "FacilityZipCode": "93268",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.092960",
  "FacilityLongDecDegs": "-119.443207",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "www.linnenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 151321411,
  "ParentCompanyName": "Berry Petroleum Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Berry Petroleum Company, LLC",
  "OperatorStr1": "5201 Truxtun Ave",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93309",
  "OperatorZipCodeExt": "0640",
  "RMPContact": "Robert Boston",
  "RMPTitle": "EH&S Supervisor",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000111942",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "S-2265-1-12",
  "SafetyInspectionDate": "2013-11-26 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.1554,
  "FRS_Long": -119.442,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000050024,
      "AltID": "Ammonia Injection System",
      "FacilityID": 1000040573,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000050487,
          "ProcessID": 1000050024,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000060550,
          "ProcessID": 1000050024,
          "ChemicalID": 56,
          "Quantity": 54720.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000560550,
          "ProcessID": 1000050024,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000040573,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n\n\nAccidental Release Prevention\n\n\n\nCogeneration Facility 38 has developed a Risk Management Program and an Emergency Response Plan to address CalARP Program requirements (19 CCR ?2735-2785).  \n\n\n\nCogeneration Facility 38 has a long standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Ammonia Injection System.  \n\nCogeneration Facility 38's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\n\n\n\n\nStationary Source and Regulated Substance.\n\n\n\nThe Cogeneration Facility 38 is located at 28700 Hovey Hill Road, Taft, California. The regulated substance at the Facility is anhydrous ammonia\n\n\n\nThe maximum intended inventory of anhydrous ammonia is 9600 gallons (54,720 pounds [lbs.]) and it is stored in a pressurized horizontal storage tank (T-1001) at ambient temperature in liquid form.  When ambient conditions do not significantly promote the vaporization of liquid ammonia, a vaporizer is utilized to heat the liquid to its boiling point to produce vapor.  The vapor ammonia is sent to a mixing chamber where it is mixed with air.  The resulting vapor ammonia / air stream is then injected into the Heat Recovery Steam Generator (HRSG).  This, in conjunction with the catalyst within the HRSG, allow for the reduction of NOx and other unwanted materials being sent to the environment.  The exhaust gas containing a lower concentration of NOx is then sent from the HRSG to an exhaust stack.\n\n \n\n\n\nHazard Assessment Summary/Offsite Consequence Analysis\n\n\n\n?    Worst-Case Release Scenario Results Summary:\n\nPer CalARP Regulations and US EPA RMP Regulations, one worst-case analysis has been defined and modeled for the Ammonia Injection System.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000040573,
      "SummaryText": "tab of the 2014 CalARP/RMP/PSM Program 3 Five Year Update Binder. \n\n?    Alternative Release Scenario Results Summary:\n\nAn alternative release scenario was modeled.  The results can be found in the Hazard Assessment documentation located behind the Hazard Assessment tab of the 2014  CalARP/RMP/PSM Program 3 Five Year Update Binder.\n\n\n\n\n\nRisk Considerations\n\n\n\nAlthough the storage and use of anhydrous ammonia has inherent potential risks, and worst-case release scenarios can potentially reach the community; Cogeneration Facility 38 has recognized these potential risks and structured its safety programs to make the worst-case type of event non-credible.  In addition to the safety practices of the company and plant personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent.  \n\n\n\nTurbulence causes entrainment of air and the released vapor dilutes much more quickly than is shown in the model).\n\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release, including the following:\n\n?    Automatic / Manual Shutdown\n\n?    Well Designed Relief System\n\n?    Safety showers/eye wash stations are available for Operators, if exposed to ammonia at the ammonia fill station.\n\n?    Personal Protective Equipment (PPE) is used by plant personnel, as necessary.\n\n?    The system undergoes periodic maintenance to reduce the likelihood of catastrophic failures.\n\n\n\n\n\n\n\nAccidental Release Prevention Program\n\n\n\nAs part of the implementation of this CalARP Program, key Prevention Program elements were documented and implemented by Cogeneration Fac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000040573,
      "SummaryText": "ility 38 to manage process safety issues associated with the use of ammonia.  Furthermore, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.\n\n\n\nThe total anhydrous ammonia inventory of the ammonia injection system at the facility is 9600 gallons (54,720 lbs.).  The amount of anhydrous ammonia corresponds to the 80% capacity of T-1001, as the facility implements administrative controls that limit the maximum filling of the tanks to 80% of the capacity. \n\nTherefore, the covered process has over the 10,000-lb threshold quantity for US EPA RMP and Cal/OSHA PSM threshold quantities, and over the 500-lb state threshold for CalARP Program.  As a result, the anhydrous ammonia covered process is subject to CalARP Program Level 3, US EPA RMP Program Level 3, and Cal/OSHA PSM. \n\n \n\nThe Anhydrous Ammonia Prevention Program 3 elements include:\n\n?    Process Safety Information\n\n?    Process Hazard Analysis\n\n?    Operating Procedures\n\n?    Training\n\n?    Mechanical Integrity\n\n?    Management of Change\n\n?    Pre-Startup Safety Review\n\n?    Compliance Audits\n\n?    Incident Investigation\n\n?    Employee Participation\n\n?    Hot Work Permit\n\n?    Contractors\n\n\n\nIn addition, key emergency response elements were addressed in Section 4.7 of this document. \n\n\n\n\n\nFive-Year Accident History\n\n\n\nFor any accidental release meeting the five-year accident history reporting criteria of 19 CCR ?2750.9, the owner or operator shall submit the data required under 19 CCR ?2745.5, ?2745.6, and ?2745.7 with respect to that accident within six months of the release or by the time the RMP is updated under 19 CCR ?2745.10, whichever is earlier.\n\nFrom 19 CCR ?2750.9: \n\n\n\nThe owner or operator shall include in the five-year accident history all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\nThe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000040573,
      "SummaryText": "re have been no CalARP-applicable releases of ammonia at Cogeneration Facility 38 in the past five years.\n\n\n\n\n\nEmergency Response Program\n\n\n\nNeither Cogeneration Facility 38 nor Solar Turbines, Inc. are First Responders.  The Facility has implemented an Emergency Action Plan (EAP) that meets the requirements of 8 CCR ?3220 and does not assume the role of first responder during an emergency.  Employees are trained to evacuate and call 9-1-1.  The Cogeneration Facility 38 will coordinate with local Fire Department and First Responders.  They are trained and fully equipped to respond to hazardous material releases  \n\nCogeneration Facility 38 and Solar Turbines, Inc. maintain the EAP that provides the response protocols and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which have been implemented to respond effectively to emergency situations that may arise at the facility.  The EAP is reviewed and updated at least once per year to ensure compliance with CalARP and EAP regulations. \n\n\n\nKey elements of the EAP include:\n\n?    Emergency Alarm Procedures\n\n?    Evacuation Procedures\n\n?    Safety and Health Considerations\n\n?    Notification Procedure\n\n\n\nExternal Events Analysis Information\n\n\n\nPursuant to the requirements of 19 CCR ?2745.6(l); the following external events analysis information shall be submitted:\n\n?    The types of natural and human caused external events considered in PHA 19 CCR ?2760.2 or Hazard Review 19 CCR ?2755.2.  \n\no    During the February 27, 2014 Process Hazard Analysis (PHA), plausible events were considered.  General events external to the facility that can conceivably cause a release of ammonia were addressed.  For detail information, refer to PHA Report located within the PHA Section Tab of the 2014 CalARP/RMP/PSM Program 3 Five-Year Update Binder.\n\n?    The estimated magnitude or scope of external events which were considered.  If not known, the owner or operator of the stationary source shall work closely with the AA"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000040573,
      "SummaryText": " to determine what is required.  If seismic events are applicable, the parameters used in the consideration of the seismic analysis and which edition of the Uniform Building Code was used when the process was designed.\n\no    A seismic safety walk-down was performed in April 18, 2014.  All findings are documented in the \"Seismic Assessment\" report located within the 2014 CalARP/RMP/PSM Program 3 Five-Year Update Binder.\n\no    The magnitudes of the external events considered are detailed within the PHA Worksheets and were qualitatively risk-ranked by the PHA Team.\n\n?    For each external event, with a potential to create a release of a regulated substance that will reach an endpoint offsite, apply \n\n1)    The expected date of completion of any changes resulting from the Process Hazard Analysis (PHA)\n\n2)    Major hazards identified;\n\n3)    Process controls in use;\n\n4)    Mitigation systems in use;\n\n5)    Monitoring and detection systems in use; and,\n\n6)    Changes since the last PHA\n\no    Refer to Section 7.4 section of the RMPe*submit, under PHA, for the required information.\n\n?    The date of the most recent field verification that equipment is installed and maintained as designed.\n\no    The most recent field verification of equipment was conducted on March 25th, 2014 and included the ammonia piping.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe PHA study has been conducted to examine mitigation measures to improve safety at the facility.  Planned changes to improve safety are listed as recommendations in the February 27th, 2014 PHA Report located behind the PHA Tab of the 2014 CalARP/RMP/PSM Program 3 Five-Year Update Binder.\n\n\n\nFlammables: Worst Case\n\nThe use of flammable materials at Cogeneration Facility 38 is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable. \n\n\n\nFlammables: Alternative Release\n\nThe use of flammable materials at Cogeneration Facility 38 is not encompassed by either the federal or state RMP requirements.  Therefore, this secti"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000040573,
      "SummaryText": "on is not applicable. \n\n"
    }
  ]
}