{
  "FacilityID": 1000077888,
  "FacilityName": "Twin Lake Chemical, Inc.",
  "FacilityStr1": "520 Mill Street",
  "FacilityStr2": "PO Box 411",
  "FacilityCity": "Lockport",
  "FacilityState": "NY",
  "FacilityZipCode": "14094",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36063",
  "LEPC": "Niagara County LEPC",
  "FacilityLatDecDegs": "43.184167",
  "FacilityLongDecDegs": "-078.699722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.twinlakechemical.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 74045139,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "James J. Hodan",
  "OperatorStr1": "520 Mill Street",
  "OperatorStr2": "PO Box 411",
  "OperatorCity": "Lockport",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14094",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": "NYD074045139",
  "EPAFacilityID": "100000081957",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-11-30 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.19037,
  "FRS_Long": -78.70443,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097049,
      "AltID": "Organic Acids Manufacture",
      "FacilityID": 1000077888,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000121461,
          "ProcessID": 1000097049,
          "ChemicalID": 10,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000098273,
          "ProcessID": 1000097049,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000082485,
              "Process_NAICS_ID": 1000098273,
              "SafetyReviewDate": "2018-08-23 00:00:00",
              "PHA_Date": "2018-08-23 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-05-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Emergency Scrubber with Blower",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Updated SOP for process.Completed December 2017. Installed automatic alarm and scrubber activation system in phosgene room. Maintained preventative maintenance/ inspection program for air monitors",
              "OpProceduresReviewDate": "2018-11-08 00:00:00",
              "TrainingReviewDate": "2018-08-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "PHA revalidation exercise. Regular training updates to employees.",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-11-25 00:00:00",
              "EquipmentInspectionDate": "2019-04-17 00:00:00",
              "EquipmentTested": "Phosgene monitoring detectors. All equipment is tested according to the PM schedule.",
              "ChangeMgmtDate": "2018-09-17 00:00:00",
              "ChangeMgmtReviewDate": "2018-06-13 00:00:00",
              "PreStartupReviewDate": "2013-08-23 00:00:00",
              "ComplianceAuditDate": "2017-11-30 00:00:00",
              "AuditCompletionDate": "2018-02-14 00:00:00",
              "IncidentInvestigationDate": "2018-08-07 00:00:00",
              "InvestigationChangeDate": "2018-08-07 00:00:00",
              "ParticipationPlansReviewDate": "2018-06-13 00:00:00",
              "HotWorkPermitReviewDate": "2018-06-13 00:00:00",
              "ContractorSafetyReviewDate": "2018-06-13 00:00:00",
              "ContractorSafetyEvalDate": "2018-06-13 00:00:00",
              "CBI_Flag": 0,
              "Description": "Organic Acids Manufacturing-Phosgene handling\n\n\n\nPhosgene is used in the manufacture of various acid chloride compounds at the Twin Lake Chemical plant. The prevention program includes procedures for the delivery and storage of phosgene in cylinders of 2000 pound capacity and the use of phosgene in the manufacture of the acid chloride chemicals. The manufacture of the various organic chlorides utilize the same technology, but vary in their use of raw materials that have no significant impact on the safety of the process. Thus the prevention program for each manufactured chemical is similar. The prevention program includes analysis of the procedures, safeguards and emergency response programs. \n\n\n\nThis prevention program focuses on the delivery and storage of phosgene and production of acid chloride chemicals. A PHA using the \"what if/ checklist\" format for the phosgene handling and delivery procedure was conducted in August 2013. Major hazards were identified and safeguards were reviewed. PHAs for the various acid chloride production scenarios was conducted in the fall of 2013. The 5 year PHA re-validation of the processes were conducted in August 2018. \n\n\n\nReview and updates to SOPs for the phosgene handling and delivery process were completed in August 2013. Review and updates to the various acid chloride production SOPs were conducted in the summer and fall 2013. An operator participated during all the SOP and PHA reviews and PHA revalidations. The SOPs of the processes are  reviewed annually and and updated as needed. \n\n\n\nThe improved safeguards installed include: substituting Monel for copper hosing, installation of an automated alarm and emergency scrubber system, use of phosgene detector badges to measure potential phosgene exposure to employees, improved preventative maintenance (Mechanical integrity) system. \n\n\n\nThe Hazards Communication Program was updated and employees were trained. All MSDSs were updated as part of the Haz-Com program. Process piping and tanks were labeled more clearly.  P&IDs of the processes were reviewed and updated. \n\n\n\nSafety training for operators included Hazard  communication, emergency response, Lock Out/ Tag Out, confined space and DOT training. \n\n\n\nThe emergency response plan was updated in June of 2013 and was last reviewed in March 2019. Members of the Lockport Fire department have visited the plant in to review the emergency plan and see the plant first hand. ",
              "_chemicals": [
                {
                  "PrimaryKey": 1000102446,
                  "PreventionProgram3ID": 1000082485,
                  "ProcessChemicalID": 1000121461
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000077888,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-03-05 00:00:00",
    "ERTrainingDate": "2018-10-26 00:00:00",
    "CoordinatingAgencyName": "Lockport FD, Niagara County LEPC",
    "CoordinatingAgencyPhone": "7164383476",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "40 CFR 302, 40 CFR 355"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077888,
      "SummaryText": "A. Accidental Release Prevention and Emergency Response Policies\n\n\n\nTwin Lake Chemical is committed to safety and the prevention of accidental releases of hazardous substances to the environment.  The use of Phosgene, Chlorine and Phosphorus trichloride in our organic chemicals manufacturing facility is operated and maintained in a safe and responsible manner.  Due to reduced inventories, only phosgene scenarios are included with the current RMP. We have implemented release prevention programs and emergency response policies in order to preserve and protect the health of employees.  These programs and policies also serve as protection of human health and the environment of the communities surrounding Twin Lake Chemical.  \n\n\n\nWe have reduced the use of phosgene by substituting, wherever possible, Thionyl chloride- a safer alternative. Also, we currently have suspended the manufacture of Phosphorus pentachloride and have removed chlorine from the plant. \n\n\n\nB. Stationary Source and Regulated Substances\n\n\n\nOur Lockport facility manufactures organic chemicals through the use of such regulated substances as phosgene (COCl2), thionyl chloride, ( chlorine (Cl2) and phosphorus trichloride (PCl3).  COCl2 is supplied to the process from 1-ton DOT-51 cylinders for use as a reagent to make a variety of similar organic acids.  Each acid manufacturing process is completely separate, therefore only one cylinder or 2,000 pounds of COCl2 is part of a covered process at any time. There are a maximum of 16 cylinders on site for a total of 32,000 lbs.  Phosgene is the only toxic chemicals regulated under the RMP Rule by Part 68 that Twin Lake Chemical has on-site as part of a process.  Twin Lake Chemical has no flammable substances regulated by Part 68.\n\n                                                                                                                                                           \n\nC. General Accidental Release Prevention Program and Chemical-Specific Prevent"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077888,
      "SummaryText": "ion Steps\n\n\n\nOur prevention program follows the standard set forth by the Occupational Safety and Health Administration's (OSHA) Process Safety Management under standard 29 CFR 1910.119, and takes a proactive approach to preventing accidental releases of regulated substances that pose a danger to human health and the environment.  Our program includes the following steps and programs that lead to successful accident prevention:\n\n\n\n -  Process safety information\n\n -  Process hazard analysis\n\n -  Operating procedures\n\n -  Training\n\n -  Mechanical Integrity\n\n -  Management of change\n\n -  Pre-startup safety review\n\n -  Compliance audits\n\n -  Incident investigation\n\n -  Employee participation\n\n -  Hot work permit\n\n -  Contractor safety work rules\n\n\n\nAs part of our general prevention program, we have integrated chemical-specific prevention steps that help minimize the possibility of any leak of a hazardous substance that poses a potential danger both onsite and/or offsite.  These steps greatly reduce risk:\n\n\n\nInspections - Regular inspections are performed on all process equipment to assure that the probability of failure is minimal.  Through constant maintenance and careful monitoring of all operations and equipment, Twin Lake Chemical can prevent potential harm to employees and the surrounding environment by discovering an accident before it happens.\n\n\n\nPersonnel - Twin Lake Chemical maintains high standards for its employees in their ability to monitor and operate the onsite processes.  Extensive training and experience in plant operations makes our employees our most important asset in maintaining safety onsite and preventing accidents.\n\n\n\nTechnology - Twin Lake Chemical uses advanced technology in its processes to automate and control precise process conditions.  Further, this technology also monitors deviations in these process conditions that include leaks or that could produce a leak.  Any deviations that could potentially result in a release are immediately corre"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077888,
      "SummaryText": "cted if possible or otherwise shutdown.  We also have a monitoring system that detects a release of either phosgene or chlorine in the process areas and sounds an alarm to alert employees.\n\n\n\nEmergency Response - It is a vital part of Risk Management to minimize the effect that any release of a regulated substance could have on human health and the environment.  We maintain an extensive response program for onsite accidents that pose a potential harm to employees and to offsite public receptors, including local residences.  Our program keys in on stopping the release, getting the right people to the scene quickly, and notifying offsite public receptors that could possibly be affected.  This plan is coordinated with the Lockport Fire Department, Public Dispatch (911), and the Niagara County LEPC.\n\n\n\nThese steps all coincide to manage the use of hazardous substances and prevent releases.  Our facility is committed to its programs that minimize the potential for any accidents and releases of a hazardous substance.  We strive to improve safety onsite at all times and operate at or above our own high standards for safety.\n\n\n\nD. Five-year Accident History\n\n\n\nTwin Lake Chemical (TLC) is required by the RMP Rule to report all accidental chemical releases of regulated substances that meet or exceed the reportable quantity and keep them on-file as part of this Risk Management Plan.  Further, we are required to keep on-file all accidental chemical releases that have occurred in the last 5 years.\n\n\n\nAs a result of Twin Lake Chemical's programs on safety and accidental release prevention, we have had no reportable releases in the past 5 years, as of April 2019, involving substances covered under Part 68.\n\n\n\nIf such a release should ever occur, following the implementation of emergency response program procedures, a formal investigation will be conducted to identify and correct the cause(s) of the incident.\n\n\n\nE. Emergency Response Program\n\n\n\nIn the event of an emergency situatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077888,
      "SummaryText": "n, Twin Lake Chemical maintains a written emergency response plan to respond in an orderly, efficient and safe manner.  Our emergency response plan provides key background, planning and training for the handling of and responding to releases of regulated substances.  The plan also defines procedures for proper notification of off-site public receptors in an emergency situation.  Procedures for notification of local authorities with which our plan is coordinated are also given in the plan.  The main objective involved in the implementation of this plan is the protection of workers, the public and the environment during emergency situations. A copy of this plan was given to the Lockport Fire Department. The entire Lockport FD visited the Twin Lake plant. Key members of the Lockport police and fire departments visit annually to observe firsthand the plant layout and potential staging in event of an emergency. Twin Lake participates in the activities of the Niagara County LEPC and attends the quarterly meetings.  Twin Lake also participates in emergency response drills with the neighboring Van de Mark Chemical company, who also uses phosgene in its processes. \n\n\n\nF. Planned Changes to Improve Safety\n\n\n\nTwin Lake Chemical conducts Process Hazard Analyses (PHA's) that develop a list of suggestions for the improvement of process safety.  These PHA's are performed every 5 years or when a process is changed, whichever comes first. Twin Lake conducted a revalidation of the PHAs in August 2018.  The list of suggestions produced from the PHA is used to help improve safety for the employees, the pubic and the environment by reducing the risk of potential releases of regulated substances and emergency situations."
    }
  ]
}