{
  "FacilityID": 1000014476,
  "FacilityName": "Aux Sable Liquid Products L.P.  Monee Terminal",
  "FacilityStr1": "6251 W. Steger Road",
  "FacilityStr2": null,
  "FacilityCity": "Monee",
  "FacilityState": "IL",
  "FacilityZipCode": "60449",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17197",
  "LEPC": "Will County LEPC",
  "FacilityLatDecDegs": "41.467648",
  "FacilityLongDecDegs": "-087.765648",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Aux Sable Liquid Products L.P.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Enterprise Products Operating, LLC",
  "OperatorStr1": "P.O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176007",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-11-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-08-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-08-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-08-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-08-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.46977,
  "FRS_Long": -87.764893,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018137,
      "AltID": "LPG Storage and Loading",
      "FacilityID": 1000014476,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021488,
          "ProcessID": 1000018137,
          "ChemicalID": 98,
          "Quantity": 540000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000021489,
          "ProcessID": 1000018137,
          "ChemicalID": 105,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000018460,
          "ProcessID": 1000018137,
          "NAICSCode": "48699",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000014921,
              "Process_NAICS_ID": 1000018460,
              "SafetyReviewDate": "2009-08-25 00:00:00",
              "PHA_Date": "2009-08-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-08-25 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Truck Loading Emergency Shutdown System",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Fire Detectors; Video Surveillance System",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-12-08 00:00:00",
              "TrainingReviewDate": "2009-07-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Safety meetings; Computer Based Training (CBT)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-07-13 00:00:00",
              "EquipmentInspectionDate": "2010-04-29 00:00:00",
              "EquipmentTested": "Relief valves, valves, gas detectors, pressure switches, flame detectors, temperature switches/controls/probes",
              "ChangeMgmtDate": "2009-09-25 00:00:00",
              "ChangeMgmtReviewDate": "2010-03-09 00:00:00",
              "PreStartupReviewDate": "2009-09-29 00:00:00",
              "ComplianceAuditDate": "2009-07-13 00:00:00",
              "AuditCompletionDate": "2010-12-30 00:00:00",
              "IncidentInvestigationDate": "1998-07-01 00:00:00",
              "InvestigationChangeDate": "1998-07-01 00:00:00",
              "ParticipationPlansReviewDate": "2010-03-09 00:00:00",
              "HotWorkPermitReviewDate": "2009-07-13 00:00:00",
              "ContractorSafetyReviewDate": "2010-04-22 00:00:00",
              "ContractorSafetyEvalDate": "2009-12-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000017892,
                  "PreventionProgram3ID": 1000014921,
                  "ProcessChemicalID": 1000021488
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014476,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-11-01 00:00:00",
    "ERTrainingDate": "2010-07-08 00:00:00",
    "CoordinatingAgencyName": "Monee Fire Department",
    "CoordinatingAgencyPhone": "7085348521",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014476,
      "SummaryText": "Monee Terminal. These audits have been carried out at least every three (3) years.  Corrective actions recommended as a result of the audits are completed in a prompt and timely manner.\n\nIncident Investigation\nEnterprise Products Operating LLC investigates any incident that results in, or could reasonably result in, a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. Operating or equipment changes recommended by the investigation team are implemented as soon as possible.  Results of incident investigations are communicated to the location employees, and all incident invesigation reports are retained for a minimum of five (5) years.\n\nEmployee Participation\nEnterprise Proudcts Operaing LLC believes that process safety management and accident prevention is a team effort. Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule.  \n\nContractors\nOn occasion, Enterprise hires contractors to conduct specialized maintenance or construction activities. Prior to selecting a contractor, an evaluation of the safety performance of the contractor is carried out through an independent contractor registration firm. Only contractors with safety programs and records that meet Enterprise standards are approved to work at the Aux Sable Monee Terminal.  Prior to beginning any onsite work, Enterprise informs contractors of known potential hazards related the contractor's work and the process. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur while contractor personnel are on site.\n\n5.\tFive-year Accident History\nEnterprise has had an excellent record of preventing"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014476,
      "SummaryText": "accidental releases over the last 5 years. Due to our release prevention policies, there have been no accidental releases of substances regulated under 40 CFR Part 68 during this period which have resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n6.\tEmergency Response Plan\nEnterprise maintains a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notifications or local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the emergency response plan is updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.\tPlanned Changes to Improve Safety\nEnterpise regularly reviews the operation of the Aux Sable Monee Terminal to determine if additional equipment or operating changes would improve the safety of the operations at the facility.  Recommendations for safety improvements can come from the scheduled process hazard reviews, incident investigations, internal program audits or employee suggestions fo improve safety.  The following efforts are currelty in progress in an effort to improve safety at the facility:\n\n*  The safety management/accident prevention program in use at the Monee Terminal is currently undergoing a complete review and revision of each element of the program to reflect safety management practices in use by Enterprise.\n* The possible installation of additional infrared hazardous gas detectors to provide advance warning of a release of flammable gas to the terminal operators is being evaluated.\n* Enterprise is currently planning to upgrade t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000014476,
      "SummaryText": "he facility video surveillance system, including the installation of additional cameras to improve operaor detection of any unusual events in the terminal area."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014476,
      "SummaryText": "AUX SABLE LIQUID PRODUCTS L.P.\nMONEE TERMINAL\n\nExecutive Summary\n\n1.\tAccidental Release Prevention and Emergency Response Policies\nEnterprise Products Operating LLC, opeator of the Aux Sable Monee Termninal, is strongly committed to employee, public and environmental safety. This commitment is demonstrated by the design, installation, operating procedures, maintenance and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If such a release does occur, our response activities are coordinated with local emergency response agencies.\n\n2.\tThe Stationary Source and the Regulated Substances Handled\nThe facility's primary activity is the storage and handling of liquefied petroleum gas (LPG). There are two (2) regulated substances present at our facility. These substances are propane and ethyl mercaptan (ethanethiol). Propane is received by pipeline, stored on-site in two storage tanks, and loaded into trucks for distribution in the Chicago area. Ethyl mercaptan is used to odorize the propane for safety purposes.\n\nBoth compounds are classified as flammable under 40 CFR Part 68. No compounds classified as toxic are stored or used at the facility in amounts above their threshold quantities.  Details on the quatity of each material stored at the Aux Sable Monee Terminal are included in the registration data elements.\n\n\n3.\tRelease Scenario(s)\n\n The following paragraphs provided details of the chosen scenarios.\n\nWORST CASE SCENARIO\n\nThe worst case release scenario submitted for Program 3 flammable substances as a class involves a catastrophic release from tank storage. The scenario involves the release of the maximum quantity of propane contained in one of the two storage tanks at the facility. It is assumed that the entire quantity is vaporized upon release and is involved in a vapor cloud explosion.  Details on the results of the worst case scenario analysis ar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014476,
      "SummaryText": "e included in the registration data elements.  \n\nALTERNATE CASE SCENARIO\n\nThe alternative release scenario submitted for Program 3 flammable substances involves a release from storage and transfer. The scenario involves the release of propane from the assumed rupture of a 3-inch truck loading hose for a maximum of three minutes, followed by a vapor cloud explosion.  Details on the results of the alternate case scenario are included in the registration data elements.  \n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps.\n \nEnterprise Products Operating LLC has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68. The following sections briefly describe the elements of the accident prevention program that is in place at out stationary source.\n\nProcess Safety Information\nEnterprise maintains a record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all applicable processes.\n\nProcess Hazard Analysis\nOur facility conducts studies to ensure that hazards associated with the process are identified and controlled efficiently. The HAZOP methodology with checklist PHA Revalidations are used to carry out these analyses. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of not more than five (5) years. Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Enterprise maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a turnaround. The information is regularly reviewed and is readily accessible t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014476,
      "SummaryText": "o operators involved in the processes.\n\nTraining\nEnterprise has a training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every three (3) years, and more frequently as needed.\n\nMechanical Integrity\nEnterprise carries out maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks include, among others: pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, pumps, valves, hazardous gas detectors, flame detectors, and temperature and pressure switches. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at Enterprise Products Operating LLC to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process equipment or conditions are made aware of and offered training in the proper operation and maintenance of the modification.\n\nPre-Startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as an integral part of the change management process. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures and training are properly completed prior to placing equipment or operating changes into service.\n\nCompliance Audits\nEnterprise has conducted and will continue to conduct audits to confirm that the provisions set out under the RMP rule are being properly and adequately implemented at the Aux Sable"
    }
  ]
}