{
  "FacilityID": 1000042599,
  "FacilityName": "Cargill Meat Solutions Corporation",
  "FacilityStr1": "3555 W. Arrow St.",
  "FacilityStr2": null,
  "FacilityCity": "Marshall",
  "FacilityState": "MO",
  "FacilityZipCode": "65340",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29195",
  "LEPC": "Saline County LEPC",
  "FacilityLatDecDegs": "39.118300",
  "FacilityLongDecDegs": "-093.247500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cargill.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 838347417,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 6249189,
  "Company2DUNS": 0,
  "OperatorName": "Cargill",
  "OperatorStr1": "3555 W. Arrow St.",
  "OperatorStr2": null,
  "OperatorCity": "Marshall",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "65340",
  "OperatorZipCodeExt": "0160",
  "RMPContact": "Brian Taylor",
  "RMPTitle": "Plant Manager",
  "FTE": 520,
  "OtherEPAFacilityID": "65349TYSNFHWY20",
  "EPAFacilityID": "100000100507",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-11-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-12-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.11833,
  "FRS_Long": -93.2475,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "23",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052517,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000042599,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053211,
          "ProcessID": 1000052517,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000063653,
          "ProcessID": 1000052517,
          "ChemicalID": 56,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000563653,
          "ProcessID": 1000052517,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042599,
      "SummaryText": "The Cargill Meat Solutions facility in Marshall, MO is subject to the Environmental Protection Agency's (EPA) \"Chemical Accident Prevention Provisions\" found in Title 40 part 68 of the Code of Federal Regulations (CFR).  This standard is often referred to as the risk management program rule.  The facility is covered by the rule because it processes anhydrous ammonia and methane in excess of the regulatory thresholds.  Anhydrous ammonia is used in the facility's refrigeration system, and is a listed chemical due to toxicity. \n\n\n\nAccording to the risk management program rule, covered facilities must develop and submit a Risk Management Plan (RMP) to the EPA by June 21, 1999 with updates every five years.  The covered facilities must also revise and update the RMP when certain events occur, such as the addition of a new process containing a regulated substance above its threshold quantity.  The initial RMP and any subsequent updates must include registration information, a summary of the risk management program, and a certification statement.  The RMP will be made available to the public.  The purpose of this project was to compile the information and materials necessary to submit an updated RMP, reflecting the addition of a new process containing methane.\n\n\n\nAn offsite consequence analysis was conducted on a worst-case release scenario and an alternative release scenario involving anhydrous ammonia.  The analysis of the worst-case release scenario assumed that 45,000 pounds of ammonia was released to the atmosphere over a 10-minute period.  The resulting plume was modeled according to the method presented in the EPA's RMP Comp.  The distance at which the ammonia concentration in the plume falls below the regulatory endpoint concentration was determined to be 4.0 miles.  It was further determined that within 4.0 miles of the facility there is a population of 14,000 people.  The public receptors identified within 4.0 miles of the facility are residential and commercial/"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042599,
      "SummaryText": "industrial areas as well as schools, hospitals and a correctional facility.  The North Fork Finney Creek was the only environmental receptor identified within 4.0 miles of the facility.\n\n\n\nThe alternative release scenario examined a release of ammonia resulting from a failure during normal operation.  This scenario examines the release of ammonia from a liquid header valve failure.  In this scenario, 14,400 pounds of ammonia are released over a 10-minute period.  The distance to the regulatory endpoint was calculated to be 0.7 miles.  The population within 0.7 miles of the facility was determined to be 19.  Commercial/industrial areas (Marshall Ready Mix) and residences were the public or environmental receptors identified within 0.7 miles of the facility.  \n\n\n\nThe offsite consequence analyses data and information concerning the facility and the facility's implementation of the risk management program are included in the risk management plan documented in this report.\n\n\n\nThe 5 year accident history for the facility does not include any reportable incidents.\n\n\n\nThe facility coordinates with local emergency responders along with the Marshall Fire Department for any response to emergency releases.  The facility is a part of the community emergency response plan.\n\n\n\nThe Cargill Meat Solutions facility is continuously working to improve process safety at the facility.\n\n\n\nFacility practices to improve safety include:\n\n\n\nThere are regular PSM meetings that are held with the upper management group at the facility.\n\n\n\nAnnual PSM training is completed with all Cargill employees at the facility.\n\n\n\nNew hire employees receive PSM orientation training during their initial training period.\n\n\n\nThe facility also conducts regular plant evacuation drills.\n\n"
    }
  ]
}