{
  "FacilityID": 1000104428,
  "FacilityName": "Dandy Cooling Company, LLC - Pacific Avenue",
  "FacilityStr1": "870 Pacific Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.192544",
  "FacilityLongDecDegs": "-119.164053",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Dandy Cooling Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": 112526152,
  "Company2DUNS": null,
  "OperatorName": "Dandy Cooling Company, LLC",
  "OperatorStr1": "1252 Growers Street",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000201854",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-06-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "New Site submission 08",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-03-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-03-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-03-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-03-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.192544,
  "FRS_Long": -119.164053,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000130131,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000104428,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000163176,
          "ProcessID": 1000130131,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131566,
          "ProcessID": 1000130131,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000112145,
              "Process_NAICS_ID": 1000131566,
              "SafetyReviewDate": "2023-01-19 00:00:00",
              "PHA_Date": "2023-01-19 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error; Forklifts",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Process Logic Controller (PLC); Float Switches",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia-Water Diffusion System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of additional Water Chiller",
              "OpProceduresReviewDate": "2023-01-19 00:00:00",
              "TrainingReviewDate": "2023-02-21 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Online",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Supervision",
              "MaintenanceReviewDate": "2021-08-31 00:00:00",
              "EquipmentInspectionDate": "2022-07-30 00:00:00",
              "EquipmentTested": "Hydro-Vac T-V079",
              "ChangeMgmtDate": "2021-08-31 00:00:00",
              "ChangeMgmtReviewDate": "2020-03-27 00:00:00",
              "PreStartupReviewDate": "2021-09-02 00:00:00",
              "ComplianceAuditDate": "2020-03-27 00:00:00",
              "AuditCompletionDate": "2021-01-12 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-03-27 00:00:00",
              "HotWorkPermitReviewDate": "2020-03-27 00:00:00",
              "ContractorSafetyReviewDate": "2022-07-07 00:00:00",
              "ContractorSafetyEvalDate": "2020-03-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000140867,
                  "PreventionProgram3ID": 1000112145,
                  "ProcessChemicalID": 1000163176
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104428,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-02-23 00:00:00",
    "ERTrainingDate": "2023-02-14 00:00:00",
    "CoordinatingAgencyName": "Oxnard Fire/CUPA",
    "CoordinatingAgencyPhone": "8053857722",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Cal/ARP Reg at Title 19. 2735.1; Cal/OSHA General Industry Safety Orders"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000104428,
      "SummaryText": "ria for the safe operation of ammonia refrigeration process);\n-Dandy and WPS Internal Inspection Protocols\n\nThe programs above may result in recommendations ranging from capital improvements to routine maintenance of the plant. Where appropriate service calls are established in parallel to identified needs. Current planned changes to improve safety include recommendations as a result of the Process Hazard Analysis update performed January 19th, 2023. The recommendations have been reviewed by Dandy management and a written implementation schedule has been prepared. Completion is scheduled by December 31, 2023."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000104428,
      "SummaryText": "own and pump-down of the affected area according to the location, nature and severity of the problem. The refrigeration process is equipped with a Fire Department Emergency Control Box and a KNOX BOX has been installed (The KNOX is under jurisdiction of the Oxnard Fire/CUPA). Automatic systems and devices are regularly inspected, tested and maintained.\nEmployees are trained in manual discovery, emergency shutdown, evacuation and notification procedures in the highly unlikely event of a failure of the engineered safety and emergency systems.\n\nThe Plant does not require its employees to participate in conducting emergency response activities under the HAZWOPER standard; a “Non-responding Facility Policy” has been adopted for the Plant as a whole. In the event of an ammonia emergency, the response is to follow the procedures in the Equipment SOP’s and the California Hazardous Material Business Plan (HMBP). The overall procedure is to shutdown critical systems if it can be done safely by qualified personnel, evacuate, and notify the local response agencies and WPS; WPS employs technicians that are 1910.120(q) Hazardous Material Technician certified. Plant employees are to implement hazard communications, provide for the safety of visitors and report to the established Evacuation Staging Area(s) for a head count. Emergency response is coordinated with the City of Oxnard Fire/CUPA. Oxnard Fire/CUPA has confirmed that the facility is included in the Oxnard Community Emergency Plan required by the Emergency Planning and Community-Right-to-Know Act (EPCRA).  The CUPA is also welcomed to perform on-site emergency coordination activities annually.\n\n1.6\tPlanned changes to improve safety\n\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\n-Process Hazard Analysis revalidation/update;\n-Compliance Audits;\n-Routine inspections, tests & maintenance (Mechanical Integrity Program);\n-IIAR Bulletin 109 Inspections (IIAR minimum safety crite"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000104428,
      "SummaryText": "cific Prevention Steps\nIt had become apparent in the industry that a mishap while draining oil from a system was one of the most common ammonia release incidents to occur. Special self-closing valves are installed as a solution to this issue. If a release were to develop during the oil-draining task, the mechanic simply releases the handle of the self-closing valve and flow is terminated. These types of valves are installed at each of the oil drain points in the system.\n\nOther release prevention steps:\n\n-Pressure relief valves are piped to a common header that terminates at an Ammonia-Water Diffusion Tank that was upgraded in late 2013.\n-A computer monitoring system with battery back-up (UPS) monitors process parameters 24/7/365. This system is continuously monitored via a third-party security company.\n-The facility is equipped with a Closed-Circuit TV (CCTV) System.\n-Fencing and gates to limit access by potential “wrong-do-ers”.\n-A sign-in/sign-out program and security badge system is enforced.\n-Employees are trained for hazard communication (discovery and communicating) for un-authorized personnel, suspicious activity, fires, releases or other hazardous/suspicious condition.\n- Dandy continues to work closely with the CUPA.\n-Staff is trained in the fire and accident prevention benefits of good housekeeping. The general appearance of the facility is maintained on a day-to-day basis.\n\n1.4\tFive-Year Accident History \nThere have been no qualified accidents or releases; there is no data to report.\n\n1.5\tEmergency Response Program\n\nThis plant is specifically designed and engineered to provide for life safety and effective emergency response. Building space is fire-alarm and fire-sprinkler equipped. The refrigeration process’ Control, Monitoring and Alarm System includes a backup power supply (UPS) and manual backup systems (kill switches). Authorized personnel can access critical process system controls remotely. The system initiates notifications, alarms, equipment shutd"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000104428,
      "SummaryText": "established in accordance with CCR 8, 5189. The PSM Program is specifically intended to promote the safe operation of ammonia-handling equipment and process, and to prevent accidental releases via its elements of Process Safety Information, Process Hazard Analysis, Written Operating Procedures, Training, Mechanical Integrity, Management of Change, Pre-startup Safety Reviews, Hot Work Permits, Compliance Audits, Incident Investigation, and Contractor’s Safety. Other safety programs are integrated with the PSM Program, to the extent practicable, appropriate and/or required (such as the California Injury and Illness Prevention Program/IIPP). Dandy orchestrates its PSM Program with participation from WPS, Duda, Contractors, and Oxnard Fire/CUPA.\n\nDandy personnel perform daily observations of refrigerating equipment; WPS performs technical inspections, troubleshooting and mechanical maintenance of the equipment. Schedules and written procedures for the operation and maintenance of ammonia-handling equipment, including the steps to be taken in the event of a release or threatened release, have been developed. Written procedures include necessary safety precautions for Plant operation, inspection, maintenance, and moving of portable equipment (Hydro-Vac™ Vacuum Tubes). As inspection and maintenance needs are determined, the need is expressed at the workload meetings conducted by the WPS Area Manager. The specific task for the expressed need is decided by the WPS Area Manager and entered into the service call system. Tasks are then tracked to completion through the service call system. Through this regular routine of inspect, discuss, assign and confirmation of completion, Dandy and WPS reduce equipment operational problems and potential for releases. WPS actively encourages its ammonia technicians to seek Certification through the Refrigerating Engineers and Technicians Association (RETA). Technicians only perform tasks for which they have been pre-qualified.\nChemical-Spe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104428,
      "SummaryText": "ping of fresh product. Duda is responsible for processing and packaging of freshly harvested and pre-cooled celery. Dandy receives the fresh product and pre-cools it via vacuum cooling (Hydro-Vac™ Vacuum Tubes). The pre-cooled celery is then delivered to the Duda side of the Plant for processing and packaging. When the product is packaged and ready for shipping it is moved to the Dandy refrigerated storage side of the facility until shipped. The facility is open year-around with a busy season from mid-October through early July. The remaining months see reduced production, but the refrigerating equipment remains operative. Annual refrigerating equipment maintenance is performed during low-season summer months.\n\nThe Regulated Substance in use is anhydrous ammonia (NH3) CAS #7664-41-7, which is used in a closed-loop mechanical vapor compression refrigeration system. Refrigeration equipment consists of Compressors, Pressure Vessels, Evaporative Condenser, Evaporators (Room Units), Water Chillers,HydroVac™ Vacuum Tubes, ammonia pumps and associated valves, instrumentation and piping. Pressure and temperature controls are installed in accordance with appropriate codes & standards, including isolation and overpressure relief valves. Pressure relief valves are piped to a common header that terminates at an ammonia- water diffusion tank. Pre-qualified personnel check the refrigerating system daily and operating parameters are continuously monitored via computer.\n\nThe vacuum tubes are used to pre-cool agricultural product utilizing a combination of deep vacuum and ammonia refrigeration in a batch process. Vacuum pre-cooling equipment is portable and may move seasonally depending on market conditions & demand, a common industry practice. Pre-qualified WPS Technicians move the equipment when necessary. \n1.3\tGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\nAccidental Release Prevention Program\n\nA Process Safety Management Plan (PSM) has been"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104428,
      "SummaryText": "cess Hazard Analysis (PHA). It is our policy to maintain compliance and a good working relationship with the Oxnard Fire/CUPA.\n \nThe facility is supported by Western Precooling Systems (WPS), for maintenance and emergencies. WPS has offices and staff about ¼ mile from the facility and employs ammonia technicians that are 1910.120(q) Hazardous Material Technician certified. WPS also supports RETA training and certifications for its technicians. WPS technicians are “on call” to the facility 24/7/365, and regularly check the plant for proper operating conditions.\n\nIt is through these measures and pre-planning that Dandy endeavors to maintain effective Accidental Release Prevention and Emergency Response measures.\n\n1.2\tGeneral Description of the Stationary Source and Regulated Substances\n\nDandy Cooling Company - Oxnard is located in Oxnard, CA; in a commercial/industrial area of the city. The facility was constructed in 2007 and began operating in early 2008. Building space occupies approximately 67,000 square feet on a 5.5 acre lot. The refrigeration process is a state-of-the-art system engineered and installed according to the codes and standards locally adopted by the City of Oxnard circa 2007. Cutting-edge safety controls are engineered directly into the plant. Refrigeration process engineering was provided by Snowden Engineering of Salinas, CA; the refrigeration system installing contractor was Kemper Refrigeration. Ongoing maintenance is managed via Dandy’s relationship with WPS. The only change in the refrigeration system in the last 5 years was the addition of a water chiller of the same type already in use.\n\nTwo separate companies employing entirely separate workforces operate at the Plant: Dandy Cooling Company (Dandy) and Duda Farm Fresh Foods (Duda). Dandy owns the plant and refrigeration equipment except for water chillers used by Duda for processing fresh produce. Dandy is responsible for pre-cooling and short-term refrigerated storage operations, and ship"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104428,
      "SummaryText": "d may the focus shift to resumption of business operations.\n\nThe Company also recognizes the need to be prepared for accidental releases that could occur should established prevention programs fail. The ammonia process is equipped with a state-of-the-art monitoring, control and alarm system. The system was permitted by the Oxnard Fire/CUPA agency according to locally adopted code requirements including CFC Article 63-2001 circa 2007. The alarm system is supervised by a third party alarm company. If and when an ammonia leak is detected, notifications and alarms are provided to management, employees and refrigeration technicians according to alarm intensity. Automatic shutdown and ventilation systems are activated according to pre-set parameters. In the event of a major release involving the Refrigeration Room, the supervising alarm company provides direct and immediate notification to Oxnard Fire/CUPA in addition to the other alarms and management notifications. A secondary alarm system provides low-level alarm text messaging to refrigeration technicians when sensors detect ammonia at 20PPM, enabling early problem detection. Our policy is to regularly test and maintain the monitoring, control and alarm systems per our Mechanical Integrity Program, which is intended to ensure proper actuation and function of the refrigeration-related systems and components on a continuous basis.\n\nThe Company has adopted a “Non-responding Facility Emergency Response Policy”. The Plant’s California Hazardous Material Business Plan was developed to be consistent with Emergency Action Plan requirements (i.e. notify and evacuate). Emergency response pre-planning is coordinated through the local Certified Unified Program Agency (Oxnard Fire/CUPA); the CUPA inspects the plant and receives copies of the Business Plan updated at regular intervals. The CUPA has been involved in the development of the plant from the initial permitting stage, and a CUPA Representative has participated in past Pro"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104428,
      "SummaryText": "RISK MANAGEMENT PLAN LEVEL III / 2023 5-Year Re-submittal \nDANDY COOLING COMPANY, LLC\n\n1\tDANDY OXNARD RMP EXECUTIVE SUMMARY\n1.1\tAccidental Release Prevention And Emergency Response Policies\n1.2\tGeneral Description Of The Stationary Source And Regulated Substances\n1.3\tSummary Of The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n1.4\tSummary Of The Five-Year Accident History\n1.5\tSummary Of The Emergency Response Program\n1.6\tPlanned Changes To Improve Safety\n\n1\tDANDY OXNARD PACIFIC ROAD RMP EXECUTIVE SUMMARY MARCH 2023\n1.1\tAccidental Release Prevention And Emergency Response Policies\n1.2\tGeneral Description Of The Stationary Source And Regulated Substances\n1.3\tSummary Of The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n1.4\tSummary Of The Five-Year Accident History\n1.5\tSummary Of The Emergency Response Program\n1.6\tPlanned Changes To Improve Safety\n\n1.1\tAccidental Release Prevention and Emergency Response Policies\n\nThe Dandy Cooling Company, LLC (Dandy) Accidental Release Prevention and Emergency Response Policies are simply not to have accidental releases or emergencies. The Company endeavors to execute this policy through the daily implementation of its Safety Programs. Company safety programs include but are not limited to a comprehensive Process Safety Management Program (PSM). The PSM Program is an integrated, holistic approach to the safe operation of processes using Regulated Substances and forms the Program Level 3 Prevention Program component of the RMP. The Dandy Plant and PSM Program are specifically designed and intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen. It is the primary goal of Dandy to protect its employees, visitors and neighbors from harm due to Company operations. With this in mind, the priorities of protection of life, the environment, and then property have been established. Only when these goals have been achieve"
    }
  ]
}