{
  "FacilityID": 1000092549,
  "FacilityName": "Loveland Products Inc.",
  "FacilityStr1": "56908 Hwy 8",
  "FacilityStr2": null,
  "FacilityCity": "Fairbury",
  "FacilityState": "NE",
  "FacilityZipCode": "68352",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31095",
  "LEPC": "Jefferson County - John McKee",
  "FacilityLatDecDegs": "40.120833",
  "FacilityLongDecDegs": "-097.160278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I5",
  "LatLongDescription": "CE",
  "FacilityURL": "https://www.nutrienagsolutions.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Nutrien Ag Solutions",
  "Company2Name": null,
  "CompanyDUNS": 102412244,
  "Company2DUNS": 0,
  "OperatorName": "Loveland Products Inc.",
  "OperatorStr1": "3005 Rocky Mountain Ave",
  "OperatorStr2": null,
  "OperatorCity": "Loveland",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80538",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scot Lord",
  "RMPTitle": "Plant Manager",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184463",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-01-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-03-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.12041,
  "FRS_Long": -97.16164,
  "FRS_Description": "OTHER",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114898,
      "AltID": "Ammonia Process",
      "FacilityID": 1000092549,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000116291,
          "ProcessID": 1000114898,
          "NAICSCode": "32531",
          "_desc": {
            "NAICS_CODE": "32531",
            "NAICS_DESCRIPTION": "Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143581,
          "ProcessID": 1000114898,
          "ChemicalID": 56,
          "Quantity": 167000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000643581,
          "ProcessID": 1000114898,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000114899,
      "AltID": "10-34-0 Process",
      "FacilityID": 1000092549,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000116292,
          "ProcessID": 1000114899,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143582,
          "ProcessID": 1000114899,
          "ChemicalID": 56,
          "Quantity": 84200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000643582,
          "ProcessID": 1000114899,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092549,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies [40 CFR 68.155(a)]\n\nLoveland Products Inc. (LPI) Fairbury's commitment to providing a safe, healthy work environment for employees as well as providing a safe, healthy environment for the surrounding community is strongly supported by senior management and is demonstrated by the resources invested in accident prevention, employee training and in the safe design, installation, operation, and maintenance of the facility.\n\n\n\nThe properties of anhydrous ammonia make it necessary to observe detailed safety precautions to prevent unnecessary human exposure, reduce the risk to facility personnel, and reduce potential impacts to adjoining community members. The facility implements both administrative and engineering controls to reasonably minimize the risk of an uncontrolled release of anhydrous ammonia and strives for excellence in the facility operations and compliance with local, state, and federal laws and regulations. The LPI Fairbury facility has not had nor does it anticipate having any type of uncontrolled release.\n\n\n\nDescription of Stationary Source and Regulated Substances [40 CFR 68.155(b)]\n\nLPI operates a crop micronutrient manufacturing facility which utilizes anhydrous ammonia as a raw material. The Ammonia Process and the 10-34-0 Process are the two stationary sources which utilize anhydrous ammonia and are covered by the Risk Management Plan at the Fairbury location.\n\n\n\nThe Ammonia Process (Process 1) produces a fertilizer solution by reacting water, anhydrous ammonia, acetic acid, and a variety of metal salts (minerals) in two low pressure reactors. Liquid anhydrous ammonia is received by tanker truck and stored in a 30,000 gallon (151,000 pound) pressure vessel under ambient temperature. The pressure vessel has a maximum fill level of 85% resulting in a maximum storage capacity of 25,500 gallons or 128,520 pounds. The pressure vessel is equipped with a flash valve which prohibits a ruptured line"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092549,
      "SummaryText": " or misaligned valve from emptying the full contents of the vessel. Facility access is controlled by a padlocked 8' cyclone fence.\n\n\n\nThe 10-34-0 Process (Process 2) produces 10-34-0 fertilizer solution by reacting anhydrous ammonia with super phosphoric acid. The process is self-contained on a trailer-mounted Mobile Pipe Reactor (MPR), owned and operated by a third-party fertilizer manufacturing service. The anhydrous ammonia for this process is supplied via 42,100 pound tank trucks, which directly feed the 10-34-0 process. The phosphoric acid is supplied via railcar directly to the MPR unit. The tanker trucks and railcars are staged at the southwestern rail spur on the Fairbury LPI location. The resulting 10-34-0 fertilizer solution is then subsequently stored on location for distribution to LPI customers. The MPR is equipped with a safety relief valve to protect against overpressure.\n\n\n\nThere are no listed flammable substances which exceed their respective threshold quantities stored at this facility.\n\n\n\nGeneral Accident Release Prevention Program and Chemical-Specific Prevention Steps [40 CFR 68.155(c)]\n\nThe LPI Fairbury facility is subject to the EPA Chemical Accident Prevention Provisions (40 CFR 68) as a Program 3 Risk Management Plan (RMP) because the worst-case release scenario poses an offsite public impact risk. The LPI Fairbury facility is also regulated under the OSHA Process Safety Management of Highly Hazardous Chemicals (29 CFR 1910.119) (PSM) Program for the prevention of hazardous chemical releases in the workplace. The facility complies with the Program 3 requirements of EPA's RMP rule through the implementation of the OSHA PSM Program. The PSM prevention program consists of the following elements:\n\n\n\n? Employee Participation: LPI is committed to involving employees and their representatives on the conduct and development of PHAs and on the development of the other elements of plant safety, process safety, and risk management planning. Employees a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092549,
      "SummaryText": "re encouraged to read, review, and provide comments on RMP/PSM documents.\n\n? Process Safety Information (PSI): Written information has been collected which enables facility employees to identify and understand the potential hazards in the processes. The written information includes descriptions of the anhydrous ammonia containing processes, information pertaining to hazards of the processes, the technology of the processes and the equipment employed in the processes.\n\n? Process Hazard Analysis (PHA): Formal studies using the Hazard and Operability (HAZOP) methodology have been conducted to look at the processes and identify, evaluate, and control hazards associated with plant operations. The HAZOP studies will be updated at least every five (5) years to ensure they are consistent with the current processes.\n\n? Operating Procedures: Written, detailed procedures have been developed which describe the steps which should be followed to safely operate the processes. The procedures are reviewed regularly and are updated and revised as required.\n\n? Employee Training: A training program has been developed which ensures employees are trained on aspects of the processes and on the safe, efficient, and effective performance of their duties.\n\n? Contractor Management: Contractors are screened and evaluated on their demonstrated safe work histories before they perform work on or near the anhydrous ammonia processes. LPI provides contract employees with the appropriate safety and health information, ensures they follow facility safe work practices, and periodically evaluates their safety performance.\n\n\n\nThe 10-34-0 Process is owned and operated by a third-party fertilizer manufacturing service. The third-party is contracted to operate the 10-34-0 process under the auspices of LPI's contractor management program. The third-party manufacturer maintains their own PSM program under the OSHA PSM regulation. The third-party PSM programs have been audited by LPI to ensure they contain th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092549,
      "SummaryText": "e necessary requirements per 40 CFR Part 68 for a Program 3 Risk Management Plan.\n\n? Pre-Startup Safety Review: A pre-startup safety review is completed by a knowledgeable team of LPI personnel for anhydrous ammonia projects which are significant enough to require a change in process safety information. The review verifies safety programs are in place, training has been performed, and construction has been completed according to design standards before the project is placed into operation.\n\n? Mechanical Integrity: The facility has developed and implemented procedures to ensure the anhydrous ammonia processes are built and maintained using preventive maintenance procedures to minimize unexpected breakdowns or failures. Maintenance procedures have been developed per equipment vendor recommendations, federal or state regulations, or industry codes and standards.\n\n? Hot Work Permit: The facility has developed and implemented procedures to ensure a signed permit is obtained prior to any work which could generate a flame, intense heat, or sparks because of electric or gas welding, cutting, brazing, grinding or similar activities.\n\n? Management of Change: The facility has developed and implemented a Management of Change (MOC) program to ensure changes made to the anhydrous ammonia processes are properly reviewed, will not result in undetected unsafe situations, and affected employees are made aware of the changes and their implications. The MOC program ensures PSI, maintenance procedures, and operating procedures are updated as necessary to reflect the changes made.\n\n? Incident Investigation: The facility has developed and implemented procedures to ensure incidents (and near misses) involving the anhydrous ammonia processes are investigated, reviewed, and documented using an investigation team.\n\n? Compliance Audits: The facility conducts audits of the prevention program every 3 years (or sooner if needed) to ensure the program is in place and working properly. The audit te"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000092549,
      "SummaryText": "am includes persons knowledgeable in audit techniques and who have the appropriate process knowledge and technical expertise.\n\n\n\n5 Year Accident History [40 CFR 68.155(d)]\n\nNeither the Ammonia Process nor the 10-34-0 Process have had releases of listed Hazardous Substances resulting in death, injuries, property damages, or environmental damage, either on or off site nor have resulted in off site evacuations or shelter in place orders since the startup of either process at the LPI Fairbury location.\n\n\n\nEmergency Response Program [40 CFR 68.155(e)]\n\nLPI Fairbury maintains a detailed Emergency Action Response Plan designed to contact the local emergency response organizations in the event of a hazardous chemical release. This Plan is periodically reviewed with outside emergency response organizations. In the unlikely event of an uncontrolled release, local authorities will be notified by LPI and the local authorities will decide on whether local areas will be evacuated or sheltered in place; the local authorities will notify any affected neighbors or surrounding properties of any necessary action.\n\n\n\nPlanned Changes to Improve Safety [40 CFR 68.155(f)]\n\nLPI is committed to continuous efforts to improve the safe operation of the anhydrous ammonia processes by implementing preventative maintenance programs, inspection programs, and employee training in the safe operation of the equipment and the process. The anhydrous ammonia process is designed in accordance with good engineering practices. Periodic auditing of the PSM/RMP Programs ensures process changes or modifications are evaluated and necessary safety precautions and/or safety improvements are made before the process is placed into operation.\n\n"
    }
  ]
}