{
  "FacilityID": 1000029816,
  "FacilityName": "Llano Logistics",
  "FacilityStr1": "5801 Martin Luther King Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Lubbock",
  "FacilityState": "TX",
  "FacilityZipCode": "79404",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48303",
  "LEPC": "Lubbock County LEPC",
  "FacilityLatDecDegs": "33.541111",
  "FacilityLongDecDegs": "-101.813056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A3",
  "LatLongDescription": "PC",
  "FacilityURL": "www.UnitedSupermarkets.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "United Supermarkets",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "United Supermarkets",
  "OperatorStr1": "5801 Martin Luther King Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Lubbock",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79404",
  "OperatorZipCodeExt": null,
  "FTE": 240,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173082",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-07-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-08-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-08-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-08-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 33.54157,
  "FRS_Long": -101.81839,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036364,
      "AltID": "Ammonia Refrigeration sys",
      "FacilityID": 1000029816,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043988,
          "ProcessID": 1000036364,
          "ChemicalID": 56,
          "Quantity": 36700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000036746,
          "ProcessID": 1000036364,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000031856,
              "Process_NAICS_ID": 1000036746,
              "SafetyReviewDate": "2012-06-01 00:00:00",
              "PHA_Date": "2012-07-09 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Mechanical Integrity audit",
              "PHACompletionDate": "2012-10-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "emergency ventilation",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-07-02 00:00:00",
              "TrainingReviewDate": "2012-07-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "40 hour - RETA,  Operator Level 1 (Garden City Ammonia Program), PSM/RMP training (Garden City Ammonia Program)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-07-01 00:00:00",
              "EquipmentInspectionDate": "2012-07-01 00:00:00",
              "EquipmentTested": "Mechanical Integrity Audit, total refrigeration inspection, all components.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2012-06-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2010-05-18 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-06-10 00:00:00",
              "HotWorkPermitReviewDate": "2012-06-10 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000037900,
                  "PreventionProgram3ID": 1000031856,
                  "ProcessChemicalID": 1000043988
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000029816,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2000-06-01 00:00:00",
    "ERTrainingDate": "2000-06-01 00:00:00",
    "CoordinatingAgencyName": "Lubbock Fire Department",
    "CoordinatingAgencyPhone": "8067655757",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000029816,
      "SummaryText": "opriate, the individuals role in the emergency response plan. \n\nContractors - This site follows strict guidelines for qualifying contractors who directly influence the safety of the process of the system. The contractor qualification procedure ensures that contractors and their employees are fully aware of the potential dangers involved with the ammonia process that contractors understand their responsiblilty and train their employees.\n\nMechanical Integrity Audits - The purpose of the Mechanical Integrity Audit program is to ensure that the equipment is maintained in good working order to prevent failure. These ongoing audits are a part of the preventative maintenance program in place since the initial operations began and are routinely performed on all compressors, condensers, evaporators, pressure vessels, piping system, relief and vent systems and devices, emergency shutdown systems, controls, and pumps. \n\nHot Work Permits -- This permit process is to protect against fire explosion and other dangers resulting from hot work (welding and cutting outside the designated areas). Hot work permits must be obtained before any work is done outside the shop area. The Maintenance Supervisor reviews and issues the permits to insure all fire prevention and protection rules aremet. Permits indicate the appropriate dates and the work to be done. The permits are kept on file until workers have completed the hot work operations.\n\nManagement of Change - The MOC procedure requires that all changes (even \"replacement in kind\" ) be reviewed to see if there is a negative effect. The MOC review addresses the technical basis for the change, the impact on safety and health, modifications to operting procedures and authorization requirements for the proposed change. Employees affected by the change are informed of the change before startup and trained in the proper procedures.\n\nEmergency Response Plan - This facility has a comprehensive emergency response plan that meets established crite"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029816,
      "SummaryText": "EXECUTIVE SUMMARY -- The risk Management Program is designed to comply with the EnvironmentalProtection Agency regulations detailed in 40 CFR Part 68. The stationary source is the Llano Distribution Center located at 5801 Martin Luther King Blvd, Lubbock, Texas 79404. The site is owned by Llano Logistics, Inc. The only PMR regulated substance at the facility is annhydrous Ammonia - classified as a toxic substance, liquified under presure. This facility has been in operation since May 2000. This refrigeration system at this facility will have an inventory or approximately 36,700 lbs. of Anhydrous Ammonia. This process does not meet the requirements of Program 1. It is subject to OSHA's PSM standard. Therefore, this RMP is written to meet the EPA Program 3 Level of compliance\n\nACCIDENTAL RELEASE PREVENTION PROGRAM  -- This facility follows a stringent Process Safety Management Program to prevent the accidental release of Ammonia. The PSM program is in compliance with the OSHA, Process Safety Management (PSM) of 29 CFR 1910.119. Employees and management participate and cooperate in the PSM program to maintain a work environment that is safe to employees, the community, and the environment. \n\nEMERGENCY RESPONSE POLICY -- The facility has a comprehensive emergency response plan that meets established criteria. The plan has been provided to the local LEPC, and will be updated should conditions change.\n\nPROCESS OVERVIEW -- This food distribution facility operates one ammonia refregeration process. The system operates at three-temperature separate suction pressures, all with single-stage compressors. The refrigeration system capacities are 128 tons of refrigeration (TR) @ -28 degrees F for the low temperature suction, 584 TR @ + 16 degrees F for the medium temperature suction and 183 TR @ +36 degrees for the high temperature suction. The refrigeration system is a liquid re-circulation system and is designed to operate at overfeed ratio of approximately 3:1 for all evaporato"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029816,
      "SummaryText": "rs. Amhydrous ammonia (R-171) refrigerant is a Group II refrigerant. Rotary screw and reciprocating compressors are used in the refrigeration system.\n\nThis ammonia refrigeration facility system contains six interconnected sub-systems: \nLow temperaturere-circulating system(-28 degrees F @0.0 PSIG)\nMedium temperature re-circulating system (+16 degree F @29.4 PSIG)\nHigh temperature re-circulating system (+36 degrees F @ 52.9 PSIG)\nThermosyphon oil cooling system (95 degrees F @ 181.1 PSIG)\nCondenser system (95 degrees FCT / 73 degrees F W.B.)\nLow temperature compressor system (-28 degrees F @ 0.0 PSIG)\nMedium temperature compressor system (+16 degrees F @ 29.4 PSIG)\nHigh temperature compressor system (+36 degrees F BHP with one @52.9 PSIG)\n\nMajor equipment located inside the engine room includes: \nTwo low temperature compressors ( both Vilter model 601 / Screws @ 64 TR / 156 BHP with one compressor also piped to the medium temperature system - rating adjusted to 87 TR / 350 BHP). \nTwo medium temperature compressors (both Vilter model 751 Screws @292 TR/317 BHP with one compressor piped to the high temperature system - rating adjusted to 475 TR / 351 BHP).\nOne high temperature compressor (Vilter model 751 Screws @292 TR/ 317 /bhp with one compressor also piped to the high temperature system - rating adjusted to 475 TR / 351BHP).\nOne high temperature compressor (Vilter model A-11KX458-XL @182.6 TR / 143.2 BHP).\nOne 30\" dia. 9'-7\" thermosyphon pilot - receiver. \nOne 54\" dia. 12'-'7\" OAL vertical accumulator package @ + 36 degrees F.  \nOne 72\" dia. 13'-4\" OAL vertical pump re-circulator package at +16 degrees F. \nOne 60\" dia. 10'-10\" OAL vertical pump re-circulator package @ -28 degrees F.\nOne Hansen APC Auto-Purger.\n\nMajor equipment located outside on the roof includes:\nOne evaporative condenser (EVAPCO model PMCB-1175, rated @ 14,275 MBH, for +95 degrees FCT / 73 degrees FWB)\n\nMITIGATION MEASURES \nThere are some mitigating measures in place. The location of the ammonia v"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029816,
      "SummaryText": "essels is inside the engine room. Although there are some doors and windows, the overall enclosure acts as a dike creating liquid pooling and limiting the liquid run-off. Ammonia leak detection is installed in this area that sounds and alarm and starts emergency ventilation. The emergency ventilation is automatically controlled and discharges the engine room air throgh the roof which creates a lower level of concentration in the engine room for responders. It also starts air dispersion at lower concentrations levels and disperses the ammonia with greater air turbulence.\n\nSUMMARY OF HAZARD ASSESSMENT \nThis hazard assessment was originally conducted to meet the RMP off-site Consequence Analysis requirements for the ammonia refrigeration system. The only RMP regulated substance at this facility is anhydrous ammonia which is classified as a toxic substance , liquified under pressure. The definitions and parameters for the following release scenarios are based on the \"Risk Management Program Guidance for Ammonia Refrigeration\" as described in Chapter 4 : Off site Consequence Analysis.\n\nThe worst case release scenario used in this assessment identifies the most likely as the evaporator units (24 thru 39).  The worst case release scenario is based on impact of the evaporator (24-39), evaporator drain pan or drain line. \n\nThe alternative release scenario evaluated in this hazard assessment identifies the most catrosphic ammonia release but least likely incident. While atttempting to add ammonia to the system the tank truck strikes the thermosyphon pilot receiver, the low, medium, and high temperature vessels causing a total release of ammonia vapor.   \n\nACCIDENT PREVENTION PROGRAM\nThis facility follows the OSHA Process Safety Management Program. Various special elements have been incorporated into the PSM Program to meet the EPA requirements for RMP. \n\nParticipation - The Participation Program is an asset to employees at the site and to the community as a whole. As a genera"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029816,
      "SummaryText": "l rule, employees who are involved have a greater degree of responsibility. The site maintenance department at the facility is keenly aware of the sense of resposibility for maintaining the integrity of the refrigeration system at the site. The awareness of the maintenance personnel will aid in every phase of the PSM program. \n\nProcess Safety Information - Process Safety Information includes a wide variety of books, manuals, and process information. These are available to employees that operate, maintain, or repair the process equipment or piping . There are three major categories of information: ammonia data such as MSDS , safety information, first aid, chemical properties, IIAR safety bulletins, etc. process information such as piping and instrumentation diagrams (P&ID's), block flow diagram, mass flow balance, design codes and standards., pressure safety relief settings , safety system/devices, ventilation system design, operating procedures, safe operating limits, and ramification of process deviation, and process equipment information such as equipment specifications  electrical classfications, material of construction,installation manuals, operting and maintenance manuals and manufacturer's manuals.\n\nStandard Operation Procedures - SOP's are provided for each compressor, condenser, ammonia vessel and oil pot, and evaporator. Topics include general information such items as objectives, hazards, location, equipment needed. P&ID's, task flow diagrams, and step by step procedures with specific warnings and comments. The SOP's cover different phases of operations such as : initial start up normal, temporary and emergency operations; emergency shutdowns, and start up following a shutdown. \n\nTraining - All employees who are involved with anhydrous ammonia have been properly trained at a minimum, in understanding the MSDS, routine refrigeration system operation, emergency refrigeration system operation, emergency and normal refrigeration safety practices, and, if appr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000029816,
      "SummaryText": "ria. This plan will be provided to the local fire department and the LEPC.\n\nCompliance Audits and RMP Revisions - To insure that all the other 12 areas of PSM program are followed , the company requires compliance audits. At a minimum these must be completed every three years. Resubmission of the RMP shall be done according to Section 6.2 to meet the OCA requirements."
    }
  ]
}