{
  "FacilityID": 1000068397,
  "FacilityName": "WPL-Riverside Energy Center",
  "FacilityStr1": "1401 W. B-R Townline Road",
  "FacilityStr2": null,
  "FacilityCity": "Beloit",
  "FacilityState": "WI",
  "FacilityZipCode": "53511",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55105",
  "LEPC": "Rock County LEPC",
  "FacilityLatDecDegs": "42.582962",
  "FacilityLongDecDegs": "-089.036674",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": "www.alliantenegy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Wisconsin Power and Light Company (WPL)",
  "Company2Name": "Alliant Enegy",
  "CompanyDUNS": 7946452,
  "Company2DUNS": 187173612,
  "OperatorName": "Wisconsin Power and Light Company",
  "OperatorStr1": "4902 Biltmore Lane",
  "OperatorStr2": null,
  "OperatorCity": "Madison",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53718",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": "WIR000110254",
  "EPAFacilityID": "100000186078",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "154099880",
  "SafetyInspectionDate": "2012-05-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-04-07 10:43:55",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-04-07 10:43:55",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-04-07 10:43:55",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-04-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.58442,
  "FRS_Long": -89.03672,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085813,
      "AltID": "SCR System",
      "FacilityID": 1000068397,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107141,
          "ProcessID": 1000085813,
          "ChemicalID": 57,
          "Quantity": 185040.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000087015,
          "ProcessID": 1000085813,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000053809,
              "Process_NAICS_ID": 1000087015,
              "SafetyReviewDate": "2017-11-01 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": "All equipment design and installation were based on these standards.",
              "HazardReviewDate": "2017-12-01 00:00:00",
              "ChangeCompletionDate": "2017-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Uninterrupted Power Supply not on the ammonia tank delivery system.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-01-16 00:00:00",
              "TrainingReviewDate": "2017-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-01-16 00:00:00",
              "EquipmentInspectionDate": "2018-01-16 00:00:00",
              "EquipmentTested": "Ammonia Tanks and Piping",
              "ComplianceAuditDate": "2018-01-16 00:00:00",
              "AuditCompletionDate": "2018-01-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000054515,
                  "PreventionProgram2ID": 1000053809,
                  "ProcessChemicalID": 1000107141
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068397,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-01-16 00:00:00",
    "ERTrainingDate": "2017-11-01 00:00:00",
    "CoordinatingAgencyName": "Beloit Fire Department",
    "CoordinatingAgencyPhone": "6083642997",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000068397,
      "SummaryText": "has developed an incident investigation program for the REC facility's ammonia system. This program includes elements from the Program 3 requirements and has been established to provide a mechanism for determining root causes of accidental releases of ammonia and preventing such events in the future. A copy of the form used to conduct incident investigation is included in Exhibit H . In addition, whenever an Environmental Event or Environmental Incident has been deemed to have occurred at REC, an Alliant Energy Environmental Incident Report needs to be completed and submitted to the appropriate GENCO Environmental Specialist, as well as the appropriate Corporate Specialist."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068397,
      "SummaryText": "EMERGENCY RESPONSE POLICY\r\nPursuant to the Risk Management Program regulations (40 CPR Part 68), REC developed this comprehensive written program to protect employees and the surrounding community from exposure to an ammonia release. As part of the re-submittal process,\r\n\r\n\r\nREC conducts a comprehensive review every five (5) years and revises the RMP accordingly. Revisions are documented in the RMP Review and  Amendment Log in Exhibit D of this RMP.\r\n\r\nREC is committed to the safe operation of the SCR ammonia system. A release prevention program (RPP) has been developed and implemented by REC that is a combination of several programs at the facility. The RPP includes employee education in the hazards of aqueous ammonia and measures that can be used to reduce employee and community exposure due to accidental releases of ammonia. The RPP includes  preventive maintenance programs (mechanical integrity) for the ammonia system that incorporates inspections of the system in accordance with recognized standards of equipment inspection within the ammonia industry, as well as tests of system components m accordance with component manufacturers' recommendations.\r\n\r\nThe RPP includes programs for pre-startup safety reviews and management of changes (MOC) to the ammonia system. The program also includes specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contractors who may be hired to work on the systems.\r\n\r\nSpecial emphasis is placed on handling accidental releases of ammonia and coordination of emergency response with local fire departments and other emergency response organizations in the RPP.\r\n\r\nAs required by RMP regulations, REC has reviewed the potential offsite consequences of the accidental releases from two (2) 12,000-gallon aqueous ammonia ASTs. Although such a release is highly unlikely, the regulation requires this review.\r\n\r\n1.8\tWORST CASE RELEASE SCENARIO\r\nAs required by USEPA regulat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000068397,
      "SummaryText": "GENCY RESPONSE PROGRAM\r\nThe RPP incorporates the RECs comprehensive Emergency Response Plan (ERP). The emergency response program places special emphasis on handling accidental releases of aqueous ammonia and coordination of emergency response (ER) with local fire departments and other emergency response organizations such as the Rock County Local Emergency Planning Committee (LEPC). The ERP details the ER structure and includes personnel responsibilities and procedures within that structure. In addition, the ERP includes procedures for notification of local agencies in the event of an incident, facility evacuation, and decontamination. Finally, the plan discusses emergency preparedness and planning, including plans for conducting ER team training and drills. The ERP is detailed in Section 7.0 of this RMP.\r\n\r\nRECs management is committed to supporting the ER organization and its prescribed functions. ER team members are drawn from the existing employee pool and the organizational concept fosters pride and emphasizes concerns for safe operation of the REC. The well-defined ER organization operates in conjunction with the local Fire Department and the Rock County LEPC to alleviate safety concerns about handling aqueous ammonia.\r\n\r\n1.12\tAUDITING PROGRAM\r\nREC has developed an auditing program for the REC facility's ammonia system. This audit program includes elements from the Program 3 requirements and has been established to provide a mechanism for periodic reviews of the various aspects of the Risk Management Program including:\r\n\r\n¿\tthe physical ammonia system;\r\n¿\thazard review;\r\n¿\toperation of the system;\r\n¿\tmaintenance procedures;\r\n¿\ttraining procedures; and\r\n¿\tIncident investigation procedures.\r\n\r\nAlthough not specifically required by the Risk Management Program regulations for Program 2 facilities, audits are conducted every three (3) years. A copy of the audit form used to conduct these audits is included in Exhibit G.\r\n\r\n1.13 INCIDENT INVESTIGATION PROGRAM\r\nREC"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068397,
      "SummaryText": "ions, the worst-case release scenario was assumed to be the complete loss of the contents of two (2) 12,000-gallon ASTs containing 185,040 pounds of aqueous ammonia. This analysis included a common containment dike for both tanks as a passive mitigation measure. The USEPA guidance for defining a worst-case release scenario for a release of gas is to estimate the release rate over a ten (10) minute period of the largest quantity resulting from a pipe or vessel failure. Thus, the ammonia emission rate from the worst-case release scenario used was the loss of 185,040 pounds of aqueous ammonia averaged over a ten (10) minute period, (i.e., approximately 62.9 lbs./ min. of ammonia released to the air.)\r\n\r\nUSEPA's public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 mg/ lit (or 200 ppm). The model predicted a distance of 0.4 miles as the distance to the toxic endpoint due to the specified worst-case release. Based on LandView 6 output, the total population within the potential exposure area is 45 with the following public receptors being potentially impacted - residences and industrial areas.\r\n\r\nREC personnel conduct one (1) round of inspections per shif t for a total of two (2) inspections daily, annual calibration of the ammonia sensors, annual personnel training, and implementation of a preventive maintenance schedule based on the manufacturer's recommendations. In addition, the ammonia tank is a permitted unfired pressure vessel and requires a visual inspection every three (3) years in order to maintain certification from the Department of Commerce (DOC). These measures greatly minimize the chance that the ASTs will fully discharge their contents in a release and minimizes the potential for an off-site impact.\r\n\r\nAST inspection records are documented in Exhibi t E of this RMP. Additionally, RMP personnel training records (including refresher and annual training) are documented  in Exhibit F of this RMP\r\n\r\n1.9\tALTERNATE RELEASE"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000068397,
      "SummaryText": "SCENARIO\r\nFor REC, the alternative release scenario was assumed to be the structural failure of a 2- inch pipe filled with aqueous ammonia under pressure at 56-psig pressure beyond the confines of the concrete dike. It is assumed that active mitigation (use of emergency shutdown systems) starts within a reasonable time after the accidental release begins. The pump can be remotely shut down from the control room when loss of pressure is detected. For this analysis, the total release duration is assumed to be the time period from the beginning of the release event until the release is totally contained. The total release duration was assumed to be ten (10) minutes. In this analysis, no passive mitigation measures were assumed. Thus, the ammonia emission rate from the alternative release scenario is given as the loss of 457 pounds of aqueous ammonia averaged over a 10-minute period. This was based on a pumping rate of 2.5 gallons per minute and a density of ammonia of 7.44 pounds per gallon. This scenario resulted in a release rate of ammonia to outside air of approximately 2.87 lbs/ min.\r\n\r\nUSEPA's public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 mg/ lit (or 200 ppm). The model predicted a distance of 0.1 mile as the distance to the toxic endpoint due to the specified alternative release. Based on LandView 6 output, the total population within the potential exposure area is zero (0). There are no public receptors that will be potentially impacted.\r\n\r\nAs stated earlier, REC personnel follow the RPP in order to minimize the potential for system leaks. The daily round inspections conducted during each shif t, in combination with the continuous monitoring of tank pressure from the control room, can quickly detect any leaks that are present. In addition, the ammonia pumps are shutdown when the generating units are not operating. These simple prevention techniques significantly reduce the potential for an offsite impact.\r\n\r\n1.1"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000068397,
      "SummaryText": "0\tRELEASE PREVENTION PROGRAM\r\nAs indicated earlier, REC pro-actively implements the RPP for the SCR ammonia system. The scope of the RPP encompasses various facets of release prevention; e.g., it enhances employee participation, increases employee awareness about the hazards of handling ammonia, establishes safe standard operating procedures, and enhances access to process safety inf ormation through annual training being provided by the vendor, as well as hands-on training. RMP training records are included in Exhibit F of this RMP.\r\n\r\nDuring the design process, REC performed a hazards analysis on the SCR ammonia system. Subsequent hazard reviews were performed after three (3) years and again after five (5) years to review the existing operating procedures and equipment maintenance schedule. These operational safeguard measures indicate a high success rate as demonstrated through no reported leaks or releases.\r\n\r\nThe RPP provides the procedural backbone for safe operability functions and allows REC to maintain, review and evaluate the program on a periodic basis. Basic elements include the following but are not limited to:\r\n\r\n¿\tAnnual personnel training ( Exhibit F);\r\n¿\tHands-on training to new employees ( Exhibit F);\r\n¿\tAmmonia release sensors located in the tanks area, which gives an alarm in the control room when triggered;\r\n¿\tDaily round inspections by shif t workers once per shift (at least twice daily);\r\n¿\tAnnual calibration of the ammonia sensors ( Exhibit E);\r\n¿\tAmmonia pumps are shutdown when the combustion turbines are not generating;\r\n¿\tFacility personnel are required to follow a chemical off-loading procedure and checklist;\r\n¿\tContinuous review of safe operating procedures;\r\n¿\tEvaluation of  the mechanical  integrity  of  the equipment which includes visual inspection of the ammonia tank every three (3) years;\r\n¿\tImplementation\tof\ta\tpreventive\tmaintenance\tschedule\tper\tvendor's recommendations;  and\r\n¿\tEffective emergency response program.\r\n\r\n1.11\tEMER"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068397,
      "SummaryText": "1.0   EXECUTIVE SUMMARY (40 CFR PART 68.155)\r\n1.1\tPLAN ORIGINATION\r\nThe Risk Management Plan (RMP) was initially prepared by URS Corporation, dated May 2010, on behalf of the Riverside Energy Center (REC), a subsidiary of Calpine Corporation. As of January 1, 2013, Wisconsin Power and Light Company (WPL), a subsidiary of Alliant Energy, purchased REC from Calpine Corporation. Hard Hat Services (HHS), completed administrative changes to modif y the RMP document into the standard Alliant Energy document format. The content within the May 2010 plan from URS Corporation has not been reviewed for regulatory compliance by HHS. This plan was reviewed and revised Jan, 2018.\r\n\r\nThis RMP plan was originally prepared for  REC  in response to the United States Environmental Protection Agency's (USEPA) accidental release prevention regulations or Risk Management Program regulations codified in part 68 of Title 40 of the Code of Federal Regulations (40 CPR Part 68). Exhibit A presents a cross-reference of the RMP sections relative to applicable parts of 40 CPR part 68.\r\n\r\nREC stores more than 20,000 pounds of aqueous ammonia onsite, which contains an ammonia concentration greater than 20%. The aqueous ammonia is used in the facility's Selective Catalytic Reduction (SCR) system, which controls nitrogen oxides (NOx) emissions from the combustion turbines and duct burners. The aqueous ammonia storage is a covered chemical under the Risk Management Program regulations. According to the original plan, aqueous ammonia is the only regulated substance  (listed as a toxic chemical) processed in the SCR system. No other system or substance used at RE is subject to Risk Management Program regulations.\r\n\r\n1.2\tPURPOSE\r\nREC is a combined-cycle electric power generating facility located just north of the city of Beloit, in Rock County, Wisconsin. The facility includes two (2) SCR systems that use ammonia for the reduction of NOx emissions. The ammonia is stored in aqueous form in two (2) 12,000"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068397,
      "SummaryText": "-gallon aboveground storage tanks (ASTs) located at REC. At full capacity, the tanks can store up to 185,040 pounds of aqueous ammonia. Since REC will be storing more than 20,000 pounds of aqueous ammonia in a process, it is subject to USEPA Risk Management Program regulations codified in 40 CPR Part 68.\r\n\r\n\r\nAmmonia is an easily liquefiable colorless gas with a sharp, intensely irritating odor. The aqueous form is a solution of ammonia and water. It is listed by the USEPA as a regulated toxic substance for release prevention. Exhibit B presents the Material Safety Data Sheet (MSDS) for aqueous ammonia.\r\n\r\n1.3\tRMP CERTIFICATION\r\nManagement certification of  this RMP is provided at the beginning of this document. Certifications for prior versions of this RMP for REC shall be documented in Exhibit C of this RMP.\r\n\r\nThe original RMP stated that a copy of this RMP in electronic format (i.e., RMP*eSubmit format) had been submitted to the USEPA for its review and approval. HHS has not been provided records of USEPA approval of the original plan. Record of the EPA approval of this RMP shall be documented in Exhibit C of this RMP.\r\n\r\n1.4\tLOCATION OF RMP\r\nOne complete hard copy of this RMP is maintained in the administration building at REC. In addition, this RMP is also available electronically.\r\n\r\n1.5\tPLAN REVIEW\r\nIn accordance with 40 CPR Part 68 regulations, the Risk Management Program regulations require a comprehensive review and re-submission every five (5) years. Accordingly, the original plan from May 2010 was revised/ updated to incorporate the changes resulting from the previous five (5) year review. The next five (5) year review must be completed by Dec, 2022.\r\n\r\nRevisions and amendments to this RMP shall be documented in the RMP Review and Amendment Log in Exhibit D of this RMP.\r\n\r\n1.6\tRECORDKEEPING\r\nREC shall maintain records supporting the implementation of this RMP for five (5) years. Records shall be kept with this plan at REC.\r\n\r\n1.7\tRELEASE PREVENTION AND"
    }
  ]
}