{
  "FacilityID": 1000116882,
  "FacilityName": "Lineage Logistics LLC, Chicago Western Avenue",
  "FacilityStr1": "2635 South Western Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60608",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "41.84386",
  "FacilityLongDecDegs": "-087.685398",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.onelineage.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Lineage Logistics LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Lineage Logistics, LLC",
  "OperatorStr1": "350 West Hubbard Street, Suite 430",
  "OperatorStr2": null,
  "OperatorCity": "Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60654",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000195497",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-12-19 00:00:00",
  "SafetyInspectionBy": "Contractor - Compliance Audit",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-08-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-08-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-08-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-08-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.6",
  "FRS_Lat": 41.84399,
  "FRS_Long": -87.68541,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000145809,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000116882,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000182291,
          "ProcessID": 1000145809,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000147422,
          "ProcessID": 1000145809,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000124698,
              "Process_NAICS_ID": 1000147422,
              "SafetyReviewDate": "2019-02-19 00:00:00",
              "PHA_Date": "2019-02-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-02-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fireman's Dump",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-12-08 00:00:00",
              "TrainingReviewDate": "2019-02-19 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-12-08 00:00:00",
              "EquipmentInspectionDate": "2022-10-07 00:00:00",
              "EquipmentTested": "System",
              "ChangeMgmtDate": "2024-06-25 00:00:00",
              "ChangeMgmtReviewDate": "2024-08-13 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2022-12-19 00:00:00",
              "AuditCompletionDate": "2025-02-10 00:00:00",
              "IncidentInvestigationDate": "2008-12-26 00:00:00",
              "InvestigationChangeDate": "2008-12-26 00:00:00",
              "ParticipationPlansReviewDate": "2019-02-19 00:00:00",
              "HotWorkPermitReviewDate": "2019-02-19 00:00:00",
              "ContractorSafetyReviewDate": "2024-07-23 00:00:00",
              "ContractorSafetyEvalDate": "2024-04-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000156357,
                  "PreventionProgram3ID": 1000124698,
                  "ProcessChemicalID": 1000182291
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000116882,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-02-19 00:00:00",
    "ERTrainingDate": "2019-04-04 00:00:00",
    "CoordinatingAgencyName": "Chicago Fire Department",
    "CoordinatingAgencyPhone": "7735551212",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000116882,
      "SummaryText": "I.\tIntroduction\nA Risk Management Program has been implemented at the Lineage Logistics LLC, Chicago Western Ave facility located at 2635 South Western Avenue in Chicago, Illinois, for the reduction of accidental releases of hazardous materials. This Risk Management Plan (RMP) summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to site personnel, contractors, visitors, and the community and environment at large of hazardous chemical releases. This RMP has been updated to correspond with specific U.S. Environmental Protection Agency (EPA) RMP, Program 3 of 40 CFR 68, definitions and requirements of Subpart G, including: \n¿\tIntroduction;\n¿\tLineage Logisticd LLC policies to protect health, environment, and safety;\n¿\tFacility identification and regulated substances covered processes;\n¿\tHazard Assessment;\n¿\tPrevention Program;\n¿\tFive-Year Accident History;\n¿\tEmergency Response Plan; \n¿\tEmergency Communications;\n¿\tSpill Reporting / Environmental Release Procedures;\n¿\tPlanned changes to improve safety; and\n¿\tManagement Program\n\nII.\tLineage Logistics LLC Policies To Protect Health, Environment, and Safety\nRisk management and safety are important concerns at Lineage Logistics LLC: this RMP formalizes and documents these activities. Lineage Logistics LLC is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment. It is Lineage Logistics LLC policy to comply with all applicable federal, state, and local rules, and regulations.\n\nThis RMP update has identified potential hazards and has taken steps to design and maintain a safe facility in order to prevent releases, and minimize the consequences of accidental releases, which could occur. RMP addresses potentially catastrophic chemical releases that could result in immediate harm and acute health effects to offsite receptors (public and environmental). Lineage Logistics LLC has develope"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000116882,
      "SummaryText": "d an Emergency Action Plan (EAP) that contains procedures designed to maximize the safety of all employees, contractors, and visitors in the event of an emergency and also guard against environmental consequences.\n\nIII.\tFacility Identification\nThe Lineage Logistics LLC -Chicago Western Avenue facility is located at 2635 South Western Avenue in Chicago, Illinois.  The facility is refrigerated warehouse that is utilized for refrigerating and freezing a variety of food products. The NAICS code for the facility is 49312. \n\nThe facility uses anhydrous ammonia for refrigeration, and is regulated under 40 CFR Part 68, the EPA RMP Rule. There is one refrigeration system onsite that is used for refrigerating and freezing a variety of food products. The total amount of ammonia onsite is approximately 20,000 pounds, which is above the minimum threshold quantity of 10,000 pounds.\n\nThe refrigeration system provides the mechanical refrigeration required for maintaining temperatures in the freezer, blast freezers, holding coolers, product re-pack area, and the inspection areas.\n\nIV.\tGeneral Accidental Release Prevention Program\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the OSHA Process Safety Management (PSM) standard (29 CFR 1910.119) and the EPA Risk Management Program.   \n\nThis prevention program covers those processes that handle ammonia above the threshold quantity for both PSM and RMP rules.  The elements of the PSM, Program 3 prevention program, and a brief description are listed below.\n¿\tEmployee Participation - Lineage Logistics LLC has developed a site specific employee participation plan that ensures employees and their representatives are consulted when conducting and developing a process hazard analysis and all other information required to be developed under PSM/RMP.  In addition, the employee participation program will ensure employees and their representatives have access to process hazard analyses and a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000116882,
      "SummaryText": "ll other information required to be developed under PSM/RMP.  \n \n¿\tProcess Safety Information - Lineage Logistics LLC maintains a site specific PSI program that ensures information pertaining to the hazards, technology, and equipment of the process are properly developed and maintained.\n¿\tProcess Hazard Analysis - Lineage Logistics LLC has developed a site specific process hazard analysis (PHA) program that ensures a PHA is conducted initially, and at a minimum, every five (5) years, and whenever required by the written Management of Change program.  In addition, this program ensures PHA's are conducted in accordance with OSHA and EPA regulations and ensures findings and recommendations of PHA's are properly documented.  \n¿\tOperating Procedures - Lineage Logistics LLC has developed a site specific procedure that ensures operating procedures provide clear instruction for different phases of process operations and ensures they are properly maintained.   \n¿\tTraining - Lineage Logistics LLC has developed a site specific training procedure that ensures employees operating the ammonia process have the knowledge to safely operate the process, are aware of the potential hazards of the process, and understand the causes of process problems.\n¿\tManagement of Change - Lineage Logistics LLC has developed a site specific management of change procedure that ensures changes (except for replacement in kind) to the ammonia process, such as additions of new equipment or changes in operating, maintenance, or other procedures are documented.\n¿\tPre-Startup Review - Lineage Logistics LLC has developed a site specific pre-startup safety review procedure that ensures a safety review is performed when modifications to the ammonia process are significant enough to require a change in PSI.\n¿\tMechanical Integrity - Lineage Logistics LLC has developed a site specific mechanical integrity procedure that ensures written preventative maintenance procedures are developed and maintained, preventative"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000116882,
      "SummaryText": "maintenance tests and inspections are properly documented, and employees maintaining the process receive adequate training.  \n¿\tContractor Qualifications - Lineage Logistics LLC has developed a site specific contractor qualification procedure that ensures all contract employers' safety performance and programs are evaluated, a contract employee injury and illness log is maintained, information of potential hazards are communicated between Lineage Logistics LLC and the contract employer, and required training and information is communicated, such as the provisions of the emergency action plan and control over entrance into process areas.\n \n¿\tIncident Investigation - Lineage Logistics LLC has developed a site specific incident investigation procedure that ensures each incident that either results in a release or could have resulted in a release of anhydrous ammonia is investigated, within 48 hours, by a team of at least one person knowledgeable in the process.  This procedure will also make provisions to ensure a report is prepared at the conclusion of the investigation and findings are promptly addressed.\n¿\tCompliance Audit - Lineage Logistics LLC has developed a site specific compliance audit program that ensures compliance audits are conducted at a minimum of every three years to verify that Lineage Logistics LLC PSM/RMP practices and procedures are adequate and are being followed.  \n¿\tHot Work Permits - Lineage Logistics LLC has developed a site specific best management practice for hot work.\n¿\tEmergency Action Plan - Lineage Logistics LLC has developed an Emergency Action Plan (EAP) that contains procedures designed to maximize the safety of all employees, contractors, and visitors in the event of an emergency and also guard against environmental consequences.\n\nVII.\tFive-Year Accident History\nThe Lineage Logistics LLC facility has not had an accidental anhydrous ammonia release, which resulted in deaths, injuries, or significant property damage onsite, or known"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000116882,
      "SummaryText": "offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\nVIII.\tEmergency Action and Response Plan\nLineage Logistics LLC has developed an Emergency Action and Response Plan (EARP) to ensure that in the event of an emergency the facility personnel are aware of the appropriate actions to take and authorities to contact in order to mitigate the effects of a release. \n\nLineage Logistics LLC currently relies on their ammonia refrigeration contractor to respond to any emergencies related to the ammonia refrigeration system. \n\nThe facility has two (2) windsocks present onsite for use in determining wind direction in the event of an ammonia release and evacuation of the building.\n\nIX.\tEmergency Communications\nThe telephone numbers of agencies and plant personnel that may be contacted in case of an emergency are available onsite.\n\nX.\tPlanned Changes to Improve Safety\nChemical safety is an important part of Lineage Logistics LLC operations. Lineage Logistics LLC recently conducted a process hazard analysis of their ammonia refrigeration system and will be dutifully implementing the recommendations from the assessment. Continuous improvement in safety is an important goal for Lineage Logistics LLC. \n\nXI.\tManagement Program\nLineage Logistics LLC has developed a management system to oversee the implementation of the risk management program elements.  This system has assigned qualified person(s) (or positions) to assist in the development, implementation, and integration of the risk management elements.  If any portion of the program is delegated to others, the names or positions of those individuals will be documented and the lines of authority defined through an organizational chart or similar document.  ."
    }
  ]
}