{
  "FacilityID": 1000017538,
  "FacilityName": "Jersey Valley",
  "FacilityStr1": "1843 Butcher Canyon Rd",
  "FacilityStr2": "45 miles SW of Battle Mountain",
  "FacilityCity": "Battle Mountain",
  "FacilityState": "NV",
  "FacilityZipCode": "89820",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32027",
  "LEPC": "Pershing County LEPC",
  "FacilityLatDecDegs": "40.177502",
  "FacilityLongDecDegs": "-117.473332",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ormat.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Ormat Technologies, Inc.",
  "Company2Name": "Ormat Nevada, Inc.",
  "CompanyDUNS": 929315661,
  "Company2DUNS": 0,
  "OperatorName": "Ormat Nevada, Inc.",
  "OperatorStr1": "6225 Neil Road",
  "OperatorStr2": "Suite 300",
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89511",
  "OperatorZipCodeExt": "1136",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000213128",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-10-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-10-19 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-10-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-10-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000021669,
      "AltID": "Pentane Working Fluid",
      "FacilityID": 1000017538,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000025612,
          "ProcessID": 1000021669,
          "ChemicalID": 125,
          "Quantity": 330478.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000021969,
          "ProcessID": 1000021669,
          "NAICSCode": "221119",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000017538,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2010-09-14 00:00:00",
    "ERTrainingDate": "2010-09-14 00:00:00",
    "CoordinatingAgencyName": "Battle Mountain Volunteer Fire Dept",
    "CoordinatingAgencyPhone": "7756355102",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000017538,
      "SummaryText": "Jersey Valley Risk Management Plan\nExecutive Summary\n\nAccidental Release Prevention and Emergency Response Policies\n\nIt is Ormat Nevada, Inc.'s (Ormat's) policy to adhere to all applicable federal, state, and local laws. The Jersey Valley facility actively manages all operational permits and safety programs such as Nevada Department of Environmental Protection Air Quality, Chemical Accident Prevention Program, Underground Injection Control as well as OSHA's Process Safety Management. In addition, Ormat is ISO 14000 and 9001 certified and undergoes several audit processes to ensure all facilities are aggressively pursuing the highest quality, safety and environmental standards. Ormat is committed to handling the n-pentane systems in a safe manner to protect the environment. Copies of emergency response, process hazard analyses, Chemical Accident Prevention and process safety management plans and all technical drawing (P&IDS) for process equipment are maintained onsite for reference.\n\nFacility Description \nThe Jersey Valley Geothermal Power Plant (Jersey Valley) is wholly owned by Ormat Nevada, Inc (Ormat) which is a division of Ormat Technologies, Inc., a publicly traded company. The Jersey Valley Project is located in Pershing County and encompasses approximately 8,470 acres of public and private lands. The physical plant is located on approximately 9 acres located about 45 miles southwest of Battle Mountain off of Highway 305 (APN 014-030-01). The leased acreage covers the defined geothermal resource area and receptive injection zones.\n\nThe physical address is: 1843 Butcher Canyon Road, Pershing County\n \nThe Jersey Valley Plant will be a geothermal electric power generation facility with a 16 MW generator nameplate, air-cooled Integrated Two Level Unit (ITLU - LI/LII) Ormat Energy Converters (OEC), a 7.5 MW generator nameplate Level III OEC and associated facilities. Geothermal fluid will be supplied from three production wells to a binary system consisting of two "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000017538,
      "SummaryText": "OEC's. Spent geothermal fluid will be injected back into the subsurface reservoir via two injection wells.\n\nJersey Valley will be operated by Ormat's Nevada Operations Group. The NV-Operations Group (NV-Ops) is comprised of management, administration, maintenance, engineering and operations personnel. NV-Ops operate all of the Nevada power generation facilities owned or operated by Ormat.\n\nStaff will typically consist of one on site plant operator. Remote monitoring and maintenance and administrative support will be provided to the Jersey Valley facility from the Galena 3 control room at the Steamboat Geothermal Facilities near Reno, Nevada. The Jersey Valley facility will operate continuously 24 hours a day and 365 days of the year (excluding scheduled maintenance downtime or plant upsets).\n \nRegulated Substance Handled\n\nJersey Valley stores n-pentane (CAS # 109-66-0) as the motive fluid used in the Ormat Energy Converter (OEC) units. In accordance with 29 CFR 1910.119 the use of n-pentane as a process or motive fluid in a quantity greater than 10,000 lbs requires the establishment of a PSMP, CAPP and RMP. The plant will have two n-Pentane storage tanks that will have the capacity to hold 42,000 gallons of n-Pentane. The total projected amount of n-pentane to be stored on site is 330,478 pounds. The n-Pentane is projected to first be stored on the site in mid-November 2010.\n \nWorst Case Scenario: Worst case scenario assessment has been made and potential off-site consequence analysis (OCA) was undertaken. However, in conformance with Office of Emergency Management guidance, the OCA for worst-case and/or alternative release scenario(s) has not been included in this Executive Summary because of security concerns.\n\nSafe Work Practices: Safe work practices have been developed and implemented to provide for the control of hazards during work activities such as lock out/tag-out, confined space entry, opening process equipment or piping, and control over entrance into a f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000017538,
      "SummaryText": "acility by maintenance, contractor, laboratory or other support personnel. These safe work practices apply to both employees and contractors.\n\nMaintenance Procedures: A Mechanical Integrity Program (MIP) has been initiated at the Jersey Valley facility. The MIP adopted a maintenance concept for periodic preventative and corrective maintenance of the OEC system at Jersey Valley. The preventative maintenance tasks include visual inspection, lubrication of rotating parts, system cleaning, replacing liquids and filters, and periodic tests to verify that the system is in proper operating condition. Preventative maintenance tasks and procedures are scheduled to be undertaken over a series of maintenance intervals.\n\nAlarm system maintenance is determined using a combination of regulatory requirements, manufactures recommendations, plant operating experience and best practices. Standard Operating Procedure #9, Maintenance Instructions (SOP-9) will identify system maintenance procedures, frequencies and recommended spare parts.\n\nTraining: Initial training for personnel is given before that employee is allowed to either handle n-pentane, operate or work on the facility's process area or on process equipment. Initial training shall be completed with Emergency Services Personnel including a tour of the site, gas and fire detection system operations, and familiarization with the motive fluid characteristics.  \n\nRefresher training is conducted on an annual basis, at a minimum, and when review of the chemicals or process(es) reveals a need for additional training. Initial and refresher training, associated with the RMP program, is documented and maintained per the requirements of the Training. Additional training will also be provided as needed or requested by Emergency Services Personnel. Contracted employees, shall be trained in the requirements of the EAP procedure prior to working at the Jersey Valley site. Training will include the following items, but is not limited to: (a) "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000017538,
      "SummaryText": "Location and sounds of the gas, fire, and evacuation alarms and detectors; (b) Expectations of response to injuries and emergencies by personnel on site, and in the Galena 3 Control Room; and (c) Evacuation routes and locations. Refresher training for all personnel shall be conducted annually at a minimum.\n\nSafety Training: Some equipment at the Jersey Valley Geothermal Power Plant poses potential fire, explosion, and electrical hazards that could cause serious personal injuries and costly property damage if safety procedures are not followed correctly. Safety training, conducted monthly and required of all employees, identifies the different hazards to be found on the sites.  These subjects include Emergency Action Plan (EAP), motive fluid hazards, fire prevention and hot work, lock out and tag out procedures, hazard communication, confined space, hearing conservation, personal protective equipment, accident, injury and incident reporting. Safety training is supplemented by the use of the Standard Safety Procedures.\n\nn-Pentane system: Deviation from the design limits of operation for the n-pentane transfer system will not normally occur since the individual components are rated beyond the highest achievable values of pressure, temperature, and flow within the system.\n \nOEC Units: The OEC units are controlled and monitored by their own dedicated HMI Programmable Logic Controller (PLC). The PLC receives all discrete (logic) and analog signals from the input devices (e.g.  switches and measuring sensors), processes the signals according to pre-loaded Ormat software, and then outputs logic and analog command signals to local and field devices. All parameters needed for proper operation of the OEC units, such as pressure, temperature, voltage, current, power, speed, etc. are measured by the proper measuring instruments.  Deviation from the operating parameters will immediately be detected by the PLC and the PLC will initiate correction or automatic shutdown of the relat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000017538,
      "SummaryText": "ed OEC unit. Under normal circumstances, no releases or other dangerous situations are expected to result from these automatic actions. Appropriate manual override is provided.\n\nRelief system design: Relief valves are located on the n-pentane storage tanks and on the OEC vaporizers and condensers. Each pressure relief valve relieves directly to atmosphere, and some installations have extension pipes installed to direct the relief valve discharge away from critical machinery. Additionally, each pressure relief valve is installed immediately above a rupture disk designed to fail at the relief pressure of its corresponding relief valve. Individual relief valve locations are equipped with \"telltale\" gauges in between the relief valve and its rupture disk to allow easy identification of leaking or blown rupture disks. The following list summarizes the system relief set points: \n\n    n-Pentane Storage Tank Relief: 150 psig \n    Condenser: 120 psig \n    Vaporizer: 350 psig \n\nVentilation System Design: All components of the n-pentane transfer and storage systems and the OEC units are located outdoors and well ventilated.\n\nSafety Systems: Beyond the relief system the Jersey Valley OEC units have extensive fire protection, detection, and alarming systems as well as an administrative control system aimed at fire prevention.\n\nThe fire detection systems include gas monitors which continuously monitor the area surrounding the OEC's, and ultraviolet/infrared flame detectors throughout the plant. The facility has a fire water system setup in a continuous loop around the generating units and within reach of the n-pentane storage tank. The fire water systems consist of fire monitors and hydrants, and a diesel driven fire pump that draws from a 250,000 gallon storage tank. Operators are trained in the proper use of the installed fire protection equipment, and the training information is appropriately documented by the facility operator.\n\nProcess Hazard Analysis\n\nA Process Hazardous Analysis (P"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000017538,
      "SummaryText": "HA) including Hazard and Operability (HAZOP) study, an external events analysis and a preliminary human factors analysis was undertaken in September 2010. The recommendations of the PHA were integrated into the facility and facility operations. The PHA will be updated and revalidated at least every 5 years to ensure the study is consistent for the life of the pentane processes. \n\nFive-Year Accident History\n\nThe Jersey Valley power plant is a new facility and there have been no accidents associated with pentane and no accidental releases of pentane.\n\nEmergency Response Program\n\nThe Emergency Response Program is intended to identify and coordinate personnel in the event there is an emergency. The EAP procedures apply to all personnel working at the Jersey Valley facility or monitoring the Jersey Valley plant from the Galena 3 control room.  The EAP is submitted to the local fire department for review and approval and when changes are made to the plan. Annual meetings will be conducted to communicate activities planned by Ormat personnel and the response actions expected by the local fire department, and to coordinate potential joint response activities. The following information was selectively excerpted from the Jersey Valley Emergency Action Plan (EAP).\n\nPentane Leak or Fire Emergencies: An emergency is identified as any type of fire, explosion, or motive fluid spill (ruptured vessel, process pipe, etc.) within the plant. Under no circumstances is any person to put himself/herself in danger. A General Response and Action Chart has been prepared to provide guidance on the initial response and follow up actions in the event of a pentane gas, smoke or fire detection alarm.\n\nImplementation, Control and Compliance: The Plant Manager has overall responsibility for the development and implementation of the Emergency Action Plan. The Emergency Action Plan shall be reviewed annually to verify regulatory compliance and accuracy with both OSHA Regulations on Emergency Plans 29"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000017538,
      "SummaryText": ", CFR 1910.38 and CAPP's Emergency Response Programs, NAC 459.9544. The Emergency Response Program must also be periodically reviewed and updated and employees notified of any changes in conformance with 40 CFR 68.95. The EAP may also be reviewed, as part of any Incident Investigations or when deemed required during Management of Change. Current copies of the Emergency Action Plan will be located in the Jersey Valley Control Building and in the Galena 3 Control Room\nEvacuation of Personnel: In the event of an emergency determined to be pentane system related and evacuation is deemed necessary, the control room operator or other designated personnel will sound the plant evacuation alarm.\n\nFirst Aid: All personnel have been trained in adult CPR and basic first aid procedures. \n\nGalena 3 Control Room Operator: Upon notification from the site that an emergency has occurred, the Galena 3 Control Room Operator shall verify an emergency shutdown of the Jersey Valley plant was initiated and emergency response teams have been called.  The Control Room Operator assumes initial communications with site over emergency situations until relieved by either the Plant Manager or Operations Manager.\nEmergency Response Personnel: Fire, police, and/or ambulance crews will be called as necessary.  The senior employee on site at the time of the incident will give a report to the person in charge of the emergency teams.  This report will include currently known causes and effects, reports of injured personnel and their locations, etc.  If any employee is unconscious, the Steamboat Facility Administrative Assistant, if available, will make that employee's medical questionnaire available to EMT personnel.  All other employees are instructed to stay clear unless specifically requested to assist in some manner.\n\nPlanned Changes to Improve Safety\n\nBecause Jersey Valley is a new facility, it has no record of any emergency actions or incidents and there are currently no planned changes to improv"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000017538,
      "SummaryText": "e safety.\n"
    }
  ]
}