{
  "FacilityID": 1000078528,
  "FacilityName": "CCNA Base Place USA",
  "FacilityStr1": "2659 Orange Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Apopka",
  "FacilityState": "FL",
  "FacilityZipCode": "32703",
  "Facility4DigitZipExt": "3346",
  "FacilityCountyFIPS": "12095",
  "LEPC": "District 6 LEPC",
  "FacilityLatDecDegs": "28.690278",
  "FacilityLongDecDegs": "-081.554167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Coca-Cola Company, Inc.",
  "Company2Name": "Coca-Cola North America",
  "CompanyDUNS": 3296175,
  "Company2DUNS": 0,
  "OperatorName": "Coca-Cola North America",
  "OperatorStr1": "2659 Orange Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Apopka",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32703",
  "OperatorZipCodeExt": "3346",
  "RMPContact": "John Bohmann",
  "RMPTitle": "Mgr. Maintenance & Environmental",
  "FTE": 54,
  "OtherEPAFacilityID": "32768CCCLF26590",
  "EPAFacilityID": "100000155388",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-10-09 00:00:00",
  "SafetyInspectionBy": "Florida Division of Emergency Management",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 28.78607,
  "FRS_Long": -81.5632,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "124000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097919,
      "AltID": "Ammonia",
      "FacilityID": 1000078528,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099161,
          "ProcessID": 1000097919,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122836,
          "ProcessID": 1000097919,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000622836,
          "ProcessID": 1000097919,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078528,
      "SummaryText": "Coca-Cola North America Base Place USA\n\nApopka, Florida Base Manufacturing Facility\n\nRisk Management Plan for Ammonia\n\n\n\nExecutive Summary\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\n\n\n     The Coca-Cola Company is strongly committed to employee, public and environmental safety.  This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance and employee training associated with our regulated processes.  It is our policy to implement appropriate controls to prevent possible accidental releases of regulated substances.  However, if such and accidental release does occur, we are coordinated with the City of Apopka Fire Department and the Florida District 6 LEPC for emergency  response support.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\n\n\n     This facility is used for the production of juice and fruit drink products.  Ammonia is the only \n\nRMP regulated substance present at this facility in a threshold quantity.  It is utilized as the primary cooling media in our closed-loop refrigeration system.  The system's purpose is to provide cold storage capabilities for certain products.  The amount of ammonia currently present in the refrigeration system totals approximately 14,000 pounds.  Due to the characteristics of our ammonia refrigeration system, as well as Process Safety management (PSM) applicability, this facility is covered under Program 3 of the RMP regulations.\n\n\n\nAs part of a facility modification, the ammonia refrigerating system at this facility was completely rebuilt in 1998.  Prior to its re-commissioning in late 1998, the plant was idle for two years.\n\n\n\n\n\n4. The General Accidental Release Prevention Program and the Chemical- Specific Prevention Steps\n\n\n\n     The facility has taken all necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR part 68.  Our facility i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078528,
      "SummaryText": "s also subject to the OSHA PSM standard under 29 CFR 1910.119, as well as the EPCRA Section 302 and 311 / 312 notification / reporting requirements.  The following sections briefly describe the elements of the accidental release prevention program that is in place or our facility.\n\n\n\n          Process Safety Information\n\n\n\n     The Coca-Cola Company maintains a detailed record of safety information that describes the chemical hazards. Operating parameters and equipment designs associated with the ammonia refrigeration system.\n\n\n\n          Process Hazard Analysis\n\n\n\n     As part of the ammonia refrigeration system installation process and as required under PSM, the facility conducted a comprehensive study to ensure that hazards associated with its ammonia refrigeration system are identified and controlled efficiently.  These studies, using \"What if\" scenarios, will be repeated every 5 years by a team of qualified personnel with expertise in refrigeration engineering and process operations.  Any findings related to the process hazard analysis will be addressed n a timely manner.\n\n\n\n          Operating Procedures\n\n\n\n     In order to safely conduct activities related to our ammonia refrigeration system, The Coca-Cola Company maintains written operating procedures.  These procedures address various modes of operation including startup, normal operations, emergency operations, normal shutdown and emergency shutdown.  The information is regularly reviewed and is readily accessible to all operators and contractors who work with the ammonia refrigeration system.\n\n\n\n          Training\n\n\n\n     The Coca-Cola Company has a comprehensive training program in place to ensure that employees who are working with the ammonia refrigeration system are competent in al relevant operating procedures.  Refresher training provided at least every three ( 3 ) years or more frequently as needed.\n\n\n\n          Mechanical Integrity\n\n\n\n     The Coca-Cola Company carries out and documents maintenanc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078528,
      "SummaryText": "e checks on ammonia refrigeration system equipment to ensure proper operation.  Process equipment examined by these checks includes among others:  pressure vessels, piping systems, pressure relief valves, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in applicable maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\n          Management of Change\n\n\n\n      Written procedures are in place at The Coca-Cola Company to manage changes in ammonia refrigeration system technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job task are affected by an ammonia refrigeration system modification are promptly made aware of and offered training to deal with the modification.\n\n\n\n          Pre-startup Reviews\n\n\n\n     Pre-startup safety reviews are conducted any time the ammonia refrigeration system or any of its components are opened for repairs, tie-ins or modifications.  These reviews are conducted to confirm that construction, equipment, operating procedures and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\n          Compliance Audits\n\n\n\n     The Coca-Cola Company will conduct audits on a regular basis to ensure that the provisions set out under the RMP rule are being properly implemented.  These audits will be carried out at least every three ( 3 ) years and any corrective actins required as a result of the audits shall be undertaken in a safe and prompt manner.\n\n\n\n          Incident Investigation\n\n\n\n     The Coca-Cola Company promptly investigates any incident that has resulted in or could reasonably result in and accidental release of ammonia.  These investigations are undertaken to identify the situation leading to the incident as we"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078528,
      "SummaryText": "ll as any corrective actions implemented to prevent the release from reoccurring. All incidents investigations reports will be retained for a minimum of five ( 5 ) years.\n\n\n\n          Employee Participation\n\n\n\n     The Coca-Cola Company truly believes that accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information related to RMP implementation including Process Hazard Analyses (PHA) information.\n\n\n\n          Contractors\n\n\n\n     On occasion our company hires experienced contractors to conduct specialized maintenance and/or construction activities related to the ammonia refrigerating system.  Prior to selecting a contractor, a thorough evaluation is made of the contractor's safety performance.  The Coca-Cola Company has a strict policy of informing the contractors of known potential hazards related to the contractor's work with the ammonia refrigeration system.  Contractors are also informed of all the procedures for emergency response should an accidental release of ammonia occur.\n\n\n\n5. Five-year Accident History\n\n\n\n     The facility has not experienced any ammonia releases in the past five years.\n\n \n\n6. Emergency Response Plan\n\n\n\n     The Coca-Cola Company Emergency Response Policy focuses on evacuation of the facility in the event of an ammonia emergency with local emergency response agencies performing all rescue, fire fighting, first-aid, medical treatment and other response functions.  The facility maintains a written Emergency Response Plan that documents specific procedures to be implemented in the event of various emergencies including an ammonia release.  The Emergency Response Plan includes procedures for facility evacuation, as well as for notification of the local emergency response agencies which are responsible for notifying the public.  The plan is promptly updated to reflect any per"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078528,
      "SummaryText": "tinent changes taking place within the facility that would require modified procedures.  \n\n\n\n     The Florida District 6 LEPC is the Local Emergency Planning Committee (LEPC ) with which our Emergency Response Plan has been coordinated.  The City of Apopka Fire Department is the primary emergency response agency for all facility emergencies including ammonia releases.\n\n\n\n7. Planned Changes to Improve Safety\n\n\n\n     The facility has no currently planned changes to the ammonia refrigeration system but will periodically assess opportunities to improve the safety of that system."
    }
  ]
}