{
  "FacilityID": 1000048060,
  "FacilityName": "Mt. Whitney Cold Storage",
  "FacilityStr1": "121 1st. St.",
  "FacilityStr2": null,
  "FacilityCity": "Exeter",
  "FacilityState": "CA",
  "FacilityZipCode": "93221",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.296058",
  "FacilityLongDecDegs": "-119.132164",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Exeter-Ivanhoe Citrus",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mt. Whitney Cold Storage",
  "OperatorStr1": "121 1st. St.",
  "OperatorStr2": null,
  "OperatorCity": "Exeter",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93221",
  "OperatorZipCodeExt": null,
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000228167",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-11-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-12-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-12-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060084,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000048060,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073555,
          "ProcessID": 1000060084,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000061206,
          "ProcessID": 1000060084,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000050019,
              "Process_NAICS_ID": 1000061206,
              "SafetyReviewDate": "2014-12-01 00:00:00",
              "PHA_Date": "2014-08-15 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-08-12 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-02-19 00:00:00",
              "TrainingReviewDate": "2014-12-08 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-12-08 00:00:00",
              "EquipmentInspectionDate": "2014-12-18 00:00:00",
              "EquipmentTested": "Daily Compressor Inspection",
              "ChangeMgmtDate": "2014-01-09 00:00:00",
              "ChangeMgmtReviewDate": "2014-12-08 00:00:00",
              "PreStartupReviewDate": "2014-01-16 00:00:00",
              "ComplianceAuditDate": "2013-04-26 00:00:00",
              "AuditCompletionDate": "2014-01-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-12-08 00:00:00",
              "HotWorkPermitReviewDate": "2014-12-08 00:00:00",
              "ContractorSafetyReviewDate": "2014-12-08 00:00:00",
              "ContractorSafetyEvalDate": "2014-02-19 00:00:00",
              "CBI_Flag": 0,
              "Description": "This program is intended to meet the spirit and intent of the California Accidental Release Prevention Program (CalARP), CCR Title 19, Chapter 4.5, the Federal EPA Risk Management Plan, 40 CFR, Part 68, the California Process Safety Management Program, CCR Title 8, Section 5189, and Federal Process Safety Management Program, 29 CFR, Part 1910.119, as enforced by the local Certified Unified Program Agency, Federal EPA, Cal-OSHA, and Federal OSHA. This program is intended to be a living document. As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Mt. Whitney Cold Storage has chosen to use the software package, PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with compliance and provide a more efficient method to manage our CalARP and RMP-PSM program elements and keep them up to date.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000060990,
                  "PreventionProgram3ID": 1000050019,
                  "ProcessChemicalID": 1000073555
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000048060,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Tulare County Environmental Health",
    "CoordinatingAgencyPhone": "5596247400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048060,
      "SummaryText": "1. Executive Summary\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n- California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Mt. Whitney Cold Storage has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 Mt. Whitney Cold Storage, Risk and Process Safety Management Program\n\n\n\nThis is to inform all interested persons, including employees, that Mt. Whitney Cold Storage has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following process which have the presence of hazardous chemicals above threshold quantities: \n\nProcess Name             | Process Chemical             | Process Quantity(lbs.)\n\nAmmonia Refrigeration      Anhydrous Ammonia              13,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\n\n\n\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1.Prepared a unified program based on the PSM regulati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048060,
      "SummaryText": "on to meet CalARP and RMP obligations as well\n\n2.Organized the program so that it meshes closely with general business practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Description\n\n\n\nMt. Whitney Cold Storage operates a commercial packing and storage facility for oranges in Exeter, CA. The facility has an ammonia system that provides refrigeration capacity to five (5) cold storage rooms and three (3) precool rooms. The rooms utilize bunker mounted evaporator coils that contain chilled liquid ammonia.\n\n\n\nThe system operates as follows: high pressure liquid from the high pressure receivers is piped to each cold room where it passes through an expansion valve into a low pressure accumulator vessel mounted behind the bunker wall.  Low temperature liquid circulates by thermal convection through the evaporator coils in the cold rooms.  Low pressure and temperature gas collects in the accumulator vessel, and passes through a pressure regulator into a suction line. The suction line returns the vapor to the main suction accumulators located in the engine rooms, which separates any residual liquid from the gas. The gas is piped to compressors which elevate the temperature and pressure of the gas.  The high pressure discharge from the compressors is sent to water cooled evaporative condensers where the high pressure gas ammonia is liquefied and returned to the high pressure receivers.\n\nThe system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to the atmosphere if the pressure in the system exceeds their set point.   \n\n\n\nThe ammonia system at Mt. Whitney Cold Storage's facility consists of vessels"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048060,
      "SummaryText": " and piping which are interconnected.  Therefore, the ammonia system is treated as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nMt. Whitney Cold Storage has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders.\n\n \n\n1.3.2 Anhydrous Ammonia\n\n\n\nThe ammonia refrigeration process at the Mt. Whitney Cold Storage facility is an integral part of the overall business and operates most of the year. It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep an active log book of all procedures and transactions that pertain to ammonia. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n \n\n1.4 Five Year Accident History\n\n\n\nMt. Whitney Cold Storage has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\n\n\nMt. Whitney Cold Storage's emergency action and response program has been developed to satisfy the following requirements:\n\n- California \"Emergency Action Plan\" - Title 8 CCR ?3220\n\n- Federal \"Emergency Action Plan\" - Title 29 CFR ?1910.38\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facili"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048060,
      "SummaryText": "ty. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nMt. Whitney Cold Storage has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Mt. Whitney Cold Storage continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Mt. Whitney Cold Storage's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Mt. Whitney Cold Storage's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nMt. Whitney Cold Storage has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Mt. Whitney Cold Storage has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\n\n\nFor the future, Mt. Whitney Cold Storage now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Mt. Whitney Cold Storage employees, but allows for feedback and continual improvement. Through the RMP-PSM program Mt. Whitney Col"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048060,
      "SummaryText": "d Storage will continue to maintain overall plant worker and public safety."
    }
  ]
}