{
  "FacilityID": 1000027467,
  "FacilityName": "Midwest Real Estate Holding, LLC",
  "FacilityStr1": "1301 Oak St.",
  "FacilityStr2": null,
  "FacilityCity": "Elwood",
  "FacilityState": "KS",
  "FacilityZipCode": "66024",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20043",
  "LEPC": "Doniphan County LEPC",
  "FacilityLatDecDegs": "39.7531775",
  "FacilityLongDecDegs": "-94.8837740",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6943062,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David Smith",
  "OperatorStr1": "1301 Oak Street",
  "OperatorStr2": null,
  "OperatorCity": "Elwood",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66024",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carson Dean",
  "RMPTitle": "Sr. EHS Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000217142",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-07 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-12-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000033533,
      "AltID": null,
      "FacilityID": 1000027467,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000033777,
          "ProcessID": 1000033533,
          "NAICSCode": "42441",
          "_desc": {
            "NAICS_CODE": "42441",
            "NAICS_DESCRIPTION": "General Line Grocery Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040539,
          "ProcessID": 1000033533,
          "ChemicalID": 56,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000540539,
          "ProcessID": 1000033533,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027467,
      "SummaryText": "Executive Summary\n\nA. Introduction\n\n \n\nThis Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68.  The stationary source is the ammonia refrigeration system owned and operated by Associated Wholesale Grocers, 8100 60th Street, Kenosha, WI 53144-7863. The only RMP regulated substance at this facility is anhydrous ammonia-which is classified as a highly hazardous chemical, liquefied under pressure.\n\n\n\nThis is an existing food distribution facility.  There is one ammonia refrigeration system at this facility with an inventory of 28,000 pounds of ammonia. The process does not meet the requirements of Program 1. It is subject to OSHA's PSM standard.  Therefore, this RMP is written to meet the EPA Program 3 level of compliance.\n\n\n\nThis facility has an excellent safety record with no deaths or serious injuries to plant personnel or contractors due to the RMP covered process. There have been no accidents in the past five years. The facility's safety record is a direct result of the emphasis placed on safety by management and employees alike.\n\n\n\n \n\nB. Accidental Release Prevention Policies and Program\n\n \n\nThis facility strives to meet or exceed compliance with state anhydrous ammonia regulations. The company's Environmental, Health & Safety staff provides technical assistance and performs safety and environmental audits on a regular basis. Training is provided for each new hire and re-hire employee and also on a monthly basis in the form of a monthly safety meetings. In addition to safety training, employees may be certified in First Aid and CPR. The anhydrous ammonia system and associated equipment are inspected annually following recommended industry and engineering frequencies. Associated Wholesale Grocers believes safety and environmental stewardship must be second nature to all employees and contractor personnel.\n\n \n\n \n\nC. Emergency Response Policies and Program\n\n \n\nEach employee is trained to be f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027467,
      "SummaryText": "amiliar with the emergency response policies and procedures through safety reviews and other safety meetings. This facility has an Emergency Plan which covers accidental releases, natural disasters, security incidents and other emergency response practices and procedures. The Emergency Plan for this facility is reviewed and updated on an annual basis as part of a comprehensive review process. The Emergency Plan for this facility includes specific instructions for employees regarding the response procedures to an emergency. Response procedures may differ by product depending on the qualifications of the personnel and equipment available onsite. The procedures provided in the Emergency Plan are shared with all employees and followed in the event of an emergency. Employees are provided refresher training on emergency response on an annual basis. The local emergency planning committee and fire department personnel are furnished a copy of the Emergency Plan for this facility and invited for a tour on a regular basis.\n\n \n\n \n\nD. Worst-Case Scenario/Alternative-Case Scenario \n\n \n\nThis facility has developed a worst-case and alternative-case scenario however it has been withheld from this Executive Summary as security-sensitive information as requested by EPA. \n\n \n\n \n\nE. Five Year Accident History\n\n \n\nThis facility has an excellent safety record with no deaths or serious injuries to any of it's personnel or contractors as a result of the RMP covered process. In addition, there have been no accidents resulting in releases of anhydrous ammonia with off-site consequences during the entire operation period. Extensive programs and procedures are in place to maintain this record.\n\n \n\n \n\nF. Planned Changes to Improve Safety\n\n \n\nAssociated Wholesale Grocers continuously look for ways to enhance the safety of this location. Monthly safety inspections are conducted which result in corrective actions; annual equipment inspections are also conducted, and detailed Compliance Audits are c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027467,
      "SummaryText": "onducted at least every three years. Employees from each facility participate in a safe installation, repair and maintenance of anhydrous ammonia equipment training course.\n\n \n\n \n\nG. Summary\n\n \n\nThe employees of Associated Wholesale Grocers are extremely proud of our safety record and vast improvements made in both environmental stewardship and safety over the last ninety years. We believe with our programs and policies in place and with the continued efforts of our personnel, we will maintain our safety record and our safe facility environment for the public, our customers and our employees for years to come.\n\n"
    }
  ]
}