{
  "FacilityID": 1000079557,
  "FacilityName": "Memphis Cellulose LLC",
  "FacilityStr1": "1001 Tillman Street",
  "FacilityStr2": null,
  "FacilityCity": "Memphis",
  "FacilityState": "TN",
  "FacilityZipCode": "38112",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47157",
  "LEPC": "Shelby County LEPC",
  "FacilityLatDecDegs": "35.158308",
  "FacilityLongDecDegs": "-089.963953",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.gp.com",
  "FacilityEmailAddress": "katherine.terry@gapac.com",
  "FacilityDUNS": 798318028,
  "ParentCompanyName": "Georgia-Pacific LLC",
  "Company2Name": null,
  "CompanyDUNS": 9020777,
  "Company2DUNS": 0,
  "OperatorName": "Memphis Cellulose LLC",
  "OperatorStr1": "1001 Tillman Street",
  "OperatorStr2": null,
  "OperatorCity": "Memphis",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38112",
  "OperatorZipCodeExt": null,
  "RMPContact": "Thomas D. Blaylock",
  "RMPTitle": "Mill Manager",
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050366",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "00055-01TV",
  "SafetyInspectionDate": "2018-10-31 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-29 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.15875,
  "FRS_Long": -89.96017,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "13.7",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099246,
      "AltID": "Chlorine System",
      "FacilityID": 1000079557,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100486,
          "ProcessID": 1000099246,
          "NAICSCode": "32211",
          "_desc": {
            "NAICS_CODE": "32211",
            "NAICS_DESCRIPTION": "Pulp Mills"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124368,
          "ProcessID": 1000099246,
          "ChemicalID": 62,
          "Quantity": 360000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624368,
          "ProcessID": 1000099246,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079557,
      "SummaryText": "1.0    Executive Summary \n\n1.1    ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY\n\nMemphis Cellulose LLC (Memphis Cellulose) is committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner. We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment. This Executive Summary provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n?    A description of Memphis Cellulose and the use of chlorine, which is regulated by EPA's RMP regulation,\n\n?    An overview of our accidental release prevention programs,\n\n?    A five-year accident history for accidental releases of chlorine,\n\n?    An overview of our emergency response programs,\n\n?    An overview of planned improvements at the Memphis Cellulose to help prevent accidental chlorine releases from occurring and adversely affecting our employees, the public, and the environment,\n\n?    The certification that EPA's RMP rule requires us to provide, and,\n\n?    The detailed information (called data elements) about our risk management program.\n\n\n\n1.2    STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nMemphis Cellulose produces purified alpha cellulose from cotton fibers (linters). The Memphis Cellulose production process is composed of three principal areas: 1) physical cleaning, which includes cotton lint receiving and unloading, lint charging, beater systems, hydropulping, refining and a slushing; 2) chemical cleaning, which includes digesting, bleaching and sour stock preparation, and 3) cellulose production, which includes preparation, drying and packaging of cellulose.  In addition, boilers provide steam to the chemical cleaning and finishing operations.  \n\nIn our processes, we use the following chemicals that EPA has identified as having the potential to cause sign"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079557,
      "SummaryText": "ificant off-site consequences in the unlikely event of a substantial accidental release:\n\n?    Toxics- Chlorine is stored on-site in up to two 90-ton rail cars. This chemical is used to brighten the cotton linter cellulose.\n\nOur accidental release prevention programs and our contingency planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of this chemical.\n\nMemphis Cellulose does not use any RMP-regulated flammable chemicals.\n\n\n\n1.3    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nMemphis Cellulose takes a systematic, proactive approach to preventing accidental releases of hazardous chemicals. Our management systems address each of the key features of successful prevention programs including:\n\n?    Process Safety Information\n\n?    Process Hazard Analysis\n\n?    Operating Procedures\n\n?    Training\n\n?    Mechanical Integrity\n\n?    Management of Change\n\n?    Pre-Startup Safety Review\n\n?    Compliance Audits\n\n?    Incident Investigations\n\n?    Employee Participation\n\n?    Hot Work & Safe Work Permitting\n\n?    Contractor Safety\n\nAs part of our prevention efforts, we have implemented the following chemical-specific prevention steps for chlorine:\n\n1.    Chlorine Railcar Staging\n\na.    Derailers, chocks, and sign placements to prevent accidental movement\n\nb.    Unloading site that is specifically designed for chlorine unloading\n\nc.    Video monitoring of unloading area\n\nd.    Automated railcar valve closure system\n\ne.    Enhanced security features to improve the overall security of the rail car unloading station.\n\n2.    Hose and Gasket Leaks\n\na.    Written Integrity Testing and Preventive Maintenance Program\n\nb.    Color-coded lines and tagging system\n\nc.    Chlorine sensors that alarm on detection of chlorine vapor\n\nd.    Video monitoring of railcar continuously\n\ne.    Excess flow prevention valves that close if there is a rupture down stream\n\nf.    Unique fittings prevent improper connections\n\ng.    Daily Preventive Maintenance Checks of "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079557,
      "SummaryText": "unloading system\n\nh.    Numerous interlocks and redundant valves\n\ni.    Annual change out of chlorine unloading hoses to add an extra layer of process safety protection against premature hose ruptures.\n\n3.    Training \n\na.    Maintenance & Operating personnel trained on procedures specific to chlorine\n\ni.    Specific Skill Blocks for advancement\n\nii.    Testing & Certification process\n\niii.    Work Instructions give specific step-by-step procedures\n\niv.    Job Plans developed for non-routine maintenance\n\nb.    All Plant employees given periodic Chlorine Awareness training and Emergency Response/Evacuation training\n\nc.    Site-specific training for Memphis Fire Department Hazardous Materials Teams to ensure that they are aware of our process in the event there is a need for them to assist.\n\n4.    Inspections\n\na.    Routine inspections by Department of Transportation\n\nb.    Daily maintenance checks\n\nc.    Daily operational rounds\n\nd.    Routine preventive maintenance in work order system, including annual hose and rupture disc replacements\n\n5.    Emergency Response\n\na.    Emergency Action Plan\n\ni.    Periodic drills, test notifications, response procedures, and evacuation procedures\n\nii.    Safety training on emergency evacuation and shelter-in-place procedures\n\niii.    Daily computerized alarm tests by Memphis Cellulose\n\nb.    Principally Based Operation and Maintenance Procedures\n\ni.    Procedures for the prevention of chlorine releases\n\nii.    Procedures for the control of chlorine releases\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\n\n1.4    FIVE-YEAR ACCIDENT HISTORY\n\nWe keep records for all significant accidental chemical releases that occur at our facility. The following is a brief summary of accidental chemical releases i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079557,
      "SummaryText": "nvolving materials covered under EPA's RMP rule during the past five years.\n\nAccidental releases, as defined in 40 CFR 68.42(a), are those \"from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. Memphis Cellulose has had no releases during the past five years that were significant or met these reporting criteria.\n\nFor all incidents, non-reportable releases, or non-routine events, we conduct formal incident investigations to identify and correct the root causes.\n\n1.5    EMERGENCY RESPONSE PROGRAM\n\nOur program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations. Furthermore, we coordinate our Emergency Action Plan with the community emergency response plans, including the Memphis/Shelby County LEPC and the Memphis Fire Department HAZMAT Response Team. Joint training and drills have been conducted with each of these response agencies. Our Emergency Action Plan includes procedures for:\n\n?    Notifying the Memphis/Shelby County LEPC/EMA, Memphis Fire Department, and the surrounding community of an accidental release that could have off-site consequences,\n\n?    Safely evacuating employees, contractors, and visitors,\n\n?    Inspecting and maintaining emergency response equipment,\n\n?    Maintaining a secure perimeter around the release area, and\n\n?    Treating individuals exposed to the release.\n\nFurther, we have implemented a series of Principally Based Operation and Maintenance Procedures (PBOMP) which provide specific and detailed actions for the prevention and control of chlorine releases at the facility.\n\n1.6    PLANNED CHANGES TO IMPROVE SAFETY\n\nMemphis Cellulose has made several process safety improvements since the last revision. We have several programs designed to review, audit, and test equipment and procedures. These programs function to continu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079557,
      "SummaryText": "ally assess and improve hazardous systems. Initiatives are underway to revise the Process Hazard Analysis and to evaluate and implement appropriate recommendations from the internal Compliance Audit.\n\n5/29/2019\n\n"
    }
  ]
}