{
  "FacilityID": 1000088963,
  "FacilityName": "Holmen Cheese LLC.",
  "FacilityStr1": "1775 Granary St.",
  "FacilityStr2": null,
  "FacilityCity": "Holmen",
  "FacilityState": "WI",
  "FacilityZipCode": "54636",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55063",
  "LEPC": "La Crosse County LEPC",
  "FacilityLatDecDegs": "44.021",
  "FacilityLongDecDegs": "-91.1738",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": "W141N9501 Fountain Boulevard",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Holmen Cheese LLC.",
  "OperatorStr1": "1775 Granary Street",
  "OperatorStr2": null,
  "OperatorCity": "Holmen",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54636",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lance Giebel",
  "RMPTitle": "Facility Maintenance Director",
  "FTE": 80,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000244568",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-07-29 00:00:00",
  "SafetyInspectionBy": "Process Safety Analysis on entire ammonia system",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-08-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-08-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-08-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-08-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110722,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000088963,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000112013,
          "ProcessID": 1000110722,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000138355,
          "ProcessID": 1000110722,
          "ChemicalID": 56,
          "Quantity": 11700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000638355,
          "ProcessID": 1000110722,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000088963,
      "SummaryText": "Holmen Cheese LLC. RMP EXECUTIVE SUMMARY\n\nDescription of the Stationary Source and Regulated Substances\n\nHolmen Cheese LLC, located at 1775 Granary Street, Holmen, WI 54636 is a processed cheese producer.\n\nAt this facility, anhydrous ammonia (cas #7664-41-7) is used as a refrigerant to cool processed cheese for storage and processing. The refrigeration process at this facility is comprised of one closed-loop, mechanical refrigeration system. Liquid ammonia is supplied by pumps or pressure differential to the evaporators, roof-top RMAUs, vessels, and heat exchangers. Ammonia vapor and liquid from the process equipment returns to the recirculator. The normal high-side operating pressure ranges from 120 to 190 psig. The maximum allowable high side working pressure is 300 psig.\n\nAs part of the PSM program, Holmen Cheese has completed a Process Hazard Analysis, developed written operating procedures, trained employees on awareness and system operation, established procedures to conduct Management of Change procedures and Pre-Startup Safety Reviews, and developed a Mechanical Integrity program for ammonia refrigeration equipment. In addition to the daily monitoring of the refrigeration process, Holmen Cheese has implemented an ongoing Preventive Maintenance program to ensure the refrigeration equipment and safety systems are maintained in good operating condition.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nA PSM program, which meets the requirements of the RMP general accidental release prevention program, is being implemented by Holmen Cheese to address the anhydrous ammonia refrigeration system at the Holmen, WI facility. The PSM program developed and implemented at Holmen Cheese includes the following steps:\n\nManagement System: Designates individuals responsible for implementing, maintaining, and conducting the various duties associated with the PSM program; to ensure it stays current and effectively, protects the employees, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000088963,
      "SummaryText": "the business, and the community.\n\nWritten plans for implementing Employee Participation in PSM.\n\nProcess Safety Information: Information pertaining to the hazards of ammonia, the technology of the process and the equipment in the process. \n\nProcess Hazard Analysis (PHA): A PHA review of the ammonia refrigeration process was conducted to identify hazards and safeguards pertaining to the ammonia refrigeration system.\n\nOperating procedures were developed and implemented for the safe operation of the ammonia refrigeration system.\n\nSafe work practices were developed and implemented for lockout/tagout, confined space and opening equipment and piping (Line-Breaking Procedures). \n\nA Mechanical Integrity program is being implemented to maintain the on-going integrity and safety of the refrigeration system, including application of the following industry codes and standards: \n\nASME Boiler & Pressure Valve Codes\n\nANSI B31.5 Piping Code\n\nANSI/IIAR 2 American National Standard for Equipment, Design, and Installation of Closed-Circuit Ammonia Mechanical Refrigerating Systems\n\nANSI/ASHRAE Standard 15\n\nNFPA guidelines for fire protection equipment\n\nA Management of Change (MOC) program and procedures were developed to address all proposed changes to the refrigeration system.\n\nPre-startup Safety Review (PSSR) procedures were developed.\n\nA detailed Compliance Audit checklist is used to evaluate compliance with the Process Safety Management and Risk Management programs every three years.\n\nDeveloped Incident Investigation procedures to analyze and review accidents or near-misses involving the refrigeration system.\n\nEstablished Hot Work Permit system.\n\nDeveloped and implemented a program to evaluate contractors and contractor employees. \n\n\n\nFive-Year Accident History\n\nHolmen Cheese was a brand new facility in 2020 and at the time of the initial filing of the RMP, never had an accidental release from the ammonia refrigeration system that caused deaths, injuries, or significant property da"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000088963,
      "SummaryText": "mage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage within the last five years.\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmergency Response Program\n\nHolmen Cheese's employees have not been trained to be Emergency Responders and will not respond to emergency ammonia releases; however, the system can be shut down by activating one of the EMERGENCY STOP (E-STOP) switches located outside the Engine Room doors. An Emergency Action Plan (EAP) has been developed that includes coordination with local, county, state, and national responders. Procedures for employees to follow in the event of an accidental release of ammonia and a list of emergency phone numbers have been developed and posted where employees can access the list. Employees have been trained on the EAP and drills are practiced at least annually. \n\n\n\nPlanned Changes to Improve Safety\n\nThrough the accidental release prevention program, Holmen Cheese LLC, regularly evaluates the need for any changes to improve safety. Currently, Holmen Cheese is a brand-new facility and all equipment and safeties meet, or exceed, current codes. \n\n"
    }
  ]
}