{
  "FacilityID": 1000056421,
  "FacilityName": "Proctor Terminal Company Ltd.",
  "FacilityStr1": "5406 St. Louis River Road",
  "FacilityStr2": null,
  "FacilityCity": "Duluth",
  "FacilityState": "MN",
  "FacilityZipCode": "55810",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27137",
  "LEPC": null,
  "FacilityLatDecDegs": "46.762878",
  "FacilityLongDecDegs": "-92.250075",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "http://www.nglsupply.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "NGL Supply Terminals Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "NGL Supply Terminals Company Ltd",
  "OperatorStr1": "Suite 720 South Colorado Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80246",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000232241",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-01-28 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-04-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-04-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-04-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-04-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 46.762878,
  "FRS_Long": -92.250075,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": ".813",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000070459,
      "AltID": "LPG Wholesale",
      "FacilityID": 1000056421,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087045,
          "ProcessID": 1000070459,
          "ChemicalID": 98,
          "Quantity": 3000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000071660,
          "ProcessID": 1000070459,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000058951,
              "Process_NAICS_ID": 1000071660,
              "SafetyReviewDate": "2016-02-11 00:00:00",
              "PHA_Date": "2015-11-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-02-11 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Hydrocarbon detectors, transfer query system",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Engineering Controls: Automatic shutdown, pneumatically actuated isolation valves with thermal fuses, specialized hose assemblies, gas detectors, regular inspection and maintenance",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Note this was the first PHA",
              "OpProceduresReviewDate": "2016-01-20 00:00:00",
              "TrainingReviewDate": "2016-01-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "NPGA CETP",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-01-20 00:00:00",
              "EquipmentInspectionDate": "2016-02-11 00:00:00",
              "EquipmentTested": "Terminal was commissioned Feb 11 2016 - All equipment was inspector or new",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2016-01-20 00:00:00",
              "PreStartupReviewDate": "2016-01-06 00:00:00",
              "ComplianceAuditDate": "2016-01-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-01-20 00:00:00",
              "HotWorkPermitReviewDate": "2016-01-20 00:00:00",
              "ContractorSafetyReviewDate": "2016-01-20 00:00:00",
              "ContractorSafetyEvalDate": "2016-01-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000072290,
                  "PreventionProgram3ID": 1000058951,
                  "ProcessChemicalID": 1000087045
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000056421,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-01-20 00:00:00",
    "ERTrainingDate": "2016-01-28 00:00:00",
    "CoordinatingAgencyName": "Proctor Fire Department",
    "CoordinatingAgencyPhone": "2186243641",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000056421,
      "SummaryText": "ll drivers must have completed the necessary CTEP courses to transfer propane as well as be trained in the site specific transfer and emergency procedures.  Only approved drivers will be able to perform loading operations at the facility. Records of personnel, driver, and contractor training are kept on file.\r\n¿\tOperating procedures: detailed operating guidelines and procedures are maintained for truck loading, railcar unloading, product transfer, as well as emergency procedures.  These procedures are reviewed on a regular basis.\r\n¿\tMaintenance procedures: regular maintenance and inspections of emergency and operational equipment are carried out by terminal personnel at predetermined intervals as designated in the operating guidelines to ensure all equipment is in proper condition.\r\n¿\tIncident reporting: the facility has a policy in place for documenting and reporting any incidents or potential hazards. All reports are reviewed and corrective action taken as required.\r\nPlanned changes to improve safety:  Terminal and company management seek continuous improvement of operational and safety systems to minimize the risk of incidents, injuries and propane releases. This includes the ongoing training of personnel and the review and maintenance of operating guidelines and emergency procedures. Processes, procedures and facilities will be reviewed regularly and appropriate improvements to safety and operational systems will be implemented as required."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000056421,
      "SummaryText": "alarm, and notify terminal personnel.\r\n¿\tNormally-closed pneumatic valves: these valves are installed in all tank openings and at all product transfer points. These valves remain closed unless a propane transfer operation is being conducted by authorized personnel.\r\n¿\tHeat sensitive (thermal) devices:  the pneumatically operated control valves at the tank openings and at loading points are equipped with fuse plugs which will melt if a fire occurs causing the control valves to close automatically, minimizing possible product loss and isolating the tanks and shutting down loading/unloading points .\r\n¿\tFire extinguishers: these are located throughout the facility to assist in suppressing a small fire.\r\n¿\tQuery System: the driver or terminal operator must be in attendance during any propane transfer operation. The query system will periodically prompt the attendant to ensure they are present and alert; if no response is received, the query system will automatically shut down the transfer and activate the emergency stop system.\r\n¿\tGas Detectors: in the unlikely event of a propane gas leak or gas release, hydrocarbon detectors are strategically located and will sound an alarm and activate the emergency stop system when a specific threshold level of gas is detected in the air.  The threshold levels are well below the minimum air-fuel mixture concentrations required for combustion.\r\n¿\tHose assemblies with rupture protection: the transfer hoses are equipped with an internal spring and closing flapper valves at both ends which will close the hose ends during a hose rupture or pull-away event, to greatly reduce product loss.\r\n¿\tTraining requirements: terminal operators have several training requirements that they must complete including having a record of training for completing propane specific Certified Employee Training Program (CETP) courses as designated by the National Propane Gas Association (NPGA). They must also receive training for terminal emergency procedures. A"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056421,
      "SummaryText": "ents of an emergency including facility shutdown, alerting local emergency services, and evacuation. In the event of an emergency, the typical response would be through 911. Terminal personnel or emergency responders may contact CHEMTREC to request information and recommendations for emergency response measures.  The emergency response plans have been coordinated with the fire department; members of the Fire Department have visited the propane facility and have reviewed the safety systems in place. The Fire Department has been given a map showing the public receptors within the hazard distance in the event of an evacuation exercise.  Emergency response equipment is inspected and tested regularly to ensure proper function.  The emergency response procedures are re-evaluated on a regular basis, as well as tested annually.\r\n\r\nOperational and process safety systems:  The facility has been designed with industry leading failsafe systems and practices to mitigate the severity of any incident involving propane.  These safety systems and practices include:\r\n¿\tRestricted access: the terminal is equipped with 6' high fencing with 3 strands of barbed wire. An automated access gate allows entrance to authorized personnel only via a PIN Pad or transponder; hand scanners and PIN numbers provide further restrictions to load product at the terminal.\r\n¿\tSafety information: signage is posted throughout the facility to remind occupants to avoid hazards such as smoking and creating sources of ignition, as well as wear proper safety equipment including fire resistant clothing.  Operating procedures and emergency response procedures and phone numbers are also posted and reviewed with personnel.\r\n¿\tManual and electronic shutdown: the emergency stop system can be activated by pressing any of the emergency stop buttons, or by the terminal operator's remote controller that they carry at all times. The emergency stop system will shut down the entire facility, close all tank openings, sound an"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056421,
      "SummaryText": "The accidental release prevention and emergency response policies at your facility: Safety of the public and environment as well as the safety of their own employees is top priority. The facility complies with the NFPA 58-2011 requirements for LP-Gas storage facilities as adopted by the Minnesota State Register. Additionally, the facility complies with applicable federal and local laws with respect to the safe handling of propane. The facility meets or exceeds the requirements of the codes and laws with its practices and design to ensure there is minimal risk of an accidental release. If an emergency were to occur, procedures are in place to notify the local Fire Department and request that they respond to the emergency. The terminal has a registered emergency response plan with CHEMTREC that provides information and assistance in the event of an emergency. There is also a 24-hour company emergency number that can assist with coordinating emergency responders and recommend courses of action in emergency scenarios.\r\n\r\nA description of your facility and the regulated substances handled:  a wholesale propane distribution terminal for storage and distribution of propane to propane marketers. The facility consists of eight 30,000-gallon tanks with associated loading and unloading equipment. Propane (UN 1075) is classified as a flammable gas. Propane is received in rail tank cars that are unloaded at the facility using compressors. Propane is loaded into customer truck transports using the facility's pumping and metering equipment. The facility also transfers propane using a pump and meter to an adjacent facility.\r\n\r\nThe worst-case and alternative release scenarios:  The worst case scenario, as defined by the EPA, is the failure of one 30,000-gallon storage tank when filled to the greatest amount allowed (88% at 60°F), resulting in a vapor cloud explosion. The resulting distance to the endpoint extends offsite, and public receptors are within the distance to the endpoint."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056421,
      "SummaryText": "The alternative release scenario, as determined by the Potential Failure Modes and Effects Analysis (PFMEA) a quantitative study of all potential hazards, is a break in a 4 inch diameter pipe leading to a 10-minute release and explosion. The team performing the PFMEA consisted of a group of management and engineers with experience in the design, operation, and maintenance of propane facilities.  Equation C-1 from the EPA's RMP Guidance for Offsite Consequence Analysis was used to determine the hazard distance for the worst case scenario for determination of the public receptors.\r\nAs well, a third party engineering company has conducted a quantitative risk assessment and layer of protection analysis of the worst case and alternative case scenarios. The analyses determined that the location risk for each of the public receptors were acceptable according to the 2008 modified Major Industrial Accidents Council of Canada (MIACC) Guidelines created by the Canadian Society for Chemical Engineering, Process Safety Management Division for risk acceptability criteria. The MIACC guidelines are acceptable risk criteria published in numerous jurisdictions including the United Kingdom, Netherlands, Australia, and Canada.\r\n \r\nThe general accidental release prevention program and chemical-specific prevention steps:  The facility complies with the EPA's accident prevention rule as per 40 CFR Part 68, the OSHA PSM standard, and all applicable state and local codes and regulations. The propane system is designed, installed, and maintained in accordance with state laws adopting NFPA 58-2011.  \r\nFive-year accident history:  The Proctor Terminal propane facility has never had an accident involving propane that caused deaths, injuries, property or environmental damage, evacuations, or dwellings in place. \r\n\r\nThe emergency response program:  All personnel, drivers, and contractors receive emergency response procedures training before being allowed on site.  The procedures cover all compon"
    }
  ]
}