{
  "FacilityID": 1000046562,
  "FacilityName": "Taylor Farms Retail, Inc.",
  "FacilityStr1": "100 Puente Del Monte Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Gonzales",
  "FacilityState": "CA",
  "FacilityZipCode": "93926",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.501389",
  "FacilityLongDecDegs": "-121.446944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 840735687,
  "ParentCompanyName": "Taylor Farms Fresh Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Taylor Farms Retail, Inc.",
  "OperatorStr1": "100 Puente Del Monte Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Gonzales",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93926",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jerrett Stoffel",
  "RMPTitle": "Chief Operating Officer",
  "FTE": 200,
  "OtherEPAFacilityID": "CAL000334430",
  "EPAFacilityID": "100000188637",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-02-26 00:00:00",
  "SafetyInspectionBy": "Monterey County - CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-05-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-09-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-09-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-09-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058036,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000046562,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000058964,
          "ProcessID": 1000058036,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 1000058965,
          "ProcessID": 1000058036,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070915,
          "ProcessID": 1000058036,
          "ChemicalID": 56,
          "Quantity": 64700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000570915,
          "ProcessID": 1000058036,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046562,
      "SummaryText": "SCOPE\n\nThe EPA RMP and CalARP RMP regulations requires that an Executive Summary be provided as part of the registration submitted to the EPA and to the CalARP CUPA.  The following areas are addressed in this summary:\n\nA?Accidental Release Prevention and Emergency Response Policies\n\nA?Stationary Source Activities and Regulated Substances Handled\n\nA?Worst-Case and Alternative-Case Release Scenarios\n\nA?Prevention Program\n\nA?Five-Year Accident History\n\nA?Emergency Response Program\n\nA?Planned Changes to Improve Safety\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nTaylor Farms is committed to complying with all of the regulatory requirements of the EPA Risk Management Program and the California Accidental Release Prevention Program. Taylor Farms has developed their Risk Management Plan / Process Safety Management (RMP/PSM) Manual to document Taylor Farms policies addressing the implementation of these regulations.  The PSM sections pertain to the prevention of accidental releases and include the Process Hazard Analysis study and procedures for operating, training, maintenance and others. The RMP sections pertain to management systems and emergency response and include the Hazard Assessment (Offsite Consequence Analysis) Report.\n\n\n\n\n\nSTATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\n\nThe Taylor Farms Gonzales facility provides product cooling, processing and short-term storage for fresh vegetables.  This processing includes cooling, cleaning, cutting and packaging vegetables. \n\n\n\nThe facility is located in a rural/industrial area of Gonzales. Ammonia is used as the refrigerant in the Main Refrigeration System (\"System\"). This is a direct, mechanical refrigeration system, which was built and started up in 2004 by the previous owner/operator (specifically - Foxy Foods, LLC). The ammonia equipment is located inside and outside.\n\n\n\nWORST-CASE SCENARIO ANALYSIS\n\n\n\nHAZARD ASSESSMENT \n\nThe regulation requires that the Worst-Case Release Scenario u"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046562,
      "SummaryText": "se the ammonia quantity in the largest vessel or pipe.\n\n\n\nNOTE: It is important to consider that the Worst-Case Scenario is extremely unlikely to occur since this scenario does not consider any safety features of the system - in either design or operation.  The scenario parameters are established by the regulation to provide uniformity for dialog between the industry, community, and regulatory agencies.\n\n\n\nThe regulation allows the facility to select the Alternate-Case Scenario.\n\n \n\nPREVENTION PROGRAM\n\n\n\nTaylor Farms Prevention Program is described in the RMP/PSM Manual.  The RMP Prevention Program is equivalent to OSHA's Process Safety Management Program (PSM).  The Prevention Program implemented by Taylor Farms is essential to help prevent releases and to minimize the effects if a release does occur.\n\nKey objectives of Taylor Farms Prevention Program are briefly described below:\n\n\n\n1.Maintain current and complete refrigeration system technical information. (Addressed under the Process Safety Information chapter)\n\n2.Thorough team evaluation of the refrigeration system.  The evaluation considers a number of potential problems including: mechanical problems, human errors, and external events (e.g., earthquakes).  All safety recommendations developed by the team are reviewed and addressed by Taylor Farms.  (Addressed under Process Hazard Analysis chapter.)\n\n3.Written procedures and policies that establish how the refrigeration system should be operated and maintained and how to investigate accidental releases. (Addressed under Operating Procedures, Mechanical Integrity, and Incident Investigation chapters.)\n\n4.Certification of refrigeration operators to safely operate the refrigeration system.  Taylor Farms certifies operators following completion of operator training and Taylor Farms confirmation of the operator's ability apply what they have learned.  (Addressed under Training chapter.)\n\n5.Employee involvement in the Prevention Program.  This is addressed on two lev"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046562,
      "SummaryText": "els.  First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Process Hazard Analysis study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.).  This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to-day activities.  \n\nSecond, all Taylor Farms employees (direct hires and contract) at this facility receive ammonia awareness training.  Additionally, they have access to the RMP/PSM information.  These activities improve the overall safety of the employees. (Both levels are addressed under Employee Participation chapter)\n\n6.    Implementation of additional measures when changes are planned  (procedural or mechanical).  These measures begin before any changes are made and may include a Process Hazard Analysis, operator training, and Process Safety Information updates plus other measures required by Taylor FarmsA? Management of Change Procedure.  \n\nIf a mechanical change is required and for maintenance contracts, Taylor Farms has a procedure for selecting a contractor based on the company's experience and safety history. Additionally, if welding, grinding, or other \"Hot Work\" occurs close to the refrigeration system, a Taylor Farms Hot Work permit is required.  The purpose of the permit and the associated Hot Work procedure is to minimize the possible of a fire. \n\nFollowing completion of a mechanical change, a pre-startup safety review is required before the system can be started. (These areas are addressed under Management of Change, Contractor Qualifications, Hot Work Permit, and Pre-Start-up Safety Review chapters.)\n\n7.Verification of Taylor Farms compliance with the RMP/PSM program.  This self-audit process is an important tool to confirm whether each of the elements in the Prevention Program  (and the Risk Management Program) has been implemented and properly documented by Taylor Farms personnel.  Taylor Farms has estab"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046562,
      "SummaryText": "lished a Management System procedure to address any shortcomings, which the audit may find. (Addressed under Compliance Audit chapter.)   \n\n8.Minimize employee injury and illness.  (Addressed under Taylor FarmsA? Illness and Injury Prevention Program.)\n\n\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Taylor Farms facility has no reportable accidental ammonia releases in the last five years.\n\n\n\n  \n\nEMERGENCY RESPONSE PROGRAM\n\nTaylor Farms Emergency Response Program is described in their Emergency Response Plan for the Gonzales facility.\n\n\n\nThis plan includes procedures for evacuations, notifying responders and governmental agencies.  The plan also includes first aid procedures for immediate care and instructions for follow-up medical care when necessary.   The plan addresses training requirements for employees including production employees, supervisors, managers, and operators.  Evacuation drills are an important part of the training. \n\nUnder Taylor FarmsA? Emergency Response policy, Taylor Farms employees who have been trained as \"First Responders\" may initially respond to releases that can be addressed without entering the danger area (i.e. de-energizing equipment).  Taylor Farms will evacuate affected area, begin notification process and rely on off-site responders (e.g., the fire department and/or refrigeration contractor).\n\n\n\n \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazard Analysis (PHA) study team developed recommendations to improve safety and to reduce the possibility of a release.\n\nKey recommendations identified during study included;\n\n\n\n    Improve roof access and add a second access?    \n\n        Define written PM Schedule, including A?failA? test of safety systems    \n\n        Establish SOP's for the new additional written procedures, including safe work practices and maintenance procedures\n\n?       Develop confine space policy and confirm all confined spaces are posted as such\n\n        Add new HPR auto shut-off for new receiver\n\n        Added new PLC controller for ne"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000046562,
      "SummaryText": "w air units\n\n        Added additional eyewash units\n\n        Reviewed all current and new SOP's for all system equipment\n\n        Preformed 5 Year PHA for existing system and new ammonia system \n\n \n\n\n\nImplementation of the measures has begun according to the schedule set by Taylor Farms."
    }
  ]
}