{
  "FacilityID": 1000042027,
  "FacilityName": "City of Fort Morgan Water Treatment Plant",
  "FacilityStr1": "14625 Rd. 8",
  "FacilityStr2": null,
  "FacilityCity": "Wiggins",
  "FacilityState": "CO",
  "FacilityZipCode": "80654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08087",
  "LEPC": "Morgan County LEPC",
  "FacilityLatDecDegs": "40.211961",
  "FacilityLongDecDegs": "-104.004254",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "OT",
  "FacilityURL": "www.cityoffortmorgan.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 10620227,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Eleazar Ocanas",
  "OperatorStr1": "14625 Rd. 8",
  "OperatorStr2": null,
  "OperatorCity": "Wiggins",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80654",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eleazar Ocanas",
  "RMPTitle": "Water Treatment Superintendent",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000163761",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-10-26 00:00:00",
  "SafetyInspectionBy": "CIRSA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.1744,
  "FRS_Long": -104.0511,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS BLOCK/TRACT-1990-CENTROID",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051784,
      "AltID": "Chlorine",
      "FacilityID": 1000042027,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000052372,
          "ProcessID": 1000051784,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062831,
          "ProcessID": 1000051784,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562831,
          "ProcessID": 1000051784,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042027,
      "SummaryText": "The City of Fort Morgan operates a ten million gallon per day water treatment plant. The Risk Management Plan (RMP) covers the section 112r regulated substance maintained at the Fort Morgan Water Treatment Plant which will be referred to herein as the plant.\n\n\n\nPlant description\n\nThe plant maintains only one regulated substance on site chlorine. The maximum possible chlorine storage is 14,000 pounds, which exceeds the RMP threshold quantity of 2,500 pounds. The storage and management of chlorine in addressed in this RMP.\n\n\n\nThe plant is located at 14625 Rd. 8 Wiggins, Colorado which is in a rural area. The surrounding area has very few obstructions.\n\n\n\nThe worst case scenario\n\nThe worst case scenario for chlorine was calculated as the release of a single one-ton cylinder in accordance with the definition provided in the Environmental Protection Agency guidance for RMP development. The chlorine storage is enclosed, so the building acts as a passive mitigation measure for the worst case release. The area of potential impact was determined using RMP*Comp, modeling software developed by the EPA.\n\n\n\nAlternate Release Scenario\n\nThe alternate release scenario is, by definition, a more likely release scenario than the worst case. The type of system failure selected for the alternate release was the loss of chlorine due to the rupture of both diaphragms in the vacuum regulator. The chlorine would leak from a half inch opening. The leak would continue until the chlorine detection alarm sounded and the the valve on the cylinder was closed. The Fort Morgan Fire Department would respond to the leak. The time for the response is estimated at 25 minutes. The fire response personal would enter the chlorine area in protective clothing and close the valve on the leaking cylinder.\n\n\n\nProcess Hazard Assessment\n\nA process hazard assessment was performed on the chlorine system beginning with the cylinder unloading ending with the chlorine in solution. A check list and a modified \"What if"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042027,
      "SummaryText": " \" analysis was used. General questions re guarding the storage and use areas as well as protocols for the management of the chlorination equipment were answered. Following the checklist, each valve, line and piece of equipment in the system was assessed from the cylinder to the point of chlorine injection using a system flow diagram. The valves and other points in the system where chlorine could be released are shown on the flow diagram.  Compliance with code requirements, potential failures, maintenance and inspection concerns, and standard operating procedures were reviewed for each point in the system.\n\n\n\nPrevention system\n\nThe plant has a preventive maintenance program designed to review the operation of the mechanical equipment linked to the chlorination system. There are O/M manuals for each piece of equipment and operators are trained before being allowed to work on such equipment. \n\n\n\nBefore each cylinder is put into service and after and all necessary connections are made valves and piping are tested for leaks. There are standard operating procedures (SOPs) for start-up, shutdown, normal operation, and emergency operation. The written SOPS are stored in the operations control room. Personnel are trained on the safety concerns and general operation procedures as well as emergency procedures. \n\n\n\nEmergency response plan\n\nAll leaks requiring the use of a chlorine \"B\" kit will be managed by the Fort Morgan Fire Department. The plant has an agreement with the fire department, which is included in this plan. A complete copy of the Emergency Response Plan (Contingency Plan) is also included.\n\n\n\nThe plant has has no chlorine releases in the past five years."
    }
  ]
}