{
  "FacilityID": 1000118508,
  "FacilityName": "Amfine Chemical Corporation",
  "FacilityStr1": "6805 John Rivers Road",
  "FacilityStr2": null,
  "FacilityCity": "Hopkinsville",
  "FacilityState": "KY",
  "FacilityZipCode": "42240",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21047",
  "LEPC": "Christian County LEPC",
  "FacilityLatDecDegs": "36.790449",
  "FacilityLongDecDegs": "-087.378331",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "FC",
  "FacilityURL": "www.amfine.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 847934924,
  "ParentCompanyName": "ADEKA Corporation",
  "Company2Name": "Mitsubishi Co. Japan / Mitsubishi Int. USA",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Amfine Chemical Corporation",
  "OperatorStr1": "6805 John Rivers Road",
  "OperatorStr2": null,
  "OperatorCity": "Hopinsville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42240",
  "OperatorZipCodeExt": null,
  "FTE": 54,
  "OtherEPAFacilityID": "KYR-000-028-225",
  "EPAFacilityID": "100000172868",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-04-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-01-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2025-01-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2025-01-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2030-01-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.790449,
  "FRS_Long": -87.378331,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R03",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000147937,
      "AltID": "G-1",
      "FacilityID": 1000118508,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000184879,
          "ProcessID": 1000147937,
          "ChemicalID": 70,
          "Quantity": 167394.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000149550,
          "ProcessID": 1000147937,
          "NAICSCode": "325199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000126464,
              "Process_NAICS_ID": 1000149550,
              "SafetyReviewDate": "2024-10-07 00:00:00",
              "PHA_Date": "2024-02-06 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "External Forces Checklist",
              "PHACompletionDate": "2024-10-11 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Neutralization (part of scrubber system)",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-10-02 00:00:00",
              "TrainingReviewDate": "2024-10-11 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-06-06 00:00:00",
              "EquipmentInspectionDate": "2024-10-10 00:00:00",
              "EquipmentTested": "VE-6201,  VE-7001",
              "ChangeMgmtDate": "2023-12-05 00:00:00",
              "ChangeMgmtReviewDate": "2023-12-08 00:00:00",
              "PreStartupReviewDate": "2022-01-21 00:00:00",
              "ComplianceAuditDate": "2023-05-23 00:00:00",
              "AuditCompletionDate": "2024-10-10 00:00:00",
              "IncidentInvestigationDate": "2016-05-23 00:00:00",
              "InvestigationChangeDate": "2024-09-20 00:00:00",
              "ParticipationPlansReviewDate": "2024-02-22 00:00:00",
              "HotWorkPermitReviewDate": "2023-05-15 00:00:00",
              "ContractorSafetyReviewDate": "2024-07-17 00:00:00",
              "ContractorSafetyEvalDate": "2023-05-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000158506,
                  "PreventionProgram3ID": 1000126464,
                  "ProcessChemicalID": 1000184879
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000118508,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-09-10 00:00:00",
    "ERTrainingDate": "2010-07-17 00:00:00",
    "CoordinatingAgencyName": "Christian Co. EOC",
    "CoordinatingAgencyPhone": "2708876253",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "Yes",
    "ExercisePlanDate": "2024-10-03 00:00:00",
    "NotificationDrill": "Yes",
    "NotificationDrillDate": "2025-01-09 00:00:00",
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "Yes",
    "LEPCCoordinationDate": "2024-12-17 00:00:00",
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2024-10-08 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "Yes"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000118508,
      "SummaryText": "Amfine Chemical Corporation was incorporated in March of 1994 by ADEKA Corporation and Mitsubishi Corporation. Amfine manufactures and markets a wide variety of specialty plastic additives. These value-added products give longevity, increased physical properties and greater processability to many types of plastics which find their way into our everyday life. The facility also manufactures liquid stabilizer/resin in a separate building and also performs milling operations in a newly added building in the northeast corner of the site.\n\nThe Amfine specialty organic chemical manufacturing facility in United States is located at 6805 John Rivers Road in Hopkinsville, Christian County, Kentucky. This facility was constructed in 1999/2000 on approximately 8 acres of the 43 acre site. Commercial production started in Dec 2000. The  North American Industrial Classification Standard (NAICS) code is 325199 and the Standard Industrial Classification code (SIC Code) for Amfine is 2869.\n\nAmfine is committed to continuous improvement in all aspects of safety and environmental performance. The plant manager is responsible for operating the facility and has overall responsibility for compliance with all aspect of the Risk Management Program.\n\nThe facility receives bulk deliveries of chemical products and deliveries of other materials related to operations via truck. Finished products are stored in an 18000 square foot warehouse area adjacent to the plant. The facility also stores nitrogen in a 6000-gallon pressure vessel for process purposes. In the event of a vessel or pipe leak, the materials would immediately vent to the atmosphere.\n\nChemicals used at the facility are stored at the Tank Farm (south end), Hazardous Material Building (east side), and Drum Pad/Flammable Raw Materials (east side). The tanks are contained inside separately diked secondary containment. Bulk liquids are stored at the Tank Farm or the newly constructed POL Storage Area. Delivery of these chemicals is by"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000118508,
      "SummaryText": "tanker trucks in the unloading area for the Tank Farm and truck delivered isotainer at the POL unloading area. Hazardous waste at the site is segregated according to the waste stream and its chemical compatibility. Hazardous waste is stored for a maximum of 90 days as per EPA regulations.\n\nAmfine also manages a wastewater pretreatment system for process wastewater and non-contact water. Wastewater generated during the process is conveyed to pump stations before processing through the pretreatment system.  Treatment involves neutralization, evaporation, phase separation, aeration and biological treatment, and solids handling. The pretreatment system discharges to a publicly owned treatment works operated by the Hopkinsville Water Environment Authority (HWEA). No RMP regulated material has been identified in the wastewater pretreatment area.\n\nAmfine operates as a batch processor. For the process utilizing the RMP chemical, Phosphorous Oxychloride, the process starts by feeding a mixture of reactants along with catalyst and other chemicals into the main reactor. Reactions can occur at atmospheric pressure as well as under vacuum. Once the reaction is complete, oil and water phases are separated. The water phase is sent to a recovery vessel for the recovery of chemicals. Oil phase containing the product is sent to the crystallizer where the solvent is boiled off. The vessel is cooled down slowly at which time the product crystals are allowed to form. The raw recovered solvent is conveyed to solvent recovery vessels where it is further purified and then stored at the Tank Farm.\n\nThe product slurry is then fed into the centrifuge and rinsed with solvent and/or water. The wet bed cake is eventually fed into the dryer. Once the product is dry, it is further processed by mill to its final particle size the Powder Handling Area. The Powder Handling Area contains numerous pieces of equipment to ensure the particle size and mixture meets Amfine standards.\n\nAmfine\u0092s Hopkinsville"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000118508,
      "SummaryText": "facility is an OSHA PSM covered facility. This facility has many process vessels, heat exchangers and pumps. Amfine also maintains cooling towers, air compressors, chillers and three natural gas fired boilers to meet its utilities demand. All equipment, including piping and control systems meet applicable design code and standards as required by regulations and/or suggested by good engineering practices. Amfine is permitted with the Kentucky Division for Air Quality as a Conditional Major Source.  Amfine utilizes scrubbers and dust collection/baghouses to reduce emissions. Amfine is a hazardous waste generator. This facility is registered with Kentucky Division of Waste Management as a large quantity generator and is committed to complying with RCRA. All Amfine members have been provided initial OSHA and EPA mandated training. This training will be updated on an as-required basis.\n\nAmfine uses several chemicals to manufacture its plastic additives. Only one EPA RMP-regulated substance exceeding the threshold quantity has been identified: Phosphorous Oxychloride (POL) at a maximum quantity 167,394 lb. This chemical is stored in 55 gallon (636 lb) drums stored at the Drum Pad (maximum of eight drums) and an 11,500 gallon storage tank. The storage tank has a diked secondary containment area large enough to contain approximately double the entire volume of the tank. The Drum Pad is also provided with secondary containment. Other hazardous chemicals that Amfine uses are: acetone, methanol, xylene, triethylamine, diethylamine, sodium hydroxide, isopropyl alcohol and others. Though these chemicals are not RMP regulated chemicals, Amfine has a contingency plan that addresses potential release. An updated list of all chemicals used by the facility has been provided to the Hopkinsville Fire Department and Christian County Emergency Operations Center.\n\nAmfine's offsite consequence analysis, using ALOHA 5.4.7 (Areal Locations of Hazardous Atmospheres) indicated that a worst-ca"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000118508,
      "SummaryText": "se toxic release could have an offsite impact. The worst-case scenario was modeled as a catastrophic failure of the 11,500-gallon POL storage tank resulting in the full contents of the tank spilling into containment and evaporating. The release of 11,500 gallons into containment would result in 704 pounds of POL released to the atmosphere and would cause a toxic end point 0.0030 mg/l (0.5 ppm) at an estimated distance of 1.9 miles. This radius was imported to MARPLOT to estimate the affected population. MARPLOT\u0092s data is based on 2010 U.S. Census data. The 2020 U.S. Census data is not yet available in MARPLOT. The worst-case toxic release would impact a population of 979 people outside of the Amfine facility. To prevent such a catastrophe from occurring, employees are trained on many programs including hazardous materials. It is important to note that parent company ADEKA Corporation has handled this material safely for over thirty years. Training, operating procedures, safety systems and preventive maintenance programs are all in place to ensure safe handling of this material. Since startup in December 2000, there has been no reportable accident or incidents involving POL. \n\nUsing the same approach, an alternate release scenario for POL was also developed that could have an offsite impact. The alternate release scenario was modeled as the overfilling of the POL Storage Tank from a tanker. Due to the overfill protection and alarm systems, the facility can stop the flow of POL within one minute. This scenario would result in the release of 2,103 pounds of POL into containment, with a release of 931 pounds of POL into the atmosphere, causing a toxic end point 0.0030 mg/l (0.5 ppm) at an estimated distance of 0.77 miles. Based on the MARPLOT projection, the alternative scenario would impact a population of 43 people outside of the Amfine facility. \n\nNote that the total amount of POL released into the atmosphere is slightly greater in the alternative scenario due to the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000118508,
      "SummaryText": "wind speed and atmospheric conditions that are provided in EPA\u0092s RMP Guidance for Offsite Consequence Analysis. The surface area of the POL puddle is similar in both scenarios due to the secondary containment dike, meaning that atmospheric and weather conditions determine the evaporation rate. The higher wind speed/atmospheric stability in the alternative scenario results in greater total volatilization of POL but it is dispersed more quickly so the concentrations are lower, and the toxic end point is closer to the facility. In addition, the ALOHA model for both scenarios assumes that the release duration is exactly one hour. If the alternative scenario were to occur (tank overfilling during transfer), Amfine personnel would be able to clean up the spilled material in less than one hour.\n\nAmfine has an Emergency Response Program for managing an emergency that may arise due to a chemical release. This plan is focused on protecting the life, health, and well-being of employees and the general public; protecting the company, community and personal property; and protecting the environment. In the event of any chemical release, fire or other emergencies of similar nature an alarm will sound locally and throughout the site. Hopkinsville Fire Department and Christian County Emergency Operations Center will be notified. The alarm system is tested frequently. Amfine has trained all its employees on its Emergency Response program. This training will be updated on an as-needed basis."
    }
  ]
}