{
  "FacilityID": 1000048396,
  "FacilityName": "Tessenderlo Kerley, Inc. - Finley Facility",
  "FacilityStr1": "233807 E. Straightbank Road",
  "FacilityStr2": null,
  "FacilityCity": "Kennewick",
  "FacilityState": "WA",
  "FacilityZipCode": "99337",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County Emergency Servic",
  "FacilityLatDecDegs": "46.140528",
  "FacilityLongDecDegs": "-119.010435",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 51094431,
  "ParentCompanyName": "Tessenderlo Kerley, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 174179119,
  "Company2DUNS": 174179119,
  "OperatorName": "Tessenderlo Kerley, Inc.",
  "OperatorStr1": "2255 N. 44th Street - Suite 300",
  "OperatorStr2": null,
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85008",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Inouye",
  "RMPTitle": "Plant Manager",
  "FTE": 33,
  "OtherEPAFacilityID": "99337KRLYGROUTE",
  "EPAFacilityID": "100000073948",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-03-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-07-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-01-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-01-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-01-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 46.14222,
  "FRS_Long": -119.0124,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060544,
      "AltID": "Ag. Chemicals production",
      "FacilityID": 1000048396,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061687,
          "ProcessID": 1000060544,
          "NAICSCode": "32532",
          "_desc": {
            "NAICS_CODE": "32532",
            "NAICS_DESCRIPTION": "Pesticide and Other Agricultural Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000074109,
          "ProcessID": 1000060544,
          "ChemicalID": 8,
          "Quantity": 866256.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 8,
            "ChemicalName": "Carbon disulfide",
            "CASNumber": "75-15-0",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000074110,
          "ProcessID": 1000060544,
          "ChemicalID": 133,
          "Quantity": 271340.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 133,
            "ChemicalName": "Dimethylamine  [Methanamine, N-methyl-]",
            "CASNumber": "124-40-3",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000074111,
          "ProcessID": 1000060544,
          "ChemicalID": 97,
          "Quantity": 599060.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 97,
            "ChemicalName": "Methylamine  [Methanamine]",
            "CASNumber": "74-89-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000574109,
          "ProcessID": 1000060544,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000574110,
          "ProcessID": 1000060544,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000574111,
          "ProcessID": 1000060544,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048396,
      "SummaryText": "1.0    Finley Facility Risk Management Plan: Executive Summary\n\n\n\n    ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\n\n\nThe Finley Facility (Facility) has a long-standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility's processes.  The Tessenderlo Kerley, Inc. (Tessenderlo Kerley) policy is to implement reasonable controls to prevent foreseeable releases of substances. However, if a release does occur, trained personnel will respond to, control, and contain the release.\n\n\n\n    DESCRIPTION OF THE STATIONARY SOURCE AND REGULATED\n\n    SUBSTANCES\n\n\n\nThe Tessenderlo Kerley Facility is located in south central Benton County southwest of Finley, Washington.  The plant occupies approximately five acres at the junction of Chemical Drive and the Northern Railroad tracks on the west bank of the Columbia River.\n\n\n\nThe Facility produces and distributes agricultural and industrial chemicals for the northwest market.  Production at the Facility consists of the manufacture of fertilizers, pesticides, chemicals used for metal extraction in the mining industry, and chemicals used in the kraft paper industry.  \n\n\n\nProducts at the Facility include the manufacture or storage of several agricultural products: one ammonium polysulfide (APS) products, ammonium thiosulfate (ATS), calcium thiosulfate (CaTS) and potassium thiosulfate(KTS).  In addition to these agricultural products, the Facility produces the pesticides lime sulfur, metam sodium and metam potassium, as well as the metal extractants.  \n\n\n\nThese chemicals utilize several regulated and non-regulated substances as raw materials. The large number of products and their raw materials require loading/unloading operations at the Facility, as well as the associated process and storage equipment.  \n\n\n\nThe Facility was evaluated to determine if any re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048396,
      "SummaryText": "gulated flammable or toxic substances exceeded the threshold quantity.  Based on process knowledge, Tessenderlo Kerley identified two listed flammable substances (MMA and DMA) and one regulated toxic substance (carbon disulfide) kept on site above threshold quantities.\n\n\n\nThe regulated flammable substances stored on site at the Facility above threshold quantities are dimethylamine and monomethylamine (methylamine).  The regulated toxic substances stored onsite above threshold quantities are anhydrous ammonia and carbon disulfide.  \n\n\n\nThe process at the Finley Facility subject to the Accidental Release Prevention (ARP) program is classified as a Program 3 process under the program.\n\n\n\nRESPONSIBILITIES\n\n\n\nGroup VP - Accountable for all RMP and PSM compliance of all company facilities.\n\n\n\nPSM Coordinator - Chair the steering committee.  Monitor the company PSM and RMP progams to determine whether it is functioning properly and, where deficient, seek cures.  Update Risk Management Plans when necessary.\n\n\n\nPSM Steering Committee - Evaluate and set PSM and RMP policy to assure company-wide compliance with the OSHA PSM and EPA RMP standards.\n\n\n\n     OPERATING PROCEDURES:\n\n\n\nDirector of Technical Services and Plant Managers/Assistant Plant Managers - Ensure that procedures have been prepared and are accurate.\n\n\n\nProcess Engineers and Plant Managers/Assistant Plant Managers - Ensure operators have been adequately trained.\n\n\n\n     EMPLOYEE PARTICIPATION:\n\n\n\nPSM Coordinator - Provide/assure overview training.  Assure operations personnel participate as necessary in pertinent program elements.\n\n\n\n     PROCESS SAFETY INFORMATION & PROCESS HAZARD ANALYSIS:\n\n\n\nDirector of Technical Services - Ensure PSI is obtained, codified, recorded in standard format and available for employee review.\n\n\n\nProcess Engineers/PSM Coordinator - Prepare/assemble PSI according to the standard format/protocol.  Ensure PHA's are performed per schedule, and issue action item reports.  Track to completio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048396,
      "SummaryText": "n.\n\n\n\nProcess Engineers/PSM Coordinator/Qualified Contractors/Plant Managers/Assistant Plant Managers - Lead and document PHA's per the standard protocol; resolve assigned action items.\n\n\n\nPSM Coordinator - Maintain central files; ensure documents are distributed to the plants as necessary.\n\n\n\nPlant Managers/Assistant Plant Managers - Maintain local plant files per the standard format.  Assure employee access to PSM materials.\n\n\n\n     PRE-STARTUP SAFETY REVIEWS:\n\n\n\nPlant Managers/Assistant Plant Managers - Ensure PSSR's are conducted per procedure.  Advise employees of PSSR results as necessary.  Maintain local plant files per the standard format.\n\n\n\nPlant Managers/Assistant Plant Managers/Process Engineers - Conduct and document PSSR's per procedure; resolve any assigned action items.\n\n\n\n     CONTRACTORS:\n\n\n\nPlant Managers/Assistant Plant Managers - Orient Contractors; document contractor safety performance and evaluations per standard.  Audit contractor safety performance.\n\n\n\nPlant Managers/Assistant Plant Managers/All who retain contractors - Collect and evaluate contractor safety information; provide sites with documentation.\n\n\n\n     INCIDENT INVESTIGATION:\n\n\n\nPlant Managers/Assistant Plant Managers - Ensure that incident reviews are being conducted and documented as per PSM procedure.\n\n\n\nDirector of Safety - Review incident reports and follow up as needed.  Keep master file of all incidents.\n\n\n\n     HOT WORK PERMIT\n\n\n\nPlant Managers/Assistant Plant Managers - Ensure plants conduct hot-work per PSM procedure.\n\n\n\nDirector of Safety/Safety Technician - Review Hot Work Permit Program during safety audits.\n\n\n\n     MECHANICAL INTEGRITY:\n\n\n\nPSM Coordinator - Develop MI program and procedures for plants.\n\n\n\nPlant Managers/Assistant Plant Managers - Implement program elements; contract work as required.  Maintain site local documentation.\n\n\n\nPSM Coordinator - Compile inspection results data.  Track action items via database.\n\n\n\nDirector of Technical Services/Process Eng"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048396,
      "SummaryText": "ineers/TKS - Complete assigned MI action items.\n\n\n\n     MANAGEMENT OF CHANGE:\n\n\n\nPSM Coordinator - Receives, logs and distributes MOC requests.  Maintains central MOC files.\n\n\n\nDirectors of Manufacturing, Engineering, and Plant Managers - Approves MOC requests.\n\n\n\nProcess Engineers - Participates in MOC reviews; completes assigned work.  \n\n\n\nPlant Managers/Assistant Plant Managers - Leads MOC reviews; completes checklist.\n\n\n\n     EMERGENCY PLANNING AND RESPONSE:\n\n\n\nSr. Environmental Engineer - Prepares ERP to code.\n\n\n\nSr. Environmental Engineer - Maintain central files and ensure plant manuals are current.  \n\n\n\nPlant Managers/Assistant Plant Managers - Maintain plan in local file; assure training/circulatoin of plan.\n\n\n\n     COMPLIANCE AUDITS:\n\n\n\nProcess Engineers/PSM Coordinator/Environmental and Safety Departments - Lead PSM compliance audits and prepare reports as PSM procedure requires.\n\n\n\nPSM Coordinator - Tracks Audit action items.\n\n\n\nPSM Coordinator/Process Engineers/Director of Technical Services/Plant Managers/Assistant Plant Managers - Complete assigned action items.\n\n\n\nGENERAL ACCIDENT RELEASE PROGRAM\n\n\n\nThe following is a summary of the of the accident prevention program in place at the Finley Facility.  The processes at the plant that are regulated by the Environmental Protection Agency's (EPA's) risk management program (RMP) regulation are also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard.  Therefore, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.  The facility is in the continuous process of reviewing the accident prevention program and as such is in various stages of implementing changes to improve work place safety.\n\n\n\nEmployee Participation\n\n\n\nActive employee participation and involvement in the development and implementation of the Facility's PSM program is an important step toward ach"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048396,
      "SummaryText": "ieving the objective to prevent or minimize the consequences of catastrophic releases of toxic, reactive, flammable, or explosive chemicals.  Employee involvement will help to ensure that all perspectives regarding PSM are considered, and that the best ideas are implemented.  Open communications are encouraged between supervisors and employees regarding all safety and health issues.\n\n\n\nThe Facility strongly promotes employee involvement in safety issues through existing programs.  These programs include regularly scheduled safety meetings, tail-gate safety meetings, Hazard Communication, Safety Suggestion Forms, \"near-miss\" reporting, and special training programs (emergency response training, first aid, etc.). \n\n\n\nThe Finley Facility actively seeks employee involvement in the development and conduct of all accident prevention activities through the appropriate existing safety programs.  Accident prevention is discussed at the regularly scheduled safety meetings and/or during special training sessions if necessary.  Employees are encouraged to discuss accident prevention with their supervisors if they have questions, comments, or suggestions.  \n\n\n\nProcess Safety Information\n\n\n\nComplete and accurate written process safety information (PSI) concerning process chemicals, process technology, and process equipment is essential to effective PSM and RMP programs and to completing and maintaining a process hazard analysis (PHA).  The PSI will be useful to the operators; the team performing the PHA; those in charge of training; contractors; those conducting pre-startup safety reviews; and those in charge of updating the emergency preparedness plans.  Process safety information is to be readily available to all employees.\n\n\n\nA variety of technical documents are to be kept that are used to help maintain safe operation of the process.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equ"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000048396,
      "SummaryText": "ipment design basis/configuration information.\n\n\n\nChemical-specific information, including exposure hazards and emergency response/ exposure treatment considerations, is provided in material safety data sheets (MSDS/SDS).  \n\nNumerous technical documents are to be maintained that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\nProcess Hazard Analysis (PHA)\n\n\n\nThere is a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\n\n\nThe Facility primarily uses the hazard and operability (HAZOP) method analysis technique to perform these evaluations.  However, as situations warrant, the Facility will use other inductive technique such as what if/checklist and failure mode and effect or the deductive fault tree technique.  \n\n\n\nThe analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  PHA team members include the process/project engineer responsible for the process/project; plant manager or knowledgeable plant person; person knowledgeable in methods of hazard analysis; and others with particular expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000048396,
      "SummaryText": "\n\n\n\nThe PHA team findings are forwarded to local and corporate management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk matrix assigned by the PHA team.  The matrix is based on severity (criticality) and probability (frequency).  This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention.  All approved mitigation options in response to PHA team findings are tracked until they are completed.  The final resolution of each finding is documented and retained.\n\n\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the PHA team periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.  \n\n\n\nThe recommended order of analysis will be based upon the following criteria: \n\n\n\nA?A? age of process; \n\nA?A? extent of process hazards; \n\nA?A? number of affected employees; and \n\nA?A? operating history of the process.  \n\n\n\nThe results and findings from these updates are documented and retained.  The team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\n\n\n\nOperating Procedures\n\n\n\nWritten procedures are to be maintained that address various modes of process operations, such as; \n\n\n\nA?A? initial startup; \n\nA?A? normal operations; \n\nA?A? temporary operations; \n\nA?A? emergency shutdown; \n\nA?A? emergency operations; \n\nA?A? normal shutdown; \n\nA?A? startup following a turnaround; and \n\nA?A? startup after emergency shutdown.  \n\n\n\nThese procedures provide guidance for experienced operators and also provide the basis for training new operators.  \n\n\n\nOperating procedures are to be periodically reviewed and annually certified as current and accurate.  The review is to "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000048396,
      "SummaryText": "assure that the procedures reflect current operating practice, include changes from process technology changes, chemical changes, equipment changes, and changes to facilities.  The review and certification process involves both operators and technical staff.\n\n\n\nThe intent of the operating procedures is to provide workable, useful, and clearly written instructions for conducting operating activities.  To have effective operating procedures, the task and procedures directly and indirectly related to the covered process must be appropriate, clear, consistent, and most importantly, communicated to employees.  \n\n\n\nOperating procedures are specific instructions or details on what steps are to be taken or followed in carrying out the stated procedures.  The specific instructions include the applicable safety precautions and appropriate information on safety implications.\n\n\n\nTraining\n\n\n\nIn addition to training on operating procedures, there is to be a comprehensive training program for all employees involved in operating the process.  New employees are to receive basic training in process operations and procedures. \n\n\n\nIn addition, all operators are periodically to receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is to be conducted at least every three years.  The appropriate frequency of training is to be based on management in consultation with the employees involved in operating the particular process.  All of this training is to be  documented for each operator including the means used to verify that the operator understood the training.\n\n\n\nContractors\n\n\n\nThe Finley Facility uses contractors during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, there are to be procedures in place to ensure that contractors \n\n\n\nA?A? perform their work in a safe manner; \n\nA?A? have appropriate knowledge a"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000048396,
      "SummaryText": "nd skills; \n\nA?A? are aware of the hazards of their workplace; \n\nA?A? understand what they should do in the event of an emergency; \n\nA?A? understand and follow site specific safety rules; and \n\nA?A? inform plant personnel of any hazards that they find during their work.  \n\n\n\nThis is to be accomplished by providing contractors with an orientation session that covers (1) a process overview; (2) information about safety and health hazards including known or potential fire, explosion, or toxic release hazards; (3) emergency response plan requirements; and (4) safe work practices must be developed and implemented regarding control of entrance, presence and exit of contract personnel prior to beginning their work.  \n\n\n\nIn addition, contractor safety programs and performance during the selection of a contractor are to be evaluated. Contract employee injury and illness log should be maintained.  Plant personnel are to periodically monitor contract performance to ensure that contractors are fulfilling their safety obligations.\n\n\n\nPre-startup Safety Review (PSSR)\n\n\n\nA PSSR should be conducted on any new facility or facility modification that requires a change in process safety information.  The purpose of the PSSR is to ensure those safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment and highly hazardous chemicals into service.  This review provides one additional check to make sure construction is in accordance with design specification and that all-supporting systems are operationally ready.\n\n\n\nThe PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.  The PSSR also ensures that procedures (safety, operating, maintenance, and emergency) are in place and adequate.  A PSSR verifies that a PHA has been conducted, recommendations resolved, and training of employees involve"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000048396,
      "SummaryText": "d in the process prior to a start-up.\n\n\n\nMechanical Integrity\n\n\n\nWell established practices and procedures for maintaining process equipment should be kept.  The basic aspects of this program are to include \n\n\n\nA?A? training; \n\nA?A? developing written procedures; \n\nA?A? performing inspections and tests consistent with good engineering practices; \n\nA?A? correcting equipment deficiencies outside acceptable PSI limits; and \n\nA?A? applying quality assurance measures.  \n\n\n\nIn combination, these activities form a system that maintains the mechanical integrity of the process.\n\nMaintenance personnel receive training on \n\n\n\nA?A? an overview of the process; \n\nA?A? safety and health hazards; \n\nA?A? applicable maintenance procedures; \n\nA?A? emergency response plans; and\n\nA?A? applicable safe work practices.\n\n\n\nThis training is to help ensure that they can perform their jobs in a safe manner.\n\n\n\nAnother integral part of mechanical integrity program is quality assurance.  Quality assurance measures are to be incorporated into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\n\n\nSafe Work Practices\n\n\n\nDuring construction of new processes, all equipment to be installed is to be determined to be suitable for the process application.  Checks and inspections are to be performed to assure that installation is consistent with design specifications and manufacturer's instructions suitable for the particular application.  The Facility has long standing safe work practices in place to help ensure worker and process safety.  Examples of these include \n\n\n\nA?A? control of the entry/presence/exit of support personnel; \n\nA?A? a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance;\n\nA?A? a procedure for safe removal of hazardous and toxic substances before process piping and equipment is opened; \n\nA?A? a permit and procedur"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000048396,
      "SummaryText": "e to control spark-producing activities (i.e., hot work); and \n\nA?A? a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  \n\n\n\nThese procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\n\n\nManagement of Change\n\n\n\nThere is a comprehensive system of written procedures to manage changes to all covered processes.  This system requires that changes to items such as process chemicals, process equipment, technology (including process operating conditions), procedures, impact to safety and health and other facility changes be properly reviewed and authorized before being implemented.  Prior to changes being made, they are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures are updated to incorporate these changes.  In addition operating and maintenance personnel, including contractors employees, are provided any necessary training on the change.\n\n\n\nIncident Investigation\n\n\n\nThe Facility promptly investigates (within 48 hours) all incidents that resulted in or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to gather the facts, determine the root cause, and develop corrective action to prevent the reoccurrence of the incident or a similar incident.  The reports are maintained for five years.\n\n\n\nAn investigation team is established to investigate each process incident.  The team will consist of members involved in the incident including at least one person knowledgeable in the process involved; a contract employee (if the incident involved the work of a contractor); and oth"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000048396,
      "SummaryText": "er persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident.  The investigation team documents its findings in a report.  \n\n\n\nThe report includes dates of incident and of investigation, description of incident, factors contributing to the incident, and develops recommendations to prevent a recurrence, and forwards these results to the business management team for resolution.  \n\n\n\nCompliance Audits\n\n\n\nTo help ensure that the accident prevention program is functioning properly, the Finley Facility periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every three years.  \n\n\n\nBoth hourly and staff personnel participate as audit team members with at least one person knowledgeable in the audit techniques.  The audit team develops findings in a report that is forwarded to plant management for resolution.  Corrective actions taken in response to the audit team's findings are tracked and documented until they are complete.  The final resolution of each finding is documented, and the appropriate enhancements to the prevention program are implemented.  The two most recent compliance audit reports are retained.\n\n\n\nChemical Specific Prevention Steps\n\n\n\nThe processes at the Finley Facility have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\n\n\nUniversal Prevention Activities\n\n\n\nThe accident prevention program summarized previously is applied to the RMP-covered process at the Finley Facility.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\n\n\nSpecialized Safety Features\n\n\n\nThe Facility has safety features on many units to help (1) conta"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000048396,
      "SummaryText": "in/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in the RMP covered process:\n\n\n\nRelease Detection\n\n\n\n1. Sensors with audible alarms are located to detect and warn of carbon disulfide leaks.\n\n\n\nRelease Containment/Control\n\n\n\n1. Pressure relief valves on applicable tanks.\n\n2. Key manual valves are chained and padlocked in their critical (open/closed) position.\n\n3. Excess flow check valves designed to plug the outlet if outflow reaches equivalent of flow due to pipe rupture.\n\n4. Derailers and chock blocks to prevent rail car movement.\n\n\n\nRelease Mitigation\n\n\n\n1. Standard operating procedures that control, isolate, and terminate leaks.\n\n2. Water reservoir below carbon disulfide tank will capture material leaking from tank and prevent evaporation.\n\n3. Personnel trained in emergency procedures.\n\n4. Deluge system employed at origin of leak.\n\n5. Personal protective equipment (e.g., escape respirator, self-contained breathing apparatus, and supplied air breathing apparatus).\n\n6. Ventilate contaminated areas.\n\n\n\nFive Year Accident History\n\n\n\nThe Finley Facility has an excellent record of accident prevention over the past five years. There have been no incidents involving a regulated substance.\n\n\n\nEmergency Procedure Information\n\n\n\nThe Facility maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures account for the possibility of a toxic substance being accidentally released, as well as for the possibility of a fire or explosion.  The procedures address notification of local emergency response agencies if a release occurs, and post incident cleanup and decontamination requirements.  \n\n\n\nEmployees receive training in emergency procedures. The emergency procedure is updated when necessary based on modifications made to Facility.  \n\n\n\nThe overall emergency procedure program for the Facility "
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000048396,
      "SummaryText": "is coordinated with the Benton County, Washington Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials, and industry representatives. \n\nThe Facility has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\n\n"
    }
  ]
}