{
  "FacilityID": 1000011921,
  "FacilityName": "Harris Field Water Treatment Plant",
  "FacilityStr1": "U.S 1 and S.W. 312 Street",
  "FacilityStr2": null,
  "FacilityCity": "Homestead",
  "FacilityState": "FL",
  "FacilityZipCode": "33030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12086",
  "LEPC": "South Florida RPC",
  "FacilityLatDecDegs": "25.475556",
  "FacilityLongDecDegs": "-080.463889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.homestead.fl.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Homestead",
  "OperatorStr1": "790 N. Homestead Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Homestead",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33030",
  "OperatorZipCodeExt": "6299",
  "RMPContact": "Julio Brea, P.E.",
  "RMPTitle": "Director of Public Works and Svcs",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000053979",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-12-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-12-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-12-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-12-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 25.47556,
  "FRS_Long": -80.46389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014526,
      "AltID": "Water Treatment Plant",
      "FacilityID": 1000011921,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014867,
          "ProcessID": 1000014526,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016751,
          "ProcessID": 1000014526,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000516751,
          "ProcessID": 1000014526,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011921,
      "SummaryText": "Executive Summary\n\nThe City of Homestead Water and Waste Water Department has always maintained a well-trained staff and a safely operated and maintained facility at the Harris Field Water Treatment Plant. The City of Homestead track record is exemplary with respect to handling hazardous chemicals. Furthermore, the City of Homestead has taken a comprehensive approach to be in full compliance with the RMP regulation.\n\n1.0  Accidental Release Prevention and Emergency Response Policies at Harris Field Water Treatment Plant.\n\nHarris Field Water Treatment Plant personnel do not have the specialized equipment or training to respond to a major release. Therefore, the Emergency Response program focuses on procedures to identify chemical releases, safely evacuate plant personnel, and notify the local emergency responders (fire, police, and HAZMAT) who are responsible for implementing the incident command system (ICS) and coordinating all response actions.\n\n2.0  Harris Field Water Treatment Plant and Chlorine.\n\nThe City of Homestead owns and operates the Harris Field Water Treatment Plant. The facility's mission is to protect public health by providing our community with safe drinking water, free of harmful pathogens.  Approximately 95 pounds per day of chlorine gas is used to disinfect the water and make it safe for human consumption. \n\nHarris Field Water Treatment Plant injects chlorine to the water system by use of a vacuum feed system. This system will automatically shut-off at loss of vacuum to prevent unwanted escape of gases into the atmosphere. The chlorine storage tanks are located away from possible traffic and are enclosed by a poured concrete structure building with perimeter fencing.                    \n\n3.0  Accidental Release Prevention Program and Prevention Steps.\n\nThe Harris Field Water Treatment Plant complies with all rules and regulations that pertain to the safe storage and use of chlorine. Specific regulations include: OSHA Process Safety Management (PS"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011921,
      "SummaryText": "M) rule; OSHA Hazardous Waste Operations and Emergency Response (HAZWOPER); OSHA Hazard Communication (HAZCOM); OSHA Employee Emergency Plans and Fire Prevention Plans; EPA Risk Management Plans (RMP). \n\nKey elements of the prevention program include:\n\n*     Employee participation\n*     Process safety information\n*     Process hazard analysis\n*     Incident investigation\n*     Standard operating procedures\n*     Mechanical integrity\n*     Management of change\n*     Pre-startup review\n*     Training\n*     Contractors\n*     Compliance audits\n*     Hot work permits\n\nThe following briefly states the benefits of the following prevention program elements: standard operating procedures, mechanical integrity program, employee training and the process hazard analysis.\n\nThe facility staff has developed up-to-date and accurate written standard operating procedures (SOPs)  to ensure that operators have clear instructions for safe operation of the chlorine system.  Effective SOPs, when combined with operator training, are instrumental in ensuring safe operation of the system and in preventing accidental releases.\n\nThe purpose of the mechanical integrity program is to ensure the continued integrity of the process equipment.  An effective mechanical integrity program is integral to preventing accidental chlorine releases that may result from mechanical failure of improperly maintained equipment.  The Harris Field Water Treatment Plant mechanical integrity program includes maintenance, inspection, and testing procedures and schedules along with maintenance personnel training.\n\nKnowledgeable well-trained personnel are essential to preventing and mitigating the effects of accidental chemical releases. The Harris Field Water Treatment Plant training program ensures that personnel working on or near the chlorine system are adequately trained in operation and maintenance procedures and the appropriate response actions to an accidental chlorine release.\n\nThe process hazard analysis is a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011921,
      "SummaryText": "valuable risk reduction tool that outlines deficiencies in equipment and procedures, identifies potential system failure modes, and provides recommendations for system and operational improvements.\n\n\n4.0  Five Year Accident History.\n\nThe Harris Field Water Treatment Plant has had no accidental releases, in the last five years, which were required to be reported under the RMP regulation. \n\n\n5.0  Harris Field Water Treatment Plant Emergency Response Program.\n\nThe City of Homestead maintains an ongoing emergency response program in order to efficiently notify and evacuate employees, notify potential critical receptors in the community and state and local emergency response agencies. The program includes written procedures for proper first aid and emergency medical treatment to treat human exposures; procedures to review and update the plan and ensure that employees are informed of changes. There are local hazmat teams in Miami-Dade County that can respond to mitigate a chlorine leak.  The facility emergency response plan is coordinated with the local fire department as required by the Emergency Planning and Community Right to Know Act.\n\n\n6.0  Planned Changes to Improve Safety at Harris Field Water Treatment Plant.\n\nFuture plans to improve chlorine system safety at the Harris Field facility consists of continuing annual operator training, hiring an additional treatment plant operator, periodic Process Safety Management Program audits, and continuing management of the facility PSM program elements. Also, the City of Homestead has applied for EPA grant money to improve the physical security of Harris Field."
    }
  ]
}