{
  "FacilityID": 1000059418,
  "FacilityName": "Monitor 11",
  "FacilityStr1": "3900 3 Mile Road",
  "FacilityStr2": null,
  "FacilityCity": "Bay City",
  "FacilityState": "MI",
  "FacilityZipCode": "48706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26017",
  "LEPC": "Bay County LEPC",
  "FacilityLatDecDegs": "43.626722",
  "FacilityLongDecDegs": "-083.953889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Breitburn Operating, L.P.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Breitburn Operating, L.P.",
  "OperatorStr1": "1165 Elkview Drive",
  "OperatorStr2": null,
  "OperatorCity": "Gaylord",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49735",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000196879",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-06-27 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-09-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-08-02 00:00:00",
  "DeRegistrationEffectiveDate": "2019-09-05 00:00:00",
  "AnniversaryDate": "2021-09-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.62639,
  "FRS_Long": -83.95153,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074266,
      "AltID": "NGL Extraction",
      "FacilityID": 1000059418,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000091853,
          "ProcessID": 1000074266,
          "ChemicalID": 155,
          "Quantity": 290468.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000079565,
              "ProcessChemicalID": 1000091853,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000079566,
              "ProcessChemicalID": 1000091853,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000079567,
              "ProcessChemicalID": 1000091853,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000079568,
              "ProcessChemicalID": 1000091853,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000079569,
              "ProcessChemicalID": 1000091853,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000080193,
              "ProcessChemicalID": 1000091853,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000075429,
          "ProcessID": 1000074266,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000062372,
              "Process_NAICS_ID": 1000075429,
              "SafetyReviewDate": "2016-04-19 00:00:00",
              "PHA_Date": "2015-10-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-10-01 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Flammable release; Major spills of hazardous chemicals",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-04-19 00:00:00",
              "TrainingReviewDate": "2013-09-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-05-23 00:00:00",
              "EquipmentInspectionDate": "2014-02-27 00:00:00",
              "EquipmentTested": "Relief Valves",
              "ChangeMgmtDate": "2016-04-19 00:00:00",
              "ChangeMgmtReviewDate": "2013-09-13 00:00:00",
              "PreStartupReviewDate": "2016-04-19 00:00:00",
              "ComplianceAuditDate": "2013-09-13 00:00:00",
              "AuditCompletionDate": "2014-09-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-10-31 00:00:00",
              "HotWorkPermitReviewDate": "2013-09-13 00:00:00",
              "ContractorSafetyReviewDate": "2014-03-30 00:00:00",
              "ContractorSafetyEvalDate": "2013-09-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000076431,
                  "PreventionProgram3ID": 1000062372,
                  "ProcessChemicalID": 1000091853
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000059418,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-08-10 00:00:00",
    "ERTrainingDate": "2014-06-27 00:00:00",
    "CoordinatingAgencyName": "Monitor Township Fire Department",
    "CoordinatingAgencyPhone": "9896846320",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059418,
      "SummaryText": "EXECUTIVE SUMMARY: MONITOR 11\r\n\r\nI. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nThis will serve as the Executive Summary of the policies, procedures and activities for compliance with the Environmental Protection Agency's (EPA) Accidental Release Prevention Requirements: Risk Management Programs under Section 112(r) of the Clean Air Act Amendments, 40 CFR 68.79, for Breitburn Operating, L.P.'s Monitor 11 Gas Plant. Breitburn Operating, L.P. and the Monitor 11 Gas Plant are committed to protecting the health and safety of company personnel, contractors, visitors, and the surrounding community and the environment. This commitment is strongly supported by senior management and is demonstrated by the resources invested in accident prevention, such as, training, design safety, operation, and maintenance of the facility. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. Breitburn understands that strong health, safety, and environmental principles, properly integrated into our management processes, and day to day practices greatly contributes to our business success.\r\n\r\nII. FACILITY DETAILS AND REGULATED SUBSTANCES HANDLED\r\n\r\nThe Monitor 11 Plant is located at 3900 3 Mile Road, Bay City Michigan in Bay County. The primary function of the Monitor 11 Plant encompasses natural gas liquids (NGLs) extraction, with local sales of NGL from a pressurized storage tank. The plant has a regulated flammable mixture, comprised of ethane, propane, butanes, and pentanes. There are no threshold quantities of 112(r) regulated toxic substances at the facility. \r\n\r\nIII. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe Monitor 11 Plant process is regulated by the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) and the Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) standard. The Monitor 11 Plant has met the crit"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000059418,
      "SummaryText": "cuted using trained industry personnel along with other emergency response personnel from responding agencies, as needed."
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000059418,
      "SummaryText": "thin the last five years. Since plant startup, there has not been a release of any regulated substance. The personnel and management of the Monitor 11 Gas Plant place significant emphasis on prevention and safety programs to ensure this record continues.\r\n\r\nV. EMERGENCY RESPONSE PROGRAM INFORMATION\r\n\r\nThe Monitor 11 Plant maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first aid and medical treatments for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements. In addition, the Monitor 11 Plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures, as necessary, to perform their specific emergency response duties. The emergency response program is updated when necessary. \r\n\r\nIn the event of an emergency involving our natural gas liquid extraction facility, it is our policy to follow our Emergency Action Plan, which has been reviewed with the Bay County LEPC. Activation of this plan sets in motion a pre-planned series of events that includes notification of all emergency response agencies. Emergency response agencies are notified on the 911 system. The 911 call is channeled through the Bay County Sheriff's Department. All agencies and personnel respond to pre-determined staging areas with representatives from each agency reporting to the Central Command Post. A contingency plan is developed and exe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059418,
      "SummaryText": "eria for a RMP Program Level 3 facility. The facility has public receptors within the distance to the endpoint. The facility has not had a release of the regulated substance in the past five years. In addition, the facility has coordinated its emergency response activities with local responders. \r\n\r\na. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nThe following is a summary of the accidental prevention program in place at the Monitor 11 Plant. Due to the facility being regulated by the RMP Regulation as well as OSHA's PSM standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\n  i. Employee Participation\r\n    \r\nThe Monitor 11 Plant encourages employees to participate in all facets of accident prevention as well as process safety management. Employees have access to all information created as part of the plant's prevention program, and open communication is encouraged between supervisors and employees regarding all safety and health issues.  Some examples of employee participation at the facility include: updating and compiling technical documents and chemical information, participating as a member of a process hazard analysis team, and participating in safety and tailgate meetings. More details of employee involvement in the accident prevention program are documented in an Employee Participation Plan that is maintained at the facility and addresses each accident prevention program element.\r\n\r\n   ii. Process Safety Information\r\n\r\nThe Monitor 11 Plant keeps a variety of technical documents that are used to maintain safe operation of the process. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. Chemical-specific information, including exposure hazards and emergency response, as well as exposure treatment considerations, is prov"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059418,
      "SummaryText": "ided in safety data sheets (SDS's) located on site at the facility. The facility also maintains numerous technical documents including information such as materials of construction, design pressure and temperature ratings, and electrical ratings of equipment. This information, in combination with written procedures and trained personnel, provides the basis for establishing inspection and maintenance activities. It is also utilized when evaluating proposed process and facility changes to ensure that safety features in the process are not compromised. Process safety information is readily available to all employees. \r\n\r\n   iii. Process Hazard Analysis (PHA)\r\n\r\nThe Monitor 11 Plant has a comprehensive program to help ensure that hazards associated with various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. The Monitor 11 Plant primarily uses the Hazard and Operability(HAZOP) analysis technique for performing these evaluations. In addition, the What-if/Checklist method may also be used. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures. The team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. All approved mitigation options in response to PHA team findings are tracked until they are completed, and the final resolution of each finding is documented and retained. Periodic reviews will be conducted at least every 5 years.\r\n\r\n   iv. Operating Procedures\r\n\r\nThe Monitor 11 Plant maintains written operating procedures that address various modes of process operations, such as (1) startups, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) norma"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059418,
      "SummaryText": "l shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed for accuracy. The procedures are kept current and accurate by revising them as necessary to reflect changes made.\r\n\r\n   v. Training\r\n\r\nTo complement the written procedures for process operations, the Monitor 11 Plant has implemented a comprehensive training program for all employees involved in operating a process. New employees receive basic training in plant operations and the facility operating procedures. All operators periodically receive refresher training to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is required to be conducted every three years. All training is documented for each operator, including the means used to verify that the operator understood the training.\r\n \r\n   vi. Contractors\r\n\r\nThe Monitor 11 Plant uses contractors to supplement its workforce during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the facility has procedures in place to ensure that contractors (1) perform work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow safety rules, and (6) inform plant personnel of any hazards they find during their work. This is accomplished by providing contractors with (1) a safety orientation, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work. In addition, the Monitor 11 Plant is required to evaluate contractor safety programs and performance during the selection of contractors. \r\n\r\n   vii. Pre-Startup Safety Reviews (PSSRs)\r\n\r\nThe Monitor 11 Pla"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000059418,
      "SummaryText": "nt conducts a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment in service. This review provides one additional check to make sure construction is in accordance with the design specifications and that any supporting systems are operationally ready. A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n\r\n   viii. Mechanical Integrity\r\n\r\nThe Monitor 11 Plant has well-established practices and procedures to maintain facility equipment in a safe, operating condition, including: pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems. The basic aspects of the Mechanical Integrity Program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process. Inspection and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits.\r\n\r\n   ix. Safe Work Practices\r\n\r\nThe Monitor 11 Plant has long-standing safe work practices in place to help ensure worker and process safety. Examples of these practices include: (1) control of the entry/presence/exit of support personnel, (2) a lockout/tag-out procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000059418,
      "SummaryText": "(5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These precautions (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\n   x. Management of Change\r\n\r\nThe Monitor 11 Plant has a comprehensive system to manage changes to the covered process. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to: (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\r\n\r\n   xii. Incident Investigation\r\n\r\nThe Monitor 11 Plant promptly investigates all incidents that result in, or reasonably could have resulted in: a fire/explosion, toxic gas release, major property damage, environmental loss, or personnel injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a reoccurrence of the incident or similar incident. The investigation team documents it's findings, develops recommendations to prevent a recurrence, and forwards these results to management for resolution. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA re-validations.\r\n\r\n   xiii. Compliance Audits"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000059418,
      "SummaryText": "To help ensure that the accident prevention program is functioning properly, the Monitor 11 Plant periodically conducts a compliance audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are required to be conducted at least every 3 years.\r\n\r\nb. CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe process at the Monitor 11 Plant has hazards that must be managed to ensure continued safe operation. The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\n\r\ni. Universal Prevention Activities: The accident prevention program summarized previously is applied to RMP-covered processes at the Monitor 11 Plant. Collectively,   these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\nii. Specialized Safety Features: The Monitor 11 Plant has safety features on many units to help: (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of or mitigate a release. The following types of safety features are used in the covered process:\r\n\r\nRelease Detection\r\n a. Hydrocarbon detectors with alarms\r\n\r\nRelease Containment/Control\r\n 1. Process relief valves\r\n 2. Valves to permit isolation of the process (manual or automated)\r\n 3. Automated shutdown systems for specific process parameters\r\n 4. Diking and containment to contain liquid releases\r\n 5. Redundant equipment and instrumentation\r\n 6. Enclosures that facilitate physical containment within a structure\r\n 7. Atmospheric release\r\n\r\nRelease Protection and Response\r\n 1. Trained emergency response personnel\r\n 2. Personnel protective equipment\r\n\r\nIV. FIVE-YEAR ACCIDENT HISTORY\r\n\r\nThe Monitor 11 Plant has an excellent record of accident prevention. No incident resulting in onsite or offsite impacts from a hydrocarbon release has occurred at the facility wi"
    }
  ]
}