{
  "FacilityID": 1000079923,
  "FacilityName": "Polonio Pass Water Treatment Plant",
  "FacilityStr1": "5250 Antelope Road",
  "FacilityStr2": null,
  "FacilityCity": "Shandon",
  "FacilityState": "CA",
  "FacilityZipCode": "93461",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06079",
  "LEPC": "SLO Cnty Environmental Health",
  "FacilityLatDecDegs": "35.440749",
  "FacilityLongDecDegs": "-120.133104",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "ccwa.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Central Coast Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 949598346,
  "Company2DUNS": 0,
  "OperatorName": "Central Coast Water Authority",
  "OperatorStr1": "255 Industrial Way",
  "OperatorStr2": null,
  "OperatorCity": "Buellton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93427",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ron Cline",
  "RMPTitle": "Safety & Environmental Specialist",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000077533",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-12-27 00:00:00",
  "SafetyInspectionBy": "SLO Cnty Environmental Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.7375,
  "FRS_Long": -120.225,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099773,
      "AltID": null,
      "FacilityID": 1000079923,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101013,
          "ProcessID": 1000099773,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125001,
          "ProcessID": 1000099773,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625001,
          "ProcessID": 1000099773,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079923,
      "SummaryText": "Risk Management Plan\n\nExecutive Summary\n\n\n\n\n\n\n\nBackground:\n\nEstablished in September 1992, the Central Coast Water Authority (CCWA) delivers potable drinking water to participants in San Luis Obispo and Santa Barbara County. This is accomplished by delivering the water via approximately 130 miles of pipeline and treated and filtrated at the Polonio Pass Water Treatment Plant (PPWTP). At the PPWTP, chlorine is used in the treatment process and here we store a maximum amount of 16 1-ton cylinders (2000 lbs. each) containing compressed chlorine. At the PPWTP, chlorine is used for post disinfection, Contact Time (Ct) compliance, to aid in coagulation and to provide a residual disinfectant in the treated water distribution system.  \n\n\n\nProject Description:\n\nThe PPWTP is licensed by the California Department of Health to produce 49 million gallons a day of potable water.  CCWA provides potable drinking water to project participants located in San Luis Obispo and Santa Barbara Counties. The source water for the project is pumped out of the California State Water Aqueduct and into the Coastal Branch portion of the system. The facilities associated with the Coastal Branch to the PPWTP are operated and maintained by the California Department of Water Resources (DWR). Once the non-potable water reaches the PPWTP, it is filtrated and treated to drinking water standards and ready for distribution to CCWA's 16 participants. The Distribution system is gravity fed and runs for approximately 130 miles of pipe ranging in size from 72\" to 30\".  The distribution facilities include 4 separate water tank storage facilities along the length of the pipeline, a pressure reducing site, two sodium hypochlorite injection locations and a dechlorination/pumping facility.\n\n\n\nChlorine System:\n\nThe chemical covered by this RMP is chlorine. CCWA's chlorine system has been designed to minimize the potential of a chlorine release. There are two stages associated with the chlorine delivery system. Firs"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079923,
      "SummaryText": "t is storage and the other stage is for feed control of the chlorine into the water treatment process. Both rooms are serviced by a chlorine scrubber system.  This system neutralizes the chlorine atmosphere by pumping the contaminated air out of the room and scrubbing it through a column of caustic soda (the chemical reaction of chlorine and caustic soda forms sodium chloride).  This system is capable of neutralizing at a minimum an entire one ton cylinder of chlorine without replacing the caustic soda.   The scrubber's caustic solution is sampled on a quarterly basis so the desired percentage specified by the manufacture is maintained.\n\n\n\nThe delivery system consists of two \"banks\" consisting of four one-ton cylinders, with one side being used and the other in stand-by mode or empty and ready for cylinder change out.  The maximum number of ton cylinders stored on site is 16 for a total of 32,000 lbs. of chlorine.  The chlorine is introduced into the system by utilizing the gas valve connection point, instead of the liquid valve.  Using this configuration limits chlorine draw to 400 pounds per day (faster withdrawals will freeze the valve and manifold, further limiting withdrawal rates).  A pneumatic valve actuator is attached immediately after leaving the cylinders, allowing for the capability for an emergency shut-down from outside the chlorine storage room or through the SCADA system.  After leaving the ton cylinders, the chlorine is delivered throughout the system under a vacuum.  Any leaks that may occur would allow the vacuum system to draw ambient air into the lines instead of allowing chlorine to escape.  Any leak in the vacuum system would shut down the chlorination system and alarms will be triggered on the SCADA system, notifying the operating staff.\n\n\n\nEmergency Response Plan:\n\nCCWA policy dictates that staff will repair only small releases such as those created by defective packing gaskets or valve packing leaks that can be repaired quickly and safely, "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079923,
      "SummaryText": "without exposure to staff.  All other releases will be handled by a multi-agency hazardous materials response unit.  This unit is comprised of various San Luis Obispo County (SLOC) fire departments and CalFire, formerly known as the California Department of Forestry (CDF).  CDF will be the first emergency responder on site.  It has been agreed upon through consultation with the emergency responders that if a release should occur, that the entities will let the chlorine scrubber do its job.  If other mitigation would be necessary, such as ventilation, the emergency responders would take the lead.\n\n\n\nIf an accidental chlorine release arises at the PPWTP, 911 will be dialed by the designated employee, the PPWTP administrative assistant during normal hours, backed by the PPWTP supervisor.  The operator will be the designated caller after hours.  The caller will describe the nature of the incident, which includes, cause and  of the release.  The response to the emergency will be determined by the problem parameters.  The CalFire engine from the Shandon Station will be the initial responders which is located approximately 20 minutes from the PPWTP, with other units and technical advisers dispatched as required.  CCWA staff will consult with and advise the incident commander assigned to the site or act in any capacity that personnel are trained and knowledgeable in. The Water Treatment Supervisor is responsible for following CCWA's Emergency Response Plan and notifying the remaining agencies, as required.\n\n\n\nTraining:\n\nTraining is an important aspect of preparedness.  CCWA has in place a Process Safety Management program covering chlorine.  This program is mandated and enforced by Cal-OSHA.  All staff members are trained to the HAZWOPER first responder awareness level (FRA) to react to hazardous releases.  As mentioned above, a multi-agency response will probably occur due to a large release, with the CalFire engine from Shandon being first on-site.  The CalFire personnel "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079923,
      "SummaryText": "visit and inspect the PPWTP annually.  While at the facility, a tour of the facility is given with an in-depth explanation of the chlorine process. CCWA staff members also are trained in lock-out/tag-out, permitted confined space entry and rescue, hazard communication, the review for safe chlorine handling, PSM related training and other safety-related topics on an annual basis.  A chlorine \"B\" kit is kept on site for the use by emergency responders.\n\n"
    }
  ]
}