{
  "FacilityID": 1000086003,
  "FacilityName": "MCSD Wastewater Management Facility",
  "FacilityStr1": "795 Hiller Road",
  "FacilityStr2": null,
  "FacilityCity": "McKinleyville",
  "FacilityState": "CA",
  "FacilityZipCode": "95519",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06023",
  "LEPC": "Coastal Region",
  "FacilityLatDecDegs": "40.563900",
  "FacilityLongDecDegs": "-124.072200",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "mcsd@mckinleyvillecsd.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "McKinleyville Community Services District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "McKinleyville CSD",
  "OperatorStr1": "P.O. Box 2037",
  "OperatorStr2": null,
  "OperatorCity": "McKinleyville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95519",
  "OperatorZipCodeExt": null,
  "RMPContact": "Gregory P. Orsini",
  "RMPTitle": "General Manager",
  "FTE": 1,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000107458",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-03-28 00:00:00",
  "SafetyInspectionBy": "Cunsultant",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-03-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-03-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-03-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.94166,
  "FRS_Long": -124.1203,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107390,
      "AltID": "Wastewater Chlorination",
      "FacilityID": 1000086003,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000108663,
          "ProcessID": 1000107390,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000134252,
          "ProcessID": 1000107390,
          "ChemicalID": 62,
          "Quantity": 4200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000634252,
          "ProcessID": 1000107390,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086003,
      "SummaryText": "\n\nI. EXECUTIVE SUMMARY\n\n\n\nA. Introduction\n\nThe McKinleyville Community Services District (MCSD, the District) utilizes chlorine and sulfur dioxide to provide disinfection of treated wastewater at their Wastewater Management Facility (WWMF) located at 675 Hiller Road McKinleyville, CA. This facility stores and utilizes chlorine and sulfur dioxide in excess of the listed regulatory threshold and is therefore subject to the CCR Title 19, Division 2, Chapter 4.5 - California Accidental Release Prevention (CalARP) Program as administered by the California of Emergency Services\n\n\n\nB. Accidental Release Prevention and Emergency Policies\n\nMCSD is committed to providing a safe environment to its employees and surrounding community. The District recognizes the potential impact of handling chlorine and sulfur dioxide in conjunction with their wastewater treatment processes and has implemented several safety programs, procedures, and policies to prevent accidental releases. Safety programs are geared towards the prevention of an accidental release at the facility while policies and procedures outline detailed steps for operation and responses to specific release scenarios. In addition, these programs incorporate emergency procedures to mitigate the effects of a release if it does occur. In the event of an emergency, coordinators will assess the situation and notify outside responding agencies as necessary.\n\nVarious programs including the District's Hazardous Material Business Plan, the Process Safety Management Plan, and the District's Emergency Operations Plan are regularly reviewed and updated. District staff participates in CL2 and SO2 chemical training through California Water Environment Association CWEA in cooperation with the Arcata Fire Department. The District has contracted with the Northern California Safety Consortium to conduct training sessions and functional exercises in the implementation of these various plans.\n\n\n\nC. Stationary Source and Regulated Substance\n\nC"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086003,
      "SummaryText": "hlorine and sulfur dioxide are listed by state and federal agencies as a regulated substance. The federal Accidental Release Prevention program requires stationary sources with more than the threshold quantity of a regulated substance to be evaluated to determine the potential for and impacts of accidental releases from the covered process. Under conditions specified by the state and federal agencies, the owner or operator of a stationary source which stores more than the threshold quantity is required to develop and submit a Risk Management Plan.\n\n\n\nLiquid chlorine and sulfur dioxide are stored separately on-site in one-ton containers. The District, at maximum, stores 6000lbs of liquid chlorine and 4000lbs of sulfur dioxide in 1-ton (2000lbs) cylinders. The federal threshold quantity for chlorine is 2,500lbs. and the state threshold for sulfur dioxide is 500lbs., therefore, MCSD is required to develop and submit an RMP to the federal Environmental Protection Agency (EPA).\n\nTable 1. Covered Process Maximum Quantities and Largest Vessel Amounts\n\n\n\nD. Accidental Release Prevention Program\n\nMCSD has developed an accidental release prevention program for compliance with the OES CalARP regulation. The program includes but is not limited to the following elements:\n\n? Safety information regarding the chemical hazards, and operating and technical specifications for the equipment;\n\n? Written procedures for operating and maintaining the processes;\n\n? Training for employees involved with system operations and maintenance;\n\n? Written procedures for managing system changes and startup of a modified process;\n\n? Investigating releases and near misses and implementing measures to prevent recurrence;\n\n? Written procedures for conducting hot work on or near the regulated processes;\n\n? Contractor management policies to ensure contract employee safety while on facility premises; and\n\n? Employee involvement in program development and implementation.\n\n\n\nMCSD is committed to the preventio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086003,
      "SummaryText": "n and minimization of accidental releases of potentially hazardous chemicals. It is the policy of McKinleyville Community Services District to adhere to all applicable federal, state, and local regulations.\n\nOffsite consequences analysis Worst-Case and Alternative Case release parameters, scenarios, and results were analyzed using U.S. Environmental Protection Agency (EPA) approved RMP* Comp and ALOHA (Area Locations of Hazardous Atmospheres) modeling software. \n\n\n\nThe scenario results are summarized in Tables 2 and 3.\n\nCovered Process\n\nMaximum Inventory\n\nLargest Vessel Amount\n\nChlorination System\n\n6000lbs\n\n2000lbs\n\nSulphonation System\n\n4000lbs\n\n2000lbs\n\n\n\nTable 2. Worst-Case Release Scenario Results for Chlorine and Sulfur Dioxide.\n\nToxic Gas\n\nQuantity of Release\n\nRate of Release\n\nRelease Scenario / Dispersion Model\n\nRelease or Release Rate\n\nRelease Duration\n\nEst. Distance to Toxic Endpoint\n\nChlorine (Cl2)\n\n1 x 2000lbs Cylinder\n\n110lbs/min for 10-min. Worst-Case\n\nToxic Endpoint 0.0087 mg/L or 3ppm\n\nWorst-Case\n\nRMP*Comp\n\n2000lbs\n\n110lbs/min\n\n10 min.\n\nDistance to end point 0.9 miles\n\nWorst-Case\n\nALOHA\n\n2000lbs\n\n200lbs/min\n\n10 min.\n\n1747 Yards\n\nDistance to end point 1.0 miles\n\nSulfur Dioxide (Anhydrous)\n\n1 x 2000lbs Cylinder\n\n110lbs/min for 10-min. Worst-Case\n\nToxic Endpoint 0.0078 mg/L or 3ppm\n\nWorst-Case\n\nRMP*Comp\n\n2000lbs 110lbs/min\n\n10 min.\n\nDistance to end point 0.9 miles\n\nWorst-Case\n\nALOHA\n\n2000lbs 200lbs/min\n\n10 min.\n\n1463 Yards\n\nDistance to end point 0.83 miles\n\n\n\nTable 3. Alternate Case Scenario Results for Chlorine and Sulphur Dioxide\n\nToxic Gas\n\nQuantity of Release\n\nRate of Release\n\nRelease Scenario / Dispersion Model\n\nRelease or Release Rate\n\nRelease Duration\n\nEst. Distance to Toxic Endpoint\n\nChlorine (Cl2) Alternate-Case\n\n1 x 2000lbs Cylinder\n\n3.7lbs/min for 60-min.\n\nToxic Endpoint 0.0087 mg/L or 3ppm\n\nAlternate-Case\n\nRMP*Comp\n\n222lbs\n\n3.7lbs/min\n\n60 min.\n\nDistance to end point 0.1 miles*\n\nAlternate-Case\n\nALOHA\n\n222lbs\n\n3.7lbs/min\n\n60 min.\n\n148 yards\n\nDis"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000086003,
      "SummaryText": "tance to end point <0.1miles\n\nSulfur Dioxide (Anhydrous) Alternate-Case\n\n1 x 2000lbs Cylinder\n\n3.4lbs/min for 60-min.\n\nToxic Endpoint 0.0078 mg/L or 3ppm\n\nAlternate-Case\n\nRMP*Comp\n\n204lbs 3.4lbs/min\n\n60 min.\n\nDistance to end point 0.1 miles*\n\nAlternate-Case\n\nALOHA\n\n204lbs 3.4lbs/min\n\n60 min.\n\n120 yards\n\nDistance to end point <0.1miles\n\n\n\n\n\nE. Five Year Accident History\n\nThe District has utilized chlorine and sulfur dioxide since the Wastewater Management Facility was constructed in 1983. In over 36 years of handling these chemicals, the District has never experienced an accidental release. The District remains committed to maintaining this excellent accident history, and never experiencing an accidental release in the future. In recognition of this commitment, the District continues regular training of field personnel in the safe handling, and proper emergency response in the event of an accidental release. Safety meetings are conducted on a regular basis, and topics discussed and staff members attending are documented in District files.\n\n\n\nF. Emergency Response Program\n\nThe MCSD Wastewater Management Facility Emergency Response Program (ERP) includes the chemical-specific emergency response procedures for releases of chlorine, sulfur dioxide; and other extremely hazardous substances. The program identifies responsibilities of District personnel; coordination with outside agencies and emergency responders; hazardous material locations; engineering controls (e.g. alarms); the required personal protective equipment (PPE); and required emergency equipment.\n\nThe Emergency Response Plan is a section of the Emergency Response Program that outlines specific procedures for reducing the risk/impact of a release and emergency response procedures in the event of a hazardous gas, liquid, or solid release/spill at the WWMF. This document has been developed in cooperation with and has been integrated into the District's safety/emergency response documents.\n\n\n\nG. Planned Changes t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000086003,
      "SummaryText": "o Improve Safety\n\nThe District retained the engineering consulting firm of Oscar Larson and Associates to prepare a Disinfection Alternatives Study. The purpose of the Oscar Larson and Associates study was to examine the existing practices and procedures as well as alternate disinfection methodologies to evaluate revisions to the District's current practices and procedures that might reduce the risk of accidental release and/or potential off-site consequences in the event of an accidental release. Four alternatives, in addition to the existing conditions, were identified and evaluated in the final report. Cost estimates were prepared for both capital costs and maintenance costs of each alternative.\n\nThe final report prepared by Oscar Larson and Associates recommended the District continue the current practices utilizing liquid chlorine and sulfur dioxide or adopt\n\nadministrative controls to limit the inventory of chlorine and sulfur dioxide to avoid requirements for filing the Federal RMP. District staff feels the administrative controls to limit the inventory of chlorine and sulfur dioxide below the federal regulatory threshold limits to avoid the requirement to file the Federal RMP, offers little or no real potential to reduce the risk or potential off-site consequences of an accidental release.\n\nThe final report also recommended installation of a number of safety upgrades to further improve the safety of the existing facilities, and/or improve the District's ability to respond in the event of an accidental release. The District has approved and implemented all recommended improvements.\n\nImprovements implemented include:\n\n? Emergency Exhaust Fan Ducts\n\n? Additional Leak Detectors\n\n? Emergency Shut-Offs\n\n? Anchors to Chain Chemical Cylinders Down\n\n? Piping Revisions\n\n? Alarm System Modifications\n\n? Electronic Ton Container Scales\n\n? Wind Monitor and Telemetry\n\nThese improvements were implemented to further improve the safety and reduce the potential consequences of"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000086003,
      "SummaryText": " an accidental release of hazardous materials.\n\n\n\n"
    }
  ]
}