{
  "FacilityID": 1000080202,
  "FacilityName": "Loop 375 Station",
  "FacilityStr1": "10030 Railroad Drive",
  "FacilityStr2": null,
  "FacilityCity": "El Paso",
  "FacilityState": "TX",
  "FacilityZipCode": "79924",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48141",
  "LEPC": "El Paso City/County LEPC",
  "FacilityLatDecDegs": "31.900000",
  "FacilityLongDecDegs": "-106.390000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.epwater.org",
  "FacilityEmailAddress": "rrodriguez@epwater.org",
  "FacilityDUNS": 54254040,
  "ParentCompanyName": "El Paso Water Utilities-Public Service Board",
  "Company2Name": null,
  "CompanyDUNS": 54254040,
  "Company2DUNS": 0,
  "OperatorName": "El Paso Water Utilities",
  "OperatorStr1": "1154 Hawkins Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "El Paso",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79925",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000114235",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-07 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 31.902,
  "FRS_Long": -106.4175,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "12",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100139,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 1000080202,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125424,
          "ProcessID": 1000100139,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101381,
          "ProcessID": 1000100139,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000062206,
              "Process_NAICS_ID": 1000101381,
              "SafetyReviewDate": "2017-11-20 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Professional Engineer (P.E.) Design",
              "FR_Comments": null,
              "HazardReviewDate": "2017-11-20 00:00:00",
              "ChangeCompletionDate": "2018-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Containment vessel",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-11-20 00:00:00",
              "TrainingReviewDate": "2017-11-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-11-20 00:00:00",
              "EquipmentInspectionDate": "2014-02-01 00:00:00",
              "EquipmentTested": "Chlortainer and alarms",
              "ComplianceAuditDate": "2017-11-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000062974,
                  "PreventionProgram2ID": 1000062206,
                  "ProcessChemicalID": 1000125424
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080202,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-02-01 00:00:00",
    "ERTrainingDate": "2014-02-01 00:00:00",
    "CoordinatingAgencyName": "El Paso Fire Department",
    "CoordinatingAgencyPhone": "9157711000",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080202,
      "SummaryText": "1 EXECUTIVE SUMMARY\n\n\n\n1.1 INTRODUCTION\n\nEl Paso Water Utilities-Public Service Board (EPWU-PSB) Environmental Services Department performed the five year Risk Management Plan (RMP) update for the Loop 375 Station.  The Loop 375 Station is located at 10030 Railroad Drive in El Paso, Texas.  The location is depicted on the Site Location Map in Appendix C.  This booster station is surrounded by commercial, residential and vacant land.\n\n\n\n1.2 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nEPWU-PSB has prepared this Risk Management Plan (RMP) for the chlorination process at Loop 375 Station, in compliance with 40CFR68, found in the EPA's General Risk Management Program Guidance (GRM- PG), the registration for this process is presented in Appendix A.\n\n\n\nThe RMP objectives are:\n\n?    Hazard Assessment-communicate the extent of a possible chlorine release and identify potential receptors\n\n?    Prevention Program-develop strategies to prevent an accidental release\n\n?    Emergency Response Program-formulate contingency planning in the case of an accidental release\n\n\n\nHazard Assessment\n\nThe worst case scenario modeled by the Areal Locations of Hazardous Atmospheres (ALOHA&reg;) software indicates a vulnerable zone radius of 2.5 miles.  The alternative release analysis indicates a vulnerable zone radius of 13 yards. The Hazard Assessment shows an estimated population within the worst case scenario at 47,300 people.  The alternative \"more likely\" release estimated population is approximately 0 people.\n\n\n\nThe RMP rule requires the identification of environmental receptors within the toxic endpoint zone for both worst case and alternative scenarios. No environmental receptors were identified.\n\n\n\nPrevention Program\n\nThe goal of the Prevention Program is to integrate technologies, procedures, and management practices to minimize the probability of an accidental chlorine release. The Prevention Program incorporates safety information, hazard review, operating procedures, trai"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080202,
      "SummaryText": "ning, maintenance, compliance audits and incident investigations.\n\n\n\n\n\n\n\nEmergency Response Program\n\nThe Emergency Response Program is modeled after the EPWU-PSB's \"Emergency Response Action Plan\" and the Chlorine Institute Pamphlet 1 Chlorine Basics.  The Emergency Response Program incorporates an emergency response plan, equipment procedures and training in relevant procedures for employees involved in the chlorination process.  \n\n\n\nMexico and The United States created the Jointed Contingency Plan (JCP), designed for rapid international response to contingencies associated with chemical hazardous substances on the inland border. The JCP provides a mechanism for cooperation between the El Paso, Texas, United States of America and Ciudad Juarez, Chihuahua, Mexico. The JCP is designed to protect the health, human safety and the environment by providing international guidance and coordinated responses between the two countries (Mexico-US).\n\n\n\n1.3 PLANNED CHANGES TO IMPROVE SAFETY\n\nEPWU-PSB plans to review and revise, as necessary, the chlorination process operating procedures in order to make certain that the operators understand the human factors that may lead to accidental releases.  The emergency response plan is also reviewed and updated to reflect changes and ensure that employees are informed of changes.  \n\n\n\n2 HAZARD ASSESSMENT (40CFR68 SUBPART B)\n\n\n\n2.1 APPLICIBILITY (? 68.20)\n\nSection 112(r) of the Clean Air Act requires covered facilities to develop Risk Management Programs in an effort to \"prevent accidental releases and minimize the consequences of releases.\" Chlorine (CAS 7782-50-5), a regulated substance under section 112(r)(7) of the Clean Air Act, has a threshold quantity of 2,500 pounds as listed in Table 1 of ?68.130. The Loop 375 Station is subject to the RMP regulation because the chlorination process at the facility utilizes and/or stores a greater quantity of chlorine than the threshold quantity. Currently, the Loop 375 Station has the potential "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080202,
      "SummaryText": "to store up to two (2) one-ton chlorine containers in the chlorination storage area, a potential of 4,000 pounds of chlorine.\n\n\n\nUnder the RMP guidelines, the chlorination process at the Loop 375 Station qualifies as a Program 2 process. The process is not listed as Program 3 because the facility is not covered under the OSHA Process Safety Management requirements and the process is not part of the SIC codes listed in ?68.10(d)(1).  The chlorination process does not qualify for Program 1 status because a worst case release would reach a public receptor, therefore not satisfying ?68.10(b)(2).\n\n\n\n2.2 OFFSITE CONSEQUENCE ANALYSIS PARAMETERS (? 68.22)\n\n\n\n2.1.1 ENDPOINT\n\nAs specified in Appendix A for ?68.22(a)(1), the toxic endpoint for chlorine is 0.0087 mg/L. The toxic endpoint corresponds to a concentration of 3.0 parts per million (ppm).\n\n\n\n2.1.2 WIND SPEED AND ATMOSPHERIC STABILITY CLASS\n\nPer the RMP rule, a wind speed of 1.5 m/s and an F stability class, utilized in the worst case release analysis. Weak winds, nighttime cooling and little turbulent mixing characterize the F atmospheric stability class.  The atmosphere is considered stable under the F stability classification.  These wind and atmospheric conditions allow for maximum plume transport and are therefore appropriate for a worst case release analysis.\n\n\n\nThe atmospheric data used for the RMP's update was obtained from the National Weather Service (NWS) Office for the El Paso, Texas region. The NWS station is located at the Dona Ana County Airport at Santa Teresa, New Mexico, approximately 16 miles northwest of downtown El Paso.\n\n\n\nFor the alternative release scenario, the regulations allow the use of typical meteorological conditions for the geographic area. According to the NWS Office, the average wind speed for El Paso is 8.5 miles per hour (3.8 m/s). The atmospheric conditions would be best described by the C stability classification.  The C classification is representative of a neutral atmosphere wit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080202,
      "SummaryText": "h moderate turbulence. These wind and atmospheric conditions are more probable to occur and are therefore used in the alternative \"more likely\" release scenario.\n\n\n\n2.2.3 AMBIENT TEMPERATURE AND HUMIDITY\n\nFor the worst case analysis, the RMP rule requires the use of the highest daily maximum temperature in the previous three years and the average humidity. The three-year (January 2016 through January 2019) maximum temperature for El Paso is 111?F and the daily average relative humidity is 37%.\n\n\n\nFor the alternative release scenario, the regulations indicate the use of average temperature and humidity data. The average temperature for El Paso is 69.1?F and the daily average relative humidity is 37%.\n\n2.2.4 HEIGHT RELEASE\n\nAs indicated in the RMP rule, the worst case scenario analysis assumes a ground level release (0 feet). For the alternative release analysis, the regulation indicates that the release height be determined by the release scenario.  Since the process area is near ground level, the release was assumed to occur at ground level.\n\n2.2.5 SURFACE ROUGHNESS\n\nThe software model used in the offsite consequence analysis considers the roughness length (Zo) of the terrain as a parameter in the transport analysis.  For example, Grass (artificial, 7.5 cm high), Grass (thin to 50 cm), Vegetation (1 m to 2 m high) and a Large City (Tokyo) have a roughness length of 1 cm, 5 cm, 20 cm and 165 cm, respectively.  Since the modeling software utilizes a heavy gas model, the software considers a roughness length of up to 10 cm.\n\n\n\nThe topography of the area near the chlorine process is urban with obstacles in the immediate area such as trees or small buildings. The topography of the area near the chlorine process is desert rangeland with residential housing developments and several industrial areas. A roughness length of 10 cm, the upper limit for the heavy gas model, was selected for both analyses\n\n2.2.6 DENSE OR NEUTRALLY BUOYANT GASES\n\nIn accordance with the RMP rule, t"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080202,
      "SummaryText": "he dispersion model utilized for the hazard assessment accounted for gas density.  Since chlorine gas is 2.4 times heavier than air, the heavy gas model in Areal Locations of Hazardous Atmospheres (ALOHA&reg;) Version 5.4.7 was utilized for the dispersion analyses, instead of a buoyant gas model.\n\n2.2.7 TEMPERATURE OF RELEASEED SUBSTANCE\n\nFor the worst case analysis the RMP rule requires the use of the maximum of either the highest daily maximum temperature in the previous three years or the typical process temperature.  For dispersion modeling purposes, this temperature was 111?F, the highest daily temperature in El Paso, Texas for the previous three years (January 2016 through January 2019).\n\n\n\nFor the alternative release scenario, the regulations indicate that the substances may be released at process or ambient temperature. For modeling purposes, the chlorine was released at the average ambient temperature of 69.1?F.\n\n2.3 WORST CASE ANALYSIS (?68.25)\n\nThe worst case release scenario selected was the release of the entire contents of a one-ton chlorine container.  According to the EPA's Risk Management Program Guidance for Wastewater Treatment Plants, the worst case scenario \"need only consider the largest vessel, regardless of interconnections with pipes and other vessels.\"  The worst case analysis performed on the chlorine process indicates a vulnerable zone radius of 2.5 miles (Appendix B) as determined by the ALOHA&reg; modeling software.  The worst case analysis was conducted in compliance with the RMP rule, as presented below.\n\n2.3.1 NUMBER OF RELEASE SCENARIO\n\nFor the Program 2 process, the EPWU-PSB analyzed and reported \"one worst case release scenario that is estimated to create the greatest distance in any direction to [a toxic endpoint] resulting from an accidental release of regulated toxic substances from covered processes under worst case conditions\" (?68.25(2)(i)).\n\n2.3.2 DETERMINATION OF WORST CASE RELEASE QUANTITY\n\nThe RMP rule requires \"the wors"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000080202,
      "SummaryText": "t case release quantity shall be the greater of the following: for substances in a vessel, the greatest amount held in a single vessel, taking into account administrative controls that limit the maximum quantity; or for substances in pipes, the greatest amount in pipe taking into account administrative controls that limit the maximum quantity\" (?68.25(b)).  The one-ton (2,000-lb) worst case release quantity selected represents the greatest amount held by a single vessel.\n\n2.3.3 WORST CASE RELEASE SCENARIO FOR TOXIC GASES\n\nAccording to the RMP rule, \"for regulated toxic substances that are normally gases at ambient temperature and handled as a gas or as a liquid under pressure, the owner or operator shall assume that the quantity present  in a vessel ... [will be] released as a gas over 10 minutes.  The release rate shall be assumed to be the total quantity divided by 10, unless passive mitigation systems are in place, then the mitigation factor (i.e. 55 percent) assumes the release occurs in a fully enclosed space\" (?68.25(c)(1)) and EPA's Release Rates for Toxic Substances:\n\n\n\nCalculations:\n\n    2.3.3.1    QR= QS/10 *0.55\n\n    2.3.3.2    QR= 2000/10 * 0.55 = 110\n\n            QR = Release rate (pounds per minute)\n\n            QS = Quantity released (pounds)\n\n            0.55 = Mitigation factor\n\n\n\nThe chlorine building at the Loop 375 Station is considered a passive-mitigation system since largest the vessels are stored indoors.  The mitigated release rate considered was 110 lb/min (Formula 1).\n\n2.3.4 PARAMETERS TO BE APPLIED\n\nThe parameters used to determine the distance to the toxic endpoints is discussed in Section 2.2. The RMP rule states \"the owner or operator may use the methodology in the RMP Offsite Consequence Analysis Guidance or any commercially or publicly available air dispersion modeling techniques, provided the techniques account for modeling conditions and are recognized by industry as applicable as part of current practices\" (?68.25(g)).  The air dispersion model used in the offsite cons"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000080202,
      "SummaryText": "equence analyses was ALOHA&reg;.  The ALOHA&reg; transport and dispersion modeling software was developed by the Environmental Protection Agency (EPA) and the National Oceanic and Atmospheric Administration (NOAA).\n\n2.3.5 CONSIDERATION OF PASSIVE MITIGATION\n\nPassive mitigation systems are \"equipment, devices or technologies deployed to capture or control hazardous substances upon loss of containment, which function without human, mechanical or other energy input\" (?68.3).  Passive mitigation systems were considered for the worst case analysis.  Since the area where the chlorine ton containers are stored is fully enclosed, the partial building enclosure was considered as passive mitigation.\n\n2.4 ALTERNATIVE RELEASE SCENARIO ANALYSIS (?68.28)\n\nThe alternative release scenario selected considered a release rate of 0.00494 lb/min over a period of one minute.  The alternative release analysis performed on the chlorine process indicates a vulnerable zone radius of 13 yards (39 feet) (Appendix B). The ALOHA&reg; modeling software determined this radius after the appropriate parameter values were applied.  The alternative release analysis was conducted in compliance with the RMP rules, as presented below.\n\n2.4.1 NUMBERS OF SCENARIOS\n\nThe RMP rule requires at least one alternative release scenario be identified and analyzed for each regulated toxic substance held in a covered process (?68.28(a)).  Since chlorine is the only toxic substance used at this facility above the RMP threshold, one alternative release scenario was identified for the offsite consequence analysis.\n\n2.4.2 SCENARIOS TO CONSIDER\n\nAccording to the Chlortainer&reg; manufacturer, TGO Technologies, the scenario that maximizes the amount of chlorine gas released would be a break in the non-welded connection between the vacuum regulator and the Fail-Safe Valve (i.e. process piping release).  The scenario assumes that both the Fail-Safe Valve and vacuum regulator successfully operate.  In this scenario, the tota"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000080202,
      "SummaryText": " be inspected periodically as well as before and after each use.  Respiratory protection equipment used for emergency response should be inspected monthly and after each use.  Tools for emergency response personnel should be provided.  Tools will be inspected periodically and personnel should be trained in their proper use.  These may include:\n\n?    Hand tools\n\n?    Flashlights\n\n?    Emergency \"B\" kits for chlorine ton containers\n\n?    Portable chlorine monitor\n\n5.4 EMERGENCY RESPONSE TRAINING\n\nThe emergency response training program consists of in-house training which covers the ERP elements. New chlorine operators are given an initial training prior to the start of any work activities on the chlorine process.  In-house training on ERP procedures, PPE, and response equipment is conducted periodically with the chlorine operators and supervisory personnel.\n\n5.5 EMERGENCY RESPONSE PLAN REVIEW\n\nThe Emergency Response Plan will be periodically reviewed.  Changes at the facility, new information from emergency response exercises or incident investigations would be a reason to trigger an Emergency Response Plan review.  Employees must be informed of any changes to the Emergency Response Plan and the changes will be incorporated in the emergency response training program. \n\n5.6 PRE-EMERGENCY COORDINATION\n\nThe El Paso Fire Department HAZMAT Team will act as an outside responder in the event of (1) a release not readily controllable by well station personnel and equipment, or (2) a release that could affect, or potentially affect, the area surrounding the facility.\n\n5.7 INTERNATIONAL AGREEMENTS\n\n5.7.1 BACKGROUND INFORMATION\n\nIn order to maintain a good and diplomatic relationship in case of an emergency that might present a threat for Sister Cities, Ciudad Juarez, Chihuahua, Mexico and El Paso, TX, United States of America.  Mexico and The United States created the Joint Contingency Plan (JCP), designed for rapid international response to contingencies associated with chemical hazardous"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000080202,
      "SummaryText": "l amount of chlorine released is 0.00899 pounds [adjusted by passive mitigation to 0.00494 pounds] in a period of 2 seconds.  One minute release duration was utilized since this was the smallest release duration used by RMP-Submit, the EPA RMP reporting software.  The manufacture's release analysis is presented in Appendix D.\n\n2.4.3 PARAMETERS TO BE APPLIED\n\nThe parameters used to determine the distance to the toxic endpoints are discussed in Section 2.2.  ALOHA&reg; was used as the air dispersion model to calculate the distance to toxic endpoints.\n\n2.4.4 CONSIDERATION OF MITIGATION\n\nThe Chlortainer&reg; containment vessel was considered as an active mitigation system.  A mitigation factor for a building enclosure was not used for the alternative release scenario.  The alternative release scenario was based on a gas release analysis developed by the Chlortainer&reg; manufacturer (TGO Technologies) and is described in Section 2.4.2.  The major safety components of the Chlortainer&reg; vessel include: \n\n?    Whitney Electro-Pneumatic Actuated \"Fail-Safe\" Valve\n\n?    Whitney Ball Valve with Monel Body, Hastalloy C Ball and Stem\n\n?    Force Flow Hydraulic Load Cell and Scale\n\n?    Ashcroft Pressure-Vacuum Gage\n\n?    Chlorine Institute Specification Monel 400 Transfer Hose\n\n?    Self-Resetting Pressure Relief Valve\n\n?    Double Zinc Plated Custom Loader System \n\n2.4.5 FACTORS IN SELECTING SCENARIOS\n\nThe manufacturer of the Chlortainer&reg; system developed the scenario that as selected for the alternative release analysis.  Based on conservative assumptions, the alternative release scenario maximizes the amount of chlorine released, assuming the safety features of the Chlortainer&reg; system operate successfully.  The manufacturer's scenario is included in Appendix D.  \n\n\n\nThe alternative scenario, a break in the line between the Fail-Safe Valve and the vacuum regulator, would not compromise the successful mitigation of the Chlortainer&reg; system, therefore the Chlortainer&reg; system would"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000080202,
      "SummaryText": " survive the event that caused the release.\n\n2.5 DEFINING OFFSITE IMPACTS-POPULATION (?68.30)\n\n2.5.1 POPULATION ESTIMATE\n\nThe RMP rule requires an estimate of \"the population within a circle with its center at the point of the release and a radius determined by the distance to the [toxic] endpoint\" (?68.30(a)).  MARPLOT&reg; Version 5.1.1, a publicly available software program, was utilized to estimate the population based on 2010 U.S. Census data.  This mapping application is used widely to plan for and respond to chemical emergencies. This software was developed by the Environmental Protection Agency (EPA) and the National Oceanic and Atmospheric Administrative (NOAA).  \n\n\n\nThe estimated population within the worst case release radius is approximately 47,300 persons and 16,600 housing units.  The estimated population that resides within the alternative release radius is approximately 0 persons.\n\n2.5.2 POPULATION TO BE DEFINED\n\nPer ?68.30(b), the RMP must note \"the presence of institutions (schools, hospitals, prisons), parks and recreational areas, and major commercial, office, and industrial, buildings.\"  The public receptors inside the worst case and alternative release scenario vulnerable zone are listed in Table 2-1 and Table 2-2, respectively.\n\n\n\nTable 2-1: Public Receptors for Worst Case Release Scenario\n\nName    Approximate Distance from Process (mi.)    Approximate Direction from Process\n\nCommercial Park    1.6    N\n\nCommercial Park    0.8    S\n\nEl Paso City Government/Northeast Regional Command    1.9    SW\n\nFt. Bliss Rod and Gun Club    0.8    E\n\nResidential: El Paso    <0.2    E, N\n\nPARKS        \n\nColonia Verde Park    1.7    W\n\nDolphin Park    1.1    SW\n\nFranklin Park    0.5    W\n\nJorge Montalvo/Shearman Park    1.5    N\n\nMilagro Park    1.8    W\n\nPark-Redstone Rim Drive    2.4    NW\n\nPark-Silvercloud Drive    1.7    NE\n\nSkyline Youth Optimist Park    2.3    W\n\nStudent Memorial Park    2.1    SW\n\nVeterans Park    2.3    NW\n\nSCHOOLS        \n\nAndres High School    1.7    NW\n\nBradley Elementary School    2.5    NW\n\nCollins Elementary School    2.5    W\n\nCrosby Elementary School    "
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000080202,
      "SummaryText": "2.2    SW\n\nDesertaire Silver Hawks Academy    1.7    N\n\nDolphin Terrace Elementary School    1.1    S\n\nDowell Elementary School    1.8    W\n\nEl Paso Christian School    2.0    W\n\nFannin Elementary School    2.1    NW\n\nHarmony School of Innovation    1.9    W\n\nIrvin High School    2.2    SW\n\nMost Holy Trinity School    1.0    W\n\nNewman Elementary School    1.6    NW\n\nNorth Star Elementary School    2.0    N\n\nNortheast Christian Academy    1.2    SW\n\nParkland Elementary School    0.3    N\n\nParkland High School    0.8    W\n\nTerrace Hills Middle School    2.5    W\n\n\n\n\n\nTable 2-2: Public Receptors for Alternative Release Scenario\n\nName    Approximate Distance from Process (mi.)    Approximate Direction from Process\n\nNA    NA    NA\n\n\n\n2.5.3 DATA SOURCES ACCEPTABLE\n\nThe RMP rule requires that the population estimate be based from \"the most recent Census data or other updated information\" (?68.30(c)).  MARPLOT&reg; uses data from the 2010 U.S. Census and determines the population based on Census Block points located within or touching the circle defined by the radius.\n\n2.6 DEFINING OFFSITE IMPACTS - ENVIRONMENT (?68.33)\n\n2.6.1 ENVIRONMENTAL RECEPTORS\n\nThe RMP rule defines environmental receptors as national or state parks, monuments or forests, officially designated wildlife sanctuaries, preserves, refuges, or areas and federal wilderness areas.\n\n\n\nThe RMP rule requires the identification of environmental receptors within the toxic endpoint zone for both worst case and alternative scenarios.  Environmental receptors were not found inside the vulnerable zone in either the worst case or alternative release scenario.\n\n2.6.2 DATA SOURCES ACCEPTABLE\n\nThe RMP rule allows the use of U.S. Geological Survey (USGS) maps or any data source containing USGS data to identify environmental receptors. Environmental receptors were identified using the 7.5-minute topographic USGS maps located in Appendix C (Ft. Bliss NE and North Franklin Mountains).\n\n2.7 REVIEW AND UPDATE (?68.36)\n\nIn compliance with the RMP rule, the EPWU-PSB will \"update the offsite consequence analyses at least once e"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000080202,
      "SummaryText": "very five years\"(?68.36(a)).  If changes in processes, quantities stored or handled, or any other aspect of the facility might reasonably be expected to increase or decrease the distance to the endpoint by a factor of two or more, the EPWU-PSB will complete a revised analysis  within six months of the change and submit a revised RMP (?68.36(b)).\n\n\n\n2.8 DOCUMENTATION (?68.39)\n\nThe required records for the offsite consequence analysis are discussed in Sections 2.2 through 2.7.\n\n\n\n3 FIVE-YEAR ACCIDENT HISTORY (?68.42)\n\nThe RMP rule requires the documentation, within the previous five years, of \"all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site or known offsite deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\"  According to Raymond Garcia, Water Production Assistant Superintendent, accidental chlorine releases have not occurred at this facility in the last five years (January 2014 - January 2019).\n\n\n\n4 PROGRAM 2 PREVENTION PROGRAM (?68 SUBPART C)\n\nThe objective of this Program 2 Prevention Program is to reduce the risk to EPWU-PSB employees and the public of injury or death from accidental release of chemicals. The requirements for this prevention program are detailed in 40 CFR 68.48 through 68.60.\n\n4.1 MANAGEMENT SYSTEM\n\nThe EPWU-PSB has assigned the overall responsibility for the development, implementation, and integration of the risk management program to Paul Rivas (RMP Program Manager).  Additional individuals have been assigned responsibility for implementing individual requirements and will report to the RMP Program Manager on these matters.  Responsible individuals will communicate information to other employees involved in operation and maintenance of the regulated processes, as required.  All responsible individuals are listed in Appendix E.\n\n4.2 SAFETY INFORMATION (?68.48)\n\nThe EPWU-PSB has compiled and maintained up-to-date safety information r"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000080202,
      "SummaryText": "elated to the regulated substances, processes, and equipment at this facility. The contents of this section are summarized in the Safety Information Summary Sheet located in Appendix F.\n\n\n\n4.2.1 GENERAL SAFETY INFORMATION\n\nChlorine is a toxic gas stored as a liquid under pressure.  Chlorine is irritating and corrosive to the eyes, skin, and respiratory tract and reacts violently with easily oxidized materials. Considering that the boiling point for chlorine is -29.4? F, contact with evaporating chlorine or equipment releasing flashing chlorine can cause frostbite burns.  Chlorine gas is heavier than air and will tend to travel along the ground and fill low spaces and pits displacing air.\n\n4.2.1.1 SAFETY DATA SHEETS\n\nA Safety Data Sheet (SDS) for the chlorine process at the facility is included in Appendix G.  Per the RMP rule, the SDS meets the requirements of the OSHA Hazard Communication Standard (HCS) 29 CFR 1910.1200(9).\n\n4.2.1.2 MAXIMUM INTENDED INVENTORY\n\nThe maximum intended inventory of chlorine at this facility is 4,000 pounds stored in two (2) one-ton chlorine containers. \n\n\n\nTable 4-1: Maximum Intended Inventory\n\nChemical Name    Maximum Intended Inventory (pounds)\n\nChlorine    4,000\n\n4.2.1.3 SAFE OPERATING LEVELS\n\nStorage containers are designed for storage at the upper and lower extremes of ambient temperature in normal use and for the pressures that can develop at those temperatures (with additional safety factors).  One-ton containers of chlorine are designed to withstand pressures of at least 330 psig that can develop at a temperature of 165? F, the point at which the fusible plugs melt to relieve pressure in the event of a fire.  Temperatures may drop if chlorine gas is withdrawn to approaching the boiling point of-29.4? F, but are usually higher due to heat transfer from the surrounding air.\n\n\n\nDesign maximum flows are generally defined by the capacity of the chlorine flow regulating devices. Design minimums are typically zero. The composition will not c"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000080202,
      "SummaryText": "hange until the material is contacted with water, typically in the chlorinators or eductors.\n\n\n\nThe upper and lower operating limits may vary from storage containers to point of application depending upon whether the process is feeding vapor or liquid, where a vacuum regulator may be located, and whether the process utilizes an evaporator. The limits must be checked based upon the storage containers and the process design.\n\n\n\n4.2.1.4 EQUIPMENT SPECIFICATIONS\n\nSpecifications for the equipment utilized in the chlorination process included is in Appendix H.\n\n\n\n4.2.1.5 CODES AND STANDARDS\n\nThe codes and standards used to design, build, and operate the chlorine process are summarized in Table 4-2.\n\n\n\nTable 4-2: Codes and Standards\n\nSystem/Component    Commonly Used Current Code or Standard\n\nBuilding    Local fire code\n\nStorage Tanks, Relief Valves    Non-refrigerated Liquid Chlorine Storage, Chlorine Institute Pamphlet Number 5, 9th Edition, June 2017.\n\n\n\nAll Piping and Appurtenances    Piping Systems for Dry Chlorine, Chlorine Institute Pamphlet 6, 16th Edition, March 2013 and Chlorine Basics, Chlorine Institute Pamphlet 1, 8th Edition, May 2014.\n\n\n\nHoists    OSHA regulations, ANSI/ASME 830.16 Safety Standard for Overhead Hoists, and ANSI/ASME HST-1M-1 Performance Standard for Overhead Hoists\n\n\n\nAdditional codes, standards and guidelines that may also be relevant, useful or referred to in the above standards include the following Chlorine Institute Pamphlets:\n\n\n\n?    Pamphlet 9, Chlorine Vaporizing Systems;\n\n?    Pamphlet 17, Packaging Plant Safety and Operational Guidelines\n\n?    Pamphlet 155, Water and Wastewater Operators Chlorine Handbook.\n\n\n\n4.2.2 COMPLIANCE STANDARDS\n\nPer the RMP rule, the EPWU-PSB ensures that the chlorine process at the facility is designed in generally accepted good engineering practices.  The design and operation of the chlorine process adheres to industry-specific design codes and standards set by the Chlorine Institute and/or the American Society of Mechanical Engi"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000080202,
      "SummaryText": "neers.\n\n4.2.3 UPDATES\n\nIf a major change occurs in the chlorine process that makes the safety information inaccurate, the EPWU-PSB will promptly update the information accordingly.  \n\n\n\nItems that may be considered major modifications to the chlorine process at this facility include:\n\n\n\n?    Increasing on-site storage capacity of regulated chemicals\n\n?    Replacing a major equipment item such as a chlorinator with a large capacity model\n\n?    Increasing piping sizes\n\n?    Changing disinfection capacity volumes\n\n?    New building construction or major modification\n\n\n\nFuture major changes that occur at this facility will be documented in Appendix I.\n\n4.3 HAZARD REVIEW (?68.50)\n\n4.3.1 CONTENT\n\n4.3.1.1 HAZARDS ASSOCIATED WITH THE PROCESS AND REGULATED SUBSTANCE\n\nHealth Hazards:\n\nThe predominant hazards associated with the chlorination process are due to the acute toxicity of chlorine gas.  In the event of a chlorine release, the possible health hazards may vary from skin and respiratory irritation to death.  According to the Chlorine lnstitute's Pamphlet 1, Chlorine Basics (8th ed.), \"As duration of exposure and/or concentration increases, the affected individual may develop rapid breathing, wheezing and hemoptysis.  In extreme cases difficulty in breathing can progress to the point of death through cardiovascular collapse from respiratory failure.\"  Permissible and recommended maximum exposure limits for chlorine gas are presented in Table 4-3.\n\n\n\nTable 4-3: Public Receptors for Worst Case Release Scenario\n\nExposure Limit    Chlorine Concentration (ppm)1    Source\n\nPEL-C2;ERPG-13    1.0    OSHA; AIHA\n\nERPG-24    3.0    AIHA\n\nIDLH5    10    OSHA\n\n\n\n1.    At 25?C and 1 atmosphere\n\n2.    Permissible Exposure Limit - Ceiling: OSHA concentration which must not be exceeded during any part of the workday without respiratory protection.\n\n3.    Emergency Response Planning Guideline - Level 1: the maximum airborne  concentration below which it is believed that nearly all individuals could be exposed for up to one (1) hour wit"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000080202,
      "SummaryText": "hout experiencing other than mild transient adverse health effects or perceiving a clearly defined, objectionable odor.\n\n4.    Emergency Response Planning Guideline - Level 2: the maximum airborne concentration  below which it is believed that nearly all individuals could be exposed for up to one (1) hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\n\n5.    Immediately Dangerous to Life and Health: atmospheric concentration that poses an immediate threat to life or would cause irreversible or delayed adverse health effects or would interfere with an individual's ability to escape from a dangerous atmosphere.\n\n\n\nOther Hazards:\n\nChlorine is non-flammable and noncombustible; however, chlorine will support combustion as an oxidizing agent. Chlorine reacts and forms explosive compounds with acetylene, turpentine, ethers, ammonia, hydrocarbons (including oils and grease), hydrogen, and powdered metals.  According to the Chlorine lnstitute's Chlorine Basics (8th ed.), \"at ambient temperatures, dry chlorine, either liquid or gas, does not corrode steel.\" However, chlorine reacts with water to form highly corrosive, acidic solutions (hydrochloric and hypochlorous acids).\n\n4.3.1.2 OPPORTUNITIES FOR EQUIPMENT MALFUNCTIONS OR HUMAN ERRORS\n\nThe opportunities for equipment malfunctions or human errors that could cause and accidental release are listed in the What-If Hazard Review Analysis presented in Appendix J.\n\n4.3.1.3 SAFEGUARDS TO CONTROL HAZARDS OR PREVENT EQUIPMENT MALFUNCTION OR HUMAN ERROR\n\nThe safeguards used or needed to control the hazards or prevent equipment malfunction or human error are listed in the What-If Hazard Review Analysis presented in Appendix J.\n\n4.3.1.4 DETECTION AND MONITORING OF RELEASES\n\nThe ambient air in the chlorination process area is continuously monitored for chlorine gas.  The area monitor is set to alarm at 1.0 ppm.  The maintenance a"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000080202,
      "SummaryText": "nd calibration of the monitors are performed in accordance with the manufacturer's recommendations.\n\n4.3.2 QUALITY ASSURANCE\n\nThe EPWU-PSB has determined that the chlorine process was designed, built, and operated in accordance with the applicable codes and industrial guidelines presented in Section 4.2.1.5.\n\n4.3.3 DOCUMENTATION\n\nThe EPWU-PSB has documented the results of the hazard review and will ensure that any problems identified will be resolved in a timely manner. The Hazard Review Checklist is presented in Appendix K.\n\n4.3.4 UPDATES\n\nThe hazard review will be updated at least once every five years.  The EPWU- PSB will also conduct reviews whenever a major change in the process occurs. Issues identified in the review will be resolved before startup of the changed process occurs.\n\n4.4 OPERATING PROCEDURES (?68.52)\n\nThe EPWU-PSB has documented written operating procedures that provide clear instructions or steps for safely conducting activities associated with each covered process consistent with the safety information for that process.\n\n\n\nThe operating procedures address the following:\n\n?    Initial startup\n\n?    Normal operations\n\n?    Temporary operations\n\n?    Emergency shutdown and operations\n\n?    Normal shutdown\n\n?    Startup following a normal or emergency shutdown or a major change that requires a hazard review\n\n?    Consequences of deviations and steps required to correct or avoid deviations\n\n?    Equipment inspections\n\n\n\nThe EPWU-PSB ensures that the operating procedures will be updated, if necessary, whenever a major change occurs and prior to startup of the changed process.  The EPWU-PSB operating procedures and reference sources are presented in Appendix H.\n\n4.5 TRAINING (?68.54)\n\n4.5.1 CERTIFICATION\n\nThe EPWU-PSB ensures that each employee presently operating the chlorination process and each employee newly assigned to the process have been trained or tested competent in the operating procedures listed is Section 4.4 that pertain to their duties.\n\n4.5.2 REFRESHER TRAININ"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000080202,
      "SummaryText": "G\n\nRefresher training is provided periodically to each employee operating the chlorination process to ensure that the employee understands and adheres to the current operating procedures of the process.  An attendance log sheet for the most recent refresher training is included in Appendix M.\n\n4.5.3 TRAINING PROVIDER\n\nThe EPWU-PSB uses training conducted by in-house personnel, chlorine vendors and El Paso Fire Department.  Chlorine safety training is conducted by EPWU-PSB personnel.  Training on Chlorine Institute \"B\" Kits is conducted by chlorine vendors. Emergency training exercises have been conducted with the El Paso Fire Department HAZMAT Teams.\n\n4.5.4 UPDATES\n\nThe EPWU-PSB ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change.\n\n4.6 MAINTENANCE (?68.56)\n\n4.6.1 MAINTENANCE PROCEDURES\n\nThe EPWU-PSB has prepared and implemented procedures to maintain the on-going mechanical integrity of the chlorination process equipment.  Chlorination process equipment vendors have provided maintenance procedures and instructions.\n\n4.6.2 TRAINING\n\nThe EPWU-PSB has trained each employee involved in maintaining the on-going mechanical integrity of the chlorination process.  To ensure that each employee can perform the job task in a safe manner, each employee was trained in the hazards of the chlorine process, in how to avoid or correct unsafe conditions, and in the procedures applicable to the employee's job tasks.\n\n\n\n4.6.3 CONTRACTORS \n\nAlthough the EPWU-PSB does not anticipate using outside maintenance contractors for the chlorination process, the EPWU-PSB certifies that any such contractors will be trained to perform the required maintenance procedures.\n\n\n\n4.6.4 INSPECTIONS\n\nThe EPWU-PSB performs inspections and tests on chlorination process equipment. Inspection and testing procedures follow recognized and generally accepted good engineering practices.  The frequency of inspections and tests of process equipment i"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000080202,
      "SummaryText": "s consistent with applicable manufacturers' recommendations, industry standards or codes, good engineering practices, and prior operating experience.  The certification of equipment inspections and maintenance procedure review is presented in Appendix N.\n\n\n\n4.7 COMPLIANCE AUDITS (?68.58)\n\n4.7.1 CERTIFICATION\n\nThe EPWU-PSB certifies that they have evaluated compliance with Program 2 Prevention Program requirements at least every three years to verify that the procedures and practices developed under the rule are adequate and are being followed.  The Compliance Audit Checklist is presented in Appendix 0.\n\n4.7.2 AUDITOR(S)\n\nThe compliance audit will be conducted by at least one person knowledgeable in the process.\n\n4.7.3 AUDIT REPORT\n\nThe EPWU-PSB will prepare a report of the audit findings based on the results of the Compliance Audit Checklist presented in Appendix 0.\n\n4.7.4 RESPONSES TO AUDIT REPORT\n\nThe EPWU-PSB will promptly determine and document an appropriate response to each of the findings of the compliance audit and document that deficiencies have been corrected.\n\n4.7.5 PROCESS AUDIT HISTORY\n\nThe EPWU-PSB will retain the two (2) most recent compliance audit reports within the prior five-year period. These reports are presented in Appendix P.\n\n4.8 INCIDENT INVESTIGATION\n\nThe EPWU-PSB will investigate each incident that resulted in, or could reasonably have resulted in a catastrophic release.  An incident investigation will be initiated as promptly as possible, but no later than 48 hours following the incident.  At the conclusion of the investigation, a summary will be prepared utilizing the Incident Investigation Form presented in Appendix Q.\n\n\n\n5 EMERGENCY RESPONSE\n\n5.1 EMERGENCY RESPONSE COORDINATION ACTIVITIES \n\nThe owner operator is responsible for meeting with emergency responders and making the emergency responders aware of the quantities and types of chemicals and ensure awareness of risks associated with the processes.  This will be accomplished during"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000080202,
      "SummaryText": " the annual Fire License Permit inspection.  Starting in 2021, schedules will be established with emergency response officials for conducting field and table top exercises required under ?68.93(b).\n\n5.2 EMERGENCY RESPONSE PROGRAM (?68.95)\n\nThe purpose of the Emergency Response Program is to protect public health and the environment in the event of an accidental chlorine release.  Since this facility will respond to chlorine releases, the EPWU-PSB has complied with the requirements of ?68.95, as described in the sections below.\n\n5.2.1 BACKGROUND INFORMATION\n\nEmergency contact information for the personnel involved with the Emergency Response Plan (ERP) for this facility is presented in Appendix R.\n\n\n\nFigure 5-1 EPWU-PSB Well Station Organizational Chart\n\n\n\n \n\n\n\n\n\nFigure 5-2 Emergency Response Roles & Responsibilities\n\nRole/Responsibility    Personnel\n\n    Day Shift    Night Shift    Other Times\n\nEmergency Response Plan Implementation    Well Station Superintendent\n\nEmergency Response Coordination    Operations Supervisor    Call-Duty Supervisor    Call-Duty Supervisor\n\nInitiating the Emergency Response Plan    Any Employee    Any Employee    Call-Duty Supervisor\n\nInternal Communications    Operations Supervisor    Call-Duty Supervisor    Call-Duty Supervisor\n\nExternal Communications    Ranking On-Site Supervisor    Ranking On-Site Supervisor    Call-Duty Supervisor\n\nEmployee/Visitor Accounting    As Assigned    As Assigned    NA\n\nFirst Aid/Rescue    B & C Operator    Call-Duty Supervisor    Call-Duty Supervisor\n\nEmergency Repair    D & E Operator    As Assigned    As Assigned\n\nAgency Notification    Ranking On-Site Supervisor\n\n\n\n5.2.2 PURPOSE\n\nThe purpose of this Emergency Response Plan (ERP) is to effectively respond to a chlorine release to minimize injuries, lessen the impact to the community, minimize well station damage, and provide guidance to local emergency response personnel.\n\n5.2.3 TYPES OF EMERGENCIES\n\nIn the event of an equipment or human failure, potential sources for chlorine release are:\n\n1.    One ton chlorine container\n\n2.    Piping, v"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000080202,
      "SummaryText": "alves, and miscellaneous chlorine process equipment\n\n5.2.4 SCOPE\n\nThe scope of this program includes:\n\n1.    A chlorine release contained within the facility and controllable by plant personnel and equipment\n\n2.    A chlorine release affecting, or with potential to affect, the area surrounding the facility, such a release would require outside assistance\n\n\n\nSince the facility is normally unmanned, the well station crews will not respond to a chlorine release affecting, or with potential to affect, the area surrounding the facility.  Such a release would require outside assistance.  \n\n5.2.5 PLANNING AND PROCEDURES FOR AN EMERGENCY \n\nThe Well Station Superintendent is ultimately responsible for the implementation of the plan, keeping the plan current, and insuring that all employees are properly trained.  The roles and responsibilities for this ERP are presented in Table 5-2.  \n\n5.2.5.1 ALARM\n\nThe ERP is activated when the chlorine process alarm sounds.  The chlorine alarm sound when the chlorine in the air is at or above 1ppm or when well station personnel manually activate it.  The Central Control office is notified of the alarm via a radio transmission system.\n\n5.2.5.2 EMERGENCY EVACUATION AND ASSEMBLY AREAS\n\nUpon hearing the alarm, each employee is to secure his job, if safe to do so, and report to the assembly area (entrance gate).  Personnel should walk cross wind or stay upwind from any chlorine release.  \n\n5.2.5.3 EMPLOYEE AND VISITOR ACCOUNTING\n\nThe Operations Supervisor will assign an employee to account for all personnel and visitors at the well station, as necessary.  If anyone is not accounted for, the Operations Supervisor is to be immediately advised.  In the absence of the Supervisor, Operator A will be notified.\n\n5.2.5.4 OVERALL EMERGENCY RESPONSE COORDINATION\n\nThe Operations Supervisor is the responsible Emergency Response Coordinator.  Responsibilities include the following:\n\n?    Determine the need for a rescue team\n\nThe rescue team consists of Operator B &"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000080202,
      "SummaryText": " C with Operator A serving as back up.  Rescue team members must wear self-contained breathing apparatus (SCBA) and appropriate personal protective equipment (PPE) before entering the area.\n\n?    Determine the need for an emergency repair team\n\nThe emergency repair team consists of Operators D and E, with Operator A serving as a backup.  Emergency repair operations will be conducted only if the appropriate back-up operators and PPE is on hand.\n\n?    Determine the need for outside assistance and/or notification\n\nThe Emergency Response Coordinator is authorized to notify directly or through delegation, the appropriate outside agencies/neighbors for assistance and/or notification.  These may include the fire department, police (sheriff) department, Local Emergency Planning Committee (LEPC), industrial or residential neighbors, and anyone else who might provide assistance in responding to the emergency or who might be affected.\n\n?    Contact additional personnel to assist in the response\n\nThe Well Station Superintendent and the off-shift supervisor are to be contacted as soon as practical to assist in the response.  If there is no answer at the home phone, call the person's mobile/pager number.  When someone is reached, have that person contact the other.  That person can be use dot contact any needed non-supervisory personnel.\n\n5.2.5.5 OUTSIDE ASSISTANCE\n\nThe Emergency Response Coordinator will meet or will delegate an available person to meet at the front gate and escort any outside responders notified by the coordinator to assist in the response.  If the front gate is not accessible, the responders should meet a public road upwind of the release.\n\n5.2.5.6 MEDIA INQUIRY\n\nMedia inquiries should be referred to the Communications Section.  Arriving media representatives should be escorted to a safe area to wait for a Communications Section personnel or designated representative.  No one other the EPWU-PSB personnel and emergency responders are allowed to access the well station a"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000080202,
      "SummaryText": "t any time during the emergency without prior authorization. \n\n5.2.5.7 SHELTER/EVACUATION\n\nGenerally for this facility, even a significant release is likely to last 30-40 minutes before it is contained.  Therefore, sheltering in place is the standard response during an emergency.  While it is unlikely that this facility could have chlorine release requiring evacuation, nevertheless, the facility must be prepared for such an event.  If it is anticipated that the release cannot be expeditiously contained or is of a massive quantity, the evacuation option should be utilized.  \n\nNotify the fire department and suggest sheltering of residence using the Initial Isolation and Protective Action Distances described in the 2018 Emergency Response Guidebook.\n\nThe fire department will make the necessary notification of accordance with the established community-sheltering plan.  Residences will be notified to shut windows and close any ventilation system and listen for further advisories.\n\n5.2.6 EMERGENCY FIRST AID PROCEDURES\n\nAny injured employee suffering from chlorine inhalation should be sent to the hospital.  To the extent possible, another employee should accompany the injured employee.\n\n5.2.6.1 GENERAL\n\n?    Caution: Use proper PPE to ensure you do not become a casualty\n\n?    Prompt action is essential; Remove exposed person form contaminated area\n\n?    Remove contaminated clothing\n\n?    Wash contaminated body parts with cool, running water Give nothing by mouth if person is unconscious or convulsing\n\n?    Call a physician as soon as possible\n\n5.2.6.2 GAS INHALATION\n\nIf breathing has ceased:\n\n?    Remove to fresh air and remove and dispose any contaminated clothing\n\n?    Call for emergency medical assistance\n\n?    Begin cardiopulmonary resuscitation (CPR) immediately\n\n?    Trained personnel should administer humidified oxygen by inhalation as soon as possible\n\n\n\nIf breathing has not ceased:\n\n?    Move to fresh air and remove and dispose any contaminated clothing\n\n?    Place patient in a comfortable positi"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000080202,
      "SummaryText": "on\n\n?    Encourage slow regular breathing\n\n?    Trained personnel should administer humidified oxygen by inhalation as soon as possible\n\n?    Keep patient warm and at rest\n\n?    Render any other necessary first aid\n\n?    Position patient in chair; in severe cases have the patient lie down with the head and trunk elevated to a 45-60 degree position\n\n5.2.6.3 LIQUID CONTACT\n\n?    Flush contaminated skin with copious amounts of lukewarm water for at least 15 minutes; remove clothes while in the shower to ensure irrigation of all contaminated skin\n\n?    Do not attempt chemical neutralization or apply any ointments to damaged skin; apply dressing to protect affected area from contamination or further trauma\n\n?    Refer to a physician if irritation persists after irrigation or if skin is broken or blistered\n\n?    If ingested or liquid chlorine has contacted the mouth, flush with copious amounts of lukewarm water for at least 15 minutes and determine presence or absence of burns\n\n?    If severe burns occur in the mouth then esophageal burns may exist; refer individual to physician or hospital for treatment of ingestion of corrosives\n\n5.2.7 ALL CLEAR\n\nThe Emergency Response Coordinator is to give the all clear signal when the emergency condition is eliminated.  The notification is to be given verbally to all employees, emergency responders, affected neighbors and if involved, the news media.\n\n5.2.8 OUTSIDE REGULATORY PROCEDURES\n\n5.2.8.1 VERBAL NOTIFICATION\n\nEmergency Planning and Community Right to Know Act (EPCRA) Part 302 requires that any releases of chlorine equal to or greater than 10 pounds be reported to the following agencies:\n\n?    National Response Center (NRC)\n\n?    Local Emergency Planning Committee (LEPC)\n\n?    Texas Commission on Environmental Quality (TCEQ)\n\n\n\nContact with regulatory agencies is to be made by the ranking supervisor at the facility immediately after the incident has occurred. Table 5-1 summarizes the information that is typically requested by the NRC.\n\n\n\nFigure 5-1 Release Notificat"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000080202,
      "SummaryText": "ion Worksheet\n\n1. Chemical Released:    CHLORINE\n\n2. Listed Extremely Hazardous Substance (EHS):    YES\n\n3. Estimated Quantity Released:\n\n(If not sure, simply state \"10 pounds or more\":    \n\n4. Time and duration of release:    \n\n5. Medium/Media into which the release occurred (Air/Soil/Water):    \n\n6. Medical information regarding chlorine:    \n\n7. Evacuation plans if needed:    \n\n8. Name and number of the person to be contacted for further information:    \n\n\n\n5.2.8.2 WRITTEN FOLLOW UP\n\nAs soon as practicable after the release, a follow-up written notice is to be provided to the appropriate regulatory agencies.\n\n5.2.8.3 OSHA NOTIFICATION\n\nIn the event of a fatality or multiple hospitalizations, OSHA is to be notified within 48 hours in accordance with OSHA regulations.\n\n5.3 EMERGENCY RESPONSE EQUIPMENT\n\nThe personal protective equipment most often used during an emergency is respiratory protection equipment and/or chemical protective clothing. Respiratory protection should be provided for emergency response personnel and other personnel who need to remain in the affected area.\n\nThe following respiratory protection shall be provided:\n\n?    Respirators should be used if an individual is required to remain in elevated concentrations of chlorine\n\n?    Self-contained breathing apparatus (SCBAs)\n\n?    Supplied air (air-line) breathing apparatus having a smaller escape bottle of air; if other types of respiration are to be used, it should be ascertained that the individual will not be exposed to chlorine concentrations in excess of the OSHA's exposure limits\n\n\n\nAppropriate personal protective equipment should be provided and be readily accessible to all emergency response personnel. The following types shall be considered:\n\n?    Chemical protective clothing and suits\n\n?    Gloves\n\n?    Boots\n\n?    Goggles\n\n?    Face Shields\n\n?    Hard hats\n\n?    Safety Glasses\n\n\n\nAll personnel required to wear respiratory protection should be trained, tested annually on its proper use, and determined to be medically fit.  The equipment should"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000080202,
      "SummaryText": " substances in the inland border.   The JCP provides a mechanism for cooperation between the Sister Cities.  The Inland Border plan is not designed to overrule any statutory authorities held by either participant nor misconceive legally binding rights or obligation of the international and domestic laws.\n\n5.7.2 PURPOSE\n\nThe purpose of the JCP is based on La Paz Agreement, signed on August 14, 1983. The JCP is designed to effectively respond to significant chemical hazardous contingencies, chlorine in this scenario.  It also aims to protect the health, human safety, and the environment by providing international guidance, joint, and coordinated responses between sister cities (Mexico-US).\n\n5.7.3 PLANNING AND PROCEDURES FOR AN EMERGENCY\n\nAfter EPWU-PSB have implemented its Emergency Evacuation Plan, Mexico/U.S. Co-chairs coordinating authorities must be notified of the major chlorine leak.\n\n5.7.4 VERBAL NOTIFICATION\n\nThe JCP requires that any chemical, in this scenario chlorine, that has a potential to affect the environment along Inland Border Area must be reported immediately to the following centers, telephone numbers are described in in Appendix S:\n\n?    National Response Center (NRC)\n\n?    U.S. EPA Regional Coordinator\n\n?    U.S. JRT Co-chair\n\n?    National Communications Center (CENACOM)\n\n?    COATEA/PROFEPA\n\n?    International Boundary and Water Commission (IBWC)\n\n\n\nContact regulatory agencies by the ranking supervisor at the facility immediately after the incident has occurred.  Report immediately to the National Response Center (NRC) and later notify its counterpart, the National Communications Center (CENACOM), which operates 24 hours a day/7 days a week, providing the Notification Form requested by the JCP, provided in Appendix S.\n\n\n\nFollowing the JCP is the optimum rapid response for the sister cities in the event of an incident in international rivers and land.  Due to the nature of water treatment processes, other types of emergencies remain a possibility.  This plan repr"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000080202,
      "SummaryText": "esents the procedures during a worst case scenario realizing different actions may need to be taken for other emergencies.\n\n\n\n"
    }
  ]
}