{
  "FacilityID": 1000081230,
  "FacilityName": "Union Carbide Corporation TCO",
  "FacilityStr1": "3301 5th Avenue South",
  "FacilityStr2": "P.O. Box 471",
  "FacilityCity": "Texas City",
  "FacilityState": "TX",
  "FacilityZipCode": "77590",
  "Facility4DigitZipExt": "0471",
  "FacilityCountyFIPS": "48167",
  "LEPC": "Texas City-La Marque LEPC",
  "FacilityLatDecDegs": "29.369167",
  "FacilityLongDecDegs": "-094.945000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.DOW.com",
  "FacilityEmailAddress": "fhubehs@dow.com",
  "FacilityDUNS": 8073322,
  "ParentCompanyName": "UCC a Subsidiary of The Dow Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 1289008,
  "Company2DUNS": 0,
  "OperatorName": "Union Carbide Corporation",
  "OperatorStr1": "3301 5th Avenue South",
  "OperatorStr2": "P.O. Box 471",
  "OperatorCity": "Texas City",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77590",
  "OperatorZipCodeExt": "0471",
  "RMPContact": "Brooke Hrach",
  "RMPTitle": "Responsible Care Leader",
  "FTE": 350,
  "OtherEPAFacilityID": "77592NNCRB33015",
  "EPAFacilityID": "100000135631",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "FOP - O - 01916",
  "SafetyInspectionDate": "2015-01-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.37889,
  "FRS_Long": -94.94139,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101524,
      "AltID": "Oxo",
      "FacilityID": 1000081230,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102770,
          "ProcessID": 1000101524,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127241,
          "ProcessID": 1000101524,
          "ChemicalID": 129,
          "Quantity": 55000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627241,
          "ProcessID": 1000101524,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000101525,
      "AltID": "Vinyl Acetate 5",
      "FacilityID": 1000081230,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102771,
          "ProcessID": 1000101525,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127242,
          "ProcessID": 1000101525,
          "ChemicalID": 29,
          "Quantity": 183000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000127243,
          "ProcessID": 1000101525,
          "ChemicalID": 95,
          "Quantity": 18600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 95,
            "ChemicalName": "Ethylene  [Ethene]",
            "CASNumber": "74-85-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627242,
          "ProcessID": 1000101525,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627243,
          "ProcessID": 1000101525,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000101526,
      "AltID": "LGT/FARM",
      "FacilityID": 1000081230,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102772,
          "ProcessID": 1000101526,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127244,
          "ProcessID": 1000101526,
          "ChemicalID": 129,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 129,
            "ChemicalName": "Propylene  [1-Propene]",
            "CASNumber": "115-07-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000127245,
          "ProcessID": 1000101526,
          "ChemicalID": 98,
          "Quantity": 452000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000127246,
          "ProcessID": 1000101526,
          "ChemicalID": 95,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 95,
            "ChemicalName": "Ethylene  [Ethene]",
            "CASNumber": "74-85-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627244,
          "ProcessID": 1000101526,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627245,
          "ProcessID": 1000101526,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627246,
          "ProcessID": 1000101526,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081230,
      "SummaryText": "UNION CARBIDE CORPORATION\n\n\n\nTEXAS CITY OPERATIONS\n\n\n\nRMP Executive Summary\n\n\n\nDescription of the Facility and Purpose of Submittal \n\n\n\nUnion Carbide Corporation is a wholly owned subsidiary of The Dow Chemical Company. Union Carbide Texas City Operations (Texas City) has an integrated, effective, and compliant prevention program that meets U.S. EPA Risk Management Plan (EPA RMP) and OSHAA's Process Safety Management Program (OSHA PSM) requirements.  Key elements include process hazard analysis, written operating discipline, training and operator qualification, mechanical integrity program, management of change program, compliance audits, incident investigation and an emergency response program.\n\n\n\nTexas City is a major petrochemical production facility. The products manufactured at Texas City include: Oxo alcohols and aldehydes, organic acids, acetic esters and vinyl acetate. The regulated substances handled include: vinyl acetate, propylene, ethylene, propane, and methane.\n\n\n\nThis update is being submitted to remove a process whose assets have been sold.     \n\n\n\nKey Offsite Consequence Analysis \n\nThe worst case scenarios and alternative release scenarios for Texas City are as follow:\n\n\n\nWorst Case Scenario - Toxic Chemical\n\nFailure of a storage tank with vinyl acetate releasing 183,000 pounds of vinyl acetate.  Mitigation includes design and construction codes and standards for transportation equipment are met or exceeded as well as the equipmetn insepction at the required refulatory intervals.  Foam is used by the Emergency Response Team to minimize vapor releases.  \n\n\n\nAlternative Release Scenarios - Toxic Chemical\n\n1) A leak develops in transfer line due to weld crack or gasket failure releasing 6,000 pounds of vinyl acetate.  The storage tank is in Texas City's mechanical integrity program.  The storage tank is monitored by computers and trained, qualified operators.  Emergency Response would apply copious amounts of water to limit the impact on other chemical"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081230,
      "SummaryText": " storage in the surrounding area.\n\n\n\nWorst Case Scenario - Flammable Chemical\n\nFailure of the propane storage tanks releasing 452,000 pounds of propane.  The scenario is mitigated by the fact that the tanks are located in above ground earthen bunkers.  The storage tanks are in Texas City's mechanical integrity program.  The storage tanks are monitored by computers and trained, qualified operators.  Computer controlled emergency block valves isolate the system in the event of tank failure.  Emergency Response would apply copious amounts of water to limit the impact on other chemical storage in the surrounding area.\n\n\n\nAlternative Release Scenario - Flammable Chemical\n\nFailure of on the propane line resulting in a release of 47,100 lbs of propane.   This is mitigated by Texas City's mechanical integrity program and the fact that this is in a low traffic area.  Operators rounds verify that the line and its associated components continue to be in good operating condition.  Emergency Response would apply copious amounts of water to limit the impact on other chemical storage in the surrounding area.\n\n\n\nAccidental Release Prevention Policies\n\nTexas City is committed to operate and maintain its facility in a safe and environmentally friendly manner.  Texas City uses Dow Chemical's Global Management Systems and Emergency Response Plan to comply with applicable rules and regulations (EPA RMP and OSHA PSM) and to protect the safety of employees and public.\n\nTexas City designed its accident prevention program to comply with both EPA RMP and OSHA PSM.  Texas City incorporates the Dow Chemical Operating Discipline Management Systems (ODMS), which globalizes all Dow/Union Carbide facilities with the same environmental, health, and safety regulations.  Included in Dow's ODMS are elements addressing the following:\n\n-  Equipment Design: Vessels (including shipping containers) and other process equipment are designed according to recognized industry standards and/or governmental requi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081230,
      "SummaryText": "rements.\n\n-  Process Safety Information: Chemical hazard, process technology, and equipment information is documented, maintained up-to-date, and available to operating personnel.\n\n-  Reactive Chemical Process Hazard Analysis (PHA):RCPHAs are conducted every three years to identify major process hazard scenarios and to recommend corrective action(s) needed to prevent their occurrence.\n\n-  Layer of Protection Analysis: Design requirements for mitigation controls used for major process hazards are documented in Layers of Protection Analysis documentation.\n\n-  Operating Procedures:Operating procedures provide detail on how to safely operate a process and are maintained up-to-date.\n\n-  Operator Training/Qualification Program: The plant has a training and testing program which provides operators with the proper skills and knowledge prior to allowing them to independently operate a process.\n\n-  Technical Staff Training and Support: Trained technical staff employees are available 24 hours a day to support operations.\n\n-  Maintenance Procedures: The plant has specific procedures for maintaining process equipment so that it operates safely.\n\n-  Maintenance Training: The plant trains persons who perform routine or complex maintenance tasks on process equipment.\n\n-  Mechanical Integrity Program: Vessels (including shipping containers) and other process equipment are periodically tested and/or inspected to ensure safe operation of process equipment, following recognized industry standards and/or governmental requirements.\n\n-  Management of Change (MOC): The plant has a management system to ensure that modified facilities and processes will be safe to operate.\n\n-  Pre-startup Safety Review: Reviews are conducted just prior to startup to ensure that modified facilities and processes are safe for operation.\n\n-  Incident Investigation: The plant has a program to ensure that accidents and incidents are properly investigated to determine the cause(s) and to implement corrective actio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081230,
      "SummaryText": "n(s) that are needed to prevent the event from reoccurring.\n\n-  Employee Participation: The plant has a program to involve employees in prevention program elements.\n\n-  Hot Work Permit: The plant has a procedure to ensure that welding, cutting, and brazing are safely performed in areas where flammable or combustible material may be present.\n\n-  Contractor Safety Program: The plant has a procedure to ensure that contractors are properly trained and perform their work in compliance with safety requirements.\n\n-  Compliance Audits: Periodic corporate and plant-led audits are conducted to ensure that process operations comply with governmental and corporate requirements.\n\n-  Loss Prevention Principles: These consist of design, installation, modification and operating practices that relate to process safety and loss prevention.  \n\n\n\nThese general prevention elements are parts of an overall management system to prevent accidental chemical releases.  Texas City and its employees are committed to the standards that these management systems set and have specific accountabilities and controls to ensure that they are meeting their own high standards for accident prevention.\n\n\n\nEmergency Response Program\n\nTexas City maintains a written emergency response program to protect worker,safety public safety and the environment.  This program consists of procedures for responding to releases of hazardous substances, including fire or explosion.  This program is updated when necessary based on modifications made to the facility. \n\nThe procedures address all aspects of emergency response, including:\n\n-  Proper first-aid and medical treatment for exposures.\n\n-  Evacuation plans and accounting for personnel after an evacuation.\n\n-  Appropriate notification of local emergency response agencies and the public, when a release occurs.\n\n-  Post-incident cleanup and decontamination requirements.\n\n-  Inspecting, testing, maintaining, and using emergency response equipment.\n\n\n\nTexas City maintains "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081230,
      "SummaryText": "a trained emergency squad to handle fire, explosions, toxic vapor releases, spills and medical emergencies.  The facility trains and drills with local emergency responders to enhance their skills and tactics, including coordination with these local emergency responders, in responding to a chemical release.  Critiques are held on both the drills and actual chemical releases.  \n\nThe emergency response program provides essential planning and training for effectively protecting workers, the public and the environment during emergency situations.  Detailed emergency response plans are developed and coordinated with the Texas City/La Marque Local Emergency Planning Committee (LEPC).\n\n\n\nFive-Year Accident History\n\nTexas City has not had any chemical releases resulting in any known off-site deaths, injuries, significant damage, evacuations or sheltering-in-place in the past five (5) years.  \n\n\n\nPlanned Changes to Improve Safety\n\nTexas City continually strives to improve its safety-related systems.   Dow Chemical's ODMS requirements provides continuously improving  means of managing process hazards.  In addition, the implementation of Layers of Protection Analysis and the closure of any gaps determined in this analysis, using safety instrumented systems or other independent protection layers, will assure that all plant hazards are appropriately managed."
    }
  ]
}