{
  "FacilityID": 1000016916,
  "FacilityName": "TEAM INDUSTRIES ANDREWS, INC",
  "FacilityStr1": "3750 AIRPORT ROAD",
  "FacilityStr2": null,
  "FacilityCity": "ANDREWS",
  "FacilityState": "NC",
  "FacilityZipCode": "28901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37039",
  "LEPC": "Cherokee County LEPC",
  "FacilityLatDecDegs": "35.186",
  "FacilityLongDecDegs": "-83.895944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "WWW.TEAM-IND.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "TEAM INDUSTRIES ANDREWS, INC",
  "OperatorStr1": "3750 AIRPORT ROAD",
  "OperatorStr2": null,
  "OperatorCity": "ANDREWS",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28901",
  "OperatorZipCodeExt": null,
  "RMPContact": "LOU NELSON",
  "RMPTitle": "PLANT MANAGER",
  "FTE": 110,
  "OtherEPAFacilityID": "NCD981003197",
  "EPAFacilityID": "100000168427",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-07-18 00:00:00",
  "SafetyInspectionBy": "NC Dept. of Agriculture - James Lambert",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-10-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-10-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-10-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-12-18 00:00:00",
  "DeRegistrationEffectiveDate": "2014-12-08 00:00:00",
  "AnniversaryDate": "2015-10-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.18823,
  "FRS_Long": -83.87909,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Reduction below threshold of regulated propane",
  "_processes": [
    {
      "ProcessID": 1000021024,
      "AltID": "Propane Storage",
      "FacilityID": 1000016916,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000021352,
          "ProcessID": 1000021024,
          "NAICSCode": "333618",
          "_desc": {
            "NAICS_CODE": "333618",
            "NAICS_DESCRIPTION": "Other Engine Equipment Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000024928,
          "ProcessID": 1000021024,
          "ChemicalID": 98,
          "Quantity": 111000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000524928,
          "ProcessID": 1000021024,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000016916,
      "SummaryText": "1. Overview of Risk Management Program\nThis document describes the Risk Management Program (RMP) for the propane storage system located at the Team Industries Andrews, Inc. facility in Andrews, NC.  The program described in this document is intended to satisfy the requirements of the RMP regulations promulgated in Title 40, Code of Federal Regulations, Part 68 (40 CFR Part 68).  The RMP for the facility has been developed in accordance with the USEPA RMP Guidance for Propane Storage Facilities, dated March 2009. The goal of the facility's RMP is to prevent accidental releases of propane that can cause serious harm to the public and the environment and to mitigate the effects of releases that may occur.\n\nThe facility is required to comply with RMP requirements because more than 18,000 pounds of propane are stored at the facility and the propane is used partially for non-fuel purpose in the heat treat process.  Each device using propane has its own shut-off valve.  The main shut-off valve for the plant is near the tank located off the southeast corner of the facility and is clearly marked.  The propane gas line that feeds the facility runs across the paved drive in a westerly direction to the vaporizer and then connects to the facility along the east wall.\n\nNo other toxic or flammable substances are stored at the facility in excess of the threshold quantities listed in 40 CFR 68; consequently, only propane is addressed in this document.\n\n2. Accidental Release Prevention and Emergency Response Policies\nAs part of its overall emergency response program, TEAM Industries Andrews, Inc. coordinates response actions with the local fire department.  TEAM Industries Andrews, Inc. has made the fire department specifically aware of the propane system.  In the event of an incident involving the propane system, TEAM Industries Andrews, Inc. will contact the local fire department.\n\n3. Facility Description and Summary of Activities\nThe TEAM Industries Andrews, Inc., Andrews, North C"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000016916,
      "SummaryText": "arolina facility is a manufacturing operation utilizing a 128,000-square foot industrial building.  The site is located at 3750 Airport Road north of U.S. 19/74/129.  The area is a rural river valley.\n\nManufacturing operations include those associated with production of outboard motor components and parts.  Specific operations include machining, aluminum conversion coating, aluminum impregnation, electrodeposition painting, surface finishing, and heat-treating.\n\nThe facility consists of one 30,000 gallon propane tank.\n\n4. Worst-Case and Alternative Release Scenarios\nThe worst-case release scenario is failure of the 30,000 gallon propane tank when filled to the maximum amount allowed.  This release would theoretically result in an endpoint distance of 0.4 miles.\n\nThe primary alternative release scenario that is most likely to occur at TEAM would be a pull-away explosion occurring between the transfer vehicle and the propane storage tank.  According to Amerigas (TEAM's propane provider) the amount of gas that would be released within ten minutes time is 8,214 lbs.  This release would theoretically result in an endpoint distance of 0.2 miles.\n\n5. General Accidental Release Prevention Program\nSeveral measures are employed to prevent accidents involving the propane system.  The measures also help reduce the number of equipment failures and down time and allow for the most efficient use of the facility processes and raw materials.  The elements of the facility's accident and failure prevention program include safety information, hazard review, operating procedures, training, maintenance, incident investigation, and compliance audits.\n\n6. Five-Year Accident History\nThere have been no accidents related to the 30,000 gallon propane tank to occur at TEAM Industries Andrews, Inc. within the past five years.\n\n7. Emergency Response Program\nTEAM Industries Andrews, Inc. does not intend to have its employees directly respond to an accidental release of propane.  As part of its ove"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000016916,
      "SummaryText": "rall emergency response program, TEAM Industries Andrews, Inc. coordinates response actions with the local fire department.  TEAM Industries Andrews, Inc. has made the fire department specifically aware of the propane system and the most probable accidents that could occur with this system.  In the event of an accident involving the propane system, TEAM Industries Andrews, Inc. will immediately contact the fire department by telephone.\n\n8. Planned Changes to Improve Safety\nThere are currently no changes planned to improve safety."
    }
  ]
}