{
  "FacilityID": 1000007861,
  "FacilityName": "Horace Hinckley Water Treatment Plant",
  "FacilityStr1": "1604 N. Crafton Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Redlands",
  "FacilityState": "CA",
  "FacilityZipCode": "92374",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.077083",
  "FacilityLongDecDegs": "-117.120361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ci.redlands.ca.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Redlands",
  "OperatorStr1": "P.O. Box 3005",
  "OperatorStr2": null,
  "OperatorCity": "Redlands",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92373",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Gane",
  "RMPTitle": "Water Operations Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000162147",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-06-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-12-23 00:00:00",
  "DeRegistrationEffectiveDate": "2013-07-14 00:00:00",
  "AnniversaryDate": "2014-06-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.0644,
  "FRS_Long": -117.171,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009086,
      "AltID": "Chlorination",
      "FacilityID": 1000007861,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000009327,
          "ProcessID": 1000009086,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000010271,
          "ProcessID": 1000009086,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000510271,
          "ProcessID": 1000009086,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007861,
      "SummaryText": "FACILITY: CITY OF REDLANDS A? HORACE HINCKLEY WATER TREATMENT PLANT\n\nEXECUTIVE SUMMARY \n\nFACILITY DESCRIPTION\n\nThe Horace Hinckley Water Treatment Plant is a conventional water treatment plant which utilizes rapid mix, flocculation, sedimentation, filtration and disinfection. The Plant treats raw water from two sources: the Santa Ana River and the State Water Project. The untreated or raw water entering the plant contains sand, suspended particles, and microorganisms, collectively referred to as turbidity, that must be removed before the water enters the distribution system. The basic treatment processes include sand chamber, flocculation basins, sedimentation basins, and filters. Polymers and other chemicals are added at various points to condition the water. Chlorine is added for water disinfection. Chlorine is a regulated substance subject to the federal RMP requirements.\n\nCHEMICALS SUBJECT TO EPA'S ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe Horace Hinckley Water Treatment Plant uses the following chemical that is stored in quantities large enough to trigger the Accidental Release Prevention Program:\n\nChlorine - One-ton cylinders of liquid chlorine are imported to the facility by truck from a local supplier. A maximum of 8 one-ton chlorine cylinders are stored onsite in a ventilated building.\n\nACCIDENTAL RELEASES DURING PAST 5 YEARS\n\nThe Horace Hinckley Water Treatment Plant has not had any releases during the past five (5) years that resulted in any injuries, off-site evacuations, or property damage.\n\nPROCESS SAFETY MANAGEMENT ACCIDENT PREVENTION PROGRAM\n\nThe Horace Hinckley Water Treatment Plant is subject to OSHA's Process Safety Management (PSM) regulations for all equipment and operations associated with its chlorine system. The City of Redlands has developed a PSM safety program to minimize the potential for an accidental release. The PSM safety program includes the following elements:\nA?    Process Safety Information:  Enables the employer and employees invol"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007861,
      "SummaryText": "ved in operating the process to identify and understand the hazards posed by those processes involving highly hazardous chemicals.  \nA?    Process Hazard Analysis:  Review of the design of all equipment and controls for the chlorine system to ensure they are properly designed and installed.\nA?    Operating Procedures:  Updating of standard operating procedures to include specific information on safety procedures. All procedures must be reviewed and certified annually.\nA?    Training:  Initial safety training and 3-year refresher training for all operators and maintenance staff.\nA?    Mechanical Integrity:  Regular inspection of all equipment, monitoring systems and controls, with stringent documentation of all inspections.  Prompt corrective action for any non-conforming items identified by the regular inspections.\nA?    Management of Change:  A written procedure developed and followed to manage changes (except for \"replacement in kind\") to process chemicals, technology, equipment, procedures, and changes to facilities that affect the chlorine system.\nA?    Pre-Startup Safety Review:  Rigorous safety reviews conducted prior to system startup, if any equipment or operations are modified.\nA?    Compliance Audits:  Independent audits of the entire PSM program and RMP program every three years.\nA?    Incident Investigation:  Stringent investigation of any incidents that have the potential to have caused chlorine release.\nA?    Employee Participation:  Implementation of an employee participation program to ensure that all plant-wide staff are aware of the PSM program, and are actively consulted regarding safety issues.\nA?    Hot Work Permit:  Ensures that a hot work permit is issued for all hot work operations conducted on or near the chlorine storage area and the disinfection processes.\nA?    Emergency Planning & Response:  Development of a plant-specific emergency action plan.\nA?    Contractors:  Procedures to ensure that all contractors receive the same level of safety training that the City of Redlands"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007861,
      "SummaryText": " provides for its own employees.\n\n\nEMERGENCY RESPONSE PROCEDURES\n\nCity of Redlands staff utilizes its Emergency Action Plan to provide step-by-step procedures for emergency response in the unlikely event of an accidental release. The key elements of the Emergency Action Plan are as follows:\n\nA?    All plant staff (including administrative and clerical staff) is trained in the specific elements of the program.\nA?    The chlorine building is equipped with electronic gas detectors. The gas detectors have an audible alarm and alert the City of Redlands Operators.\nA?    In the event of a large release, the facility would immediately evacuate and contact the City of Redlands Fire Department. The Fire Department would conduct emergency response and repair the leak. \n\nCITY'S RECENT STEPS TO IMPROVE SAFETY\n\nNo additional recommendations precipitated from the 2009 Process Hazard Analysis Revalidation.  \n"
    }
  ]
}