{
  "FacilityID": 1000001842,
  "FacilityName": "Bowie Fertilizer, Inc.",
  "FacilityStr1": "204 West North Street",
  "FacilityStr2": null,
  "FacilityCity": "Miller",
  "FacilityState": "NE",
  "FacilityZipCode": "68858",
  "Facility4DigitZipExt": "0008",
  "FacilityCountyFIPS": "31019",
  "LEPC": "Buffalo County LEPC",
  "FacilityLatDecDegs": "40.929354",
  "FacilityLongDecDegs": "-099.390535",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bowie Fertilizer",
  "OperatorStr1": "P.O. Box 8",
  "OperatorStr2": null,
  "OperatorCity": "Miller",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68858",
  "OperatorZipCodeExt": "0008",
  "RMPContact": "Ricky Bowie",
  "RMPTitle": "President",
  "FTE": 0,
  "OtherEPAFacilityID": "058545-NB-001",
  "EPAFacilityID": "100000122878",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-08-13 00:00:00",
  "SafetyInspectionBy": "Nebraska State Fire Marshal",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.929,
  "FRS_Long": -99.38922,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002428,
      "AltID": "product storage",
      "FacilityID": 1000001842,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000002538,
          "ProcessID": 1000002428,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002674,
          "ProcessID": 1000002428,
          "ChemicalID": 56,
          "Quantity": 400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000502674,
          "ProcessID": 1000002428,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001842,
      "SummaryText": "\nBowie Fertilizer, Inc.\n204 West North Street, Miller, NE 68858\n                          Company Name\nPlant Location\n\nBowie Fertilizer, Inc., P.O. Box 8, Miller, NE 68858\n                          Mailing Address\n\nRisk Management Plan  - EXECUTIVE SUMMARY\n\nFacility Policy:\n\nThe management and employees operating each of our facilities are\ncommitted to the prevention of any accidental release of\nhazardous material transported or stored on our locations.  In\nthe event an accidental release should occur, we are prepared to\nwork with our Local Fire Company(s),  Emergency Response\nPersonnel, and other appropriate authorities deemed applicable\ndepending on the specific incident, to best mitigate any release\nand to minimize the impact of the release to people and the\nenvironment.\n\nFacility Information:\n\nThe primary activity of our company is NAICS code 422910, \"Farm\nSupplies Wholesalers\", however we are also engaged  in providing\n\"agricultural inputs\" that include the receiving, storage, and\nreloading of Anhydrous Ammonia for delivery to farmers in our\narea.   Although Anhydrous Ammonia is the only product subject\nto the EPA Risk Management Plan at this time, it should be noted\nthat we also handle crop protectants  and these are included in\nour planning, training, and maintenance programs, however only\nthe Anhydrous Ammonia facilities will be included in this report.\n\nAnhydrous Ammonia is received, stored, and distributed for direct\napplication to farm fields during the early spring and fall\nmonths.  During the balance of the year little if any product\ntransfer occurs .   The maximum quantity stored in pressurized\npermanent storage vessels at the location described is 255,999\nLbs. The maximum on site vessel size is 18,000  gallons, storing\n76,500 Lbs.  The maximum quantity handled at a given time would\nbe the off loading of a semi-trailer vehicle tank holding 40,000\nto 42,000 lbs.  There may be at any given time throughout the year 30 \nnurse trailers (implements of animal"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001842,
      "SummaryText": " husbandry) on this site which may\ncontain in total as much as 130,000# of anhydrous ammonia.  These\nare individual units and are not plumbed together and are situated at least\n5 feet from one another in the nurse trailer parking area.\n\nThe facility is operated on an \"as needed\" basis with staff\npresent only during the receiving and reloading of product for\ndelivery.  Total annual hours for these needs do not meet the\n2,080 hour requirement to qualify as a \"full time employee\" on\nsite, therefore item number 1.11 is Zero however, we have\npersonnel trained in the proper handling of anhydrous ammonia\nwithin 200 feet of our facility throughout the year.  Our\nfacilities have adequate lighting, and are inspected  at various\ntimes of day and night throughout the year.   Time expended for\nthese inspections is not included in our staffing calculation.\n\nWorst-case release scenario:\n\nThe \"worst-case release scenario\" is considered to be the release\nof the total contents of our largest Anhydrous Ammonia tank.  The\nmaximum quantity released would be 76,500 Lbs. based on 85 % tank\ncapacity as limited by design standards.   The distance to the\nendpoint (point of dispersion to 200 ppm) is based on EPA's RMP -\nComp Program (Version 1.06).  Possible public and environmental\nreceptors within the area has been provided to the County LEPC\n(Local Emergency Planning Committee) for their consideration and\nplanning.\n\nAlternative release scenario:\n\nThere has not been an actual release of Anhydrous Ammonia during\nthe last 5-years at the site.  We believe the most likely release\nwould be caused by a break in a transfer hose.  Transfer hoses\nare protected by manual and self closing excess flow valves so our \nalternative release scenario is based on the\nloss of contents from the largest hose used (off loading\ntransportation equipment).  The distance to the endpoint (point\nof dispersion to 200 ppm) is (Urban) 0.06  miles (317 feet)\nrounded to 0.1 mile (528 feet) per instructions by EPA guidance.\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001842,
      "SummaryText": "\nItem number 3.5 addressing quantity released shows a total\nquantity released of 79 pounds however due to the pressure in the\nline, the release rate is 200 pounds per minute which, given the\nrelease duration of 10 minutes would indicate a release of 2000\npounds.  When the pressure of anhydrous ammonia is reduced\nquickly, the material rapidly self-refrigerates to -28A?F.  Once\nthe liquid reaches this temperature the vaporization is quite\nslow, from where we estimate a 10 minute release duration.\nAdditionally, the excess flow valve which will stop the flow from\nthe tank when flow rates exceed the rating, has an orifice which\nwill allow 0.05 pounds per minute of ammonia to escape at 100\npsi.\n\nAccidental Release Program:\n\nOur Anhydrous Ammonia accidental release program is based on\nguidelines found in the American National Standards Institute,\nInc. (ANSI) standard K-61.1 \"Safety Requirements for the Storage\nand Handling of Anhydrous Ammonia; and the U.S. Occupational\nSafety and Health Administration (OSHA) standard 29CFR 1910.111\n\"Storage and Handling of Anhydrous Ammonia\".   We conduct \nemployee training on the safe handling, transportation and\ndistribution of Anhydrous Ammonia, and have installed safety\nequipment including, but not limited to: Excess flow valves,\nEmergency shut-off valves, Barriers to avoid damage by trucks\nor other vehicles, and Lockouts to prevent tampering when the \nsite is unattended.   We also maintain routine contact with our \nlocal fire department and emergency response personnel; and\nhave provided and/or participated in safety training exercises\non Anhydrous Ammonia.\nWe have developed an Emergency Action Plan for employees,\ncustomers, and visitor protection in event of fire, explosion,\ntornado, and other acts of god that initiates evacuation,\nemergency medical care, contacts for assistance, etc. for all\nareas of our company including the Anhydrous Ammonia facility\nincluded in this plan.  The primary emergency coordinator is\nlisted in the Regis"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000001842,
      "SummaryText": "tration Section of this document.  In the\nevent that the emergency coordinator is unavailable, the\nfollowing persons could be contacted:\nNAME                                              PHONE\n24-HOUR PHONE\n\nTim Taubenheim                                308-893-2100                               308-627-5032\n\nKirby Burden                                  308-457-2161\n308-752-4206\n\nFive - Year Accident History:\n\nThere has not been a release of Anhydrous Ammonia within the past\nfive years that has caused any death, injuries, or significant\nproperty damage at the facility; nor to our knowledge have\nresulted in offsite deaths, injuries, evacuations, sheltering in\nplace, property damage, or environmental damage.\n\n\nEmergency Response Program:\n\nThis facility is included in the written Community Emergency\nResponse Plan as prepared by  the Local Emergency Planning\nCommittee (LEPC), and the Nebraska Emergency Management Agency\n(NEMA) (former Nebraska State Civil Defense Agency).  We also\ninclude these materials in our own Emergency Action Plan in\naccordance with OSHA Standard 29CFR 1910.38.   We have provided\nState and Local authorities all Community Right-to-Know\ninformation requested as well as that required under SARA Title\nIII  (EPCRA).  Our written employee safety programs include pre-\nemergency planning and employee training in accordance with OSHA\nstandards, and are offered for review at any time by our Local\nEmergency Planning Committee (LEPC) to ensure they conform to the\ncommunity plan(s).  We actively encourage participation in our\nAnhydrous Ammonia and Propane training programs by the local fire\ndepartment(s), local emergency response team, community planners,\netc. that may be expected to respond to an incident at our site.\n\nPlanned changes to improve safety:\n\nSafety improvement is an on-going process at all of our\nfacilities.  Periodic evaluations are performed to assess the\nmaintenance of safe conditions.  There are no additional specific\nrecommendations for imp"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000001842,
      "SummaryText": "lementation at this time.\n\nAdditional Information:\n\nFor  additional information, response to questions, or comments,\nplease contact:\n\n\nRicky Bowie at:   308-457-2161.\n\n{end}"
    }
  ]
}