{
  "FacilityID": 1000054619,
  "FacilityName": "Moss Landing Power Plant",
  "FacilityStr1": "Highway 1 and Dolan Road",
  "FacilityStr2": null,
  "FacilityCity": "Moss Landing",
  "FacilityState": "CA",
  "FacilityZipCode": "95039",
  "Facility4DigitZipExt": "0690",
  "FacilityCountyFIPS": "06053",
  "LEPC": "Monterey Co. Env Health Dept.",
  "FacilityLatDecDegs": "36.804722",
  "FacilityLongDecDegs": "-121.775556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.vistraenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Vistra Energy",
  "Company2Name": null,
  "CompanyDUNS": 80457910,
  "Company2DUNS": null,
  "OperatorName": "Dynegy Moss Landing, LLC",
  "OperatorStr1": "PO Box 690",
  "OperatorStr2": null,
  "OperatorCity": "Moss Landing",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95039",
  "OperatorZipCodeExt": "0690",
  "FTE": 32,
  "OtherEPAFacilityID": "CAT080011653",
  "EPAFacilityID": "100000174036",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV-0000014B",
  "SafetyInspectionDate": "2018-05-17 00:00:00",
  "SafetyInspectionBy": "Monterey Co. Enivironmental Health Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-10-14 16:14:05",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-12-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-12-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-12-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.804722,
  "FRS_Long": -121.775556,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000068407,
      "AltID": "Ammonia (>20%)",
      "FacilityID": 1000054619,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000084314,
          "ProcessID": 1000068407,
          "ChemicalID": 57,
          "Quantity": 329940.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000069549,
          "ProcessID": 1000068407,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000042829,
              "Process_NAICS_ID": 1000069549,
              "SafetyReviewDate": "2015-11-30 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2015-12-01 00:00:00",
              "ChangeCompletionDate": "2016-07-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Underground vault into which released ammonia will drain.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installed bollards to protect piping.",
              "OpProceduresReviewDate": "2015-10-08 00:00:00",
              "TrainingReviewDate": "2015-10-08 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "SOP Review with Q&A",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": "Discussion and Review of SOPs",
              "MaintenanceReviewDate": "2015-06-01 00:00:00",
              "EquipmentInspectionDate": "2015-11-30 00:00:00",
              "EquipmentTested": "Ammonia feed pumps and air operated valves",
              "ComplianceAuditDate": "2013-12-05 00:00:00",
              "AuditCompletionDate": "2015-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2010-11-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000043515,
                  "PreventionProgram2ID": 1000042829,
                  "ProcessChemicalID": 1000084314
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000054619,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "North County Fire District",
    "CoordinatingAgencyPhone": "8316332578",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000054619,
      "SummaryText": "the worst-case scenario discussion above.  In addition, all surfaces underlying transfer hose hookups between the railcar and storage tank loading manifold are impervious and drain to the subterranean vault.  \r\n\r\nAccidental Release Prevention Steps\r\n\r\nMLPP is committed to public safety, the safety of plant personnel, continued reliable operation, and regulatory compliance.  Based on this commitment, the Plant Manager has overall responsibility for the development and implementation of the Risk Management Program.  A management system has been developed with clearly defined accountability and responsibility for the RMP program.\r\n\r\nTo help ensure that a worst-case or alternative release scenario event does not occur, MLPP maintains a release prevention program (level 2) with the primary focus of protecting the public and plant employees from the hazards associated with an accident or release involving ammonia.  The multifaceted program includes the use of:\r\n\r\n-\tAmmonia gas detectors and alarms to rapidly alert operators of any problem(s);\r\n-\tSafety information documenting safe process design;\r\n-\tProcess hazard analysis to evaluate chemical and process hazards;\r\n-\tOperating procedures to ensure proper system operation;\r\n-\tMaintenance, inspection and testing procedures to ensure employees working on and around the process are aware of hazards;\r\n-\tIncident investigation procedures to evaluate actual incidents and any near misses including root-cause analysis; and,\r\n-\tPeriodic Compliance Audits to ensure that the plant programs meet regulatory requirements and are working as designed.\r\n\r\nFive Year Accident History\r\n\r\nThere have been no releases of aqueous ammonia from the aqueous ammonia storage system or SCR systems that meet federal or state reporting requirements (e.g., no deaths, injuries, significant property damage, environmental damage, or sheltering in place) within the past five years.  The plant has maintained an excellent safety record throughout its operating"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000054619,
      "SummaryText": "Introduction\r\n\r\nPursuant to the requirements of California Code of Regulations and Federal EPA, this California Accidental Release Prevention Program document (CalARP/RMP) has been prepared to minimize the potential and threat of a release of aqueous ammonia at the Moss Landing Power Plant.  The Moss Landing Power Plant (MLPP), located at the intersection of Hwy 1 and Dolan road in Moss Landing, California, is owned and operated by Dynegy Moss Landing, LLC.  The preparation and maintenance of an RMP is required at MLPP due to the storage of aqueous ammonia above State and Federal Threshold Quantities.\r\n\r\nPlant Process Information\r\n\r\nMLPP utilizes ammonia-based Selective Catalytic Reduction to reduce NOx emissions from two large industrial boilers and four combustion turbines in compliance with a federally enforceable Permit To Operate administered, and overseen by the Monterey Bay Unified Air Pollution Control District.  Ammonia vapor, in the presence of a catalyst, reduces NOx compounds to elemental nitrogen and water, thereby reducing NOx emissions from the plant.  NOx is an ozone precursor pollutant.  In addition to using aqueous ammonia for NOx reduction, MLPP feeds aqueous ammonia to two pump skids for boiler feedwater pH control.\r\n\r\nAmmonia is stored on-site as aqueous ammonia (29.4%) in five 30,000 gallon stainless steel tanks.  In addition to the five storage tanks, the aqueous ammonia storage system is comprised of piping, feed and transfer pumps, vaporizing equipment, process controls, ammonia vapor release detectors, chemical injection pumps, and passive containment.   The five storage tanks have an aggregate storage capacity of 150,000 gallons of aqueous ammonia containing approximately 329,940 pounds of ammonia (NH3) as solute, exceeding state and federal Threshold Quantities.\r\n\r\nWorst Case Scenario\r\n\r\nMLPP has conducted a worst-case offsite consequence analysis consistent with regulatory guidance and requirements involving the unlikely catastrophic fai"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000054619,
      "SummaryText": "lure of one of the five 30,000 gallon aqueous ammonia storage tanks.  Though results indicate that offsite receptors could be affected, the magnitude and duration of the impacts are greatly mitigated by the design of the storage system which includes a concrete-containment dike underlying the storage tanks which drains to a subterranean vault.  Once the spilled or leaked contents of the containment have drained into the subterranean vault, the available surface area from which ammonia vapors are released is greatly reduced effectively terminating offsite impacts, a process requiring several minutes under worst case conditions.  A release represented by the worst case scenario is extremely unlikely because of the design of the system components, passive mitigation, and the prevention plan in place at MLPP.\r\n\r\nEPA release reporting databases and industry experience suggest that the worst-case release scenario as defined in the RMP regulations is so unlikely that it should not be used as the basis for emergency planning.  A more reasonable potential release scenario for emergency planning is presented in the alternative release scenario described in the following section.\r\n\r\nAlternative Release Scenario\r\n\r\nA credible alternative release scenario was formulated in accordance with US EPA guidance.  This scenario involves the failure of a transfer hose during off-loading of a shipment of aqueous ammonia from a railcar to the storage tanks.  Results of this credible alternative release event indicate that offsite receptors (industrial receptors to the north of the storage tanks) could potentially be affected.  Fortunately, the magnitude of the release, and thus severity of impact of offsite receptors, is mitigated by passive controls engineered into the design of the storage and offloading area.   Railcars received for offloading are positioned at one of three offloading points that are underlain by containment that drains to the subterranean vault previously described in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000054619,
      "SummaryText": "history and has never had a major ammonia release that could have had adverse effects on the public.\r\n\r\nEmergency Response\r\n\r\nIn the event of an ammonia release, MLPP has an emergency response program that includes coordination with the North County Fire Department.  Additionally, the plant has emergency operation procedures in place detailing appropriate emergency response actions to help mitigate the effects of any potential release.\r\n\r\nMaintaining A Safe Operation\r\n\r\nMLPP will continue to work safely and manage the hazards associated with ammonia so as to protect the health and welfare of the public, plant staff and the environment.  The Risk Management Program will be maintained to reduce the risk of accidental releases through training, procedures, equipment maintenance, and safe work practices.  Periodically, we will audit our program, review our Process Hazard Analysis, coordinate with community emergency response agencies, and will update our program as needed to assure safe and effective control and management of the aqueous ammonia storage system."
    }
  ]
}