{
  "FacilityID": 1000059179,
  "FacilityName": "Excelsior Springs Water Treatment Plant",
  "FacilityStr1": "29805 NE 108th St.",
  "FacilityStr2": null,
  "FacilityCity": "Excelsior Springs",
  "FacilityState": "MO",
  "FacilityZipCode": "64024",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29047",
  "LEPC": "Mid-America LEPC",
  "FacilityLatDecDegs": "39.287222",
  "FacilityLongDecDegs": "-094.223333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "waterplant@ci.excelsior-springs.mo.us",
  "FacilityDUNS": 7168404,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Excelsior Springs",
  "OperatorStr1": "29805 NE 108th Street",
  "OperatorStr2": null,
  "OperatorCity": "Excelsior Springs",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64024",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard Allwood",
  "RMPTitle": "Utility Service Director",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000107172",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-04-26 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-08-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-08-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-08-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-12-11 00:00:00",
  "DeRegistrationEffectiveDate": "2017-11-14 00:00:00",
  "AnniversaryDate": "2021-08-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.21278,
  "FRS_Long": -94.22139,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073787,
      "AltID": "Water Supply",
      "FacilityID": 1000059179,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000074949,
          "ProcessID": 1000073787,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000091075,
          "ProcessID": 1000073787,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000591075,
          "ProcessID": 1000073787,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059179,
      "SummaryText": "1.0    Accidental Release Prevention and Emergency Response Policies\n\n\n\nAt the Excelsior Springs Water Treatment Plant, we are committed to operating and maintaining our facilities in a safe and responsible manner.  We are developing and implementing a combination of an accidental release prevention program and an emergency action plan to help ensure the safety of our employees and the public, as well as protection of the environment.  This executive summary provides a brief overview of the comprehensive risk management activities that we are implementing, including:\n\n\n\n?    A description of our facility and use of substances regulated by EPA's risk management plan (RMP) regulation.\n\n?    An overview of our accidental release prevention program\n\n?    A five-year history for accidental release of chemicals regulated by EPA's RMP Rule.\n\n?    An overview of our emergency action plan.\n\n?    An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment.\n\n\n\n\n\n2.0    Stationary Source and Regulated Substances\n\n\n\nThe Excelsior Springs water supply and treatment facilities provide safe, reliable, and economical drinking water within the Excelsior Springs. In our water treatment plant process, we use the following chemical the EPA has identified as having the potential to cause significant off-site consequences in the event of a substantial accidental release:\n\n\n\nToxics:    Chlorine\n\n\n\nChlorine is used as a disinfectant to inactivate disease causing organisms and to maintain high quality potable water during distribution.  The maximum inventory of chlorine stored at the water treatment plant site is 8,000 pounds.\n\n\n\nFlammables:    There are no RMP-regulated flammable chemicals used or stored at this facility.\n\n\n\nOur operational procedures and planning efforts help us effectively manage the hazards that are posed to our employees, the public, and the environment by our use of chlorine"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059179,
      "SummaryText": ".\n\n\n\n\n\n3.0    Key Off-site Consequence Analysis Scenarios\n\n\n\nOn April 9, 2004, EPA revised the RMP Rule to remove the requirement that facilities include a brief description of the off-site consequences of hypothetical worst-case and alternative releases, as part of the Executive Summary.  This revision was made to address security concerns.\n\n\n\n\n\n4.0    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nWe maintain a number of routines to help prevent accidental releases and ensure safe operation.  The prevention program in place includes:\n\n\n\n1.    Regular review of safety information such as Materials Safety Data Sheet (MSDS), routine documentation of chlorine inventory, and regular updating of safety information to assure accuracy and completeness.\n\n2.    Hazard review of the chlorination system using industry recommended checklists to assess potential problems that could result in an accidental release, determine the safeguards needed to control hazards, or prevent equipment malfunction.\n\n3.    Written operating procedures that address initial startup, normal operations, temporary operations, emergency shutdown, emergency operation, normal shutdown, startup following a normal or emergency shutdown or a major change, consequences of deviations and steps required to correct or avoid deviations, and routine equipment inspections.\n\n4.    Regular employee training to assure that each plant operator has the required knowledge, skills, and abilities to safely carry out the duties and responsibilities assigned.\n\n5.    Written maintenance procedures and documentation to assure safe operation of critical equipment.  Operators routinely review these procedures prior to beginning maintenance procedures on the chlorination equipment.\n\n6.    Compliance audits every 3 years to assure that the Excelsior Springs Water Treatment Plant facility and its operators implement the risk management program and comply with the regulations.\n\n7.    Written plan for conducting an in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059179,
      "SummaryText": "cident investigation, should even a minor release or near-miss incident occur.\n\n\n\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Excelsior Springs and our employees are committed to the standard that these management systems set for the way we work, and we have specific assignments of responsibilities to ensure that we are meeting our standards for accident prevention.\n\n\n\n\n\n5.0    Five-Year Accident History\n\n\n\nWe keep records for accidental chemical releases of regulated substances (i.e., chlorine) that occur at our facility.  We have had no accidental releases involving chlorine during the past five years.  If an accidental release occurs, we are prepared to conduct a formal accident investigation to identify and correct the root cause of such an event.  \n\n\n\n\n\n6.0    Emergency Response Program\n\n\n\nOur employees will not respond to accidental releases of regulated substances.  Instead, our facility is included in the community emergency response plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA), and we maintain an emergency action plan that is coordinated with the Excelsior Springs Fire Department for emergency response actions.  Our action plan provides the essential notification for effectively protecting the workers, the public, and the environment during emergency situations.  We coordinate our action plan with the Clay County LEPC, the community emergency response plan, and the City of Excelsior Springs Fire Department\n\n\n\n\n\n7.0    Planned Changes to Improve Safety\n\n\n\nThe following is a list of improvements that we are planning to implement at our facility to help prevent and/or better respond to accidental chemical releases:\n\n\n\n1.    Replacement of, and preventative maintenance on, the chlorine feed equipment, including the chlorinators, injectors, rotometers, regulators, and feed tubing.\n\n"
    }
  ]
}