{
  "FacilityID": 1000054557,
  "FacilityName": "Point Thomson Production Facility",
  "FacilityStr1": "Point Thomson Unit",
  "FacilityStr2": null,
  "FacilityCity": "North Slope Borough",
  "FacilityState": "AK",
  "FacilityZipCode": "99734",
  "Facility4DigitZipExt": "9998",
  "FacilityCountyFIPS": "02185",
  "LEPC": "North Slope Borough LEPC",
  "FacilityLatDecDegs": "70.2",
  "FacilityLongDecDegs": "-146.3",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "emalaskacorrespondence@exxonmobil.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 93230040,
  "Company2DUNS": 1213214,
  "OperatorName": "ExxonMobil Alaska Production Inc.",
  "OperatorStr1": "P.O. Box 196601",
  "OperatorStr2": null,
  "OperatorCity": "Anchorage",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99519",
  "OperatorZipCodeExt": "6601",
  "FTE": 25,
  "OtherEPAFacilityID": "AKR000203539",
  "EPAFacilityID": "100000231297",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "AQ1201TVP01",
  "SafetyInspectionDate": "2020-02-20 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-07-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-12-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-12-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-11-03 00:00:00",
  "DeRegistrationEffectiveDate": "2023-10-03 00:00:00",
  "AnniversaryDate": "2020-12-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 70.172297,
  "FRS_Long": -146.255568,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "3.6",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "RMP not required",
  "_processes": [
    {
      "ProcessID": 1000068325,
      "AltID": null,
      "FacilityID": 1000054557,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000084232,
          "ProcessID": 1000068325,
          "ChemicalID": 93,
          "Quantity": 150000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000069487,
          "ProcessID": 1000068325,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000054557,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-12-15 00:00:00",
    "ERTrainingDate": "2015-10-07 00:00:00",
    "CoordinatingAgencyName": "North Slope Borough LEPC",
    "CoordinatingAgencyPhone": "9078520440",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "18 AAC 75.400, 40 CFR 355; applicable parts of 29 CFR 1910"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000054557,
      "SummaryText": "ExxonMobil Alaska Production Inc. (ExxonMobil) owns and operates the Point Thomson Production Facility on the Alaska North Slope.  ExxonMobil has recently permitted the facility as a gas cycling operation to process approximately 200 million standard cubic feet-per-day of gas to recover approximately 10,000 barrels-per-day of hydrocarbon condensate.  The recovered hydrocarbon condensate product will be sent to market via pipeline.  Most of the gas will be re-injected into the field reservoir, but a small portion of the gas will be used as fuel in the facility's combustion turbines to provide electrical power. \r\n\r\nExxonMobil has prepared this Risk Management Plan (RMP) based on Title 40, Part 68, Subpart G of the Code of Federal Regulations (CFR), and other published U.S. Environmental Protection Agency (EPA) guidelines.  The equipment at Point Thomson will process hydrocarbons.  The hydrocarbon streams throughout the plant will range in composition but will contain various levels of flammable gases along with heavier hydrocarbons.  ExxonMobil has determined that the Point Thomson Production Facility will have methane present in a quantity 5 times greater than the Chemical Accident Prevention Program threshold level of 10,000 pounds.  Methane is a regulated flammable gas.  Other flammable substances will be present in the process fluids, but none of these other substance will be present onsite at any one time in a quantity greater than the applicable threshold quantity.  It is estimated that the combined total of all flammable substances (methane, ethane, propane, etc.) within all the various equipment and piping is approximately 150,000 pounds.  The Point Thomson Production Facility was determined to be subject to RMP Program Level 1 requirements.  Program 1 imposes specific hazard assessment requirements and prevention and emergency response requirements.\r\n\r\nThe Point Thomson Production Facility is composed of many pieces of process equipment that will contain flam"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000054557,
      "SummaryText": "mable substances.  The process equipment includes a flash gas compressor, an injection compressor, three separators, a knockout flare, an export pipeline, and numerous lines of connecting pipes.  The composition of the flammable substances vary in the hydrocarbon stream as the stream is processed in the gas cycling plant to separate the hydrocarbon condensate (for pipeline distribution to the Badami Sales Oil Pipeline) and the remaining gas, which will be re-injected into the field reservoir or used on site as fuel gas.\r\n\r\nThe worst-case release scenario for the Point Thomson Production Facility is a release that occurs during the processing of the hydrocarbon stream in the piece of equipment containing the largest quantity of flammable substances.  The worst-case release assumes all flammable gases are released and form a vapor cloud.  For this worst-case scenario, the entire content of the vapor cloud is assumed to be within the flammability limits and the cloud is assumed to explode.  For the worst-case analysis, EPA guidance documents conservatively assume that 10 percent of the flammable vapor in the cloud participates in the explosion.  The distance to an overpressure level of one pound per square inch (psi) is defined in EPA guidance as the distance at which the impact is dangerous to the public.  For example, an overpressure of one psi may cause partial demolition of facilities, which can result in the shattering of glass windows, which may cause skin lacerations from flying glass or other serious injuries to people.\r\n\r\nExxonMobil included a blast analysis as part of the design basis for the facility.  A fire and explosion hazard analysis was conducted in the Front End Engineering Design phase to identify the siting requirements for the occupied buildings at the Point Thomson Production Facility.  The analysis evaluated the new equipment/facilities for potential flammable gas and liquid releases and the resultant fire and explosion hazards.  Plot of overpres"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000054557,
      "SummaryText": "hed the following practices and design measures to prevent potential accidents with offsite impacts.\r\n\r\n¿The facility utilizes an extensive alarm system to monitor the plant operations and a central control room with an operator present at all times.\r\n¿Access to the site is restricted to authorized personnel because of its remote location and through active 24-hour per day security and access control requirements.\r\n¿The Point Thomson Production Facility has an Emergency Response system  that includes site-specific safety and emergency response training and job-specific safety training.  Emergency drills will be conducted on a regular basis to test personnel knowledge of proper procedures.  \r\n¿Point Thomson Production Facility has a site-specific Facilities Integrity Management System and maintenance programs which prescribe inspection procedure frequencies for process equipment.\r\n\r\nNo accidental releases have occurred from the facility in the past five years.   The earliest possible date that the facility will begin operation is January 2016.  ExxonMobil will retain records supporting this RMP for a minimum of five years.\r\n\r\nA Clean Air Act Title V Operating Permit has not yet been issued to the Point Thomson Production Facility. ExxonMobil will apply for the Title V Operating Permit in 2016."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000054557,
      "SummaryText": "sure and impulse contours on the facility plot plan were developed to identify the potential impact of each explosion overpressure at each building of interest.  Based on these findings, design criteria for the facility were established.\r\n\r\nAn offsite consequence analysis was conducted using EPA's RMP Guidance for Offsite Consequence Analysis (March 2009).  Under the worst-case scenario, the overpressure endpoint from an explosion at Point Thomson could be felt 0.3 miles (1,584 feet) from its origin before dispersing sufficiently to no longer pose a health hazard to the public.  The impact distance from a worst-case explosion extends beyond the facility property boundary.\r\n\r\nExxonMobil utilizes a management system framework called the Operations Integrity Management System (OIMS) to effectively establish safety, health, and environmental expectations and manage operating integrity risks. OIMS is comprised of eleven elements which address all aspects of the business, including safety and security measures, to prevent unnecessary onsite human exposure and to minimize the potential for any offsite exposure. The eleven OIMS elements are:\r\n\r\n1)\tManagement, Leadership, Commitment and Accountability\r\n2)\tRisk Assessment and Management\r\n3)\tFacilities Design and Construction\r\n4)\tInformation/Documentation\r\n5)\tPersonnel and Training\r\n6)\tOperations and Maintenance\r\n7)\tManagement of Change\r\n8)\tThird-Party Services\r\n9)\tIncident Investigation and Analysis\r\n10)\tCommunity Awareness and Emergency Preparedness\r\n11)\tOperations Integrity Assessment and Improvement\r\n\r\nBy effectively managing the procedures, technology, and personnel interfaces that produce excellence in operations, ExxonMobil minimizes risks and thus effectively manages and minimizes the impact of process related incidents. Additionally, OIMS meets the requirements of OSHA's Process Safety Management Standard (PSM), which is also applicable to the Point Thomson Production Facility.\r\n\r\nSpecifically, ExxonMobil has establis"
    }
  ]
}