{
  "FacilityID": 1000076986,
  "FacilityName": "INEOS Joliet, LLC",
  "FacilityStr1": "23425 W. Amoco Road",
  "FacilityStr2": null,
  "FacilityCity": "Channahon",
  "FacilityState": "IL",
  "FacilityZipCode": "60410",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17197",
  "LEPC": "Will County LEPC",
  "FacilityLatDecDegs": "41.443392",
  "FacilityLongDecDegs": "-088.177523",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ineos.com/businesses/ineos-enterprises/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 962724261,
  "ParentCompanyName": "INEOS Joliet US Holdco LLC",
  "Company2Name": null,
  "CompanyDUNS": 6944334,
  "Company2DUNS": 6944334,
  "OperatorName": "INEOS Joliet, LLC",
  "OperatorStr1": "23425 W. Amoco Road",
  "OperatorStr2": null,
  "OperatorCity": "Channahon",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60410",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carlos Robles-Sanchez",
  "RMPTitle": "Plant Manager",
  "FTE": 250,
  "OtherEPAFacilityID": "60434MCCHM12MIL",
  "EPAFacilityID": "100000061853",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "197800ABZ",
  "SafetyInspectionDate": "2018-10-30 00:00:00",
  "SafetyInspectionBy": "US Coast Guard",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-03-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-03-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.44167,
  "FRS_Long": -88.17278,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000095803,
      "AltID": "Maleic Anhydride Unit",
      "FacilityID": 1000076986,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000097065,
          "ProcessID": 1000095803,
          "NAICSCode": "325194",
          "_desc": {
            "NAICS_CODE": "325194",
            "NAICS_DESCRIPTION": "Cyclic Crude, Intermediate, and Gum and Wood Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000119977,
          "ProcessID": 1000095803,
          "ChemicalID": 118,
          "Quantity": 3446200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000619977,
          "ProcessID": 1000095803,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000076986,
      "SummaryText": "INEOS Joliet, LLC - Joliet Facility\n\nEPA Risk Management Plan (RMP)\n\nExecutive Summary\n\n\n\n\n\nIntroduction and Policies \n\n\n\nThe INOES Joliet, LLC- Joliet Facility is located at 23425 West Amoco Road in Channahon, Illinois. The Joliet facility was purchased from Flint Hills Resources LLC on November 30, 2018. \n\n\n\nINEOS is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors, and the public while fully complying with applicable laws and regulations. INEOS's management philosophy goals are achieved through the implementation of its Environmental Health and Safety Management Systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators. \n\n\n\nThe purpose of this Risk Management Plan is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency response plans in the event of an accidental release, the five-year accident history of the facility, and planned changes to improve safety at the plant. \n\n\n\nStationary Source and Regulated Substances \n\n\n\nThe Joliet facility, operated by INEOS, is an intermediate chemicals facility located in Channahon, Illinois. The facility processes various chemicals that serve as intermediate materials to produce polyester fibers, fiberglass gasoline tanks, paints, wire coatings, plastics, insecticides, and food additives. As part of its Maleic Anhydride unit (MAN Process), the facility uses n-Butane, an EPA RMP-covered chemical, in quantities greater than the threshold quantity of 10,000 lbs. The n-Butane Sphere contains an inventory of 3,442,000 lbs of n-Butane, with another 4,200 lbs present in the n-Butane Vaporizer at any given time. \n\n\n\nThe facility is subject to the OSHA process safety management standard, 29 CFR 1910.119, and regulated under EPA Risk Management Program 40 CFR Part 68 Program Level 3 requirements."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000076986,
      "SummaryText": " \n\n\n\nAccidental Release Prevention and Emergency Response Policies \n\n\n\nThe accidental release prevention and emergency response programs in place at the facility are part of the policies established by FHR. These policies include: \n\n\n\n? Operating in compliance with required environmental permits and regulations. \n\n? Operating and maintaining the assets such that unintentional releases are minimized. \n\n? Operating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible. \n\n? Correcting findings identified in regular audits of the facility. \n\n\n\nINEOS is committed to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of its processes. The Joliet facility adheres to process safety policies, guidelines, and best practices that have been developed based on company and industry experience over the years. INEOS's practice is to implement the controls necessary to prevent releases of regulated substances to the environment. However, if a release does occur, trained INEOS personnel will respond to control and contain the incident. \n\n\n\nPrevention Program \n\n\n\nThe INEOS Joliet Chemical Plant MAN process is operating under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program. Ongoing analysis of the potential hazards of the process, detailed training of employees, and an emphasis on safety have contributed to process safety at the facility. The prevention program has identified hazards and taken steps to avoid potential accidental chemical releases. The executive summary details the management system in place to implement this prevention program. \n\n\n\nThe facility has had no RMP chemical release accidents over the last 5 years. \n\n\n\nEmployee Participation: \n\n\n\nEmployees are encouraged"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000076986,
      "SummaryText": " to participate in process safety management and accident prevention. Examples of employee participation range from compiling and updating technical information to participating as a member of a team that systematically analyzes new and modified processes for hazards. Teams that represent a cross-section of levels and areas of the facility are formed to revise and update safety standards and to investigate accidents and issue reports to appropriate personnel. Safety focus teams in each area promote individual responsibility for safe work behaviors. Some individual employee responsibilities include writing operating procedures and Job Safety Analysis (JSA) plans, serving as compliance auditors for the facility, and serving as members of the facility's Fire and Emergency Response Team. \n\n\n\n\n\nProcess Safety Information: \n\n\n\nDocuments are maintained describing process safety information for the MAN process. These documents describe chemical properties and associated hazards, limits for key process parameters, chemical inventories, and equipment design basis/configuration information. Chemical specific information, including exposure hazards and treatments, and emergency response considerations are provided in safety data sheets. The process operators use a computerized control system to assist them in managing the MAN process within the design ranges. \n\nThe facility also maintains numerous technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, electrical ratings of equipment, piping and instrument drawings, etc. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are properly maintained. \n\n\n\n\n\n\n\nProcess Hazard Analysis: \n\n\n\nA"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000076986,
      "SummaryText": " structured program has been established to help ensure that hazards associated with the RMP regulated process are controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place. \n\n\n\nA Hazard and Operability (HAZOP) study is the methodology used to perform these evaluations. HAZOP studies are recognized by OSHA as a systematic and thorough hazard evaluation technique. The studies are conducted using a team of people who have operating, maintenance, and engineering experience. A HAZOP study of the entire MAN process unit is completed every five years. \n\n\n\nThe HAZOP team's recommendations for improvement are reviewed with management, and recommendations are tracked until they are complete. The final resolution of each recommendation is documented and retained. \n\n\n\n \n\n\n\nOperating Procedures: \n\n\n\nWritten procedures are maintained for the MAN process that address various modes of process operations, including such activities as unit startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup following a turnaround or after an emergency shutdown. These procedures are used as a reference and refresher by experienced process operators and provide a basis for consistent training of new process operators. Operating procedures are reviewed annually. The procedures are located in the unit control room for ready-reference by process operators and are available electronically to all Facility employees on the Facility's internal information system, internet. \n\n\n\nTraining: \n\n\n\nIn addition to the written operating procedures, MAN process operators receive two other elements of formal training. Basic operator training is available at local institutions (e.g. Joliet Junior College) and consists of the essentials that process operators need to know about process equipment and controls. Basic operating training either through local institutions and/or"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000076986,
      "SummaryText": " through online CBT training is completed before an operator starts the training specific to the MAN unit. Unit-specific training is self-paced and is conducted in the MAN unit under the oversight of experienced process operators over a period of several months. An operator must become qualified in each operating area of the unit by demonstrating a hands-on mastery of every task before operating that area independently.. Refresher training is conducted at least every 3 years or for any changes to the process. Operators have input into training materials and frequency.\n\n\n\n\n\nContractors: \n\n\n\nContractors are utilized for construction and maintenance activities. Because some contractors work on or near process equipment, the facility has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform INEOS personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to initiating work. \n\n\n\nAll contractor employees must complete the Three Rivers Manufacturing Council Safety Course before they are allowed to work at the facility. Contractor employees must recertify in this course annually. In addition, the facility evaluates contractor employer safety programs and performance during the selection of the contractor. INEOS personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations. \n\n\n\nRefer to Policy CS-810-Contractor EHS Performance Policy for additional details. \n\n\n\nPre-Startup Safety Reviews (PSSR): \n\n\n\nPSSRs are conducted for any new facilities or modification that requires"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000076986,
      "SummaryText": " a change in the process safety information. The purpose of the PSSR is to ensure that safety features, equipment, procedures, and personnel are properly prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure that construction is completed in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention measures are properly implemented. \n\n\n\nMechanical Integrity: \n\n\n\nPractices and procedures are under continuous development and improvement in order to effectively maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include (1) conducting training, (2) developing written procedures and plans, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. The combination of these activities forms a system that maintains the mechanical integrity of the process equipment. \n\n\n\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to ensure that they perform their job in a safe manner. Written procedures ensure that work is performed in a consistent manner and also provide a basis for training. Inspections and tests are performed on process equipment to ensure that equipment functions as intended, and to verify that equipment complies with design standards and specifications. \n\nAnother integral part of the mechanical integrity program is quality assurance. The facility incorporates quality assurance "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000076986,
      "SummaryText": "measures into equipment purchases and repairs. This helps ensure that \n\nnew equipment is suitable for its intended use and that proper materials and spare parts are available when repairs are made. \n\n\n\nSafe Work Practices: \n\n\n\nSafe work practices are in place to ensure worker and process safety. Detailed and rigorous safety standards control entry into work areas and confined spaces, specify procedures to follow for isolating energy sources by lockout/tag-out and describe the permitting process for completing work in the facility. There are separate procedures for cleaning and isolating all major pieces of equipment. Safety standards and work procedures are reviewed annually by all personnel who use them. \n\n\n\n \n\n\n\nHot Work Permit: \n\n\n\nThe Facility has a hot work permit program that details areas which require a permit and those areas for which a permit is not required. A permit is required in process areas for all cutting, welding, spark producing equipment, etc., except in designated free burn areas \n\n\n\n\n\n\n\nManagement of Change: \n\n\n\nA comprehensive system to manage change has been implemented. This system requires that changes to process equipment, chemicals and process operating conditions are properly reviewed and authorized before being implemented. Operating procedures at FHR Joliet are controlled, reviewed, and approved in a process separate from the MOC process. Changes are reviewed to ensure that adequate controls are in place to manage any new hazards and to verify that existing controls have not been compromised by the change. Chemical hazard information, process operating limits, equipment information, and procedures are all updated to incorporate these changes. In addition, all personnel involved in the process are provided any necessary training on the change.   \n\n\n\n\n\n\n\nIncident Investigations: \n\n\n\nThe Facility promptly investigates incidents that resulted in, or reasonably could have resulted in a catastrophic release of a regulated substance. The goal"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000076986,
      "SummaryText": " of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees and contractors who could be affected by the findings.  Incident investigation reports are retained for at least five years, so that the reports can be reviewed during future HAZOP studies. \n\n\n\n \n\n\n\nCompliance Audits: \n\n\n\nTo ensure that the RMP and PSM programs are functioning properly, FHR Joliet periodically conducts targeted compliance audits. A complete audit of the entire PSM program is conducted every three years. The audit team develops findings that are reviewed with the management team for resolution. \n\nCorrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained. \n\n\n\n\n\nChemical Specific Prevention Steps: \n\n\n\nProcess hazards are managed to ensure continued safe operation. The PSM Program summarized previously is applied to the MAN production process. Collectively, these program activities help prevent potential accident scenarios that could be caused by equipment failures/human errors. \n\nIn addition to PSM, the facility has instrumentation and equipment to detect, contain, and reduce the consequences of a release at and around the MAN production unit and associated n-Butane sphere, including but not limited to:\n\n \n\n? Release Detection: \n\n  - Hydrocarbon detectors with alarms \n\n  - Process instrumentation to detect density, temperature, level, and pressure changes \n\n\n\n? Release Containmen"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000076986,
      "SummaryText": "t/Control \n\n  - Atmospheric relief devices \n\n  - Valves to permit isolation of the process \n\n  - Automated shutdown systems \n\n  - Redundant equipment and instrumentation (i.e., uninterruptible power supply for the process control system)                  \n\n  - Inert gas purge system   \n\n  - Level indication on sphere storage tank\n\n  - Butane tender transfers coordinated with plant operations and 3rd party pipeline personnel         \n\n  - Operating procedures addressing tender transfers\n\n  - LEL detection around sphere storage area\n\n\n\n? Release Mitigation \n\n  - Containment of liquid releases \n\n  - Fire suppression and extinguishing systems \n\n  - Remote/local actuated deluge system and snuffing steam \n\n  - Trained emergency response personnel \n\n  - Emergency response equipment located onsite \n\n\n\nFive-Year Accident History \n\n\n\nThe Facility has an excellent record of accident prevention over the past five years. If an incident were to occur, it would be investigated by a qualified team to determine a root cause and prevent a similar occurrence from happening again. No incidents meeting the 68.42 criteria have occurred in the previous 5 years.\n\n\n\nEmergency Response Program \n\n\n\nThe Facility maintains a written emergency response program, which is in place to protect workers and the public as well as the environment. The program consists of procedures for responding to a release of an RMP-regulated substance, including the possibility of a fire or explosion if a flammable substance is released. The procedures address aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and personnel accountability after an evacuation; notification of local emergency response agencies and the public if a release occurs; and post-incident cleanup and decontamination requirements. In addition, the Facility has procedures in place that address maintenance, inspection, and testing of emergency response equipment, as well as instructions"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000076986,
      "SummaryText": " that address the use of emergency response equipment.\n\nEmployees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to facility processes or emergency response procedures.\n\nThe overall emergency response program for the Facility is coordinated with the Will County Local Emergency Planning Committee (LEPC). This coordination includes periodic meetings of the committee, which involves local emergency response officials, local government officials, and industry representatives. The Facility has the capability of communicating with appropriate LEPC officials and emergency response organizations (e.g., fire departments, industrial neighbors, and mutual aid with industry) around-the-clock. This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition to periodic LEPC meetings, the Facility conducts periodic emergency drills that involve the LEPC and local emergency response organizations. Additionally, the Facility provides occasional refresher training to local emergency responders\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe Facility resolves all findings from HAZOP studies, some of which result in modifications to the process.  The resolutions and resulting changes are tracked internally to ensure completion. Other changes that have been completed or are being considered for implementation within the MAN unit include:\n\n-    Drainage trenching within the process unit to remove hazardous chemicals spills from the immediate process area;\n\n-    Construction of security fencing around the butane sphere;\n\n"
    }
  ]
}