{
  "FacilityID": 1000094186,
  "FacilityName": "Falls City Foods",
  "FacilityStr1": "404 Pacific Street",
  "FacilityStr2": null,
  "FacilityCity": "Falls City",
  "FacilityState": "NE",
  "FacilityZipCode": "68355",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31147",
  "LEPC": null,
  "FacilityLatDecDegs": "40.049730",
  "FacilityLongDecDegs": "-095.59332",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "8707 North 29th St.",
  "FacilityEmailAddress": "mwoosley@lotemp.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Great Western LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Falls City Foods",
  "OperatorStr1": "404 Pacific St.",
  "OperatorStr2": null,
  "OperatorCity": "Falls City",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68355",
  "OperatorZipCodeExt": null,
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000246879",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-06-23 16:01:24",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-06-23 16:01:24",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-06-23 16:01:24",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-06-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116875,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000094186,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146196,
          "ProcessID": 1000116875,
          "ChemicalID": 56,
          "Quantity": 13032.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118287,
          "ProcessID": 1000116875,
          "NAICSCode": "311111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000100001,
              "Process_NAICS_ID": 1000118287,
              "SafetyReviewDate": "2020-12-01 00:00:00",
              "PHA_Date": "2021-04-16 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Extinguishers",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-06-10 00:00:00",
              "TrainingReviewDate": "2021-06-10 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-06-10 00:00:00",
              "EquipmentInspectionDate": "2021-06-16 00:00:00",
              "EquipmentTested": "Compressors in Auxiliary Engine Room",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2021-06-10 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-06-10 00:00:00",
              "HotWorkPermitReviewDate": "2021-06-10 00:00:00",
              "ContractorSafetyReviewDate": "2021-06-15 00:00:00",
              "ContractorSafetyEvalDate": "2021-06-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000125421,
                  "PreventionProgram3ID": 1000100001,
                  "ProcessChemicalID": 1000146196
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094186,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-12-01 00:00:00",
    "ERTrainingDate": "2021-06-18 00:00:00",
    "CoordinatingAgencyName": "Falls City Fire Dept.",
    "CoordinatingAgencyPhone": "4022454422",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000094186,
      "SummaryText": "case weather conditions are uncommon,\r\n-Industry standards for the manufacture and quality control of pressure vessels\r\n-Ammonia is not corrosive in this service\r\n-Pressure safety valves limit operating pressure in this vessel\r\n-The accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing and replacement of equipment, if necessary\r\n-Installed ammonia sensors in the system to warn of leaks\r\n-Alarms in place to warn operating personnel of process upsets\r\n-The emergency action plan and equipment in place at the facility"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094186,
      "SummaryText": "will be relayed to the Employees.  If your immediate contact options cannot be reached, dial 911.  In the event of an evacuation, all employees should proceed to the designated assembly area and await further instructions from their evacuation supervisor.  Once everyone has evacuated the facility and arrived at their designated meeting area, a head count must be conducted by the Shift Supervisor to account for missing people, including visitors and/or contractors in his/her area. \r\n\r\nMaintenance employees who work with the ammonia system or respond to releases are allowed to work with the Haz Mat personnel to take actions to stop a release. In the event of an emergency release of ammonia it will be necessary for some specifically assigned and properly trained employees to remain in work areas that are being evacuated long enough to perform critical operations. Before a maintenance employee enters a release area, they must first test the concentration of the release by using an ammonia detector. They must also operate in pairs. If the isolation is within their reasonable capabilities they may isolate the leak and shut down the system if needed.\r\n\r\nIn response to an ammonia release, Falls City Foods will not respond to releases of hazardous chemicals in an offensive manner. The facility does not have any employees trained at the HAZMAT Technicians or First Responders Operations Level.  However, in the case of a minor ammonia release, designated maintenance personnel are allowed to isolate or maintain the release.\r\n\r\nFalls City Foods has not had any accidental releases to report since the commissioning of the plant.\r\n\r\nThe worst case release scenario would be a release from HPR-2 in the Main Engine Room releasing 5,931 lbs of ammonia (80% full) for duration of ten minutes. Under worst-case weather conditions, ammonia could travel 1.39 miles before dispersing enough to no longer pose a hazard to the public.  This scenario is unlikely for the following reasons:\t\r\n-Worst"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094186,
      "SummaryText": "to approximately 150-180 psig. The high-pressure ammonia vapor flows from the high stage compressors to an evaporative condenser where heat is removed, turning the vapor into a high pressure liquid.  The high-pressure liquid is collected in a high-pressure receiver.  The liquid collected in the high-pressure receiver provides liquid make-up for the accumulators.\r\n\r\nThe emergency action plan at Falls City Foods requires all associates to be trained in safe evacuation and notification procedures in cases of actual or drill emergencies. Training shall include escape routes, notification of appropriate response agencies, instructions on activating a building fire alarm system and what should be done after evacuating a building. The evacuation alarm and emergency evacuation procedures will be tested no less than once per year. The decision of when to practice evacuating the building will rest with the Plant Manager, Dusty Olberding. Arrangements have been made to coordinate Falls City Food's Emergency Action Plan and applicable emergency services with the following local agencies:\r\n\r\nRichardson County Emergency Management \r\n402-245-2446\r\n\r\nFalls City Police Department\r\n402-245-4422\r\n\r\nFalls City Fire Department\r\n402-245-4422\r\n\r\nBeatrice Fire Department\r\n402-228-5246\r\n\r\nUpon discovering an emergency situation, all employees shall immediately notify their shift supervisor or the Maintenance Department using the phone, vocally or wireless phones. The supervisor of the affected area should immediately contact the shift Maintenance personnel to determine if evacuation of the plant is the safest course of action.  If the emergency involves the release of ammonia and a decision is made to evacuate the plant, the Maintenance Department will notify the Shift Supervisor. The shift supervisor will sound an evacuation alarm, and then determine the assembly area.  The location of the assembly area will be based on the current wind direction and will be upwind of the release area and"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094186,
      "SummaryText": "This is to inform all interested persons, including employees that Falls City Foods is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to address the risks involved with the storage, handling, and processing of hazardous chemicals, In this way we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.   Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.  Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.  \r\n\r\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\r\n\r\nFalls City Foods is a facility in Falls City, NE which has two separate refrigeration systems.  Both engine rooms accommodate pet food processing operations.  \r\nThe Main Engine Room's ammonia refrigeration system is operated with a single stage system. High Pressure liquid ammonia is fed from the High-Pressure Receiver to the various freezers, coolers, dock, and process evaporators.  The high temperature ammonia liquid flows through a metering valve and across the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094186,
      "SummaryText": "evaporator coil where it picks up heat from the room, changing the ammonia from a liquid to a vapor.  The low-pressure ammonia vapor is sent from the freezers, coolers, processing, and dock units to the High Temperature Accumulator operating at -10°F via a suction header. The HTA separates any excess liquid ammonia from the vapor. The liquid ammonia drains into the transfer system and is pumped back to the High-Pressure Receiver.\r\nVapor from the HTA is then fed to the high stage compressors.  During the compression phase in the high stage compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig. The high-pressure ammonia vapor flows from the high stage compressors to an evaporative condenser where heat is removed, turning the vapor into a high-pressure liquid.  The high-pressure liquid is collected in a high-pressure receiver.  The liquid collected in the high-pressure receiver provides liquid for the evaporators.\r\n\r\nThe Auxiliary Engine Room's ammonia refrigeration system is operated as a two-stage system.  On the low stage portion of the system, a low temperature accumulator operating at -35°F pumps liquid to plate freezers located in the plate freezer room.  The plate freezers are designed to maintain a -20°F temperature.  The low temperature ammonia liquid flows across the freezer plates where it picks up heat from the product, changing the ammonia from a liquid to a vapor.  The low-pressure ammonia vapor is sent from the plate freezers to the accumulator via a suction header.\r\n\r\nVapor from the low temperature accumulator is fed to low stage compressors. The compressed vapor from the low stage compressors is sent to an intercooler operating at +15°F.  \r\n\r\nVapor from the intercooler is then fed to the high stage compressors.  During the compression phase in the high stage compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased"
    }
  ]
}