{
  "FacilityID": 1000065021,
  "FacilityName": "Faustina Plant",
  "FacilityStr1": "9959 Hwy 18",
  "FacilityStr2": null,
  "FacilityCity": "St. James",
  "FacilityState": "LA",
  "FacilityZipCode": "70086",
  "Facility4DigitZipExt": "9000",
  "FacilityCountyFIPS": "22093",
  "LEPC": "St. James Parish LEPC",
  "FacilityLatDecDegs": "30.085000",
  "FacilityLongDecDegs": "-090.914722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 807195722,
  "ParentCompanyName": "Mosaic Fertilizer, LLC",
  "Company2Name": "Tampa Port Services, LLC (TPS)",
  "CompanyDUNS": 807195722,
  "Company2DUNS": 79263913,
  "OperatorName": "Mosaic Fertilizer, LLC and TPS",
  "OperatorStr1": "9959 Hwy 18",
  "OperatorStr2": null,
  "OperatorCity": "St. James",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70086",
  "OperatorZipCodeExt": "9000",
  "RMPContact": "Ronald L. Yasurek",
  "RMPTitle": "General Manager",
  "FTE": 290,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000117651",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2560-00021-V6",
  "SafetyInspectionDate": "2013-05-15 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-05-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-08-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-08-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-08-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.08915,
  "FRS_Long": -90.91496,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000081557,
      "AltID": "Ammonia Plant",
      "FacilityID": 1000065021,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000082799,
          "ProcessID": 1000081557,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000101565,
          "ProcessID": 1000081557,
          "ChemicalID": 56,
          "Quantity": 44235504.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000101566,
          "ProcessID": 1000081557,
          "ChemicalID": 155,
          "Quantity": 48843.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000089405,
              "ProcessChemicalID": 1000101566,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000089406,
              "ProcessChemicalID": 1000101566,
              "ChemicalID": 149,
              "_chemical": {
                "ChemicalID": 149,
                "ChemicalName": "Hydrogen",
                "CASNumber": "1333-74-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000601565,
          "ProcessID": 1000081557,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601566,
          "ProcessID": 1000081557,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000065021,
      "SummaryText": "EXECUTIVE SUMMARY - Mosaic Fertilizer, LLC, Faustina Facility\n\n\n\n2425  LDEQ Facility ID Number\n\n\n\nMosaic Fertilizer, LLC, (\"Mosaic\") owns and operates the Faustina Facility located in St. James, Louisiana.  Assets for the ammonia plant are owned and operated by Tampa Port Services (TPS), which is wholly owned by Mosaic.  All TPS employees are Mosaic employees.  Additionally, Grammar Industries, Inc. is a tenant on Mosaic property operating an ammonia truck loading facility that is covered under this plan.  \n\nMosaic constructed the ammonia truck loading facility in 2016 and early 2017, and Grammar Industries, Inc. began operation of the facility on February 15, 2017.  Since the ammonia truck loading facility qualified as a significant change and required the performance of a Process Hazards Analysis (PHA), Mosaic must update the RMP within six months of startup of the loading facility.  \n\nThe Mosaic Fertilizer, LLC, Faustina Facility has a long standing commitment to our workers, community and the environment. This commitment is demonstrated by our establishment of management systems and resources invested in accident prevention, such as personnel training, emergency equipment, participation in St. James Parish emergency drills, meetings with other companies, and the St. James Parish emergency operations center, and meetings with the Ascension Parish emergency response organizations. This commitment is also consistent with the corporation's environmental, health and safety policy which provides that:\n\n1.    All facilities will be designed, safely operated, and managed to protect the health and safety of our employees, the community and the environment;\n\n2.    All employees are educated on the applicable environmental, health and safety standards, and procedures to manage the hazards associated with the regulated substance; and\n\n3.    Audits will be conducted regularly to verify compliance with management systems as described in the Environmental Protection Agency's (EPA's) re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000065021,
      "SummaryText": "gulation 40 CFR 68.\n\nAdditionally, corporate policies include compliance with OSHA's regulation 29 CFR 119.1910 Process Safety Management standard to ensure that multiple levels of safeguards are established against the catastrophic release of highly hazardous chemicals from potential fire, explosion and /or accidental release of toxic hazards.\n\n\n\n2.1  Accidental Release Prevention and Response Policies\n\n\n\nThe Mosaic Fertilizer, LLC, Faustina Facility implements reasonable controls to prevent accidental releases of regulated and hazardous substances by considering less hazardous alternatives.  When using a regulated substance, equipment is designed, built, maintained and operated to reduce the likelihood of an accidental release consistent with industry and government standards. If an accidental release does occur, Mosaic Fertilizer, LLC's emergency response policy includes trained personnel to recognize an accidental release, quickly assess the severity of the release and involve personnel who are trained to control and contain the release in a safe manner.  As mentioned above, Mosaic also participates with organizations within St. James Parish and Ascension Parish to ensure plans are in place to minimize the impact to the community and environment.\n\n\n\n2.2  Stationary Sources and Regulated Substances \n\n\n\nThe Mosaic Fertilizer, LLC, Faustina Facility produces granular monoammonium phosphate (GMAP), and diammonium phosphate (DAP) products. The raw materials used in this process include molten sulfur, phosphate rock, anhydrous ammonia, air and steam.  Natural gas mixtures are used as a fuel source for some equipment within the granulation facilities.  Additionally, the Faustina Facility manufactures anhydrous ammonia in the ammonia plant through a catalytic reaction involving natural gas, steam and air; the ammonia is used within the granulation facilities, stored and shipped off site.  The manufacturing process for anhydrous ammonia also includes carbon dioxide as a "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000065021,
      "SummaryText": "byproduct.\n\n\n\nThe regulated substances involved in these processes at the Faustina Facility that exceed the threshold quantities as described by the RMP rule include anhydrous ammonia and a flammable gas mixture generated in the ammonia plant. \n\n\n\nAnhydrous ammonia is stored in a large refrigerated storage tank surrounded by a dike. In addition to the anhydrous ammonia manufactured in the facility's ammonia plant, the Faustina Facility also receives anhydrous ammonia via an underground commercial pipeline, as well as by ship and barge at the facility's river dock on occasion.  Mosaic recently completed construction on truck loading racks to allow the loading of ammonia into tanker trucks for transport.  Natural gas is received at the facility by an underground commercial pipeline that is connected by piping to the ammonia plant.\n\n\n\n2.3  General Accidental Release Prevention Program and Chemical Specific Prevention Steps\n\n\n\nAnhydrous ammonia and flammable mixtures are regulated as highly hazardous chemicals under OSHA's Process Safety Management (PSM) standard. Based on the quantities of these substances present at the Faustina Facility, it is subject to OSHA's PSM requirements, and therefore, the Faustina Facility satisfies the eligibility requirements for a Program 3 Prevention Program under EPA's RMP. The Faustina Facility has fully implemented OSHA's PSM standard requirements and is using this program as its RMP Prevention Program. A brief summary of the facility's PSM program is as follows:\n\nMosaic Fertilizer, LLC, Faustina Facility encourages all employees to participate in all facets of process safety and accident prevention and has an employee participation plan that documents the many ways employees are involved in these processes.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility has technical documents which describe the process safety information associated with the regulated substance.  These documents, which are available to all of our employees, describe (1"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000065021,
      "SummaryText": ") physical properties of the hazardous substances, (2) operating parameters for our equipment and (3) design basis and configuration of our equipment.  These documents are for reference and updated if there are changes within the facility through our management of change process. \n\n\n\nMosaic Fertilizer, LLC, Faustina Facility also has a comprehensive program to help ensure that hazards associated with various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards through the use of process hazard analysis techniques.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility periodically revalidates its process hazard analyses to incorporate regulatory changes, new developments (such as lower toxicity standards and technology improvements), and offsite consequences. These revalidations occur every five years and the findings along with their resolutions are kept for the life of the process.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility has established practices and procedures to operate equipment safely through defined operating procedures which include steps for safely conducting activities, appropriate inclusion of applicable process safety information and safety and health considerations such as personnel protective equipment and actions to be taken if exposed to a hazardous substance.  Additionally, we train our workers to safely perform assigned tasks through both initial and refresher training programs.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility has well-established mechanical integrity practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: (1) Conducting training; (2) Developing written procedures; (3) Performing inspections and tests in accordance with recogniz"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000065021,
      "SummaryText": "ed standards; and (4) Correcting identified deficiencies and applying quality assurance measures. For example, the facility performs nondestructive testing on a scheduled basis on the anhydrous ammonia storage vessel to verify mechanical soundness from potential cracks and other sources of corrosion.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility also has procedures in place to ensure continuation of the entire PSM program, including: writing and periodically updating operating procedures; training operators and maintenance personnel; management of change programs; incident investigation; safe work and hot work practices; contractor safety programs; plus maintaining an audit schedule that meets EPA's RMP and OSHA's PSM requirements.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility has incorporated a number of redundant safety features to prevent and/or minimize releases of regulated substances:\n\n\n\nThe large refrigerated anhydrous ammonia storage vessel is double-walled. The storage vessel is monitored by operators for ammonia leaks and has continuous monitoring electronic leak detection equipment with control room alarm monitoring the annular space between the double wall for ammonia leaks. Typically, the vessel operates significantly below maximum capacity. In the event of a long-term compressor outage, the anhydrous ammonia could be flared; sent to another ammonia producer in nearby Ascension Parish; or consumed in the granulation plants. In the event of a vessel rupture, there is a dike completely surrounding the vessel sufficiently high to contain its entire contents with a margin of safety. There is also an internal dike within the main dike that would keep smaller spills from spreading out to the maximum area of the dike thus reducing spill evaporation. A series of relief valves connected to a flare also protect the tank from overpressure.\n\n\n\nOther smaller pressurized anhydrous ammonia storage vessels in the ammonia plant have relief valves that are piped directly t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000065021,
      "SummaryText": "o a flare system or vented to atmosphere. Other ammonia relief valves are placed such that a discharge is elevated and would be significantly diluted before reaching areas affecting people. There are also automated shutdown systems for the anhydrous ammonia manufacturing plant at the site.  The Ammonia Truck Loading Facility is equipped with a manual emergency shutdown and deluge system in the event of an emergency. Measures to prevent the accidental release of the flammable gases in the ammonia plant and to minimize the effects of any accidental releases include: redundant instruments, backup systems, and water deluge systems.\n\n\n\n2.4  Five-Year Accident History\n\n\n\nThe five-year accident history includes a review of all accidental releases of regulated substances held above threshold quantities in covered processes that resulted in on-site deaths, injuries, or significant property damage, or known off-site deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage. For the five-year period prior to August 2017, there have been no accidental releases that have resulted in any of the listed potential consequences.\n\n\n\n2.5  Emergency Response Program\n\n\n\nMosaic Fertilizer, LLC, Faustina facility maintains a written emergency response program that is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to releases of regulated and other substances, including the possibility of ammonia releases and fire or explosion.  There are established processes to review and update the emergency response program appropriately, and it complies with federal contingency regulations [e.g., OSHA regulation 29 CFR 1910.38(a)]. A copy of the plan has been provided to the fire department and the Local Emergency Planning Committee].\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility is located in St. James Parish Louisiana and is also in close proximity to Ascension Parish. When an emergency situa"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000065021,
      "SummaryText": "tion arises requiring outside assistance, the Faustina Facility's overall emergency response program is coordinated with the St. James Parish Emergency Operations Center (St. James EOC). Via this organization, Faustina works closely with other emergency response organizations including the sheriffs of both parishes, St. James and Ascension Parish emergency response personnel, Louisiana State Police and Prevost Memorial Hospital in Donaldsonville. Faustina has 24-hour capability to communicate with these organizations. Faustina uses an Incident Command System for emergency response.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility is an active member of the St. James Parish mutual aid, Geismar Area Mutual Aid group of Ascension Parish and the Baton Rouge Mutual Aid Organization. These groups include parish government and major area industries.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility has an emergency equipment maintenance, inspection, and testing program. In addition, Faustina employees receive training for the use of emergency response equipment, emergency response, medical assistance, and the Incident Command System. There is a significant number of appropriately trained personnel on each shift, and all employees receive a periodic training update. The emergency response program is periodically audited. Appropriate changes are made in response to audit recommendations and operating experience.\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility periodically tests its emergency response program. The testing consists of onsite testing of emergency response equipment, in plant drills, and periodic mock emergency response scenarios coordinated by the St. James EOC. The Faustina facility also includes TV and radio station telephone numbers in its emergency response plan.\n\n\n\n2.6  Planned Changes to Improve Safety\n\n\n\nMosaic Fertilizer, LLC, Faustina Facility has action items assigned and scheduled to be completed as a result of soliciting safety suggestions from our employees, i"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000065021,
      "SummaryText": "nternal audits, equipment inspections and process hazard analyses.\n\n\n\n2.7  RMP Update and Resubmittal\n\n\n\nThe August 2017 update and resubmittal incorporated changes due to the construction of the ammonia truck loading facility, as well as providing updated prevention program and general facility information as required for a 5-year resubmittal. "
    }
  ]
}