{
  "FacilityID": 1000080151,
  "FacilityName": "Northampton Generating Plant",
  "FacilityStr1": "One Horwith Drive",
  "FacilityStr2": null,
  "FacilityCity": "Northampton",
  "FacilityState": "PA",
  "FacilityZipCode": "18067",
  "Facility4DigitZipExt": "9728",
  "FacilityCountyFIPS": "42095",
  "LEPC": "Northampton Div. Of Emer. Mgmt",
  "FacilityLatDecDegs": "40.691111",
  "FacilityLongDecDegs": "-075.479167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.olympuspower.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 827453668,
  "ParentCompanyName": "Olympuspower LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Northampton Generating Company, LP",
  "OperatorStr1": "One Horwith Drive",
  "OperatorStr2": null,
  "OperatorCity": "Northampton",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18067",
  "OperatorZipCodeExt": "9728",
  "FTE": 20,
  "OtherEPAFacilityID": "PA0001385574",
  "EPAFacilityID": "100000134179",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "4800021",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.69471,
  "FRS_Long": -75.48645,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "8",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100072,
      "AltID": "Aqueous Ammonia Storage",
      "FacilityID": 1000080151,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125345,
          "ProcessID": 1000100072,
          "ChemicalID": 57,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101312,
          "ProcessID": 1000100072,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080151,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-04-01 00:00:00",
    "ERTrainingDate": "2019-06-10 00:00:00",
    "CoordinatingAgencyName": "Northampton Div. Of Emergency Mgmt.",
    "CoordinatingAgencyPhone": "6107592600",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080151,
      "SummaryText": "Northampton Generating Company, L.P. (NGC)  approach to chemical safety and security involves safe equipment design, trained employees, qualified contractors, and regular audits and assessments.\n\n\n\nNGC utilizes a circulating fluidized bed (CFB) boiler to supply nominally 110 MW of electricity. The plant also has the capability to supply steam to adjacent industrial facilities. NGC is permitted to burn the following: anthracite waste coal (culm), petroleum coke, tire derived fuel (TDF), paper processing residual, virgin wood, high carbon ash, anthracite coal, and bituminous coal. The plant injects limestone to control its sulfur oxides (SOx) emissions, aqueous ammonia to control its nitrogen oxides (NOx) emissions, and a baghouse to control its particulate matter (PM) emissions. These emission controls allow the plant to achieve some of the lowest emission rates in the country for a facility of its kind. The aqueous ammonia used for NOx control is stored at the plant in a large tank. Aqueous ammonia is  a mixture of ammonia and water. The use of aqueous ammonia is a safer product to handle than anhydrous ammonia which is used by some plants to control their NOx emissions.\n\n\n\nBased on air modeling of the worst case release scenario, there would be no offsite public impact from the failure of the aqueous ammonia tank at the plant. The aqueous ammonia system had no reportable spills or accidents between 2014 - 2019. The plant is qualified under Program Level 1 status of the federal Risk Management Program (RMP). General accidental release prevention measures are incorporated into the overall safe operation of the plant. The plant is continuously staffed with personnel, surrounded by perimeter fencing, and accessed only via controlled security gates. The control room operators have access to real-time process monitor data of the plant and video surveillance. Plant operators perform visual shift inspections of the entire plant to ensure it is operating safely. Aqueous amm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080151,
      "SummaryText": "onia unloading is supervised. \n\n\n\nNGC takes several chemical-specific prevention steps to avert the accidental release of aqueous ammonia. Control room operators remotely monitor the status of the aqueous ammonia tank system. A loss of aqueous ammonia flow would instantly cause an alarm in the control room, where trained operators would take immediate action to correct the problem. The storage and handling system undergoes testing and preventative maintenance. The tank is located inside a concrete secondary containment structure capable of containing the entire contents of the tank. In the event of a catastrophic tank release, the secondary containment would contain the aqueous ammonia. In addition, hollow plastic balls are located inside the secondary containment structure that will float on the surface of the aqueous ammonia in the secondary containment. The balls would reduce the surface area of the aqueous ammonia and thus reduce the evaporation rate of the material reducing the potential for offsite consequences.\n\n\n\nNGC has an Emergency Response Plan, which is coordinated with the County of Northampton Division of Emergency Management and the Borough of Northampton. The plant also has a Pollution Prevention Contingency Plan/Spill Prevention Response Plan (PPC/SPR) specifically for the prevention of chemical spills and response to chemical releases. Plant workers undergo annual hazardous materials safety training and emergency response training. Plant management has coordinated with local emergency departments to ensure an appropriate and effective response will occur if an emergency occurs at the plant.\n\n"
    }
  ]
}