{
  "FacilityID": 1000062057,
  "FacilityName": "Essential Power Newington, LLC",
  "FacilityStr1": "200 Shattuck Way",
  "FacilityStr2": null,
  "FacilityCity": "Newington",
  "FacilityState": "NH",
  "FacilityZipCode": "03801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "33015",
  "LEPC": "Newington LEPC",
  "FacilityLatDecDegs": "43.105000",
  "FacilityLongDecDegs": "-070.806944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "S1",
  "LatLongDescription": "AS",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Essential Power Newington, LLC",
  "OperatorStr1": "200 Shattuck Way",
  "OperatorStr2": null,
  "OperatorCity": "Newington",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03801",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180546",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "TV-0058",
  "SafetyInspectionDate": "2011-04-20 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-12-10 22:01:37",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-03-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-03-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-03-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 43.103487,
  "FRS_Long": -70.805243,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077785,
      "AltID": "SCR for NOx Reduction",
      "FacilityID": 1000062057,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096772,
          "ProcessID": 1000077785,
          "ChemicalID": 56,
          "Quantity": 18580.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000078987,
          "ProcessID": 1000077785,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000065411,
              "Process_NAICS_ID": 1000078987,
              "SafetyReviewDate": "2016-09-07 00:00:00",
              "PHA_Date": "2016-09-07 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "handheld direct reading instruments and ammonia test paper",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Administrative changes",
              "OpProceduresReviewDate": "2016-10-10 00:00:00",
              "TrainingReviewDate": "2016-12-31 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-03-03 00:00:00",
              "EquipmentInspectionDate": "2016-03-21 00:00:00",
              "EquipmentTested": "Piping and tanks",
              "ChangeMgmtDate": "2016-08-16 00:00:00",
              "ChangeMgmtReviewDate": "2012-12-17 00:00:00",
              "PreStartupReviewDate": "2016-10-17 00:00:00",
              "ComplianceAuditDate": "2015-12-14 00:00:00",
              "AuditCompletionDate": "2016-12-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-05-08 00:00:00",
              "HotWorkPermitReviewDate": "2016-09-23 00:00:00",
              "ContractorSafetyReviewDate": "2016-07-27 00:00:00",
              "ContractorSafetyEvalDate": "2012-02-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000080870,
                  "PreventionProgram3ID": 1000065411,
                  "ProcessChemicalID": 1000096772
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000062057,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-09-08 00:00:00",
    "ERTrainingDate": "2016-09-14 00:00:00",
    "CoordinatingAgencyName": "Newington Fire Dept. (LEPC)",
    "CoordinatingAgencyPhone": "6034369441",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062057,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT NEWINGTON ENERGY\r\n\r\nIt is Essential Power Newington, LLC's (EPN) policy to adhere to all applicable federal, State, and local laws.  The anhydrous ammonia system at EPN provides storage, vaporization, transfer, and injection control facilities for the ammonia gas to support the selective catalytic reduction system (SCR), which is located in line with the heat recovery steam generators (HRSGs).  The SCR system has been designed and operates in compliance with EPA's Accidental Release Prevention rule and applicable State and local codes and regulations.  EPN has qualified engineering, operations, and maintenance personnel knowledgeable in the safe operation of compressed ammonia systems with direct responsibility for the process.  The process is also designed and operated in compliance with the Occupational Safety and Health Administration's Process Safety Management (OSHA-PSM) rule.\r\n\r\nThrough its Risk Management Plan (RMP), Process Safety Management (PSM) Manual, and Emergency Response Action Plan (found in the facility's Integrated Contingency Plan), EPN has emergency response procedures in place that comply with the Accidental Release Prevention Program (ARPP).\r\n\r\nA DESCRIPTION OF YOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\r\n\r\nThe EPN facility is a nominal 595 MW natural gas-and oil-fired combined cycle power plant located at 200 Shattuck Way in Newington, NH.  The facility lies approximately 1,000 feet from the Piscataqua River within a mixed industrial/commercial area.  The anhydrous ammonia system provides storage, vaporization, transfer, and injection control facilities for the ammonia gas to support the SCR / HRSG systems at the facility.  The application of Selective Catalytic NOx Reduction Technology (the process) reduces nitrogen oxide (NOx) air emissions from the station.  There are two SCR / HRSG systems in the plant, designated as Train 1 and Train 2.  Each SCR"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062057,
      "SummaryText": "/ HRSG has its own dedicated anhydrous ammonia storage and supply system.  \r\n\r\nEach of the two ammonia storage and supply systems include a 2,122-gallon horizontal, cylindrical, pressure vessel for storing liquefied anhydrous ammonia.  The vessel is mechanically rated for 265 psig at 170F.  The level in the vessel is administratively controlled to a maximum of 85% capacity, equivalent to 1,804 gallons.  The maximum intended site inventory of ammonia is therefore 3,608 gallons (18,580 pounds at 60F) onsite.\r\n\r\nThe RMP applicability threshold for anhydrous ammonia is 10,000 pounds.  As EPN's anhydrous ammonia storage capacity exceeds this threshold, the facility is subject to the program and is required to prepare and maintain a RMP for this process.  The anhydrous ammonia system at EPN is the only process that stores a substance in greater quantities than the ARPP applicability threshold.\r\nThis process is subject to Risk Management Program Level 3 because it is subject to OSHA-PSM provisions and it is not eligible for Program Level 1.\r\n\r\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe SCR and HRSG systems were designed and constructed in general accordance with applicable local building and fire codes, as well as industry-consensus codes and standards where appropriate.  Process verification takes place through design audits conducted by trained personnel and/or qualified consultants.  The schedule of such verifications is at least once every three years.\r\n\r\nPreventative maintenance (PM) is an active part of EPN's daily operations.  PM is performed on a schedule in accordance with OSHA-PSM and, in many cases, the process safety equipment PM schedule prescribed by EPN meets the recommended equipment best management maintenance schedules.  Pressure vessels, emergency shutdown, controls, pumps, and other equipment associated with operating the SCR ammonia system is regularly inspected and tested.  Maintenance activities ar"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062057,
      "SummaryText": "e completed on the SCR ammonia system components as specified in documents provided by the manufacturer.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nWithin the last five years, EPN has not experienced an accident involving the anhydrous ammonia system that caused deaths, injuries, property or environmental damage, evacuations, or sheltering in place.\r\n\r\nTHE EMERGENCY RESPONSE PROGRAM\r\n\r\nAmmonia has a strong, pungent odor that makes even the smallest of leaks easily detectable by smell.  A medium to large leak of ammonia could be detectable from a safe distance through a visual white cloud escaping from the source leak.  Ammonia handheld direct reading instruments, fixed area monitors, and ammonia test paper are maintained at the facility to aid in the detection of an ammonia release.  The Local Emergency Planning Committee (LEPC, or Newington Fire Department) is trained and equipped to respond to ammonia releases at Newington Energy.  \r\n\r\nEPN has developed an emergency response program contained within its Integrated Contingency Plan (ICP) to minimize the health, safety and environmental impacts from a release of hazardous materials, and to restore the facility to normal operating conditions as quickly as possible.  \r\n\r\nIn addition, to the general emergency response program, a unique emergency response procedure has been developed for response to releases from the SCR system as outlined below.\r\n o After all personnel move to a location lateral or upwind from the release area, they shall call the CONTROL ROOM and inform the CONTROL ROOM of the location (inside or outside) of the release and wind direction or direction in which the vapors appear to be moving (if known).\r\n o The CONTROL ROOM shall dispatch the First Responders to the scene.  \r\n o If it is safe to do so, First Responders shall coordinate with plant personnel to shut off all CONTROL ROOM and Admin Building ventilation systems to prevent the migration of the ammonia vapors into the building.  \r\n o Emergency Coordina"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062057,
      "SummaryText": "tor shall report to the scene, if necessary, and coordinate with Newington Fire and/or hazardous waste contractor to determine if additional evacuation of the facility and any off-site, downwind locations is necessary. \r\n o The EHS Responder will evaluate the need for regulatory reporting (if the release exceeds the reportable quantity of 100 pounds or there is an off-site threat) and contact the Emergency Coordinator if regulatory notification is required.\r\n o Responders shall continually evaluate the need for medical services, rescue operations, and additional evacuation.  \r\n o After the ammonia release has been controlled and ammonia vapors have dissipated, the Incident Commander shall meet with the Responders to determine that no threat to health or safety exists and then give the all clear signal.\r\n o After the incident is terminated, the Incident Commander will document response actions and conduct a debriefing/critique of the Anhydrous Ammonia Release ERP.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nEPN installed new Anhydrous Ammonia Storage Tank and Vaporizer pressure vessels in October 2016, which are intended to improve safety with respect to the ammonia systems.   The upgraded storage system included RFWN flanges at all tank connections, where possible, to prevent damage to tank nozzles when excess flow valves are changed on a routine basis, the elimination of liquid crossover line between tanks and corresponding tank nozzles since a vapor crossover line is now in place, incorporation of liquid and vapor-offloading connections made directly at the tank to eliminate liquid and vapor piping runs to each tank, and installation of a new unloading platform and entrance to the platform to provide personnel access to directly connect to each tank for ammonia offloads.  Additionally, the existing structural steel mounting skid for tanks and vaporizers was removed and new equipment was mounted to new concrete supports."
    }
  ]
}