{
  "FacilityID": 1000001406,
  "FacilityName": "Brush Creek Waste Water Treatment Plant",
  "FacilityStr1": "857 Riverview Drive",
  "FacilityStr2": null,
  "FacilityCity": "Johnson City",
  "FacilityState": "TN",
  "FacilityZipCode": "37601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47179",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "36.371944",
  "FacilityLongDecDegs": "-082.314167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.johnsoncitytn.org",
  "FacilityEmailAddress": "h2ofm@johnsoncitytn.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Johnson City",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Johnson City Water & Sewer",
  "OperatorStr1": "PO Box 2466",
  "OperatorStr2": "857 Riverview Drive",
  "OperatorCity": "Johnson City",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37605",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Corder",
  "RMPTitle": "Chief Water Plant Operator",
  "FTE": 10,
  "OtherEPAFacilityID": "TND000833418",
  "EPAFacilityID": "100000071209",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-12-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-05-10 00:00:00",
  "DeRegistrationEffectiveDate": "2019-05-01 00:00:00",
  "AnniversaryDate": "2014-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.3725,
  "FRS_Long": -82.31611,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001831,
      "AltID": null,
      "FacilityID": 1000001406,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001917,
          "ProcessID": 1000001831,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001973,
          "ProcessID": 1000001831,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501973,
          "ProcessID": 1000001831,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000001832,
      "AltID": null,
      "FacilityID": 1000001406,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001918,
          "ProcessID": 1000001832,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001974,
          "ProcessID": 1000001832,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501974,
          "ProcessID": 1000001832,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001406,
      "SummaryText": "Executive Summary - Risk Management Plan\n\nThe City of Johnson City Water and Sewer Services Department operates two (2) wastewater treatment plants (Knobcreek and Brushcreek) and two (2) water filtration plants (Unicoi and Watauga) which all use chlorine in the disinfection process. The City of Johnson City Water and Sewer Services Department takes a very serious approach in providing safe drinking water to our customers, treating the wastewater as well as protection of the environment. As a result, the City also take a very serious approach in the way chlorine is handled, stored and used at each of our facilities. All water and wastewater treatment plants use chlorine stored in 1-ton cylinders and each facility has chlorination rooms that contain the cylinders in use as well as additional storage for cylinders not on-line. The Brushcreek and Regional WWTPs also use sulfur dioxide as a dechlorinator. The chlorination and dechlorination rooms have monitoring alarms to alert the operators should a leak occur.  Private chemical companies transport the cylinders to each facility and are off-loaded by a monorail system to the storage area. The operators at each facility have received training in the safe handling of the cylinders, proper use of personal protective equipment and self-contained breathing apparatus (SCBA) use.\n\nThis Risk Management Plan (RMP) submission was a cooperative effort between the water treatment, wastewater treatment, engineering and administration divisions of the Water and Sewer Services Department as well as the Johnson City Fire Department and the Washington County Emergency Management Agency. This plan will become part of the Local Emergency Response Plan for the Johnson City and Washington County area.\n\nThis Risk Management Plan, as submitted, followed the criteria as set forth by the Environmental Protection Agency Chemical Emergency Preparedness and Prevention Office (EPA/CEPPO) and followed the American Water Works Association Research Fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001406,
      "SummaryText": "undation (AWWARF) guide, \"Compliance Guidance and Model Risk Management Program for Water Treatment Plants\" as a tool for development of our plan. Each facility location was mapped to determine wind speed, direction and plume modeling, using real wind speed and direction data obtained at each facility.\n\nBrushcreek Wastewater Treatment Plant\n\nFacility Description\n\nThe Brushcreek Wastewater Treatment Plant is located on Riverview Road in Johnson City, Tennessee. The Brushcreek WWTP is owned and operated by the City of Johnson City Water and Sewer Services Department and treats wastewater from residential, commercial and industrial users. The Brushcreek WWTP uses liquid chlorine and sulfur dioxide, shipped and stored in 1-ton cylinders. The liquid chlorine is converted to a gas, which is then injected into the treated wastewater for disinfection purposes. After the disinfection process is complete, the wastewater is then injected with sulfur dioxide prior to the treated water being discharged into the Watauga River.\n\n\n\nAccidental Release Policies and Emergency Response Policies\n\nShould an accidental release of chlorine or sulfur dioxide at this plant occur, the plant operator is alerted to the release by alarms and the operator will follow the Emergency Response Plan (ERP) Procedures, which are defined in the department's Process Safety Management (PSM) manual. The operator will also notify the Chief Operator at this plant as well as the Superintendent of Water & Wastewater Treatment and will notify 9-1-1 of the release in which case the Johnson City Fire Department, the Johnson City/Washington County Hazardous Materials Team, and the Johnson City/Washington County Emergency Management Agency will respond to the plant site for proper mitigation of the release.\n\n5-Year Accident History\n\nThe City of Johnson City Water and Sewer Services Department is proud of our safety record in handling chlorine and sulfur dioxide. We have not had any accidents using chlorine or sulfur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001406,
      "SummaryText": " dioxide in our wastewater treatment process at this plant. This accident-free record is due mainly to the emphasis placed on safe handling of chlorine and sulfur dioxide by both management and operators.\n\n\n\n\nPrevention Program\n\nThe Brushcreek WWTP's Prevention Program is classified as a Program 3 and also falls under the OSHA Process Safety Management Rule. One of the most important aspects of prevention is the training received by the operators and maintenance provided to this plant by our Facility Maintenance Division. Routine maintenance is performed on the chlorine and sulfur dioxide alarms as well as the chlorinators and cylinder regulators.\n\nEmergency Response Program\n\nShould an accidental release of chlorine or sulfur dioxide occur at this plant, the Johnson City Fire Department, Johnson City/Washington County Hazardous Materials Team and the Johnson City/Washington County Emergency Management Agency will respond to the plant and the LEPC Plan for Washington County will be placed into operation. The LEPC details the chain of command, public notification and if necessary evacuation procedures.\n\nPlanned Safety Improvements\n\nAt the time that this Risk Management Plan was developed, there are no planned safety improvements for the Brushcreek WWTP."
    }
  ]
}