{
  "FacilityID": 1000084543,
  "FacilityName": "Dixie Cheraw Terminal",
  "FacilityStr1": "200 Dixie Pipeline Road",
  "FacilityStr2": null,
  "FacilityCity": "Cheraw",
  "FacilityState": "SC",
  "FacilityZipCode": "29520",
  "Facility4DigitZipExt": "7796",
  "FacilityCountyFIPS": "45025",
  "LEPC": "Chesterfield County LEPC",
  "FacilityLatDecDegs": "34.71805",
  "FacilityLongDecDegs": "-079.91463",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Enterprise Products Operating LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Enterprise Propane Terminals & Strg",
  "OperatorStr1": "1275 U. S. Highway 11 North",
  "OperatorStr2": null,
  "OperatorCity": "Petal",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39465",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165643",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-04-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-01-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.71805,
  "FRS_Long": -79.91463,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105610,
      "AltID": "Cheraw Terminal",
      "FacilityID": 1000084543,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132252,
          "ProcessID": 1000105610,
          "ChemicalID": 98,
          "Quantity": 1300000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000106903,
          "ProcessID": 1000105610,
          "NAICSCode": "42471",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000084543,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Cheraw Fire Department",
    "CoordinatingAgencyPhone": "8435375941",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000084543,
      "SummaryText": "accidental overpressure of the facility by the pipeline system."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084543,
      "SummaryText": "clothing, hard hats, safety glasses, etc.)\r\n\r\nFive Year Accident History\r\n\r\nThe following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\r\n\r\nThe facility has not had an accidental release which meets the criteria set forth in 40 CFR 68.10.\r\n\r\nEmergency Procedures Information\r\n\r\nThe Cheraw Terminal maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.\r\n\r\nThe overall emergency procedure program for the Cheraw Terminal is coordinated with the Chesterfield County Emergency Management organization (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives.  The Cheraw Terminal has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nThe Cheraw Terminal resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Cheraw Terminal.\r\n\r\n*  The Cheraw Terminal has recently added additional instrumentation to increase protection from"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084543,
      "SummaryText": "description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\n\r\nSafe Work Practices\r\n\r\nThe Cheraw Terminal has long standing safe work practices in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities (hot work) and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\nSpecialized Safety Features\r\n\r\nThe Cheraw Terminal has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\r\n\r\nRelease Detection\r\n\r\n* Hydrocarbon (hazardous gas) detectors and alarms\r\n* Plant video surveillance system\r\n\r\nRelease Containment and Control\r\n\r\n* Valves to permit isolation of the process (manual or automated).\r\n* Automatic shutdown systems for specific process parameters (e.g., high pressure).\r\n* Secondary containment (curbs and dikes) to contain any release of liquid chemicals\r\n* Redundant equipment and instrumentation where advisable\r\n* Seal failure alarms installed on hydrocarbon liquid pumps.\r\n* Terminal fire detection system\r\n* Terminal emergency shutdown (ESD) system with multiple activation points\r\n* Atmospheric relief devices\r\n\r\nRelease Mitigation\r\n\r\n* Hand-held fire extinguishers\r\n* Personnel trained in emergency response and procedures.\r\n* Personnel protective equipment (e.g., chemical protective"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084543,
      "SummaryText": "there have been no incidents with offsite consequences in the last five years, and emergency response activities are coordinated with the local emergency response agencies.\r\n\r\nThe facility receives, stores and distributes propane.  There are four storage tanks at the Cheraw Terminal, and the tanks are administratively controlled to hold and not exceed 80% of their capacity.  The facility consists of pressure storage tanks, liquid propane dehydrators, a truck loading dock, mercaptan injection system and associated piping, valves and other miscellaneous equipment. The process and storage is a wholesale product distribution terminal for propane.\r\nIn our process we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\r\n\r\nToxics\r\n\r\nNo toxic materials to report.\r\n\r\nFlammables\r\n\r\nPropane is a finished product which is received into four storage tanks.  This material is routed from these tanks to the loading docks for distribution.  A small quantity of ethyl mercaptan is stored at the terminal for propane odorization.  The stored quantity is below the threshold quantity specified in the RMP Rule.\r\n\r\nKey Offsite Consequence Analysis Scenarios\r\n\r\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\r\n\r\n\r\nGeneral Accident Release Prevention Program\r\n\r\nThe following is a summary of the accident prevention program in place at the Cheraw Terminal. The processes at the plant are regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1), and are also subject to the OSHA's PSM Standard.  \r\n\r\nChemical Specific Prevention Steps\r\n\r\nThe processes at the Cheraw Terminal have hazards that must be managed to insure continued safe operation.  The following is a"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084543,
      "SummaryText": "Environmental Protection Agency Risk Management Plan Dixie Cheraw Terminal\r\nEnterprise Propane Terminals and Storage Executive Summary\r\nEPA Identifier:  1000 0016 5643\r\nAccidental Release Prevention and Response\r\n\r\nAt the Enterprise Dixie Cheraw Terminal, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\r\n\r\nThe Enterprise Dixie Cheraw Terminal is owned and Operated by Enterprise Terminals & Storage, LLC.  We use a combination of accidental release prevention programs and emergency response planning programs to help provide for the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\r\n\r\n* A description of our facility and use of substances regulated by EPA's RMP regulation\r\n* An overview of our accidental release prevention programs\r\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\r\n* An overview of our emergency response program\r\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\nThe Cheraw Terminal engages in the pipeline receipt and storage of liquefied propane under pressure, and the loading of the propane into tank trucks.    The process is regulated by Federal OSHA 29 CFR 1910.119 and EPA 40 CFR Part 68.  We have registered the facility as an RMP Program Level 1 facility since there are no receptors within the calculated worst case distance.  Additionally,"
    }
  ]
}