{
  "FacilityID": 1000055317,
  "FacilityName": "Linde - Sulphur",
  "FacilityStr1": "4451 HWY 108S",
  "FacilityStr2": null,
  "FacilityCity": "Sulphur",
  "FacilityState": "LA",
  "FacilityZipCode": "70664",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22019",
  "LEPC": "Calcasieu Parish LEPC",
  "FacilityLatDecDegs": "30.1857140",
  "FacilityLongDecDegs": "-93.325121",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.linde.com",
  "FacilityEmailAddress": "info@linde.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Linde Inc.",
  "Company2Name": null,
  "CompanyDUNS": 197154586,
  "Company2DUNS": 197154586,
  "OperatorName": "Linde Inc.",
  "OperatorStr1": "4451 HWY 108S",
  "OperatorStr2": "PO Box 2419",
  "OperatorCity": "Sulphur",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70664",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Boudreaux",
  "RMPTitle": "Plant Manager",
  "FTE": 14,
  "OtherEPAFacilityID": "523443",
  "EPAFacilityID": "100000231723",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0520-00170-V2AA",
  "SafetyInspectionDate": "2014-12-02 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-09-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-03-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-03-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-03-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000070165,
      "AltID": "Hydrogen Production",
      "FacilityID": 1000055317,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000071367,
          "ProcessID": 1000070165,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000086732,
          "ProcessID": 1000070165,
          "ChemicalID": 155,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000074065,
              "ProcessChemicalID": 1000086732,
              "ChemicalID": 149,
              "_chemical": {
                "ChemicalID": 149,
                "ChemicalName": "Hydrogen",
                "CASNumber": "1333-74-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074066,
              "ProcessChemicalID": 1000086732,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000586732,
          "ProcessID": 1000070165,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055317,
      "SummaryText": "\"Facility Description:\n\nThe Linde facility at Sulphur, LA is a hydrogen production plant. We react steam and methane (natural gas) to form hydrogen gas, which we then purify compress, and feed into hydrogen pipelines.  The plant was started in 1996 and was initially not believed to be subject to 29 CFR1919.119 or 40 CFR Part 68.  An error in the flammable threshold calculations was discovered in late 2015, with inventory exceed the threshold limits.  Linde has always operated and maintained the process in an OSHA PSM and EPA RMP \"\"compliant\"\" condition.\n\n\n\nRegulated Substances:\n\nThis facility uses, manufactures, or stores a chemical listed in part 68 of Title 40 of the Code of Federal Regulations, beyond a threshold quantity, as established by the EPA. The chemical is:\n\n- Flammable mixture containing hydrogen, methane, and other components, manufactured on site.\n\n\n\nAccidental Release Prevention Policy:\n\nLinde is dedicated to being the best performing industrial gas company in all aspects of our business, including safety, health, and environmental affairs. Our safety, health, and environmental policy call for a commitment to protecting the health and safety of our employees, neighbors, and the surrounding environment.\n\n\n\nThis policy is the basis for engineering and construction programs that produce equipment and process systems that minimize the possibility of accidental chemical releases and operational safety programs that ensure safe operation of our facilities. Linde is committed to the continuous improvement of these programs.\n\n\n\nLinde is an active member of the American Chemistry Council and subscribes to the council's program of Responsible Care; Employee Health and Safety Code of Management Practices.\"\n\n                            \n\n\"Prevention Program:\n\nIn accordance with OSHA's Process Safety Management standard and EPA's Risk Management Program rule, the Sulphur, LA facility has a comprehensive accident prevention program in place. This program is built around process safety"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055317,
      "SummaryText": " concepts such as:\n\n- Technical documentation of PSI (Process Safety Information), describing the physical properties of the hazardous substances, the safety systems in place to control these substances, and the critical operating parameters of the associated equipment and systems.\n\n- Procedures and programs to develop, maintain, and control key program elements such as process operations, equipment mechanical integrity, employee training, management of change, hot work permits, incident investigation, and contractor activity.\n\n- Initial and periodic review of new or modified processes through application of comprehensive design safety and management of change programs that include Process Hazard Analysis study and pre-startup review.\n\n\n\nLinde has an employee participation program that promotes involvement in the process safety program and helps ensure understanding of facility-specific elements of the safety program.\n\n\n\nThe prevention program is audited periodically, by our corporate assessment group, to ensure that the process safety concepts and practices are in place and working effectively.\n\n\n\n                            \n\nChemical-specific Prevention Steps:\n\nIn addition to the required prevention program elements, we have implemented safety features specific to the covered process at our facility. Following is a description of some of these safety features.\n\n-There are smoke detectors in the Control Room AC ducts, the warehouse and MCC building.\n\n-Fire extinguishers are located in key areas of the plant. They are maintained monthly and undergo yearly inspections by an outside vendor.\n\n-Plant operation emergency shutdowns (if process variable is exceeded) will shutdown the Plant and isolate the process.  This location has multiple plant emergency trips located throughout the facility.\n\n-During plant emergency alarm conditions, this facility would contact the Carlyss Fire Department for a fire or medical emergency.                            \n\n                            \n\nFive-year Accident History:                            \n\nThere were no r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055317,
      "SummaryText": "eleases of a regulated substance above its threshold quantity from the process in the previous five years.                            \n\n                            \n\nEmergency Response Programs:                            \n\nLinde has an emergency response program in place to minimize the effects of accidental release of regulated substances to employees, the public, and the environment.  Linde employees will respond to minor incidents.  For other than minor incidents, Linde has in place an emergency response plan in coordination with the Carlyss Fire Department.  The plan requires the Carlyss Fire Department be called for any incident on site related to fire, spills or release of the covered chemical.                          \n\n                            \n\nAll facility employees are trained in their role in the emergency plan and emergency drills are conducted at least annually.                            \n\n                            \n\nPlanned Changes to Improve Safety:                            \n\nLinde has a commitment to safety that is expressed in a company-wide goal of \"Zero/Zero\", which means zero accidents and zero injuries or illnesses at each and every location. We look to constantly improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees.                            \n\n                            \n\nThere are currently no major projects for safety improvements that have reached the planning stage.                            \n\n"
    }
  ]
}