{
  "FacilityID": 1000043287,
  "FacilityName": "Agrium U.S. Inc.- Borger Nitrogen Operations",
  "FacilityStr1": "F.M. 1551",
  "FacilityStr2": null,
  "FacilityCity": "Borger",
  "FacilityState": "TX",
  "FacilityZipCode": "79008",
  "Facility4DigitZipExt": "5067",
  "FacilityCountyFIPS": "48233",
  "LEPC": "Hutchinson County LEPC",
  "FacilityLatDecDegs": "35.644722",
  "FacilityLongDecDegs": "-101.425278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I7",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Agrium U.S. Inc.",
  "Company2Name": null,
  "CompanyDUNS": 808957229,
  "Company2DUNS": null,
  "OperatorName": "Agrium U.S. Inc.",
  "OperatorStr1": "9201 FM 1551",
  "OperatorStr2": null,
  "OperatorCity": "Borger",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79007",
  "OperatorZipCodeExt": "5067",
  "FTE": 120,
  "OtherEPAFacilityID": "79008CMNCMFMROA",
  "EPAFacilityID": "100000019534",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "01689",
  "SafetyInspectionDate": "2017-11-20 00:00:00",
  "SafetyInspectionBy": "Corporate EH&S Audit",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-02-05 07:45:31",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-05-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.6417,
  "FRS_Long": -101.4228,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053375,
      "AltID": "Anhydrous Ammonia Plant",
      "FacilityID": 1000043287,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064761,
          "ProcessID": 1000053375,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000064762,
          "ProcessID": 1000053375,
          "ChemicalID": 56,
          "Quantity": 2447045.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000054140,
          "ProcessID": 1000053375,
          "NAICSCode": "325311",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000044834,
              "Process_NAICS_ID": 1000054140,
              "SafetyReviewDate": "2017-10-01 00:00:00",
              "PHA_Date": "2017-12-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-04-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Visual, Audio and Olfactory Checklist, and  Surveillance Camera",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-04-01 00:00:00",
              "TrainingReviewDate": "2017-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based Training (CBT)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-23 00:00:00",
              "EquipmentInspectionDate": "2014-05-27 00:00:00",
              "EquipmentTested": "Piping Systems, Pressure Vessels, Storage Tanks, Rotating Equipment",
              "ChangeMgmtDate": "2014-05-27 00:00:00",
              "ChangeMgmtReviewDate": "2013-09-23 00:00:00",
              "PreStartupReviewDate": "2014-03-04 00:00:00",
              "ComplianceAuditDate": "2013-12-19 00:00:00",
              "AuditCompletionDate": "2016-12-31 00:00:00",
              "IncidentInvestigationDate": "2013-05-17 00:00:00",
              "InvestigationChangeDate": "2013-05-17 00:00:00",
              "ParticipationPlansReviewDate": "2011-02-02 00:00:00",
              "HotWorkPermitReviewDate": "2014-04-26 00:00:00",
              "ContractorSafetyReviewDate": "2014-05-27 00:00:00",
              "ContractorSafetyEvalDate": "2013-01-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000053910,
                  "PreventionProgram3ID": 1000044834,
                  "ProcessChemicalID": 1000064761
                },
                {
                  "PrimaryKey": 1000053911,
                  "PreventionProgram3ID": 1000044834,
                  "ProcessChemicalID": 1000064762
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043287,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-07-31 00:00:00",
    "ERTrainingDate": "2012-10-26 00:00:00",
    "CoordinatingAgencyName": "Hutchinson County LEPC",
    "CoordinatingAgencyPhone": "8062730136",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043287,
      "SummaryText": "Borger Nitrogen Operations\r\nRMP Executive Summary\r\n\r\n1. Accidental Release Prevention and Emergency Response Policies \r\n\r\nAgrium U.S. Inc. is strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeably, if such a release does occur, we are also completely coordinated with Borger Fire Department and the Hutchinson County LEPC which provides emergency response expertise. \r\n\r\n2. The Stationary Source and the Regulated Substances Handled \r\n\r\nOur facility's primary activities encompass production of Anhydrous Ammonia and Urea Fertilizers. We have two (2) regulated substances present at our facility. These substances include Ammonia and Chlorine. Ammonia is produced and distributed for use as a nitrogen fertilizer. Chlorine is used for treating the cooling water within the process. The maximum inventory of Ammonia at our facility is 2,447,045.00 lb. while Chlorine is present at our facility in a maximum quantity of 24,000.00 lb. \r\n\r\n3. The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative \r\ncontrols and mitigation measures to limit the distances for each reported scenario. \r\n\r\nTo evaluate the worst case scenarios, we have used EPA's RMP Comp. For alternative release scenario analyses, we have employed the EPA RMP Comp as well. Marplot was used to calculate population within scenarios. The following paragraphs provide details of the chosen scenarios. The worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from the Anhydrous Ammonia Plant. The scenario involves the release of 400,000 lb. of Ammonia in a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043287,
      "SummaryText": "gaseous form over 10 minutes. At Class F atmospheric stability and 3.4 mph wind speed, the maximum distance of 11.0 miles is obtained corresponding to a toxic endpoint of 0.14 mg/L, basis ERPG-2.\r\n\r\nOne alternative release scenario has been submitted for each toxic substance present in Program 2 and Program 3 processes cumulatively. The alternative release scenario for Ammonia involves a release from Truck Loading in the Anhydrous Ammonia Plant process. The scenario involves the release of 2,616 lb. of Ammonia in a gaseous form over 2 minutes. The release is also assumed to be controlled by active mitigation measures that include excess flow valves, emergency shutdown systems and loading personnel in the area during all loading operations. The loading personnel have been trained to take quick and appropriate actions, should a release occur. Emergency shutdown systems are also located in other areas throughout the process.  At Class D atmospheric stability and 6.7 mph wind speed, the maximum distance of 0.7 miles is obtained corresponding to a toxic endpoint of 0.14 mg/L, basis ERPG-2, basis ERPG-2\r\n\r\nThe alternative release scenario for Chlorine involves a release from the Chlorine cylinder piping in the Anhydrous Ammonia Plant process. The scenario involves the release of 2000 lb. of Chlorine in a gaseous form over 10.0 minutes. The release is also assumed to be controlled by active mitigation measures that include a Chlorine detection system, operational procedures and visual monitoring. At Class D atmospheric stability and 6.7 mph wind speed, the maximum distance of 0.6 miles is obtained corresponding to a toxic endpoint of 0.0087 mg/L, basis ERPG-2.\r\n\r\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps \r\n\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68. This facility was designed and constructed in accordance with NFPA 58 Stand"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043287,
      "SummaryText": "ard, 1967 Edition, as well as M.W. Kellogg specifications. Processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119. Our facility is also subject to EPCRA Section 302 notification requirements. We also have an air operating permit ID under Title V of the Clean Air Act. The following sections briefly describe the elements of the release prevention program that is in place at our facility. \r\n\r\nEmployee Participation \r\nAgrium U.S. Inc. truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular. \r\n\r\nProcess Safety Information \r\nAgrium U.S. Inc. maintains a detailed record of process safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes. \r\n\r\nProcess Hazard Analysis \r\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The HAZOP methodology is used to carry out these analyses. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated as per the requirements of the OSHA PSM Standard. Any findings related to the hazard analysis are addressed in a timely manner. \r\n\r\nOperating Procedures \r\nFor the purposes of safely conducting activities within our processes, Agrium U.S. Inc. maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043287,
      "SummaryText": "undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of five (5) years. \r\n\r\nContractors \r\nOn occasion, our company employs contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Agrium U.S. Inc. has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur. \r\n\r\nCompliance Audits \r\nAgrium U.S. Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every three (3) years and any corrective actions required as a result of the audits are undertaken in a timely manner. \r\n\r\n5. Five-year Accident History: No Accidents To Report. \r\n\r\n6. Emergency Response Plan \r\n\r\nAgrium U.S. Inc. carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment being available, evacuations, notification of local emergency response agencies and the public.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. Hutchinson County LEPC is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified. \r\n\r\n7. Planned Changes to Improve Safety \r\n\r\nAs part of our continuous improvement efforts:\r\n* Agrium has a Manufacturing Management System (MMS) and continually works on improving the system to industry best practices. \r\n* Agrium is continually evaluating existin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043287,
      "SummaryText": "is readily accessible to operators involved in the processes. \r\n\r\nTraining \r\nAgrium U.S. Inc. has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every three (3) years for operations personnel and more frequently if needed. Refresher training is provided annually for all loading personnel. \r\n\r\nMechanical Integrity \r\nAgrium U.S. Inc. carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. \r\n\r\nManagement of Change \r\nWritten procedures are in place at Agrium U.S. Inc. to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews \r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Agrium U.S. Inc. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation. \r\n\r\nIncident Investigation \r\nAgrium U.S. Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000043287,
      "SummaryText": "g systems in order to improve safety"
    }
  ]
}