{
  "FacilityID": 1000043756,
  "FacilityName": "Benedum Gas Plant",
  "FacilityStr1": "8900 FM 1555",
  "FacilityStr2": null,
  "FacilityCity": "Rankin",
  "FacilityState": "TX",
  "FacilityZipCode": "79778",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48461",
  "LEPC": "Upton County LEPC",
  "FacilityLatDecDegs": "31.339722",
  "FacilityLongDecDegs": "-101.801569",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Targa Resources Corp.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Targa Pipeline Mid-Con WestTex, LLC",
  "OperatorStr1": "306 West Wall Street",
  "OperatorStr2": null,
  "OperatorCity": "Midland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79701",
  "OperatorZipCodeExt": "5173",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000131993",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "SOP O-3111",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-02 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-07-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-07-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 31.362088,
  "FRS_Long": -101.77962,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054058,
      "AltID": "211112",
      "FacilityID": 1000043756,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065815,
          "ProcessID": 1000054058,
          "ChemicalID": 155,
          "Quantity": 193899.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000055545,
              "ProcessChemicalID": 1000065815,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000055546,
              "ProcessChemicalID": 1000065815,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000055548,
              "ProcessChemicalID": 1000065815,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000055549,
              "ProcessChemicalID": 1000065815,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000055550,
              "ProcessChemicalID": 1000065815,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000055547,
              "ProcessChemicalID": 1000065815,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000054849,
          "ProcessID": 1000054058,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043756,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-07-24 00:00:00",
    "ERTrainingDate": "2014-02-13 00:00:00",
    "CoordinatingAgencyName": "Rankin Fire Department",
    "CoordinatingAgencyPhone": "4326932422",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043756,
      "SummaryText": "Risk Management Plan (2014 Update)\r\nExecutive Summary for the Benedum Gas Plant\r\n\r\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\n\r\nThe Benedum Gas Plant has a long-standing commitment to workers and public safety. This commitment\r\nis demonstrated by our efforts in accident prevention, such as training personnel, quality assurance, and\r\nconsidering safety in the design, installation, operation, and maintenance of our process. Our policy is to\r\nimplement reasonable controls to provide a safe operation and prevent foreseeable releases of regulated\r\nsubstances. However, if a release does occur, trained facility personnel will evaluate the situation, take\r\nactions within the capabilities of the facility to control and contain the release, and notify the necessary\r\noutside agencies.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nTarga Pipeline Mid-Continent Holdings, LLC owns and operates the Benedum Gas Plant, which is a nonfractionating\r\nnatural gas plant located approximately 12 miles northeast of Rankin in Upton County,\r\nTexas. The plant is designed to process natural gas and recover liquid product from natural gas by\r\nphysical separation and cryogenic means. Petroleum condensates and natural gas liquids are recovered\r\nfrom the inlet pipeline at this location for offsite sales.\r\nThe Benedum Gas Plant operates a cryogenic expander plant with refrigeration compression to assist in\r\nextracting liquid petroleum products from raw natural gas. Plant products include pipeline quality natural\r\ngas-primarily methane-and natural gas liquids (NGL) comprised of ethane, propane, butane, pentane,\r\nand heavier hydrocarbons, some of which are regulated flammable substances. The part of the process\r\nthat was selected to represent all regulated flammable substances at the Benedum Gas Plant which\r\ncould contain a regulated flammable substance above the threshold quantity is as follows:\r\n- Condensate Storage Tank V-31 comprised primarily of a Butane-plus (NGL)"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043756,
      "SummaryText": "mixture\r\nThis process vessel was selected due to having the greatest inventory and endpoint potential of a\r\nregulated flammable substance that could hypothetically be released and have offsite consequences.\r\nIn order to establish the safest possible environment for our employees and the public, there are no\r\nregulated toxic substances above the threshold quantity present at the Benedum Gas Plant. It is\r\nnoteworthy that the Benedum Gas Plant follows applicable laws set forth in OSHA's Process Safety\r\nManagement (PSM) standard 29 CFR 1910.119.\r\n\r\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\r\n\r\nThe Worst-Case Scenario (WCS) associated with a release of a regulated flammable substance in this\r\nGas Plant is a Vapor Cloud Explosion (VCE) involving the full inventory of the largest storage tank\r\ncontaining the condensate NGL mixture. For Worst Case Scenario calculations it is assumed that the full\r\ninventory capacity (100% maximum tank capacity of 35,000 gallons) of this tank is to release and ignite,\r\nresulting in a VCE. The maximum distance to the 1 psi endpoint for this WCS is 0.46 miles or\r\napproximately 2,445 feet. Additionally, although we have numerous controls to prevent such releases\r\nand to manage their consequences, no credit for active or passive mitigation measures was taken into\r\naccount in evaluating or calculating the WCS for the Benedum Gas Plant.\r\nThe Alternative Release Scenario (ARS) for flammable substances at the Benedum Gas Plant is a VCE\r\nresulting from a release of 36,356 pounds of the condensate NGL mixture over a sixty (60) minute period,\r\nresulting from a seal failure at the condensate pump, CPS-101. This hypothetical release is expected to\r\nbe isolated by an operator in less than sixty minutes. The maximum distance to the 1-psi overpressure\r\nendpoint for this event is 0.27 miles or 1,400 feet. This event was selected as being the most statistically\r\ncredible scenario for use in emergency planning and response. Although the Benedum Gas Plant is\r\nclassi"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000043756,
      "SummaryText": "own systems for specific process parameters\r\n- Curbing or diking to contain liquid releases\r\n- Redundant equipment and instrumentation (e.g. UPS system)\r\n- Atmospheric relief devices\r\n- Overall Plant and local area ESDs\r\n- Release Mitigation- Manually operated fire extinguishing systems\r\n- Trained emergency response personnel\r\n- Personnel protective equipment (e.g. respiratory equipment)\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nIn the last five years there have not been any hydrocarbon releases whose quantities approached those\r\ndescribed in the RMP release events.\r\n\r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\n\r\nThe Benedum Gas Plant maintains a written emergency response program, which is in place to protect\r\nworker and public safety and the environment. The program consists of procedure for responding to a\r\nrelease of a regulated substance, including the possibility of a fire or explosion if a flammable substance\r\nis accidentally released. The procedures address all aspects of emergency response, including proper\r\nfirst aid and medical treatment for exposures, evacuation plans and accounting for personnel after an\r\nevacuation, notification of local emergency response agencies and the public if a release occurs, and\r\npost incident cleanup. In addition, the plant has procedures that address maintenance, inspection, and\r\ntesting of emergency equipment. Employees receive training in these procedures as necessary to\r\nperform their specific emergency response duties. The emergency response program is updated when\r\nnecessary based on modifications made to the plant. The emergency response program changes are\r\nadministered through the MOC process, which includes informing and/or training affected personnel in\r\nthe changes.\r\nThe overall emergency response program of the Benedum Gas Plant is coordinated with the Rankin fire\r\ndepartment and the Upton County Local Emergency Planning Committee (LEPC). This coordination\r\nincludes periodic meeting of the committee, which includes local eme"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043756,
      "SummaryText": "evaluates hazards of the process\r\nas well as accident prevention and mitigation measures. The team makes suggestions for additional\r\nprevention and/or mitigation measures when the team believes such measures are necessary.\r\nIf necessary, the PHA team findings are forwarded to local and corporate management for resolution.\r\nImplementation of mitigation options in response to PHA findings is based on a relative risk ranking\r\nassigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned the\r\nhighest risk receive immediate attention.\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly\r\nfrom the original design safety features, the plant periodically updates and revalidates the hazard analysis\r\nresults. These periodic reviews are conducted at least every 5 years and will be conducted at this\r\nfrequency until the process is no longer operating. The results and findings from these updates are\r\ndocumented and retained.\r\n\r\nOPERATING PROCEDURES\r\n\r\nThe Benedum Gas Plant maintains written procedures that address various modes of process operations,\r\nsuch as unit startup, normal operations, emergency shutdown, and normal shutdown. These procedures\r\ncan be used as a reference by experienced operators and provide a basis for consistent training of new\r\noperators. These procedures are periodically reviewed to ensure they are current and accurate. The\r\nprocedures are also kept current and accurate by revising them as necessary to reflect changes made\r\nthrough the management of change process.\r\n\r\nTRAINING\r\n\r\nTo complement the written process operating procedures, the Benedum Gas Plant has a comprehensive\r\ntraining program for all employees involved in operating a process. New employees receive basic\r\ntraining in gas plant operations if they are not already familiar with such operations. After successfully\r\ncompleting this training, a new operator is paired with a senior operator to learn process-sp"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000043756,
      "SummaryText": "ecific duties\r\nand tasks. After operators demonstrate having adequate knowledge to perform the duties and tasks in a\r\nsafe manner on their own, they can work independently. In addition, all operators periodically receive\r\nrefresher training on the operating procedures to ensure that their skills and knowledge are maintained at\r\nan acceptable level. This refresher training is conducted at least every 3 years. All training is\r\ndocumented for each operator, including the means used to verify the operators understanding of the\r\ntraining.\r\n\r\nCONTRACTORS\r\n\r\nThe Benedum Gas Plant uses contractors to supplement its work force during periods of increased\r\nmaintenance or construction activities. Because some contractors work on or near process equipment,\r\nthe gas plant has procedures in place to ensure that contractors; 1) perform their work in a safe manner,\r\n2) have the appropriate knowledge and skills, 3) are aware of the hazards in their workplace, 4)\r\nunderstand what they should do in the event of an emergency, 5) understand and follow site safety rules,\r\nand 6) inform gas plant personnel of any hazards that they find during their work. This is accomplished\r\nby providing contractors with; 1) process overview, 2) information about safety and health hazards, 3)\r\nemergency response plan requirements, 4) safe work practices prior to their beginning work, and 5) safe\r\nand hot work permits as required. In addition, the Benedum Gas Plant evaluates contractor safety\r\nprograms and performance during the selection of a contractor.\r\n\r\nPRE-STARTUP SAFETY REVIEWS (PSSRS)\r\n\r\nThe Benedum Gas Plant conducts a PSSR for any new facility or facility modification that requires a\r\nchange in the process safety information. The purpose of the PSSR is to ensure that safety features,\r\nprocedures, personnel, and equipment are appropriately prepared for startup prior to placing the\r\nequipment into service. This review provides one additional check to make sure construction is in\r\naccordance with t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043756,
      "SummaryText": "fied as a Program 1 facility, the ARS was calculated for informational purposes only.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nThe following is a summary of the accident prevention program in place at the plant. Because processes\r\nat the plant are regulated by the Environmental Protection Agency's (EPA's) Risk Management Program\r\n(RMP), the facility is also subject to the Occupational Safety and Health Administration's (OSHA's)\r\nprocess safety management (PSM) standard. The following summary addresses each of the OSHA PSM\r\nelements and describes the management system in place to implement the accident prevention program.\r\n\r\nEMPLOYEE PARTICIPATION\r\n\r\nThe Benedum Gas Plant requires employees to participate in all facets of process management and\r\naccident prevention. Examples of employee participation range from updating and compiling technical\r\ndocuments and chemical information to participating as a member of a process hazard analysis (PHA)\r\nteam. Employees have access to all information created as part of the gas plant accident prevention\r\nprogram. Specific ways that employees are involved in the accident prevention program are documented\r\nin an employee participation plan that is maintained at the gas plant and addresses each accident\r\nprevention program element. In addition, the gas plant has a number of initiatives under way that\r\naddress process and employee safety issues. These include development of standardized operating\r\nprocedures, incident investigation, management of change, safe work practices, our Safe Start program\r\nand participation in flowsheet reviews.\r\n\r\nPROCESS SAFETY INFORMATION\r\n\r\nThe Benedum Gas Plant keeps a variety of technical documents that are used to help maintain safe\r\noperation of the process. These documents address chemical properties and associated hazards, limits\r\nfor key process parameters, and equipment design basis/configuration information. The Operations\r\ngroup has been assigned responsibility for maintaining up-t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043756,
      "SummaryText": "o-date process safety information. The\r\nlocation of these documents is readily available to help employees locate any necessary process safety\r\ninformation.\r\nChemical-specific information, including exposure hazards and emergency response/exposure treatment\r\nconsideration, is provided in Material Safety Data Sheets (MSDS). This information is supplemented by\r\ndocuments that specifically address known corrosion concerns and any known hazards associated with\r\nthe inadvertent mixing of chemicals. For specific process areas, the gas plant has documented safetyrelated\r\nlimits for specific process parameters in operating manuals. The gas plant ensures that the\r\nprocess is maintained within these limits using process controls and monitoring instruments, highly\r\ntrained personnel and protective instrument systems (e.g., automated shutdown systems).\r\nThe Benedum Gas Plant maintains numerous technical documents that provide information about the\r\ndesign and construction of process equipment. This information includes materials of construction,\r\ndesign pressure and temperature ratings, and electrical rating of equipment. This information, in\r\ncombination with written procedures and trained personnel, provides a basis for establishing inspection\r\nand maintenance activities, as well as for evaluating proposed process and facility changes to ensure that\r\nsafety features in the process are not compromised.\r\n\r\nPROCESS HAZARD ANALYSIS\r\n\r\nThe Benedum Gas Plant has a comprehensive program to ensure that hazards associated with the\r\nvarious processes are identified and controlled. Within this program each process is systematically\r\nexamined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\nThe Benedum Gas Plant uses the Process Hazard Analysis (PHA) technique to perform these\r\nevaluations. These reviews are conducted using a team of people who have operating and maintenance\r\nexperience as well as engineering expertise. This team identifies and"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000043756,
      "SummaryText": "rgency response officials, local\r\ngovernment officials, and industry representatives. The Benedum Gas Plant has around the clock\r\ncommunications capability with appropriate LEPC officials and emergency response organizations. This\r\nprovides a means of notifying the public of an incident, if necessary, as well as facilitating quick response\r\nto emergency situations. The Benedum Gas Plant conducts periodic emergency drills that involve the\r\nlocal emergency response organizations, and the gas plant provides annual refresher training to local\r\nemergency responder regarding the hazards of regulated substances in the gas plant.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Benedum plant has annual training on the emergency response plan. This training has included the\r\nlocal emergency response groups including, flight for life, local ambulance services, and the local fire\r\ndepartments. These training sessions are audited by WGR Safety Personnel."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000043756,
      "SummaryText": "he design specifications and that all supporting systems are operationally ready. The\r\nPSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of\r\nthe construction and serves as a quality assurance function by requiring verification that accident\r\nprevention program requirements are properly implemented.\r\n\r\nMECHANICAL INTEGRITY\r\n\r\nThe Benedum Gas Plant has well established practices and procedures to maintain pressure vessels,\r\npiping systems, relief and vent systems, controls, pumps, heat exchangers, compressors, and emergency\r\nshutdown systems in a safe operating condition. The basic aspects of this program include; 1)\r\nconducting training, 2) developing written procedures, 3) performing inspections and tests, 4) correcting\r\nidentified deficiencies, and 5) applying quality assurance measures. In combination these activities form\r\na system that maintains the mechanical integrity of the process. All of these activities are tracked and\r\ndocumented using an asset manager database.\r\nMaintenance personnel receive training on; 1) an overview of the process, 2) safety and health hazards\r\n3) applicable maintenance procedures, 4) emergency response plans, and 5) applicable safe work\r\npractices to help ensure that they can perform their jobs in a safe manner. Written procedures help\r\nensure that work is performed in a consistent manner and provide a basis for training. Inspections and\r\ntests are performed to verify that equipment parameters are within acceptable limits. For a vessel the\r\nparameter being monitored would typically be wall thickness. If a deficiency is identified employees will\r\ncorrect the deficiency before placing the equipment back into service (if possible), or a management of\r\nchange team will review the use of the equipment and determine what actions are necessary to ensure\r\nthe safe operation of the equipment.\r\n\r\nSAFE WORK PRACTICES\r\n\r\nThe Benedum Gas Plant has long standing safe work practices in place to"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000043756,
      "SummaryText": "help ensure worker and\r\nprocess safety. Examples of these include; 1) control of the entry/presence/exit of support personnel, 2)\r\na lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance,\r\n3) a procedure for safe removal of hazardous substances before process piping or equipment is opened,\r\n4) a permit and procedure to control spark producing activities (i.e. hot work), and 5) a permit and\r\nprocedure to ensure that adequate precautions are in place before entry into a confined space. These\r\nprocedures along with training of affected personnel form a system to help ensure that operations and\r\nmaintenance activities are performed safely.\r\n\r\nMANAGEMENT OF CHANGE\r\n\r\nThe Benedum Gas Plant has a comprehensive system to manage changes to all covered processes.\r\nThis system requires that changes to items such as process equipment, chemicals, technology,\r\nprocedures, and other facility changes be properly reviewed and authorized before being implemented.\r\nChanges are reviewed to; 1) ensure that adequate controls are in place to manage any new hazards, 2)\r\nverify that existing controls have not been compromised by the change, and 3) ensure that changes do\r\nnot introduce an unknown hazard to the process. Affected chemical hazard information, process\r\noperating limits, and equipment information, as well as procedures are updated to incorporate these\r\nchanges. In addition, operating and maintenance personnel are provided necessary training on the\r\nchange.\r\n\r\nINCIDENT INVESTIGATION\r\n\r\nThe Benedum Gas Plant promptly investigates all incidents that resulted in, or reasonably could have\r\nresulted in a fire/explosion, major property damage, environmental loss, or personal injury. The goal of\r\neach investigation is to determine the facts and develop corrective actions to prevent a recurrence of the\r\nincident or a similar incident. The investigation team documents it findings, develops recommendations\r\nto prevent a recurrence, and forwards"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000043756,
      "SummaryText": "these results to gas plant management for resolution. The final\r\nresolution of each finding or recommendation is documented and the investigation results reviewed with\r\nall employees who could be affected by the findings. Incident investigation reports are retained for at\r\nleast 5 years so that the reports can be reviewed during future PHAs.\r\n\r\nCOMPLIANCE AUDITS\r\n\r\nTo help ensure that the accident prevention program is functioning properly, the Benedum Gas Plant\r\nperiodically conducts an audit to determine whether the procedures and practices required by the\r\naccident prevention program are being implemented. Compliance audits are conducted at least every 3\r\nyears. Both hourly and staff personnel participate as audit team members. The audit team develops\r\nfindings that are forwarded to gas plant management for resolution.\r\n\r\nCHEMICAL -SPECIFIC PREVENTION STEPS\r\n\r\nThe processes at the Benedum Gas Plant have hazards that must be managed to ensure continued safe\r\noperation. The following is a description of existing safety features applicable to prevention of accidental\r\nreleases of regulates substances in the facility.\r\n\r\nUNIVERSAL PREVENTION ACTIVITIES\r\n\r\nThe accident prevention program summarized previously is applied to all RMP covered processes at the\r\nBenedum Gas Plant. Collectively these prevention program activities help prevent potential accident\r\nscenarios that could be caused by equipment failure and human errors.\r\n\r\nSPECIALIZED SAFETY FEATURES\r\n\r\nThe Benedum Gas Plant has safety features on many units to help; 1) contain/control a release 2) quickly\r\ndetect a release, and 3) reduce the consequence of a release. The following types of safety features are\r\nused in the covered processes:\r\n- Release Detection: Hydrocarbon detectors with alarms\r\n- Release Containment/Control: Process relief valves that discharge to a flare which will capture and\r\nincinerate episodic releases\r\n- Valves to permit isolation of a portion or entirety of the process\r\n- Automated shutd"
    }
  ]
}