{
  "FacilityID": 1000004160,
  "FacilityName": "General Mills Operations, Inc.",
  "FacilityStr1": "6101 Southeast 52nd Street",
  "FacilityStr2": null,
  "FacilityCity": "Carlisle",
  "FacilityState": "IA",
  "FacilityZipCode": "50047",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19153",
  "LEPC": "Polk County LEPC",
  "FacilityLatDecDegs": "41.526944",
  "FacilityLongDecDegs": "-093.506944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5276803,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "General Mills Operations, Inc.",
  "OperatorStr1": "6101 Southeast 52nd Street",
  "OperatorStr2": null,
  "OperatorCity": "Carlisle",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50047",
  "OperatorZipCodeExt": null,
  "FTE": 87,
  "OtherEPAFacilityID": "IAD005276803",
  "EPAFacilityID": "100000168837",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-09-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-05-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.52609,
  "FRS_Long": -93.51003,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000005085,
      "AltID": "Chlorine",
      "FacilityID": 1000004160,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000005748,
          "ProcessID": 1000005085,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000005295,
          "ProcessID": 1000005085,
          "NAICSCode": "311211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000003702,
              "Process_NAICS_ID": 1000005295,
              "SafetyReviewDate": "2008-08-01 00:00:00",
              "PHA_Date": "2009-03-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-06-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Halogen Valves Battery Backup",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-04-02 00:00:00",
              "TrainingReviewDate": "2009-04-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-04-02 00:00:00",
              "EquipmentInspectionDate": "2009-02-13 00:00:00",
              "EquipmentTested": "Tanks, manifolds, valve train, chlorine towers",
              "ChangeMgmtDate": "2009-02-25 00:00:00",
              "ChangeMgmtReviewDate": "2008-08-01 00:00:00",
              "PreStartupReviewDate": "2009-02-25 00:00:00",
              "ComplianceAuditDate": "2008-08-01 00:00:00",
              "AuditCompletionDate": "2009-05-31 00:00:00",
              "IncidentInvestigationDate": "2008-11-07 00:00:00",
              "InvestigationChangeDate": "2008-11-07 00:00:00",
              "ParticipationPlansReviewDate": "2008-08-01 00:00:00",
              "HotWorkPermitReviewDate": "2008-08-04 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-05 00:00:00",
              "ContractorSafetyEvalDate": "2008-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000004386,
                  "PreventionProgram3ID": 1000003702,
                  "ProcessChemicalID": 1000005748
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000004160,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Carlisle Fire Department",
    "CoordinatingAgencyPhone": "5159893311",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000004160,
      "SummaryText": "s meeting was held on ________ 2000 in cooperation with local first responders and other industry.\n\n\n8.  Planned Changes to Improve Safety\n\nAll recommendations from PHAs, MOCs, PSRs, mechanical integrity inspections, incident investigations, and compliance audits are addressed.  In addition, it is General Mills' policy to review operating, maintenance, and emergency response procedures on a routine basis to ensure they are always applicable and effective.  This continuous review process generates further recommendations for improved safety during the course of operations, but these measures are typically addressed in a very short time frame.\n\n\n9.  Summary\n\nThe design, operation, and maintenance of the chlorine system according to The Chlorine Institute standards and guidelines, and the implementation of the PSM and RMP programs, provide a high level of assurance that the hazards and risks associated with the use of chlorine are being managed in an appropriate manner.  The likelihood of a release is minimized through the implementation of these programs.  General Mills has developed an Emergency Response Plan which is coordinated through the local response agencies and the information in this Risk Management Plan is communicated to the local community.  General Mills operations management is committed to safety and implementation of safe procedures for Prevention and Preparedness."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000004160,
      "SummaryText": "r system changes.\n\nCompliance Audits - Compliance audits are conducted at least every 3 years.  The last PSM/RMP compliance audit was performed in August 2008.  Findings from the audit are being addressed.\n\nIncident Investigation - An incident investigation policy and procedure has been developed to help determine the root cause of an incident and to help develop measures to prevent recurrence.\n\nEmployee Participation - An employee participation program (for safety and risk management) is in place to ensure employees are aware of the PSM program, the PHA, and its findings.  Employees were involved in the PHA and are trained on the operation of the chlorine system.\n\nHot Work Permit - A hot work permit program has been developed and implemented for hot work conducted in and around the chlorine systems.\n\nContractor Safety - Contractor safety procedures are in place to ensure the contractor is aware of the hazards involved in the work, and to verify the contractor will follow safe work practices in place.\n\n\n6.  Five-Year Accident History\n\nThere have been no releases of chlorine at the Carlisle facility in the last five years that meet the RMP reporting criteria.\n\n\n7.  Emergency Response Preparedness Program\n\nThe Carlisle plant has an emergency response program which is described in the site Emergency Response Plan (ERP).  This plan includes procedures for evacuations, notifying response agencies and adjacent businesses and neighbors, emergency equipment list, and procedures for responding to any release that may occur.  The plan also includes first aid procedures for toxic exposures to chlorine.  The ERP is coordinated with the Carlisle Fire and Rescue Department (Des Moines Hazmat Team) and is consistent with the regional hazmat response plan.  Annual chlorine emergency evacuation and response drills are conducted.\n\nThe facility has conducted risk management plan communication meetings with employees and has notified immediate offsite receptors.  A public communication"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000004160,
      "SummaryText": "Executive Summary\n\n\nThe Risk Management Program (RMP) for the General Mills Â¿ Carlisle, Iowa facility includes an Executive Summary as required by 40CFR 68.155.  This Executive Summary includes a discussion of the various Risk Management Program elements as follows:\n\n1. Accidental release prevention and emergency response policies\n2. Stationary source activities\n3. Regulated substances handled\n4. Release scenario analysis\n5. Accidental release prevention program\n6. Five-year accident history\n7. Emergency response preparedness program\n8. Planned changes to improve safety\n9. Summary\n\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nIt is General Mills' policy to comply with all of the requirements of the EPA's Accidental Release Prevention Program regulation and all applicable Federal and state rules and regulations.  The Carlisle plant has developed an OSHA Process Safety Management (PSM) Manual that documents safety and risk management policies pertaining to the prevention of accidental releases and emergency response.  In addition to the PSM Manual, the Carlisle plant has developed a Risk Management Program that includes a description of the management system, the Offsite Consequence Analysis (OCA), the five-year accident history, the Prevention Program elements, and an Emergency Response Program.                                          \n\nThe facility is designed and operated in accordance with the standards and guidelines of The Chlorine Institute, Inc.\n\n\n2.  Stationary Source Activities\n\nThe plant is located in the City of Carlisle, in Polk County, Iowa.  The plant utilizes flourmills to produce flour.  Chlorine is used in the flour milling process to bleach or age the flour.  The reaction of raw flour and chlorine is complete within normal application rates.  No chlorine is discharged and there are no byproducts or waste products created under normal conditions.\n\n\n3.  Regulated Substances Handled\n\nThe chlorine for the flour milling process a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000004160,
      "SummaryText": "t the Carlisle plant is a regulated substance under the EPA's Risk Management Program rule.  The chlorine storage and gas delivery system is a closed system and delivers gaseous chlorine to the flour chlorinators under vacuum.  The chlorinating system consists of containers, piping, valves, pumps, flowmeters, and controls.  Full chlorine containers are delivered and empty containers picked up by an outside service.\n\nA chlorine detector is located in the chlorine container storage room.  A visual alarm for the detector is located in an alarm panel in the mill control room.  Associated with the visual alarm is an audio alarm that sounds throughout the milling facility.  A visual alarm is also located on the exterior of the chlorine storage building.\n\nThe clorination system reduces the gas pressure from the storage container to near zero, allowing the system to operate in a vacuum.  If a release does occur in the chlorine piping to the chlorinators the flow of chlorine is automatically shut off.\n\n\n4.  Release Scenario Analysis\n\nThe EPA OCA Guidance Reference Tables (RMP*Comp program) and The Chlorine Institute guidance were used to develop the potential off site impacts from various release scenarios.  A worst-case scenario was developed to identify the potential off-site emergency response planning needed with community first responders; however, it is important to emphasize that a worst-case release is extremely unlikely to occur because of the many safety features inherent in the design and operational systems for the plant.  On the other hand, the alternative release scenario is based on credible assumptions and was selected from a number of possible scenarios.  The alternate chlorine release scenario would be representative of container delivery pipe, gasket, or valve packing leak in the chlorine storage room.  A chlorine detector is located within the room to automatically start exhaust fans, sound an alarm, and automatically close the container valves (stopping"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000004160,
      "SummaryText": "the flow).\n\n\n5.  Prevention Programs\n\nFor the Carlisle Plant chlorine system, General Mills implemented an RMP Program 3 Prevention Program that is equivalent to the OSHA Process Safety Management (PSM) program.  This is one of the most important ways for preventing chlorine releases and for minimizing the impacts of any release that does occur.  Some of the key elements of the Prevention Program are summarized below. \n\nProcess Safety Information (PSI) - A comprehensive set of process safety information has been compiled for the chlorine system.  The PSI includes data on the chemicals, equipment, technology, process flow diagrams and P&IDs.\n\nProcess Hazards Analysis (PHA) Â¿ An initial PHA was conducted to satisfy the PSM requirements and is re-validated at least every 5 years.  Recommendations made by the most recent PHA team to further improve safety have been addressed.\n\nOperating Procedures - Equipment operating and maintenance manuals, in addition to plant specific safe work practices, provide written guidance for chlorine system operations, including safe unloading and handling of chlorine containers.\n\nTraining - Training is provided for all personnel involved with mill plant (clorinating) operations.  Annual training includes the safe unloading and handling of chlorine, chlorine system operation, and emergency response preparedness.\n\nMaintenance (Mechanical Integrity) - Equipment inspections, testing, and preventative maintenance activities are scheduled according to manufacturers' recommendations and/or The Chlorine Institute.  The inspections, testing, and preventative maintenance are conducted per contract with a qualified chlorine equipment service company.\n\nManagement of Change (MOC) - An MOC procedure has been developed and is implemented to ensure all changes are adequately reviewed and appropriate sections of the PSM program are updated.\n\nPre-Startup Review (PSR) - A PSR policy and procedure has been developed to address startups following equipment o"
    }
  ]
}