{
  "FacilityID": 1000107762,
  "FacilityName": "LOMO COLD STORAGE",
  "FacilityStr1": "6005 HIGHWAY 99",
  "FacilityStr2": null,
  "FacilityCity": "LIVE OAK",
  "FacilityState": "CA",
  "FacilityZipCode": "95953",
  "Facility4DigitZipExt": "9749",
  "FacilityCountyFIPS": "06101",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "39.219611",
  "FacilityLongDecDegs": "-121.640417",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "joseph@lomocold.com",
  "FacilityDUNS": 102844727,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "JUSTIN MICHELI",
  "OperatorStr1": "6005 HIGHWAY 99",
  "OperatorStr2": null,
  "OperatorCity": "LIVE OAK",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95953",
  "OperatorZipCodeExt": null,
  "FTE": 24,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000204913",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-10-25 00:00:00",
  "SafetyInspectionBy": "Sutter County Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-11-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-11-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-11-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-11-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.219611,
  "FRS_Long": -121.640417,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "100",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000134769,
      "AltID": "REFRIGERATION",
      "FacilityID": 1000107762,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000169091,
          "ProcessID": 1000134769,
          "ChemicalID": 56,
          "Quantity": 38800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000136202,
          "ProcessID": 1000134769,
          "NAICSCode": "49319",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000116098,
              "Process_NAICS_ID": 1000136202,
              "SafetyReviewDate": "2023-06-05 00:00:00",
              "PHA_Date": "2019-03-12 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-03-17 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Audible + Visual Alarm Annunciators, and olfactory (routine walkthroughs)",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "enhancement of inspections / testing / maintenance policy",
              "OpProceduresReviewDate": "2019-11-08 00:00:00",
              "TrainingReviewDate": "2023-03-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-04-15 00:00:00",
              "EquipmentInspectionDate": "2023-11-10 00:00:00",
              "EquipmentTested": "refrigeration system daily walkthrough + log sheet",
              "ChangeMgmtDate": "2018-11-06 00:00:00",
              "ChangeMgmtReviewDate": "2018-03-07 00:00:00",
              "PreStartupReviewDate": "2018-11-06 00:00:00",
              "ComplianceAuditDate": "2021-05-14 00:00:00",
              "AuditCompletionDate": "2021-05-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2022-03-03 00:00:00",
              "HotWorkPermitReviewDate": "2023-05-30 00:00:00",
              "ContractorSafetyReviewDate": "2023-11-10 00:00:00",
              "ContractorSafetyEvalDate": "2023-10-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000145817,
                  "PreventionProgram3ID": 1000116098,
                  "ProcessChemicalID": 1000169091
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000107762,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-03-31 00:00:00",
    "ERTrainingDate": "2023-02-06 00:00:00",
    "CoordinatingAgencyName": "SUTTER CTY - ENVIRONMENTAL HEALTH",
    "CoordinatingAgencyPhone": "5308227400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000107762,
      "SummaryText": "e policies, as well as ammonia equipment repairs.\n\nLomo Cold Storage, with support from contractors and consultants entrenched in the ammonia refrigeration industry, strives to ensure a safe working environment at the facility for all employees, guests, and visitors.  The facility also plans to improve safety as follows:\n\n  --  Continued involvement of refrigeration and safety personnel in the ongoing development and implementation of the risk management policies.\n  --  Participation of key personnel in industry recommended training classes to ensure the facility is aware of evolving industry standards and techniques used to encourage a safety culture at the facility.\n  --  Conducting routine meetings to ensure any issues identified by maintenance / refrigeration personnel, contractors, or consultants are discussed and addressed.\n  --  Reviewing and auditing the risk management and prevention policies to ensure they are maximizing the facility\u0092s efforts at limiting the risks associated with handling anhydrous ammonia."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000107762,
      "SummaryText": "ROGRAM  \n\nAn emergency planning and response policy has been developed at the Lomo Cold Storage facility and is maintained by the Maintenance and PSM/Safety departments.  It is based on Cal-OSHA\u0092s requirements for Emergency Action Plan (CCR Title 8, Section 3220).\n\nThe Emergency Action Plan contains procedures detailing how the facility will respond to accidental ammonia releases and other emergencies such as fires, earthquakes, power outages, etc.  This policy has been coordinated with the local emergency service agencies including:  Sutter County Environmental Health CUPA and Sutter County Fire Services (Live Oak Fire Station).\n\nThe facility\u0092s Emergency Action / Response Policy includes the following elements:\n\n  --  Key Facility Personnel and Responsibilities\n  --  Outside Agency Notification Contact Information\n  --  Detailed Action Plans for Internal Departments\n  --  First Aid Procedures\n  --  Emergency Medical Treatment Procedures\n  --  Evacuation Plans + Assembly Areas\n  --  Description for Handling Small Ammonia Releases\n  --  Details of Outside Assistance Available \n  --  Incident Command System\n  --  Initial and Refresher Training\n\nEvacuation drills are also organized and conducted annually by the Safety Department to supplement the training received by all employees at the facility.  As facility management strives to improve safety at the facility, evaluations are documented with suggested improvements, and other observations from the drills.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nLomo Cold Storage has worked to address safety issues as they arise in a continued effort to ensure a safe working environment.  Compliance Audits, PHA studies, Mechanical Integrity Inspections, in addition to routine PSM Meetings have generated recommendations to improve safety and compliance at the facility.  These include enhancing employee training policies, revising standard operating procedures, improving documentation and recordkeeping, and updating preventative maintenanc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000107762,
      "SummaryText": "ts for the design and operation of ammonia refrigeration system.  In addition to routine patrols and inspections at the facility by the security company, the facility has personnel on-site 24/7 who can monitor for any abnormal conditions.\n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the system are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to the refrigerant in a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks / unanticipated ammonia odors are noted and repaired immediately.\n\nContinued safety improvement for the ammonia refrigeration system is a top priority for Lomo Cold Storage.  The company\u0092s management team with support from professional refrigeration contractors and risk management consultants meet regularly to discuss and review any pending issues with the ammonia refrigeration system and/or the PSM/RMP policies, including any outstanding recommendations made as part of the routine implementation of the programs.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nEPA\u0092s RMP regulation defines \u0093accident\u0094 as the following: \n\n\u0093The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. The release must have caused at least one of the following: \n\n  --  On-site deaths, injuries, or significant property damage (§68.42(a)); or\n  --  Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\u0094\n\nAn investigation into the facility\u0092s accident history revealed that there have been no releases of ammonia over the past five years (November 2018 \u0096 November 2023) that meet the EPA reporting criteria for the Five-Year Accident History as specified above.  In addition, there have been no injuries resulting from a release of ammonia.\n\n\nEMERGENCY RESPONSE P"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000107762,
      "SummaryText": "ses, and to avoid adverse impacts to the environment.  These programs enable our facility to operate the refrigeration system safely because they are based on the rules, procedures, and guidelines that govern the ammonia refrigeration system, as well as the broader ammonia refrigeration industry throughout the country.\n\nFor example, routine daily inspections for all compressors include checking for oil leaks, pressure and temperature gauge readings, abnormal sounds / vibrations, oil pressure, operational parameters;  the condensers are inspected daily including water level, water distribution, pump + fan operation, water chemistry monitoring (pH, conductivity).  Weekly inspections are also conducted and documented that include receiver liquid levels, exhaust fans functional, any abnormal conditions (ex: ice buildup) in the cold storage zones, as well as verification of safety components (eye wash stations, exit routes clear, signage, etc.).  A routine semi-annual PM (inspections / testing / maintenance) is also conducted by a professional refrigeration contractor to verify function of safety design features, calibrate leak detectors, etc. \n\nThe Lomo Cold Storage ammonia refrigeration system has many safety design features including ammonia leak detectors, microprocessor controlled compressors with automatic safety cutouts, ASME certified pressure vessels, emergency stop controls, and an Emergency Refrigerant Control Box.  In addition, all pressure-rated vessels are equipped with mechanical pressure relief valves that automatically engage in case of a high pressure situation to ensure the integrity of the vessel and associated piping is protected.\n\nMuch of the safety of the refrigeration system is inherent in the policies and procedures that govern the operation of the system.  The Lomo Cold Storage facility, including the ammonia system, was designed and constructed in accordance with the recognized industry codes and standards, which specifically outline requiremen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000107762,
      "SummaryText": "absorbed by the liquid ammonia, it vaporizes (changes phase), and is then compressed by the compressors.  The resulting high pressure ammonia vapor is routed to the condensers, where fans and sprayed water are used to reject latent heat in the ammonia vapor to the atmosphere, causing it to condense to a liquid.\n\nMultiple auxiliary systems are in place to support the operational and safety requirements of the ammonia refrigeration system including:  ammonia leak detection, pressure relief system, emergency refrigerant control box, and a refrigeration control system.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nTo deal with the risks involved with ammonia refrigeration, policies and programs have been developed for the Lomo Cold Storage facility to limit the risks of an accidental ammonia release and/or minimize the consequences of a significant release, fires, explosions, and other types of catastrophic accidents.\n\nPolicies developed for the PSM/RMP programs include employee participation, process safety information, process hazard analysis, pre-startup safety review, standard operating procedures, training, management of change, mechanical integrity, hot work permit, contractor management, and incident investigation.  To help coordinate the various elements of the program, a management system has been established that defines responsible parties throughout the facility for upkeep and implementation of each policy within the PSM / RMP program.  Compliance Audits are also conducted every 3 years that can identify potential gaps in compliance and recommend actions to achieve full compliance.\n\nIn the event of an ammonia release, the emergency response plan is coordinated with the Region III Local Emergency Planning Committee (Sutter County Environmental Health) and Sutter County Fire Services (Live Oak Fire Station).  The ultimate goal for Lomo Cold Storage\u0092s PSM/RMP plan is to prevent accidental releases of ammonia, injuries / illnes"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000107762,
      "SummaryText": "and the California Accidental Release Prevention (CalARP) program (CCR Title 19, Div. 2, Chapter 4.5).  The Refrigeration Operator + PSM Safety Manager have the primary responsibilities for implementation of the PSM and RMP policies aimed at reducing the hazards associated with the ammonia refrigeration systems.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Lomo Cold Storage facility has been in operation since the mid 1980s.  It is located just off of California Highway 99 approximately 4 miles south of Live Oak.  The facility includes multiple cold storage buildings with many rooms that are independently temperature controlled (ranging from 0°F to 70°F) as appropriate for various local agricultural products.  The facility offers 3.2 million cubic feet of total storage that enables the facility to meet seasonal demands and production overflows.\n\nThe industrial refrigeration system that services the cold storage rooms utilizes anhydrous ammonia as the refrigerant.  An estimated maximum of 38,800 pounds of ammonia is used between two compressor rooms.\n\nThe accidental release prevention program starts with good operating and manufacturing practices.  All ammonia process equipment, piping, and valves are inspected and maintained on a regular schedule in accordance with manufacturer and industry recommendations.\n\nRefrigeration process equipment at the facility operates continuously based on operational + temperature demands.  The compressors and condensers cycle on and off to address system heat load demands during operation.  Two machinery rooms house the compressors, receivers, and accumulator vessels, and auxiliary components, while the condensers are located outside.  The evaporators and bunker coils that service the cold storage rooms are located throughout the facility at / near each room.\n\nAmmonia is used as the primary refrigerant, which means it is used as a vehicle to move heat from product in the cold storage zones to the outside atmosphere.  When heat is"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000107762,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nLomo Cold Storage recognizes the facility\u0092s responsibility in protecting the public, its employees, the environment, equipment, and property.  Lomo Cold Storage is strongly committed to employee, public and environmental safety.  This commitment is reflected in a comprehensive accidental release prevention program that addresses the design, installation, operation, maintenance, and employee training associated with the ammonia refrigeration system at the Lomo Cold Storage facility in Live Oak, California.\n\nIt is Lomo Cold Storage\u0092s policy to ensure that controls are in place to limit the risks of potential ammonia releases.  To accomplish the company\u0092s goal in controlling accidental losses, the facility has established safety programs that enable facility personnel to: maximize safety performance, reduce risks of handling ammonia and other potentially hazardous substances, and prepare facility personnel to address emergency situations as they might arise.\n\nLomo Cold Storage draws from several sources and decades of experience + expertise to ensure that the appropriate mitigation measures have been identified and are implemented.  Internal facility personnel with decades of experience, the resources of a professional refrigeration contractor, in addition to external risk management consultants all provide guidance to limit the risks of handling ammonia.  The commitment to safety shows in the minimal accident history at the facility.\n\nOne of the activities associated with the facility\u0092s safety program has been the development and implementation of accidental release prevention and emergency response programs which are designed to comply with Cal-OSHA\u0092s Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, CCR Title 8 5189), EPA\u0092s Risk Management Program (RM program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68),"
    }
  ]
}