{
  "FacilityID": 1000051027,
  "FacilityName": "Hunter Panels LLC",
  "FacilityStr1": "388 Southeast Enterprise Court",
  "FacilityStr2": null,
  "FacilityCity": "Lake City",
  "FacilityState": "FL",
  "FacilityZipCode": "32025",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12023",
  "LEPC": "District 3 LEPC",
  "FacilityLatDecDegs": "30.173000",
  "FacilityLongDecDegs": "-082.589400",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.hpanels.com",
  "FacilityEmailAddress": "Michael.Varga@CarlisleSynTec.com",
  "FacilityDUNS": 961921806,
  "ParentCompanyName": "Carlisle Construction Materials Inc.",
  "Company2Name": null,
  "CompanyDUNS": 961921806,
  "Company2DUNS": 961921806,
  "OperatorName": "Hunter Panels",
  "OperatorStr1": "388 Southeast Enterprise Court",
  "OperatorStr2": null,
  "OperatorCity": "Lake City",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32025",
  "OperatorZipCodeExt": null,
  "FTE": 75,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186041",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-04-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-09-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-09-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-09-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-09-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.171625,
  "FRS_Long": -82.58884,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "8",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064429,
      "AltID": "Pentane Process",
      "FacilityID": 1000051027,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000079749,
          "ProcessID": 1000064429,
          "ChemicalID": 125,
          "Quantity": 131500.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000079750,
          "ProcessID": 1000064429,
          "ChemicalID": 115,
          "Quantity": 130250.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000065531,
          "ProcessID": 1000064429,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000051027,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lake City Fire Department",
    "CoordinatingAgencyPhone": "3867523312",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000051027,
      "SummaryText": "Hunter Panels located at 388 Southeast Enterprise Ct., Lake City, Florida manufacturers rigid polyisocyanurate foam insulating panels for use in commercial and industrial roofing applications.  The company employs approximately 75 people at the facility.  Hunter Panels occupies a 200,500 square foot facility in Columbia County, Florida.  Facility boundaries include railroad tracks and Route 100 to the North, wooded land to the South, Columbia County Industrial Park to the East, and residential areas to the West.  The Lake City Airport Industrial Park is located on the north side of Route 100.\r\n\r\nThe polyisocyanurate foam insulating panels are produced by reacting a polyol (POLY) in a blend including a flame retardant and catalyst with polymeric diphenylmethane diisocyanate (ISO).  Pentane material is used as an expanding or blowing agent in the production of the panels.  Different varieties of pentane material can be used including various blends of n-pentane, isopentane, and cyclopentane.  Isopentane and n-pentane are regulated under the Risk Management Program (RMP) Rule with a 10,000 pound threshold.  Cyclopentane is not regulated under the RMP Rule.  Hunter Panels is also subject to the OSHA Process Safety Management (PSM) Standard in 29 CFR 1910.119 for all three isomers of pentane and maintains one plan to meet both the RMP and PSM requirements.\r\n\r\nThe facility receives a liquid pentane blend via tank truck and stores it in a 25,000-gallon aboveground pressure vessel for use in the production process.  This volume equates to a pentane material storage capacity of 130,250 to 155,332 pounds depending upon which pentane blend is used.  Throughout the RMP and Process Safety Management (PSM) documentation at the facility the combination of various isomers of pentane is simply referred to as pentane.  No distinction is made to exclude a possible cyclopentane portion of the blend from the RMP component of the regulations.  For purposes of the Risk Management Plan sub"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000051027,
      "SummaryText": "mittal a maximum of 131,500 pounds of n-pentane and 130,250 pounds of isopentane are addressed.  Cyclopentane which is not regulated under the RMP regulation would have a maximum quantity of 155,332 pounds.  There is only one 25,000 gallon storage vessel on site.  It holds between 130,250 and 155,332 pounds of pentane depending on which isomer is being used as indicated above.  As an example, if the current blend is essentially n-pentane and 131,500 pounds of n-pentane are on-site, virtually no isopentane or cyclopentane would be on site at the same time.\r\n\r\nThe process with respect to PSM and RMP regulations starts with the unloading of pentane into the storage tank and continues through the point where cured panels are cut to size.  Process steps include transfer of pentane to a metering skid, injection of pentane at high pressure into a polyol blend, and reaction of the polyol with ISO, using pentane as the expanding agent, to form foam on top of a substrate.  The chemical mixture and substrate are drawn into the laminator, where the mixture adheres to the substrate and a top-sheet as the solid foam is formed.   At the crosscut saw station, the sheet is cut into long panels and the edges are trimmed to a precise 4-foot width.  The long panels then move to a gang saw station where additional crosscutting reduces the panels to the desired lengths, typically 4 or 8 feet.  At this point of the process, production of the foam panels using the pentane blowing agent is complete representing the end of the process that is covered under the PSM and RMP regulations.\r\n\r\nHunter Panels maintains a detailed emergency action plan in accordance with 29 CFR 1910.38.  The Plant Manager serves as facility coordinator for implementation of the emergency action plan. Employees are trained to respond to incidental releases at the facility.  Hunter Panels maintains a relationship with an off-site emergency responder for large scale environmental emergencies.  The plan is coordinated wi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000051027,
      "SummaryText": "th local emergency responders.\r\n\r\nThe facility is a Program 1 facility.\r\n\r\nHunter Panels has taken precautions to ensure that the potential for an incident involving pentane is minimal.  Prevention measures include a comprehensive preventive maintenance program, detailed unloading procedures, daily inspections, extensive operator training, and pre-startup inspections for the pentane process.  The RMP program includes the following additional sections that are in practice at the facility.\r\n\r\n¿\tManagement System\r\n¿\tEmployee Participation\r\n¿\tProcess Safety Information\r\n¿\tProcess Hazard Analysis\r\n¿\tOperating Procedures\r\n¿\tTraining\r\n¿\tContractors\r\n¿\tPre-startup Safety Review\r\n¿\tMechanical Integrity\r\n¿\tHot Work Permit\r\n¿\tManagement of Change\r\n¿\tIncident Investigation\r\n¿\tCompliance Audits\r\n\r\nThere have been no releases having off site consequences or catastrophic events involving the pentane at the facility."
    }
  ]
}