{
  "FacilityID": 1000011663,
  "FacilityName": "Vindex Loadout - Buffalo Refuse Site",
  "FacilityStr1": "West Virginia State Route 93",
  "FacilityStr2": null,
  "FacilityCity": "Mount Storm",
  "FacilityState": "WV",
  "FacilityZipCode": "26739",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54093",
  "LEPC": "Tucker County LEPC",
  "FacilityLatDecDegs": "39.216389",
  "FacilityLongDecDegs": "-079.320556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.intlcoal.com",
  "FacilityEmailAddress": "contacticg@intlcoal.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Vindex Energy Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Vindex Energy Corporation",
  "OperatorStr1": "2708 Cranberry Square",
  "OperatorStr2": null,
  "OperatorCity": "Morgantown",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26508",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000157741",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-07-15 00:00:00",
  "SafetyInspectionBy": "MSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-01-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-01-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-01-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-12-08 00:00:00",
  "DeRegistrationEffectiveDate": "2014-11-14 00:00:00",
  "AnniversaryDate": "2015-01-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.216495,
  "FRS_Long": -79.320322,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "11",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014008,
      "AltID": "Anhydrous Ammonia Tank",
      "FacilityID": 1000011663,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016113,
          "ProcessID": 1000014008,
          "ChemicalID": 56,
          "Quantity": 34000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000014369,
          "ProcessID": 1000014008,
          "NAICSCode": "21211",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000010110,
              "Process_NAICS_ID": 1000014369,
              "SafetyReviewDate": "2009-09-02 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "IIAR Bulletin 110",
              "FR_Comments": null,
              "HazardReviewDate": "2008-10-01 00:00:00",
              "ChangeCompletionDate": "2008-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Massive flow valves",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Visual inspections",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "New gates and nuried process lines",
              "OpProceduresReviewDate": "2009-09-02 00:00:00",
              "TrainingReviewDate": "2009-07-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Independent consultant trains employees",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-09-02 00:00:00",
              "EquipmentInspectionDate": "2009-09-02 00:00:00",
              "EquipmentTested": "Thickness evaluation of 8,000-gallon tank",
              "ComplianceAuditDate": "2009-09-02 00:00:00",
              "AuditCompletionDate": "2009-09-02 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2008-01-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000010396,
                  "PreventionProgram2ID": 1000010110,
                  "ProcessChemicalID": 1000016113
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011663,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-09-02 00:00:00",
    "ERTrainingDate": "2009-07-15 00:00:00",
    "CoordinatingAgencyName": "Tucker County (WV) LEPC",
    "CoordinatingAgencyPhone": "3044783248",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Mine Safety and Health Administration (MSHA)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011663,
      "SummaryText": "mination of possible equipment failures or human errors that could lead to a release of anhydrous ammonia.  The hazard review examined possible equipment failures or human errors that could lead to a reportable release of anhydrous ammonia.  The topics covered were developed after a site visit, review of records at Vindex offices and interviews with Vindex employees.\n\nPersonnel who work on equipment containing anhydrous ammonia will be trained to understand the hazards of the material, the proper selection, installation and maintenance of equipment to be used with the process.  Persons will also be trained about safety procedures to be followed when working with anhydrous ammonia and what notification procedures to perform in the event of a leak of anhydrous ammonia.\n\nVindex has developed a mechanical integrity program for its anhydrous ammonia processes.  A mechanical integrity program is a risk-based system that incorporates codes, standards, and inspection techniques to evaluate whether equipment is fit for service, not only upon installation, but for its service life.\n\nThis program applies to major components of VindexÂ¿s anhydrous ammonia storage and handling systems.  Components covered by the program include pressure vessels, storage tanks, piping systems (hoses) and components (valves, etc.), relief and vent devices, emergency shutdown systems, and controls (monitoring devices, sensors, alarms, etc.).\n\nThe written procedures established in the program will be implemented to assist in maintaining the integrity of the process equipment.  Employees are trained in the procedures to maintain the process equipment, including safety and hazard procedures relevant to conducting the maintenance tasks.\n\nThe program includes schedules for inspecting and testing the process equipment.  The testing and inspections follow generally accepted good engineering practices.  Documentation that equipment is installed properly, consistent with the design specification, will be re"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011663,
      "SummaryText": "Facility Name:  \tVindex Loadout - Buffalo Refuse Site\nEPA ID:\t     100000157741\n\nExecutive Summary\nAnhydrous Ammonia Risk Management Plan\nVindex Loadout / Former Buffalo Refuse Site\nVindex Energy Corporation\nMt. Storm, Tucker County, West Virginia\nEPA Facility ID# 100000157741\n\nFacility and Regulated Substances\n\nVindex Energy Corporation (Vindex) operates one anhydrous ammonia tank that is subject to the requirements of the Clean Air Act, Risk Management Program Rule, Title 40 of the Code of Federal Regulations (CFR), Part 68.  Vindex has prepared its Risk Management Plan (RMP) in compliance with the regulation.\n\nThere is one stationary source and process covered in this RMP.\n\nProcess 1 - 8,000-gallon capacity anhydrous ammonia above ground storage tank (AST).\n\nThe anhydrous ammonia is used to neutralize the acidity in a mine drainage run-off retention pond.  Vindex is permitted to discharge anhydrous ammonia into surface water under the terms of the National Pollutant Discharge Elimination System (NPDES) permit, number WV0060372, which was issued to the former Buffalo preparation plant and loadout facility. The emergency response, notification and reporting procedures described in the RMP are not intended to be applied to permitted releases of anhydrous ammonia.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe storage tank is equipped with passive mitigation devices. Mass flow valves are designed to prevent the rapid loss of material through piping as the result of a sudden loss of pressure. Transfer operations moving anhydrous ammonia from tanker trucks to the storage tank are monitored by trained employees.\n\nVindex performed a hazard assessment of its operations and conducted a worse-case scenario release of anhydrous ammonia that would result from the catastrophic failure of a storage tank that was filled to 85% of capacity.  For the worse-case scenario discharge, no administrative controls or mitigation measures were used to limit the anticip"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011663,
      "SummaryText": "ated discharge to calculate the toxic endpoint distances for the regulated material.\n\nVindex performed a hazard assessment of its operations and conducted an alternative release scenario of anhydrous ammonia that would most likely result from the failure of a transfer hose during the transfer of the material from a bulk tanker truck to a storage tank.  For the alternative release scenario, VindexÂ¿s passive mitigation systems, such as the mass flow valves within the tank, and active mitigation measures activated by employees monitoring the material transfer will limit the duration and amount of material released below the capacity of both the tanker truck and storage tank.  Those actions will reduce the distance to the toxic endpoint for the alternative release scenario.\n\nIf anhydrous ammonia is accidentally released into the environment at the rate of 100 pounds per 24 hours or greater, that release must be reported to the National Response Center (NRC) in Washington, D.C. and the West Virginia Department of Environmental Protection (WVDEP) - Emergency Notification Number.\n\nThe telephone number for the National Response Center is:  1-800-424-8002\n\nThe WVDEP Emergency Notification Number is:  1-800-624-3074\n\nThese calls are to be made as soon as possible, preferably with one hour from the time of release, but no later than 24 hours from the time of release.\n\nFor accidental releases of anhydrous ammonia in excess of the permitted volumes listed in the NPDES permit for the facility, the WVDEP - Emergency Notification Number must be notified. The maximum allowable concentration of un-ionized ammonia in the receiving stream shall be 50 micrograms per liter (Âµg/l) for a nontrout stream and 20&#61472;Âµg/1 for a trout stream.\n\nIn the event of an accidental spill or release of anhydrous ammonia in an amount that requires the NRC and/or WVDEP to be notified, the Vindex employee or Contractor that discovered the release should immediately notify Vindex management on the eme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011663,
      "SummaryText": "rgency contact list.  If there is no response from the first name on the list, call the next name on the list.  Continue calling until you have made contact with one of these authorized personnel.\n\nIf the situation is considered to be immediately dangerous to life and health of persons on and/or off the Vindex property, and if no Vindex representatives can be contacted, the person discovering the release should report the problem to government public safety officials.  Listed below are the emergency telephone numbers for the Grant and Tucker CountyÂ¿s Emergency Services.\n\nGrant County Sheriff\nPetersburg, West Virginia\n(304) 257-4422\n\nTucker County Sheriff\nParsons, West Virginia\n(304) 478-2321\n\nEMERGENCY CALLS WITHIN AND TO GRANT AND TUCKER COUNTY CAN ALSO BE MADE BY DIALING 911.\n\nVindex employees are trained to report any leak or spill of anhydrous ammonia to their supervisor.  Small spills or leaks that do not pose a threat to human health or the environment do not need to be reported to management immediately, but, should be reported by the end of the work day.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention\n\nVindex has polices and procedures in place, and have trained their employees in the safe handling and emergency responses necessary to prevent and/or mitigate the accidental release of anhydrous ammonia used at their facility.\n\nEquipment used in the transportation, storage and use of anhydrous ammonia conform to the appropriate federal and state regulations.  Equipment and maintenance records are kept on file.\n\nVindex uses an independent contractor to transport the anhydrous ammonia and consultants to provide additional train their employees in safety and emergency procedures.\n\nVindex has coordinated its emergency procedures with the Local Emergency Planning Committee (LEPC) and other industry in the area.\n\nVindex performed a review of the hazards for the anhydrous ammonia processes.  That exercise included a Â¿What if...Â¿ exa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011663,
      "SummaryText": "tained in VindexÂ¿s files.  The frequency of the tests and inspections will be consistent with applicable regulations, the manufacturers' recommendations and good engineering practices; or more frequently, based on operating experience.  Equipment deficiencies will be corrected before further use.\n\nFive-year Accident History\n\nThe facility has not had a reportable release of anhydrous ammonia in the past five years.\n\nEmergency Response Program\n\nVindex employees are trained as to the health, safety and environmental hazards that are present when working with anhydrous ammonia.  Employees are trained to follow the proper procedures and use the appropriate personal protective equipment (PPE) when working with anhydrous ammonia.\n\nIn the event of an accidental release of anhydrous ammonia, employees must use their best judgement to establish what response is appropriate for the situation.  First, the employee should establish whether the release is controllable or uncontrollable.  If the leak is controllable, and the employee has the proper training, tools and PPE, the release should be repaired.  An example of a controllable leak would be to close an isolation valve or adjust a packing nut.  The following procedures should be considered in order to safely respond to an uncontrolled release.\n\nVindex employees are trained to report any leak or spill of anhydrous ammonia to their supervisor.  In the event of a reportable release of anhydrous ammonia, Vindex employees have been trained to take immediate actions to mitigate the release, don personal protective equipment, evacuate to a designated area, communicate with other off-site personnel and contact local authorities through the LEPC.\n\nPlanned Changes to Improve Safety\n\nNo changes to the anhydrous ammonia processes are scheduled at the time this Risk Management Plan was submitted."
    }
  ]
}