{
  "FacilityID": 1000011600,
  "FacilityName": "Enterprise Rocklin Terminal",
  "FacilityStr1": "1545 Nichols Drive",
  "FacilityStr2": null,
  "FacilityCity": "Rocklin",
  "FacilityState": "CA",
  "FacilityZipCode": "95765",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06061",
  "LEPC": "Placer County Emergency Svcs",
  "FacilityLatDecDegs": "38.810528",
  "FacilityLongDecDegs": "-121.3160",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "ww.epco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise Products Operating L P",
  "Company2Name": null,
  "CompanyDUNS": 62457304,
  "Company2DUNS": 0,
  "OperatorName": "Enterprise Products Operating LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "RMPContact": "Alfred J. Wussler",
  "RMPTitle": "Senior Compliance Engineer - RMP",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165974",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-06-04 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-01-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-01-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-01-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-01-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.81148,
  "FRS_Long": -121.31079,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013947,
      "AltID": "Propane terminal storage",
      "FacilityID": 1000011600,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014310,
          "ProcessID": 1000013947,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016052,
          "ProcessID": 1000013947,
          "ChemicalID": 98,
          "Quantity": 5000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000516052,
          "ProcessID": 1000013947,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011600,
      "SummaryText": "Environmental Protection Agency Risk Management Plan\nCalifornia Accidental Release Prevention Program\nEnterprise Rocklin Terminal & Storage\nRMP Executive Summary\n\n\nThe Enterprise Rocklin Terminal is a liquefied petroleum gas (LPG) storage facility.  The process is regulated by Federal OSHA 29 CFR 1910.119 and Cal OSHA Process Safety Management of Acutely Hazardous Materials, Title 8 California Code of Regulations 5189 and 19 California Cod of Regulations 2735 California Accidental Release Prevention Program.  This is a RMP/CalARP Program Level 3 facility.\n\nAt the Enterprise Rocklin Terminal and Storage, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\n\nThe prevention program is based on the requirements of 19 California Code of Regulations 2735 California Accidental Release Prevention Program and includes the following:  Employee Participation, Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Contractor Evaluation, Contractor and Visitor Orientation, Pre-Job Start-Up Review, Mechanical Integrity, Code of Safe Work Practices (Hot Work Permit, Confined Space Entry, Control of Hazardous Energy), Management of Change, Incident Investigation, Emergency Planning and Response, and Compliance Audit.\n\nThe Enterprise Rocklin Terminal and Storage is owned and operated by Enterprise Products Operating LLC.\n\nWe use a combination of accidental release prevention programs and emergency response planning programs to help provide for the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, inclu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011600,
      "SummaryText": "ding:\n\n* A description of our facility and use of substances required by EPA's RMP regulation and the processes involved\n* A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n* Emergency Response Programs\n* General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n* A five-year accident history for accidental releases of chemicals at the Rocklin Terminal that are regulated by EPAA?s RMP rule.  \n\n\nFacility Description\n\nRocklin Terminal\n\nRocklin Terminal is a transport, railcar loading and unloading facility.  The facility has 3 rail towers and 2 truck racks utilized for these operations.  The product handled at this facility is Propane.  The facility has 18 propane storage tanks utilized to receive and store propane until the material is reloaded into railcars or trasnport trucks.   \n\nThe Rocklin Terminal is equipped with an Emergency Shutdown System which is designed to place the facility in a safe condition as quickly as possible in order to minimize the possibility of a catastrophic occurrence.  The Emergency Shutdown System blocks gas from entering the area by closing pneumatically operated block valves and de-energizes all compressors and pumps.\n\nSix (6) ESD Red Pushbutton stations are located at the following locations;\n\n1.    Next to the operatorA?s desk inside the shop area\n2.    At the rear entrance gate next to the operation control panel\n3.    At CompressorsA? 1 & 2 manifolds\n4.    At CompressorsA? 3 & 4 manifolds\n5.    Inside The Front Main gate on the electrical panel box\n6.    On Rack #1 (Front Rack) wall between vessels 3 & 4.\n\nDeluge System\n\nThe Rocklin Terminal is also protected by a water deluge system which is designed to protect each bank of vessels by providing a water spray blanket for each individual bank of vessel. The deluge systemA?s water is supplied by the Municipal Water System. \nThe deluge system can be activated either automatically or manually. Automatic activation o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011600,
      "SummaryText": "ccurs when the protectowire system is exposed to fire/flame. To activate the deluge system manually for a designated bank of vessels, manually pull one of the three fire alarm handles or open one of the three deluge system hand valves located at the following locations;\n1)    The front of vessel 6 for vessels 1 thru 6\n2)    The front of vessel 12 for vessels 7 thru 12\n3)    The front of vessel 18 for vessels 13 thru 18\nIndividual Rail Tower ESD's are located at the base of each rail tower and will shutdown each respective rail car loading/unloading operation, (3) total.  A Main Rail Tower ESD station is located at the rear entrance gate next to the operation control panel and when activated will shutdown all rail tower operations.\n\nAll of the previously mentioned tanks are administratively controlled to hold and not exceed 85% of their capacity.\n\nIn our process we use the following chemicals/flammables that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\n\nToxics\n\nNo toxic materials to report.\n\nFlammables\n\nPropane is the product handled at the Enterprise Rocklin Terminal and Storage which is the only flammable substance that is maintained in a quantity above the EPAA?s threshold quantities listed in 40 CFR 68.115.  At this facility there are three banks of tanks, six tanks per bank.  The facility handles odorized propane and does not store or maintain a separate supply of natural gas odorant on site.  Details on the quantity of flammables potentially held at the Rocklin Terminal facility are given in the RMP registration data elements. \n\n\nKey Offsite Consequence Analysis Scenarios\n\nThe EPA's RMP rule requires that we provide information about the worst-case scenarios(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011600,
      "SummaryText": "ces for each scenario.\n\nWorst Case Release Scenario : Regulated Toxic Chemical\n\nAt the present time there are no regulated toxic chemicals to report for the Rocklin Terminal.\n\nAlternate Release Scenario(s) : Regulated Toxic Chemical\n\nAt the present time there are no regulated toxic chemicals to report for the Rocklin Terminal.\n\nWorse Case Scenario : Regulated Flammable Chemicals\n\nThis simulation involves the failure of the front bank of propane storage tanks resulting in a simulated vapor cloud explosion.  The macimum inventories of all six tanks was used due to the fact that all of the valves on these individual banks are normally open and tied into a single header to facilitate product and vapor recovery return flows that result from the terminal operations.  This scenario assumes there would be no mitigation.  All emergency response and early warning procedures to inform employees and the public would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation and the specifics of the simulation are available in the specified reporting data elements of the Risk Management Plan registration.\n \nAlternate Case Scenario : Regulated Flammable Chemicals\n\nThe alternate release scenario is a simulated rupture of the supply pipe to the loading docks resulting in a ten minute release and simulated vapor cloud explosion.  Mitigation measures were taken into account when selecting the alternative release scenario.  These measures consisted of reviewing the use of emergency shutdown valves, pull-away shutdown system, and location operator attendance during product transfers.  Activation of the Emergency Shutdown Devices would isolate the source of the material and secure the facility within the time frame selected.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  Further details on the estimated amount of product release and the estimated alternate"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011600,
      "SummaryText": " case impact distance are included in the registration data elements. \n\n\nEmergency Response Program\n\nEnterprise maintains an emergency response plan in compliance with local emergency response agencies.  The Enterprise Rocklin Terminal has a Hazardous Material Business Plan that is accessible to the fire department in a box at the entrance of the facility.  Another copy of the Plan has been filed with the Placer County Environmental Health Department.  The emergency response program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\nIn the event of an accidental release, the facility operators are trained to shut off the source of fuel from a safe location or activate one of the shutdown devices, contact 9-1-1, evacuate personnel and secure the area.\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nEnterprise takes a systematic, proactive approach to preventing accidental release of hazardous chemicals.  Our Process Safety Management systems address each of the key features of a successful prevention program, including:\n\n* Process safety information\n* Process hazard analysis\n* Operating procedures\n* Training\n* Mechanical integrity\n* Management of change\n* Pre-Startup Safety Review - \"PSSR\"\n* Compliance audits\n* Incident investigation\n* Employee participation\n* Hot work permit\n* Contractors\n\nThere is an on-going inspection program designed to search out and find deficiencies with the process equipment prior to any incident.\n\nOperations personnel make regular inspections of the equipment and processes they operate.  If something out of the ordinary is found, it is reported to management in order to expediently resolve any problems.\n\nThe engineering and administrative controls in place have been established to reduce the risk of an accidental release of identified hazards.  Enterprise is committed to operations that are safe for employees a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000011600,
      "SummaryText": "nd the surrounding community.\n\n\nAccident History\n\nRecords are kept for all significant accidental releases that occur at our facility.  \nBased on the criteria set forth in 40 CFR 68.10, this facility has not had an accidental release in the last five years.\n\n\nPlanned Changes to Improve Safety\n\nRockling Terminal resolves all findings and recommendations from PHA's and incident investigations as quickly as possible to improve the safety of the facility based upon specific recommendations.  The following is a list of improvements that are planned for implementation at the facility to help prevent and/or better respond to accidental chemical releases:\n\n* The Enterprise safety management / accident prevention (PSM) program is currently undergoing a complete review and updating to insure that the program correctly reflects the safety management practices being used at Enterprise facilities.\n\n\n\n\n"
    }
  ]
}