{
  "FacilityID": 1000032981,
  "FacilityName": "Peters Farms Inc.",
  "FacilityStr1": "41018 Road 56",
  "FacilityStr2": null,
  "FacilityCity": "Reedley",
  "FacilityState": "CA",
  "FacilityZipCode": "93654",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.535639",
  "FacilityLongDecDegs": "-119.447167",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ed Peters",
  "OperatorStr1": "41018 Road 56",
  "OperatorStr2": null,
  "OperatorCity": "Reedley",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93654",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dustin Pauls",
  "RMPTitle": "Manager",
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000220879",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-12-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-12-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-02-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-02-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-02-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040264,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000032981,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000040666,
          "ProcessID": 1000040264,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048410,
          "ProcessID": 1000040264,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000548410,
          "ProcessID": 1000040264,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000032981,
      "SummaryText": "1    EXECUTIVE SUMMARY\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n?    California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n?    Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n?    California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n?    Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Peters Farms has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1    PETERS FARMS, RISK & PROCESS SAFETY MANAGEMENT PROGRAM\n\n \n\nThis is to inform all interested persons, including employees, that Peters Farms has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following process which have the presence of hazardous chemicals above threshold quantities:\n\n \n\nProcess Name     Process Chemical    Process Quantity(lbs.)\n\nAmmonia            Ammonia                    19,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, and illnesses and avoid physical property damage.\n\n\n\nPeters Farms has an exemplary safety record, one that we are quite proud of. Our company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1.    Prepared a unified program based on the PSM plan t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000032981,
      "SummaryText": "o meet CalARP and RMP obligations as well\n\n2.    Organized the program so that it meshes closely with general Peters Farms business practices\n\n3.    Utilized PSMWriter software to ensure that all necessary Peters Farms employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures and practices that will help our employees protect themselves and our neighbors.\n\n\n\n1.2    PROCESS DESCRIPTION\n\n\n\nThe Peters Farms facility is a commercial cold storage facility for deciduous tree fruit and citrus. The facility has an ammonia system that provides refrigeration capacity to six (6) cold storage rooms, three (3) precool rooms, a hallway, and various pieces of processing equipment. The rooms use a combination of \"bunker style\" coils and ceiling suspended evaporator coils that contain chilled liquid ammonia. The processing equipment includes a hydrocooler and a plate-and-frame glycol chiller. A computer system provides substantial control and alarm capability. \n\n\n\nMost of the facility is a pumped liquid recirculator system where high pressure liquid from the high pressure receivers is piped to a liquid recirculator through a liquid feed solenoid valve and an expansion valve. From there, low pressure liquid is pumped to each cold room, where it passes through a solenoid valve, hand expansion valve and into evaporator coils. Low temperature liquid circulates through the evaporator coils. Low pressure and temperature gas and overfeed liquid passes through regulators or check valves and is returned to the liquid recirculator. The residual liquid is separated from the gas in the accumulator and the suction gas is piped to three reciprocating and one screw compressor which elevate the temperature and pressure of the gas.  The high pressure discharge from the compressors is sent to a water cooled evaporative condenser where the high pressure ammonia gas is liquefied and returned to the high pressure receiver. Some of the high pressu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000032981,
      "SummaryText": "re liquid from the receivers is injected into the oil cooler on the screw compressor. Excess liquid from the liquid recirculator is pumped to a transfer vessel where the liquid transfers into the high pressure receiver by gravity. The system uses hot ammonia gas to defrost the coils.  A portion of the high pressure discharge from the compressors is piped to each cold room, where it passes through a solenoid valve and into the coil. There are two high pressure receivers, however, they are piped together so that they act in concert.  \n\n\n\nThere are four hydrocooler coils located in the hydrocooler room.  High pressure liquid from the high pressure receivers is piped to a series of a liquid feed solenoid valves. From there, high pressure liquid is piped to the hydrocooler room, where it passes through an expansion valve into one of two low pressure accumulator vessels mounted above the hydrocooler coils.  Low temperature liquid circulates by thermal convection through the hydrocooler coils.  Low pressure and temperature gas collects in the accumulator vessel, and passes through a pressure regulator into a suction line. The suction line returns the gas to the compressors in the engine room.\n\n\n\nThe Peters Farms facility was originally built more than 25 years ago and since that time the following projects have occurred:\n\n\n\n? 2012-2013 - California Controlled Atmosphere installed the refrigeration equipment and controls for three (3) precool rooms, one (1) storage room, one (1) hallway, and a controlled pressure receiver.\n\n\n\nThe facility was designed and installed by professional refrigeration engineers in accordance with industry standards at the time. It was also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction. The system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000032981,
      "SummaryText": " ammonia gas to a water diffusion system if the pressure in the system exceeds their set point. In addition, ammonia detectors are located throughout the facility, and will shut down equipment if ammonia is detected. Lastly, an emergency \"dump box\" contains switches and valves to turn off equipment and vent ammonia if necessary.\n\n\n\nThe ammonia system at the Peters Farms facility consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels that are not directly connected. Therefore, the system is treated as a single process.\n\n\n\n1.3    GENERAL ACCIDENT RELEASE & CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\n1.3.1    GENERAL \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nPeters Farms has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in the body of the program. \n\n\n\n1.3.2    ANHYDROUS AMMONIA\n\n\n\nThe ammonia refrigeration process at the Peters Farms facility is an integral part of the overall business and operates most of the year. It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep an active log book of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. These contractors also assist in performing the annual mechanical i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000032981,
      "SummaryText": "ntegrity inspection of our ammonia equipment. \n\n\n\n1.4    FIVE YEAR ACCIDENT HISTORY\n\n\n\nPeters Farms has had no accidental release within the last five (5) years.\n\n\n\n1.5    EMERGENCY ACTION AND RESPONSE PLAN\n\n\n\nPeters Farms' emergency action and response program has been developed to satisfy the following requirements:\n\n?    California \"Emergency Action Plan\" - Title 8 CCR ?3220\n\n?    Federal \"Emergency Action Plan\" - Title 29 CFR ?1910.38 \n\n?    California \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) - Title 8 CCR Title 8 ?5192(q)\n\n?    Federal \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) - Title 29 CFR ?1910.120(q)\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\n\n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6    PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nOur company has an outstanding safety record, one that we are quite proud of. Many policies and procedures have been implemented to promote overall plant, worker and public safety. Nevertheless, Peters Farms continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Peters Farms' ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Peters Farms' management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nPeters Farms has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered in"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000032981,
      "SummaryText": "to PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Peters Farms has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation. A copy of Resource Compliance's service agreement has been included in this program with the support material.\n\n\n\nFor the future, Peters Farms now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Peters Farms employees, but allows for feedback and continual improvement. Through the RMP-PSM program Peters Farms will continue to maintain overall plant worker and public safety. \n\n"
    }
  ]
}