{
  "FacilityID": 1000096604,
  "FacilityName": "Kirschenman Packing Edison Facility",
  "FacilityStr1": "12826 Edison Hwy",
  "FacilityStr2": null,
  "FacilityCity": "Edison",
  "FacilityState": "CA",
  "FacilityZipCode": "93220",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": null,
  "FacilityLatDecDegs": "35.345756",
  "FacilityLongDecDegs": "-118.862524",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Kirschenman Enterprises, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Kirschenman Enterprises, Inc.",
  "OperatorStr1": "P.O. Box 27",
  "OperatorStr2": null,
  "OperatorCity": "Edison",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93220",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177499",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-04-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-03-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-10-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-10-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-10-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 35.345756,
  "FRS_Long": -118.862524,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119795,
      "AltID": "Water Chlorination",
      "FacilityID": 1000096604,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000150037,
          "ProcessID": 1000119795,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000121167,
          "ProcessID": 1000119795,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000102744,
              "Process_NAICS_ID": 1000121167,
              "SafetyReviewDate": "2021-08-19 00:00:00",
              "PHA_Date": "2021-09-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-09-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Hand held meters",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-05-27 00:00:00",
              "TrainingReviewDate": "2021-09-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-09-12 00:00:00",
              "EquipmentInspectionDate": "2021-10-04 00:00:00",
              "EquipmentTested": "Daily System Inspection",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2021-09-12 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2021-02-11 00:00:00",
              "AuditCompletionDate": "2022-02-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-09-12 00:00:00",
              "HotWorkPermitReviewDate": "2021-09-12 00:00:00",
              "ContractorSafetyReviewDate": "2021-03-10 00:00:00",
              "ContractorSafetyEvalDate": "2021-09-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000129102,
                  "PreventionProgram3ID": 1000102744,
                  "ProcessChemicalID": 1000150037
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000096604,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kern County Environmental Health",
    "CoordinatingAgencyPhone": "6615499927",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000096604,
      "SummaryText": "Improve Safety\r\n\r\nKirschenman Enterprises - Edison has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Kirschenman Enterprises - Edison continually strives to improve in all areas, including safety.\r\n\r\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Kirschenman Enterprises - Edison's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Kirschenman Enterprises - Edison's management team can ensure that the RMP-PSM program is being implemented.\r\n\r\nKirschenman Enterprises - Edison has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\r\n\r\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Kirschenman Enterprises - Edison has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\r\n\r\nFor the future, Kirschenman Enterprises - Edison now thinks of the RMP-PSM program as a living document. It is an interactive framework that guides safe action for Kirschenman Enterprises - Edison employees, but allows for feedback and continual improvement. Through the RMP-PSM program Kirschenman Enterprises - Edison will continue to maintain overall plant worker and public safety."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000096604,
      "SummaryText": "n, the process is checked frequently during the operational season by our outside water treatment contractor. This contractor also assists in performing the annual mechanical integrity review of our chlorine equipment. \r\n\r\n1.4 Five Year Accident History\r\n\r\nKirschenman Enterprises - Edison has had no accidental release within the last five (5) years.\r\n\r\n1.5 Emergency Action and Response Plan\r\n\r\nKirschenman Enterprises - Edison's emergency action and response program has been developed to satisfy the following requirements:\r\n- Cal/OSHA's Emergency Action Plan - Title 8 CCR §3220\r\n- U.S. Occupational Safety and Health Administration's (OSHA) Emergency Action Plans - Title 29 CFR §1910.38\r\n- Cal/OSHA's Process Safety Management [Emergency Response Program Requirements] - Title 8 CCR §5189(n)\r\n- U.S. Occupational Safety and Health Administration's (OSHA) Process Safety Management [Emergency Planning and Response Requirements]- Title 29 CFR §1910.119(n)\r\n- California Accidental Release Prevention (CalARP) Program [Emergency Response Program Requirements] - Title 19 CCR, Division 2, Chapter 4.5 §2765.1-2765.2\r\n- USEPA Risk Management Program [Emergency Response Program Requirements] - Title 40 CFR §68.95\r\n- California Hazardous Materials Business Plan (HMBP) [Emergency Response Plans and Procedures] - Title 19 CCR, Division 2, Chapter 4 §2731\r\n- California Hazardous Waste Operations and Emergency Response (HAZWOPER) - Title 8 CCR Title 8 §5192(q)\r\n- Federal Hazardous Waste Operations and Emergency Response (HAZWOPER) - Title 29 CFR §1910.120(q)\r\n\r\nStrategically, we will respond minimally to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \r\n\r\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\r\n\r\n1.6 Planned Changes to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000096604,
      "SummaryText": "usible plugs function is to relieve excessive container pressure in the event of gross overheating of the container, such as in a structure fire. Their melting temperature is approximately 165°F.\r\n\r\nChlorine Detectors\r\nKirschenman Enterprises Edison uses handheld chlorine detectors when working on or around the chlorine system. These devices detect the presence of chlorine, and signal an alarm when the level of chlorine rises above a certain level.\r\n\r\nThe chlorine process at Kirschenman Enterprises Edison consists of vessels which are interconnected, or which are co-located such that a release of chlorine could impact the ability to operate vessels that are not directly connected. As such, the chlorine process at Kirschenman Enterprises Edison is treated as a single process.\r\n\r\n1.3 General Accident Release & Chemical Specific Prevention Steps\r\n\r\n1.3.1 General \r\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\r\n\r\nKirschenman Enterprises - Edison has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for each process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \r\n \r\n1.3.3 Chlorine\r\n\r\nThe chlorination process at the Kirschenman Enterprises - Edison facility is an integral part of the overall business and operates for only a few months out of the year. The chlorination process utilizes one [QUANTITY (lbs.)] cylinder, with another cylinder stored next to it as a backup. As with the ammonia process management is committed to making sure that employees are made aware of the potential danger of a chlorine leak. \r\n\r\nKirschenman Enterprises - Edison personnel monitor the chlorination process. In additio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000096604,
      "SummaryText": "Chlorine\r\n\r\nAt Kirschenman Enterprises Edison chlorine gas (Cl2) is used to sanitize process water for washing potatoes. The chlorine, when added to water, yields both chloric (HCl) and hypochlorous (HOCl) acid (see chemical equation below) in aqueous solution.  This combination is effective in killing bacteria, viruses, pathogens and other micro-organisms. Note that the equation below is easily reversible which results in off-gassing of chlorine gas from water that contains high concentrations of the acids.\r\n\r\nCl2 + H2O &#8594; HOCl + HCl\r\n\r\nThe chlorination process begins with the chlorine gas being drawn from the one-ton container by vacuum and injected into the water stream to be treated. After the water is injected with chlorine it is termed chlorinated water. Chlorine levels in the chlorinated water depend on which point in the process that readings are taken but can reach levels as high as 1,000 ppm. In the Tube and Flume the normal chlorine levels should range from 100ppm to 300ppm. In the Pit normal chlorine levels should range from 100ppm to 300ppm. The chlorinated water is also very acidic, with pH levels in the range of 2 to 3.\r\n\r\nThe highly acidic chlorinated water is then piped to a Buffer Tank in order to raise the pH level to a more neutral state of 6.5 to 7 before being sent to the potato wash area. The 500gal Buffer Tank contains a large amount of calcium carbonate (CaCO3) which acts as the neutralizing agent (buffer) for the chlorinated water. The water coming out of the buffer tank is termed buffered chlorinated water.\r\n\r\n1.2.5 Safety Systems\r\n\r\nChlorine\r\n\r\nVacuum Regulator\r\nSeveral safety features are built into the vacuum regulators used in the chlorination process at Kirschenman Enterprises Edison. The regulator acts as a safety shut-off valve in the event that the vacuum is broken. A pressure relief valve has also been incorporated into the vacuum regulator to prevent pressure from building up in the system.\r\n\r\nFusible Plugs\r\nThe f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096604,
      "SummaryText": "regulation to meet CalARP and RMP obligations as well\r\n2. Organized the program so that it meshes closely with general business practices\r\nUtilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\r\n3. The RMP-PSM program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\r\n\r\n1.2 Process Descriptions\r\n1.2.1 Facility Overview\r\n\r\nThe facility also has one (1) chlorine system which supplies chlorine to the water used in the following areas of the facility:\r\nPotato Wash Pit\r\n\r\n1.2.2 Facility Location\r\nKirschenman Enterprises Edison is located at 12836 Edison Highway, Edison, CA 93220. The latitude and longitude of the high pressure receivers is 35.345752, -118.862513. The facility is located approximately 960 feet north of state highway 58 in an industrial area surrounded primarily by agriculture land.\r\n\r\nAccording to FEMA Flood Map Service, the facility is located in an area of minimal flood hazard.\r\n\r\nKirschenman Enterprises Edison is located within the Edison Alquist-Priolo Fault Zone as defined by the California Department of Conservation. In addition, a review of United States Geological Survey (USGS) fault maps revealed the following faults within close proximity:\r\nUnnamed Ground Breaks of 1952 Earthquake - <150 Years\r\nUnnamed Faults East of Oildale - <1,600,000 Years\r\n\r\nThe USGS 2018 One-Year Model revealed that Kirschenman Enterprises Edison has a 2-5% chance of experiencing potentially minor-damage due to ground shaking in 2018.\r\n\r\n1.2.3 Description of Covered Processes\r\n\r\nChlorine\r\nThe chlorine process consists of two (2) chlorine ton containers which are located in the chlorine storage area on the east side of the property. Other system components are located adjacent to the ton containers, or in the potato wash process area and consist of the following:\r\n(1) Water pump\r\n(1) Chlorinator\r\n(1) Buffer tank \r\n\r\n1.2.4 Process Chemistry"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096604,
      "SummaryText": "This program is intended to meet the spirit and intent of the following regulations:\r\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\r\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR §68\r\n- California Process Safety Management (PSM) Program, Title 8 CCR §5189\r\n- Federal Process Safety Management (PSM) Program, Title 29 CFR §1910.119\r\n\r\nHereafter this program will be referred to as the RMP-PSM program.\r\n\r\nThis program is intended to be a living document. As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Kirschenman Enterprises - Edison has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \r\n\r\n1.1 Kirschenman Enterprises - Edison, Risk and Process Safety Management Program\r\n\r\nThis is to inform all interested persons, including employees, that Kirschenman Enterprises - Edison has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following processes which have the presence of hazardous chemicals above threshold quantities: \r\n\r\nProcess Name               | Process Chemical             | Process Quantity(lbs.)\r\nChlorine Process             Chlorine                       6,000\r\n\r\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\r\n\r\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \r\n1. Prepared a unified program based on the PSM"
    }
  ]
}