{
  "FacilityID": 1000079836,
  "FacilityName": "RLS Logistics Pittston Division",
  "FacilityStr1": "1075 Oak Street",
  "FacilityStr2": null,
  "FacilityCity": "Pittston",
  "FacilityState": "PA",
  "FacilityZipCode": "18640",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42079",
  "LEPC": "Luzerne County LEPC",
  "FacilityLatDecDegs": "41.307222",
  "FacilityLongDecDegs": "-075.771944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.rlslogistics.com",
  "FacilityEmailAddress": "info@rlslogistics.com",
  "FacilityDUNS": 828720354,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Shane Morgan",
  "OperatorStr1": "1075 Oak Street",
  "OperatorStr2": null,
  "OperatorCity": "Pittston",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18640",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000021932",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-03-29 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.30786,
  "FRS_Long": -75.77055,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099631,
      "AltID": "Refrigeration",
      "FacilityID": 1000079836,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124841,
          "ProcessID": 1000099631,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000100864,
          "ProcessID": 1000099631,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084310,
              "Process_NAICS_ID": 1000100864,
              "SafetyReviewDate": "2013-08-30 00:00:00",
              "PHA_Date": "2014-05-06 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-02-27 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-05-06 00:00:00",
              "TrainingReviewDate": "2018-07-13 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": "Open Group Discussion",
              "MaintenanceReviewDate": "2014-05-06 00:00:00",
              "EquipmentInspectionDate": "2019-05-23 00:00:00",
              "EquipmentTested": "NH3 Detectors Compressors, Condensers, Piping, Valves, (entire system)",
              "ChangeMgmtDate": "1999-05-11 00:00:00",
              "ChangeMgmtReviewDate": "2004-07-06 00:00:00",
              "PreStartupReviewDate": "2004-07-06 00:00:00",
              "ComplianceAuditDate": "2019-05-21 00:00:00",
              "AuditCompletionDate": "2019-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-05-21 00:00:00",
              "HotWorkPermitReviewDate": "2019-05-21 00:00:00",
              "ContractorSafetyReviewDate": "2019-05-21 00:00:00",
              "ContractorSafetyEvalDate": "2019-05-21 00:00:00",
              "CBI_Flag": 0,
              "Description": "This process is all of the freezers refrigerated by the anhydrous ammonia",
              "_chemicals": [
                {
                  "PrimaryKey": 1000105011,
                  "PreventionProgram3ID": 1000084310,
                  "ProcessChemicalID": 1000124841
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000079836,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-02-20 00:00:00",
    "ERTrainingDate": "2019-02-20 00:00:00",
    "CoordinatingAgencyName": "Luzerne County EMA",
    "CoordinatingAgencyPhone": "5708204400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079836,
      "SummaryText": "I.        PURPOSE\n\n\n\nIn 1996, EPA established a list of extremely hazardous substances and issued regulations for the prevention and mitigation of accidental releases of those substances under section 112(r) of the Clean Air Act. Facilities covered by the regulations are required to implement a risk management program and submit a description of the program (called a risk management plan, or RMP) to EPA. RMPs must be updated at least once every five years, and most covered facilities must update their RMPs in 2004. This report provides a checklist for preparing a 5-year update. It is important that owners, operators, plant managers, and others responsible for RMP implementation review this information and maintain a familiarity with it.\n\n \n\nIf you are the owner or operator of an RMP-covered facility, EPAA?s Chemical Accident Prevention regulations at 40 CFR Part 68 require that you fully update and resubmit your RMP at least once every 5 years. If certain process changes described in 40 CFR section 68.190 occur at your facility prior to the 5-year anniversary of your RMP, you must update and resubmit your RMP before those changes are made. The 5year anniversary date is reset whenever you fully update and resubmit your RMP. \n\n\n\nThis document is intended to serve as the five year update required for the RMP.  There were no significant changes to the original plan as formerly submitted on January 21, 2005.\n\n\n\nII.        EXECUTIVE SUMMARY\n\n\n\nRLS Logistics Pittston Division is located at 1075 Oak Street in Pittston, Pennsylvania.  The facility provides commercial cold storage warehousing for industrial clientele.  The types of products stored at the facility consist of numerous perishable food products.  The products are temporarily stored and then removed from the facility by trucks and distributed as needed.  There are sixteen freezers.  Three are refrigerated with Freon and thirteen are refrigerated with anhydrous ammonia.\n\n\n\nThe facility covers approximately one hundred thirty t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079836,
      "SummaryText": "housand (130,000) square feet.  The three Freon chilled freezers have two compressors that circulate Freon to air units inside the freezers.  Freon is circulated through pipes that are located along the interior walls and ceilings of the freezers.  Approximately 500 pounds of Freon is stored and circulated between the two compressors.\n\n\n\nThe thirteen anhydrous ammonia freezers receive ammonia from a mechanical room located along the west side of the building.  Inside this room is an ammonia cylinder that contains approximately fifteen thousand (15,000) pounds of anhydrous ammonia.  Compressors at that location circulate ammonia to the air units within the freezers.  The mechanical room also houses controls for freezer operations.  A computerized control program networked with a security system is located within the control room.  This system is used to detect leaks and notify facility and emergency personnel in the event of a release.  The piping that transfers ammonia to the air units runs along the outside roof of the building and connects into the air units located inside the freezers.  Ammonia gas re-circulates from the air units through three condensers, which then recycle the gas back into the system.   The condensers associated with the system are located on the roof of the mechanical room.  \n\n\n\nIII.    ACCIDENTAL RELEASE AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe primary area where anhydrous ammonia spills and leaks may occur would be the mechanical room.  This is where the bulk anhydrous ammonia is stored.  Additionally, the air circulation units and associated piping are also a potential source of leaks and spills.\n\n\n\nBased on the location of the anhydrous ammonia storage (mechanical room) this is the most likely location for a large scale release of gas or liquid.  In an attempt to circumvent the development of an unsafe atmosphere during a release, a ventilation fan is located within the mechanical room.  This fan will serve to evacuate anhydrous ammonia gas ou"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079836,
      "SummaryText": "t of the mechanical room should a large scale release occur.                                                         \n\nThis ventilation system is controlled automatically by the computer control system (MYSTIC) which is serviced and updated on an as needed basis by facility personnel.  This system can also be manually operated should the automated system fail.\n\n\n\nThe piping that runs along the top of the building enters circulators through the roof.  This is the most likely location for a release with respect to the piping.  This system is continually monitored by the computer control system and will automatically shut down all or part of the system should a release occur. This automatic shutdown would not apply to a catastrophic release in the mechanical room.\n\n\n\nIn the event of a release, plant personnel are not trained or equipped to handle a release of anhydrous ammonia.  RLS Logistics Pittston Division, has contracted with a local entity (Datom Products and Services), to address any spills or leaks that may occur at the facility.  RLS Logistics Pittston Division personnel are not trained to address or mitigate spills or leaks associated with the anhydrous ammonia systems.  Should a release of anhydrous ammonia occur, RLS Logistics Pittston Division employees will be evacuated a predetermined rallying point outside the building which in part will be determined by the direction of the wind. \n\n\n\nIV.    WORST CASE SCENERIO AND ALTERNATE RELEASE SCENARIO\n\n\n\nThe worst case scenario at the RLS Logistics Pittston Division facility would be a ruptured pressure vessel or tank releasing the entire volume of anhydrous ammonia into the atmosphere.  The ALOHA mapping program indicates an area of 1.1 miles surrounding the plant would be impacted.  There are a number of safety features and back up systems to prevent this from occurring.  These systems include pressure relief valves and the MYSTIC Computer program system.  The computer system would shut down when excessive pressure begins to build up.\n\n\n\nThe alterna"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079836,
      "SummaryText": "te worst case scenario would be the failure of the pipe system.  The piping system is located on the roof of the building.  The affected area outside the plant during a seven thousand pound release is estimated to be 0.1 miles.  If a pipe failed, the pipe would be isolated by the computer system or by manually closing the valves.\n\n\n\nThe anticipated reasons for pipe failure include corrosion, or damage by mechanical means (i.e. forklift).  To prevent this from happening, a contractor inspects the entire system on a monthly basis.  Forklift guards have also been installed in areas where piping can be accidentally hit by forklift traffic.\n\n\n\nV.    EMERGENCY RESPONSE PROGRAMS\n\n\n\nIn the event of an anhydrous ammonia release, RLS Logistics Pittston Division personnel are trained to evacuate the facility.\n\n\n\nIndividuals employed by RLS Logistics Pittston Division are not trained to participate in the correction of any spills or leaks associated with anhydrous ammonia.  RLS Logistics Pittston Division, has contracted with a local entity (Datom Products and Services), to address any spills or leaks that may occur at the facility.  Datom Products and Services is a certified Pennsylvania Emergency Management Agency Hazardous Materials Team.  Datom Products will respond to any emergencies at the RLS Logistics Pittston Division facility.  Notification to the public of any danged will be addressed by the Luzerne County Emergency Management Office.\n\n\n\nAny release can be controlled remotely from any modern computer system.  This is an additional stop gap measure that can assist in shutting down facility systems from a safe location should access to the in house systems are impeded.\n\n\n\nRLS Logistics Pittston Division coordinates the emergency response plan through the Luzerne County Emergency Management Agency.  Annual drills are conducted for plant personnel to review emergency procedures.                        \n\n\n\nA drill is usually held during the summer of each year with the Luzerne County Emergenc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079836,
      "SummaryText": "y Management Agency, the Pittston Township Police Department, the Pittston Township Fire Department, Emergency Management Systems, the Pennsylvania Department of Environmental Protection and Datom Products and Services.\n\n                                                     \n\nVI.    RISK MANAGEMENT PLAN VALIDATION ERRORS\n\n\n\nThere are no data to report at this time.  Updates to the plan will be made on an occurrence basis.\n\n"
    }
  ]
}