{
  "FacilityID": 1000079723,
  "FacilityName": "ConAgra Packaged Foods, LLC - Waseca, MN",
  "FacilityStr1": "400 4th Street SW",
  "FacilityStr2": null,
  "FacilityCity": "Waseca",
  "FacilityState": "MN",
  "FacilityZipCode": "56093",
  "Facility4DigitZipExt": "0518",
  "FacilityCountyFIPS": "27161",
  "LEPC": "Waseca Fire Department",
  "FacilityLatDecDegs": "44.075660",
  "FacilityLongDecDegs": "-093.514560",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.conagrabrands.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "ConAgra Foods Packaged Foods, LLC",
  "Company2Name": "Conagra Brands, Inc.",
  "CompanyDUNS": 828688189,
  "Company2DUNS": 7258908,
  "OperatorName": "Ralph Castro",
  "OperatorStr1": "400 4th Street SW",
  "OperatorStr2": null,
  "OperatorCity": "Waceca",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56093",
  "OperatorZipCodeExt": "0518",
  "RMPContact": "Ralph Castro",
  "RMPTitle": "Plant Manager",
  "FTE": 142,
  "OtherEPAFacilityID": "56093GNRLF4THS",
  "EPAFacilityID": "100000058046",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-25 00:00:00",
  "SafetyInspectionBy": "Insurance Inspection - GM Global",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 44.07504,
  "FRS_Long": -93.51181,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099491,
      "AltID": "ammonia refrigeration",
      "FacilityID": 1000079723,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100728,
          "ProcessID": 1000099491,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124680,
          "ProcessID": 1000099491,
          "ChemicalID": 56,
          "Quantity": 76500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624680,
          "ProcessID": 1000099491,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079723,
      "SummaryText": "ConAgra Foods Packaged Foods, LLC - Waseca, Minnesota (aka Birds Eye Foods, LLC)\n\n400 4th Street SW\n\nWaseca, Minnesota 56093\n\nEPA Facility ID #:  1000 0002 9266\n\n\n\nRisk Management Plan Executive Summary - Ammonia Refrigeration System \n\nMain Engine Room =          71,500 lbs.\n\nWarehouse 3 Engine Room =     5,000 lbs.\n\n==========================================\n\nTotal Anhydrous Ammonia  =   76,500 lbs.\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe ConAgra Foods Packaged Foods, LLC facility located in Waseca, Minnesota is strongly committed to employee, public, and environmental safety.  This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated ammonia refrigeration system.  It is our policy to implement appropriate controls to prevent possible releases of ammonia.  If such a release does occur, we have trained staff in emergency response and are coordinated with the Waseca Fire Department and the Waseca County LEPC for emergency response support.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\n\n\nThis facility processing plant used for food manufacturing and packaging of vegetable products (i.e., peas & corn).  The only Risk Management Program (RMP) regulated substance present is anhydrous ammonia utilized as the primary cooling media in our two (2) closed-looped ammonia refrigeration systems.  In that the engine rooms are in close proximity and managed by onsite personnel as one system (PSM Program), for the purposes of this RMP we are considering both systems as one process.  \n\n\n\nDue to the size and characteristics of our ammonia refrigeration onsite, as well as Process Safety Management (PSM) applicability (>10,000 lbs.), this facility is covered under Program 3 of the RMP regulations.\n\n \n\n3. The General Accidental Release Prevention Program and the Chemical-Spe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079723,
      "SummaryText": "cific Prevention Steps\n\n\n\nOur facility has taken all necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  Our facility is also subject to the OSHA PSM standard under 29 CFR 1910.119, as well as the EPCRA Section 302 and 311/312 notification/reporting requirements.  The following sections briefly describe the elements of the accidental release prevention program that are in place at our facility.\n\n\n\nProcess Safety Management:\n\n\n\nThe ConAgra Foods Packaged Foods, LLC Waseca facility maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the ammonia refrigeration system.\n\n\n\nProcess Hazard Analysis:\n\n\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our ammonia refrigeration system are identified and controlled efficiently.  The methodology used to carry out these analyses is What If Scenarios.  The studies are undertaken by a team of qualified personnel with expertise in refrigeration engineering and process operations, and are re-evaluated at a minimum of every five (5) years.  Any findings related to the Process Hazard Analysis (PHA) are addressed in a timely manner.\n\n\n\nOperating Procedures:\n\n\n\nFor the purpose of safely conducting activities related to our ammonia refrigeration system, ConAgra Foods Packaged Foods, LLC Waseca facility maintains written operating procedures.  These procedures address various modes of operation including startup, normal operations, emergency operations, normal shutdown, emergency shutdown, and pump out.  The information is regularly reviewed and is readily accessible to all operators who work with the ammonia refrigeration system.  Annual certification of operating procedures are documented to indicate they are current and accurate.\n\n\n\nTraining:\n\n\n\nThe ConAgra Foods Packaged Foods, LLC Waseca facility has a comprehensive training program in place to ensure"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079723,
      "SummaryText": " that authorized employees, who are working with the ammonia refrigeration system, are competent in all relevant operating procedures.  Refresher training is provided at least every three (3) years and more frequently as needed.\n\n\n\nMechanical Integrity:\n\n\n\nThe ConAgra Foods Packaged Foods, LLC Waseca facility carries out highly documented maintenance checks on the ammonia refrigeration system equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, piping systems, pressure relief valves, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in applicable maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  At least once every five (5) years a mechanical integrity inspection/review is conduct for the complete refrigeration system. \n\n\n\nManagement of Change:\n\n\n\nWritten procedures are in place at the ConAgra Foods Packaged Foods, LLC Waseca facility to manage changes in ammonia refrigeration system technology, equipment, and procedures.  Authorized employees whose job tasks are affected by an ammonia refrigeration system modification are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-Startup Reviews:\n\n\n\nPre-startup safety reviews are conducted any time the ammonia refrigeration system, or any of its components, are opened for repairs, tie-ins, or modifications.  These reviews are conducted to confirm that construction, equipment, operating procedures, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits:\n\n\n\nConAgra Foods Packaged Foods, LLC Waseca facility conducts PSM/RMP audits on a regular basis to determine whether the provisions set out under the RMP rule are being impl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079723,
      "SummaryText": "emented.  The audit of the full PSM/RMP programs will be carried out at least every three (3) years.  Any corrective actions required as a result of these audits will be undertaken in a safe and timely manner.\n\n\n\nIncident Investigation:\n\n\n\nConAgra Foods Packaged Foods, LLC Waseca facility promptly investigates any incident that has resulted in, or could have reasonably resulted in, an unintentional release of ammonia.  These investigations are undertaken within 48 hours of the incident to identify the situation leading to the event, as well as to define any corrective actions implemented to prevent the release from reoccurring.  All reports are retained for a minimum of five (5) years.\n\n\n\nEmployee Participation:\n\n\n\nConAgra Foods Packaged Foods, LLC Waseca facility truly believes that PSM and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to information related to PSM and RMP implementation, including Process Hazard Analysis (PHA) information.\n\n\n\nContractors:\n\n\n\nOn occasion, our company hires contractors to conduct specialized maintenance and/or construction activities related to the ammonia refrigeration system.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out initially & annually thereafter.  ConAgra Foods Packaged Foods, LLC Waseca facility has a policy of informing the contractors of known potential hazards related to the contractor's work with the ammonia refrigeration system.  Contractors are also informed of all the procedures for emergency response should an accidental release of ammonia occur.\n\n\n\n4. Five-Year Accident History\n\n\n\nConAgra Foods Packaged Foods, LLC Waseca facility had the following incident that triggered the fire-year accident history criteria:\n\n\n\n?    No incidents have occurred over the last 5-years that qualify as a Five"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079723,
      "SummaryText": "-Year Accident History event.\n\n\n\n5. Emergency Preparedness Plan\n\n\n\nConAgra Foods Packaged Foods, LLC Waseca facility has implemented an emergency response plan (HAZWOPER) that contains detailed procedures for:  1) pre-emergency planning and coordination; 2) personnel roles and lines of authority; 3) training; 4) communication; 5) emergency recognition and prevention; 6) safe distances and places of refuge; 7) site security and control; 8) emergency alerting and response; 9) ammonia decontamination; 10) emergency medical treatment and first aid; 11) critique of response and follow-up; 12) personal protective and emergency equipment; and 13) medical surveillance.  Designated in-house members of the emergency response team undergo initial and annual refresher training that is documented and maintained onsite.  Depending upon a given situation, the Waseca Fire Department may be called in to provide back-up assistance in case of an ammonia release, as necessary. \n\n\n\n6. Planned Changes to Improve Safety\n\n\n\nThe facility has implemented the components of the Program Level 3 RMP and associated PSM program, which has resulted in improved safety at our facility. Some of these components include ammonia refrigeration system safety training, employee training, management of change procedure, standard and emergency operation procedures, incident investigation procedures, RMP compliance audits, & etc.\n\n\n\nIf it is determined that additional safety corrections are needed, it is to be implemented in an expedited manner.\n\n"
    }
  ]
}