{
  "FacilityID": 1000082242,
  "FacilityName": "AltAir Paramount LLC",
  "FacilityStr1": "14700 Downey Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Paramount",
  "FacilityState": "CA",
  "FacilityZipCode": "90723",
  "Facility4DigitZipExt": "4526",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.899944",
  "FacilityLongDecDegs": "-118.150528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "World Energy",
  "Company2Name": null,
  "CompanyDUNS": 72784523,
  "Company2DUNS": 0,
  "OperatorName": "AltAir Paramount LLC",
  "OperatorStr1": "14700 Downey Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Paramount",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90723",
  "OperatorZipCodeExt": "4526",
  "RMPContact": "Mohsen Ahmadi",
  "RMPTitle": "Plant Manager",
  "FTE": 70,
  "OtherEPAFacilityID": "90723PRMNT1470",
  "EPAFacilityID": "100000080173",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "800183",
  "SafetyInspectionDate": "2019-07-02 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-04-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-12-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-12-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-12-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.90011,
  "FRS_Long": -118.15034,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102742,
      "AltID": "Renewable Fuels Process",
      "FacilityID": 1000082242,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000104010,
          "ProcessID": 1000102742,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128702,
          "ProcessID": 1000102742,
          "ChemicalID": 155,
          "Quantity": 850000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000112065,
              "ProcessChemicalID": 1000128702,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000112066,
              "ProcessChemicalID": 1000128702,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000112067,
              "ProcessChemicalID": 1000128702,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000112068,
              "ProcessChemicalID": 1000128702,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000112069,
              "ProcessChemicalID": 1000128702,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000128703,
          "ProcessID": 1000102742,
          "ChemicalID": 149,
          "Quantity": 27000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000628702,
          "ProcessID": 1000102742,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000628703,
          "ProcessID": 1000102742,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082242,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis summary provides an overview of AltAir Paramount's Program to comply with the U.S. EPA's Risk Management Plan (RMP) and the California Accidental Release Prevention Plan (CalARP).\n\n\n\nACCIDENTAL RELEASE PREVENTION POLICIES\n\nThe facility has a long standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the covered processes.  The plant's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\n\n\nThis commitment is demonstrated by the resources invested in accident prevention, including the design, construction, operation and maintenance of our facilities, as well as in the training or our employees. Our policy is to implement the necessary controls to prevent foreseeable releases of regulated substances. If a release does occur, we have trained personnel who will respond to control and contain the release, thereby reducing potential impact on our surrounding community.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nParamount processes tallow and vegetable oils into diesel and jet fuel and hence handles hydrocarbons formed in this process. In addition, there are other hazardous substances that are utilized in or generated by the process. The refinery has several regulated flammable substances, such as propane, butane, pentane, etc. In addition, the facility uses aqueous ammonia in its SCR. The primary use of ammonia is in the air pollution control system for the reduction of emissions of nitrogen oxides.\n\n\n\nRisk Considerations\n\nAlthough fuel manufacturing has inherent potential risks, and worst-case release scenarios can potentially reach the community; Paramount has recognized these potential risks and structured its safety programs to make the worst case type of event non-credible.  \n\n\n\nOFFSITE CONSEQUENCE ANALYSIS\n\nThis sectio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082242,
      "SummaryText": "n describes the \"worst-case release\" and \"alternative case release\" scenarios selection process for substances at the facility.\n\n\n\nA \"worst-case release\" is defined by the EPA as a release of the entire largest single-point quantity in a scenario that would create the largest offsite consequence under worst-case atmospheric conditions and a rapid release rate. The offsite consequences are determined as the distances where the released substances can reach their \"endpoints.\" For toxic substances the endpoints are defined as the concentrations that represent the maximums at which the agency believes that nearly all people could be exposed for up to one hour without serious or irreversible health effects. For flammable substances, the endpoint is defined as a one pound per square inch (1 psi) overpressure caused by an explosion of the released vapor cloud. One psi is sufficient to break windows. Since these worst-cases scenarios are based on extreme conditions, they are highly unlikely to occur. One worst-case scenarios is presented to represent the regulated flammable substances handled at the refinery.\n\n\n\nThe \"alternative-case\" scenarios are presented as, although still unlikely, more realistic scenarios that could occur under abnormal conditions. One alternative release scenario is analyzed for the regulated flammable substances handled at the refinery.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nAs part of the implementation of this RMP Program, key Prevention Program elements were implemented by Paramount to manage process safety issues associated with the covered processes.  In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.  \n\n\n\nThe Refinery PSM program elements include:\n\n-    Process Safety Information\n\n-    Process Hazard Analysis\n\n-    Operating Procedures\n\n-    Training\n\n-    Mechanical Integrity\n\n-    Management of Change\n\n-    Pre-Startup Safety Review\n\n-    Compliance Audits\n\n-    Incident Investigatio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082242,
      "SummaryText": "n\n\n-    Employee Participation\n\n-    Hot Work Permit\n\n-    Contractors\n\n-    Emergency Planning & Response\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\nThe processes at AltAir Paramount have hazards that must be managed to ensure continued safe operation. The accident prevention program summarized previously is applied to all covered processes. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human error.\n\n\n\nIn addition to the accident prevention program activities, Paramount has safety features on many units to help (1) quickly detect a release, (2) contain/control a release and (3) reduce the consequences of (mitigate) a release. The safety features used within various processes includes but not limited to:\n\n\n\nRelease Detection\n\n\n\nHydrocarbon detectors with alarms, H2S detectors with alarms, TV surveillance cameras, IR sensors\n\n\n\nRelease Containment/Control\n\nProcess relief valves that discharge to a flare to capture and incinerate episodic releases, Valves to permit isolation of the process (manual or automated), Automated shutdown systems for specific process parameters (e.g., high level, high temperature), Curbing or diking to contain liquid releases, Redundant equipment and instrumentation, Atmospheric relief devices\n\n\n\nRelease Mitigation\n\nFire suppression and extinguishing systems, Deluge system for specific equipment,Trained emergency response personnel, Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no incidents in the past 5 years with onsite or offsite consequences that meet the reporting criteria of the EPA RMP or CalARP.\n\nEMERGENCY RESPONSE PROGRAM \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nAltAir Paramount is committed to providing a safe work environment for its employees, contractors, the surrounding community and the environment. The prevention of accidents, injuries, fires, emergency releases and ot"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000082242,
      "SummaryText": "her emergency situations is of utmost importance and shall be the first priority for all persons working at the plant.\n\n\n\nThe Emergency Response Plan (ERP) will provide guidelines for a coordinated emergency management system in the refinery to respond to such situations. The ERP utilizes proven techniques of the Incident Command System.  When situations dictate, the system will utilize the combined effort from all departments, mutual aid groups and municipal agencies in order to mitigate emergency incidents in a safe, effective and timely manner. The ERP includes:\n\n-    Emergency Alarm Procedures\n\n-    Evacuation Procedures\n\n-    Specific actions to take in a response to an accidental release of hazardous chemicals\n\n-    Procedures for informing the public and the local agencies\n\n-       Emergency Response Team\n\n-       Training Information\n\n\n\nThe ERP is implemented through an Incident Command System (ICS). The plant has a two-tier emergency activation system in place.  Small emergencies are responded to by the on site Emergency Response Team (ERT) consisting of an on shift Incident Commander, and a team of ERT members responsible for coordinating issues related to small fires, releases, rescue, and hazardous materials spills. A Level 1 emergency is handled by the personnel available on shift and does not require assistance from personnel outside of the plant.\n\n\n\nA Level 2 emergency is a refinery emergency that would require assistance from responders outside of the AltAir Paramount Emergency Response Team such as the Fire Department. A Level 2 emergency also activates the plant Emergency Management Team (EMT) to fill the rolls of ICS positions.\n\n\n\nThis plan was developed in consultation with, and final approval by the local fire department. The plant emergency response team and personnel routinely drill and train to maintain their skills in emergency response.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nParamount has a tracking system for resolving all findings from PHAs, some of w"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000082242,
      "SummaryText": "hich result in modifications to the process. There is a continuing training and certification program in place."
    }
  ]
}