{
  "FacilityID": 1000051377,
  "FacilityName": "Baze Chemical Palestine",
  "FacilityStr1": "2187 East FM 323",
  "FacilityStr2": null,
  "FacilityCity": "Palestine",
  "FacilityState": "TX",
  "FacilityZipCode": "75801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48001",
  "LEPC": "No LEPC in Anderson County, TX",
  "FacilityLatDecDegs": "31.737528",
  "FacilityLongDecDegs": "-95.585844",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 805620366,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Baze Chemical",
  "OperatorStr1": "3801 Mankins Ave",
  "OperatorStr2": null,
  "OperatorCity": "Odessa",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79764",
  "OperatorZipCodeExt": null,
  "RMPContact": "Maurice Karras",
  "RMPTitle": "Chief Engineer",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230555",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-08-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-10-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-10-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-10-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-10-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064905,
      "AltID": "Ethoxylation Plant",
      "FacilityID": 1000051377,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000066027,
          "ProcessID": 1000064905,
          "NAICSCode": "32519",
          "_desc": {
            "NAICS_CODE": "32519",
            "NAICS_DESCRIPTION": "Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000080312,
          "ProcessID": 1000064905,
          "ChemicalID": 9,
          "Quantity": 367500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 9,
            "ChemicalName": "Ethylene oxide  [Oxirane]",
            "CASNumber": "75-21-8",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000080313,
          "ProcessID": 1000064905,
          "ChemicalID": 12,
          "Quantity": 45650.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 12,
            "ChemicalName": "Propylene oxide  [Oxirane, methyl-]",
            "CASNumber": "75-56-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000580312,
          "ProcessID": 1000064905,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000580313,
          "ProcessID": 1000064905,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000051377,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nAt Baze Chemical safety is our top concern.  In our manufacturing facilities we take special measures to ensure the safety of all involved.  \n\n\n\nThe policy on chemical safety at the Palestine Plant is to prevent the release of chemicals through high standards of design and operation, and to provide measures to mitigate releases should they occur.   Baze Chemical is committed to operating and maintaining the facility in a safe and responsible manner and has the goal of no accidents or injuries.\n\n\n\nFACILITY AND REGULATED SUBSTANCES \n\n\n\nThe Palestine Plant is an ethoxylation facility that produces a range of specialty surfactants for use predominantly in the oil and gas industry.  The process of ethoxylation involves reacting ethylene oxide with various common chemicals, such as fatty alcohols and phenols, to produce a variety of products. \n\n\n\nThe plant can also use propylene oxide instead of (or as well as) ethylene oxide in a similar process known as \"propoxylation\".  \n\n\n\nRegulated materials at the facility are ethylene oxide (up to 375,500 lb, or 49,000 gallons) and propylene oxide (up to 45,650 lb, or 6,600 gallons).  The other raw materials used in the process as well as the products are not regulated.  Both ethylene oxide (EO) and propylene oxide (PO) are stored in pressurized horizontal storage vessels equipped with external cooling facilities.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM \n\n\n\nThe facility complies with the OSHA PSM rules as defined in 29 CFR 1910.119 and Program 3 requirements under EPA CAPP rules as defined in 40 CFR 68.\n\n\n\nSpecific design features and operating practices at the facility relevant to the control of ethylene oxide and propylene oxide are:\n\n\n\n- Purging with nitrogen after each transfer operation to prevent stagnant EO or PO liquid being present in piping.\n\n- Facilities and procedure to regularly circulate the contents of the EO storage tanks, in accordance with recognize"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000051377,
      "SummaryText": "d and generally accepted good engineering practices for the storage of EO.  Circulation of tank contents controls the potential for polymerization of EO.\n\n- Facilities and procedures to cool the contents of the EO and PO storage tanks, using chilled water.  The design of the cooling system eliminates the potential for cross-contamination between either material and the chilled water.\n\n- The provision of a scrubber system to remove trace vapors of EO or PO from vent discharges.\n\n- Dual independent transmitters on each storage tank to warn of high or low level, high or low pressure, and high temperature.\n\n- Padding of EO storage tanks with nitrogen to maintain the vapor space in the non-decomposable range.\n\n- Automatic shutdown of EO and PO tanks on low motor power and on high pump casing temperature, so that pumps cannot be run \"dead headed\".\n\n- Automatic shutdown of EO or PO injection to the reactors based on any one of the following reactor conditions: high temperature; high pressure; high level; lower stirrer power (which may indicate loss of stirring/agitation).\n\n- Remote shutdown of EO rail car unloading liquid line.\n\n- Remote shutdown of EO or PO tank liquid transfer.\n\n- All penetration for liquid and vapor lines to the EO and PO tanks are via top entry, thereby eliminating nozzles below the liquid level.\n\n- Secondary containment around the EO and PO storage tanks, sized for at least 110% of the largest inventory.\n\n- Passive fire protection of the EO and PO storage tanks to minimize the heat input to the tanks during a fire and avoid conditions that could lead to a BLEVE (boiling liquid expanding vapor explosion).\n\n- Water deluge system over the EO / PO storage tanks to suppress vapor dispersion of accidental spills.\n\n- Operating philosophy that requires a minimum of two operators to be present during each activity involving transfer of EO or PO.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY \n\n\n\nThe Palestine Plant is a new facility that has not yet commenced beneficial operat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000051377,
      "SummaryText": "ion and has had no accidents to report.\n\n\n\nEMERGENCY RESPONSE PROGRAM \n\n\n\nThe emergency response program for the Palestine Plant is based on the premise of minimal active intervention by plant personnel, other than remove shutdown of equipment, isolation of inventory, and activation of fixed vapor mitigation water deluge system.  The program addresses all the requirement of OSHA regulations for emergency action plans (per 29 CFR 1910.38).\n\n\n\nCoordination with local emergency responders is ongoing.  Baze Chemical has met hosted meetings at the plant with Scott Parkhurst, Emergency Management Coordinator for the City of Palestine, and Alan Wilcher, Palestine Fire Chief, to discuss possible emergency conditions at the plant.  Information on RMP worst credible scenario and alternative scenarios have been provided, together with a copy of the site's Emergency Response Plan.  The Palestine emergency services will act as \"first responders\" in the event of an emergency at the site.  Discussions with response agencies and familiarization of first responders with the facility are ongoing.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Palestine Plant is a new facility built to high standards.  While there are no specific planned changes, the facility will be managed in accordance with established process safety and environmental protection procedures.  During the initial 1-2 years of operation it is anticipated that employees may identify one or more opportunities to improve safety and/or operations through improvements to plant and/or procedures.  Any such opportunity will be properly evaluated and managed through the site's management of change procedure (PAL-PSM-010) prior to implementation.\n\n\n\nOFFSITE CONSEQUENCE ANALYSIS\n\n\n\nAn offsite consequence analysis has been prepared in accordance with the rules specified in 40 CFR 68, which require that ethylene oxide be treated as a gas liquefied by pressure.  As such, the rules require that the worst case release be the entire inve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000051377,
      "SummaryText": "ntory of the largest container released over a 10 minute period.  As detailed elsewhere in this RMP submission, the endpoint for this scenario is 12 miles.\n\n\n\nThis analysis is not credible, as it is thermodynamically impossible for the entire inventory of the largest tank of ethylene oxide to vaporize over 10 minutes.  Features in place that would further limit this scenario include:\n\n\n\n- ethylene oxide tanks are kept cool such that liquid temperature range is between 50 deg.F (the boiling point of EO at atmospheric pressure) and 70 deg.F\n\n- the tanks are contained within a dike that is adequate to contain the entire inventory of the largest tank\n\n- tanks do not have any nozzles or connections below the liquid level\n\n\n\nA release into the diked area will result in a liquid pool at 50 deg.F, which would vaporize over time.  This release would be similar to the propylene oxide worst case scenario, with a distance to the end point significantly lower than the 12 miles determined in accordance with the RMP rules.\n\n\n\nAdditional offsite consequence analyses addressed in this RMP are:\n\n\n\n- Alternative release of EO, based on a release during transfer of EO from rail tanker.  Release was assumed to be stopped after 1 minute by activation of emergency shutdown devices.  Distance to end point for this scenario was calculated at 1.1 miles.\n\n\n\n- Worst case release of PO (treated as a toxic liquid per RMP rules).  The entire contents of the PO storage tank is assumed to be released into the dike and vaporize over time.  Distance to end point for this scenario was calculated at 1.8 miles.\n\n\n\n- Alternative release of PO, based on a release during transfer of PO from tank truck.  Release was assumed to be stopped after 1 minute by activation of emergency shutdown devices.  Distance to end point for this scenario was calculated at 0.2 miles.\n\n\n\n"
    }
  ]
}