{
  "FacilityID": 1000013558,
  "FacilityName": "Overhill Farms, Inc. - Plant 2",
  "FacilityStr1": "3055 E. 44th St",
  "FacilityStr2": null,
  "FacilityCity": "Vernon",
  "FacilityState": "CA",
  "FacilityZipCode": "90058",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.004503",
  "FacilityLongDecDegs": "-118.213989",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 47426663,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Overhill Farms, Inc.",
  "OperatorStr1": "2727 Vernon Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Vernon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90058",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chhaya Krin",
  "RMPTitle": "Project Engineer",
  "FTE": 193,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000211282",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-01-11 00:00:00",
  "SafetyInspectionBy": "Vernon Health & Environmental Control Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-04-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-04-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-04-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016807,
      "AltID": "Refrigeration System",
      "FacilityID": 1000013558,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017189,
          "ProcessID": 1000016807,
          "NAICSCode": "31199",
          "_desc": {
            "NAICS_CODE": "31199",
            "NAICS_DESCRIPTION": "All Other Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019991,
          "ProcessID": 1000016807,
          "ChemicalID": 56,
          "Quantity": 10500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519991,
          "ProcessID": 1000016807,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013558,
      "SummaryText": "RISK MANAGEMENT PLAN - Overhill Farms, Inc.\n\nEXECUTIVE SUMMARY\n\nOverhill Farms, Inc. has established a Risk Management Plan according to EPA's regulations (40 CFR Part 68) for the Refrigeration System at its Vernon facility to enhance its already existing safety programs.  Overhill Farms, Inc. is extremely cautious in the handling of all chemicals and is very diligent about safety for its employees and its communities.  The Overhill Farms, Inc. staff is highly trained and utilizes modern equipment to provide safeguards. The Refrigeration System, that contains the regulated substance, anhydrous ammonia, is used for freezer and cooler operation.\n\nAccidental Release Prevention and Emergency Response Policies\n\nOverhill Farms, Inc. has an emergency response plan in effect to handle potential emergency situation at this facility. This plan is designed to meet the following objectives:\n\n1.) To save lives.\n2.) To minimize and avoid injuries.\n3.) To protect the environment.\n4.) To minimize property damage.\n\nKey elements of the Emergency Response Plan include a discussion of the overall approach elected by Overhill Farms, Inc. for implementation at the facility, key phone numbers and contact points, vicinity and evacuation maps, plans for evacuation, fire, injury, threats and civil disorder, earthquake, potential imminent danger to personnel, chemical spill, and ammonia health hazards.\n\nStationary Source and Regulated Substance\n\nThe Ammonia Refrigeration System at the Overhill Farms is a two-stage system comprised of compressors, evaporative condensers, a pilot receiver, a controlled pressure receiver, evaporators, a glycol heat exchanger, an intercooler, a liquid transfer vessel, two recirculators, an anhydrator, an automatic purge system and three accumulators.\n\nThe Ammonia Refrigeration System at Overhill Farms provides the cooling medium for several spiral freezers, holding freezers, 34oF Coolers, one glycol heat exchanger, and process areas. The Ammonia Refrigeration Sys"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013558,
      "SummaryText": "tem contains anhydrous ammonia that continuously circulates through the system. Vaporization of ammonia at different points of the system provides the needed cooling effect.\n\nHazard Assessment Summary\n\nWorst-Case Release Result Summary\n\nScenario Description: It is assumed that the entire system charge is available for release as liquid ammonia. Per the instructions of the regulation, the release is postulated to occur in 10 minutes. It is assumed that the release occurs outside of a building, and therefore, passive mitigation measures were not incorporated into the\ncalculations. The most pessimistic meteorological conditions were used as specified in the regulation. The reference table included in the EPA's RMP Guidance for Ammonia Refrigeration was used to determine the maximum downwind distance to 200 ppm. The result shows that offsite areas may be affected.\n\nAlternative Release Result Summary\n\nTwo alternative release scenarios were considered. Scenario Description: ALT-1: A 1/4 inch equivalent diameter opening on a liquid pipe, which is 15 feet above the ground, at 150 psig pressure and remains under pressure until the charge of the system is emptied. ALT-2: Same as ALT-1 except that the equivalent diameter is 1/2 inch. The scenario models a leak from a valve packing or a pipe connection. However, the selected opening diameter is very conservative given the typical opening sizes experienced in similar situations. The meteorological conditions specified in the regulation for alternative scenarios were used. The reference table included in EPA's RMP Guidance for Ammonia Refrigeration was used to determine the maximum downwind distance to 200 ppm. The downwind distances for these scenarios are significantly less than that for the worst case scenario. However, in these cases also, offsite areas may be affected.\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nOverhill Farms, Inc. has implemented a Process Safety Management (PSM) program "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013558,
      "SummaryText": "to manage the safety aspects of the Ammonia Refrigeration System. In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed. This includes common practices outlined by industry sources. In addition to the Management Programs, there are ammonia detectors situated in all those compartments where ammonia is present.\n\nFive-Year Accident History\n\nThere have been no incidents where ammonia has been released to the atmosphere due to the operation of the Overhill Farms, Inc. Plant 2 Ammonia Refrigeration System in the past five years (April 2005 to April 2010). \n\nPlanned Changes to Improve Safety\n\nSeveral Process and management system improvements are being considered and implemented as a result of the technical studies performed in the development of the PSM/RMP Program. These improvements include physical and administrative changes related to operation of the Ammonia Refrigeration System."
    }
  ]
}