{
  "FacilityID": 1000041632,
  "FacilityName": "Eastman Chemical Company - Jefferson Site",
  "FacilityStr1": "State Highway 837",
  "FacilityStr2": "( at Madison Ave.)",
  "FacilityCity": "Jefferson Borough",
  "FacilityState": "PA",
  "FacilityZipCode": "15088",
  "Facility4DigitZipExt": "0567",
  "FacilityCountyFIPS": "42003",
  "LEPC": "Allegheny County LEPC",
  "FacilityLatDecDegs": "40.265833",
  "FacilityLongDecDegs": "-079.901111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G7",
  "LatLongDescription": "PG",
  "FacilityURL": "www.eastman.com",
  "FacilityEmailAddress": "mlpeal@eastman.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Eastman Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Eastman Chemical Company",
  "OperatorStr1": "P.O. Box 567",
  "OperatorStr2": "State Highway 837",
  "OperatorCity": "West Elizabeth",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15088",
  "OperatorZipCodeExt": "0567",
  "FTE": 260,
  "OtherEPAFacilityID": "15088HRCLSSTATE",
  "EPAFacilityID": "100000109811",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "95-0058",
  "SafetyInspectionDate": "2012-05-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-07-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-05-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.27322,
  "FRS_Long": -79.89591,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "0.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051284,
      "AltID": "Resin Manufacturing",
      "FacilityID": 1000041632,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062216,
          "ProcessID": 1000051284,
          "ChemicalID": 149,
          "Quantity": 46800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000062217,
          "ProcessID": 1000051284,
          "ChemicalID": 131,
          "Quantity": 500000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000062213,
          "ProcessID": 1000051284,
          "ChemicalID": 138,
          "Quantity": 7300000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000062214,
          "ProcessID": 1000051284,
          "ChemicalID": 56,
          "Quantity": 45000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000062215,
          "ProcessID": 1000051284,
          "ChemicalID": 52,
          "Quantity": 19200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000051792,
          "ProcessID": 1000051284,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000043528,
              "Process_NAICS_ID": 1000051792,
              "SafetyReviewDate": "2014-04-30 00:00:00",
              "PHA_Date": "2015-09-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-03-07 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-04-30 00:00:00",
              "TrainingReviewDate": "2014-04-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "On-line and Computer-based training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer based testing",
              "MaintenanceReviewDate": "2014-03-31 00:00:00",
              "EquipmentInspectionDate": "2014-05-01 00:00:00",
              "EquipmentTested": "spinkler system and fire alarm system",
              "ChangeMgmtDate": "2014-05-02 00:00:00",
              "ChangeMgmtReviewDate": "2014-04-15 00:00:00",
              "PreStartupReviewDate": "2014-05-01 00:00:00",
              "ComplianceAuditDate": "2014-04-04 00:00:00",
              "AuditCompletionDate": "2015-07-01 00:00:00",
              "IncidentInvestigationDate": "2014-05-01 00:00:00",
              "InvestigationChangeDate": "2014-07-01 00:00:00",
              "ParticipationPlansReviewDate": "2014-02-28 00:00:00",
              "HotWorkPermitReviewDate": "2014-01-01 00:00:00",
              "ContractorSafetyReviewDate": "2014-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2014-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000052214,
                  "PreventionProgram3ID": 1000043528,
                  "ProcessChemicalID": 1000062216
                },
                {
                  "PrimaryKey": 1000052215,
                  "PreventionProgram3ID": 1000043528,
                  "ProcessChemicalID": 1000062217
                },
                {
                  "PrimaryKey": 1000052211,
                  "PreventionProgram3ID": 1000043528,
                  "ProcessChemicalID": 1000062213
                },
                {
                  "PrimaryKey": 1000052212,
                  "PreventionProgram3ID": 1000043528,
                  "ProcessChemicalID": 1000062214
                },
                {
                  "PrimaryKey": 1000052213,
                  "PreventionProgram3ID": 1000043528,
                  "ProcessChemicalID": 1000062215
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000041632,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-04-30 00:00:00",
    "ERTrainingDate": "2009-04-24 00:00:00",
    "CoordinatingAgencyName": "Allegheny County Emegency Managemnt",
    "CoordinatingAgencyPhone": "4124732550",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "USCG operations and security"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041632,
      "SummaryText": "Policy:\r\n\r\nEastman Chemical Resins Inc. as a member of the American Chemical Council (ACC) and is committed to the principles of Responsible Care(R).  The Corporate Policy on Safety, health and Environment states:\r\n\r\nAt ECRI, we manufacture chemical specialty products.  We do so with full commitment to the chemical industry's Responsible Care(R) initiative.  In keeping with this commitment, we are dedicated to providing a safe and healthful environment for our employees, customers, and communities.  To do this, we are dedicated to and working toward continuous improvement in our operations to prevent pollution; to reduce risk; and to enhance safety, health, and environmental performance.  By incorporating these beliefs and attitudes into the way we do things at ECRI, we take a key step forward in minimizing the environmental impact of our operations, satisfying customers needs, and creating shareholder value.\r\n\r\n We will adhere to the following basic principles in managing our business worldwide:  We will comply with the letter and spirit of all applicable safety, health, and environmental laws, regulations, and corporate guidelines.\r\n We will define strategic objectives, develop tactical plans, identify clear accountability, provide necessary resources, and measure our progress on safety, health, and environmental matters on an ongoing basis.  Our planning will consider both business goals and significant safety, health, and environmental aspects of our products and operations.\r\n We will evaluate the safety, health, and environmental impacts of new and existing products and operations and will work to reduce the adverse impacts.\r\n We will provide for an open dialogue on safety, health, and environmental issues relating to our products and operations with our stakeholders, including shareholders, employees, customers, suppliers, government agencies, and communities.\r\n We will work to continually reduce workplace injuries; incidents with the potential for causing pro"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000041632,
      "SummaryText": "l clear.\r\n\r\nThe Plant information updates would include items such as:\r\nPhone numbers to answer health questions\r\nPhone numbers for property damage claims\r\nDescriptions of distinction odors\r\nInformation to hospitals on chemical emergencies\r\nContinued input on what to do in the chemical emergency\r\n\r\nThis plan of action has been designed to get the release controlled as quickly as possible as well as providing a high level of safety for plant employees and community residents.\r\n\r\nRecent and Planned changes to improve safety\r\n\r\nECRI has constructed an enclosure for the BF3 trailer which is equipped with current detectors and a deluge system.  The new facility includes a ventilation system which draws air from the enclosure through a neutralizing scrubber 24 hours per day.  The scrubber is designed to absorb BF3 at the rate released in the worst case scenario above thus effectively preventing an atmospheric release and any off-site consequences.  This active system will have only a minor impact on the worst case; by the increased distance to the first neighbor.  It has substantially reduce the risk of BF3 leaving the site.\r\n\r\nThe Site is working with its ammonia supplier to understand and recommend changes to the existing ammonia tank deluge system with the intent of providing the most effectively designed deluge system.\r\n\r\nSummary\r\n\r\nEastman Chemcial Resins Inc.- Jefferson is committed to operating a safe and environmentally responsive chemical facility in Jefferson Borough. Our Eastman-wide commitment to improving the environmental performance of our operations is most visible in our active participation in the chemical industry's Responsible Care initiative, which encompasses safety, health, and the environmental practices.  One of the areas that we continue to improve is the community awareness and emergency response.  The Jefferson Plant continues to look for opportunities to improve the safety of the production operations, employees, and the community.  In order a"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000041632,
      "SummaryText": "chieve greater performance, we continue to focus on the major areas of process safety design, plant maintenance, operator training, and self-auditing."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041632,
      "SummaryText": "perty damage, material loss, or interruption of our business; waste; and releases to the environment.\r\n We will empha product stewardship and advocate its importance to our suppliers, distributors, and customers.\r\n Every Eastman employee, worldwide, has a role to play.  All of us are responsible and accountable for adhering to the letter and spirit of this policy.  All of us must incorporate safety, health, and environmental considerations into our daily business activities.  It takes a total team effort to truly be a Responsible Care(R) company\r\n\r\nThe Jefferson Plant has a strong commitment to continuous improvement in our safety and environmental performance.  The Jefferson Plant prevents accidents by: Designing for safety including redundant safety systems, automatic and manual shutoff valves, Process Hazards Analysys (PHAs) studies on production areas, air pollution abatement equipment, and fire suppression systems; Maintaining our plant including equipment checks and shutdown pre-planning, Preventative and Predictive maintenance programs (PSM - Mechanical Integrity), startup checks after maintenance, annual inspection of critical safety devices, highly skilled and trained maintenance people; Operating our plant safely including operators trained to understand the potential process hazards, written operating work instructions, and a job qualification program; Auditing our operations from self-auditing of procedures and operations, ISO 9002 certifications, PSM audits, pre-startup reviews, and incidents investigation follow-up.\r\n\r\nThe Plant is committed in all areas for improving the plant standards for safety and environmental performance and is proud of the efforts to date.\r\n\r\nFacility Description\r\n\r\nThe ECRI - Jefferson Plant manufactures hydrocarbon resins from various petroleum streams and chemical monomers.  The products of the plant are utilized in the adhesives, graphic arts, rubber, photocopy, and other industries.  The plant is organized as a group of op"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041632,
      "SummaryText": "erating units whose individual functions are relatively independent, although they share utilities, services, and storage facilities.  Raw materials, primarily hydrocarbon liquids, are polymerized in any of five units:  C-5 Process, MP-Poly, WW-Poly, Solution Poly, and UV Poly.  Most polymerizations result in an intermediate product or resin solution which consists of the product resin dissolved in a petroleum liquid.  The intermediates are distilled, emulsified, and hydrogn-modified to produce the hydrocarbon resin packaged for consumption by various industries.  Final products are shipped as flakes, pastilles, or beads in bags, as solids in drums, and as liquids in drums, rail cars or tank trucks.\r\n\r\nBackground of the Risk Management Program\r\n\r\nThe US EPA (United States Environmental Protection Agency) under the Clean Air Act, section 112(r), developed a Risk Management Plan (RMP) rule which requires Corporations to assess risk within their plants and plant communities.  The Risk Management Plan rule requires that facilities that use certain chemicals develop and manage a Risk Management Plan.  This plan requires that we identify, assess, and document important information about chemical processes at our plant.  The regulation requires us to maintain safety and emergency response systems to prevent and prepare for chemical accidents.  The rule is also designed to inform the public (in an understandable language) about the regulated risks and the emergency prevention, safety and response programs implemented at our plant.\r\n\r\nThis law was passed in reaction to public concerns about plant accidents involving chemicals.  To minimize the consequences of such releases, the legislation wanted to focus on preventative measures on the chemicals that pose the greatest risk.  Again, managing the risk such as deciding to wear a seat belt.  The rule applies to manufacturing plants, as well as non-manufacturing sites, that produce, process, handle, or store more than a threshol"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041632,
      "SummaryText": "d quantity of one or more of RMP rule listed chemicals.\r\n\r\nIndustrial facilities are required to analyze all significant incidents that had consequences beyond the plant fence line over the last five years; identify worst case and alternative release scenarios for accidents at the site; and determine the possible effects of worst case and alternative case scenarios within the community.  Facilities must communicate the results of these analyses to the EPA, Allegheny County Health Department, and the local emergency planning committee (LEPC).\r\n\r\nWorst case scenario is the term used in the regulation to describe a hypothetical accidental release for emergency planning.  In the worst case model, emergency planners assume all of the safety systems fail on the facility's largest storage container or interconnected pipe system, containing an EPA listed chemical, and that the entire contents leak to the environment in 10 minutes.  Obviously, this scenario would have a great impact on the plant and the local community.  The definition of the worst case scenario severely limits the degree to which a realistic scenario can be selected.  The intention of the worst case scenario is not in fact to be realistic, but to define the upper bound impact of a release that is virtually impossible.  This exercise challenges the emergency planners to prepare for this kind of emergency.\r\n\r\nThe Jefferson Plant takes many steps to make sure that these worst case scenarios don't happen.  The EPA acknowledges that the likelihood of a worst case scenario ever occurring is extremely small.  For this reason, the EPA also allows for facilities to provide an alternative or more likely scenario.  The alternative scenario represents a potential release that is more probable than the worst case scenario and therefore more relevant to emergency planning efforts.  The Jefferson Plant will include an alternative scenario in our plan so that the emergency management agencies and first responders c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000041632,
      "SummaryText": "an prepare and drill with this option.  We also have several layers of safety to prevent these incidents.  As the RMP program continues, we will learn more about these systems and the alternative scenario.\r\n\r\nWorst Case Release (Toxic)\r\n\r\nThe worst case scenario is defined as that scenario that is predicted to have the greatest distance to the applicable endpoint.  These chemical concentration endpoints are labeled toxic and flammable endpoints.  These endpoints are set by the regulations at a level considerably less than the Immediately Dangerous to Life and Health (IDLH) level as defined by the National Institute if Occupational Safety and Health.  The objective of the scenario modeling for each release scenario is to determine the downwind distance to the endpoint.  In the case of toxic substances, Ammonia and BF3, the endpoint is the concentration of the chemical in the air that is believed to be protective of the public for one-hour exposure periods.  This level of exposure would not cause any long-term health consequences.  The level would not impair the individual's ability to take protective action.\r\n\r\nThe Jefferson Plant program included dispersion modeling to analyze the scenarios.  Eastman utilized several dispersion models.  All of the seven (7) models are publicly available and referenced in the EPA guidance document.  Each model has different strengths so several models were applied to each scenario.  Certain input parameters were common to all models including meteorological data, chemical data, and release characteristics.\r\n\r\nThe Worst Case Scenario for the Jefferson Plant involves the chemical Anhydrous Ammonia.  Anhydrous Ammonia is received by the Plant in a tank truck that is unloaded into a 45,000-pound storage tank.   The ammonia is used in the resin process as a neutralizing agent.\r\n\r\nThe catastrophic release of ammonia would occur over 10 minutes due to a rupture in the storage tank.  The toxic endpoint is 200 PPM as specified by the regulati"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000041632,
      "SummaryText": "Response Plan (One Plan));  the Oil Pollution Act Plan for releases to the Monongahela River;  ERT annual table top drill with the USCG, EMA, Fire Departments, response cleanup contractors, and local industries; Three Rivers Pollution Prevention Council table tops drills and meetings;  Weekly plant fire drills; Joint training with the local Volunteer Fire Departments (open house with process hazards orientation and plant tour) ; Incident reviews with the Allegheny County EMA; Mini-table drills for the ERT with critiques for improved efficiency; highly trained industrial Fire Team and Confined Space Rescue Team; Plant nurse on site; and Community Shelter-in-Place program with the Community Advisory Panel. \r\n\r\nEmergency Response for Release\r\n\r\nIn the event of a significant accidental release the Jefferson Plant Plan would be enacted to take the following actions to protect the health and welfare of the Plant employees and residents of the community:\r\n\r\n1. Upon release, the fire alarm would have been sounded by the local operator:\r\n\r\n2. The Shift Supervisor/Incident Commander would request for the community alarm be activated;\r\n\r\n3. The Shift Supervisor/Incident Commander would instruct the Security Guard or Boiler House operator to make appropriate calls utilizing the Emergency Response Action Plan Call List which contains numbers for the following:\r\n\r\n911 - Allegheny County Emergency/Police/Ambulance Dispatch\r\nAllegheny County Emergency Management (LEPC)\r\nAllegheny County Health Department - Air Bureau\r\nPennsylvania Emergency Management Agency\r\nNational Response Center\r\nPA Department of Environmental Protection\r\nUnited States Coast Guard\r\nCHEMTREC\r\nUS Army Corps of Engineers\r\nPA American Water Company\r\nNorfork Southern Railroad\r\n\r\n4. The residents would take precautions to shelter-in-place and listen to the emergency broadcast system for information updates and news.\r\n\r\n5. The Plant evacuation siren would sound when appropriate management has made the decision for al"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000041632,
      "SummaryText": "on.  The IDLH is 300 PPM.  The material would be a dense cloud of a colorless gas with a pungent, suffocating odor.  The health hazards would be irritated eyes, nose and throats.  Most individuals could be exposed to the concentration level represented by the toxic endpoint for up to one hour without having irreversible or serious health effects or symptoms.  The DEGADIS model was most applicable for this release.  The model indicates that the distance to the toxic endpoint (concentration of the chemical in the air that is believed to be protective of the public for one hour exposure periods with no long term health concerns or impair the persons ability to take protective cover) is 1.35 miles.  The closest off-site receptor is 0.16 miles from the probable point of release.\r\n\r\nWorst Case Release Scenario (Flammable)\r\n\r\nThe flammable endpoint is based on pressure and not on chemical concentration.  This endpoint is 1 psi overpressure, which has the force that could break windows in a house.\r\n\r\nThe worst case flammable release would be the entire 7,300,000 pound contents of the Piperylene Storage Tank released to the containment dike.  The RMP regulations specify that 10% of the energy contained in the resulting vapor cloud participates in an explosion.  The dispersion model predicts that the regulatory endpoint overpressure of 1 psi may be felt up to 1.6 miles from the tank. The closest off-site receptors are within 0.3 miles.\r\n\r\nAlternative Release Scenarios (Toxic)\r\n\r\nAlternative scenarios are required for each RMP regulated toxic substance; Eastman has one for Anhydrous Ammonia.  The Alternative or Most Likely Scenario for Ammonia involves the shearing of a two (2) inch supply line in the 45000 pound storage tank or its local appurtenances and results in an uncontrollable release.  This release would occur over a period of 10 minutes; allowing time for a response.  Manual direction of a water stream from a fire monitor would be utilized to mitigate the actual rele"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000041632,
      "SummaryText": "ase.  Without such mitigation, the DEGADIS model indicates the distance to the toxic endpoint is 1.12 miles.  The closest off-site receptor is 0.16 miles from the site from the probable point of release.\r\n\r\nAlternative Release Scenario (Flammable) \r\n\r\nThe Alternative or Most Likely Scenario is represented by a pool fire at the Tank containing Piperylene.  The tank is assumed to have failed.  With a 5.1 m/sec wind and Class D atmospheric stability, the endpoint of 5 kW/m2 is expected to be at 70 meters.  The resulting radiation would be less than 5 kW/m2  at the nearest receptor.  With the nearest off-site receptor 76 meters from the tank; no off-site impact is to be expected.\r\n\r\nGeneral Accidental Release Prevention Program\r\n\r\nEastman - Jefferson Plant has in place an effective OSHA-PSM program.  This primarily on-site program is discussed in detail in section 7 of this report.\r\n\r\nChemical-specific Prevention Steps\r\n\r\nThis report addresses 5 chemicals used in the resin manufacturing process, listed under RMP, and present in quantities exceeding the threshold for regulation.  Here we point out some of the specific considerations Eastman has made in developing a prevention program.\r\n\r\nBoth BF3 and Ammonia are stored under pressure.  The BF3 remains in the delivery cylinders while the Ammonia is transferred to a permanent supply tank upon delivery.  Both systems are equipped with excess flow check valves to prevent a major release outside the immediate area of the storage vessels.  The Anhydrous Ammonia is stored in an insulated standard design tank equipped with all standard safety devices.  The BF3 is a unique material stored at up to 2500 psi.  The extraordinary pressure combined with its corrosive nature requires extraordinary measures to prevent both minor and major releases.  Here we have utilized a self scrubbing system inside an enclosed storage and handling building for the single trailer.  The building is monitored by Closed Circuti Television cameras, and sm"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000041632,
      "SummaryText": "oke detection.  Mitigation is by a two stage scrubber designed to handle the worst case scenario.  A back up deluge system exists if needed.\r\n\r\nHydrogen is stored both as a cryogenic liquid and as a pressurized gas at the south end of the plant.  Nitrogen snuffers allow any hydrogen vent fires to be extinguished before overheating equipment.  Local sources of ignition have been minimized.\r\n\r\nPiperylene is a light petroleum product stored in one of two large tanks equipped with an internal floating roof.  An installed foam fire supression system is prepared to extinguish an in tank fire before it might result in tank failure.  The tanks are located within a suitable dike which will minimize the extent of the pool should tank failure occur.\r\n\r\nIsobutylene (2-Methylpropene on the RMP list) is stored in a steel sphere.  It has properties similar to butane lighter fluid and will vaporize when open to the atmosphere.  The rapid evaporation potentially results in a very cold pool of liquid.  Excess flow valves are installed on all of the bottom nozzles to prevent major releases outside the immediate tank area.  The tank is installed within a concrete dike which would minimize the spread of the cryogenic liquid which might result from tank failure.  The steel tank support structure is sprayed with a fire and heat resistant material. \r\n\r\nFive-Year Accident History\r\n\r\nECRI - Jefferson has reported no accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on-site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\nEmergency Response Program\r\n\r\nThe Jefferson Plant has a very active Emergency Response program.  This response program involves many functions both inside and outside of the facility.    The Plant employees and Emergency Response Team (ERT) training includes: The Jefferson Plant Emergency Action Plan; including notification plans and lists, Emergencey"
    }
  ]
}