{
  "FacilityID": 1000083530,
  "FacilityName": "TPCG Pollution Control - North Treatment Plant",
  "FacilityStr1": "2000 St. Louis Canal Road",
  "FacilityStr2": null,
  "FacilityCity": "Houma",
  "FacilityState": "LA",
  "FacilityZipCode": "70364",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22109",
  "LEPC": "Terrebonne Parish LEPC",
  "FacilityLatDecDegs": "29.628769",
  "FacilityLongDecDegs": "-090.732125",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Terrebonne Parish Consolidated Government",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Terrebonne Parish Consolidated Govt",
  "OperatorStr1": "P. O. Box 2768",
  "OperatorStr2": null,
  "OperatorCity": "Houma",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70361",
  "OperatorZipCodeExt": null,
  "FTE": 44,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136952",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-05-20 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-12-06 10:34:54",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-12-06 10:34:54",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-12-06 10:34:54",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-12-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.62938,
  "FRS_Long": -90.736201,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000104378,
      "AltID": null,
      "FacilityID": 1000083530,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000130721,
          "ProcessID": 1000104378,
          "ChemicalID": 49,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000130722,
          "ProcessID": 1000104378,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000105710,
          "ProcessID": 1000104378,
          "NAICSCode": "56221",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000064974,
              "Process_NAICS_ID": 1000105710,
              "SafetyReviewDate": "2014-06-01 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute, Compressed Gas Association",
              "FR_Comments": null,
              "HazardReviewDate": "2019-05-15 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-08-01 00:00:00",
              "TrainingReviewDate": "2019-02-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Vendor certified instructors",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "written evaluation",
              "MaintenanceReviewDate": "2014-05-20 00:00:00",
              "EquipmentInspectionDate": "2019-01-18 00:00:00",
              "EquipmentTested": "Chlorine and Sulfur Dioxide regulators",
              "ComplianceAuditDate": "2018-10-27 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000065763,
                  "PreventionProgram2ID": 1000064974,
                  "ProcessChemicalID": 1000130721
                },
                {
                  "PrimaryKey": 1000065764,
                  "PreventionProgram2ID": 1000064974,
                  "ProcessChemicalID": 1000130722
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000083530,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "TOHSEP",
    "CoordinatingAgencyPhone": "9858504638",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083530,
      "SummaryText": "with the chlorine and sulfur dioxide process are identified and controlled. Hazard reviews are performed on an established schedule of every five years. \r\n\r\nTPCG-NTP primarily uses the hazard review checklist provided in the Risk Management Program Guidance for Wastewater Treatment Plants to perform this evaluation. Through this process two specific hazards have been identified: \r\n\r\n¿\tReuse of gaskets - according to the Chlorine Manual, prepared by the Chlorine Institute, a release of chlorine is most often a result of reusing gaskets. The operating procedures specify the use of new gaskets during change out of the 1-ton cylinders at the TPCG-NTP. \r\n¿\tImproperly made up pipe joints - Specifications for pipe joints are outlined in the equipment manuals for making up pipe joints and are incorporated into the operation procedures for the TPCG-NTP.\r\n\r\nThe hazard review provides a means for determining if the process is designed and operated in accordance with standard industry codes and federal and/or local regulations. The review requires a documented inspection of the process and operating procedures to ensure compliance. The hazard review must be updated, at a minimum, every five years or after major process changes. A copy of a hazard review checklist provided in the Risk Management Program Guidance for Wastewater Treatment Plants is included in the RMP document maintained at the facility. This checklist is used to perform Hazard Reviews at the NTP.\r\n\r\n2.2.3\tOperating Procedures (40 CFR 68.52)\r\n\r\n\r\nTPCG-NTP maintains written procedures that address various modes of process operations. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. Procedures are periodically reviewed and annually certified as current and accurate. Procedures are maintained current by revising them as necessary to reflect changes made to the process. The written operating procedures are readily available to operators"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083530,
      "SummaryText": "and for other personnel to use as necessary to safely perform their job tasks.  An index of documents required for the RMP, including operational procedures, and their specific locations is listed in Appendix C.\r\n\r\n2.2.4\tTraining (40 CFR 68.54)\r\n\r\n\r\nSafety related training is conducted biannually by certified instructors. Training includes classroom instruction and on the job training. The trainee's knowledge is evaluated to assess classroom knowledge. The trainee is also observed while performing the operations. Safety information is obtained from the equipment manuals, the SDSs, and the training courses conducted by certified instructors.\r\n2.2.5\tMaintenance (40 CFR 68.56)\r\n\r\nEquipment is inspected monthly and maintained in accordance with manufacturers' or suppliers' specifications. Specific maintenance instructions are maintained at the facility. A maintenance action form is used for scheduling maintenance activities outside of the regularly scheduled events. Personnel involved in maintenance are trained in proper safety and operational procedures. Documentation is kept on file for dates and actions completed during maintenance, as well as management oversight of maintenance activities.  An index of documents required for the RMP, including equipment inspection and maintenance logs, and their specific locations is listed in Appendix C.\r\n\r\n2.2.6\tCompliance Audit (40 CFR 68.58)\r\n\r\nTo help ensure that the accident prevention program is functioning properly, TPCG-NTP conducts audits to confirm the procedures and practices required by the accident prevention program are correct and robust. Compliance audits are conducted at least every three years. The audit team is assembled with either internal personnel or third-party auditors and at least one person who is knowledgeable in the process. These audits are documented on the Compliance Audit checklist. The findings are forwarded to TPCG-NTP management for resolution. Corrective actions taken in response to the audit te"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000083530,
      "SummaryText": "am's findings are tracked until they are complete. The final resolution of each finding is documented.  An index of documents required for the RMP, including compliance audits and the corrective actions associated with the findings, and their specific locations is listed in Appendix C.\r\n\r\n2.2.7\tIncident Investigation (40 CFR 68.60)\r\n\r\nIncidents that result in, or reasonably could result in a catastrophic release, are investigated as quickly as possible, but no later than 48 hours following the incident. Investigation results are documented and maintained on file for use in training employees for incident prevention and determining the potential need to re-evaluate operating or safety procedures. The following information is provided during the course of the incident investigation: \r\n\r\n¿\tDate of incident\r\n¿\tDate investigation began\r\n¿\tDescription of incident\r\n¿\tFactors contributing to incident\r\n¿\tRecommendations resulting from incident\r\n¿\tRecommendations, resolutions, and corrective actions shall be documented\r\n¿\tFindings will be reviewed with affected employees\r\n¿\tInvestigation summaries will be retained for five years\r\n\r\nThese reports and associated follow up documentation are retained on-site for five year.  An index of documents required for the RMP, including incident reports, and their specific locations is listed in Appendix C.\r\n\r\n2.3\tFive-Year Accident History (40 CFR 68.42)\r\n\r\nTPCG-NTP is committed to minimizing potential risks to the public, employees and environment. A fundamental part of this commitment is the prevention of accidental releases of hazardous substances in and around the facility. Within the past five years, there have been no releases of a regulated substance from a regulated process that meet the criteria for RMP incident reporting.\r\n\r\n2.4\tEmergency Response Program\r\n\r\nThe North Treatment Plant employees will not respond to an accidental release of a regulated substance.\r\n\r\nEmergency response actions relative to a release at the TPCG-NTP a"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083530,
      "SummaryText": "Facility LDEQ Agency Interest (AI) Number: 19176\r\n\r\n1.0\tAPPLICABILITY\r\n\r\nClean Air Act (CAA) Section 112(r)(2)(c) defines stationary sources as any buildings, structures, equipment, installations, or substances emitting stationary activities which belong to the same industrial group, which are on one or more contiguous properties, which are under the control of the same person, and from which an accidental release may occur. The Terrebonne Parish Consolidated Government-North Treatment Plant (TPCG-NTP) meets the definition of stationary source. \r\n\r\nA facility is subject to the Chemical Accident Prevention Provisions (40 Code of Federal Regulations (CFR) Part 68) if they handle, manufacture, use or store any of the toxic and/or flammable substances listed in 40 CFR 168.130 above the specified threshold quantities in a process. A review of site operations revealed that two substances stored on site were regulated under Section 68.130, which include chlorine and sulfur dioxide. Seven, each 1-ton cylinder, chlorine tanks and seven, each 1-ton cylinder, sulfur dioxide tanks are stored at the northeast corner of the plant site, next to the sludge press building. The total maximum on-site storage of chlorine is 14,000 pounds, and the total maximum on-site storage of sulfur dioxide is 14,000 pounds. The threshold limits for these substances are 2,000 pounds and 5,000 pounds, respectively.\r\n\r\n2.0\tEXECUTIVE SUMMARY\r\n\r\nThis document satisfies the RMP executive summary requirement of the RMP rule and provides the public with a description of the risk management program at TPCG-NTP.\r\n\r\n2.1\tDevelop and Implement a Management System (40 CFR 68.15)\r\n\r\nThe Wastewater Treatment Plant Superintendent at TPCG-NTP is responsible for the development and implementation of the risk management program for the facility. \r\n\r\n2.2\tAccidental Release Prevention Program\r\n\r\nProgram 2 requires the compilation of up-to-date safety information related to regulated substances, process, and equipment."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083530,
      "SummaryText": "The seven elements listed below are part of a general accidental release prevention program, which are detailed in subsequent sections:\r\n\r\n¿\tSafety Information\r\n¿\tHazard Review\r\n¿\tOperating Procedures\r\n¿\tTraining\r\n¿\tMaintenance\r\n¿\tCompliance Audits\r\n¿\tIncident Investigation\r\n\r\n2.2.1\tSafety Information (40 CFR 68.48)\r\n\r\n\r\nWritten safety information pertaining to the hazards of the regulated substance used or produced by the process, and information pertaining to the technology and equipment involved in the process at the TPCG-NTP were compiled prior to conducting the hazard analysis required by this rule. \r\n\r\nSafety Data Sheets (SDS) are maintained to identify and understand the hazards posed in the process involving regulated substances. SDS's for chlorine and sulfur dioxide are maintained at the facility.  An index of documents required for the RMP, including SDSs, and their specific locations is listed in Appendix C.\r\n\r\nTPCG-NTP maintains seven, each 1-ton cylinders chlorine tanks at the site. The Chlorine Institute recommends that chlorine tanks not be filled beyond 95% capacity at a maximum temperature of 122°F. The maximum filling density is 125%. Seven, each 1-ton cylinders sulfur dioxide tanks are stored at TPCG-NTP. Information related to the safe temperature and filling capacity of tanks is provided by the Compressed Gas Association and is maintained at the facility.\r\n\r\nTPCG-NTP maintains storage and process limits, and safety information relative to the recommended storage parameters for the process equipment used on site. Equipment manuals provided by the manufacture/supplier are maintained at the facility. These manuals list the codes and standards used for the design and installation of the process equipment.  An index of documents required for the RMP, including equipment manuals, and their specific locations is listed in Appendix C.\r\n\r\n2.2.2\tProcess Hazard Review (40 CFR 68.50)\r\n\r\nThe facility uses the hazard review to ensure that hazards associated"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000083530,
      "SummaryText": "re outlined in the North Treatment Plant & South Treatment Plant Risk Management, Chemical Accidental Release Prevention Program. Response actions have been coordinated with the Terrebonne Office of Homeland Security and Emergency Preparedness (TOHSEP) and the Bayou Cane Fire Department. The telephone numbers for the TOHSEP, the state, local law enforcement agencies and local fire departments, as well as other reporting agencies are included in the above referenced document. Step-by-step procedures for on-site personnel are outlined if a leak is detected including identifying the severity of the release, use of prepackaged repair kits, reporting and follow-up procedures, as well as severe weather procedures. Detailed procedures for use of the repair kits are provided in the equipment specific manuals.\r\nResponse activities are coordinated at least annually by table top exercise with the TOHSEP."
    }
  ]
}