{
  "FacilityID": 1000061098,
  "FacilityName": "The Procter & Gamble Manufacturing Company",
  "FacilityStr1": "1900 Kansas Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Kansas City",
  "FacilityState": "KS",
  "FacilityZipCode": "66105",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20209",
  "LEPC": "Wyandotte County LEPC",
  "FacilityLatDecDegs": "39.089722",
  "FacilityLongDecDegs": "-094.653889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://us.pg.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7130032,
  "ParentCompanyName": "The Procter & Gamble Company",
  "Company2Name": null,
  "CompanyDUNS": 4238200,
  "Company2DUNS": 0,
  "OperatorName": "The Procter & Gamble Company",
  "OperatorStr1": "1 P&G Plaza",
  "OperatorStr2": null,
  "OperatorCity": "Cincinnati",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45202",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Shaver",
  "RMPTitle": "Plant Manager",
  "FTE": 297,
  "OtherEPAFacilityID": "KSD007130032",
  "EPAFacilityID": "100000148841",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-07-26 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-03-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-02-05 00:00:00",
  "DeRegistrationEffectiveDate": "2020-01-16 00:00:00",
  "AnniversaryDate": "2022-01-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 39.08744,
  "FRS_Long": -94.65308,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000076306,
      "AltID": "3",
      "FacilityID": 1000061098,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077488,
          "ProcessID": 1000076306,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094573,
          "ProcessID": 1000076306,
          "ChemicalID": 21,
          "Quantity": 516460.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 21,
            "ChemicalName": "Epichlorohydrin  [Oxirane, (chloromethyl)-]",
            "CASNumber": "106-89-8",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594573,
          "ProcessID": 1000076306,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061098,
      "SummaryText": "This is an executive summary of the policies, procedures and activities for compliance with the EPA's Accidental Release Prevention Requirements - Risk Management Program pursuant to Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) for Procter & Gamble Manufacturing Company's (P&G's) Kansas City Soap Plant (KC Plant).\n\n\n\nThe accidental release prevention and emergency response policies at the stationary source [40 CFR 68.155(a)]:\n\nThe accidental release prevention and emergency response policies are addressed in the individual RMP procedures which detail the RMP program requirements as well as how P&G complies with the applicable requirements.  The KC Plant is a responding facility for releases of the RMP-listed chemicals, so the site utilizes an Emergency Response Plan.  \n\n\n\nThe stationary source and regulated substances handled [40 CFR 68.155(b)]:\n\nStationary Source:\n\nThe P&G KC Plant manufactures liquid dish detergents and raw materials for use in other P&G products and for sale to other companies.  These include Dawn, Ivory, Joy and Gain which might be found in a home kitchen.  The P&G KC Plant has been in continuous operation since 1905, and it is the first P&G plant opened outside of Cincinnati, Ohio, P&G's corporate headquarters.\n\n\n\nIn Kansas City and elsewhere, P&G has a long-standing commitment to a safe work environment for employees and minimizing the impact of our operations on the environment.  Our safety and environmental programs are managed by highly skilled employees and are actively supported by the participation of all employees and all management, and a strong corporate staff.  The goal of both the safety and environmental programs is prevention.  P&G believes in a zero defect work environment where issues are identified and fixed as a part of daily work.  This zero defect mentality leads to continuously improving operations and zero incidents that could harm people or the environment.  Although P&G's safety record is already among"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061098,
      "SummaryText": " the best in the business, we are constantly striving for improvement.\n\n\n\nThe KC Plant has an excellent history of safe operations.  Incident and Near Miss reporting is encouraged and rewarded.  Any incidents or near misses on site are followed by a thorough incident investigation and follow-up action steps are taken to prevent recurrence.  Routine inspection, as well as detailed analysis using non destructive test equipment such as boriscopes, ultrasonic thickness instruments, dye penetration tests, etc.,  are routinely used to ensure the equipment is at optimal condition at all times.\n\nRegulated Substances Handled & Covered Process:\n\nThe P&G Kansas City Soap Plant uses one chemical that is subject to reporting under this filing to the U.S. Environmental Protection Agency (EPA).  It is a necessary material used to manufacture soaps and detergents.\n\n\n\nEpichlorohydrin is delivered to the plant in dedicated rail cars and is unloaded into two tanks.  Dikes surround the unloading and tank storage areas, and both locations are grounded.  Neither tank is allowed to be more than half full, which allows the transfer of the contents from one to the other during maintenance or an emergency.  Each tank is inspected externally every year and the integrity of the metal walls is routinely examined.  Both the storage and unloading areas are protected by a foaming deluge system that employees can activate remotely.  Firefighting monitor nozzles are located around the tanks, as are remote video cameras.  Epichlorohydrin is completely consumed in the manufacturing of detergent.\n\nThe general accidental release prevention program and chemical-specific prevention steps [40 CFR 68.155(c)]:\n\nThe P&G KC Plant has implemented the Program Level 3 prevention program requirements under the RMP regulations.  The required elements of the RMP prevention program are listed below:\n\n\n\n     Employee Participation\n\n     Process Safety Information\n\n     Process Hazard Analysis\n\n     Operating Procedures\n\n     Contrac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061098,
      "SummaryText": "tors\n\n     Pre-startup Safety Review\n\n     Mechanical Integrity\n\n     Hot Work Permit\n\n     Management of Change\n\n     Incident Investigation\n\n     Emergency Planning and Response\n\n     Compliance Audits\n\n\n\nThese items, their specific requirements, and how the P&G KC Plant complies with the requirements are addressed in the individual procedural documents.\n\n\n\nThe five-year accident history [40 CFR 68.155(d)]:\n\nThe P&G KC Plant has had zero RMP reportable incidents in the previous five years.\n\n\n\nThe emergency response program [40 CFR 68.155(e)]:\n\nIn the event of an incident, the KC Plant has systems to respond quickly.  Processes can be shut down on an emergency basis.  Spills or leaks can be noted immediately and reported to control room operators.  The plant has a direct line to the Kansas City, Kansas Fire Department for quick reporting of releases.  The fire and police departments have developed procedures to communicate instructions to the public in the event that action is needed.  These communications can be carried out either by radio or TV broadcast or through direct communications in the streets.\n\n\n\nThe plant now has a fully functional trained Hazwoper Team that drills regularly.  Additionally, the site conducts regular Community Awareness Emergency Response drills.  Local agencies and response organizations are invited to participate.  Real scenarios are simulated and then reviewed and evaluated by everyone in an effort to improve our response systems and hone the skills of the responders.  This gives the non-P&G emergency responders opportunity to tour the site and improves their relationship and communication with P&G.  All P&G employees who work in the vicinity of Epichlorohydrin have been thoroughly trained in company standard operating procedures for both routine and non-routine operations.  These workers participate in the drills with local emergency preparedness officials as well as conducting table-top exercises within their operating teams.\n\n\n\nPlanned changes to impro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061098,
      "SummaryText": "ve safety [40 CFR 68.155(f)]:\n\nThe KC Plant is committed to improving our safety systems.  In an effort to continually improve our systems, Procter & Gamble has an internal process for reviewing all of our safety systems.  This process is called a Key Element Assessment (KEA).  Additionally, all process changes regarding Epichlorohydrin are reviewed by the site change management team prior to making any change.  This provides expert review from each critical discipline, ie.  personnel safety, environmental, process safety, etc.\n\n\n\nP&G has been a part of this community for over 100 years, and takes very seriously its responsibility to manage its KC Plant in a way that protects its employees and surrounding neighbors.  We have completed this report to provide the public with information about our activities at this plant.  We believe that, given our safety record, the many controls instituted to maintain a safe operation, and our commitment to continuous improvement that an incident affecting our employees or the surrounding area is unlikely to occur.\n\n"
    }
  ]
}