{
  "FacilityID": 1000095986,
  "FacilityName": "Lucy-Woodstock Marine Terminal",
  "FacilityStr1": "181 Stiles Drive",
  "FacilityStr2": null,
  "FacilityCity": "Memphis",
  "FacilityState": "TN",
  "FacilityZipCode": "38127",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47157",
  "LEPC": "Shelby County LEPC",
  "FacilityLatDecDegs": "35.190418",
  "FacilityLongDecDegs": "-090.056366",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "JFLemm@lemmcorp.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Memphis Light, Gas, and Water",
  "Company2Name": null,
  "CompanyDUNS": 98641719,
  "Company2DUNS": 0,
  "OperatorName": "The Lemm Corporation - Operations",
  "OperatorStr1": "P.O. Box 3075",
  "OperatorStr2": null,
  "OperatorCity": "Cordova",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "38088",
  "OperatorZipCodeExt": "3075",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155324",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-09-13 00:00:00",
  "SafetyInspectionBy": "US Coast Guard",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-09-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-09-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-09-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.19831,
  "FRS_Long": -90.05208,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119048,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000095986,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000148886,
          "ProcessID": 1000119048,
          "ChemicalID": 56,
          "Quantity": 7600000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000120381,
          "ProcessID": 1000119048,
          "NAICSCode": "49319",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000102054,
              "Process_NAICS_ID": 1000120381,
              "SafetyReviewDate": "2021-08-25 00:00:00",
              "PHA_Date": "2021-09-01 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-04-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-06-10 00:00:00",
              "TrainingReviewDate": "2021-06-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Monthly Safety Meeting, Computer Based Training (CBT)",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-01-12 00:00:00",
              "EquipmentInspectionDate": "2021-06-07 00:00:00",
              "EquipmentTested": "P-1 Pump Seal",
              "ChangeMgmtDate": "2021-03-05 00:00:00",
              "ChangeMgmtReviewDate": "2021-04-15 00:00:00",
              "PreStartupReviewDate": "2021-04-15 00:00:00",
              "ComplianceAuditDate": "2020-06-29 00:00:00",
              "AuditCompletionDate": "2021-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-06-14 00:00:00",
              "HotWorkPermitReviewDate": "2020-05-28 00:00:00",
              "ContractorSafetyReviewDate": "2021-04-13 00:00:00",
              "ContractorSafetyEvalDate": "2021-04-13 00:00:00",
              "CBI_Flag": 0,
              "Description": "The prevention program elements apply to the anhydrous ammonia system. The anhydrous ammonia system consists of the storage tank, loading, and unloading facilities.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000128147,
                  "PreventionProgram3ID": 1000102054,
                  "ProcessChemicalID": 1000148886
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000095986,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "EMA. TEMA,",
    "CoordinatingAgencyPhone": "9015152525",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000095986,
      "SummaryText": "Lucy-Woodstock Marine Terminal's Commitment to Safety, Accident Prevention and Emergency Response\n\n\n\nLucy-Woodstock Marine Terminal is committed to safe, clean and efficient storage and handling of anhydrous ammonia. The resources invested in accident prevention, such as training personnel and considering safety in the design, installation and operation of our anhydrous ammonia system demonstrate this commitment.\n\n\n\nFacility Description and Substances Handled\n\nLucy-Woodstock Marine Terminal is located at 181 Stiles Drive, Memphis, TN. Lucy-Woodstock loads, unloads, and stores anhydrous ammonia, among other non-RMP commodity chemicals.\n\n\n\nAnhydrous Ammonia is stored in Tank TK-102, a fully refrigerated atmospheric, low-temperature steel storage tank with a capacity of approximately 3,800 standard tons. Anhydrous ammonia enters the facility by barge and leaves by pipeline. Anhydrous ammonia is maintained as a liquid at the facility through continuous refrigeration of the product. An refrigeration system is used to capture, compress, and re-condense the ammonia vapors coming off the storage tank. An flare is used as backup control when the refrigeration system is shutdown for repairs or on loss of power to the facility. Pressure or vacuum relief valves are in place to maintain integrity of the system in the event of an emergency.  Permitted emissions from the ammonia flare include the products of combustion of Carbon Dioxide, Nitrogen, Water, and various NOx.\n\n\n\nGeneral Accidental Release Prevention Program - Specific Steps\n\nLucy-Woodstock Marine Terminal has a comprehensive accidental release prevention program. The program addresses anhydrous ammonia handling that is covered by the EPA's RMP rules and OSHA's Process Safety Management regulations. The accidental release prevention program involves process design, equipment design, and construction to meet all applicable codes and standards. In addition, there are numerous safety systems, such as process controls, warn"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000095986,
      "SummaryText": "ing alarms, and operational controls in place to prevent a release from occurring.\n\n\n\nLucy-Woodstock Marine Terminal has written safety information on the anhydrous ammonia process, equipment and procedures available to all employees who work in the terminal. This includes information on the hazards of anhydrous ammonia, the technology of the processes, and the equipment in the processes. The overall effectiveness of the accidental release prevention programs are assessed via a Process Hazard Analysis (PHA) which has been performed for the anhydrous ammonia system. Process Hazard Analysis provide a method for understanding potential hazardous events, the means by which they occur, and what actions are likely to prevent them from occurring. A team approach is used on the Process Hazard Analysis to evaluate the potential consequences of failures in the ammonia system. The safeguards in place for each hazard are recorded and evaluated on a case-by-case basis. Recommendations are then made to improve safety where the existing safeguards were not considered adequate by the PHA team. A PHA of the ammonia system was completed in 2021 and will be updated on a 5-year cycle.\n\n\n\nThe basis for proper and safe operation of the anhydrous ammonia system are provided by standardized written operating procedures. These procedures define the operating  limits, identify safety and health considerations, and detail the operation and function of safety systems. Specific modes of operation covered are startup, normal operation, emergency and normal shutdown, and temporary operations. To complement the written operating procedures,  Lucy-Woodstock Marine Terminal's employees receive training in specific safety and health hazards, operation of the anhydrous ammonia system, emergency operations, and all applicable safe work practices for the systems.\n\n\n\nLucy-Woodstock Marine Terminal has a mechanical integrity program to ensure that all equipment is regularly inspected and maintained. All i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000095986,
      "SummaryText": "nspections and maintenance operations are documented. \n\n\n\nLucy-Woodstock Marine Terminal has quality assurance measures to ensure that new equipment is suitable for its intended use and that the proper material and spare parts are used when repairs are made. \n\n\n\nLucy-Woodstock Marine Terminal has a comprehensive system to manage change. The management of change (MOC) procedure ensures that any change that is not like-in-kind is documented  and analyzed to ensure that the change is safe. The MOC procedure ensures that all changes are documented, properly authorized, and that all employees whose job tasks will be affected by the change are informed and receive appropriate training prior to the change. \n\n\n\nA pre-startup safety review will be conducted for any new covered process or significant modification to the anhydrous ammonia system. The purpose of these reviews is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared prior to operation. The performance of these safety programs and procedures is monitored through audits, periodic drills and inspections. \n\nLucy-Woodstock Marine Terminal will investigate any incident that results in, or could result in, a release of anhydrous ammonia. These investigations will follow a written procedure and be performed by a site team and possibly a third party auditor or Engineer. The goal of incident investigation is to determine the root cause of the accident and to develop corrective actions to prevent reoccurrence of the accident. All corrective actions taken in response to the investigation team's recommendations will be tracked until complete.\n\n\n\nThe employee participation plan details employee involvement in safety and the prevention program. Lucy-Woodstock Terminal has a contractor safety program to ensure that contractors who work in or adjacent to the anhydrous ammonia system are properly trained and meet safety criteria defined by Lucy-Woodstock Marine Terminal.\n\n\n\nFive Year Acci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000095986,
      "SummaryText": "dent History\n\nAs a result of Lucy-Woodstock Marine Terminal's commitment to safety, there have been no reportable accidents as defined in the RMP rule in the last 5 years.\n\n\n\nEmergency Response Program\n\nTo be prepared for potential fires, Lucy-Woodstock Marine Terminal regularly communicates with the Memphis Fire Department who is contacted by the terminal in the event of an anhydrous ammonia release. Monthly LEPC meetings with the Local Emergency Planning Commission are also attended and the emergency action plan is on file with the Local EMA office. Lucy-Woodstock Marine Terminal has an emergency action plan and employees maintain up to date HAZWOPER training.\n\n\n\nSafety Improvements\n\nTo achieve Lucy-Woodstock Marine Terminal's excellent safety track record, safety improvements have been made over the last decade. These Include:\n\n- installation of fire water monitors\n\n- installation of area gas release detectors\n\n- installation of additional process controls and alarms\n\n- installation of additional video camera monitors\n\n\n\nLucy-Woodstock Marine Terminal will continue to monitor the effectiveness of the prevention programs and provide continuous improvement.  \n\n\n\nNOTE:  Butane was completed removed from the facility in April 2021 and is no longer included in the facility RMPlan.\n\n"
    }
  ]
}