{
  "FacilityID": 1000014379,
  "FacilityName": "Butler Area Sewer Authority Wastewater Treatment",
  "FacilityStr1": "100 Litman Road",
  "FacilityStr2": null,
  "FacilityCity": "Butler",
  "FacilityState": "PA",
  "FacilityZipCode": "16001",
  "Facility4DigitZipExt": "3256",
  "FacilityCountyFIPS": "42019",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "40.841389",
  "FacilityLongDecDegs": "-079.917500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "basapa.org",
  "FacilityEmailAddress": "info@basapa.org",
  "FacilityDUNS": 68718923,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Butler Area Sewer Authority",
  "OperatorStr1": "100 Litman Road",
  "OperatorStr2": null,
  "OperatorCity": "Butler",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16001",
  "OperatorZipCodeExt": "3256",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000155495",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-07-11 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-07-21 00:00:00",
  "DeRegistrationEffectiveDate": "2014-06-01 00:00:00",
  "AnniversaryDate": "2015-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.84141,
  "FRS_Long": -79.91666,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017989,
      "AltID": "Wastewater Treatment",
      "FacilityID": 1000014379,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021313,
          "ProcessID": 1000017989,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000018309,
          "ProcessID": 1000017989,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000012491,
              "Process_NAICS_ID": 1000018309,
              "SafetyReviewDate": "2010-05-18 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2010-05-19 00:00:00",
              "ChangeCompletionDate": "2011-05-19 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Detector/Alarm system with audible/visual alarms and autodialer.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-05-18 00:00:00",
              "TrainingReviewDate": "2010-05-18 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Univar Chemical (chemical supplier) provided training on Kit B and chlorine hazards on 4/27/2006.",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-05-18 00:00:00",
              "EquipmentInspectionDate": "2010-04-21 00:00:00",
              "EquipmentTested": "Chlorinators 1&2 inspected, rebuilt and recalibrated. Chloralert Monitor rebuilt on 07/14/2008. All chlorine system maintenance performed by Total Instrument Maintenance.",
              "ComplianceAuditDate": "2010-05-18 00:00:00",
              "AuditCompletionDate": "2011-05-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Prevention Program for the chlorine storage and handling facilities",
              "_chemicals": [
                {
                  "PrimaryKey": 1000012778,
                  "PreventionProgram2ID": 1000012491,
                  "ProcessChemicalID": 1000021313
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014379,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-05-17 00:00:00",
    "ERTrainingDate": "2006-04-27 00:00:00",
    "CoordinatingAgencyName": "Butler County L.E.P.C.",
    "CoordinatingAgencyPhone": "7242845211",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014379,
      "SummaryText": "Executive Summary, Butler Area Sewer Authority (BASA), RMP 5 Year Submission\n\nAccidental Release and Emergency Response policies at BASA\n\nBASA is committed to safety and follows the concept that safety is never compromised.  This is evidenced through their daily activity, their excellent relationship regarding safety with the operator's union and union stewards, and their excellent safety record. Management's philosophy includes never storing more chemical on site than is needed. For the chlorine usage and storage area they limit access to this area to workers trained in the usage of chlorine; the buddy system is used when change-out of chlorine cylinders is required; even though chlorine monitoring equipment is in continuous use, the operation is visually inspected at least 6 times daily; and, if any safety equipment beyond that required or available is requested by operations, it is supplied.  BASA maintains an excellent relationship with the local fire and emergency response agencies.  These groups have been involved with BASA on a regular basis, which includes training on-site of the operators by the fire department in the use of full-face air supply equipment.\n\nFacility Description and the Regulated Substances Handled\n\nBASA treats approximately 6.9 million gallons per day of raw wastewater at their treatment plant. The chlorine used at the plant is for the purpose of disinfecting the treated water, or effluent, as it leaves the plant.  The chlorine is supplied in one ton containers.  A maximum of three one-ton containers of liquid chlorine are stored on the site.  This is the only chemical substance at this facility that is regulated under the USEPA Accidental Release Prevention Program.\nChlorine containers are thoroughly inspected for mechanical integrity and leaking valves prior to accepting the containers from the supplier.  The containers are off-loaded from the delivery truck at the treatment plant by an overhead crane with a lifting beam that is specially"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014379,
      "SummaryText": " designed for the one-ton containers.  The off-loaded containers are also inspected by BASA personnel.  There are two identical systems that can deliver chlorine gas, at the correct flow rate to the wastewater to be disinfected.  One system is normally active with the other on stand-by. \nThe chlorine gas is drawn from the container by inducing a vacuum in the line after the chlorinator.  The flow of  process water through an injector creates a vacuum in the chlorine supply line and also mixes the chlorine gas with the process water.  If the water to the ejector is stopped for any reason, or the vacuum is lost, the spring loaded gas inlet valve immediately closes to isolate the chlorinator from the chlorine gas supply.  The average chlorine usage is 70 pounds per day.\n\nAccidental Release Prevention\n\nAccidental releases of chlorine are prevented by routine training and adhering to the written operating procedures that cover the chlorination system from the unloading of chlorine containers through the mixing of chlorine gas with the process water.  These procedures cover normal operations and emergency operations where personnel may have to respond to an accidental release of chlorine.  The chlorine system is inspected at least once per shift (usually more often) and leak testing is performed on the valves and fittings when ton containers are changed-out and at other times if a leak is suspected. Employees that are responsible for disconnecting empty containers and connecting filled containers to the chlorination system have been trained on the operating procedures, inspection of valves, fittings, and the connected piping, and leak testing with an aqueous ammonia solution.  Aqueous ammonia reacts with chlorine gas to form a very visible white cloud.  An outside contractor inspects the chlorination system and performs preventive maintenance on the system.  This insures that work or damaged parts are replaced and routine maintenance is performed on the chlorinators and o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014379,
      "SummaryText": "ther equipment.  These preventive measures have resulted in the absence of any accidental relase of chlorine that resulted in personal injury or property damage since the treatment plant began operation. \n\nThe treatment plant maintains four sets of Self-Contained-Breathing Apparatus (SCBA) with extra air tanks and the Chlorine Institutes Emergency Kit B for ton containers.  This equipment is stored in a room that is adjacent to the chlorinator room where the one ton containers are located.  SCBA's are also located in the laboratory and shop areas.  BASA personnel receive regular training on the use of the breathing apparatus and emergency kits. An outside contractor (the chlorine supplier) and the fire department provide this training.  An electronic monitor continuously measures chlorine levels in the storage room and activates an alarm if chlorine is sensed. If the operators do not respond to the alarm in a predetermined length of time, then an auto-dialer is activated which dials a preset list of phone numbers in a particular sequence and at preset timed intervals.\n\nThe Emergency B Kit contains the necessary tools and other equipment to contain valve leaks and repair small holes in a ton container, and capping devices for the fusible plugs in each end of the containers.  \nThe chlorine storage area is equipped with a properly designed exhaust fan/ fresh air intake system.  The fan can be activated by a switch located outside the building.  Two exit doors are provided in the chlorine storage room.\n \nFive Year Accident History\n \nBASA has not had a reportable release of chlorine in the past five years.\n\nEmergency Response Program\n\nThe BASA and the Local Emergency Planning Commmittee for the Emergency Planning district of Butler County have developed an Off-Site Response Plan in the event of an accidental release of chlorine at the treatment plant.  This plan was developed in accordance with the provisions set forth in Title III of the Superfund Amendments and the Rea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014379,
      "SummaryText": "uthorization Act of 1986.  The plan assigns release response procedures to the emergency coordinator at the BASA, Butler County Emergency Control, South Butler and the Lyndora Fire Departments, Local Plice, Emergency Medical Services, and the Butler County Emergency Management Coordinator.  The plan is updated as necessary, including the list of emergency telephone numbers.  The South Butler Fire Department has visited the treatment plant on several occasions and the City of Butler Bureau of Fire has trained BASA personnel on the proper use of the SCBA equipment. If a chlorine leak develops in a ton-container or in the connected piping, valves, or other equipment,a chlorine monitor in the chlorine storage area will activate an audible alarm in both this area and in the remotely located control room building. The control room is manned 24 hours/day and seven days/week.  The treatment plant emergency operating procedures will be followed to determine the severity of the chlorine relase and whether or not the gas may migrate off-site.  If the chlorine release may travel off-site, then the Off-site Response Plan will be activated.  If the chlorine release does not pose a threat to the general public, BASA personnel will repair the leak.  BASA has windsocks installed at 2 locations near the chlorine building to determine the wind direction and the area that is likely to be affected by a chlorine release.  BASA has installed an autodialer as a backup response system. If the monitors sense chlorine and set off the alarm, the autodialer begins to dial an established list of phone numbers, beginning with the operators/control room. A preset amount of time is given for the operators to respond. If the operators do not respond then the dialer calls the other numbers to alert appropriate management/authorities that a potential chlorine release condition exists.\n\nPlanned Changes to Improve Safety\n\nSeveral studies have been conducted to examine mitigation measures to improve safe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014379,
      "SummaryText": "ty at the facility. These studies include the following: Hazard Review and Compliance Audit. Any\noutstanding recommendations from these studies will be addressed by May 2011. "
    }
  ]
}