{
  "FacilityID": 1000039943,
  "FacilityName": "JCUA POTW 2C",
  "FacilityStr1": "1201 Louis Alexis Trail",
  "FacilityStr2": null,
  "FacilityCity": "Gautier",
  "FacilityState": "MS",
  "FacilityZipCode": "39553",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28059",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "30.416667",
  "FacilityLongDecDegs": "-88.633333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "gtp@jcua-ms.us",
  "FacilityDUNS": 139233597,
  "ParentCompanyName": "Jackson County Utility  Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tommy Fairfield",
  "OperatorStr1": "1225 Jackson Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Pascagoula",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39567",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carrie Dennis",
  "RMPTitle": "Operations / Maintenance Manager",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000001730",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-06-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-10-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.41667,
  "FRS_Long": -88.63333,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049254,
      "AltID": null,
      "FacilityID": 1000039943,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000049716,
          "ProcessID": 1000049254,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059740,
          "ProcessID": 1000049254,
          "ChemicalID": 62,
          "Quantity": 3000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000559740,
          "ProcessID": 1000049254,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039943,
      "SummaryText": "                                          GAUTIER RISK MANAGEMENT PLAN\n\n\n\n1.  The accidental release prevention and emergency response policies.\n\n\n\nThe Mississippi Gulf Coast Regional Wastewater Authority's Emergency Response Plan is used to provide clear, consise directions during an emergency.  Its function is to prevent physical harm to the staff, the public, or the plant facilities.\n\n\n\nThis plan is a key to preparedness and was developed using EPA guidelines.  The Emergency Response Plan includes a series of action plans for specific situations and lists emergency supplies, emergency organizations, and emergency telephone numbers.\n\n\n\nThe Emergency Response Plan is comprised of the following action plans for emergency situations:\n\n\n\n*  Emergency Telephone Numbers\n\n*  First Aid Procedures\n\n*  Chemical Emergencies\n\n*  Electrical Emergencies\n\n*  Weather Emergencies\n\n*  Material Safety Data Sheets\n\n\n\nInsofar as possible, every contingency has been covered under the Authority's Emergency Response Plan.\n\n\n\nThe Authority's wastewater treatment facilities have safety systems for the prevention of an accidental release.  These systems include the following:\n\n\n\n*  Leak Detector System\n\n*  Call-Out System\n\n*  Safety Inspections\n\n\n\nThe leak detector system is connected to an audible alarm horn and warning light located on the chlorine/sulfur dioxide storage building.  In the event of a leak, the alarm system will activate and alert plant personnel or the call-out man via the plant's automatic dialing alarm system(ADAS).  Responding personnel then implement the Emergency Response Plan and follow the pertinent procedure.\n\n\n\nThe call-out system provides the Authority with a dedicated employee available 24 hours a day to respond to emergency situations at the wastewater facilities.\n\n\n\nThe safety inspections are conducted by the Safety Committee by use of an inspection check list.  These inspections are conducted on a semi-annual basis.  The inspections are reviewed by each depar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039943,
      "SummaryText": "tment head and any safety infraction is corrected.  The safety inspection ensures that a safe working environment is maintained at all times.\n\n\n\nWith the use of these safety systems, the Authority provides safety of not only plant personnel, but the community around the facilities.\n\n\n\n2.  The stationary source and regulated substance handled.\n\n\n\nGautier Regional Wastewater Treatment plant treats domestic wastewater from the city of Gautier.\n\n\n\nChlorine is applied to the treatment plant effluent for the purpose of disinfection and sulfur dioxide is used for chlorine removal prior to discharge to the West Pascagoula River.\n\n\n\nThe facility stores two one-ton containers of chlorine and two one-ton containers of sulfur dioxide.  This  equates to a four month supply on hand.  The facility operates with one container on line and one container on stand-by.\n\n\n\n3.  The worst-case release scenario:\n\n\n\nThe worst-case release scenario was based on the failure of a storage container containing 2,000 pounds of chlorine, with a 10 minute release time.\n\n\n\nUtilizing urban conditions with a wind speed of 1.5 meters per second, class F stability, the toxic end point would be 0.0087 at a distance of 1.3 miles.\n\n\n\nThe residential population within this distance is 5,000.  Public and environmental receptors within the distance that would be affected include schools, recreational areas, industrial areas, state parks, monuments, and a wildlife refuge.\n\n\n\nAlternate-case release scenario number one:\n\n\n\nThe alternate-case release scenario was based on the failure of a storage container containing 2,000 pounds of chlorine, with a 10 minute release time.\n\n\n\nUtilizing urban conditions with a wind speed of 3.0 meters per second, class D stability, the toxic end point would be 0.0087 at a distance of 0.3 miles.\n\n\n\nThe residential population within this distance is 2,000.  Public and environmental receptors within the distance that would be affected include recreational areas, and a wildlife refuge."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039943,
      "SummaryText": "\n\n\n\nThe chlorine/sulfur dioxide building is covered and partially enclosed.  This minimizes the potential for overheating of the ton container.\n\n\n\nThe gas feeder on the container is designed to shut off the supply of gas in case of a line breakage.\n\n\n\nThe chlorine/sulfur dioxide building is also equipped with a leak detector system.  In the event of a leak, the alarm will activate, alerting the plant personnel.  This provides for immediate response to a leak by plant personnel.\n\n\n\n4.  The acidental release prevention program.\n\n\n\nThere are several key steps to the Gautier Regional Wastewater Treatment plant's prevention plan.\n\n\n\n*  Call-Out System\n\n*  Leak Detector System\n\n*  Safety Inspections\n\n*  Safety Training\n\n\n\n5.  Five-year accident history.\n\n\n\nThe Gautier Regional Wastewater Treatment plant has not had an accidental release of chlorine or sulfur dioxide over the past five years.\n\n\n\n6.  Emergency Response Program.\n\n\n\nThe Authority participates in the Community Right to Know, SARA Title III, Tier 2.  This is provided to the Mississippi Emergency Management Agency, the Jackson County Civil Defense, and the Gautier Fire Department.\n\n\n\n7.  Safety Improvements.\n\n\n\nIn April, 1999, the Authority installed a new chlorine and sulfur dioxide leak detector to monitor the ton cylinder storage area for any chlorine or sulfur dioxide leaks.  Also, an existing chlorine leak detector inside the feed control station was replaced with an upgraded leak detector.  With the addition of the new leak detectors at the ton cylinder storage area, this provides a complete chlorine and sulfur dioxide leak detector monitoring system.  In August 2006, upgraded chlorine and sulfur dioxide regulators and vacuum sensors were installed."
    }
  ]
}