{
  "FacilityID": 1000022949,
  "FacilityName": "Seneca Foods Corporation",
  "FacilityStr1": "430 7th Avenue South",
  "FacilityStr2": "P. O. Box 232",
  "FacilityCity": "Buhl",
  "FacilityState": "ID",
  "FacilityZipCode": "83316",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16083",
  "LEPC": "Twin Falls County LEPC",
  "FacilityLatDecDegs": "42.597889",
  "FacilityLongDecDegs": "-114.749054",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "senecafoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2207322,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Seneca Foods Corporation",
  "OperatorStr1": "430 7th Avenue South",
  "OperatorStr2": "P. O. Box 232",
  "OperatorCity": "Buhl",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83316",
  "OperatorZipCodeExt": null,
  "FTE": 273,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000117571",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-07-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-07-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-07-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.597889,
  "FRS_Long": -114.749054,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000028025,
      "AltID": null,
      "FacilityID": 1000022949,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000033488,
          "ProcessID": 1000028025,
          "ChemicalID": 56,
          "Quantity": 70000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000028325,
          "ProcessID": 1000028025,
          "NAICSCode": "31141",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000024165,
              "Process_NAICS_ID": 1000028325,
              "SafetyReviewDate": "2011-07-06 00:00:00",
              "PHA_Date": "2011-06-23 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-05-10 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "addition of new small [2011] expansion freezer",
              "OpProceduresReviewDate": "2011-07-06 00:00:00",
              "TrainingReviewDate": "2011-05-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-05-13 00:00:00",
              "EquipmentInspectionDate": "2011-06-13 00:00:00",
              "EquipmentTested": "Pressure Test",
              "ChangeMgmtDate": "2011-02-07 00:00:00",
              "ChangeMgmtReviewDate": "2011-05-13 00:00:00",
              "PreStartupReviewDate": "2011-05-13 00:00:00",
              "ComplianceAuditDate": "2011-06-08 00:00:00",
              "AuditCompletionDate": "2012-05-31 00:00:00",
              "IncidentInvestigationDate": "2011-04-20 00:00:00",
              "InvestigationChangeDate": "2011-12-30 00:00:00",
              "ParticipationPlansReviewDate": "2011-05-13 00:00:00",
              "HotWorkPermitReviewDate": "2011-05-13 00:00:00",
              "ContractorSafetyReviewDate": "2011-05-02 00:00:00",
              "ContractorSafetyEvalDate": "2011-04-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000028650,
                  "PreventionProgram3ID": 1000024165,
                  "ProcessChemicalID": 1000033488
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000022949,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Buhl City Fire Department",
    "CoordinatingAgencyPhone": "2085435664",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000022949,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Seneca Foods Corporation Buhl, Idaho, facility is a seasonal canned and frozen vegetable processor.   Principal products include canned baby whole carrots and sweet corn, frozen sugar snap peas and frozen sweet corn products.  The facility also operates a year round dry storage warehouse, a labeling center for canned products, a frozen corn on the cob packaging operation, and a 102,000 square foot frozen storage warehouse.  Approximately 60,000 pounds of anhydrous ammonia is used as a refrigerant.  It is policy of Seneca Foods Corporation to assure safe and healthful working conditions for every employee and to comply fully with all applicable laws and regulations including OSHA Process Safety Management and Federal Emergency Planning and Right-to-Know Act.  Seneca Foods Corporation will provide adequate safeguards against health and safety hazards by providing a safe work environment, job training and instruction on safe procedures, making personal protective gear available, and proper administration of safety programs and activities.  To reduce the risk of accidental ammonia release there are engineering and mechanical safeguards in place including physical barriers to protect ammonia lines and vessels, high level cutoff controls, relief valves, and a PLC based monitoring and operating system with built in alarms and controls.\n\nThe facility is composed of three (3) separate and independent (they do not share/exchange ammonia between each other) refrigeration systems.  The original and primary system is the largest and holds over 50,000 pounds of ammonia.  The second system (an expansion freezer) was added in 1995 and holds approximately 9,500 pounds of ammonia.  The final system is another expansion freezer and it also holds approximately 9,500 pounds of ammonia.  The two expansion freezers are similar in design, but not exactly the same.  Due to the proximity of the expansion freezers to the origi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000022949,
      "SummaryText": "nal system and due to the possible simultaneous damage that could happen in the event of a major train derailment, the expansion freezers were all considered part of the original system (as managements of change) and the Risk Management Plant (RMPlan) for the original system was resubmitted with the creation of each to reflect this.\n\nThe facility uses ammonia as a refrigerant within a closed system.  Ammonia is a hazardous substance that must be handled properly in order to prevent accidental releases and injuries.  It is the policy of Seneca Foods Corporation to conduct all operations (including the ammonia refrigeration system) in a safe manner.  This policy extends to all employees and contractors at the facility.  Seneca Foods Corporation implements this policy towards chemical and general safety through on going employee participation, training, written operating procedures, maintenance, inspections, safety committee meetings, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  In the event of an ammonia accident, the facility has an Emergency Action Plan to notify the appropriate authorities and safely evacuate the facility.\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nSeneca Foods is located at 430 7th Avenue South, in Buhl, Idaho.  The facility is approximately 0.3 miles north of Idaho Highway 30.  The area immediately surrounding the facility is rural with a mixture of residential areas, farmland, and light commercial areas.  \n\nThe ammonia refrigeration system is a closed system that cycles the refrigerant from liquid to gas and back again. The system, consisting of vessels, piping, valves, and process equipment, cycles 60,000 pounds of ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to accommodate the processing and storage of seasonal canned and frozen vegetables."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000022949,
      "SummaryText": "Changes in pressure are directly related to changes in temperature: lowering the ammonia pressure lowers its temperature.  Low pressure (cold) liquid ammonia provides refrigeration by removing heat from the cold rooms.  Transferring heat to the ammonia causes the liquid ammonia (contained within the system) to vaporize.  Heat is later removed from the ammonia and discharged to the atmosphere as it is condensed back into a liquid.  Typical operating conditions range from approximately 11 Hg on the low pressure side of the system to 150 psig on the high side.  \n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAdministrative Measures:\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\nAÂ¿\tEPA's Risk Management Program (RMP); and\nAÂ¿\tOSHA's Process Safety Management (PSM); \n\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on site workers.  The following summarizes the key compliance programs that have been implemented by Seneca Foods Corporation to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Safe Work Practices program ensures that Seneca Foods Corporation employees and contractors follow Lockout / Tagout, Hazard Communication, Hot Work (e.g. w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000022949,
      "SummaryText": "elding), and Chemical and General Safety Procedures in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\n\nThe facility also operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\nAÂ¿\tIIAR Bulletin 107, Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie ins\nAÂ¿\tIIAR Bulletin 109, Minimum Safety Criteria for a Safe Ammonia Refrigeration System \nAÂ¿\tIIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\nAÂ¿\tIIAR, A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\n\nEngineering Measures:\nThe Seneca Foods Corporation ammonia refrigeration system has many safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.\n\nOther safety features of the ammonia refrigeration system include: emergency shutdown switches that kill power to the equipment, relief valves on all pressure vessels, and continuous ventilation (controlled by a thermostat) in the Production Engine Room to prevent explosions. The facility has also installed ammonia sensors at strategic locations throughout the facility which will:\n\n20 ppm:\tActivates the visual alarm (yellow light) in the Engine Room and at the Engine Room doors and turns on the exhaust fans to low speed.  Display the warning alarm on Citect.\n\n25 ppm:\tThe visual alarm (yellow light) in the Engine Room and at the Engine Room doors remains active. Activates the audible alarm in the Engine Room and turns the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000022949,
      "SummaryText": "exhaust fans to high speed.  Display alarm on Citect.\n\nFIVE YEAR ACCIDENT HISTORY\n\nAn investigation into the accident history of the facility revealed that there have been no significant releases of ammonia at the facility that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material in the past five years (May 2006 - May 2011).\n\nEMERGENCY RESPONSE PROGRAM\n\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \n\nAÂ¿\tsave lives;\nAÂ¿\tminimize and avoid injuries;\nAÂ¿\tprotect the environment; and\nAÂ¿\tminimize property damage.\n\nThe Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM/RMP regulations.  Facility personnel receive annual training regarding the emergency procedures.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nA Process Hazard Analysis (PHA) was performed on May 10-11, 2011.  These studies generated mitigation measures (recommendations) to improve safety at the Seneca Foods Corporation facility in Buhl, Idaho.  The mitigation measures include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  The Seneca Foods Corporation safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. \tContinue to train all employees in the facility Safety Plan/Programs.\n\n2. \tContinue to have employee involvement in Safety Plan Development.\n\n3. \tContinue employee involvement through safety team participation.\n\n4. \tContinue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}