{
  "FacilityID": 1000098253,
  "FacilityName": "Sunoco Partners Mktg.&Term. Washington GA Terminal",
  "FacilityStr1": "228 Dixie Wood Road",
  "FacilityStr2": null,
  "FacilityCity": "Washington",
  "FacilityState": "GA",
  "FacilityZipCode": "30673",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13317",
  "LEPC": "Wilkes County LEPC",
  "FacilityLatDecDegs": "33.7052",
  "FacilityLongDecDegs": "-82.7535",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sunoco Partners Marketing and Terminals LP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sunoco Partners Marketing Terminals",
  "OperatorStr1": "228 Dixie Wood Road",
  "OperatorStr2": null,
  "OperatorCity": "Washington",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30673",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jack Frost",
  "RMPTitle": "Sr. Manager - Terminal Ops.",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000189299",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-31 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-12-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-12-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-12-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-12-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000121683,
      "AltID": "Butane Transloading",
      "FacilityID": 1000098253,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000123056,
          "ProcessID": 1000121683,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000152349,
          "ProcessID": 1000121683,
          "ChemicalID": 118,
          "Quantity": 1300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000652349,
          "ProcessID": 1000121683,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000098253,
      "SummaryText": "Washington, GA Butane Transloading\n\nRMP EXECUTIVE SUMMARY\n\n\n\nSunoco Partners Marketing & Terminals (SPM&T) Washington Terminal was constructed in accordance with the National Fire Protection Association (NFPA Code) #58 for Liquified Petroleum Gas Storage, and it is the facility's policy to adhere to all applicable federal, state, and local laws/codes.\n\n\n\nWashington Terminal is a Butane transloading facility (specifically, butane railcar to truck tanker via a portable transloader).  This Risk Management Program (RMP) covers the butane transfer systems only, including the associated piping and eight (8)  33,600 gallon storage tanks detached railcars.  Washington Terminal can store up to eight (8) butane railcars at a time. \n\n\n\nTwo requirements of this section specifically apply to operations at the Facility:\n\n1. Purpose and General Duty Clause - The essence of the general duty clause is that an owner/operator that stores and uses hazardous chemicals in any quantity has a fundamental obligation to ensure a safe operation and to have plans in place in the event of an accident to appropriately manage the situation.\n\n\n\nSPM&T is committed to ensuring the safe operation of the Facility, as well as all of its other operations, to ensure a safe workplace for employees and a safe location for neighbors in the community. SPM&T has procedures in place to prevent accidents and is committed to emergency preparedness both for the Facility and community-wide and coordinates with the Washington Fire Department.\n\n\n\n2. Risk Management Plan - The primary function of the Facility is to act as a flammable liquid storage and distribution facility. Due to\n\nthe flammable effects associated with butane, it is necessary to observe certain safety precautions to prevent unnecessary human\n\nexposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community.\n\nThe Facility is strongly committed to employee, public, and environmental safety and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000098253,
      "SummaryText": " health. Safety at the Facility depends on the\n\nmanner in which flammable substances are handled as well as the various safety devices incorporated into the design of the\n\nprocesses. Furthermore, comprehensive training is provided to employees and contractors which reinforces the safety policies and\n\nprocedures of the Facility. Programs have been established to help prevent any accidental releases and to train personnel for\n\nemergency response in the event of a release.\n\n\n\nSPM&T has implemented safety precautions and procedures designed to prevent and mitigate catastrophic releases. SPM&T has active operating, maintenance, training and inspection procedures. Sunoco provides annual emergency response training to its employees. \n\nSPM&T's management is committed to the following:\n\n- Preventing accidents;\n\n- Training our employees in correct response procedures in the event of an accident;\n\n- Participating in community emergency preparedness;\n\n- Addressing any citizen concerns by fully explaining potential hazards associated with SPM&T operations and all steps being taken\n\nto prevent and mitigate accidents; and\n\n- Being a good corporate citizen in Wilkes County\n\n\n\nWashington Terminal complies with the U.S. Environmental Protection Agency's (EPA) Accident Prevention Rules (40 CFR Part 68 Subpart D), the Occupational Safety & Health Administration (OSHA) Process Safety Management (PSM) standard (29 CFR Part 1910.119) along with its fourteen (14) compliance elements, and all applicable state and local laws and regulations.  The Butane transloading system is designed, constructed and maintained in accordance with NFPA #58, manufacturer's instructions and Energy Transfer/SPM&T specifications.  Railcars meet the U.S. Department of Transportation Federal Railroad Administration design requirements for pressurized tank cars. \n\n\n\nIn the event of an emergency involving the Washington Terminal's Butane transloading system, it is the policy of the facility to initially contact Wash"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000098253,
      "SummaryText": "ington Fire Department and request their assistance.  The facility has no trained fire brigade or hazardous material response team, but outside services may be called in to assist.  The facility emergency response plans are coordinated with the Washington Fire Department and Wilkes Emergency Management Administration (EMA).  The Washington Fire Department is aware of the system, available protection systems (site fire extinguishers, emergency shut-off devices) and Emergency Response Procedures at the facility.  The Washington Transloading facility is a non-responding facility.\n\n\n\nThis facility is owned by SPM&T, however the transloading equipment is operated by Grammer, a contract operator.  SPM&T does not have full time employees officed at this location, but SPMT operations makes site visits as needed.  \n\n\n\nThe Terminal has not had any accidental releases during the past five years that meet the criteria for an accidental release as discussed in 40 CFR 68.42.\n\n\n\nIn an effort to improve and promote system safety, Energy Transfer looks for and seeks employee input on process safety improvements.  Additionally, the Washington Fire Department is contacted annually regarding participation in site emergency response drills which involve potential releases.   \n\n\n\nWith these objectives in mind, the Risk Management Plan has been developed to provide information regarding the management of the risks associated with the flammable substance storage process. Above all, SPM&T stresses its commitment to ensuring a safe working environment for employees, visitors and the community.\n\n"
    }
  ]
}