{
  "FacilityID": 1000004721,
  "FacilityName": "Hain Celestial Group",
  "FacilityStr1": "700 Old Fern Hill Rd.",
  "FacilityStr2": null,
  "FacilityCity": "West Chester",
  "FacilityState": "PA",
  "FacilityZipCode": "19380",
  "Facility4DigitZipExt": "4206",
  "FacilityCountyFIPS": "42029",
  "LEPC": "Chester County LEPC",
  "FacilityLatDecDegs": "39.977778",
  "FacilityLongDecDegs": "-075.587778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 45263092,
  "ParentCompanyName": "The Hain Celestial Group, Inc",
  "Company2Name": null,
  "CompanyDUNS": 4318846,
  "Company2DUNS": 0,
  "OperatorName": "The Hain Celestial Group, Inc",
  "OperatorStr1": "58 South Service Rd",
  "OperatorStr2": null,
  "OperatorCity": "Melville",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "11747",
  "OperatorZipCodeExt": null,
  "FTE": 93,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000044908",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-04-30 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-08-13 00:00:00",
  "DeRegistrationEffectiveDate": "2019-08-12 00:00:00",
  "AnniversaryDate": "2014-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.96944,
  "FRS_Long": -75.59167,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000005730,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000004721,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000006413,
          "ProcessID": 1000005730,
          "ChemicalID": 56,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000005958,
          "ProcessID": 1000005730,
          "NAICSCode": "31141",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000004270,
              "Process_NAICS_ID": 1000005958,
              "SafetyReviewDate": "2009-03-16 00:00:00",
              "PHA_Date": "2009-03-24 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-09-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-04-14 00:00:00",
              "TrainingReviewDate": "2009-04-14 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2003-10-28 00:00:00",
              "EquipmentInspectionDate": "2009-06-04 00:00:00",
              "EquipmentTested": "Refrigeration components",
              "ChangeMgmtDate": "2006-09-24 00:00:00",
              "ChangeMgmtReviewDate": "2009-04-15 00:00:00",
              "PreStartupReviewDate": "2006-09-24 00:00:00",
              "ComplianceAuditDate": "2009-04-14 00:00:00",
              "AuditCompletionDate": "2010-04-01 00:00:00",
              "IncidentInvestigationDate": "2003-10-17 00:00:00",
              "InvestigationChangeDate": "2003-10-20 00:00:00",
              "ParticipationPlansReviewDate": "2009-04-15 00:00:00",
              "HotWorkPermitReviewDate": "2009-04-15 00:00:00",
              "ContractorSafetyReviewDate": "2009-04-15 00:00:00",
              "ContractorSafetyEvalDate": "2009-04-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Hain Celestial Group, West Chester is in compliance with OSHA Standard 29 CFR 1910.119, Process Safety Management for Highly Hazardous Chemicals",
              "_chemicals": [
                {
                  "PrimaryKey": 1000004991,
                  "PreventionProgram3ID": 1000004270,
                  "ProcessChemicalID": 1000006413
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000004721,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-03-26 00:00:00",
    "ERTrainingDate": "2009-03-28 00:00:00",
    "CoordinatingAgencyName": "Chester County LEPC",
    "CoordinatingAgencyPhone": "6103445000",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000004721,
      "SummaryText": "Purpose\n\nTo properly contain, treat, and dispose of ammonia generated during maintenance and repair of refrigeration systems and to prevent unauthorized releases of ammonia or ammonia water to the environment.\n\nApplicability\n\nThis procedure applies to all Heinz facilities that operate ammonia refrigeration systems.\n\nProcedure\n\nOther than a failure of an ammonia refrigeration system, the most likely occasion when ammonia may be released is during maintenance and repair of system components.  The primary concerns during ammonia system maintenance are to ensure safe working conditions and prevent atmospheric releases of ammonia.  During maintenance, liquid and gaseous ammonia must be removed from equipment and pipelines.  The following steps summarize the procedures that can be used by factories to prevent release of liquid or gaseous ammonia during routine maintenance and repairs.  Each factory should have available a more detailed procedures on transferring or removing liquid ammonia in their PSM manuals or in applicable IIAR Bulletins.  IIAR Bulletin No. 107 provides guidelines for Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Plant Tie-ins.\n\n\nEvacuation\n\nA.Procedure for routine evacuation when dual stage ammonia system is operational.\n\n1.Use valves to isolate the component requiring maintenance.\n2.Connect pump-down hose between the isolated section and the low-pressure side of the ammonia system.\n3.Evacuate the isolated section by transferring the ammonia to the low-pressure side.\n4.Verify pressure is zero in isolated section. If possible allow the system to stand for several hours or overnight to allow the residual liquid ammonia to vaporize.\n5.After an appropriate period of time re-check for zero pressure before opening the isolated section for maintenance.   \n\n\nB.Procedure for non-routine evacuation when ammonia system is shut down.\n1.Use valves to isolate the component requiring maintenance.\n2.Use a portable pump-down unit (either "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000004721,
      "SummaryText": "truck or skid-mounted) to transfer ammonia from the isolated section to a secure storage vessel.  This may be a temporary storage vessel or tanker truck.\n3.Verify pressure is zero in isolated section.  If possible allow the system to stand for several hours or overnight to allow the residual liquid ammonia to vaporize.\n4.After an appropriate period of time re-check the pressure for zero before opening the isolated section for maintenance. \n\nIn the above two procedures, if all ammonia is transferred to a secure portion of the system or a temporary storage vessel the likeliness of a release should be minimal.\n\nContingency Planning\n\nFor emergency situations refer to procedures outlined the IIAR Manual Appendix 1, Emergency Discharge of Ammonia Refrigerant for more detail.  This manual covers discharge to either atmosphere or to a water diffusion system.  \n\nOnly under exceptional circumstances should ammonia be allowed to discharge without controls.  If discharge is necessary, it should be controlled by a water diffusion system. Use of a water diffusion system should include the following additional procedures:\n\nA.Know the pathway that ammonia water will take in the event of overflow.  Never allow ammonia water to discharge to the storm water drainage system.\n\nB.In advance of any routine or emergency activity that may require the discharge of ammonia water to the sewer system, arrange to meet with wastewater system operators, either local municipal or on-site.  Topics should include the following:\n\n1.Ammonia system description, operation, and routine M&R procedures;\n2.Ammonia characteristics and hazards, particularly in water solution;\n3.Possible ammonia discharge scenarios, including emergency situations;\n4.Determine if ammonia water must be neutralized and/or diluted before discharge to process drains;\n5.Determine if ammonia water must be metered into process drains;\n6.Inform the operators that you will notify them if and when a discharge is necessary;\n7.Seek written "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000004721,
      "SummaryText": "response, especially from municipality, documenting the conditions of discharge.\n\n\n\nDischarge requirements may vary depending on capability and limitations of the wastewater treatment system to handle ammonia.  Generally, discharge permits require the pH to be within a neutral range before discharge.  Ammonia water has a high pH.  .  In some cases the municipality may allow discharge of ammonia water if it is metered and diluted.  However, neutralizing the ammonia water either before or during discharge ensures compliance with the permit. You must also remember that, most permits do not allow discharge of slug loads.\n\nRetention and Treatment\n\nIf the factory has no on-site treatment capability, the ammonia water will likely have to be retained and neutralized before discharge to the city sewers.  If the factory has an on-site pH control system or biological treatment system, the ammonia water can be neutralized while it is discharged, but it must be metered to prevent overload of the treatment system.\n\nA.Based on the discharge conditions identified above determine how the ammonia water at your facility will be collected and disposed.  There may be more than one scenario depending on the location of ammonia system components with regard to process sewers.\n\nB.Procedure for evacuation of residual gaseous ammonia from lines by capture and temporary detention of all ammonia water in vessels:\n\n1.Set up vessels (either drums or tank) within a secure secondary containment basin or vessel; fill primary vessels with water.  Plan for about two gallons of water for every pound of ammonia to be dissolved.\n2.Connect a hose to the isolated section of the ammonia system and immerse the open end of the hose in the water vessel.\n3.Open the valve and bubble the residual ammonia into the water vessel.\n4.Monitor the bubbling process and use as many water vessels as necessary to absorb residual ammonia.  (If ammonia gasses from the water vessel, it is either saturated or the rate of bubbl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000004721,
      "SummaryText": "ing is too high.)\n5.Determine if the ammonia water must be neutralized before release to process sewers.  If so add enough acid-based reagent to each vessel to reduce pH to neutral (7.0) or within the range specified in the permit.  Use appropriate instruments to verify pH.\n6.If required, notify operators at wastewater treatment plant that ammonia water will be discharged through the process sewers per conditions determined during contingency planning.\n7.Meter neutral ammonia water to process drain to dilute and to prevent a slug load discharge to the sewers.\n8.If it is not necessary to neutralize ammonia water, meter it directly into the process drain to prevent slug load to sewers.\n9.Continue until all vessels are empty, including any ammonia water collected in the secondary containment basin.\n10.Neutralize and meter any overflows of ammonia water captured in the secondary basin.\n\nC.Procedure for continuous neutralization and/or disposal of ammonia water.  The disposal process depends upon the capability to neutralize ammonia water on-site.\n\n1.Before commencing a continuous release of ammonia water, know the pathway it will follow and make sure there are no related safety issues.\n2.Notify operators at wastewater treatment plant that ammonia water will be discharged through the process sewers per conditions imposed under Section C.\n3.Set up a vessel in a location that will overflow to process sewers and fill with water.  Keep the water on so there is continuous flow.  Plan for about two gallons of water for every pound of ammonia.\n4.Connect a hose to the isolated section of the ammonia system and immerse the open end of the hose in the water vessel.\n5.Adjust flow of dilution water to ensure ammonia is absorbed.  Monitor the vessel to prevent any ammonia from gassing off.  \n6.Monitor the on-site wastewater treatment system to verify that pH of all discharged water is within permit limits.\n\nReferences\n\nDocuments\n\n1.International Institute for Ammonia Refrigeration, B"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000004721,
      "SummaryText": "ulletin No. R1, Good Practices for the Operation of an Ammonia  Refrigeration System.\n2.International Institute for Ammonia Refrigeration, Bulletin No. 107, Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Plant Tie-ins.\n3.    International Institute for Ammonia Refrigeration, Appendix A, Emergency Discharge of Ammonia Refrigerant.\n\n\nNone\n\n"
    }
  ]
}