{
  "FacilityID": 1000047890,
  "FacilityName": "Stovall Water Treatment Plant",
  "FacilityStr1": "50 Pleasant Retreat Road",
  "FacilityStr2": null,
  "FacilityCity": "Travelers Rest",
  "FacilityState": "SC",
  "FacilityZipCode": "29690",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45045",
  "LEPC": "Greenville County LEPC",
  "FacilityLatDecDegs": "35.009975",
  "FacilityLongDecDegs": "-082.461430",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Greenville Water",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Greenville Water",
  "OperatorStr1": "50 Pleasant Retreat Road",
  "OperatorStr2": null,
  "OperatorCity": "Travelers Rest",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29690",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jeff Couch",
  "RMPTitle": "Plant Superintendent",
  "FTE": 39,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167115",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-07-21 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-09-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-12-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.00811,
  "FRS_Long": -82.46094,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "84",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059789,
      "AltID": "Chlorination",
      "FacilityID": 1000047890,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000060890,
          "ProcessID": 1000059789,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073193,
          "ProcessID": 1000059789,
          "ChemicalID": 62,
          "Quantity": 56000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000573193,
          "ProcessID": 1000059789,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047890,
      "SummaryText": "Stovall Water Treatment Plant\n\n\n\n1.Accidental release prevention and emergency response policies:\n\nThe Stovall Water Treatment Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. Accidental release prevention is a function of the safety devices (technology) inherent in the facility design, safe material handling practices used (procedures), and commitment to training of plant employees (management practices). All applicable requirements of the U.S. Environmental Protection Agency (EPA) Risk Management Prevention Program (40 CFR 68.65-87) are adhered to. It is the goal of the Stovall Water Treatment Plant to ensure plant and community safety through an aggressive program of hazard analysis, preventive maintenance, equipment testing, standard operating procedures, and employee training.\n\n\n\nThe Stovall Water Treatment Plant emergency response is included in the community emergency response plan.   Emergency response plan procedures incorporate notification of the Greenville County HAZMAT Team (off-site mutual aid response), LEPC (community response plan), and SCDHEC (state response plan). The Table Stovall Water Treatment Plant program is based upon recommendation of the American Water Works Association (AWWA) and the Chlorine Institute and is in compliance with the EPA Risk Management Emergency Response Program (40 CFR 68.90) requirements.\n\n\n\n2.Stationary source and regulated substances handled:\n\nThe regulated substance handled and used at the Stovall Water Treatment Plant is chlorine. \n\n\n\nThe Stovall Water Treatment Plant provides potable water for residential, retail, and industrial use through out the Greenville Water service area. Chlorine is used in the water treatment process to destroy nuisance and pathogenic microorganisms in the raw water supply (i.e., chlorine use as a water supply disinfectant is an industry standard). The chlorination process includes chlorine container "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047890,
      "SummaryText": "handling and storage facilities, chlorine feed system (vacuum chlorinators, piping, and injectors), safety system (chlorine gas srubber, and leak detection) and related instrumentation. The Stovall Water Treatment Plant is manned 24-hours a day and access to the plant site is restricted to authorized personnel.\n\n\n\n3.General accidental release program and the chemical-specific prevention steps:\n\nThe Stovall Water Treatment Plant complies with EPA's RMP rule, OSHA's Process Safety Management standard (29 CFR 1910.119), and with all applicable state and local codes and regulations. The chlorination process was constructed, and is operated, in accordance with recommendations of the AWWA and Chlorine Institute. The Stovall Water Treatment Plant accidental release prevention program is based on the following key elements:\n\n\n\no  High level of training for operators and maintenance personnel\n\no  Equipment inspection, testing, and preventive maintenance\n\no  Use of \"industry standard\" process and safety equipment\n\no  Use of accurate and effective operating procedures\n\no  Performance of hazard review of equipment and procedures\n\no  Implementation of an internal and external auditing program\n\no  Segregation of chemical processes for compatibility and fire prevention/control\n\no  Chlorine leak detectors, alarms, and scubber system\n\no  Availability of chlorine container leak repair kit\n\no  Maintenance of approved parts inventory\n\n\n\n4.Five-year accident history:\n\nThe Stovall Water Treatment Plant had no reportable accidents in the previous five-years. \n\n\n\n5.Emergency Response Program:\n\nThe Stovall Water Treatment Plant has an emergency response plan that is integrated with the LEPC plan. The Stovall Water Treatment Plant maintains a mutual aid agreement with the Greenville County HAZMAT Team to provide emergency response services in the event of a chlorine release. The plant emergency procedures include notification of offsite mutual aid responders, LEPC, SCDHEC, and the public alo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047890,
      "SummaryText": "ng with a discussion of actions to be taken in the event of a chlorine release. The plan also addresses first aid and medical treatment.\n\n\n\n7.Planned changes to improve safety:\n\nThe Stovall Water Treatment Plant plans to continue to evaluate the regulated process as required under the PSM / RMP standards to ensure safe operations."
    }
  ]
}