{
  "FacilityID": 1000067769,
  "FacilityName": "Henningsen Cold Storage Co.-Twin Falls DC",
  "FacilityStr1": "391 Victory Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Twin Falls",
  "FacilityState": "ID",
  "FacilityZipCode": "83301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16083",
  "LEPC": "Twin Falls County LEPC",
  "FacilityLatDecDegs": "42.554600",
  "FacilityLongDecDegs": "-114.486280",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.henningsen.com",
  "FacilityEmailAddress": "info@henningsen.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Henningsen Cold Storage Co.",
  "Company2Name": null,
  "CompanyDUNS": 7873243,
  "Company2DUNS": null,
  "OperatorName": "Henningsen Cold Storage Co.",
  "OperatorStr1": "21435 NW Cherry Lane",
  "OperatorStr2": null,
  "OperatorCity": "Hillsboro",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97124",
  "OperatorZipCodeExt": "6630",
  "FTE": 101,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000201952",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-06-22 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-06-18 11:34:14",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-02-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-02-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-09-01 00:00:00",
  "DeRegistrationEffectiveDate": "2021-08-31 00:00:00",
  "AnniversaryDate": "2023-02-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.554633,
  "FRS_Long": -114.486482,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Source is below the regulated substance TQ. The TQ has not ever been reached.",
  "_processes": [
    {
      "ProcessID": 1000085014,
      "AltID": "Refrigeration",
      "FacilityID": 1000067769,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106043,
          "ProcessID": 1000085014,
          "ChemicalID": 56,
          "Quantity": 9667.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000086195,
          "ProcessID": 1000085014,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000071741,
              "Process_NAICS_ID": 1000086195,
              "SafetyReviewDate": "2017-05-16 00:00:00",
              "PHA_Date": "2018-02-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-08-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-07-26 00:00:00",
              "TrainingReviewDate": "2016-06-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-07-26 00:00:00",
              "EquipmentInspectionDate": "2017-06-14 00:00:00",
              "EquipmentTested": "Heat exchangers",
              "ChangeMgmtDate": "2017-03-29 00:00:00",
              "ChangeMgmtReviewDate": "2016-10-28 00:00:00",
              "PreStartupReviewDate": "2016-04-24 00:00:00",
              "ComplianceAuditDate": "2015-07-21 00:00:00",
              "AuditCompletionDate": "2017-12-01 00:00:00",
              "IncidentInvestigationDate": "2015-10-06 00:00:00",
              "InvestigationChangeDate": "2015-10-12 00:00:00",
              "ParticipationPlansReviewDate": "2016-01-20 00:00:00",
              "HotWorkPermitReviewDate": "2017-06-21 00:00:00",
              "ContractorSafetyReviewDate": "2017-04-06 00:00:00",
              "ContractorSafetyEvalDate": "2017-01-18 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000089086,
                  "PreventionProgram3ID": 1000071741,
                  "ProcessChemicalID": 1000106043
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000067769,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-11-20 00:00:00",
    "ERTrainingDate": "2017-12-07 00:00:00",
    "CoordinatingAgencyName": "Twin Falls Fire Department",
    "CoordinatingAgencyPhone": "2087357236",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067769,
      "SummaryText": "RISK MANAGEMENT PROGRAM-ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nHenningsen Cold Storage Co. (HCS) Twin Falls, Idaho Distribution Center facility is a public refrigerated warehouse.  The facility maintains freezer storage spaces of nearly 7 million cubic ft. which are used to store perishable products.  Storage areas at the facility operate at -5°F to 0°F.  The facility has fourteen truck loading and unloading spots and three railcar spots to facilitate the transportation of products.  A mechanical refrigeration system, utilizing anhydrous ammonia as a refrigerant, is used to maintain desired temperatures.  The refrigeration system operates in a closed loop; the ammonia is not mixed with other chemicals.\r\n\r\nFACILITY CONSTRUCTION:  The facility was designed and constructed in accordance with mechanical and building codes in effect at the time of the various phases of construction.  These codes outline requirements for the safe installation and operation of ammonia refrigeration systems.\r\n\r\nSAFETY FEATURES:  The ammonia refrigeration system has many safety features.  Safeties include, but are not limited to: pressure relief valves, stop valves, ammonia detectors, a computerized refrigeration monitoring and control system, as well as trained and experienced operators.  Much of the safety associated with the system is inherent in the policies and procedures that govern its operation.   For example, the facility operates in accordance with the OSHA Process Safety Management standard (29 CFR 1910.119) and the EPA Risk Management Program (40 CFR Part 68). \r\n\r\nMANAGEMENT COMMITMENT TO SAFETY:  Management takes safety very seriously and mandates that the facility maintains a safe working environment for employees, visitors, neighbors, and products at all times.  Employees are trained on all safety issues relative to their duties and are made aware of all required safety programs.  \r\n\r\nA Safety Committee has been established at the facility.  Committee members are hourly empl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067769,
      "SummaryText": "oyees, supervisors and/or management. The primary responsibility of the Safety Committee is to address and resolve safety issues.  In order to accomplish this, the committee periodically conducts inspections to identify unsafe conditions and/or procedures that may exist in the facility.  Additionally, the committee receives suggestions from co-workers and evaluates them for implementation and resolution.\r\n\r\nManagement is committed to providing all necessary resources to ensure that all elements within the regulations are adhered to.\r\n\r\nMANAGEMENT SYSTEM:  A Management System has been developed to ensure that all elements of the PSM and RMP regulations are implemented.   Each person outlined in the responsibilities section of the management system is assigned various tasks and is expected to participate in the development and implementation of the programs.  \r\nVarious employees work as a team to ensure that:  \r\n1. Employees participate in the development and implementation of the programs.\r\n2. Employees aid in gathering Process Safety Information.\r\n3. Employees participate in the Process Hazard Analysis, and recommendations are addressed in a timely manner.\r\n4. Operating procedures are developed, implemented, and certified annually.\r\n5. Appropriate training is provided to all employees.\r\n6. Contractors are qualified to work on or near the refrigeration system and trained on potential hazards associated with the system.\r\n7. Pre-Startup Safety Reviews are performed on all new and modified systems prior to placing ammonia into the system.\r\n8. Mechanical Integrity Inspections are performed as required.  All deficiencies are noted and addressed in a timely manner.\r\n9. A Hot Work program is implemented and all persons affected by the hot work are aware of potential hazards.\r\n10. A Management of Change program is in place, and the appropriate documentation is completed prior to the implementation of changes. \r\n11. Incident Investigations are performed on accidental ammonia"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067769,
      "SummaryText": "releases as well as near-misses.  Resolutions and corrective actions are documented. \r\n12. An Emergency Action Plan is developed and employees trained on it.  The plan is reviewed and certified at least annually.\r\n13. Compliance Audits are performed and recommendations are addressed in a timely manner.\r\n\r\nFIVE YEAR ACCIDENT HISTORY:  There have been no reportable ammonia related accidents, incidents or releases at the facility during the past five years.  \r\n\r\nEMERGENCY ACTION PROGRAM:  The facility has established an Emergency Action Plan.  The Plan explains what actions employees, contractor employees, and visitors are to take in the event of an emergency which include steps to take in the event of a fire, earthquake, tornado, etc. \r\nThe Emergency Action Plan states that all employees shall: \r\n1. Initiate an evacuation by activating the public announcement (PA) system and/or two-way radios.\r\n2. Notify the appropriate emergency responders. \r\n3. Assist in a safe and orderly evacuation. \r\n4. Gather at the designated assembly area(s) for a head count.  \r\n\r\nIn the event of an ammonia release, employees are instructed to follow the steps as noted above.  Maintenance employees that have been properly trained on the usage of the hand-held ammonia detector may use it, along with the proper PPE, and the buddy system in an attempt to locate the ammonia leak.  In the event that readings on the detector approach 300 parts per million employees are instructed to evacuate immediately to the designated assembly area, report all findings to Supervisors and/or Management and wait for further instruction.    \r\n\r\nThe Emergency Action Plan is reviewed and updated at least once per year. \r\n\r\nPREVENTION PROGRAM 3:  \r\n1. Employee Participation:  The Chief Engineer, Assistant Engineer(s), and Management are actively involved in the development and implementation of PSM and RMP programs.  Employees gather process safety information, develop and implement operating procedures, qualify contra"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067769,
      "SummaryText": "ctors, participate in the process hazard analysis, and the resolution of all PHA/compliance audit recommendations.  \r\n\r\n2. Process Safety Information:  Piping and Instrumentation Diagrams have been developed, and all piping and major components of the ammonia refrigeration system have been identified.  Information has been gathered to enable employees to identify and understand the potential hazards of the system.  The process safety information includes the Material Safety Data Sheet (MSDS) for anhydrous ammonia.   An ammonia inventory is collected and retained in the PSI Library.  Relief Valves are identified and labeled.  System equipment is operated according to good engineering practices.  \r\n\r\n3. Process Hazard Analysis:  A formal study of the ammonia refrigeration system with management, safety, and maintenance personnel was conducted using the What If/Checklist method to evaluate the potential hazards of the system.  A recommendation summary is used to track completion of all recommendations. \r\n\r\n4. Operating Procedures:  Written standard operating procedures (SOPs) have been developed and implemented to ensure safe operation of the refrigeration system.  SOPs are annually re-certified by the Chief Engineer or qualified designee.   \r\n\r\n5. Training:  The Chief Engineer and Assistant Engineer(s) are trained on all aspects of the ammonia system.  Each Engineer is required to attend various types of training relative to the ammonia system and/or their respective duties and tasks.  All engineering employees are incentivized to achieve either RETA CARO/CIRO certification.\r\n\r\n6. Contractors:  Contractors are screened and evaluated prior to performing work on or near the ammonia refrigeration system.  Contractors receive documented training on the safety and hazards of the system and are required to meet with the Chief Engineer prior to working on the system.  \r\n\r\n7. Pre-Startup Safety Review (PSSR):  A PSSR includes policy and procedures as well as a checklist to en"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000067769,
      "SummaryText": "sure that all documents relating to the PSSR are collected, reviewed and retained.  Each Engineer is trained on the PSSR.     \r\n\r\n8. Mechanical Integrity:  Mechanical Integrity policy and procedures have been implemented at this facility.  Mechanical Integrity Inspections are performed annually.  Engineers conduct daily walk-through inspections and maintain system log sheets.  They generate preventative maintenance work orders and conduct periodic vibration, oil, and thermal imaging analyses of system components.  \r\n\r\n9. Hot Work Permits:  A Hot Work Permit program is in place at this facility which requires a hot work permit form to be completed prior to working on or near the process. \r\n\r\n10. Management of Change (MOC):  A MOC system has been implemented.  Changes to the process are completed using the Management of Change policies and procedures. \r\n\r\n11. Incident Investigation:  All incidents and near-misses are investigated, reviewed, and documented using an incident investigation form.  Deficiencies noted during the de-briefing are addressed in a timely manner.\r\n\r\n12. Emergency Planning and Response:  HCS employees do not actively respond to non-incidental ammonia releases. Thus, an Emergency Response Plan is not required.\r\n\r\n13. Compliance Audits:  Audits are conducted every three years by an outside consultant to ensure that all elements are in compliance with PSM and RMP requirements.  \r\n\r\n14. Five-Year Accident History:  No ammonia related incidents have occurred at this facility in the past five years.   \r\n\r\n15. Description of plans to improve safety:  Continuous safety improvement is a key component of HCS core values.  HCS plans to improve safety by developing our associates through training and education, encouraging our employees to identify hazards and assist in the abatement process, identifying new technologies and giving careful consideration to their implementation, and continually refining our PSM and RMP programs."
    }
  ]
}