{
  "FacilityID": 1000062661,
  "FacilityName": "CORMETECH",
  "FacilityStr1": "3300 OLD TASSO ROAD NE",
  "FacilityStr2": null,
  "FacilityCity": "CLEVELAND",
  "FacilityState": "TN",
  "FacilityZipCode": "37312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47011",
  "LEPC": "Bradley County LEPC",
  "FacilityLatDecDegs": "35.170894",
  "FacilityLongDecDegs": "-84.836063",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A3",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cormetech.com",
  "FacilityEmailAddress": "greenesl@cormetech.com",
  "FacilityDUNS": 123676566,
  "ParentCompanyName": "Corning",
  "Company2Name": null,
  "CompanyDUNS": 1307735,
  "Company2DUNS": 0,
  "OperatorName": "Mr. Stacy Greene",
  "OperatorStr1": "3300 Old Tasso Rd",
  "OperatorStr2": null,
  "OperatorCity": "Cleveland",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37312",
  "OperatorZipCodeExt": null,
  "FTE": 125,
  "OtherEPAFacilityID": "5858108",
  "EPAFacilityID": "100000234962",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-05-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-03-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-03-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-03-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-11-29 00:00:00",
  "DeRegistrationEffectiveDate": "2017-03-30 00:00:00",
  "AnniversaryDate": "2022-03-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "RMP filed in error; not subject to the Clean Air Act's Risk Management Program",
  "_processes": [
    {
      "ProcessID": 1000078572,
      "AltID": "28-30% Ammonium Hydoxide",
      "FacilityID": 1000062661,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000097659,
          "ProcessID": 1000078572,
          "ChemicalID": 57,
          "Quantity": 46000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000079755,
          "ProcessID": 1000078572,
          "NAICSCode": "327999",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000049190,
              "Process_NAICS_ID": 1000079755,
              "SafetyReviewDate": "2017-03-03 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "API 2000-1998, API RP 576-2009",
              "FR_Comments": "ANSI/IIAR-2-1984 for MOC",
              "HazardReviewDate": "2017-03-03 00:00:00",
              "ChangeCompletionDate": "2017-05-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "9000 gallon concrete containment, pressure relief is vented to ammonia scrubber",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-06-28 00:00:00",
              "TrainingReviewDate": "2017-03-17 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-03-17 00:00:00",
              "EquipmentInspectionDate": "2017-03-17 00:00:00",
              "EquipmentTested": "pumps and piping appurtenances visually inspected biweekly",
              "ComplianceAuditDate": "2017-03-23 00:00:00",
              "AuditCompletionDate": "2017-03-23 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "PROGRAM LEVEL 2 PREVENTION PROGRAM (from Doc.No. CLE-3028 CLEVELAND AMMONIUM HYDROXIDE ENVIRONMENTAL RISK MANAGEMENT PLAN)\n\n\n\nSAFETY INFORMATION\n\n\n\nA copy of the SDS for ammonium hydroxide from the current supplier is in Appendix 3 at end of this document.\n\nThe maximum intended storage is 7200 gallons or 90% of tank capacity.\n\n\n\n\n\nTemperature: The ammonium hydroxide liquid shall not be artificially heated and is expected to remain roughly at average daily outside temperatures. The ammonium hydroxide tank is rated for temperatures down to -20F.  The liquid temperature of the ammonium hydroxide shall not exceed 100 F. \n\n\n\nPressure: The ammonium tank pressure shall not exceed 25 psig; as this would result in unnecessary gas discharge into the ammonia scrubber nor shall the tank be placed under vacuum.\n\n\n\nEquipment Specifications/Standards:  \n\nTank capacity: 8000 gal.\n\nMOC (tank and piping): Stainless Steel 316\n\nConstructed: 2001\n\nNormal Operating Pressure: 10 - 60 inches-water (0.4 - 2 psig)\n\nMax Allowed Working Pressure: 25 psig @ 125F\n\nMin Design Metal Temperature: -20 F @ 25 psig\n\nTwin close-coupled non-overloading suction pumps with SS casing and SS impeller\n\nPump rating: up to 20 gpm flow\n\nTwin 2? pressure relief valves routed to wet scrubber - 25 psig, 150# flanged \n\nAll tank/piping materials comply with ANSI/IIAR-2-1984 (no copper, brass, or mercury)\n\nThe secondary concrete containment is sized to >110% of tank capacity (>9000 gallons) to comply with International Fire Code and best engineering practices.\n\n\n\nHAZARD REVIEW\n\n\n\nAmmonium Hydroxide liquid in open air produces toxic ammonia vapors which can have serious acute respiratory health effects in high concentrations.  \n\nAmmonium Hydroxide liquid can produce chemical burns to eyes and skin.  \n\nUnexpected spills and releases of ammonium hydroxide can result in personnel injury and risk to the surrounding community. \n\n\n\nApplicable exposure limits to ammonia vapors are 35 ppm for 8-hr (TOSHA) and 300 ppm IDLH. \n\n\n\nWhile the flammability risk is very low with ammonium hydroxide solutions, it should be noted that hydrogen gas may be released as a product of combustion.\n\n\n\n\n\nOpportunities for accidental spills and releases exist during primarily from human error during tank loading and ammonium hydroxide system maintenance. \n\n\n\n1.    The tanker delivery driver hooks up wrong chemical to ammonium hydroxide line or attempts to add to a full vessel; thus over filling tank or tanker delivery driver pumps in an excessive amount of ammonium hydroxide and overfills tank. \n\nControl 1. The liquid connection point stays locked at all times when not loading and keys are maintained by environmental technicians.  This ensures oversight by properly trained personnel before and during bulk loading activities.\n\nControl 2. Audible tank high level alarm will sound if level rises above expected maximum level.\n\nControl 3. Both digital and sight glass tube are monitored simultaneously for tank level during bulk loading. \n\nControl 4.  Ammonium hydroxide delivery vendor is required to have emergency stop for truck mounted pump to facilitate quick response to overfill.\n\nControl 5. The overflow piping is routed to a wet ammonia scrubber which would significantly reduce any airborne ammonia release. Liquid then flows to a 6000 gal holding tank. \n\nControl 6.  By procedure, the Quality Department approves the certificate of analysis from the ammonium hydroxide vendor before any loading commences.\n\n\n\nOpportunity for Improvement 1.  Two labels on the ammonium hydroxide tank read ?Ammonia?. This could conceivably result in improper ammonia concentration being transferred to the ammonium hydroxide tank if the administrative controls fail. Recommendation is to correct labels to read ?29% Ammonium Hydroxide?\n\n\n\n2.    A mistake in the tanker truck unloading process results in a leak on the truck unload pad.\n\nControl 1. Procedures require tanker to be positioned on the truck unload pad for unload.  Environmental technician will not unlock tank load lines until tanker truck is properly positioned.\n\nControl 2.  Tanker truck unload pad is designed to direct spilled liquid into the adjacent truck containment pit.  Said pit will contain >110% of a full tanker truck load.\n\nControl 3.   Tanker truck unload pad is covered to prevent rain water from spreading any leaked liquid chemicals if unloading during inclement weather.\n\nControl 4.  Environmental technician places small portable containment below hose connection points and oversees unloading process. \n\n\n\n3.    A pump or valve in ammonium hydroxide system fails creating a leak.\n\nControl 1.  Pumps and valves are inspected biweekly per the Maintenance section of this procedure.\n\nControl 2.  Ammonium hydroxide tank and isolation valves are located inside secondary concrete containment; thus containing any leaked material.\n\nControl 3.  An ammonia leak monitor is installed inside containment.  The monitor triggers an audible alarm if leak is detected.\n\nControl 4.  Ammonium hydroxide system emergency stops are located at the loading point and remotely to promote quick response to leak alarm.\n\n\n\n4.    A mistake in isolating the ammonium hydroxide pumps during maintenance or servicing results in leak either by the pump energizing or liquid from ammonium hydroxide lines \n\nControl 1. Pumps in the ammonium hydroxide system are duplicated to facilitate local isolation of one pump without taking the other out of service.\n\nControl 2.  A specific Lockout/Tagout Work Instruction exists for isolating and securing ammonium hydroxide flow to the pumps.\n\nControl 3.  Doc. No. CLE-WI-1010 Cleveland Ammonium Hydroxide System Maintenance Work Instruction governs proper preparation techniques and safeguards for ammonium hydroxide piping work.\n\nControl 4.  Ammonium hydroxide system emergency stops are located near the tank and remotely to promote quick response to alarm.\n\nControl 5. Ammonia awareness training is delivered every two years and has been added to new employee training regimen. \n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000049956,
                  "PreventionProgram2ID": 1000049190,
                  "ProcessChemicalID": 1000097659
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000062661,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-11-21 00:00:00",
    "ERTrainingDate": "2015-01-15 00:00:00",
    "CoordinatingAgencyName": "Bradley County EMA",
    "CoordinatingAgencyPhone": "4237287289",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062661,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nCormetech Cleveland Operations owns an 8000 gallon above ground storage tank containing Ammonium Hydroxide (aka Aqua Ammonia).  Due to the potential for toxic vapors to be released upon a spill or release a chemical specific risk management plan is warranted.  Risk Management of this process is controlled by Cormetech procedure CLE-3028 CLEVELAND AMMONIUM HYDROXIDE ENVIRONMENTAL RISK MANAGEMENT PLAN.  Contained within this document are the following aspects pursuant to management of this risk:\n\n\n\n(a)    Accidental Release Prevention and Emergency Response Policies\n\nPrevention of both liquid and vapor releases of ammonium hydroxide and emergency response thereto are governed by procedures within CLE-3028 CLEVELAND AMMONIUM HYDROXIDE ENVIRONMENTAL RISK MANAGEMENT PLAN and Doc. CLE-3015 Cleveland Preparedness Prevention, & Contingency Plan.  The Primary or Secondary Emergency Coordinator will be the immediate point of contact and incident command in such event.  The timing and level of notification for all off-normal events is governed by the Cleveland Operations Escalation Plan \n\n(b)    Stationary Source and regulated substance(s) handled\n\nThe stationary source is an 8000 gallon above ground storage tank located on the north side of the Cormetech manufacturing facility located at 3300 Old Tasso Rd, Cleveland TN.  This tank can contain up to 60,000 lb of ammonia (conc 20% or greater) which exceeds the threshold quantity (20,000 lbs) for this substance under section 112(r) of the Clean Air Act.\n\n(c)    Accidental Release Prevention Program\n\nAccidental releases from this stationary source are prevented via maintenance, monitoring, employee training and supervised material transfers.\n\n(d)    5-Year Accident History\n\nNo accidental spills or releases have occurred with this stationary source in the prior 5 years.\n\n(e)    Emergency Response Program\n\nA trained onsite Hazardous Material Response Team under the direction of the Emergency Coordinator will respond to small "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062661,
      "SummaryText": "ammonium hydroxide spills deemed within facility capability by the Emergency Coordinator.  Spills deemed beyond the facility capability or likely affecting public receptors will be assisted by external services as described herein.\n\n(f)    Planned changes to improve safety\n\nAll labels on Ammonium Hydroxide Tank will be changed to read '29% Ammonium Hydroxide'.  The current labels 'Ammonia' and 'Ammonium Hydroxide' increase the risk that the incorrect strength of ammonium hydroxide could be mistakenly loaded into tank.  \n\n(g)    Offsite consequence analysis\n\nThe offsite consequence for worst-case scenario could result in a toxic endpoint distance of 0.7 miles. More likely alternative scenarios would likely result in toxic endpoints less than 528 feet.\n\n"
    }
  ]
}