{
  "FacilityID": 1000039331,
  "FacilityName": "Longhorn Gas Plant",
  "FacilityStr1": "4023 N FM 51",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "TX",
  "FacilityZipCode": "76234",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48497",
  "LEPC": "Wise County LEPC",
  "FacilityLatDecDegs": "33.311389",
  "FacilityLongDecDegs": "-97.526667",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Targa Gas Processing, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Targa Gas Processing, LLC",
  "OperatorStr1": "1000 Louisiana, Suite 4300",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000224811",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "106793",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-03-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-03-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-10-28 00:00:00",
  "DeRegistrationEffectiveDate": "2020-10-28 00:00:00",
  "AnniversaryDate": "2019-03-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048301,
      "AltID": "Gas Processing Plant",
      "FacilityID": 1000039331,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000058699,
          "ProcessID": 1000048301,
          "ChemicalID": 155,
          "Quantity": 135750.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000050930,
              "ProcessChemicalID": 1000058699,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000050931,
              "ProcessChemicalID": 1000058699,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000050932,
              "ProcessChemicalID": 1000058699,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000050933,
              "ProcessChemicalID": 1000058699,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000050934,
              "ProcessChemicalID": 1000058699,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000050935,
              "ProcessChemicalID": 1000058699,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000048742,
          "ProcessID": 1000048301,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039331,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-02-15 00:00:00",
    "ERTrainingDate": "2014-02-15 00:00:00",
    "CoordinatingAgencyName": "Wise County Emergency Planing Comm.",
    "CoordinatingAgencyPhone": "9406272458",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039331,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n\n\nIntroduction and Policies\n\n\n\nThe Longhorn Gas Processing Facility, owned and operated by Targa Processing, LLC (\"Targa\"), is committed to the same brand of safety and environmental excellence that all other Targa assets promote. This philosophy involves making each and every employee and contractor accountable for their own safety as well as that of the community around them. As a company, we follow a close adherence to all applicable federal, state and local laws to ensure a safe and healthy environment for all. \n\n\n\nEmployees who enter the Targa facility complete a thorough training, both in the classroom and on-the-job, that enables them to address emergency issues as they arise. This preparation includes standard operational, emergency operational, and release prevention training. In addition, periodic refresher courses help to keep operators' problem solving abilities up to date and in sync with our recurring safety improvements. Our regular internal audits provide an excellent checks and balances system for monitoring these high standards that we set.\n\n\n\nThe plant is a gas processing facility. The Targa Longhorn Gas Plant operates a variety of processes to recover natural gas liquids from natural gas. There are no threshold quantities of toxic substances present. The facility is classified as Program Level 1 under the regulation. The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release should occur, our 5 year accident history (new facility, so no incident history), and our planned changes to improve safety at the facility.\n\n\n\nWorst Case and Alternative Release Scenarios\n\n\n\nAs specified by the U.S. Environmental Protection Agency (EPA) RMP Regulations, our worst-case release scenario for flammables would be the loss of all of the pressurized NGL from the product surge tan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039331,
      "SummaryText": "k, with a subsequent vapor cloud explosion. \n\n\n\nAn alternate release scenario is not required for a Program Level 1 facility.\n\n\n\nWe have discussed these potential hydrocarbon releases with our employees and with local emergency response officials in Wise County, thereby further reducing the possibility of any impact on the public.\n\n\n\nPrevention Program\n\n\n\nThe following is a summary of the accident prevention program in place at the Targa Longhorn Gas Plant. The processes at the plant are regulated by the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) and are also subject to the OSHA PSM. Since the facility is subject to Program Level 1 requirements, the overall prevention program is complying with the emergency management requirements in the regulation (see next paragraph).\n\n\n\n\n\nEmergency Response Program\n\n\n\nIn the event of an emergency involving our facility, it is our policy to follow our Emergency Action Plan, which is linked with the Wise County Emergency Response Plan. Activation of this emergency response plan sets in motion a pre-planned series of events that notify all area emergency response agencies. Emergency response agencies are notified on the 911 system and directly. The 911 call is channeled through the Wise County Sheriff's Department. All agencies and personnel respond to predetermined staging areas with representatives from each agency reporting to the Central Command Post (CP). A contingency plan is developed and executed using trained industry personnel along with other emergency response personnel from responding agencies, as needed.\n\n\n\nEmployees of this facility are issued copies of the Emergency Action Plan when initially hired and the plan is reviewed periodically. All of our operators at this facility have had the appropriate emergency response training as mandated by the OSHA standard. This plan and our emergency response policy have also been discussed with the local fire departments.\n\n\n\n\n\nPlanned Changes to Impro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039331,
      "SummaryText": "ve Safety\n\n\n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the Targa Longhorn Gas Plant. Some of the key components of the safety improvements we expect to achieve are as follows:\n\n\n\n    The Management of Change provisions ensures that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n\n\n\n    The Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n\n\n\n"
    }
  ]
}