{
  "FacilityID": 1000062140,
  "FacilityName": "Fremont Ice Packaging Facility",
  "FacilityStr1": "43960 Fremont Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Fremont",
  "FacilityState": "CA",
  "FacilityZipCode": "94538",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06001",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "37.511503",
  "FacilityLongDecDegs": "-121.949328",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.arcticglacier.com",
  "FacilityEmailAddress": "info@arcticglacier.com",
  "FacilityDUNS": 63551873,
  "ParentCompanyName": "Arctic Glacier USA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Arctic Glacier USA",
  "OperatorStr1": "43960 Fremont Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Fremont",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94538",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Humphries",
  "RMPTitle": "Senior Plant Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177211",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-23 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-02-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-02-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-02-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.51155,
  "FRS_Long": -121.95117,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077889,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000062140,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000079091,
          "ProcessID": 1000077889,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096876,
          "ProcessID": 1000077889,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000596876,
          "ProcessID": 1000077889,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062140,
      "SummaryText": "This PSM/RMP document has been developed for the Arctic Glacier USA facility located at 43960 Fremont Boulevard in Fremont, California.  This document has been prepared to satisfy multiple regulations and is governed by the following agencies:\n\n\n\n?    California Office of Emergency Services (Cal-OES), California Code of Regulations, Title 19, Division 2, Chapter 4.5, California Accidental Release Prevention (CalARP) Program.\n\n\n\n?    EPA Risk Management Prevention Program (RMP), 40 CFR Part 68.\n\n\n\n?    Cal-OSHA Process Safety Management (PSM), 8 CCR ?5189.\n\n\n\nThe purpose of this document is to:\n\n\n\n?    Increase the protection of public health, the environment, and facility employees by ensuring proper emergency response and mitigation procedures when handling regulated substances.\n\n\n\n?    Assist Arctic Glacier USA - Fremont and local government agencies in their communication and coordination efforts to improve facility safety while handling regulated substances.\n\n\n\nThis document addresses Arctic Glacier USA - Fremont's administrative and operational programs to prevent accidents related to regulated substances and to reduce potential risks.  The regulated substance of concern and focus of this document is anhydrous ammonia. The facility utilizes an ammonia system to provide refrigeration for the production and storage of ice.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nArctic Glacier USA is a leading producer, marketer and distributor of high-quality packaged ice to consumers in Canada and the United States, primarily under the brand name of Arctic Glacier Premium Ice. Arctic Glacier operates 45 production plants and 49 distribution facilities across Canada and the northeastern, central and western United States servicing more than 75,000 retail accounts. \n\n\n\nArctic Glacier USA is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062140,
      "SummaryText": "design, installation, operation, maintenance, and employee training associated with the process equipment at the facility. \n\n\n\nArctic Glacier USA senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. Arctic Glacier USA - Fremont's safety and environmental policies as they relate to the ammonia refrigeration system are administered by the Plant Manager, who conducts inspections of the facility to ensure compliance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Arctic Glacier USA - Fremont facility is located at 43960 Fremont Blvd., in Fremont, California, at the intersection of Auto Mall Parkway and Fremont Boulevard, approximately 0.6 miles west of Freeway 680 and 1.0 mile east of Freeway 880. The area immediately surrounding the facility is urban.   \n\n\n\nThe primary business of Arctic Glacier USA - Fremont is the production and storage of ice. In order to conduct operations, the facility maintains a refrigeration system containing approximately 15,000 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for the production and storage of ice.  Typical operating conditions range from 10 psig on the low pressure side of the system to 140 psig on the high side.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the California Occupational Safety and Health Administration (CalOSHA) Process Safety Management (PSM) standard (Section 5189 of Title 8, CCR) and the EPA Risk Management Program (RMP).  This pre"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062140,
      "SummaryText": "vention program covers those processes that handle ammonia above the threshold quantity of either PSM or RMP rules.\n\n\n\nThe prevention program provides a structured approach to preventing accidents.  Some of the specific activities in the prevention program include:\n\n\n\n?    Process safety information is provided to all applicable employees upon hire and is accessible at all times.\n\n?    In depth process hazard analysis are completed every five years by qualified personnel using techniques approved under the PSM standard.\n\n?    Written operating procedures (kept up to date) are used for training and guiding the work of operators.\n\n?    Training is provided to all employees upon hire, and refresher training is given at least every three years or upon request.\n\n?    Operators, mechanics, and contractor personnel are qualified, trained in the general hazards in the facility, and informed of any temporary situations affecting safety.\n\n?    Pre-startup safety reviews are conducted to insure that conditions for safe operation have been satisfied prior to starting new or modified equipment.\n\n?    A program is in place to maintain the mechanical integrity of the process, which includes written procedures, training requirements, equipment deficiency requests for employees, work orders, scheduled maintenance, and documentation.\n\n?    A hot work permit system assures that work is done safely and properly.\n\n?    A management of change system is in place to ensure that changes are managed safely.\n\n?    Incidents are investigated and actions are taken as part of a continuous improvement effort.\n\n?    Routine audits are conducted to assure that safe practices are being followed.\n\n\n\nThis systematic approach to process safety involves employees and strives for continuing improvements in overall safety.  The training, qualifications, and safety awareness of our operations, maintenance, and management personnel are a key element in reducing and mitigating accidents.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nEPA's RMP regulation"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062140,
      "SummaryText": " defines \"accident\" as the following:\n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nBased on the above definition and an investigation into the facility's accident history conducted at the time of the Process Hazard Analysis Revalidation study (January 27, 2017), there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (January 2012 - January 2017).\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Arctic Glacier USA - Fremont facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP/CalARP document. This Plan was designed to meet the following objectives:\n\n\n\n  1.)  To save lives.\n\n  2.)  To minimize and avoid injuries.\n\n  3.)  To protect the environment.\n\n  4.)  To minimize property damage.\n\n\n\nThe facility maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  In addition, the Emergency Action Plan outlines notification procedures and reporting procedures in the event of an emergency, which could include fire, ammonia release, blackout, and earthquake. This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations.\n\n\n\nIn the event of an ammonia emergency, the facility plans "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000062140,
      "SummaryText": "to evacuate all employees and contractors and activate the facility's action plan to respond to the situation.  If necessary, they will alert the local emergency responders (fire department) for assistance. The facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazards Analysis Revalidation, conducted on January 27, 2017, provided mitigation measures to improve safety at the Arctic Glacier USA - Fremont facility.  The Arctic Glacier USA - Fremont safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n"
    }
  ]
}