{
  "FacilityID": 1000043170,
  "FacilityName": "Nutrien Ag Solutions",
  "FacilityStr1": "1801 Broadway Street",
  "FacilityStr2": null,
  "FacilityCity": "Marseilles",
  "FacilityState": "IL",
  "FacilityZipCode": "61341",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17099",
  "LEPC": "Lasalle County LEPC",
  "FacilityLatDecDegs": "41.318611",
  "FacilityLongDecDegs": "-088.676944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 249568056,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dale K. Johnson",
  "OperatorStr1": "1801 Broadway Street",
  "OperatorStr2": null,
  "OperatorCity": "Marseilles",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61341",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dale Keith Johnson",
  "RMPTitle": "Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000096914",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "099050AAN",
  "SafetyInspectionDate": "2014-05-09 00:00:00",
  "SafetyInspectionBy": "Illinois Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2022-01-26 00:00:00",
  "DeRegistrationEffectiveDate": "2021-12-13 00:00:00",
  "AnniversaryDate": "2019-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 41.31694,
  "FRS_Long": -88.67528,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053226,
      "AltID": "Wholesale ammonia sales",
      "FacilityID": 1000043170,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053990,
          "ProcessID": 1000053226,
          "NAICSCode": "42459",
          "_desc": {
            "NAICS_CODE": "42459",
            "NAICS_DESCRIPTION": "Other Farm Product Raw Material Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064597,
          "ProcessID": 1000053226,
          "ChemicalID": 56,
          "Quantity": 80000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564597,
          "ProcessID": 1000053226,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043170,
      "SummaryText": "I.    Introduction\n\nA Risk Management Program has been implemented at the Nutrien Ag Solutions facility located at 1801 Broadway Street in Marseilles, Illinois, for the reduction of accidental releases of hazardous materials. This updated, five (5) year Risk Management Plan (RMP) summarizes the management, administrative, procedural, and technological controls that work together to minimize the risk to site personnel, contractors, visitors, and the community and environment at large of hazardous chemical releases. The RMP is organized to correspond with specific U.S. Environmental Protection Agency (EPA) RMP, Program 3 of 40 CFR 68, definitions and requirements of Subpart G, including: \n\n?    Introduction;\n\n?    Nutrien Ag Solutions policies to protect health, environment, and safety;\n\n?    Facility identification and regulated substances covered processes;\n\n?    Hazard Assessment;\n\n?    Prevention Program;\n\n?    Five-Year Accident History;\n\n?    Emergency Response Plan; \n\n?    Emergency Communications;\n\n?    Spill Reporting / Environmental Release Procedures;\n\n?    Planned changes to improve safety; and\n\n?    Management Program\n\n\n\nII.    Nutrien Ag Solutions Policies To Protect Health, Environment, and Safety\n\nRisk management and safety are important concerns at Nutrien Ag Solutions; this RMP formalizes and documents these activities. Nutrien Ag Solutions is committed to conducting its operations in a safe and responsible manner and to reducing risks to human health and to the environment. It is Nutrien Ag Solutions's policy to comply with all applicable federal, state, and local rules and regulations.  This updated risk management plan is being submitted to comply with EPA 40 CFR 68 requirements to submit a risk management plan, every five (5) years.\n\n\n\nThis RMP has identified potential hazards and has taken steps to design and maintain a safe facility in order to prevent releases, and minimize the consequences of accidental releases, which could occur. RMP addresses potentially catastrophic chemical r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043170,
      "SummaryText": "eleases that could result in immediate harm and acute health effects to offsite receptors (public and environmental). Nutrien Ag Solutions has developed an Emergency Response Plan (ERP) that contains procedures designed to maximize the safety of all employees, contractors, and visitors in the event of an emergency and also guard against environmental consequences.\n\n\n\nIII.    Facility Identification\n\nThe Nutrien Ag Solutions facility is located at 1801 Broadway Street in Marseilles, Illinois.  The facility is operated as both a dry and liquid terminal with storage of agricultural fertilizer materials and anhydrous ammonia in two liquid storage tanks.  Sales from this facility are from agricultural anhydrous ammonia and fertilizer solutions.  The NAICS code for the facility is 42459. \n\n\n\nThe amount of ammonia currently present on-site is stored in two liquid storage tanks with a capacity of approximately 20,000 tons each, for a total of 40,000 tons (80,000,000 lbs.). \n\n\n\nAn aerial map identifying the site location is included as Appendix A. \n\n\n\nIV.    Hazard Assessment - Worse Case Scenarios (WCS)\n\nAppendix B consists of the RMP*Submit Printout and contains additional information on the worst-case scenario.  Appendix C consists of the offsite consequence analysis data and maps for the worse case release scenario. \n\n\n\nV.    Hazard Assessment - Alternative Release Scenarios (ARS)\n\nAppendix B consists of the RMP*Submit Printout and contains additional information on the alternative release scenario.  Appendix D consists of the offsite consequence analysis data and maps for the alternative release scenario. \n\n\n\nVI.    General Accidental Release Prevention Program\n\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the OSHA Process Safety Management (PSM) standard (29 CFR 1910.119) and the EPA Risk Management Program.   However, as discussed throughout this document Nutrien Ag Solutions is continuously working on improving this prog"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043170,
      "SummaryText": "ram. \n\n\n\nThis prevention program covers those processes that handle ammonia above the threshold quantity for both PSM and RMP rules. The next audit of the PSM program will occur by March 27, 2014, in compliance with the requirement to conduct PSM audits every three years.  The elements of the PSM / Program 3 prevention program and a brief description are listed below.\n\n?    Employee Participation - Nutrien Ag Solutions has updated a site-specific employee participation plan that ensures employees and their representatives are consulted when conducting and developing process hazard analyses and other information required to be developed under the PSM/RMP regulation.  In addition, the employee participation program ensures that employees and their representatives have access to process hazard analyses and all other information required to be developed under PSM/RMP.  \n\n?    Process Safety Information - Nutrien Ag Solutions maintains a site-specific PSI program that ensures information pertaining to the hazards, technology, and equipment of the process are properly developed and maintained. Process safety information for the ammonia process has been compiled and was last reviewed during the March 27, 2014 compliance audit.\n\n?    Process Hazard Review - Nutrien Ag Solutions has updated a site-specific PHA program that ensures a PHA is conducted initially, at a minimum of every five (5) years, and whenever a change is significant enough to require a change in PSI.  In addition, this program ensures PHAs are conducted in accordance with OSHA and EPA regulations and ensures findings and recommendations of PHAs are properly documented. Nutrien Ag Solutions conducted a thorough PHA study for anhydrous ammonia system during November 2010.\n\n?    Operating Procedures - Nutrien Ag Solutions has updated a site-specific procedure that ensures operating procedures provide clear instruction for different phases of process operations and ensures they are properly maintained.  Nutrien Ag Solution"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043170,
      "SummaryText": "s most recently reviewed the operating procedures on July 17, 2013.  Annually, the operating procedures are reviewed and certified as accurate.\n\n?    Training - Nutrien Ag Solutions has updated a site-specific training procedure that ensures employees operating the ammonia process have the knowledge to safely operate the process, are aware of the potential hazards of the process, and understand the causes of process problems.\n\n?    Management of Change - Nutrien Ag Solutions has updated a site-specific management of change procedure that ensures changes (except for replacement in kind) to the ammonia process, such as additions of new equipment or changes in operating, maintenance, or other procedures are documented. The most recent management of change occurred on August 20, 2013.\n\n?    Pre-Startup Review - Nutrien Ag Solutions has updated a site-specific pre-startup safety review procedure that ensures a safety review is performed when modifications to the ammonia process are significant enough to require a change in PSI.  The most recent PSSR occurred on August 20, 2013.\n\n?    Mechanical Integrity - Nutrien Ag Solutions has updated a site-specific mechanical integrity procedure that ensures written preventative maintenance procedures are developed and maintained, preventative maintenance tests and inspections are properly documented, and employees maintaining the process receive adequate training.  Nutrien Ag Solutions most recently reviewed the preventative maintenance procedures on July 17, 2013.\n\n?    Contractor Qualifications - Nutrien Ag Solutions has updated a site-specific contractor qualification procedure that ensures all contract employers' safety performance and programs are evaluated, a contract employee injury and illness log is maintained, information of potential hazards are communicated between Nutrien Ag Solutions and the contract employer, and required training and information is communicated, such as the provisions of the emergency response plan and control ov"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043170,
      "SummaryText": "er entrance into process areas.\n\n?    Incident Investigation - Nutrien Ag Solutions has updated a site-specific incident investigation procedure that ensures each incident that either results in a release or could have resulted in a release of anhydrous ammonia is investigated, within 48 hours, by a team of at least one person knowledgeable in the process.  This procedure also makes provisions to ensure a report is prepared at the conclusion of the investigation and findings are promptly addressed. \n\n?    Compliance Audit - Nutrien Ag Solutions has updated a site-specific compliance audit program that ensures compliance audits are conducted at a minimum of every three years to verify that Nutrien Ag Solutions PSM/RMP practices and procedures are adequate and are being followed.  A compliance audit was conducted on March 27, 2014, and the next compliance audit will be conducted by March 27, 2017.  \n\n?    Hot Work Permits - Nutrien Ag Solutions has updated a best management practice for hot work.  Nutrien Ag Solutions updated their hot work permit procedures for refrigeration system #1 and #2 during June 2008. Hot work procedures were reviewed during the most recent compliance audit, on March 27, 2014.\n\n\n\nVII.    Five-Year Accident History\n\nThe Nutrien Ag Solutions facility has not had an accidental anhydrous ammonia release, which resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\n\n\nVIII.    Emergency Response Program\n\nNutrien Ag Solutions has developed an Emergency Response Plan (ERP) to ensure that in the event of an emergency the facility personnel are aware of the appropriate actions to take and authorities to contact in order to mitigate the effects of a release. \n\n\n\n Nutrien Ag Solutions has communicated and trained facility employees on proper evacuation procedures and has had interaction (i.e. onsite inspections) with the L"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000043170,
      "SummaryText": "aSalle County LEPC and the Marseilles Fire Department. \n\n\n\nNutrien Ag Solutions has coordinated their ERP with the LaSalle County Local Emergency Planning Committee (LEPC) and the Marseilles Fire Department.  This coordination effort includes providing each aforementioned agency with a copy of our ERP, and providing each with a site diagram and hazardous material information.\n\n\n\nNutrien Ag Solutions hazardous materials response team will be responsible for investigating and assisting the Marseilles Fire Department (if necessary) with response to accidental releases of ammonia. \n\n\n\nSeveral employees on staff have received HAZWOPER training through classroom instruction, on-the-job training and drills. The current HAZWOPER training includes the first responder awareness level, the first responder operations level, hazardous materials technician, and incident commander training.   \n\n\n\nThe facility has one (1) windsock and one (1) flag present onsite for use in determining wind direction in the event of an ammonia release and evacuation of the facility.\n\n\n\nThe current Material Safety Data Sheet (MSDS) for anhydrous ammonia is included in Appendix E. \n\n\n\nIX.    Emergency Communications\n\nThe telephone numbers of agencies and plant personnel that may be contacted in case of an emergency are available onsite.\n\n\n\nX.    Planned Changes to Improve Safety\n\nChemical safety is an important part of Nutrien Ag Solutions operations. Nutrien Ag Solutions recently conducted an audit of their Process Safety Management Program and will be dutifully implementing the recommendations from that audit. Continuous improvement in safety is an important goal for Nutrien Ag Solutions. \n\n\n\nXI.    Management Program\n\nNutrien Ag Solutions has updated a management system to oversee the implementation of the risk management program elements.  This system has assigned qualified person(s) (or position) to assist in the development, implementation, and integration of the risk management program elements.  If any"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000043170,
      "SummaryText": " portion of the program is delegated to others, the names or positions of those individuals will be documented and the lines of authority defined through an organization chart or similar document.  Currently, Dale Kieth Johnson II, Terminal Supervisor, is responsible for implementation of the overall Risk Management Program.  \n\n \n\n\n\n"
    }
  ]
}