{
  "FacilityID": 1000013525,
  "FacilityName": "Shaws Creek Water Treatment Plant",
  "FacilityStr1": "1738 Columbia Highway (Hwy 1)",
  "FacilityStr2": null,
  "FacilityCity": "Aiken",
  "FacilityState": "SC",
  "FacilityZipCode": "29801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45003",
  "LEPC": null,
  "FacilityLatDecDegs": "33.604167",
  "FacilityLongDecDegs": "-081.686667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Aiken",
  "OperatorStr1": "250 Dupont Drive",
  "OperatorStr2": "PO Box 1177",
  "OperatorCity": "Aiken",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29802",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Larry Morris",
  "RMPTitle": "Public Works Director",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000044383",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-02-28 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-04-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-04-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-04-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-10-30 00:00:00",
  "DeRegistrationEffectiveDate": "2013-10-23 00:00:00",
  "AnniversaryDate": "2015-04-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.6032,
  "FRS_Long": -81.68599,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016779,
      "AltID": "chlorination",
      "FacilityID": 1000013525,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000017161,
          "ProcessID": 1000016779,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019946,
          "ProcessID": 1000016779,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519946,
          "ProcessID": 1000016779,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013525,
      "SummaryText": "Executive Summary for City of Aiken Water Treatment Facility\n\n\nThis update to our original (1999) Risk Management Plan incorporates modifications to the location (latitude, longitude), worst case scenario and alternate scenario.  All nine (9) sections were evaluated and updated to the best of our knowledge and applicable sections briefly summarized below.\n\n1.Accidental Release Prevention and Emergency Response Policies\nWe at the City of Aiken are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our water treatment facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.The Stationary Source and the Regulated Substances Handled\nChlorine is the only regulated substance present at our facility.  Chlorine is used for disinfection purposes in the treatment of potable water.  Chlorine is stored as a liquefied gas under pressure.  The vapor pressure of stored chlorine is 6.8 atmospheres (99.89 psi - pounds per square inch).  Chlorine gas is non-flammable, but it is a strong oxidizer that can support combustion of other materials.  Chlorine is a toxic gas that is considered by the National Institute of Occupational Safety and Health (NIOSH) to be immediately dangerous to life and health at concentrations exceeding 10 parts per million (ppm).\n\nThe maximum inventory of chlorine at our facility is 12,000 lbs (pounds) or six 2,000-lb. cylinders.  The largest single vessel of chlorine at our facility is a 2,000-lb.cylinder.   The chlorine cylinders are equipped with a fusible plug that is designed to fail if the temperature of the cylinder reaches approximately 158( F (Fahrenheit).  The purpose of the fusible plug is to prevent cylinder failure in the event of an extended, hot fire by all"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013525,
      "SummaryText": "owing a controlled release of the cylinder contents.  All of the chlorine cylinders in our facility are located in the chlorine room, which is of fire-resistant construction in accordance with the Chlorine Institute specification for chlorine storage facilities.\n\n3.The Worst Case Release Scenario and the Alternative Release Scenarios, including administrative controls and mitigation measures to limit the distances for each reported scenario\nThe Risk Management Plan Rule requires Program Level 2 and 3 facilities to model the effects of a worst-case and one or more alternative release scenarios to predict the possible outcome of a chemical release from a facility.  These models evaluate the Distance to Toxic Endpoint based on the Emergency Response Planning Guideline 2 (ERPG-2).  These guidelines were developed by the American Industrial Hygiene Association to represent the maximum airborne concentration below which it is believed nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.  The ERPG-2 toxic endpoint for chlorine is 0.0087 mg/L.  We performed the required offsite consequence analysis for our facility using the EPA's RMP-Comp Model, version 1.07, which is an electronic version of the look-up tables and equations provided by the EPA in the RMP Offsite Consequence Analysis Guidance.  This program calculates the distance to the toxic endpoint for chlorine depending upon the effects of variable factors.  The wind speed and air stability class, presence of partial enclosures and general topographic types are all factors that affect the model calculations.  The type of release and release rates are also evaluated by the model.\n\nBecause the chlorine storage area/chlorination process equipment is located in a semi-enclosed area the RMP-Comp model, version 1.07 modified the release rate to 55 percent of t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013525,
      "SummaryText": "he release rate entered into the model.  This takes into account the passive mitigation provided by the presence of the structure.  As an example, a 10-minute release of 2,000 lbs. of chlorine (i.e., a linear rate of 200 lbs. per minute) would be modeled as a 10-minute release at a rate of 110 lbs. per minute.\n\nThe population estimate data is produced using 2000 United States Census Bureau data in conjunction with LandviewTM program.  This data is designed to provide a general information about the population in a given area, but the data is provided by geographic block groups and the local accuracy of the data can be variable. \n\nThe public and environmental receptor data represents a combination of United States Census Bureau data and information obtained from United States Geological Survey.  The following paragraphs provide details of the chosen scenarios.\n\nWorst-Case Release Scenario\n\nThe worst-case release scenario was estimated to involve the total release of one 2000 lb. cylinder of chlorine.  This is consistent with the regulation definition of a worst-case scenario as the release of the greatest quantity contained in the single largest vessel.  The use of check valves and other release prevention mitigative measures can not be considered for the worst case scenario.  The entire contents of the vessels were assumed to be released as a gas over a 10-minute period.  This type of catastrophe is extremely unlikely and would possibly require the complete failure of the cylinder to occur.  A simple puncture, valve failure or line failure would not be likely to result in a ten-minute release of the contents from the cylinder.  The EPA's RMP-Comp model was used assuming an \"Urban\" topography setting due to the buildings and very hilly topography on and near the plant site (note - the RMP-Comp model uses a \"rural\" setting for flat, open topography and an \"urban\" setting for areas with many buildings, trees or rough and broken topography.  In spite of the setting name"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013525,
      "SummaryText": "s, neither of these settings was designed to account for demographic variations).  The wind speed was assumed to be 3.4 miles/hour with a stability class of \"F\", according to EPA guidelines.  This stability class assumes the least amount of potential for air mixing due to turbulence or other factors.  The model determined the distance to the toxic endpoint to be 1.3 miles.  The population within this area is approximately 459 people, according to the 2000 census data.  The following public receptors were identified within the radial distance to the worst case endpoint, including residences, correctional facilities and commercial/industrial areas.  No environmental receptors were identified within the distance to the toxic endpoint for the worst-case scenario.\n\nAlternative-Case Release Scenario\n\nThis alternative-case scenario was modeled to represent circumstances that were estimated to be more likely to occur at the facility.  The alternative-case release scenario was estimated to involve the release of chlorine from a broken 3/4-inch valve-fitting over a ten-minute period (i.e., 787 pounds/minute).  This scenario assumed that the release detection system/automatic shutoffs malfunctioned and the cylinders had to be closed manually by facility personnel.  In this scenario 2,000 lbs. of chlorine was assumed to have been released as a gas.  As with the worst-case scenario, the EPA's RMP-Comp model was used assuming an \"Urban\" topography setting.  The wind speed was assumed to be 6.7 miles/hour with a stability class of \"D\", according to EPA guidelines.  This stability class assumes a slight to moderate potential for air mixing due to turbulence or other factors. The model determined the distance to the toxic endpoint (i.e., 0.0087 mg/L based on ERPG-2) to be 0.5-mile.  The population within this area is approximately 39 people, according to the 2000 census data.  The following public receptors identified within the radial distance to the worst case endpoint included re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000013525,
      "SummaryText": "sidences and commercial/industrial areas.  No environmental receptors were noted.\n\n4.The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirement set out under 40 CFR part 68 of the EPA and the process safety management requirements under 29 CFR part 1910.119 (OSHA).    The following sections briefly describe the elements of the release prevention program that is in place at our water treatment facility.\n\nProcess Safety Information\nThe staff of the water treatment facility maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis\nOur water treatment facility personnel conduct studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is through the use of checklists.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years and whenever a major change is made to the covered process.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, the water treatment facility maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a shutdown.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nThe water treatment facility has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000013525,
      "SummaryText": "rocedures associated with these processes.  Refresher training is provided at least annually and more frequently as needed.\n\nMechanical Integrity\nThe water treatment facility carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; piping systems, ventilation systems, emergency shutdown systems, and controls.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at the water treatment facility to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and trained to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at the water treatment facility.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nThe water treatment facility personnel conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nThe water treatment facility promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000013525,
      "SummaryText": "ective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\nEmployee Participation\nThe City of Aiken truly believes that process safety management and accident prevention is a team effort.  Water treatment facility employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, an evaluation of safety performance of the contractor is carried out.  The City of Aiken has a policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5.Five-year Accident History\nThe water treatment facility has had an excellent record of preventing accidental releases over the last 5 years. There have been no accidental releases during this period.\n\n6.Emergency Response Plan\nThe water treatment facility carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n7.Planned Changes to Improve Safety\nSeveral dev"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000013525,
      "SummaryText": "elopments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Future safety improvements include increased training, more public education, and coordination with emergency responders.\n\n8.Certification Statement\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\nName: Larry Morris, P.E.\n\nSignature:\n\nTitle: Director of Public Works\n\nDate signed:\n\nP:\\2109-011\\Aiken RMP Exec sum.doc"
    }
  ]
}