{
  "FacilityID": 1000072264,
  "FacilityName": "Chester Gas Plant",
  "FacilityStr1": "Sect. 2, T20N, R17W",
  "FacilityStr2": "Intersection of N2260 Rd & E0530 Rd",
  "FacilityCity": "Chester",
  "FacilityState": "OK",
  "FacilityZipCode": "73838",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40153",
  "LEPC": "Woodward County LEPC",
  "FacilityLatDecDegs": "36.245840",
  "FacilityLongDecDegs": "-98.979881",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Targa Resources Corp.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Targa Pipeline Mid-Continent WestOK",
  "OperatorStr1": "110 West 7th Street",
  "OperatorStr2": "Suite 2300",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74119",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187102",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-03-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-08-23 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-08-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2019-09-26 00:00:00",
  "DeRegistrationEffectiveDate": "2019-07-30 00:00:00",
  "AnniversaryDate": "2023-08-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.24584,
  "FRS_Long": -98.979881,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "§68.115(b)(2)(iii)source reduced inventory of all regulated substances below TQs",
  "_processes": [
    {
      "ProcessID": 1000090423,
      "AltID": "Nat. Gas Liq. Extraction",
      "FacilityID": 1000072264,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113018,
          "ProcessID": 1000090423,
          "ChemicalID": 155,
          "Quantity": 581346.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000098668,
              "ProcessChemicalID": 1000113018,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000098669,
              "ProcessChemicalID": 1000113018,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000098670,
              "ProcessChemicalID": 1000113018,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000098671,
              "ProcessChemicalID": 1000113018,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000098672,
              "ProcessChemicalID": 1000113018,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000098673,
              "ProcessChemicalID": 1000113018,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000098674,
              "ProcessChemicalID": 1000113018,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000091644,
          "ProcessID": 1000090423,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000072264,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Woodword Co Emergency Management",
    "CoordinatingAgencyPhone": "5802548518",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072264,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\r\nTarga Pipeline Mid-Continent WestOK, LLC\r\nChester Gas Plant (Facility ID: 100000187102)\r\n\r\nACCIDENT RELEASE PREVENTION AND RESPONSE POLICIES\r\n\r\nTarga Pipeline Mid-Continent WestOK (Targa) owns and operates a natural gas processing plant called the Chester Gas Plant in Woodward County, Oklahoma.  The facility is designed to process natural gas and recover liquid products from natural gas by physical separation and cryogenic means.  Both petroleum condensates and natural gas liquids are recovered from the inlet pipeline gas in this process for off-site sales.\r\n\r\nThe Chester Gas Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by our efforts in accident prevention, such as training personnel, quality assurance, and considering safety in the design, installation, operation and maintenance of our process.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, facility trained personnel will evaluate the situation, take actions within the capabilities of the plant, and notify the necessary outside agencies. \r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe Chester Gas Plant is located approximately 5 miles northwest of Chester, Oklahoma on E0530 Road and operates the process to produce the following petroleum products:\r\n\r\n1. Y grade mixture from natural gas (also known as natural gas liquids)\r\n2. Condensate\r\n\r\nThe products contain methane, ethane, propane, butanes, pentanes, and heavier hydrocarbon components. The regulated flammable substances include these same components. This facility does not handle regulated toxic substances above their threshold quantities and there are no toxic release scenarios to consider.\r\n\r\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\r\n\r\nSeveral vessels within the facility process were evaluated for the release scenarios.  Results of the worst-case release s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072264,
      "SummaryText": "cenario indicate that the process is subject to Risk Management Program (RMP) Program Level 1 requirements.  Details of the worst-case release scenario are included with the backup documentation associated with this RMP Plan.\r\n\r\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\r\n\r\nThe Chester Gas Plant is covered by the OSHA Process Safety Management (PSM) Program to aid in accident release prevention.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThere have been no accidental releases from the covered process in the last five years that resulted in death, injury or significant property damage on site, or known off site death, injury, evacuation, sheltering in place, property damage or environmental damage. \r\n\r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\n\r\nThe Chester Gas Plant is a Non-Responding Facility as per 40 CFR 68.90(b). The plant maintains a written emergency response plan, which is in place to help protect employees and public safety as well as the environment.  The plan identifies steps to be taken in case of an accidental release including: evacuation plans, accounting for personnel after an evacuation, and notification of Targa staff, local emergency response agencies, and the public if a release occurs. However, facility personnel are not trained to be first responders to large fires and should a release occur from one of the vessels the facility would rely on the local fire department to respond.  \r\n\r\nEmployees receive training in the procedures to be followed when certain employees must remain to operate critical plant operations before they evacuate.  The Chester Gas Plant has around-the-clock communications capability with appropriate emergency response organizations (Fire Department, Police and Sheriff's Office).  This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\r\n\r\nMANAGEMENT SYSTEM\r\n\r\nThe Area Manager has overall responsibility for the development, implementation, and integra"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072264,
      "SummaryText": "tion of the risk management program. Specific responsibilities are summarized in the backup documentation associated with this RMP Plan. \r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY \r\n\r\nThere are currently no planned changes to improve safety. Rather, the company believes that diligent compliance with our PSM Program forms the framework that allows for the continued improvement to the level of safety at the Chester Gas Plant. Some of the key components of the program that will help maintain and, where applicable, improve safety are:\r\n\r\nThe Management of Change provisions ensure that we consider the potential safety and health impacts of any change we make to chemicals, technology, equipment or procedures.\r\n\r\nThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards. \r\n\r\nThe Mechanical Integrity provisions ensure that equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous release thereby serving as an integral part of our safety program.\r\n\r\nInternal and third party compliance audits will ensure that we maintain and increase our level of safety protection."
    }
  ]
}