{
  "FacilityID": 1000089163,
  "FacilityName": "Jakov P. Dulcich & Sons Cold Storage",
  "FacilityStr1": "31956 Peterson Rd.",
  "FacilityStr2": null,
  "FacilityCity": "McFarland",
  "FacilityState": "CA",
  "FacilityZipCode": "93250",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.704722",
  "FacilityLongDecDegs": "-119.207500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Jakov P. Dulcich & Sons",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Peter Dulcich",
  "OperatorStr1": "31956 Peterson Rd.",
  "OperatorStr2": null,
  "OperatorCity": "McFarland",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93250",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chad W. Clark",
  "RMPTitle": "EHS Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165162",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-02-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-08-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-08-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-08-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-08-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.70332,
  "FRS_Long": -119.20684,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110930,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000089163,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000112223,
          "ProcessID": 1000110930,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000138613,
          "ProcessID": 1000110930,
          "ChemicalID": 56,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000638613,
          "ProcessID": 1000110930,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089163,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nAnhydrous ammonia is utilized as a refrigerant (Refrigerant R-717) in the Jakov P. Dulcich & Sons cold storage facility located near McFarland, California.  As it is Jakov P. Dulcich & Sons policy to comply with all applicable governmental regulations, the cold storage facility was designed and constructed during 1995-96 in accordance with the 1991 Uniform Building Code and Uniform Mechanical Codes.  In 2005, two cold storage rooms were added to the refrigeration system .  In 2006 the facility expansion included two more cold storage rooms and two new precoolers.  In 2009 the facility expansion included two more cold storage rooms. The 2005, 2006, 2009, 2013 and 2015 expansions were done according to the latest California Mechanical Code.  \n\n\n\nAdditionally, Jakov P. Dulcich & Sons has developed and implemented a process safety management (PSM) program for the refrigeration systems.  As part of the PSM program, Jakov P. Dulcich & Sons completed process hazard analyses.  Jakov P. Dulcich & Sons utilizes contractors to implement a preventative maintenance program and mechanical integrity program to ensure that the refrigeration equipment is maintained in good operating condition.  Properly maintained equipment reduces the risk of an accidental release.\n\n\n\nPersonnel from Jakov P. Dulcich & Sons monitor the daily operation of the refrigeration systems.  All service, maintenance, and repairs to the ammonia refrigeration systems are contracted to a qualified and licensed refrigeration contractor specializing in ammonia refrigeration.  Utilizing an experienced qualified contractor to perform routine service, maintenance, and repairs ensures that the equipment is in excellent operating condition. \n\n\n\nWhile it is Jakov P. Dulcich & Sons's objective to be a responsible citizen of the community in all of its business activities, the limited staff at the cold storage facility precludes emergenc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089163,
      "SummaryText": "y response operations.  As such, an emergency action plan has been prepared for the Jakov P. Dulcich & Sons cold storage facility and a chain of command to respond to emergencies has been established.\n\n\n\nJakov P. Dulcich & Sons has developed a detailed Compliance Audit Checklist which is used to evaluate compliance with the Process Safety Management (PSM) and CalARP regulations.  At least every three years, Jakov P. Dulcich & Sons audits these programs and any findings of noncompliance are documented and responded to and the deficiencies are corrected.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nA PSM program, which meets the requirements of the general accidental release prevention program, has been implemented by Jakov P. Dulcich & Sons to address the anhydrous ammonia refrigeration system.  The PSM program includes the following chemical-specific prevention steps:\n\n\n\n1. Written process safety information, including information pertaining to the hazards of ammonia, the technology of the process, and the equipment in the process is being compiled.\n\n\n\n2. Process Hazard Analyses (PHA) will be updated and revalidated at least every five years.\n\n\n\n3. Written operating procedures will be reviewed at least annually.\n\n\n\n4. Safe work practices, such as lockout/tagout, confined space entry, opening process equipment or piping, and control over entrance into the facility are implemented as needed.\n\n\n\n5. If employees are involved in operating the ammonia system, they will receive initial training and refresher training at least every three years.\n\n\n\n6. Written mechanical integrity procedures have been established and implemented.\n\n\n\n7. A Management of Change (MOC) program has been developed and implemented to address all proposed changes to the ammonia system.\n\n\n\n8. Pre-startup safety reviews will be performed when a modification is made to the ammonia system that is significant enough to require a change in the process safety in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089163,
      "SummaryText": "formation.\n\n\n\n9. Audits will be conducted at least every three years to evaluate compliance with the CalARP regulations.\n\n\n\n10. Incident investigation procedures have been established.\n\n\n\n11. A written plan of action regarding the implementation of employee participation has been developed and implemented.\n\n\n\n12. Hot work permits will be issued for all hot work operations conducted on or near the ammonia system, as needed.\n\n\n\n13. A Contractor Safety Policy has been developed and implemented.\n\n\n\nTo ensure that the general accidental release prevention program and the chemical-specific prevention steps are implemented, Jakov P. Dulcich & Sons has assigned overall responsibility for the RMP elements to a partner in the firm.  The partner has the overall responsibility for the development, implementation, and integration of the RMP elements.\n\n\n\nFive-Year Accident History\n\n\n\nJakov P. Dulcich & Sons has not had any accidental releases from the ammonia-based refrigeration system that have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the last five years.\n\n\n\nEmergency Response Program\n\n\n\nJakov P. Dulcich & Sons has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since Jakov P. Dulcich & Sons employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.\n\n\n\nPlanned Changes To Improve Safety\n\n\n\nJakov P. Dulcich & Sons relies on the expertise of qualified ammonia refrigeration contractors to regularly evaluate the need for any changes to the refrigeration equipment and to improve safety.  Currently, Jakov P. Dulci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089163,
      "SummaryText": "ch & Sons does not have any changes planned to improve safety associated with the ammonia refrigeration system."
    }
  ]
}