{
  "FacilityID": 1000044720,
  "FacilityName": "Neville Island Facility",
  "FacilityStr1": "2800 Neville Road",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburgh",
  "FacilityState": "PA",
  "FacilityZipCode": "15225",
  "Facility4DigitZipExt": "1496",
  "FacilityCountyFIPS": "42003",
  "LEPC": "Allegheny County LEPC",
  "FacilityLatDecDegs": "40.502778",
  "FacilityLongDecDegs": "-080.099167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4334157,
  "ParentCompanyName": "Neville Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Neville Chemical Company",
  "OperatorStr1": "2800 Neville Road",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburgh",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15225",
  "OperatorZipCodeExt": "1496",
  "RMPContact": "Mr. John H. Ferguson",
  "RMPTitle": "V.P. -Manufacturing & Plant Manager",
  "FTE": 175,
  "OtherEPAFacilityID": "15225NVLLC2800N",
  "EPAFacilityID": "100000131207",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0060",
  "SafetyInspectionDate": "2013-10-24 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.5026,
  "FRS_Long": -80.10121,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055300,
      "AltID": "Catalyst Storage/Delivery",
      "FacilityID": 1000044720,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056171,
          "ProcessID": 1000055300,
          "NAICSCode": "32521",
          "_desc": {
            "NAICS_CODE": "32521",
            "NAICS_DESCRIPTION": "Resin and Synthetic Rubber Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067413,
          "ProcessID": 1000055300,
          "ChemicalID": 52,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 52,
            "ChemicalName": "Boron trifluoride  [Borane, trifluoro-]",
            "CASNumber": "7637-07-2",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567413,
          "ProcessID": 1000055300,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044720,
      "SummaryText": "Neville Chemical Company and the Regulated Substances Handled\n\n\n\nNeville Chemical Company is a world leader in the production of petroleum based hydrocarbon resins.  Our products are used in every day consumer applications such as printing inks, dyes, adhesives, mastics, pressure sensitive adhesive strips, and rubber and tire products.  As part of our production process, Neville Chemical Company uses a variety of petroleum based resin forming feedstock oils that are blended and charged to the production units.  The production of petroleum based hydrocarbon resin requires Neville Chemical Company to use materials/chemicals that are covered by various regulations.  Of these regulated materials only boron trifluoride gas (BF3), which is used as a catalyst, is subject to Risk Management Plan provisions.\n\n\n\nAccidential Release Prevention and Emergency Response Policies\n\n\n\nNeville Chemical Company is committed to safe plant operations.  The prevention of fires, explosions, and chemical releases is given precedence over operating productivity.  Management follows sound engineering practice in the design and construction of process facilities.  Facilities are operated and maintained in accordance with established codes, standards and practices.  Facilities are reviewed periodically in order to minimize risks.  Personnel responsible for operating and maintaining process facilities are trained to carry out their assignments safely and efficiently.  Finally, incidents, including near misses are reviewed and corrective action will be taken.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention\n\n\n\nNeville Chemical Company has several Plans and Progams in-place for the prevention, control and mitigation of accidential releases. Neville has combined the following plans into a single emergency response document called the Integrated Conitngency Plan (ICP) in accordance with EPA guidance: the Preparedness, Prevention, and Contingency (PPC) Plan, the Spill"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044720,
      "SummaryText": " Prevention Control and Countermeasure (SPCC) Plan, the Allegheny County Hazardous Materials Off-Site Response Plan, the Marine Transportation-Related Facility Response Plan (MFRP), the Facility Response Plan (FRP) and the Emergency Response Management Plan (ERMP).  Neville Chemical Company is also required to comply with OSHA's Process Safety Management regulations and the Coast Guard's security regulation in 33CFR 105..\n\n\n\nThe Five Year Accident History\n\n\n\nNeville Chemical Company has not had a reportable accident during the previous 5 years. Neville has also not had a reportable quantity of boron trifluoride realeased within the previous five years.\n\n\n\nThe Emergency Response Program\n\n\n\nNeville Chemical Company's emergency response program is an integration of efforts between facility personnel of various departments, emergency response personnel (i.e., fire departments, HAZMAT, police, etc.) and off-site contractors.  Neville Chemical Company stages simulation drills/exercises at our facility, which include necessary off-site personnel, to logistically coordinate responsibilities and provide on-site familiarity with our procedures.  These drills/exercises also allow Neville Chemical Company to identify the capabilities and experiences of off-site personnel.\n\n\n\nIn addition to the simulation drills/exercises, Neville Chemical Company will also perform tabletop exercises, that on-occasion, include off-site personnel.\n\n\n\nIn close collaboration with our off-site boron trifluoride vendor, Neville Chemical Company reviews operating methods and procedures to identify necessary improvements and perform aduits of the system.\n\n\n\nNeville Chemical Company also provides additional training of its personnel designed to familiarize facility personnel with their duties and responsibilities in accordance with established policies and programs.\n\n\n\nNeville Chemical Company has several methods of providing internal notification to its employees.  These systems include alarms, loudspe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044720,
      "SummaryText": "akers, and two-way radio communication devices.  The regional municipal agencies or emergency radio/television broadcasts can provide public notification.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nSafety relief valves will be removed from the BF3 tanks by the tank supplier.  The supplier has determined that since there are already relief valves located within the BF3 process unit, the additional relief valves on the BF3 tank trailers themselves provide no additional safety for the system.  Planned removal of these valves will reduce the possibility of leaks or other mechanical problems that can be associated with such equipment. Neville Chemical Company will continue to identify equipment and techniques for improving process safety.  Currently, Neville Chemical Company believes that our existing programs, policies, and operating procedures ensure acceptable operation and maintenance of the equipment to minimize the impact to off-site receptors in the event of a release situation."
    }
  ]
}