{
  "FacilityID": 1000082199,
  "FacilityName": "Fresh Innovations of California",
  "FacilityStr1": "7735 South State Route 99",
  "FacilityStr2": null,
  "FacilityCity": "Stockton",
  "FacilityState": "CA",
  "FacilityZipCode": "95215",
  "Facility4DigitZipExt": "0667",
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.890158",
  "FacilityLongDecDegs": "-121.231871",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Joel Harris",
  "OperatorStr1": "7735 South State Route 99",
  "OperatorStr2": null,
  "OperatorCity": "Stockton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95215",
  "OperatorZipCodeExt": "0667",
  "RMPContact": "Edward Ruiz",
  "RMPTitle": "Manager of Operational Services",
  "FTE": 120,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092561",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-06-15 00:00:00",
  "SafetyInspectionBy": "San Joaquin County Environmental Health Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "USE THIS VERSION",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-08-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-08-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-08-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 37.9589,
  "FRS_Long": -121.2015,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102680,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000082199,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000103953,
          "ProcessID": 1000102680,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128642,
          "ProcessID": 1000102680,
          "ChemicalID": 56,
          "Quantity": 15200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000628642,
          "ProcessID": 1000102680,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082199,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies \n\nFresh Innovations California LLC. operates a produce packing facility and cold storage on South State Route 99, West Frontage Road, in Stockton, California.  Anhydrous ammonia is used as a refrigerant in the refrigeration system in the cold storage facility. This RMP is concerned with the cold storage facility.\n\n\n\nThe cold storage system is a flood-type system and consists of a mechanical room with four compressors, high pressure receiver, evaporative condenser and product cooling coils.\n\n\n\nThe cold storage room system contains approximately 15,200 pounds of anhydrous ammonia. The threshold planning quantity for anhydrous ammonia is 500 pounds.\n\n\n\nThis system will be operated by trained plant personnel and maintained regularly by licensed and trained contractors.\n\n\n\nThe Fresh Innovations facility is a non-responding facility and has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.\n\n\n\nStationary Source and Regulated Substances Handled\n\nThe Fresh Innovations facility refrigeration system is a flooded / recirculated type system utilizing the vapor compression refrigeration cycle, charged with 15,200lbs of Ammonia (anhydrous).\n\n\n\nThe system is comprised of four compressors, one high pressure receiver, two evaporative condensers, one suction accumulator, one recirculated pump package, fifteen surge drums, product cooling units and shell and tube heat exchangers and falling film heat exchangers, inter connecting piping, valves for isolation and control of the equipment and associated controls for all equipment.\n\n\n\nThe regulated substance handled at the facility is Ammonia (anhydrous) CAS # 7664-41-7, a colorless gas liquified under pressure with a strong, pungent odor.\n\nThe general accidental release prevention program and chemical-specific prevention steps:\n\nFresh Innovations, in an effort to ensure t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082199,
      "SummaryText": "hat the general accidental release prevention program and the chemical specific prevention steps are implemented Fresh Innovations has designated overall responsibility for the RMP/CalARP Program to the Manager of Operational Services.  \n\n\n\nThe Manager of Operational Services has the overall responsibility for the development, implementation and integration of the RMP/CalARP elements.  \n\n\n\nManagement Program\n\nA management program has been installed to maintain the current level of the system.  The management system installed at Fresh Innovations revolves around daily inspections and annual review of all components of the ammonia system.  All releases and near misses will be reviewed with the focus of making the system better.  The management system controls all activities in inspections and logging the activity in the operations binder.  At this time only employees from Refrigerated Mechanical Solutions are authorized to make repairs on the ammonia system.  \n\n\n\nFive-Year Accident History\n\nThe Fresh Innovations facility has not had any accidental releases from the ammonia based refrigeration system that have resulted in deaths, injuries or significant property damage onsite , or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage since assuming operational responsibility of the system on 6/1/2018. \n\n\n\nPrior to this date there are no known accidental releases at the facility for the previous 5 years.\n\n\n\nEmergency Response Program\n\nFresh Innovations has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  However, an emergency response program does not need to be developed for the facility since Fresh Innovations employees will not respond to accidental releases of ammonia, the facility is included in the community emergency response plan, and appropriate mechanisms are in place to notify emergency responders.\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082199,
      "SummaryText": "\n\n\nPlanned Changes to Improve Safety\n\nReplacement of existing evaporators in a phased approach over 3 years\n\nReplacement of existing computer control system with a Frick computer control and monitoring system, 12/2019.\n\nIntegrating existing ammonia alarm system with new Frick control system to enable shut down of the system in the event of an high level alarm.\n\nUpdating Standard Operating Procedures for all process equipment, currently under development.\n\n"
    }
  ]
}