{
  "FacilityID": 1000075825,
  "FacilityName": "Coronado Generating Station",
  "FacilityStr1": "7 mi NE of St. Johns,AZ off Hwy 191",
  "FacilityStr2": null,
  "FacilityCity": "St. Johns",
  "FacilityState": "AZ",
  "FacilityZipCode": "85936",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04001",
  "LEPC": "Apache County LEPC",
  "FacilityLatDecDegs": "34.578127",
  "FacilityLongDecDegs": "-109.270892",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.srpnet.com",
  "FacilityEmailAddress": "Mark.Prein@srpnet.com",
  "FacilityDUNS": 9011487,
  "ParentCompanyName": "Salt River Project",
  "Company2Name": null,
  "CompanyDUNS": 9011487,
  "Company2DUNS": 0,
  "OperatorName": "Salt River Project",
  "OperatorStr1": "P.O. Box 1018",
  "OperatorStr2": null,
  "OperatorCity": "St. Johns",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85936",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Prein",
  "RMPTitle": "Sr. Env. Scientist/RMP Manager",
  "FTE": 202,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000003426",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "64169",
  "SafetyInspectionDate": "2012-04-25 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-02-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-02-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-02-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-02-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0.5e",
  "FRS_Lat": 34.4631,
  "FRS_Long": -109.3019,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "ZIP CODE-CENTROID",
  "HorizontalAccMeasure": "24.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000094383,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 1000075825,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000095645,
          "ProcessID": 1000094383,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118134,
          "ProcessID": 1000094383,
          "ChemicalID": 56,
          "Quantity": 560000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000618134,
          "ProcessID": 1000094383,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075825,
      "SummaryText": "Executive Summary\n\n\n\nThe Salt River Project Agricultural Improvement and Power District (SRP) owns and operates the Coronado Generating Station (CGS), a coal fired power plant, located approximately 7 miles northeast of St. Johns, Arizona off Highway 191.  The approximate location of SRP CGS is 34.578127 North Latitude and -109.270892 West Longitude.  CGS operates two coal fired units (Unit 1 and 2) which have a combined electrical output of 912 gross megawatts (MW).\n\n\n\nIn August 2008, the U.S. Environmental Protection Agency (EPA) reached a settlement agreement with SRP which requires CGS to reduce its 2007 emissions of nitrogen oxide (NOx) and sulfur dioxide (SO2) by 21,000 tons per year.  To meet these emission reduction requirements, SRP implemented the Coronado Emissions Control Project (CECP).  As part of the CECP, SRP installed a selective catalytic reduction (SCR) system on Unit 2 at CGS.\n\n\n\nThe SCR system reduces NOx emissions through the use of anhydrous ammonia which is stored on site in two 45,000 gallon storage tanks with a maximum storage capacity of approximately 390,000 pounds.  This quantity provides approximately 14 days of anhydrous ammonia supply. Additionally, a loaded railcar, containing an additional 170,000 pounds may be maintained on-site for a period of time making the maximum total on-site quantity approximately 560,000 pounds.  Due to the storage of anhydrous ammonia in a quantity greater than the threshold value of 10,000 pounds, SRP is required to meet the Chemical Accident Prevention Provisions contained in Title 40 of the Code of Federal Regulations (40 CFR) Part 68 and the Process Safety Management (PSM) provisions under 29 CFR ?1910.119.  Through the development and implementation of this Risk Management Plan (RMP), as contained herein, SRP is satisfying all requirements under 40 CFR 68 and 29 CFR ?1910.119.  This executive summary is prepared in accordance with the requirements of 40 CFR ?68.155.\n\n\n\n1.1    ACCIDENTAL RELEASE PREVENTIO"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075825,
      "SummaryText": "N AND EMERGENCY RESPONSE POLICIES\n\nSRP is committed to preventing accidental releases at CGS.  Anhydrous ammonia storage and distribution at CGS is covered by an accidental release Program 3 Prevention Program developed and implemented by SRP.  In addition, SRP has developed a site emergency response program, which includes, but is not limited to, procedures for response to an accidental release, procedures for informing public and local emergency response agencies, and employee training on emergency procedures.\n\n\n\n1.2    STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nCGS utilizes anhydrous ammonia in their SCR system for the purpose of reducing NOx emissions.  The anhydrous ammonia is a regulated substance under 40 CFR Part 68 and is stored at quantities greater than the RMP threshold of 10,000 pounds.\n\n \n\n1.3    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nIn accordance with the requirements of the RMP regulations, SRP has implemented a Program 3 Prevention Program for the ammonia system at CGS.  This program contains a variety of measures to prevent accidental releases, including, but not limited to, the following:\n\n\n\n - Periodic hazard reviews and updates\n\n - Periodic audits of the system and its operation\n\n - Emergency response plan that is coordinated with local emergency response agencies\n\n\n\nThe anhydrous ammonia system is designed, installed, and maintained in accordance with all applicable regulations.  CGS employees responsible for handling anhydrous ammonia are thoroughly trained on safety procedures and operation and maintenance procedures for the anhydrous ammonia system.\n\n\n\n1.4    FIVE YEAR ACCIDENT HISTORY\n\nThere have been no accidental releases of anhydrous ammonia from the covered process at CGS in the past five years that have resulted in death, injury, or property damage on site, or known offsite impacts (deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage).\n\n\n\n1.5    EMERG"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075825,
      "SummaryText": "ENCY RESPONSE PROGRAM\n\nAn emergency response program was developed by SRP in accordance with the requirements of the RMP regulations.  The key components of this program include:\n\n\n\n  - Procedures for reporting an emergency\n\n  - Procedures for informing public and local emergency response agencies\n\n  - Proper first-aid and emergency medical treatment\n\n  - Procedures for safely evacuating the facility\n\n  - Procedures for response after an accidental release\n\n  - Training for all employees\n\n \n\n1.6    PLANNED CHANGES TO IMPROVE SAFETY\n\nA process hazard analysis (PHA) was completed in 2011 and updated in 2016 for the anhydrous ammonia system in accordance with the RMP Program 3 Prevention Program requirements.  The PHA was performed using the \"What If\" analysis method.  As required by RMP regulations, the PHA will be updated and revalidated at least every five years (more frequently if needed based on the Management-of-Change process) to update safety measures and implement improvements as needed to ensure the ongoing safe operation of the anhydrous ammonia system at the CGS facility.\n\n\n\n1.7    OFFSITE CONSEQUENCE ANALYSIS\n\nThe RMP program requires affected facilities to determine offsite impacts resulting from a prescribed worst-case scenario (WCS).  Per 40 CFR ?68.25, the WCS is defined as the release of the entire volume of anhydrous ammonia from the single largest storage tank or cylinder, over a period of 10 minutes.  In addition to the worst-case scenario, offsite impacts must be determined for an alternative case scenario (ACS), which is defined as an incident that is more likely to occur than the worst-case scenario.  For CGS, the alternative release scenario is defined as the release of anhydrous ammonia caused by a railcar failure.  The following is a summary of the approach used in the offsite consequence analysis:\n\n\n\n  - The distances to the toxic endpoints for the WCS and ACS were determined using SLAB (an atmospheric dispersion model for denser than air gases)\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075825,
      "SummaryText": "  - Meteorological parameters for the analysis were obtained from National Weather Service data collected at St. Johns Airport for the years 2004, 2005, and 2006\n\n  - The offsite impacts were evaluated using LANDVIEW 6 software as well as Mapping Applications for Response, Planning, and Local Operational Tasks (MARPLOT) version 4.2.1.\n\n\n\nThe results obtained in the offsite consequence analysis performed for the facility are as follows:\n\n  - WCS\n\n    +  Toxic Endpoint(mg/m3): 140\n\n    +  Distance to Endpoint (miles): 7.98\n\n    +  Population Within Radius to Endpoint (persons): 3,200 \n\n  - ACS\n\n    +  Toxic Endpoint(mg/m3): 140\n\n    +  Distance to Endpoint (miles): 2.82\n\n    +  Population Within Radius to Endpoint (persons): 10\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}