{
  "FacilityID": 1000072208,
  "FacilityName": "GlobiTech Inc",
  "FacilityStr1": "200 FM 1417 West",
  "FacilityStr2": null,
  "FacilityCity": "Sherman",
  "FacilityState": "TX",
  "FacilityZipCode": "75092",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48181",
  "LEPC": "Grayson County LEPC",
  "FacilityLatDecDegs": "33.594167",
  "FacilityLongDecDegs": "-096.609444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "GlobiTech Incorporated",
  "OperatorStr1": "200 FM 1417 West",
  "OperatorStr2": null,
  "OperatorCity": "Sherman",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75092",
  "OperatorZipCodeExt": null,
  "FTE": 220,
  "OtherEPAFacilityID": "TXCESQG",
  "EPAFacilityID": "100000183507",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-09-06 00:00:00",
  "SafetyInspectionBy": "Police Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-08-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-08-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-08-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 33.594167,
  "FRS_Long": -96.609444,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000090356,
      "AltID": null,
      "FacilityID": 1000072208,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000112951,
          "ProcessID": 1000090356,
          "ChemicalID": 153,
          "Quantity": 43000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000112950,
          "ProcessID": 1000090356,
          "ChemicalID": 54,
          "Quantity": 21000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000112961,
          "ProcessID": 1000090356,
          "ChemicalID": 149,
          "Quantity": 19800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000091578,
          "ProcessID": 1000090356,
          "NAICSCode": "334413",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000076660,
              "Process_NAICS_ID": 1000091578,
              "SafetyReviewDate": "2023-07-19 00:00:00",
              "PHA_Date": "2023-08-03 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-08-03 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "release due to equipment failure due to improper maintenance",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "downstream equipment rated for maximum hydrogen pressure",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Vent to scrubber for TCS and HCl. AFFF for TCS.  Hydrogen tank location away from public road.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "excess flow detector",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Process equipment change (SiC Rx)",
              "OpProceduresReviewDate": "2023-08-03 00:00:00",
              "TrainingReviewDate": "2023-06-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-02-17 00:00:00",
              "EquipmentInspectionDate": "2022-07-06 00:00:00",
              "EquipmentTested": "TCS container and cabinets, hydrogen daily check sheet",
              "ChangeMgmtDate": "2018-12-21 00:00:00",
              "ChangeMgmtReviewDate": "2022-11-28 00:00:00",
              "PreStartupReviewDate": "2023-03-16 00:00:00",
              "ComplianceAuditDate": "2022-11-17 00:00:00",
              "AuditCompletionDate": "2022-11-28 00:00:00",
              "IncidentInvestigationDate": "2020-04-22 00:00:00",
              "InvestigationChangeDate": "2020-04-23 00:00:00",
              "ParticipationPlansReviewDate": "2022-11-28 00:00:00",
              "HotWorkPermitReviewDate": "2022-11-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2021-05-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000095250,
                  "PreventionProgram3ID": 1000076660,
                  "ProcessChemicalID": 1000112961
                },
                {
                  "PrimaryKey": 1000095247,
                  "PreventionProgram3ID": 1000076660,
                  "ProcessChemicalID": 1000112951
                },
                {
                  "PrimaryKey": 1000095246,
                  "PreventionProgram3ID": 1000076660,
                  "ProcessChemicalID": 1000112950
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000072208,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-11-28 00:00:00",
    "ERTrainingDate": "2021-07-01 00:00:00",
    "CoordinatingAgencyName": "Grayson County LEPC",
    "CoordinatingAgencyPhone": "9038134253",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072208,
      "SummaryText": "EXECUTIVE SUMMARY\r\nGLOBITECH INC.\r\nSHERMAN TEXAS\r\nAUG 2008\r\n\r\n\r\nFacility Description\r\n\tGlobiTech Incorporated is a 120,000-square-foot semiconductor facility located in Sherman Texas.  Sherman is located 60 miles north of Dallas Texas in Grayson County.  Construction began in February 2000 and the plant was occupied in July 2001.  The facility consists of a two level administration area located between two wafer fabs.  The wafer fabs are three level construction.  The first level contains the chemical delivery systems and related support equipment for the process tools such as power supply and controllers.  The middle level of the wafer fab is an 8000-square-foot Class 1 cleanroom environment containing the manufacturing process equipment. The third level houses the air handling equipment for the cleanroom.  Behind the administrative area on the first level are more support equipment such as chillers, boilers, and a de-ionized water plant. A Control Center is centrally located and is the location of the Building Management System for all utilities.  Behind the administrative area on the second level is the main frame computer room and wafer stock room.  Located outside the building are storage tanks for the de-ionization water process, Acid Waste Neutralization system, cryogenic hydrogen storage tanks and an ASU (air separation unit) for producing nitrogen.  Also located outside are the bulk supply and distribution systems for anhydrous hydrogen chloride (HCl) and trichlorosilane (TCS).  Epitaxial silicon wafers are produced at this facility.  \r\n\r\nProcess Description\r\n\tA thin (2-80 micron) single crystal layer of silicon is deposited on a silicon wafer.  The layer provides an ultra pure starting substrate for use by integrated device manufacturers to build integrated circuits commonly referred to as chips.  Trichlorosilane (SiHCl3) is the silicon source for the deposition.  The deposition process takes place in an epi reactor at elevated temperatures high enough to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072208,
      "SummaryText": "separate the silicon atoms from the chlorine atoms contained in trichlorosilane.  The remaining hydrogen and chlorine atoms combine into hydrogen chloride.  This is the major byproduct of the deposition process and since it is hazardous must be scrubbed to state mandated levels before emission into the atmosphere.  Hydrogen chloride is also used to remove silicon that has deposited on equipment piece parts during the reaction.  An air permit from the state regulatory body, Texas Commission on Environmental Quality (TCEQ), was obtained prior to construction of the facility and renewed in 2011.  GlobiTech is labeled a \"minor source\" in regard to emissions due to very small amount of HCl emitted after scrubbing.   Other processes associated with the deposition are wet cleaning of the wafers and parameter measurement such as electrical resistivity and thickness. \r\n\r\nRegulated Substances Handled\r\nAnhydrous hydrogen chloride, trichlorosilane, and hydrogen are the regulated chemicals handled on this site.  Hydrogen chloride, trichlorosilane, and hydrogen are in quantities above threshold limits stated in OSHA's PSM and the EPA's RMP programs therefore all required elements of each program are implemented. \r\n\r\nWorst Case Disaster Scenario \r\n\tWorst-case and alternative disaster scenarios for hydrogen chloride, trichlorosilane and hydrogen have been performed. An independent environmental consulting firm with extensive expertise in dispersion modeling performed the analysis using EPA recognized model DEGADIS.  In addition, EPA approved software RMP Comp was used internally and the results compared.     These techniques are consistent with the Texas Commission on Environmental Quality and The U.S. Environmental Protection Agency procedures. They are based on the U.S. EPA RMP Guidance for Offsite Consequence Analysis, which defines the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line failure that results in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072208,
      "SummaryText": "the greatest distance to an endpoint that serious injury from short-term exposure will no longer occur.  \r\nHydrogen chloride (HCl) is received in anhydrous form via tube trailer truck.  The HCl is contained in six separate pressurize tubes with each tube containing 3300lbs. Hydrogen is stored as a cryogenic liquid in three (3) separate tanks.  The largest being approximately 20,000 gallons  The aggregate amount exceeds the RMP/PSM quanty threshold. Trichlorosilane (TCS) is received in a 3800 gallon (43000 lbs) ISO container.  TCS reacts with the moisture in the air to form HCl.  The IDLH (Immediately Dangerous to Life and Health) value for HCl is 50ppm. Using the parameters listed in the table below, the toxic endpoint for the rupture of one of the tubes was calculated as well as rupture of the TCS container.\r\n\r\n\r\n\r\nParameter\tValue\r\nRelease duration (min)\t10\r\nStability class\tF\r\nWind speed (m/s)\t1.5\r\nAnemometer height (m)\t10\r\nAmbient temp (oF)\t109\r\nRelative humidity (%)\t65\r\nSurface roughness (m)\t0.3\r\nReceptor height (m)\t0\r\n  \r\nThe distance to the endpoint for HCl based on the parameters above is 2.7 miles (4.3 kilometers) using RMP Comp and 1 mile (1.6 kilometers) according to DEGADIS. For HCl due to TCS release the end point according to DEGADIS is 0.7 miles (1200 meters).    \r\nBesides Trichlorosilane (TCS) converting to HCl in the atmosphere it is also a flammable. Therefore a worst case flammable release scenario was performed using RMP Comp and the TNT Equivalent Model described in the EPA's RMP Guidance.  The estimated distance to an overpressure of 1 psi was determined to be 160 and 196 meters respectively, which is in the confines of the GlobiTech facility.  An alternative flammable release scenario using a pool fire instead of a vapor cloud explosion was preformed and also shows the release to be within the confines of the facility.  Worst case and Alternate scenarios for hydrogen both indicate a 0.2 mile distance for vapor cloud explosion and BLEVE of a ful"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000072208,
      "SummaryText": "l release of the largest tank - 10440lbs.  \r\n\r\nAccident Prevention Program\r\n\tAn Environmental Health and Safety specification titled Accident Prevention has been written and communicated to all employees.  It addresses the following issues; creation of a Safety Committee and its responsibilities, accident investigation procedures, outlines authority, training, inspections, and audits. Other written specifications include; Lock out/Tag out, Haz Com, Confined Space, Contractor Safety, Emergency Eyewash and Showers, Emergency Egress, Chemical Safety and Storage, Hazardous Work permits, Hot Work Permit, Toxic Gas Monitoring, Chemical Spill and Release Response Procedures, Hazardous Waste Management, Blood Borne Pathogens, Reporting and Recording Injuries and Illnesses, Slug Control, and all fourteen elements outlined in OSHA & PSM.  Both TCS and HCl bulk delivery systems are equipped with leak detection sensors connected to a site wide Toxic Gas Monitoring (TGM) system with shutdown capabilities. In addition to the TGM, restrictive flow orifices and excess flow detection, low-low and high-high detection systems are in place with shutdown capabilities. The TCS bulk delivery area is further equipped with an AFFF foam suppression system and 110% secondary containment.  Any loss of exhaust detected at any gas cabinet or the process tool (reactor) a shutdown of the source gas will occur.  Barricades (bollards) are in place for TCS, H2, and HCl. Access to all required chemicals is through locked gates.  A restrictive orifice is also used as a means of minimizing a release due to an H2 line break.  Numerous points throughout the hydrogen delivery system are monitored by the TGM system.  \r\n\tOperating procedures were developed by GlobiTech in conjunction with the equipment manufacturer and the chemical supplier. \r\n\r\nEmergency Response Program\r\n\tAn emergency response team has been formed and trained to the technician level (HAZWOPER). Training for team members is ongoing.  An Env"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000072208,
      "SummaryText": "ironmental Health and Safety specification titled Emergency Response and Planning, has been written and addresses such issues as; creation of an Emergency Response Team and the organizational structure, team membership criteria and responsibility, action guideline in the event of an incident, control of the hazard area, medical action plan, fire extinguisher training, decontamination plan, and SCBA respirator plan.   \r\n \r\nFive Year Accident History\r\nGlobiTech has had no accidental releases of any regulated chemicals in the past five years.  \r\n\r\nSummary\r\n\tGlobiTech chemical handling personnel, the equipment manufacturer, and the chemical supplier represents significant knowledge and experience in regard to handling these particular chemicals.  A checks and balance system between the groups in each company insures the safest approach to chemical handling and processing is followed, maintained, and reviewed on an ongoing basis.  The purity levels needed for epitaxial deposition demands the absolute highest quality materials, workmanship, and procedures.  It continues with preventative maintenance to insure the integrity of the system.  Any compromise or breech in any manner is not only a safety concern but may have a major damaging effect on business."
    }
  ]
}