{
  "FacilityID": 1000073221,
  "FacilityName": "Lightning Dock Geothermal HI-01, LLC",
  "FacilityStr1": "18 Greenhouse Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Animas",
  "FacilityState": "NM",
  "FacilityZipCode": "88020",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35023",
  "LEPC": "Hidalgo LEPC",
  "FacilityLatDecDegs": "32.083795",
  "FacilityLongDecDegs": "-108.501801",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 809190767,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lightning Dock Geothermal HI-01, LL",
  "OperatorStr1": "18 Greenhouse Drive",
  "OperatorStr2": null,
  "OperatorCity": "Animas",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "88020",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Ramirez",
  "RMPTitle": "Plant Manager",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000239798",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-02-14 00:00:00",
  "SafetyInspectionBy": "Starrtecg - Tim Burchett PE",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-07-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-07-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-07-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092367,
      "AltID": "Iso-Butane Rankine Cycle",
      "FacilityID": 1000073221,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093629,
          "ProcessID": 1000092367,
          "NAICSCode": "221116",
          "_desc": {
            "NAICS_CODE": "221116",
            "NAICS_DESCRIPTION": "Geothermal Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115588,
          "ProcessID": 1000092367,
          "ChemicalID": 107,
          "Quantity": 375714.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000615588,
          "ProcessID": 1000092367,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000073221,
      "SummaryText": "The Accidental Release Prevention and Emergency Response Policies at the Lightning Dock Geothermal (LDG) Power Plant\n\n\n\n  The LDG Power Plant is located at 15 Greenhouse Drive, Animas New Mexico in the county of Hidalgo near the town of Animas New Mexico. The facility is committed to being a responsible member of the nearby communities. Site policy dictates that the LDG Power Plant continuously identify methods to identify and reduce the risk to the community and environment through implementation of inherently safe technologies and procedures. This commitment to safe and environmentally sound operations is documented in policies and safety procedures at the facility which are available to all employees who are trained to these policies and safety procedures.\n\n \n\nDescription of the Lightning Dock Geothermal Power Plant and the Regulated Substance Used.\n\n\n\n  The power plant uses heat from geothermal brine at approximately 310 degrees Fahrenheit to heat, through a non-contact heat exchange process, a single turbine isobutane process that converts the geothermal heat to electric power for sale to PNM, through transmission to Columbus Electric Cooperative, the local energy cooperative for the local communities' electric power needs. The isobutane used in the closed loop (recirculated/recycled) power generation process is the only regulated substance at the site. The facility can have on site up to approximately 57,200 gallons of isobutane being used in the process or being stored. It is expected that, due to fugitive emission losses, no more than one truck of approximately 4,200 gallons of makeup isobutane will be required per year and, in fact, continuous monitoring of leakages and proper maintenance will in all eventuality reduce fugitive emission losses and need to replenish significantly. When isobutane is delivered to the site it will be off loaded at a designated isobutane storage area and under well qualified employees and approved safe operating procedures.\n\n\n\n "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000073221,
      "SummaryText": " The power generation process (ORC Turbogenerator) consists of heat exchangers (two preheaters and one evaporator) which absorb heat from the geothermal brine in order to boil and convert the iso butane into its vapor phase. The vaporized iso butane is then directed to a turbine specially designed to convert thermal energy in the iso butane to rotational mechanical energy. The turbine which is directly coupled to a generator, in turn, rotates the generator leading to the generation of electrical power. Iso butane from the turbine is directed through a regenerator and then to the air cooled condensers that complete the condensing of iso butane back to its liquid phase. From the condensers isobutane falls to the suction of feed pumps which pressurize the iso butane and direct the iso butane through the regenerator, a non-contact heat exchange process, to absorb heat from the iso butane moving from the turbine outlet to the condensers. From the regenerator the pressurized isobutane is once again directed to the two preheaters and evaporator.\n\n\n\nThe Worst Case Release Scenario and the Alternative Release Scenario.\n\n\n\n  The Worst Case Release Scenario evaluated was that of a ruptured isobutane tank leading to a boiling liquid expanding vapor explosion (BLEVE) condition using 300,872 pounds of isobutane. The maximum distance to an over pressure of 1 psi is 0.5 miles (0.9 kilometers). The EPA's RMP Off site Consequence Analysis Guidelines for Worst-Case Scenario were calculated using RMP*Comp. Although there are numerous installed control measures that, in an actual event, would mitigate the release, no credit for mitigation measures was taken into account for this scenario.\n\n\n\n  The Alternate Case Release Scenario evaluated based on the 1\" pipe from the regenerator to the feed pump suction being hit, ruptured, subsequent hot liquefied iso butane leaking, and an ensuing vapor cloud explosion event that lasts for 20 minutes before any mitigating efforts can take effect.  Us"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000073221,
      "SummaryText": "ing RMP*Comp to perform the calculations it is estimated that the initial iso butane flow rate will be 9,730 pounds per minute leading to an overpressure of 1 psi at 0.2 miles (0.4 kilometers) from the explosion.\n\n\n\nAccidental Release Prevention Program\n\n\n\n  The accidental release program developed for the Lightning Dock Geothermal Power Plant is a formal program implemented to satisfy the requirements of the Occupational Safety and Health Admiration's (OSHA's) Process Safety Management (PSM) and the United States Environmental Protection Agency's (EPA's) Risk Management Program (RMP) requirements. Additionally, it is the belief of Lightning Dock Geothermal management that this management program also lead to a more efficient and profitable operation.\n\nThe Process Safety Management program consists of thirteen program \"elements\" which comprise:\n\n\n\n    PSM Program Management and Document Control\n\n    Facility and Substance Information and Safety Information (PSI)\n\n    Process Hazard Analysis (PHA)\n\n    Standard Operating Procedures (SOPs)\n\n    Training Programs\n\n    Mechanical Integrity\n\n    Management of Change (MOC) Program\n\n    Pre Start Up Safety Review (PSSR)\n\n    Verification of Compliance Audit\n\n    Incident Investigation\n\n    Employee Participation\n\n    Contractor Safety Program\n\n    Emergency Action Plan\n\n\n\nThe Plant Manager is responsible for ensuring the implementation and management of the PSM program, however, all employees and contractors before doing any work on site are required to know and understand specified elements of the PSM program before undertaking any work on site. All responsibilities and requirements are specified in the PSM program.\n\n\n\nA brief description of each element follows.\n\n\n\nPSM Program Management and Document Control \n\n\n\n  It is important that the Lightning Dock Geothermal Power Plant continues to review and amend, in a consistent manner, relevant procedures and other supporting documents. This is to ensure procedures are working properly and have been, and are being,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000073221,
      "SummaryText": " developed pursuant to regulatory requirements. Also of importance are the ready identification, accessibility and appropriate archival management of such documentation. Evidence of compliance in this regard is a requirement of external authorities such as: \n\nIt is also important that policies, procedures, process safety information and key materials are document controlled such that the relevant revision is readily identifiable by readers and users, as applicable at any specific time, especially for auditing and historical purposes.\n\nThe Plant Manager is responsible for an ongoing review all process safety information and procedures to make certain they are regularly updated in line with changing legislative and other requirements. All superseded process safety information and procedures are to be destroyed\n\nAn appropriate review process, incorporating employee consultation, is in place per the Employee Participation Program.\n\nThis policy applies to the following Lightning Dock 3 Geothermal Power Plant documentation:\n\n \n\n    Standard Safety Procedures (SSP's)\n\n    Standard Operating Procedures (SOP's)\n\n    Process Safety Information (PSI)\n\n\n\nFacility and Substance Information and Safety Information (PSI)\n\n\n\n  The Lightning Dock Geothermal Power Plant Process Safety Information Management is addressed in SSP-1 Program Management and Document Control and will be in accordance with the requirements of the following: \n\n \n\n  All Process Safety Information and Documentation will be maintained in the SSP-3 folder on Box.com.\n\nNo further mention in the procedure will be provided as SSP-1 will be the procedure used to maintain and manage this information.\n\n\n\nProcess Hazard Analysis (PHA)\n\n\n\n  To establish a procedure for conducting a Process Hazard Analysis (PHA) for the Lightning Dock Geothermal Power Plant.  This procedure is required for compliance with OSHA Process Safety Management (OSHA 29 CFR 1910.119(e)).\n\n\n\n  The purpose of the PHA is to:\n\n\n\n    Define possible hazards associa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000073221,
      "SummaryText": "ted with the facilities process that includes isobutane. \n\n\n\n    Identification of any previous incidents, which had a likely potential for catastrophic consequences.\n\n\n\n    Evaluate engineering and administrative controls applicable to the hazards.\n\n\n\n    Determine the consequences of failures associated with engineering and administrative controls.\n\n\n\n    Perform facility inspection and HAZOP study to determine the safety and health of employees.\n\n\n\n    Establish a method of addressing team's findings and recommendations; assure the recommendations are resolved in a timely manner; document what actions are taken and a written schedule of when the actions are to be completed.\n\n\n\nThe PHA will be updated and revalidated every five years to ensure the study is consistent with the processes.\n\n\n\nStandard Operating Procedures (SOPs)\n\n\n\nThe Lightning Dock Geothermal Power Plant Standard Operating Procedure Management is addressed in SSP-1 Program Management and Document Control and will be in accordance with the requirements of the following:  \n\n    All up to date Standard Operating Procedures maintained in the SSP-4 folder on Box.com.\n\n    No further mention in the procedure will be provided as SSP-1 will be the procedure used to maintain and manage this information.\n\n\n\nTraining Programs\n\n\n\n  This procedure outlines the training process for all Lightning Dock Geothermal Power Plant personnel. It outlines the use of the different tools that the trainee should use and how the training process is to be controlled by plant management. This procedure is to be managed in accordance with Program Management Plan and Document Control procedure.\n\n\n\n  All personnel are required to be familiar with The Lightning Dock Geothermal Power Plant training program up to their required qualification level. \n\n\n\n  Employees shall be responsible for the progress of their training.\n\n\n\nThe Plant Manager is ultimately responsible for the management of the Training Program. The Plant Manager will appoint a responsible,"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000073221,
      "SummaryText": " qualified Control Room Operator (\"Trainer\") to follow up on the training process of each trainee and make sure that all the knowledge & tools are available for the trainee. The Plant Manager is also responsible to:\n\n\n\n    Provide a safety indoctrination to each new employee as soon as possible after their hire.\n\n    Provide a safety briefing of the precautions to be taken while training in the plant.\n\n    Make sure that all training documents are in place.\n\n    Ensure instructional materials, methods used for comprehension and methods used to document successful training are developed, reviewed and approved in accordance with the Program Management Plan and Document Control procedure.\n\n    Make sure that the trainer has all the tools required to provide the professional guidance for the trainee.\n\n    Ensure that the trainee and trainer understand the process and their responsibilities.\n\n    Outline a schedule for completion of the training (set measurable goals). And follow up on this schedule.\n\n\n\nThe Trainers responsibilities are: \n\n\n\n    Provide direction, technical help and answer questions about plant operations/ equipment/ procedural matters\n\n    Direct the trainee to focus on the fundamentals. \n\n    Help the trainee with plant orientation & provide the guidance for the \"walk through\" tasks. \n\n    Make sure the trainee has all the literature/ technical documents.\n\n    Follow up on the progress of the trainee using the qualification checklist.\n\n    Supervise the completion of the qualification written tasks (drawings and lists) and submit the written documents to the Plant Manager.\n\n    Supervise the completion of the qualification practical tasks (maintenance and logs) and review with the trainee.\n\n    Report to the Plant Manager of the qualification card completion and trainee's readiness to take the written test.\n\n    It is the trainer's responsibility to accompany the trainee in all learning tasks that are held outside/ in the control center.\n\n\n\nThe Trainee will utilize the following documents:\n\n\n\n    Quali"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000073221,
      "SummaryText": "fication program \n\n    P&IDs, Electrical drawings & PFDs\n\n    Vendor Manuals\n\n    O & M Manuals\n\n    Standard Operating Procedures (SOP's)\n\n    Process and Control Narrative\n\n    Safety Data Sheets (SDS's)\n\n    Standard Safety Procedures (SSP's)\n\n    Plant Safety System Description\n\n    Management of Change (MOC) Program\n\n\n\nMechanical Integrity Program\n\n\n\n  To assure the continued integrity of process equipment and that all process equipment is designed, constructed, installed, and maintained to minimize the risk of process releases.\n\n\n\n  Identify and categorize all process equipment and instrumentation.\n\n\n\n  Development of written maintenance procedures and a quality assurance program.  \n\n\n\n  Training for process maintenance activities, inspection and testing, and correction of deficiencies in equipment that is outside acceptable limits as defined by the process safety information. \n\n\n\n  This procedure is to be managed in accordance with SSP-1 - Program Management Plan and Document Control.\n\n\n\n\n\nManagement of Change (MOC) Program\n\n\n\n  The intent of this procedure is to require management of all modifications to equipment, structures, buildings, procedures, raw materials and processing conditions other than replacement in kind by identifying and reviewing them prior to implementation of the change. Minimum requirements for management of change include: establishing written procedures to manage change; addressing the technical basis, impact on safety and health, modification to operating procedures, necessary time period, and authorizations required; informing and training employees and contractors affected; and updating process safety information and operating procedures or practices.\n\n\n\n  The following is a list of examples where a MOC procedure is necessary:\n\n\n\n    New projects that involve tie-ins, equipment additions or modifications, increase throughput or the use of a different raw material or additives.\n\n\n\n    Significant changes in operating conditions, including pressures, temperatur"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000073221,
      "SummaryText": "es, flow rates or process conditions outside the established ranges set for the process and mechanical design.\n\n\n\n   Changes in alarms, instrumentation and control schemes.\n\n\n\n   Changes to the process equipment that cause changes in the facilities pressure relief requirements.\n\n\n\n   Bypass around equipment normally in service or running without equipment normally in service.\n\n\n\n   Changes in operating procedures, including procedures for start-up, normal shutdown and emergency shutdown.\n\n\n\n   Temporary connections, utilities, electrical, process, temporary repairs, pipe clamps. Etc.\n\n\n\n   Replacement of components that are not in kind including gaskets, valves, bolts, etc. A MOC is not required for components which satisfy the in use/approved design specifications.\n\n\n\n   Replacement of equipment with equipment of different design specifications, a change of manufacturer does not require an MOC if the specifications for the new equipment are the same as the one removed.\n\n\n\n  This procedure shall be maintained to ensure it satisfies OSHA Process Safety Management (PSM) Standard 29 CFR, Part 1910; and EPA Risk Management Program (RMP) Standard 40 CFR, Part 68 confirmations that:\n\n\n\n  The technical basis for change is appropriate.\n\n\n\n  Industrial safety, health and environmental impacts of a change are understood.\n\n\n\n  Procedures are modified as appropriate for change.\n\n\n\n  Training is held as appropriate for change.\n\n\n\n  Preventive Maintenance/Mechanical Integrity program is modified as appropriate for change.\n\n\n\n  Determination of PSSR requirements as appropriate for change.\n\n\n\n  Determination of the time necessary to make the proposed change.\n\n\n\n  Permissible time period is established for temporary changes.\n\n\n\n  Appropriate personnel authorize a change.\n\n\n\n  The Process Safety Information (PSI) is updated as appropriate for change.\n\n\n\n  Management of Change (MOC) procedures ensure proper process changes are evaluated for safety and health consequences and approved "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000073221,
      "SummaryText": "before being implemented.\n\n\n\n  MOC procedures ensure that employees involved in operating a process, and maintenance and contract employees whose job tasks will be affected are informed of, and trained in, all elements of the PSM program.\n\n\n\n  MOC will verify each process change will be audited to ensure the change has been properly reviewed and implemented as proposed, that proper documentation has been made to drawings, diagrams, operating procedures, and standard safety procedures and that subsequent operations, after the change has been implemented, have not indicated the existence of unrecognized hazards.\n\n\n\n  The Plant Manager has the primary responsibility for ensuring all affected departments and employees (including contractors) have been informed about any process change prior to it being implemented.\n\n\n\n  In order to maintain the continuity of a chemical process and allow for those instances where periodic \"fine-tune\" adjustments are required, an operator must have the flexibility to be able to make necessary process changes to process operating conditions. These process changes are allowable without the need of MOC forms as long as they are within the range of safe operating limits specified in the Operating Procedure.\n\n\n\n  In order to maintain the integrity of an operating process and allow for those instances where \"Emergency actions\" are required, an operator must have the flexibility to take immediate actions to make necessary process changes to process operating conditions. These Emergency process changes are reserved for those situations that are legitimately urgent and require some type of immediate action to stabilize and bring a potentially catastrophic situation under control. These actions will be allowable without the need of MOC forms as long as they are within the range of safe operating limits specified in the Emergency Operating Procedure.\n\n\n\n  MOC ensures that Process Safety Information (PSI) and Operating, Maintenance, and Emergency Pro"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000073221,
      "SummaryText": "cedures are updated as appropriate.\n\n\n\n  The MOC program applies to all PSM covered processes within the plant and Administrative Reviews.\n\n\n\n  The MOC program applies to changes in the following:\n\n    Process Chemicals\n\n    Process Technology\n\n    Process Equipment including structural components\n\n    Process Controls and Parameters\n\n    Policies and Procedures\n\n    Administration, Organization, and Staffing\n\n\n\nPre Start Up Safety Review (PSSR)\n\n\n\n  The Pre-Startup Safety Review (PSSR) Program was developed to ensure completeness, operability and safety of all new or modified equipment, systems and subsystems; to assure that appropriate safety, operating, maintenance and emergency procedures are in place; and to verify that a process hazard analysis has been performed.\n\n\n\n  The PSSR includes the use of construction walk down checklists for mechanical, electrical and control systems, construction document audits, the verification of procedure development, performance of a PHA and MOC, verification of safety, operation and maintenance training and the documentation and correction of deficiencies and the confirmation of completion.\n\n\n\nVerification of Compliance Audit\n\n\n\n  Ensure the Lightning Dock Geothermal Plant certifies, at least once every three (3) years, that an evaluation has been performed of whether adequate procedures and practices have been developed, implemented, and are being followed as required by the OSHA Standards for General Industry Process Safety Management (PSM) and the Environmental Protection Agency Risk Management Plan (RMP).\n\n    Verify the compliance audit is conducted by at least one person knowledgeable in the process. \n\n    Make certain the facility develops a report of the audit findings. \n\n The facility shall then promptly determine and document an appropriate response to each of the findings of the compliance audit and document that deficiencies have been corrected. \n\n    To confirm the facility shall retain the two (2) most recent compliance a"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000073221,
      "SummaryText": "udit reports. \n\n To ensure that the Plant Manager properly maintains, develops and implements the Compliance Audits.\n\n     It is the responsibility of the Plant Manager to ensure the Compliance Audit element is maintained and updated as necessary to reflect procedures at the Facility. As such, the Plant Manager will ensure that only the most up-to-date version of this document is available.\n\n\n\nIncident Investigation\n\n\n\n  Incident investigation is the process of identifying causes of incidents and implementing steps to prevent similar events from occurring. The intent of an incident investigation is for employers/employees to learn from past experiences and thus avoid repeating past mistakes. \n\nThis procedure is designed to meet the strict criteria of OSHA's Process Safety Management (PSM), and EPA's Risk Management Program (RMP).\n\n\n\n  The Incident Investigation process should be applied to all Accidents, Incidents, Incidents that resulted in, or could reasonably have resulted in, a catastrophic release, and Near Misses that occur. OSHA N AC definitions of these conditions are as follows:\n\n?    Incident: An unplanned, undesired event that adversely affects completion of a task.\n\n?    Catastrophic Release: An uncontrolled emission, fire or explosion involving one or more highly hazardous substances or explosives that presents imminent and substantial endangerment to the health of the employees, the public health or the environment.  The term includes events that occur within a building or other structure that contains the substance or explosive.\n\n?    Accident: An undesired event that results in personal injury or property damage.\n\n?    Near Miss: An incident where no property was damaged and no personal injury sustained, but where, given a slight shift in time or position, damage and/or injury easily could have occurred. Note: a Near Miss does not necessarily require a release of process fluids. Any incident that could have reasonably resulted in a catastrophic release under differ"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000073221,
      "SummaryText": "ent circumstances should be considered a Near Miss\n\n\n\nEmployee Participation\n\n\n\n  This program was developed to ensure that employees are aware of, have access to and are included in the development of Process Safety Information, Process Hazard Analysis, Standard Operating Procedures & Standard Safety Procedures, the Management of Change, Pre-Startup Safety Review, Incident Investigation, Emergency Action Plan, Hot Work Permit, Contractor Program, Training, Preventive Maintenance/Mechanical Integrity, Employee Participation, and Verification of Compliance Audit programs. \n\n\n\n  This satisfies OSHA PSM Standard 29 CFR, Part 1910.199(c); and EPA RMP Standard 40 CFR, Part 68.83 through confirmations that: \n\n\n\n  Employees are aware of and included in the development of Process Safety Information.\n\n\n\n  Employees are aware of and included in the development of Process Hazard Analysis.\n\n\n\n  Employees are aware of and included in the development of Standard Operating Procedures & Standard Safety Procedures.\n\n\n\n  Employees are aware of and included in the development of Management of Change program. \n\n\n\n  Employees are aware of and included in the development of Pre Startup Safety Review program.\n\n\n\n  Employees are aware of and included in the development of Incident Investigation program.\n\n\n\n  Employees are aware of and included in the development of Emergency Action Plan.\n\n\n\n  Employees are aware of an included in the development of the Hot Work Permit program.  \n\n\n\n  Employees are aware of and included in the development of Contractor program.\n\n\n\n  Employees are aware of and included in the development of Training program.\n\n\n\n  Employees are aware of and included in the development of Preventive Maintenance/Mechanical Integrity program.\n\n\n\n  Employees are aware of and included in the development of Employee Participation program.\n\n\n\n  Employees are aware of and included in the development of Verification of Compliance Audit program.\n\n\n\n  Employees have access to the Proces"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000073221,
      "SummaryText": "s Safety Information.\n\n\n\n  Employees have access to the Process Hazard Analysis.\n\n\n\n  Employees have access to the Standard Operating Procedures & Standard Safety Procedures.\n\n\n\n  Employees have access to the Management of Change program.\n\n\n\n  Employees have access to the Startup Safety Review program.\n\n\n\n  Employees have access to the Incident Investigation program.\n\n\n\n  Employees have access to the Emergency Action Plan.\n\n\n\n  Employees have access to the Hot Work Permit program.\n\n\n\n  Employees have access to the Contractor program.\n\n\n\n  Employees have access to the Training program.\n\n\n\n  Employees have access to the Preventive Maintenance/Mechanical Integrity program.\n\n\n\n  Employees have access to the Employee Participation program.\n\n\n\n  Employees have access to the Verification of Compliance Audit program.\n\n\n\nContractor Safety Program\n\n\n\n  To establish a screening process for contractors performing maintenance or repair work on covered processes that involve highly hazardous materials.\n\nEnsure all contractors accomplish desired job tasks without compromising the health and safety of employees at the Lightning Dock Geothermal Geothermal Power Plant.\n\nEnsure contractor employees are trained on performing work safely and are aware of all hazards related to the job and applicable elements of the Emergency Action Plan (SSP-13), Lockout/Tagout (SSP-15), Hot Work (SSP-16), Safe Work (SSP-17), Personal Protective Equipment (SSP-18), Hazardous Chemical Communication (SSP-19), and Working at High Elevations (SSP-20).\n\n\n\nEmergency Action Plan\n\n\n\n It is important that the Lightning Dock Geothermal Power Plant develops, continues to review and amend, in a consistent manner, its Emergency Action Plan. This is to the Emergency Action Plan (EAP) works properly and has been, and is being, developed pursuant to regulatory requirements. Evidence of compliance in this regard is a requirement of external authorities such as: \n\n\n\n  The Plant Manager is responsible for an ongoing revie"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000073221,
      "SummaryText": "w of the Emergency Action plan     In accordance with (IAW) SSP-1 Program Management and Document Control to ensure that all required     elements are included, up to date, and that any changes are documented IAW SSP-7 Management of Change.\n\n\n\n  The EAP will be reviewed on an annual basis IAW SSP-1 Program Management and Document Control.  The Plant Manager will assign appropriate qualified personnel to review the EAP. Once reviews are completed, they will be given back to the Plant Manager for final review.  Upon completing the final review the Plant Manager will date and initial the index page for those procedures.\n\n\n\n  The review will ensure the procedure is accurate, working properly and pursuant to regulatory requirements.\n\n     \n\n  Events that may cause a need for EAP review shall include but are not limited to MOC's that affect the employee alarm system, changes in plant management, and changes in first responders or their management, and etc. These will most likely require a revision to the EAP and all changes to the EAP shall require a MOC.  \n\n \n\n  All changes to the EAP will require a MOC and notification be sent to first responders and documented that it was sent.\n\n\n\nFive Year Accident History\n\n\n\n  This is a relatively new facility and no accidents have occurred since start up.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\n  Their currently are no plans other than continued implementation to improve safety. \n\n\n\n"
    }
  ]
}