{
  "FacilityID": 1000044887,
  "FacilityName": "SCWA: Sonoma Valley CSDTP",
  "FacilityStr1": "22675 8th Street East",
  "FacilityStr2": null,
  "FacilityCity": "Sonoma",
  "FacilityState": "CA",
  "FacilityZipCode": "95476",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06097",
  "LEPC": "California Coastal Region",
  "FacilityLatDecDegs": "38.251883",
  "FacilityLongDecDegs": "-122.441304",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "ww.scwa.ca.gov",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 784901654,
  "ParentCompanyName": "Sonoma County Water Agency",
  "Company2Name": null,
  "CompanyDUNS": 74662503,
  "Company2DUNS": 0,
  "OperatorName": "Grant Davis",
  "OperatorStr1": "404 Aviation Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Santa Rosa",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95403",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Bendik",
  "RMPTitle": "Safety Officer",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071067",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-12-01 00:00:00",
  "SafetyInspectionBy": "Sonoma County CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.24917,
  "FRS_Long": -122.44028,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055557,
      "AltID": null,
      "FacilityID": 1000044887,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056460,
          "ProcessID": 1000055557,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067741,
          "ProcessID": 1000055557,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000067742,
          "ProcessID": 1000055557,
          "ChemicalID": 49,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567741,
          "ProcessID": 1000055557,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567742,
          "ProcessID": 1000055557,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044887,
      "SummaryText": "Sonoma County Water Agency (SCWA) operates the Sonoma Valley Treatment Plant, located on 8th Street East in the City of Sonoma, Sonoma County, California. This facility is is a wastewater treatment plant that is covered by the California Accidental Release Prevention (Cal-ARP) program and the EPA's Risk Management Plan (RMP) regulations because it has chlorine and sulfur dioxide onsite in excess of the respective RMP threshold quantities.\n\n\n\nIt is SCWA's policy to comply with the Cal-ARP and RMP regulatory requirements. SCWA employees, supervisors and managers are all responsible for complying with these regulations. Agency employees and managers are provided with training to familiarize them with their requirements and responsibilities. \n\n\n\nSCWA has developed a process safety and risk management program that documents the policies pertaining to the prevention of accidental releases. In addition, SCWA has conducted technical studies such as the Process Hazards Analysis and the Offsite Consequence Analysis to identify and evaluate potential hazards associated with the use of chlorine and sulfur dioxide at the Sonoma Valley Treatment Plant. SCWA has emergency procedures and an Emergency Operations Plan (EOP), and these are coordinated with County of Sonoma Fire and Emergency Services Department. \n\n \n\nA management system is in place for implementing the RMP and Cal-ARP regulations. This system defines the scope and purpose for each program element, procedures for implementation, roles and responsibilities, and the record-keeping requirements. The SCWA Safety Officer has responsibility to coordinate the implementation of the risk management program. Delegated responsibilities are outlined in the SCWA's written programs. \n\n\n\nAt the Sonoma Valley Treatment Plant, chlorine is used in the wastewater treatment process for odor control and disinfection. Chlorine is supplied in one-ton containers, which are stored inside a chlorine building. The room has capacity to store nine"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044887,
      "SummaryText": " one-ton containers of chlorine (18,000 pounds). Administrative controls are in place to ensure that the maximum number of containers never exceeds this number.\n\n\n\nIn addition to the chlorine containers, the chlorination system includes vacuum regulators, chlorinators and chlorine injectors, all connected by industry-standard pvc piping. The chlorine flow rate is set at the chlorinator to dose the correct amount of chlorine at the point of application. The design is inherently safe with the vacuum regulator placed directly on the ton container. This means that if there is any damage to the piping system downstream there will be a break in the vacuum, and the chlorine flow will stop at the regulator.\n\n\n\nSulfur dioxide is used for dechlorination prior to effluent discharge. Sulfur dioxide is also supplied in one-ton containers stored inside the same building. At no time will there be more than nine one-ton containers of sulfur dioxide (18,000 pounds). The sulfur dioxide system design is similar to that for chlorine with vacuum regulators, sulfonators and injectors, with the same inherently safe design using vacuum regulators directly connected to the ton containers. \n\n\n\nAll chlorine and sulfur dioxide equipment is housed inside the chlorine building. Leak detectors have been installed to monitor for chlorine and sulfur dioxide leaks. If a leak is detected, it triggers a local alarm, relays an alarm signal to the SCWA's Operations Center in Santa Rosa, and activates a scrubber system. \n\n\n\nIn developing the Offsite Consequence Analysis (OCA), the approach taken for chlorine was to follow the EPA Guidance for Wastewater Facilities. The guidance was used to help select the worst-case and alternative release scenarios, and to evaluate the hazard distances for both scenarios, and for both regulated substances. EPA's Landview program was used to estimate the population that would be affected by a release. Details of the OCA methodologies and the OCA results are included in r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044887,
      "SummaryText": "eports held by SCWA in Santa Rosa, CA.\n\n\n\nDuring the last five years, there have been no accidents involving chlorine or sulfur dioxide that resulted in any offsite impacts, and there have been no serious injuries or fatalities onsite. \n\n\n\nSCWA has implemented a comprehensive prevention program to minimize the potential for a catastrophic release of chlorine or sulfur dioxide at the Sonoma Valley Treatment Plant. Process safety information is available to employees, and Process Hazards Analyses (PHAs) have been conducted. External events were considered in the PHAs, and a seismic assessment has also been conducted. A management of change procedure has been implemented. Recommendations made by the PHA team to improve safety are being addressed. Following any system modifications, a pre-startup safety review procedure needs to be followed. \n\n\n\nStandard Operating Procedures (SOPs) have been developed for normal and emergency operations. The SOPs provide written operating instructions for operating the chlorine and sulfur dioxide systems, and they include procedures for container deliveries and container change-outs. Equipment inspections, testing and maintenance activities are performed on a routine basis and documented in a computerized maintenance management system (MAXIMO). All operators are state-certified treatment operators, and all operators and mechanics are required to be trained in the SOPs for the chlorine and sulfur dioxide systems. \n\n\n\nCompliance audits have been developed for the risk management program to verify compliance with the Cal-ARP and RMP regulations. SCWA has a procedure to investigate any incident or accident that results in the release of a reportable quantity of chlorine or sulfur dioxide. Incident investigation procedures include root cause analysis.\n\n\n\nSCWA operators and mechanics are trained as first responders under the HAZWOPER standard for emergency response. However, only members of the Emergency response Team are trained to respond t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044887,
      "SummaryText": "o an emergency. Guidance is provided to the operators and mechanics to help them distinguish between an incidental release and an emergency. In the event of an emergency, the procedures are to notify the response agencies, evacuate to a safe area, and assess the cause of the release, if this can be done safely. The emergency response plan has been coordinated with the local response agencies, and SCWA will cooperate with these agencies to coordinate any offsite response that may be required in an emergency. \n\n\n\nFollowing each PHA revalidation, SCWA implements recommendations to improve safety. These and other recommendations (developed in MOC reviews and compliance audits) are followed using an action tracking system, coordinated by the Safety Officer. SCWA is continually looking at new technologies to improve safety and to reduce or eliminate the use of chlorine and sulfur dioxide.\n\n\n\nIn summary, the design of the chlorine and sulfur dioxide systems at the SCWA Sonoma Valley Treatment Plant, and the implementation of the safety and risk management programs provide a high level of assurance that the risks associated with the use of chlorine and sulfur dioxide are being effectively managed."
    }
  ]
}