{
  "FacilityID": 1000000842,
  "FacilityName": "BEI Hawaii -  Hilo Facility, Hawaii",
  "FacilityStr1": "60 Kukio Road",
  "FacilityStr2": null,
  "FacilityCity": "Hilo",
  "FacilityState": "HI",
  "FacilityZipCode": "96720",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "15001",
  "LEPC": "Hawaii LEPC",
  "FacilityLatDecDegs": "19.728611",
  "FacilityLongDecDegs": "-155.054167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.beihawaii.com/bei_hawaii.htm",
  "FacilityEmailAddress": "szhai@beihawaii.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Phoenix V LLC",
  "Company2Name": null,
  "CompanyDUNS": 101471600,
  "Company2DUNS": 0,
  "OperatorName": "BEI Hawaii",
  "OperatorStr1": "311 Pacific Street",
  "OperatorStr2": null,
  "OperatorCity": "Honolulu",
  "OperatorStateFIPS": "HI",
  "OperatorZipCode": "96817",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carolyn Ambrose",
  "RMPTitle": "President, BEI Hawaii Distribution",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000022183",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-10-12 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-01-15 00:00:00",
  "DeRegistrationEffectiveDate": "2013-01-09 00:00:00",
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 19.73201,
  "FRS_Long": -155.05697,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001029,
      "AltID": "Chlorine",
      "FacilityID": 1000000842,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001109,
          "ProcessID": 1000001029,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001083,
          "ProcessID": 1000001029,
          "ChemicalID": 62,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501083,
          "ProcessID": 1000001029,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000842,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis Risk Management Plan (RMP) is prepared for BEI Hawaii - Hilo facility.  BEI Hawaii developed this site specific Risk Management Plans for BEI HawaiiA?s facility that are regulated under risk management program to comply with Environmental Protection Agency (EPA) Accidental Release Prevention requirements: Risk Management Programs under Clean Air Act Section 112(r) and to protect public safety and environment.  The goal of our risk management program is to prevent serious chemical accidents that could cause harm to our employees, the general public, and the environment and to reduce the potential impact of the accidental release.\n\nThis RMP consists of five chapters.  Chapter 1, Management, introduces the plans and describes the facility operations, management and responsibilities.  Chapter 2, Off-Site Consequence Analysis A? Hazardous Assessment, provides hazard release consequences and impact in worst case and alternative scenario, Chapter 3, Five-Year Accident History of Chlorine.  Chapter 4, Summary of Prevention Program, provides some safety information, hazard analysis, operation procedures, and prevention procedures.  Chapter 5, Summary of Emergency Response program.\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nBEI Hawaii believes in a clean and safe environment and is dedicated to meet all applicable environmental standards in the operation of its businesses and services.  BEI Hawaii has established comprehensive policies and procedures for the operations of its facilities.  The policy is a commitment to environmental compliance that assigns the responsibility of implementing the policy to designated individual or individuals to ensure compliance.  The purpose of the policy is to provide employees with a safe and healthy working environment, and to protect the environment from pollutions.\n\nPreservation of the environment is a commitment that must be shared by all employees.  Employees shall promptly report suspect"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000842,
      "SummaryText": "ed violations of environmental laws, regulations or permits to their supervisor who shall take immediate action to verify the report and, if confirmed, stop the violation and take remedial or other appropriate action.  The incident shall be promptly reported to BEI HawaiiA?s Regulatory Compliance Manager, who will assist in making any necessary reports to regulatory agencies.\n\nOverall approach to chemical safety begins with the premise that safety is everyoneA?s responsibility and working safely is a condition of employment. Workplace hazards are minimized through preventive measures such as facility and equipment design, purchase of less hazardous products and development of standard operating procedures. Control measures include facility inspections to discover potential problems, employee reports of hazardous conditions, training and a safety award program.\n\n2.  Stationary Source and Regulated Substance\n\nThe BEI Hawaii - Hilo facility is located at 60 Kuhio Avenue, Hilo, Hawaii.  The facility stores pesticides, fertilizers and industrial chemicals.  The products are warehoused at the facility and distributed to various locations throughout the Big Island.  The regulated substance handled at this storage/distribution facility is chlorine.  Chlorine is received in 150-lb and 1-ton Department of Transportation (DOT) approved cylinders.  BEI Hawaii receives chlorine from a chemical supplier and distributor located on the west coast.  The chlorine supplier is responsible for container inspection and maintenance.  On average, the BEI Hawaii facility stores approximately 40,000 lbs chlorine (this value can increase to ~70,000 lbs chlorine depending on shipping schedules).  Because bulk sales are made directly to customers, access to the facility is not restricted.\n\n3. Accidental Release Prevention Program and Chemical Specific Steps\n\nThe facility complies with applicable federal and state codes and regulations.  The facility maintains a Process Safety Management Plan th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000842,
      "SummaryText": "at was developed and is operated in accordance with recommendations from the Chlorine Institute.  The BEI Hawaii Process Safety Management Plan addresses:\nA?    process safety information (includes information on first aid and medical management procedures for chlorine)\nA?    process hazard analysis\nA?    operating procedures (including safe handling procedures for storage and loading)\nA?    training (including leak mitigation)\nA?    contractors\nA?    pre-startup review\nA?    mechanical integrity\nA?    hot work permits\nA?    management change\nA?    emergency planning and response (includes information on accident investigation and employee participation \nA?    compliance safety audits\n\n4.  Five-Year Accident History\n\nThe facility has had no reportable accidents during the last five years. \n\n5.  Emergency Response Program\n\nThe BEI Hawaii A? Hilo facility is classified as a non-responding facility.  As such, BEI Hawaii has developed an Emergency Action Plan to ensure employee/community safety, rather than a full-fledged emergency response with an in-house response team.  The BEI Hawaii - Hilo Facility has developed its own procedures as outlined in the BEI Hawaii Safety and Health Program incorporating information from Chlorine Institute Pamphlet 64, Emergency Response Plans for Chlorine Facilities.  BEI Hawaii has coordinated response to incident involving chlorine with the Hawaii Fire Department Hazmat Team located in Hilo.  Operators are capable, however, of responding to incidental releases such as routine tightening of a valve, for example. \n\nBEI Hawaii A? Hilo facility personnel will only perform defensive mitigation measures (i.e., secure areas, initiate water spray, etc.,) to limit the release until a response team arrives to establish the incident command.  We have discussed this program with the Local Emergency Planning Committee and the Hilo Fire Department.  In addition, BEI Hawaii has arranged with local response contractors to deal with potential chlorine releases at the facility. \n\n6. "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000842,
      "SummaryText": " Planned Changes to Improve Safety\n\nThere are no current plans to change storage practices at this facility. Chlorine use for swimming pools and sewage treatment is anticipated to diminish over the next few years as new disinfections methods are employed.  BEI Hawaii has already experienced reduced levels of chlorine at its facilities as a result of its efforts to educate and switch customers from chlorine gas to sodium hypochlorite (bleach).\n\n"
    }
  ]
}