{
  "FacilityID": 1000058641,
  "FacilityName": "Arctic Glacier Vernon, Inc.",
  "FacilityStr1": "2970 E. 50th Street",
  "FacilityStr2": null,
  "FacilityCity": "Vernon",
  "FacilityState": "CA",
  "FacilityZipCode": "90058",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.997869",
  "FacilityLongDecDegs": "-118.215865",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "unionice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9166455,
  "ParentCompanyName": "Arctic Glacier Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9166455,
  "Company2DUNS": null,
  "OperatorName": "Arctic Glacier Inc.",
  "OperatorStr1": "2970 E. 50th Street",
  "OperatorStr2": null,
  "OperatorCity": "Vernon",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90058",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000194078",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-11-30 00:00:00",
  "SafetyInspectionBy": "City of Vernon Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-07-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-07-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-07-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.997869,
  "FRS_Long": -118.215865,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073230,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000058641,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000090440,
          "ProcessID": 1000073230,
          "ChemicalID": 56,
          "Quantity": 30850.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000074413,
          "ProcessID": 1000073230,
          "NAICSCode": "312113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000061413,
              "Process_NAICS_ID": 1000074413,
              "SafetyReviewDate": "2015-02-23 00:00:00",
              "PHA_Date": "2018-12-08 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-06-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-02-01 00:00:00",
              "TrainingReviewDate": "2016-02-23 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-02-23 00:00:00",
              "EquipmentInspectionDate": "2016-05-01 00:00:00",
              "EquipmentTested": "Ammonia Compressors",
              "ChangeMgmtDate": "2007-07-16 00:00:00",
              "ChangeMgmtReviewDate": "2015-02-23 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2015-02-23 00:00:00",
              "AuditCompletionDate": "2016-09-23 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-02-23 00:00:00",
              "HotWorkPermitReviewDate": "2016-02-23 00:00:00",
              "ContractorSafetyReviewDate": "2015-06-01 00:00:00",
              "ContractorSafetyEvalDate": "2016-02-23 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000075112,
                  "PreventionProgram3ID": 1000061413,
                  "ProcessChemicalID": 1000090440
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000058641,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Vernon Fire Department",
    "CoordinatingAgencyPhone": "3235838811",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000058641,
      "SummaryText": "dation studies generated mitigation measures (recommendations) to improve safety at the Arctic Glacier Vernon, Inc. facility located in Vernon, California.  The mitigation measures include additional training, key maintenance   related tests/inspection, and enhanced emergency response policies and procedures.  The Arctic Glacier Vernon, Inc. safety committee is planning to complete several items, including all outstanding and new recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\r\n\r\n1. Continue to train all employees in the facility Safety Plan/Programs.\r\n\r\n2. Continue to have employee involvement in Safety Plan Development.\r\n\r\n3. Continue employee involvement through safety team participation.\r\n\r\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000058641,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nThe Union Ice Standard is second to none. Our water filtration and purification systems exceed all national and international standards delivering to you the highest quality ice product available. \r\n\r\nOn March 1, 2007 Arctic Glacier Inc. had acquired the assets and operations of The Union Ice Company.\r\n\r\nArctic Glacier Income Fund, through its wholly-owned operating company, Arctic Glacier Inc., is a leading producer, marketer and distributor of high-quality packaged ice to consumers in Canada and the United States, primarily under the brand name of Arctic Glacier; Premium Ice. Arctic Glacier operates 39 production plants and 48 distribution facilities across Canada and the northeastern, central and western United States servicing more than 75,000 retail accounts. Arctic Glacier also licenses its trade names and proprietary technology to independently owned companies in Canada and the United States under franchise and license agreements.\r\n\r\nThe Arctic Glacier Vernon, Inc. management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  Arctic Glacier Vernon, Inc.'s safety and environmental policies are administered by the Senior Plant Manager with the assistance of the Chief Engineer, who conducts periodic inspections of the facility to ensure compliance, and oversees the entire safety and environmental programs, including the PSM/RMP/CalARP Program. \r\n\r\nArctic Glacier Vernon, Inc. is a non-responding facility.  The facility's Emergency Coordinators (Chief Engineer, Regional Manager, and/or Senior Plant Manager) have discussed an emergency response plan with the City of Vernon Fire Department (Incident Commander).  In an emergency (ammonia release), the Emergency Coordinator role is to alert employees of an evacuation and to ensure all employees and visitors/c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000058641,
      "SummaryText": ".\r\n\r\nAdministrative Measures:  The facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\r\n\r\n- IIAR Bulletin 107, Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie ins \r\n- IIAR Bulletin 109, Minimum Safety Criteria for a Safe Ammonia Refrigeration System\r\n- IIAR Bulletin 110, Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\r\n- IIAR, A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\r\n\r\nThe Arctic Glacier Vernon, Inc. ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the Arctic Glacier Vernon, Inc. operates in accordance with the California Accidental Release Prevention (CalARP) Program, CalOSHA PSM Program, and EPA RMP Program.  It is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia. For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  The facility also utilizes fixed ammonia leak detectors to alert personnel of a possible ammonia leak, to call the fire department when the concentration has reached 25 ppm, and to shut down the system at 10,000 ppm.  Pressure relief valves on all pressure vessels protect the equipment from over-pressurization. \r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nBased on the above definition and an investigation into the facility's accident history conducted at the time of the Process Hazard Analysis Revalidation study (June 8, 2016), there have been no significant relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000058641,
      "SummaryText": "uid ammonia to Evaporators E-1 to E-16, and then the 'wet suction' (liquid/vapor mix) ammonia is sent back to the -10oF Recirculated Liquid Recirculation Package RRP-2.  The liquid settles to the bottom and the vapor rises to the top and is drawn off by Compressors C-3, C-4, and C-5. The +10°F Recirculated Liquid Recirculation Package RRP-1 supplies sub-cooled liquid ammonia to the Ice Machines and receives ammonia vapor/liquid mix from the Ice Machines.  In the RRP-1, liquid settles to the bottom and vapor rises to the top and is drawn by Compressors C-1, C-2, C-3, C-4, and C-6.  From the compressors, the ammonia vapor is discharged to the Evaporative Condensers, Evaporators E-1 to E-16, and Ice Machines.  The Heat Exchanger receives high stage discharge from Compressors C-1 - C-6 and discharges high pressure liquid to the High Pressure Receiver.  The ammonia leaving the Evaporative Condensers is high pressure liquid which gravity flows into the High Pressure Receiver via the Thermosyphon Receiver in order to repeat the refrigeration cycle.\r\n\r\nAll process equipment and piping are designed according to ASME standards.   All ASME vessels and compressors are equipped with pressure relief valves which are set to actuate at 250 psig except for the pressure relief valves on the oil pots, oil separator on the compressors, and Evaporative Condensers which actuate at 300 psig.  All relief valves except for the relief valve on the evaporative condensers are tied to a common header that vent to the Ammonia Diffusion Tank.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\r\n\r\nIn order to operate the ammonia refrigeration system, the facility complies with the California Occupational Safety and Health Administration (CalOSHA), Process Safety Management (PSM) standard (Section 5189 of Title 8, CCR), the EPA Risk Management Program (RMP), and the California Emergency Management Agency (Cal EMA) California Accidental Release Prevention (CalARP) Program"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000058641,
      "SummaryText": "ses of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (June 2011 -June 2016). In addition, there have been no releases meeting the accident criteria described above or near misses that warranted an internal incident investigation.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe facility has an Emergency Action Plan (plan) in effect.  This Plan was designed to meet the following objectives:  \r\n\r\n- save lives;\r\n- minimize and avoid injuries;\r\n- protect the environment; and\r\n- minimize property damage.\r\n\r\nThe Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations.  \r\n\r\nArctic Glacier Vernon, Inc. personnel circulate throughout the plant, taking note of unusual conditions in any portion of the system.  In the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger and the supervisor.  The supervisor then notifies the Regional Manager/Senior Plant Manager/Chief Engineer/designee who will determine what procedures and personnel are necessary to remedy the problem.  Emergency agencies will also be notified as necessary as outlined in the Emergency Action Plan.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Three-Year Compliance Audit was performed on February 23, 2015.  The Process Hazard Analysis (PHA) Revalidation was performed on June 8, 2016 to satisfy the five year update requirements.  The status of the recommendations resulting from the previous Process Hazard Analysis (2011) was reviewed during the PHA Revalidation study.  The 2015 Three-Year Compliance Audit and the 2016 Process Hazard Analysis Revali"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000058641,
      "SummaryText": "ontractors have exited the building safely.  The Emergency Coordinator immediately calls 911 while waiting for City of Vernon Fire Department to arrive at the scene.  The rest of the employees are to be evacuated from the facility to a designated area.  The contact information for the Emergency Coordinators and agencies are detailed in the Arctic Glacier Vernon Facility's Emergency Action Plan included in the PSM/RMP/CalARP Program. \r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe Arctic Glacier Vernon, Inc. facility is located at 2970 East 50th Street in Vernon, California, which is located approximately 3.6 miles east of Interstate 110, 3.2 miles west of Interstate 710, and 2 miles south of Interstate 5. The area immediately surrounding the facility is urban.  The facility was constructed and began operations in 2006.  \r\n\r\nThe primary business of Arctic Glacier Vernon, Inc. is to produce and distribute ice.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 30,850 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for the production and distribution of ice.  Typical operating conditions range from 10 psig on the low pressure side of the system to 180 psig on the high side.  Similar to a household refrigerator, there are no expected leaks or releases of ammonia from the refrigeration system at Arctic Glacier Vernon, Inc., which is a closed-loop system.\r\n\r\nHigh pressure liquid from the High Pressure Receiver is supplied to the Flash Economizer.  From the Flash Economizer, the ammonia is fed to the -10°F and +10°F Recirculated Liquid Recirculation Packages.  The -10°F Recirculated Liquid Recirculation Package RRP-2 supplies sub-cooled liq"
    }
  ]
}