{
  "FacilityID": 1000093875,
  "FacilityName": "Magic Valley Generation",
  "FacilityStr1": "3333 N. McColl Road",
  "FacilityStr2": null,
  "FacilityCity": "Edinburg",
  "FacilityState": "TX",
  "FacilityZipCode": "78541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.340600",
  "FacilityLongDecDegs": "-098.191520",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Calpine Construction Finance Company, LP",
  "Company2Name": null,
  "CompanyDUNS": 112710876,
  "Company2DUNS": 112710876,
  "OperatorName": "Calpine Construction Finance Co, LP",
  "OperatorStr1": "3333 N. McColl Road",
  "OperatorStr2": null,
  "OperatorCity": "Edinburg",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78541",
  "OperatorZipCodeExt": null,
  "RMPContact": "Charles Randall",
  "RMPTitle": "EH&S Specialist III",
  "FTE": 25,
  "OtherEPAFacilityID": "TX 0116751",
  "EPAFacilityID": "100000175696",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-08-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 26.32042,
  "FRS_Long": -98.19165,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116478,
      "AltID": "Storage and Use for SCR",
      "FacilityID": 1000093875,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117893,
          "ProcessID": 1000116478,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145638,
          "ProcessID": 1000116478,
          "ChemicalID": 56,
          "Quantity": 98880.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000645638,
          "ProcessID": 1000116478,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093875,
      "SummaryText": "Magic Valley Generation (MVG) is a state-of-the-art natural gas-fired combined cycle power generation facility located in southwestern Texas within the city limits of Edinburg.  The power station uses anhydrous ammonia for the selective catalytic reduction (SCR) NOx emission control system.  The ammonia is stored in two 12,000-gallon aboveground storage tanks.\n\n\n\nCalpine recognizes the responsibility in protecting employees and the environment against the hazards of an unintentional release of ammonia.  The safety and health of all MVG employees and the surrounding community is of upmost importance.  The control of accidents associated with ammonia usage at the plant will continue to be a primary responsibility of all personnel.  Calpine believes that employee participation is a key component in ensuring a successful process safety and risk management program.  Operating employees have been deeply involved in the PSM/RMP program development and implementation.  Additionally, the emergency response program has been developed with the cooperation and support of the Hidalgo County Risk Management Department and the City of Edinburg Fire Department.\n\n\n\nPrevention Program\n\nPer OSHA requirements, Calpine has prepared a written Process Safety Management (PSM) program for the ammonia process.  The PSM was developed for the prevention or minimization of consequences of catastrophic releases of anhydrous ammonia.  The following summary describes the system in place to implement the PSM and RMP prevention program:\n\n1) Employee Participation - Calpine actively encourages employees to participate in PSM and accident prevention.\n\n2) Process Safety Information - Calpine maintains a compilation of written process safety information  including technical documents used for reference in maintaining safe operations of the process. NH3 tanks are located outside, therefore a ventilation system design is not applicable.\n\n3) Process Hazard Analysis - Calpine has conducted an evaluation of "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093875,
      "SummaryText": "hazards associated with the process using the HAZOP analysis technique.  The process has been systematically examined to identify hazards and ensure adequate controls are in place.\n\n4) Operating Procedures - Calpine maintains written procedures that address various modes of process operations that can be used as a reference by experienced operators and provide a basis for consistent training of new operators.\n\n5) Training - Calpine has a comprehensive training program for all employees involved in operating the anhydrous ammonia process.  In addition to initial training, all operators receive refresher training.\n\n6) Contractors - Procedures have been implemented to ensure contractors perform their work in a safe manner and that they have the appropriate skill level and knowledge to work on or near process equipment.\n\n7) Pre-startup Safety Review - Calpine conducts a pre-startup safety review for any new facility or facility modification that requires a change in process safety information.\n\n8) Mechanical Integrity - Calpine has established a system of procedures and practices to maintain process equipment in a safe operating condition.  Maintenance personnel receive training to help ensure that they can perform their work in a safe manner.\n\n9) Hot Work Permit Program - Calpine has developed and implemented a hot work program that is designed to control spark-producing activities and to ensure adequate precautions are in place prior to working in the process area.\n\n10) Management of Change - Calpine has established a system to manage changes to the process that includes a review and authorization of changes.  Changes are reviewed to ensure that adequate controls are in place to manage any new hazards to and verify that existing controls have not been compromised by the change.\n\n11) Incident Investigation - Calpine promptly investigates all incidents to identify the cause of the incident and to develop corrective actions to prevent a recurrence or similar incident.\n\n1"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093875,
      "SummaryText": "2) Compliance Audit - Calpine periodically conducts an audit to determine whether the procedures and practices required by the PSM/RMP program are being properly implemented.\n\n\n\nAccident History\n\nThe anhydrous ammonia process at MVG became operational in May 2001.  No events which qualify as reportable on the 5-year accident history have occurred.\n\n\n\nEmergency Response\n\nIn the unforeseen event of an ammonia release, employees are instructed to activate shutdown procedures, evacuate the plant, and immediately notify local emergency response teams.  The overall emergency response program for MVG has been coordinated with the Hidalgo County Local Emergency Planning Committee (LEPC) and the City of Edinburg Fire Department.\n\n\n\nSafety Features\n\nThe anhydrous ammonia process at MVG has hazards that must be managed to ensure continued safe operation.  In addition to MVG's Prevention Program, the process has safety features to assist in containing/controlling a release, to quickly detect a release, and to reduce the consequences of a release.  In addition to ammonia detectors and an audible alarm system, isolation valves, automated shutdown systems, atmospheric relief devices, a water deluge system, and a reinforced concrete containment basin are provided to provide release containment capabilities.  \n\n\n\nPlanned Changes to Improve Safety\n\nCalpine expects to improve safety performance by emphasizing employee participation.  MVG management and system operators will be integral in verifying process information, maintaining update operating procedures, and conducting preventative maintenance inspections.  All recommendations developed during the Process Hazard Analysis were designed to improve the safety performance of the anhydrous ammonia process.  Calpine expects to evaluate each recommendation in a timely manner and implement those recommendations that will reduce the possiblity of a release and/or mitigate the consequences of an unintentional release."
    }
  ]
}