{
  "FacilityID": 1000028944,
  "FacilityName": "Shamrock Foods Company - Albuquerque",
  "FacilityStr1": "2 Shamrock Way Road",
  "FacilityStr2": null,
  "FacilityCity": "Albuquerque",
  "FacilityState": "NM",
  "FacilityZipCode": "87121",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35001",
  "LEPC": "Bernalillo LEPC",
  "FacilityLatDecDegs": "35.071997",
  "FacilityLongDecDegs": "-106.794437",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Shamrock Foods Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Shamrock Foods Company",
  "OperatorStr1": "2 Shamrock Way Road",
  "OperatorStr2": null,
  "OperatorCity": "Albuquerque",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "87121",
  "OperatorZipCodeExt": null,
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199082",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Albuqueque (HA used \"Liquified by Pressure\")",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000035335,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000028944,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000042805,
          "ProcessID": 1000035335,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000035674,
          "ProcessID": 1000035335,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000030902,
              "Process_NAICS_ID": 1000035674,
              "SafetyReviewDate": "2012-05-22 00:00:00",
              "PHA_Date": "2012-05-22 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 1,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-05-22 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Ammnonia Diffusion Tank, UPS for control system",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-02-23 00:00:00",
              "TrainingReviewDate": "2012-05-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Classroom NH3 HAZCOM and Leak Response",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "HAZCOM Written",
              "MaintenanceReviewDate": "2012-02-23 00:00:00",
              "EquipmentInspectionDate": "2012-02-25 00:00:00",
              "EquipmentTested": "Completion date for Monthly Service Inspections by refrigeration contractor, Apex Refrigeration:  Work Order 76577",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2011-05-22 00:00:00",
              "PreStartupReviewDate": "2007-05-17 00:00:00",
              "ComplianceAuditDate": "2011-11-01 00:00:00",
              "AuditCompletionDate": "2012-11-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-05-22 00:00:00",
              "HotWorkPermitReviewDate": "2012-05-22 00:00:00",
              "ContractorSafetyReviewDate": "2012-05-22 00:00:00",
              "ContractorSafetyEvalDate": "2012-05-02 00:00:00",
              "CBI_Flag": 0,
              "Description": "The ammonia process is a mechaincal refrigeration system, which consists of equipment located in the Refrigeration Equipment Room and indoor Refrigerated Areas.The Preventation Program applies to the system as a whole.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000036890,
                  "PreventionProgram3ID": 1000030902,
                  "ProcessChemicalID": 1000042805
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000028944,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2011-12-06 00:00:00",
    "ERTrainingDate": "2012-01-25 00:00:00",
    "CoordinatingAgencyName": "Albuquerque - Bernalillo LEPC",
    "CoordinatingAgencyPhone": "5057507681",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028944,
      "SummaryText": "SCOPE\n\nThe EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA.  The following areas are addressed in this summary:\n\n-Accidental Release Prevention and Emergency Response Policies\n\n-Stationary Source Activities and Regulated Substances Handled\n\n-Worst-Case and Alternative-Case Release Scenarios\n\n-Prevention Program\n\n-Five-Year Accident History\n\n-Emergency Response Program\n\n-Planned Changes to Improve Safety\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nAs the Shamrock facility operator, Shamrock is committed to complying with all of the regulatory requirements of the EPA Risk Management Program. Shamrock has developed the Shamrock Risk Management Plan / Process Safety Management (RMP/PSM) Manual to document policies addressing the implementation of these regulations.  The PSM sections pertain to the prevention of accidental releases and include the Process Hazard Analysis study and procedures for operating, training, maintenance and others. The RMP sections pertain to management systems and emergency response and include the Hazard Assessment (Offsite Consequence Analysis) Report.\n\n\n\n\n\nSTATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\n\nThe Shamrock Albuquerque facility will provide product cooling, processing and short-term storage for fresh vegetables.  This processing includes cooling, cleaning, cutting and packaging vegetables. \n\n\n\nThe facility is located in a rural area on the outskirts of Albuquerque. Ammonia will be used as the refrigerant in the Main Refrigeration System (\"System\"). This is a direct, mechanical refrigeration system with an ammonia inventory of over 10,000 pounds. The ammonia equipment is located both inside and outside.\n\n\n\nWORST-CASE SCENARIO ANALYSIS\n\n\n\nHAZARD ASSESSMENT \n\nThe regulation requires that the Worst-Case Release Scenario use the ammonia quantity in the largest vessel or pipe.  \n\nThe regulation allows the facility to also select the Alte"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028944,
      "SummaryText": "rnate-Case Scenario.\n\n\n\nIn May of 2012, no additional sensitive receptors were identified when using CAMEO software suite with current available census data layers. \n\n\n\nNOTE: It is important to consider that the Worst-Case Scenario is extremely unlikely to occur since this scenario does not consider any safety features of the system - in either design or operation.  The scenario parameters are established by the regulation to provide uniformity for dialog between the industry, community, and regulatory agencies.\n\n\n\nPREVENTION PROGRAM\n\nShamrock's Prevention Program is described in the RMP/PSM Manual.  The RMP Prevention Program is equivalent to OSHA's Process Safety Management Program (PSM).  The Prevention Program implemented by Shamrock is essential to help prevent releases and to minimize the effects if a release does occur.\n\nKey objectives of Shamrock Prevention Program are briefly described below:\n\n\n\n1. Maintain current and complete refrigeration system technical information. (Addressed under the Process Safety Information chapter)\n\n2. Thorough team evaluation of the refrigeration system.  The evaluation considers a number of potential problems including: mechanical problems, human errors, and external events (e.g., earthquakes).  All safety recommendations developed by the team are reviewed and addressed by Shamrock.  (Addressed under Process Hazard Analysis chapter.)\n\n3. Written procedures and policies that establish how the refrigeration system should be operated and maintained and how to investigate accidental releases. (Addressed under Operating Procedures, Mechanical Integrity, and Incident Investigation chapters.) \n\n4. Certification of refrigeration operators to safely operate the refrigeration system.  Shamrock has opted to utilize industry partners & contractors to perform operations and maintenance for the system.  The contractor, APEX, is the also the installation contractor. Onsite technicians have limited authority on the system.  Shamrock certifies"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028944,
      "SummaryText": " its onsite operators following completion of operator training and Shamrock's confirmation of the operator's ability to apply what they have learned.  (Addressed under Training chapter.)\n\n5. Employee involvement in the Prevention Program.  This is addressed on two levels.  First, refrigeration equipment operators participate in the planning and evaluation of the Prevention Programs (e.g., Process Hazard Analysis study team, writing and/or reviewing operating procedures, Incident Investigation team, etc.).  This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to-day activities.  \n\nSecond, all employees (direct hires and contract) at this facility receive ammonia awareness training.  Additionally, they have access to the RMP/PSM information.  These activities improve the overall safety of the employees. (Both levels are addressed under Employee Participation chapter)\n\n6. Implementation of additional measures when changes are planned (procedural or mechanical).  These measures begin before any changes are made and may include a Process Hazard Analysis, operator training, and Process Safety Information updates plus other measures required by their Management of Change Procedure.  \n\nIf a mechanical change is required and for maintenance contracts, Shamrock follows the Shamrock procedure for selecting a contractor based on the company's experience and safety history. Additionally, if welding, grinding, or other \"Hot Work\" occurs close to the refrigeration system, a Shamrock Hot Work permit is required.  The purpose of the permit and the associated Hot Work procedure is to minimize the possibility of a fire. \n\nFollowing completion of a mechanical change, a pre-startup safety review is required before the system can be started. (These areas are addressed under Management of Change, Contractor Qualifications, Hot Work Permit, and Pre-Start-up Safety Review chapters.)\n\n7. Verification of Shamrock's compliance with the RMP/"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028944,
      "SummaryText": "PSM program.  This self-audit process is an important tool to confirm whether each of the elements in the Prevention Program (and the Risk Management Program) has been implemented and properly documented by Shamrock personnel. Shamrock follows the Shamrock Management System procedure to address any shortcomings, which the audit may find. (Addressed under Compliance Audit and Management System chapters.)   \n\n8. Minimize employee injury and illness.  (Addressed under Shamrock's Illness and Injury Prevention Program.)\n\n\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nNo accidents or near misses have occurred at the facility since startup in 2007.\n\n\n\n  \n\nEMERGENCY RESPONSE PROGRAM\n\nShamrock's Emergency Response Program is described in their Emergency Response Plan and Site Safety Plan for the Albuquerque facility.\n\n\n\nThese plans include procedures for evacuations, notifying responders and governmental agencies.  The plans also includes first aid procedures for immediate care and instructions for follow-up medical care when necessary.   The plans address training requirements for employees including production employees, supervisors, managers, and operators.  Evacuation drills are an important part of the training. \n\nUnder Shamrock's emergency response policy, employees who have been trained as \"First Responders - Awareness Level\" may initially respond to releases that can be addressed without entering the danger area (i.e. de-energizing equipment).  At this time, \"First Responders - Awareness Level\" authority is addressed through the use of the refrigeration contractors who have remote access to system controls in order to provide mitigation during release events: no additional first responder training is provided.  Shamrock will evacuate affected area, begin notification process and rely on off-site responders (e.g., the fire department and refrigeration contractor). \n\n\n\n\n\n"
    }
  ]
}