{
  "FacilityID": 1000050701,
  "FacilityName": "Lineage Logistics Albany-2",
  "FacilityStr1": "1019 Worth Street",
  "FacilityStr2": null,
  "FacilityCity": "Albany",
  "FacilityState": "GA",
  "FacilityZipCode": "31705",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13095",
  "LEPC": "Dougherty County LEPC",
  "FacilityLatDecDegs": "31.559783",
  "FacilityLongDecDegs": "-084.117767",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.lineagelogistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Lineage Logistics LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lineage Logistics Holdings, LLC",
  "OperatorStr1": "1 Park Plaza, Suite 550",
  "OperatorStr2": null,
  "OperatorCity": "Irvine",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92614",
  "OperatorZipCodeExt": null,
  "RMPContact": "Billy Smith",
  "RMPTitle": "General Manager",
  "FTE": 141,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000191972",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-08-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-10-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-07-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-07-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-07-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000063891,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000050701,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000065051,
          "ProcessID": 1000063891,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000078953,
          "ProcessID": 1000063891,
          "ChemicalID": 56,
          "Quantity": 29800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000578953,
          "ProcessID": 1000063891,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050701,
      "SummaryText": "This Risk Management Program is designed to comply with the Environmental Protection Agency regulations detailed in 40 CFR Part 68.  The stationary source is the ammonia refrigeration system.  The only RMP regulated substance in this facility is anhydrous ammonia--which is classified as a toxic substance, liquefied under pressure.\n\n\n\nThis is a RMP five-year re-submission for an ammonia refrigeration system.\n\n\n\nThe refrigeration system in this facility contains anhydrous ammonia. This process does not meet the requirements of Program 1. It is subject to OSHA's PSM standard.  Therefore, this RMP is written to meet the EPA Program 3 level of compliance.\n\n\n\nACCIDENTAL RELEASE PREVENTION POLICY\n\nThis facility follows a rigorous RMP & Process Safety Management Program to prevent the accidental release of ammonia. The program is also in compliance with Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of 29 CFR 1910.119. Employees and management participate and cooperate in the PSM & RMP programs to maintain a work environment that is safe to employees, the community, and the environment.\n\n\n\nEMERGENCY RESPONSE POLICY\n\nThe facility has a comprehensive emergency response plan that meets established criteria. The plan will be provided to the local LEPC for review.\n\n\n\nPROCESS OVERVIEW \n\nThis food distribution facility operates a multi-temperature, anhydrous ammonia (R-717) refrigeration system with an engine room capacities from -30A?F low-temperature suction up to a +50A?F high-temperature suction. This refrigeration system is a liquid re-circulating system and is designed to operate with an overfeed-ratio of approximately 3:1 for evaporative air units. Anhydrous ammonia (R-717) refrigerant is a Group II refrigerant. Rotary screw compressors are used in the refrigeration system. Engine room electrical classification is NEMA-1.\n\n\n\nThis ammonia refrigeration system contains nine interconnected sub-systems:\n\n\n\n1. Low-temperature system.\n\n2. Me"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050701,
      "SummaryText": "dium-temperature system.\n\n3. High-temperature system.\n\n4. Thermosyphon pilot receiver system.\n\n5. High-pressure receiver system.\n\n6. Condenser system.\n\n7. Compressor low-temperature system.\n\n8. Compressor medium-temperature system.\n\n9. Compressor high-temperature system.\n\n\n\nMajor refrigeration equipment includes the air units, re-circulator vessels, compressors, evaporative condensers, and the receiver .\n\n\n\nThe air-cooling evaporators are fed from liquid pumps on the re-circulator packages. The feed rate is approximately 3:1. The efficiency of this system is increased by circulating up to three times the amount of the refrigerant needed by the evaporator for the rated capacity. This system operates in part as a single-stage system and also a two-stage compression system.\n\n\n\nThe refrigerant re-circulators are pressure vessels.  The ammonia liquid is pumped from these vessels to the evaporative air units where thirty- percent of the liquid mass is evaporated. The liquid-vapor mixture is returned to the vessel where the liquid is separated from the vapor. The compressors take the ammonia vapor from these vessel and compress it. These vessels connect to the compressors (dry suction) and with the evaporators (wet suction and pumped liquid).\n\n\n\nThe compressors pull ammonia vapor from the re-circulators and compress it to a high-pressure gas. The gas goes to the condensers where it is cooled and condensed into a liquid. The compressors are connect to the re-circulators and condensers. \n\n\n\nThe evaporative condensers use axial fans in a draw-through configuration. High-pressure ammonia-vapor flows from the high-stage compressors to the evaporative condenser where heat is removed. The vapor is condensed into a high-pressure liquid using air and water flowing over the outside of the condensing pipe coils. High-pressure liquid from the condenser is drained to the thermosyphon pilot-receiver and overflows to the controlled-pressure receiver. The condenser has connections with th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050701,
      "SummaryText": "e compressor discharge lined, the thermosyphon pilot-receiver, and the purger.\n\n\n\n The reciever is a pressure vessle tha receives liquid ammonia from the condensers. The liquid is stored and distributed to other vessels as needed. The storage quantity is kept at a minimal level sufficient to accomodate fluctuating refrigeration loads. This vessel is connected to the other vessels.\n\n\n\nMITIGATION MEASURES\n\nThere are some mitigating measures in place. Although there are doors and windows, the overall enclosure acts as a dike creating liquid pooling and limiting the liquid run-off. Ammonia leak detection is installed in this area that sounds alarms and starts emergency ventilation. The emergency ventilation is automatically controlled and discharges the engine room air through the roof, which creates a lower level of concentration in the engine room for responders. It also starts air dispersion at lower concentration levels and disperses the ammonia with greater air turbulence. \n\n\n\nHAZARD ASSESSMENT\n\nThe hazard assessment was conducted to meet the RMP Off-site Consequence Analysis requirements for the ammonia refrigeration system. The only RMP regulated substance at this facility is anhydrous ammonia, which is classified is as a toxic substance, liquefied under pressure. The definitions and parameters for the release scenarios are based on the \"Risk Management Program Guidance for Ammonia Refrigeration\" as described in Chapter 4: Off-site Consequence Analysis.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\nThis facility follows the OSHA Process Safety Management Program. Various special elements have been incorporated into this program to meet the additional EPA requirements for the RMP. Following is an overview.\n\n\n\nParticipation - The Participation Program is an asset to both employees at the site and to the community as a whole.  As a general rule, employees who are fully involved have a greater sense of responsibility; they are more likely to catch the problems that can cause accid"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050701,
      "SummaryText": "ents. Employee awareness is for employees, not directly involved with the process, this includes knowing the hazards, the safety rules, warning signs, and evacuation procedures. All employees have access to the PSM Program. Involved employees participate directly in every phrase of the PSM program, including conducting the PHA, developing or reviewing operating procedures, reviewing incident investigations, and conducting mechanical integrity and compliance audits.\n\nCommunity involvement is through coordination and cooperation with the local Fire department and LEPC.\n\n\n\nProcess Safety Information - Process Safety Information includes a wide variety of books, manuals, and process information. These are available to employees that operate, maintain, or repair the process equipment or piping. There are three major categories of information: ammonia data such as MSDS, safety information, first aid, chemical properties, IIAR safety bulletins, etc.; process information such as piping & instrumentation diagrams (P&ID's), block flow diagram, mass flow balance, design codes and standards, pressure safety relief settings, safety system/devices, ventilation system design, operating procedures, safe operating limits, and ramification of process deviation; and process equipment information such as equipment specifications, electrical classifications, materials of construction, installation manuals, operating and maintenance manuals, and manufacturer's manuals.\n\n\n\nProcess Hazard Analysis - A Process Hazard Analysis (PHA) was completed using the \"What-if\" technique.  This addressed hazards, engineering and administrative controls, consequences of failure of engineering and administrative controls, facility siting, human factors, and a qualitative evaluation of the possible safety and health impact. The results of the PHA were prioritized and incorporated into a PHA Findings Report for follow-up as a corrective action log.\n\n\n\nStandard Operating Procedures - SOPs are provided for ea"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050701,
      "SummaryText": "ch compressor, condenser, ammonia vessel and oil pot, and evaporator. Topics include general information such items as objectives, hazards, location, equipment needed, P&ID's, task flow diagrams, and step-by-step procedures with specific warnings and comments. The SOPs cover different phases of operations such as: initial startup; normal, temporary and emergency operations; emergency shutdowns; and startup following a shutdown.\n\n\n\nTraining - All employees are who are involved with anhydrous ammonia have been properly trained, at a minimum, in understanding the MSDS, routine refrigeration system operation, emergency refrigeration system operation, emergency and normal refrigeration safety practices, and, if appropriate, the individual's role in the emergency response plan.\n\n\n\nContractors - This site follows strict guidelines for qualifying contractors who directly influence the safety of the process or the system. The contractor qualification procedure ensures that contractors and their employees are fully aware of the potential dangers involved with the ammonia process that contractors understand their responsibility and train their people, and that a contractor's safety record is considered in reviewing the bids. \n\n\n\nPre-Startup Review - Pre-startup safety reviews are required on all new or modified equipment/systems. This involves process safety information, process hazard analysis, training, safety procedures, operating procedures, and verification that construction and equipment are in accord with the design specifications.\n\n\n\nMechanical Integrity Audits - The purpose of the Mechanical Integrity Audit program is to ensure that the equipment is maintained in good working condition.  These are performed on all compressors, condensers, evaporators, pressure vessels, piping system, relief and vent systems and devices, emergency shutdown systems, controls, and pumps.\n\n\n\nHot Work Permits - This permit process is to protect against fire, explosion and other dangers res"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000050701,
      "SummaryText": "ulting from hot work (welding and cutting outside the designated areas).  Hot work permits must be obtained before any work is done outside the shop area. The Maintenance Supervisor reviews and issues the permits to insure all fire prevention and protection rules are met. Permits indicate the appropriate dates and the work to be done. The permits are kept on file until workers have completed the hot work operations.\n\n\n\nManagement of Change - The Management of Change (MOC) procedure requires that all changes (even \"replacement in kind\") be reviewed to see if there is a possible negative effect. The MOC review addresses the technical basis for the change, the impact on safety and health, modifications to operating procedures, and authorization requirements for the proposed change.  Employees affected by the change are informed of the change before startup and trained in the proper procedures.\n\n\n\nIncident Investigation - An incident investigation shall be performed any time there is an incident which resulted in, or which could reasonably have resulted in, a catastrophic release of ammonia. The purpose is to gain information that could prevent further accidents and to identify weaknesses in the emergency response plan that need to be addressed. Investigations are initiated promptly using a trained team. The findings and recommendations will be studied and appropriate corrective action taken.\n\n\n\nEmergency Response Plan - This facility has a comprehensive emergency response plan that meets established criteria.  This plan will be coordinated with the local fire department and the Local Emergency Planning Committee (LEPC).\n\n\n\nCompliance Audits and RMP Revisions - To insure that all areas of PSM and RMP programs are followed, the company requires compliance audits.  At a minimum, these must be completed every three years. Resubmission of the RMP shall be done according to Section 6.2 to meet the OCA requirements.\n\n\n\nACCIDENT HISTORY - LAST FIVE YEARS\n\nThere have been no RM"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000050701,
      "SummaryText": "P reportable accidents within the past five years.\n\n"
    }
  ]
}