{
  "FacilityID": 1000079104,
  "FacilityName": "Cottonwood Coop Oil Co.",
  "FacilityStr1": "3786 CO RD 9 999 W 1ST St.",
  "FacilityStr2": null,
  "FacilityCity": "Cottonwood",
  "FacilityState": "MN",
  "FacilityZipCode": "56229",
  "Facility4DigitZipExt": "0318",
  "FacilityCountyFIPS": "27083",
  "LEPC": "Tammy Van Overbeke",
  "FacilityLatDecDegs": "44.597038",
  "FacilityLongDecDegs": "-095.674702",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8866733,
  "ParentCompanyName": "Cottonwood Coop Oil Co.",
  "Company2Name": null,
  "CompanyDUNS": 8866733,
  "Company2DUNS": 0,
  "OperatorName": "Cottonwood Coop Oil Co.",
  "OperatorStr1": "3786 CO 9 999 W 1ST ST",
  "OperatorStr2": null,
  "OperatorCity": "Cottonwood",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56229",
  "OperatorZipCodeExt": "0318",
  "RMPContact": "Bradley D. Rosa",
  "RMPTitle": "General Manager",
  "FTE": 12,
  "OtherEPAFacilityID": "42-025-0002",
  "EPAFacilityID": "100000002132",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-21 00:00:00",
  "SafetyInspectionBy": "CHMM consulting auditor",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 44.59717,
  "FRS_Long": -95.67475,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000098655,
      "AltID": null,
      "FacilityID": 1000079104,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099895,
          "ProcessID": 1000098655,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000123730,
          "ProcessID": 1000098655,
          "ChemicalID": 56,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000623730,
          "ProcessID": 1000098655,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079104,
      "SummaryText": "Cottonwood Coop Oil Co.                                    Cottonwood, Lyon County, Minnesota\n\n\n\nEXECUTIVE SUMMARY - AMMONIA (anhydrous)\n\n\n\nTHE ACCICIDENT RELEASE PREVENTION AND EMERGENCY RESPONSE & CONTINGENCY POLICIES FOR OUR FACILITY.\n\n\n\nThis facility complies with the 1999 ANSI k61.1 \"Safety Requirements for the Storage and Handling of Anhydrous Ammonia\".  In addition, it is our policy to adhere to all applicable federal, state, and local laws.\n\n\n\nOne of our company goals states, \"To provide for the safety and security of our employees, our customers, the general public and to be good stewards of the environment for which we serve.\"  To fulfill these goals, we enroll in a regulatory management service that assists in the maintaining and administer comprehensive safety and environmental programs, procedures and training courses.  We perform a thorough annual audit program and monitor facility compliance with the safety standards and overseen assistance with this specialty firm.  The program consiststs of an  internal audit utilizing checklist survey forms that are reviewed regularly and updated as necessary to ensure all applicable federal, state and local regulations are covered.  These checklists are used to measure regulatory compliance including those governing the safe handling and storage of anhydrous ammonia.  Procedures require a timely response and correction of all recommendations resulting from these audit checklists.\n\n\n\nA \"Site Safety Coordinator\" is identified and used as an extension of the General Manager and the management service personnel for a \"hands on\" manager of the day to day safe working activities, maintain the required regulatory record keeping, conduct monthly safety meetings, conduct employee training and act as the location's contact during emergency incidents that are rehearsed biannually.\n\n\n\nA DESCRIPTION OF THE FACILITY AND THE REGULATED SUBSTANCES HANDLED.\n\n\n\nThe facility is a wholesale farm supply and distribution center and as s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079104,
      "SummaryText": "uch store and distribute a wide variety of pesticides and fertilizers including anhydrous ammonia.  Anhydrous ammonia is received by truck, is handled and stored on-site and is a regulated substance by the EPA requireing us to comply with this Risk Management Program.  We sell anhydrous ammonia to growers in nurse tanks manufactured to the requirements to do such.  The customer applies the ammonia into the soil as a needed source of nitrogen fertilizer for growing agricultural crops.\n\n\n\nOur facility maintains thirtyfour 1,000-gallon nurse tanks, eight 1,425-gallon nurse tanks and six 1,850 gallon nurse tanks for customer delivery.  Our combined storage capacity in nurse tanks is 263,290 pounds.  Anhydrous ammonia is stored in two stationary storage tanks ; 1@26,000 gallons and 1@18,000 gallons on site.  205,000 pounds of anhydrous ammonia is the maximum storage capacity of the stationary storage tanks.  Therefore, the total facility anhydrous ammonia storage capacity for this location is 468,330 pounds.  The largest storage vessel at our facility contains 120,000 pounds.\n\n\n\nWORST CASE SCENARIO\n\n\n\nOur worst case scenario is the loss of the total contents of the 26,000 gallon storage tank, when filled to the greatest amount allowed (85% of capacity), released as a liquid over 10 minutes, resulting in total vaporization.  The maximum quantity released would be 120,000 pounds.  According to DEGRADIS modeling, the distance to the endpoint (point of dispersion to 200 PPM) would have an off-site impact.  It should be noted that our company has never had a total release of an entire storage tank.  \n\n\n\nALTERNATE RELEASE SCENARIO\n\n\n\nThe most common alternate release scenario from anhydrous ammonia storage facility would not reach an endpoint off-site.  The alternate release scenario modeled for the purpose of this plan is a three-minute release from a stationary storage tank representing a valve and hose failure requiring a manual shutdown.  The total amount of anhydrous ammo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079104,
      "SummaryText": "nia reased in this scenario would be 300 pounds for a storage tank.  The distance to the endpoint would have an impact.\n\n\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe ammonia storage system is designed, installed and is maintained in accordance with ASTM standards and the ASME codes.  The facility complies with the ANSI k61.1 standards (1999 edition), OSHA-29 CFR 1910.111, EPA's Accidental Release Prevention Rule as well as all applicable federal, state and local codes and regulations.\n\n\n\nOur ammonia system is protected from major releases by excess flow valves, check valves, relief valves, manual shutoffs and emergency shutoff valves.  The load-out risers used for the purpose to filling the nurse tanks are protected by excess flow valves and fill lines breakaways to immediately stop the flow of ammonia if a line or a hose would fail.  All of the main storage tank valves and the riser load valves are locked when not in use.  Lighting for the facility has increased to dicouraged the increase of meth theft.\n\n\n\nOur anhydrous ammonia system is inspected on a regular basis with maintenance and preventive maitenance scheduled and documented.  Liquid and vapor valves, hoses, excess flow valves, guages, and relief valves are replaced when necessary and/or according to the guidelines within the ANSI standards.\n\n\n\nTraining is provided to all employees at least annually, whenever there is a change in the process or whenever competency with the regulations are questioned.  In accordance with the 1999 ANSI standards, training is also offered for all ammonia customers to attended on a regular basis and offered to the local fire department personnel during their annual tour of our facility and operations.  These training courses consist of classroom, lecture, current and approved videos or compact disc, testing both verbally and written,  demonstration and observation for each person working with the process that are certified while on"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079104,
      "SummaryText": "-going job training is always improved upon.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere has been no accidents involving anhydrous ammonia that has caused deaths, recordable injuries, property or enviromental damage including evacuations on or off site.\n\n\n\nTHE 'EMERGENCY RESPONSE AND CONTINGENCY PLAN'\n\n\n\nIn the event of an emergency involving our ammonia system, it is our policy to notify the local community fire department and request that they respond to the emergency with the facility's personnel assistance.  In preparation for this, we have coordinated with all of the local response agencies by providing information and facility tours annually to ensure that our community has the strategy for responding to and mitigating the threat posed by an ammonia release.  This complies with the requirement of our facility to be included in the community emergency response plan prepared under EPCRA and coordinated with our LEPC.\n\n\n\nCERTIFICATION LETTER\n\n\n\nCERTIFICATION STATEMENT FOR PROGRAM LEVEL 2 PROCESS\n\n\n\n\n\n\n\n\n\n____________________________________________                  Bradley D. Rosa\n\n\n\n\n\n\n\nTitle: General Manager                                                         Date:  May 14, 2019\n\n\n\nEPA Facility ID #  1000 0000 2132"
    }
  ]
}