{
  "FacilityID": 1000008448,
  "FacilityName": "USS POSCO Industries",
  "FacilityStr1": "900 Loveridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": "0471",
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.024972",
  "FacilityLongDecDegs": "-121.859250",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.uss-posco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 150824647,
  "ParentCompanyName": "USX Corporation",
  "Company2Name": "Pohang Steel America Corp.",
  "CompanyDUNS": 2028801,
  "Company2DUNS": 2028801,
  "OperatorName": "USS Posco Industries",
  "OperatorStr1": "900 Loveridge Road",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": "0471",
  "RMPContact": "Freddy Ripoli",
  "RMPTitle": "Manager,  Safety & Health",
  "FTE": 702,
  "OtherEPAFacilityID": "94565SSPSCPOBOX",
  "EPAFacilityID": "100000144809",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "A2371",
  "SafetyInspectionDate": "2010-10-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-07-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.02806,
  "FRS_Long": -121.8717,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000009735,
      "AltID": "Anhydrous Ammonia Storage",
      "FacilityID": 1000008448,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010057,
          "ProcessID": 1000009735,
          "NAICSCode": "331221",
          "_desc": {
            "NAICS_CODE": "331221",
            "NAICS_DESCRIPTION": "Rolled Steel Shape Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011018,
          "ProcessID": 1000009735,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000511018,
          "ProcessID": 1000009735,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000009736,
      "AltID": "Liquid Hydrogen Storage",
      "FacilityID": 1000008448,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010058,
          "ProcessID": 1000009736,
          "NAICSCode": "331221",
          "_desc": {
            "NAICS_CODE": "331221",
            "NAICS_DESCRIPTION": "Rolled Steel Shape Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011019,
          "ProcessID": 1000009736,
          "ChemicalID": 149,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000511019,
          "ProcessID": 1000009736,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008448,
      "SummaryText": "Executive Summary\n\nUSS-POSCO has updated RMP submitted to EPA on June 30, 2011.  As part of this 5 year update, USS-POSCO has included the following:\n\no Following a significant incident at a source, the 5-year accident history information will be updated within six months to reflect the incident.\n\nO If the emergency contact at the source changes, the RMP will be updated within one month, to include the new emergency contact information. \n\nO A brief description of the OCA (worst case and/or alternate case) has not been included in this executive summary.  EPA prefers that the OCA information is left out of the executive summary to eliminate the possibility of sensitive information getting into the wrong hands, especially with the heightened awareness security. \n\nO The emergency contacts email address has been included in this RMP submittal. \n\nO The purpose for the RMP submissions has been included 5year re-evaluation and re-submittal to EPA.\n\nO Name, address, and phone number of the contractor used to complete the RMP submittal has been included and updated due to office change.\n\nSite Description & Regulated Substances\n\nUSS-POSCO Industries (UPI) is located at 900 Loveridge Road in the city of Pittsburg, California approximately 1/2 mile north of Highway 4.  The UPI property occupies approximately 490 acres.  It is bordered by the New York Slough of the San Joaquin/Sacramento River on the north and by open space and industrial facilities in all other directions.  The nearest residences are located approximately 3/4 miles to the southwest of any facilities handling chemicals regulated under the RMP Rule.\n\nThe plant employs approximately 700 people.  The major divisions within the UPI facility include: the Rolling Division, the Sheet & Tin Products Division, the Reliability Division, and the Technology Services Division.\n\nAnhydrous ammonia and liquid hydrogen are the only two federally and state regulated substances present at UPI.\n\nAnhydrous ammonia is stored in liqui"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008448,
      "SummaryText": "d form, under pressure, in an outdoor 28,0000 lbs. supply vessel.  The vessel sits on a concrete pad that is surrounded by a locked fence topped with razor wire and a canopy over the tank. \n\nThe amount of ammonia stored in the supply vessel is limited to less than 50% of the vessel capacity, by volume.  The management control to maintain this inventory is that:\n\no Ammonia is ordered only when the tank volume is less than 15% \no Ammonia supplier is contracted to only deliver tank trucks of 3,750 gallons\nand process is under watch during filling process to insure less than 50% fill.\n\nThese controls result in a maximum inventory ammonia inventory of 5,550 gallons (28,000 pounds at 25oC).  The threshold quantity for anhydrous ammonia under the RMP rule is 500 pounds.\n\nWorst-Case and Alternative Release Scenarios\n\nThe worst-case scenario as defined by the EPA, is an extremely unlikely event due to many factors, including the age of the process equipment, the prevention program, and the management system.  The worst-case scenarios for the UPI facility are a 10 minute release from anhydrous ammonia storage (Toxic Release Scenario).  When determining the quantity released in these worst-case scenarios administrative controls that limit the maximum allowable inventory in the process was included.  Maximum inventory of anhydrous ammonia is limited to less than 50% of vessel capacity.  However to meet the regulations of the Offsite Consequence Analysis, the goal is to estimate a scenario to create the greatest distance in any direction to an endpoint we utilized the largest vessel, this being the ammonia storage vessel to create the greatest distance.   \n\nAs stated in the requirement we considered the following scenarios with the Operators that maintain the ammonia process and chose the most likely to occur as our scenario: \n1:  Transfer Hose releases due to splits or sudden hose uncoupling\n2:  Process piping releases from failures at flanges, joints, welds, vlaves and valve s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008448,
      "SummaryText": "eals and drains or bleeds. \n3:  Process vessel or pump releases due to cracks, seal failure, or drain, bleed or plug failure. \n4:  Vessel overfilling and spill or over pressurization and venting trough releif valves or rupture disks and, \n5:  Shipping container mishandling and breakage or puncturing leading to a spill.  \n\nThe most likely to occur would be the Transfer Hose splitting or uncoupling.  \n\nThe worst-case scenario--with a catastrophic release during the most pessimistic weather conditions--is not expected within the lifetime of the UPI facility.  Management systems are in place and prevention programs are fully implemented to protect the public, our personnel and the environment.  \n\n\nAlternative Release Scenario\n\nOffsite consequence analysis is also a useful tool in helping UPI to coordinate with the Contra Costa County Health Services Department (CCCHSD) Incident Response Team in emergency response planning.  To do this, UPI modeled a series of three potential alternative release scenarios (ARS) to establish a reasonable \"outer bound\" for emergency response planning and to provide for explaining potential hazards to the community.  CCCHSD guidance calls for modeling the ARS using very conservative meteorological conditions for emergency response planning purposes.  The US EPA, in its guidance for modeling the ARS, suggests the use of more typical (\"average\") meteorological conditions that represent conditions much more likely to occur. \n\nThe Operators chose the following ARS' for ammonia:\n\n1. Failure of unloading hose\n2. Relief valve discharge\n3. Failure of a 3/4 inch diameter liquid line from vessel\n\nGeneral Accidental Release Prevention Policies and Programs\n\nNote that the anhydrous ammonia process is the only Program level 2 or 3 process and, therefore, is the only process requiring a RMP prevention program.  The following information is specific to the anhydrous ammonia process.\n\nManagement System:\n\nUPI has developed a formal management system for pla"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008448,
      "SummaryText": "nning, organizing, implementing and controlling the risk management program elements.  This management system is consistent with the recommendations contained in CCPS Plant Guidelines for Technical Management of Chemical Process Safety.  This management system satisfies the requirements of AA? 68.15 of the RMP Rule, and ensures that the risk management program elements are developed, implemented, and continually improved. The management system activities are further discussed below.\n\nO Planning - UPI has an overall risk management program policy that \n  clearly identifies the goals and objectives of the risk management program.\n \nO Organizing - Individuals responsible for each risk management program \n  element have been designated.  The designated individuals are responsible \n  for developing and maintaining policies and procedures for each risk\n  management program element that meet program goals and objectives. \n \nO Implementing - Detailed responsibilities for program implementation \n  may be delegated to other individuals.  Such individuals are trained on \n  their responsibilities, and the corresponding procedures, before they are \n  allowed to perform their responsibilities. Strict adherence to procedures is \n  emphad.  Refresher training is provided on an as-needed basis.  \n \nO Controlling - Members of management and the individuals responsible \n  for each risk management prevention program element periodically \n  conduct internal reviews or audits against the goals and objectives of the \n  element. All records associated with the prevention program elements are \n  retained for a minimum of five years unless otherwise specified in the \n  RMP Rule, to permit periodic, comprehensive audits.  Weaknesses in \n  program elements, or in their implementation, that may be discovered \n  during internal audits or reviews are corrected.\n\n0 SafeTrax-  UPI utilizes SafeTrax as an online, web-based organizational tool to place all of its RMP and CalARP      documentation.   "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000008448,
      "SummaryText": "SafeTrax has been instrumental in helping UPI keep all of the requirements in one location for our employees, via a secure Username and Password.  The RMP submittal copies are contained in SafeTrax.  \n\nPrevention Program:\n \nMany of the processes, including the RMP covered processes are also regulated under the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulation, 29 CFR Part 1910.119.  The release prevention program at UPI was developed to prevent onsite and offsite impacts to people and the environment.  Therefore, this facility has developed a release prevention program to comply with both the EPA Risk Management Program (RMP) rule and the OSHA PSM requirements.  The release prevention program includes the following elements: process safety information, PHA, operating procedures, training, mechanical integrity, management of change, PSSR, compliance audits, incident investigation, employee participation, hot work permits, contractors, and others.\n\nThe prevention program elements represent an integrated system of administrative controls intended to ensure the safety of workers, the public, and the environment.  Many of these prevention program elements (e.g., PHAs, compliance audits, incident investigation) result in the development and implementation of additional safeguards (i.e., administrative and engineering controls).  These safeguards prevent, detect, or mitigate the effects of accidental releases of regulated substances.\n\nEmployee training is also a major focus at UPI.  UPI believes that employees who clearly understand how to safely operate a process can significantly decrease the number and severity of incidents, and increase efficiency.  Therefore, a thorough training program  focused on specific operating procedures and safe work practices is a key element of our effective prevention program.\n\nEmployees involved with operating the process receive training on the  hazards associated with the process, how to oper"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000008448,
      "SummaryText": "ate the process within safe operating limits, and how to handle potential emergencies. The training program satisfies the requirements of AA? 68.71 of the RMP Rule and is comprised of the following:\n\no Initial employee training\no Training provided in response to equipment or process changes, as \n  identified under the MOC program;\no Periodic refresher training; and\no Training documentation.\n \nAll operators receive initial training in safe work practices and basic operating principles prior to assignment.  The operators receive training specific to the operations of the process once they are assigned.  Various means are used to verify competency, but primary emphasis is placed on on-the-job observation by supervisors.  Documentation of the training is forwarded to the Learning Center for filing and tracking.\n \nIn addition to on-the-job training, UPI personnel are trained in basic safety courses on an ongoing basis.  All operating division employees and all building wardens in non-industrial areas of the plant are designated potential first responders.  Courses they take include: \"Principles of Accident Prevention\", \"CPR\", \"First Aid\", and \"First Responder Training.\"  Operating division employees also regularly attend Safety Committee meetings to discuss safety issues.\n\nFive-Year Accident History\n\nA review of facility incident investigation reports has shown that there have been no incidents involving ammonia or other hazardous substances, for which the onsite or offsite consequences exceeded the reporting requirements of AA? 68.42 of the RMP Rule.\n\nFollowing a significant incident of a covered RMP process (anhydrous ammonia or liquid hydrogen), UPI will update the accident history to reflect the incident.  This is intended to help EPA and other agencies identify the need for technical assistance, and a timely update to the accident history will provide information to prevent similar incidents in industry.\n\nPlanned Changes to Improve Safety\n\nThe changes that UPI has i"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000008448,
      "SummaryText": "mplemented since the first submittal of the RMP in 1999 have resulted in a 26% decrease in the toxic worst-case scenario distance for anhydrous ammonia.  Additionally this distance reduction has resulted in a 46% reduction in the estimated residential population within the worst-case endpoint zone.\n\nThe liquid hydrogen process worst-case scenario does not result in any residential population within the endpoint distance zone.\n\nUSS-POSCO Industries (UPI) has a long-standing commitment to business principles which promote the safe, ethical operation of its steel manufacturing facilities in Pittsburg, California.  These principles have resulted in clear UPI business strategies that call for continual improvement of safety, quality, customer satisfaction, protection and preservation of the environment, and community responsibility.  Implementation of, and \nadherence to, these business strategies requires the full commitment of all UPI employees.  UPI continues to plan to improve safety by taking any incident related to the ammonia process, analyze it, and incorporate it into the training schedule we currently have.  \n\nOur Training programs continue to be improved and provided to all employees as a result of safe employees and providing a safe environment.  \n\nWe continue to monitor any changes in the regulations to ensure that we are continually improving and implementing those applicable to our process. \n\nUPI policy dictates that each division continuously identify methods to reduce the use of hazardous materials and to reduce the risk to the community and environment through implementation of inherently safer technology and procedures.  This commitment to safe and environmentally sound operations is documented in the facility policy statements and the manual \"Principles of Accident Prevention\", which are available to all employees. \n\nUPI stresses safe and environmentally sound operations in employee training programs, and in written materials  (such as safety and healt"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000008448,
      "SummaryText": "h bulletins) periodically provided to all employees.  UPI safety and environmental programs include monthly safety meetings for all employees and a joint worker/company safety committee. UPI supervisory and management personnel conduct both regularly scheduled and unscheduled (surprise) audits of internal safety, housekeeping and environmental compliance and practice.\n"
    }
  ]
}