{
  "FacilityID": 1000035540,
  "FacilityName": "Nestle Dreyer's Ice Cream Company",
  "FacilityStr1": "970 Continental Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Tulare",
  "FacilityState": "CA",
  "FacilityZipCode": "93274",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.186668",
  "FacilityLongDecDegs": "-119.332405",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 115083131,
  "ParentCompanyName": "Dreyer's Grand Ice Cream Holdings, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 66563859,
  "Company2DUNS": null,
  "OperatorName": "Nestle Dreyer's Ice Cream",
  "OperatorStr1": "970 Continental Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Tulare",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93274",
  "OperatorZipCodeExt": null,
  "FTE": 400,
  "OtherEPAFacilityID": "CAD982041485",
  "EPAFacilityID": "100000020611",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-07-02 00:00:00",
  "SafetyInspectionBy": "Tulare Co Env Health Services",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "TOC",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-08-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-08-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-08-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-08-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 36.18579,
  "FRS_Long": -119.3326,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000043470,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000035540,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000052255,
          "ProcessID": 1000043470,
          "ChemicalID": 56,
          "Quantity": 50000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000043832,
          "ProcessID": 1000043470,
          "NAICSCode": "31152",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000037781,
              "Process_NAICS_ID": 1000043832,
              "SafetyReviewDate": "2013-06-09 00:00:00",
              "PHA_Date": "2012-09-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-09-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-11-15 00:00:00",
              "TrainingReviewDate": "2012-11-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-11-15 00:00:00",
              "EquipmentInspectionDate": "2013-05-15 00:00:00",
              "EquipmentTested": "Annual IIAR 109 inspections",
              "ChangeMgmtDate": "2013-05-01 00:00:00",
              "ChangeMgmtReviewDate": "2012-11-15 00:00:00",
              "PreStartupReviewDate": "2013-01-16 00:00:00",
              "ComplianceAuditDate": "2013-09-23 00:00:00",
              "AuditCompletionDate": "2015-12-31 00:00:00",
              "IncidentInvestigationDate": "2013-04-15 00:00:00",
              "InvestigationChangeDate": "2013-06-15 00:00:00",
              "ParticipationPlansReviewDate": "2012-11-15 00:00:00",
              "HotWorkPermitReviewDate": "2013-06-15 00:00:00",
              "ContractorSafetyReviewDate": "2013-06-15 00:00:00",
              "ContractorSafetyEvalDate": "2013-06-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000044745,
                  "PreventionProgram3ID": 1000037781,
                  "ProcessChemicalID": 1000052255
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000035540,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-02-09 00:00:00",
    "ERTrainingDate": "2013-03-15 00:00:00",
    "CoordinatingAgencyName": "Tulare County Env Health Services",
    "CoordinatingAgencyPhone": "5597336441",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000035540,
      "SummaryText": "nd Environmental Manager  has the overall responsibility for the development, implementation, and integration of the RMP elements.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nEPA's RMP Program defines accident as the following:\r\n\r\nThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\r\n\r\nThe release must have caused at least one of the following:\r\n\r\n¿\tOn-site deaths, injuries, or significant property damage [40 CFR, §68.42(a)]; or\r\n¿\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place [40 CFR, §68.42(a)].\r\n\r\nA review of the facility's accident history was conducted during the Hazard Assessment Update (Offsite Consequence Analysis) study on June 21, 2013 and it was determined that there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (June 2008 - June 2013). In addition, there have been no releases of ammonia that meet the RMP definition of accident as described above.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe Nestle Dreyer's Ice Cream facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document. This Plan was designed to meet the following objectives:\r\n\r\n  1.)  To save lives.\r\n  2.)  To minimize and avoid injuries.\r\n  3.)  To protect the environment.\r\n  4.)  To minimize property damage.\r\n\r\nNestle Dreyer's Ice Cream has established an emergency action plan and a chain of command to respond to emergencies and to notify emergency responders when there is a need for a response.  Nestle Dreyer's Ice Cream's emergency action plan complies with the provisions of 29 CFR 1910.38(a) (and Section 3220 of Title 8, CCR) and provides emergency response procedures for the handling of small releases as required by 29 CFR 1910.119(n).  Emergency escape procedures, emergency escape route"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000035540,
      "SummaryText": "activities in the prevention program include:\r\n\r\n¿\tProcess safety information is provided to all applicable employees upon hire and is accessible at all times.\r\n¿\tIn depth process hazard analysis are completed every five years by qualified personnel using techniques approved under the PSM standard.\r\n¿\tWritten operating procedures (kept up to date) are used for training and guiding the work of operators.\r\n¿\tTraining is provided to all employees upon hire, and refresher training is given at least every three years or upon request.\r\n¿\tOperators, mechanics, and contractor personnel are qualified, trained in the general hazards in the facility, and informed of any temporary situations affecting safety.\r\n¿\tPre-startup safety reviews are conducted to insure that conditions for safe operation have been satisfied prior to starting new or modified equipment.\r\n¿\tA program is in place to maintain the mechanical integrity of the process, which includes written procedures, training requirements, equipment deficiency requests for employees, work orders, scheduled maintenance, and documentation.\r\n¿\tA hot work permit system assures that work is done safely and properly.\r\n¿\tA management of change system is in place to ensure that changes are managed safely.\r\n¿\tIncidents are investigated and actions are taken as part of a continuous improvement effort.\r\n¿\tRoutine audits are conducted to assure that safe practices are being followed.\r\n\r\nThis systematic approach to process safety involves employees and strives for continuing improvements in overall safety.  The training, qualifications, and safety awareness of the operations, maintenance, and management personnel are a key element in reducing and mitigating accidents.\r\n\r\nTo ensure that the accidental release prevention program and the chemical-specific prevention steps are implemented, Nestle Dreyer's Ice Cream has assigned overall responsibility for the RMP elements to the Safety, Health and Environmental Manager.  The Safety, Health a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000035540,
      "SummaryText": "cility's safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\r\n\r\n1. Continue to train all employees in the facility safety plan/programs.\r\n2. Continue to have employee involvement in safety plan development.\r\n3. Continue employee involvement through safety team participation.\r\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000035540,
      "SummaryText": "s, and the procedure for accounting for employees and for locating missing employees are provided in the emergency action plan.\r\n\r\nIn addition, Nestle Dreyer's Ice Cream has established an emergency response program (ERP) that includes procedures for responding to various levels of emergencies.  The ERP includes the emergency response organization and the team member responsibilities, emergency response procedures, notification procedures (including response agencies and adjacent businesses), plant evacuation procedures and incident termination procedures.\r\n\r\nNestle Dreyer's Ice Cream has personnel trained in emergency response procedures and maintains emergency response equipment onsite.  Nestle Dreyer's Ice Cream conducts drills to evaluate the emergency response procedures and to help ensure that site personnel respond appropriately.  The emergency response drills are periodically conducted with the Tulare Fire Department and the Tulare County Environmental Health Services.  \r\n\r\nThe Nestle Dreyer's Ice Cream plant has alarms that can be activated to initiate an evacuation and notify plant personnel of an emergency.  Personnel can also be notified via radio, public address system, or verbally.\r\n\r\nIn the event of a release, a determination shall be made as to the on-site and off-site hazards.  If there is a threat to the health and safety of the public or the environment, the following numbers will be called:  \r\n\r\n¿\t911 (local response personnel - police, fire, medical)\r\n¿\t1-800-852-7550 or 1-916-262-1621 (California Office of Emergency Services) \r\n¿\t(559) 733-6441 (Tulare County Environmental Health Department)\r\n \r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe initial Process Hazards Analysis, as well as the subsequent revalidations and addendums, included a Hazard and Operability (HAZOP) study and a Facility Inspection. The Process Hazard Analyses provided mitigation measures to improve safety at the Nestle Dreyer's Ice Cream facility. The Nestle Dreyer's Ice Cream fa"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000035540,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nNestle Dreyer's Ice Cream utilizes anhydrous ammonia in a closed-loop refrigeration system for the production of ice cream and frozen dessert products.  Since the main refrigeration system handles more than 10,000 pounds of anhydrous ammonia, Nestle Dreyer's Ice Cream Company has developed and implemented a Process Safety Management (PSM) / Risk Management Program (RMP) for the ammonia refrigeration process.  \r\n\r\nAs part of the PSM / RMP program, Nestle Dreyer's Ice Cream has completed process hazard analyses, developed written operating procedures, trained employees on the refrigeration system, conducted a pre-startup safety review, and developed a mechanical integrity program for the ammonia equipment.  In addition to plant personnel monitoring the operation of the refrigeration systems on a daily basis, Nestle Dreyer's Ice Cream has implemented a preventative maintenance program to ensure that the refrigeration system is maintained in good operating condition.  Properly maintained equipment reduces the risk of an accidental release.\r\n\r\nAdditionally, Nestle Dreyer's Ice Cream promotes safe and environmentally sound operating practices and procedures through their employee training programs.  In addition to job specific and process specific training, operators and maintenance personnel receive training in fire prevention, fire control, accident prevention, safety, and first aid.  \r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe Nestle Dreyer's Ice Cream facility is located at 970 East Continental Avenue in Tulare, California. The facility is located approximately 0.2 miles east of California Highway 99 and 1.6 miles south of Highway 137.  The area immediately surrounding the facility is rural with a mixture of commercial, agricultural, and residential areas.\r\n\r\nThe plant began operation in April 1985.  A series of expansion projects involving the main refrigeration system were completed during the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000035540,
      "SummaryText": "late 1980s and 1990s.  The last expansion project on the main refrigeration system was completed in 2005.  In 2013 a large project was completed to upgrade and replace aging system components.\r\n\r\nThe ammonia refrigeration system at Nestle Dreyer's Ice Cream facility is a closed-loop system that cycles the refrigerant, ammonia, from liquid to gas and back again.  The systems, consisting of vessels, piping, valves, and process equipment, cycle ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration to accommodate the storage and production of ice cream.\r\n\r\nNestle Dreyer's Ice Cream conducted an ammonia inventory study of the main refrigeration system to determine the ammonia charge in the system after the completion of the 2005 expansion project.  The results of the ammonia inventory study indicated that the total ammonia charge of the ammonia system was then approximately 51,405 pounds.  The ammonia system charge has been calculated periodically since 2005.  The last calculation was in August of 2013 using the IRC Model and showed that the charge of the main system was approximately 49,355 pounds.  High Pressure Receiver #2 (HPR 02) is the largest vessel in the main refrigeration system and can store the entire charge of ammonia for that system.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nA prevention program is in place to minimize the risk of hazardous chemical releases in accordance with the California Occupational Safety and Health Administration (CalOSHA) Process Safety Management (PSM) standard (Section 5189 of Title 8, CCR) and the EPA Risk Management Program.  This prevention program covers those processes that handle ammonia above the threshold quantity of either PSM or RMP rules.\r\n\r\nThe prevention program provides a structured approach to preventing accidents.  Some of the specific"
    }
  ]
}