{
  "FacilityID": 1000075925,
  "FacilityName": "Flarecatcher at the Pelton Pad",
  "FacilityStr1": "4.9 miles NE of intersection of",
  "FacilityStr2": "13th M Street NW and 111th Ave NW",
  "FacilityCity": "Killdeer",
  "FacilityState": "ND",
  "FacilityZipCode": "58640",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38025",
  "LEPC": "Dunn County LEPC",
  "FacilityLatDecDegs": "47.586389",
  "FacilityLongDecDegs": "-102.879222",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "www.PioneerEnergy.com",
  "FacilityEmailAddress": "info@pioneerenergy.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Pioneer Energy",
  "OperatorStr1": "220 S. Taft Street",
  "OperatorStr2": null,
  "OperatorCity": "Lakewood",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80228",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000240884",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-03-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-03-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-03-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-11-06 00:00:00",
  "DeRegistrationEffectiveDate": "2020-10-26 00:00:00",
  "AnniversaryDate": "2024-03-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000094546,
      "AltID": "NGL Tank & Piping",
      "FacilityID": 1000075925,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000118315,
          "ProcessID": 1000094546,
          "ChemicalID": 155,
          "Quantity": 471201.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000102972,
              "ProcessChemicalID": 1000118315,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000102973,
              "ProcessChemicalID": 1000118315,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000102974,
              "ProcessChemicalID": 1000118315,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000102975,
              "ProcessChemicalID": 1000118315,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000102976,
              "ProcessChemicalID": 1000118315,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000095808,
          "ProcessID": 1000094546,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000059192,
              "Process_NAICS_ID": 1000095808,
              "SafetyReviewDate": "2016-05-11 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API 2510 compliant",
              "FR_Comments": null,
              "HazardReviewDate": "2015-09-02 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire suppression & extinguishing system",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Remote level monitor",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-05-11 00:00:00",
              "TrainingReviewDate": "2016-05-04 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-04-01 00:00:00",
              "EquipmentInspectionDate": "2019-02-04 00:00:00",
              "EquipmentTested": "NGL Tank",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000059840,
                  "PreventionProgram2ID": 1000059192,
                  "ProcessChemicalID": 1000118315
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000075925,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "West Dunn Fire Rescue",
    "CoordinatingAgencyPhone": "7017645006",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075925,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\r\nPioneer Energy  \r\nFlarecatcher at the Pelton Pad (Facility ID: 1000 0024 0884)\r\n\r\nACCIDENT RELEASE PREVENTION AND RESPONSE POLICIES\r\n\r\nPioneer has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the company's efforts in accident prevention, such as training personnel, quality assurance, and considering safety in the design, installation, operation and maintenance of the process. Pioneer's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, trained personnel will evaluate the situation, take actions within their capabilities, and notify the necessary outside agencies. \r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nPioneer Energy (Pioneer) owns and operates a Flarecatcher system and four (4) natural gas liquids (NGL) tanks at the Pelton Pad in Dunn County, North Dakota.  The Flarecatcher is designed to process associated gas and recovered tank vapors and recover liquid products through physical separation and cryogenic means.  The Vaporcatcher is considered a small natural gas processing plant for regulatory purposes. NGLs recovered from this process are marketed for off-site sales.\r\n\r\nThe NGL product contains ethane, propane, butanes, pentanes, and heavier hydrocarbon components. The regulated flammable substances include these same components. This facility does not handle regulated toxic substances above their threshold quantities and there are no toxic release scenarios to consider.\r\n\r\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\r\n\r\nAll four (4) storage vessels within the plant process are located adjacent to each other and are of the same capacity.  Therefore, only one vessel was evaluated for the worst-case release scenario, because a release from any of the four (4) vessels would not affect different off-site receptors.  Results of the worst-case release scenarios indicate that the pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075925,
      "SummaryText": "ocesses are subject to RMP Program Level 2 requirements.  \r\nThere is one worst-case scenario (WCS) associated with a release of flammable substances at the Flarecatcher at the Pelton Pad.  The scenario consists of a vapor cloud explosion involving 112,191 pounds of a flammable mixture contained in a full 23,200-gallon NGL Tank. The WCS results in the largest impacted area with a 0.4-mile radius.\r\n\r\nThe WCS has an offsite endpoint and would affect two (2) oil and gas facilities (industrial) public receptors.  Pioneer has controls to prevent such a release and to manage consequences. Mitigation measures include relief valves, check valves, grounding equipment, and rupture disks.\r\n\r\nThe alternative release scenario (ARS) for the flammable substances at the Flarecatcher at the Pelton Pad is assumed to be a vapor cloud explosion resulting from the release of 84,000 pounds of NGLs from a pipe between a Flarecatcher skid and the NGL tank. The release would occur from a break in the 1-inch pipeline that would involve 1,400 pounds per minute being released for 60 minutes before the leak was stopped. The ARS would impact a radius of 0.2 miles, which includes an offsite endpoint and a nearby industrial public receptor. \r\n\r\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\r\n\r\nThe Flarecatcher at the Pelton Pad is not covered by the OSHA Process Safety Management (PSM) Program since it can be operated remotely, and Pioneer does not keep employees at its location. This results in the process being Program Level 2. The following sections detail how Pioneer complies with the Program 2 requirements for accident prevention. \r\n\r\nA. Process Safety Information/Process Controls\r\n\r\nPioneer keeps a variety of technical documents that are used to help maintain safe operation of the process.  These technical documents address the following:\r\n\r\n1. Chemical properties and associated hazards\r\n2. Necessary Block Flow Diagrams of the process\r\n3. Maximum intended inventories\r\n4. Upper and lower limits o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075925,
      "SummaryText": "f process equipment\r\n5. Equipment design basis and configuration information\r\n6. Identification of necessary regulatory equipment design documents\r\n7. Sufficient information to assure good engineering practices\r\n\r\nChemical specific information, including hazard and emergency response/exposure considerations, is provided in safety data sheets (SDS).  For specific areas within the process, Pioneer has documented safety-related limits for specific parameters such as temperatures, level and composition in the operator's procedures manual.  The company maintains the overall process within these limits by using remote controls and monitoring instruments, trained personnel and protective instrument systems such as automated shutdown systems. \r\n\r\nThe facility also maintains technical documents that provide information about the design and construction of the equipment.  This information includes materials of construction, design pressures, temperature and electrical ratings.  This information, in combination with procedures and equipment operating history, provides a basis for inspection and maintenance activities, as well as for evaluating proposed changes to safety features to ensure these are not compromised. \r\n\r\n B. Hazard Review\r\n\r\nThe Flarecatcher at the Pelton Pad identifies and controls hazards associated with the RMP covered scenario.  This program systematically examines and explores for potential hazards, then establishes controls to put in place to manage the potential hazards.  The hazard review is conducted using checklists by Pioneer's employees and/or consultants who have operation, maintenance, engineering, and safety experience.  This review evaluates and makes recommendations to management of the potential hazards identified.  The findings are forwarded to Pioneer for review.  The approved mitigation options in response to the hazard review findings are tracked until they are completed.  The final resolution of each finding is documented and retained."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075925,
      "SummaryText": "Pioneer will periodically update and revalidate the hazard analysis results.  These periodic reviews will be conducted at least every five years and will be conducted at this frequency until the regulated process is no longer operating.  The results and findings from these updates will be documented and retained.\r\n\r\nC. Operating Procedures\r\n\r\nPioneer maintains written Operating Procedures of the covered process that address primary operations mandated by OSHA, EPA, Good Engineering Practice and manufacturers.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  Procedures will be updated, if necessary, whenever a major change occurs and prior to startup of the changed process. \r\n\r\nCovered process Operating Procedures are readily available to operators for the process unit and to other personnel to use as necessary to safely perform their job task and ensure the covered process is operating within its safe limits.\r\n\r\nD.  Training\r\n\r\nPioneer has implemented a comprehensive training program for employees involved in operating the covered process.  New employees receive basic training in process operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with a senior operator to learn specific duties and tasks.  A performance review and written test or hands on observation specific to the plant operations is administered and must be successfully completed during this training period.  After the operator demonstrates adequate knowledge to perform the duties and tasks in a safe manner on their own, they are allowed to work independently.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years, or more frequently upon request.  The trainin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000075925,
      "SummaryText": "g is documented for each operator, including the means used to verify and demonstrate skills\r\n\r\nE. Mechanical Integrity/Maintenance\r\n\r\nThe Flarecatcher at the Pelton Pad has established practices and procedures for the safe operation of fixed, rotating and emergency shutdown equipment.  The basic aspects of the program include, but are not limited to, the following:\r\n\r\n1. Conducting training\r\n2. Developing written procedures\r\n3. Performing inspections and tests\r\n4. Correcting identified deficiencies\r\n5. Applying quality assurance measures\r\n\r\nIn combination, these activities form a system to maintain the mechanical integrity of the process.\r\n\r\nMaintenance personnel receive training on:\r\n\r\n1. Overview of the process\r\n2. Safety and Health hazards\r\n3. Applicable maintenance procedures\r\n4. Emergency response plan\r\n5. Applicable safe work practices to help ensure that they can perform their jobs in a safe manner.\r\n\r\nWritten procedures provide that work is performed in a consistent manner and serve as a basis for training.  Inspections and tests are performed to help verify that equipment functions as intended and that equipment is within acceptable limits.  If a deficiency is identified and the situation presents an immediate safety concern, the deficiency is corrected before placing the equipment back into service.  \r\n\r\nAn integral part of the maintenance program is quality assurance.  Pioneer incorporates quality assurance measures into equipment purchases, leases, and repairs.  This helps to determine that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made. \r\n\r\nF. Safe Work Practices\r\n\r\nPioneer has long-standing safe work practices as mandated by OSHA, Industrial Standards, and Good Engineering Practice in place to help provide employee, public and process safety.\r\n\r\nG. Incident Investigation\r\n\r\nPioneer will promptly investigate incidents related to a covered scenario that resulted in, or reasonably c"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000075925,
      "SummaryText": "ould have resulted in a fire/explosion, property damage, environmental loss or personal injury.  The goal of each investigation is to determine the facts and develop corrective action to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings and root causes of the incident, develops recommendations to prevent future occurrences and forwards these results to management for resolution.  The findings are reviewed with all persons whose job tasks are affected by the findings.  Corrective actions taken in response to the investigation team's findings and recommendations are scheduled and tracked until they are complete.  The final resolution of each finding or recommendation is documented and investigation reports are retained for at least 5 years. \r\n\r\nH. Compliance Audits\r\n\r\nAt least every three years a Compliance Audit addressing OSHA, EPA, RMP and Good Engineering Practices are conducted by employees and management of the Flarecatcher at the Pelton Pad.  This audit team will develop findings that are forwarded to management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are completed.  Final resolution of each finding is documented, and the two most recent audit reports are retained.  Third party audits will be conducted if any applicable conditions apply to the facility within 12 months of the triggering release or within 12 months of the date of the final determination of the implementing agency. Should a third party audit be required, Pioneer will use an auditor that meets all the competency and independence criteria or create an audit team led by a competent third party auditor. The auditor will provide Pioneer with written policies and procedures and within 90 days Pioneer will create a findings report with the appropriate responses to each finding in the audit.\r\n\r\nI. Release Containment/Controls/Mitigation\r\n\r\nThe following controls and equipment are in"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000075925,
      "SummaryText": "place to help prevent and mitigate a release.\r\n\r\n1. Process relief valves and check valves \r\n2. Automated and manual shutoffs to permit isolation of the process\r\n3. Automated process shutdown system to remotely shut down equipment to their fail-safe position\r\n4. Curbing or diking to contain liquids releases\r\n5. Grounding equipment\r\n6. Rupture Disks\r\n7. Fire suppression and extinguishing system\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThe Flarecatcher at the Pelton Pad is a new facility.  There have been no accidental releases from a covered process that resulted in death, injury or significant property damage on site, or known off-site death, injury, evacuation, sheltering in place, property damage or environmental damage. \r\n \r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\n\r\nThe Flarecatcher at the Pelton pad is a non-responding facility and has coordinated with the local fire department for response to large accidental releases.  As a non-responding facility, the RMP emergency response program and emergency response plan requirements (40 CFR 68.95) are not applicable at this facility.  However, the facility does maintain an emergency response plan that serves as guidance for facility employees to notify first responders, secure critical operations before evacuation, evacuate the facility, and account for personnel, among other items.  Facility personnel are trained in procedures and use of equipment appropriate to their role in response to small accidental releases. Pioneer will also coordinate with local planning and response organizations to ensure emergency responders are informed of the substances, quantities, and risks associated with the facility in response to a release. Pioneer will coordinate with emergency organizations at least annually, unless more frequency is needed. Pioneer will provide all relevant information needed for emergency response planning. \r\n\r\nRMP MANAGEMENT\r\n\r\nPioneer has assigned responsibility for the risk management program to the Field Operations E"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000075925,
      "SummaryText": "ngineer and maintains a management system to oversee program elements.\r\n \r\nPLANNED CHANGES TO IMPROVE SAFETY \r\n\r\nPioneer believes that diligent compliance with RMP Prevention Program forms the framework that allows for the continued improvement to the level of safety at the Flarecatcher at the Pelton Pad. Some of the key components of the program that will help maintain and, where applicable, improve safety are:\r\n\r\nEnsuring that Pioneer considers the potential safety and health impacts of any change made to chemicals, technology, equipment or procedures.\r\n\r\nThe hazard review provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in safety standards. \r\n\r\nEnsuring that equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous release thereby serving as an integral part of the safety program.\r\n\r\nInternal and third party compliance audits will ensure that Pioneer maintains and increases the level of safety protection."
    }
  ]
}