{
  "FacilityID": 1000064917,
  "FacilityName": "Pike Baltimore Terminal, LLC",
  "FacilityStr1": "1955 Chesapeake Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21226",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24510",
  "LEPC": "Baltimore City LEPC",
  "FacilityLatDecDegs": "39.241944",
  "FacilityLongDecDegs": "-076.572500",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "LC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pike Baltimore Terminal, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pike Baltimore Terminal, LLC",
  "OperatorStr1": "1955 Chesapeake Avenue",
  "OperatorStr2": "Suite 2100",
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21226",
  "OperatorZipCodeExt": null,
  "RMPContact": "Douglas Jennings",
  "RMPTitle": "Manager, Baltimore Terminal",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000236292",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-05-30 00:00:00",
  "SafetyInspectionBy": "U.S. Coast Guard",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-07-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-07-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-10-22 00:00:00",
  "DeRegistrationEffectiveDate": "2021-04-12 00:00:00",
  "AnniversaryDate": "2022-07-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000081413,
      "AltID": null,
      "FacilityID": 1000064917,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000082655,
          "ProcessID": 1000081413,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000101401,
          "ProcessID": 1000081413,
          "ChemicalID": 98,
          "Quantity": 1395900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601401,
          "ProcessID": 1000081413,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000064917,
      "SummaryText": "Pike Baltimore Terminal, LLC (\"Pike\") is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors and the public while fully complying with the applicable laws and regulations.  Pike management philosophy goals are achieved through the implementation of the environmental, health and safety management systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors and regulators.\n\n\n\nThe purpose of this Risk Management Plan (RMPlan) is to provide information about operations at the terminal, programs to prevent accidental chemical releases, emergency response plans in the event an accidental release should occur, and five-year accident history of the terminal, and planned changes to improve safety at the terminal.\n\n\n\nStationary Source and Regulated Substance\n\nThe Baltimore Transloading Facility is owned by Pike.  At the terminal, propane is received via railcar and stored in pressure tanks.  Propane is loaded into transport trucks from the above ground tanks.  Propane is the only substance regulated under the Risk Management Program (RMP) that is present at the Baltimore Transloading Facility in amounts above threshold quantity.  The terminal is classified as Program Level 3 under the regulation.  We have one process at the facility.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response programs in place at the terminal are part of the high standards striven for by Pike.  These high standards include:\n\nOperating in compliance with required environmental permits and regulations.\n\nOperating and maintaining the assets in such a manner that unintentional release are minimized.\n\nOperating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible.\n\nCorrecting non-"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000064917,
      "SummaryText": "compliance found during regular audits of the terminal.\n\n\n\nPrevention Program\n\nThe Baltimore Transloading Facility is operating under the guidelines of the Occupation Safety and Health Administration (OSHA) Process Safety Management (PSM) Program and the Environmental Protection Agency (EPA) Risk Management Program (RMP).  Analysis of the potential hazards of the process, training of employees, and emphasis on safety has helped avoid any serious chemical release accidents since Pike purchased the terminal.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.\n\n\n\nFive-Year Accident History\n\nNo incident resulting in onsite injuries, death or property damage or offsite impact from a propane release has occurred at the Baltimore Transloading Facility.\n\n\n\nEmergency Response Program\n\nThe terminal has developed an emergency response plan, which will be coordinated with local emergency response groups such as the Baltimore City Fire Department.  The terminal operator is responsible for coordinating the notification required to initiate an emergency response.  The Emergency Response Plan provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations.\n\n\n\nPlanned Changes to Improve Safety\n\nCompliance with the RMP Prevention Program coupled with the environmental, health and safety management systems, forms the frame work for continuous safety improvement.  Some of the key components of the safety program are:\n\nThe Management of Change provisions ensure that the potential safety and health impacts of any change made to process chemicals, technology, equipment or procedure are considered.\n\nThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure timely evaluation of potential hazards, thereby leading to continual improvements in safety standards.\n\nThe Mechanical integrity provisions ensure that process equipment and instrumentation are de"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000064917,
      "SummaryText": "signed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program.\n\n\n\nSpecific actions that will be taken in the future to improve the level of safety at the terminal include:\n\nCompliance audits will ensure that the level of safety protection at the terminal is periodically being evaluated for improvements.\n\nAn ongoing dialogue with the Baltimore City Fire Department will ensure a constant state of readiness to respond to any potential emergencies.\n\n"
    }
  ]
}