{
  "FacilityID": 1000043818,
  "FacilityName": "Naval Station Energy Facility",
  "FacilityStr1": "3970 Surface Navy Boulevard",
  "FacilityStr2": "Building 3427",
  "FacilityCity": "San Diego",
  "FacilityState": "CA",
  "FacilityZipCode": "92136",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.679221",
  "FacilityLongDecDegs": "-117.121760",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Applied Energy, LLC",
  "Company2Name": "Atlantic Power Corporation",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Applied Energy, LLC",
  "OperatorStr1": "8835 Balboa Avenue, Suite D",
  "OperatorStr2": null,
  "OperatorCity": "San Diego",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92123",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": "CAL000291600",
  "EPAFacilityID": "100000071361",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "960391",
  "SafetyInspectionDate": "2014-04-08 00:00:00",
  "SafetyInspectionBy": "Simplex Grinnell",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-09-12 00:00:00",
  "DeRegistrationEffectiveDate": "2018-09-06 00:00:00",
  "AnniversaryDate": "2019-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 32.684066,
  "FRS_Long": -117.125996,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054132,
      "AltID": "SCR NOx Control",
      "FacilityID": 1000043818,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065891,
          "ProcessID": 1000054132,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000054930,
          "ProcessID": 1000054132,
          "NAICSCode": "22133",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000045410,
              "Process_NAICS_ID": 1000054930,
              "SafetyReviewDate": "2013-12-12 00:00:00",
              "PHA_Date": "2015-04-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-04-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Continuous emissions monitoring systems analyzers",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Changes to policies and procedures to improve the safety of the SCR system",
              "OpProceduresReviewDate": "2013-11-20 00:00:00",
              "TrainingReviewDate": "2013-12-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "hands-on",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-12-12 00:00:00",
              "EquipmentInspectionDate": "2014-03-06 00:00:00",
              "EquipmentTested": "Annual inspection of the ammonia tank.",
              "ChangeMgmtDate": "2013-12-09 00:00:00",
              "ChangeMgmtReviewDate": "2013-12-12 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2013-12-12 00:00:00",
              "AuditCompletionDate": "2014-12-12 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-12-12 00:00:00",
              "HotWorkPermitReviewDate": "2013-12-12 00:00:00",
              "ContractorSafetyReviewDate": "2013-12-12 00:00:00",
              "ContractorSafetyEvalDate": "2013-12-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000054792,
                  "PreventionProgram3ID": 1000045410,
                  "ProcessChemicalID": 1000065891
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043818,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Naval Station Federal Fire Dept.",
    "CoordinatingAgencyPhone": "6195242030",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043818,
      "SummaryText": "lease equipment cleanup and decontamination procedures\r\n- Personnel decontamination\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Process Hazard Analysis Revalidation study (performed on April 22, 2014), including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the AE LLC facility located at 3970 Surface Navy Boulevard in San Diego, California. AE LLC is planning to complete several items over the next year, as a continual effort to provide a safe work environment for its employees.  These changes include the following items:\r\n\r\n1.  Continue to train all employees in the facility safety plan/programs.\r\n\r\n2.  Continue to have employee involvement in safety plan development.\r\n\r\n3.  Continue employee involvement through safety team participation.\r\n\r\n4.  Continue internal and external safety audits/inspections and implement changes as needed."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043818,
      "SummaryText": "Per the federal U.S. EPA requirements of 40 CFR Part 68 (Risk Management Plan, or RMP) and the California requirements of Chapter 6.95, California Health & Safety Code's Accidental Release Prevention (CalARP) Program, the RMP and CalARP must be updated and resubmitted at least once every 5 years, unless certain process changes described in 40 CFR Part 68.190 occur prior to the 5-year RMP anniversary; if this occurs, the 5-year anniversary date is reset whenever a full update is made. This RMP/CalARP, submitted by Applied Energy, LLC (AE LLC), presents the 5-year anniversary update and resubmittal; there have been no process changes (per 40 CFR Part 68.190) since June 21, 1999.\r\n\r\nAs background for this facility, AE LLC is the current owner/operator. Applied Energy, Inc. (AEI) was the original owner/operator of the facility that prepared a Risk Management and Prevention Program (RMPP) for handling anhydrous ammonia (NH3) at this facility in October 1996, and submitted the RMPP to the San Diego County Department of Environmental Health Hazardous Materials Division (HMD) under the former California RMPP rule.  HMD approved the RMPP for this facility on January 14, 1997.  HMD granted approval for AEI to revise and update the existing RMPP and submit it as a Risk Management Plan (RMP) to U.S. EPA and HMD under the California Accidental Release Prevention (CalARP) Program; the RMP/CalARP document was submitted on June 21, 1999. For purposes of this update and resubmittal, the previous references to AEI are replaced by AE LLC in this document.\r\n\r\nAs required by the federal EPA, this executive summary has been submitted to the EPA.  This RMP Public Document presents the efforts of AE LLC to manage and prevent risks associated with the storage and use of anhydrous ammonia at its cogeneration facility located at 3970 Surface Navy Boulevard, Building 3427, U.S. Naval Station (NAVSTA) in the City and County of San Diego, California.\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENC"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043818,
      "SummaryText": "), Emergency Action Plan (EAP), Fire Prevention Plan (FPP), Exposure Control Plan (ECP), Injury and Illness Prevention Plan (IIPP), Spill Prevention, Control and Countermeasures Plan (SPCC), Hazardous Materials Business Plan (HMBP), and Risk Management Plan (RMP).\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nEPA's RMP regulation defines accident as the following:\r\n\r\nThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\r\n\r\nThe release must have caused at least one of the following:\r\n\r\n¿\tOn-site deaths, injuries, or significant property damage (§68.42(a)); or\r\n¿\tKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\r\n\r\nBased on the above definition and an investigation into the facility's accident history conducted at the time of the Process Hazard Analysis (April 22, 2014), there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of a release or threatened release of a hazardous material in the last five years (April 2009 - April 2014). In addition, there have been no injuries resulting from an ammonia release, nor any releases or near misses that warranted an internal incident investigation.   \r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nAE LLC has developed a written emergency action plan to deal with accidental releases of hazardous materials.  The plan includes the following information describing the actions of employees over the course of a release event:\r\n\r\n- Alarm system activation and signal interpretation\r\n- Safe evacuation, assembly locations and return to the facility\r\n- Selection of response strategies based on type of incident\r\n- Incident command structure and emergency contact list\r\n- List of response equipment onsite and authorized use of equipment by employees\r\n- Release mitigation activities and measures in place\r\n- Post-re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043818,
      "SummaryText": "Y RESPONSE POLICIES\r\n\r\nIt is the policy of AE LLC to protect the health and safety of its employees, officers, and the general public.  It is the firm policy of AE LLC to fully and faithfully comply with all requirements, both substantive and reporting, of all environmental, health, and safety statues, regulations, ordinances, and permits affecting the operations and maintenance of our plants.  AE LLC has in place a number of plans for responding to emergency situations.  These plans are described in the PSM/RMP/CalARP Documents maintained onsite.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe cogeneration facility is located at 3970 Surface Navy Boulevard in San Diego, California, within U.S. Navy property.  The cogeneration facility provides steam to the Navy and electricity to the electric utility company, San Diego Gas & Electric (SDG&E).  The major system components are a gas turbine generator, a heat recovery steam generator (HRSG), a steam turbine generator, and associated equipment and control systems.  The facility began commercial operations in 1989.\r\n\r\nAE LLC uses anhydrous ammonia (NH3) to control emissions of oxides of nitrogen (NOx) from the gas turbine exhaust at the cogeneration facility.  Anhydrous ammonia is stored in a horizontally mounted tank.  The maximum capacity of the tank is 4,500 gallons. The tank contents are limited to a maximum of 3,825 gallons (19,700 pounds).  Annual consumption of ammonia is approximately 48,313 gallons. \r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nAs a facility constructed and operated to provide steam to the Navy and electricity to SDG&E, AE LLC's cogeneration facility is vital to national security and must be operated safely and efficiently. \r\n\r\nThe facility maintains, as required by the Occupational Safety and Health Administration (OSHA), its Process Safety Management (PSM) Program, which provides for the identification, prevention, and minimization of chemical releases that could result from failures in pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043818,
      "SummaryText": "ocesses, procedures and equipment.  The major safety systems in place at the facility include process safety equipment, and administrative safety procedures.\r\n\r\nThe AE LLC facility is designed and built according to accepted safety codes and standards for electrical, mechanical, and structural integrity.  AE LLC's process safety equipment includes a number of redundant systems, made up of local and remote indicators, sensors, and alarms that monitor operating levels, pressures and temperatures, and relay information to the facility Control Room Operator through an automated Distribution Control System. \r\n\r\nThe ammonia handling process includes relief, isolation, and vent valves that can provide a margin of safety in the event of deviations from normal conditions.  These safety mechanisms allow the operator to identify and isolate the problem and either return the system to normal conditions, or safely shut down the process.  The ammonia storage tank has a deluge system, which, in the event of a major leak or release, will activate high pressure water nozzles around the tank.\r\n\r\nA number of administrative safety procedures complement the process safety equipment at the AE LLC facility.  These include written standard operating procedures (SOP) for all processes; twice-daily shift walkdown and inspections of all major equipment, including valves and alarms; extensive use of procedural checklists, such as for ammonia tank loading; and an automated preventative maintenance system for tracking daily repair work orders and scheduled maintenance operations. \r\n\r\nAn operator training program encompassing operating procedures, safety and health, and emergency response with a biennial re-qualification requirement, helps ensure that employees think, act, and work safely while on the job.\r\n\r\nIn addition to the OSHA PSM, the AE LLC facility complies with all federal and state emergency response and safety plan requirements, including the Hazardous Substance Contingency Plan (HSCP"
    }
  ]
}