{
  "FacilityID": 1000028156,
  "FacilityName": "Edwardsport IGCC",
  "FacilityStr1": "15424 East State Rd. 358",
  "FacilityStr2": null,
  "FacilityCity": "Edwardsport",
  "FacilityState": "IN",
  "FacilityZipCode": "47528",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18083",
  "LEPC": "Knox County LEPC",
  "FacilityLatDecDegs": "38.7946775",
  "FacilityLongDecDegs": "-87.249466",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.duke-energy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 120736004,
  "ParentCompanyName": "Duke Energy Indiana, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Duke Energy Indiana, Inc.",
  "OperatorStr1": "1000 East Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Plainfield",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46168",
  "OperatorZipCodeExt": null,
  "RMPContact": "Louie Kavanaugh",
  "RMPTitle": "PSM Coordinator",
  "FTE": 220,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000217669",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "TO832713800003",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-03-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-10-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-10-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-10-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "6",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034366,
      "AltID": "Syn Gas - Toxic",
      "FacilityID": 1000028156,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000039286,
          "ProcessID": 1000034366,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041534,
          "ProcessID": 1000034366,
          "ChemicalID": 63,
          "Quantity": 20762.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 63,
            "ChemicalName": "Hydrogen sulfide",
            "CASNumber": "7783-06-4",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000541534,
          "ProcessID": 1000034366,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000034374,
      "AltID": "Syn Gas - Flammable",
      "FacilityID": 1000028156,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000039287,
          "ProcessID": 1000034374,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041549,
          "ProcessID": 1000034374,
          "ChemicalID": 149,
          "Quantity": 215984.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000541549,
          "ProcessID": 1000034374,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028156,
      "SummaryText": "EXECUTIVE SUMMARY FOR RMP\n\n\n\nINTRODUCTION: \n\nEdwardsport IGCC Station endeavors to prevent accidents and to prepare for conceivable incidents of all kinds. Toward these ends, chemical processes are subject to ongoing operating scrutiny and routine maintenance.  Station procedures direct employees on proper operation of all critical equipment and systems.  All employees receive training appropriate for the processes, equipment, and materials with which they work, including chemical process safety and proper response to accidental chemical releases. Station management sets high standards for safety and reinforces its expectations for all employees through internal/external evaluations, compliance auditing, goal setting, goal measuring, and identifying corrective actions for deviations. These site measures are supported by corporate policies and the expectation that facilities will meet or exceed all applicable environmental, health, and safety requirements.\n\n\n\nPROCESS INFORMATION:\n\nThe Edwardsport IGCC (Integrated Gasification Combined Cycle) Power Generating Station uses gasification technology to convert coal feedstock into synthesis gas (syngas), which is then cleaned and burned in a combined cycle process to produce electricity.  The grinding and slurry feed section includes coal handling systems to meter, grind, and slurry the coal for feed to the gasifier.  Coal slurry reacts with oxygen from the Air Separation Unit (ASU) system to produce syngas.  Facilities are included to scrub particulates from the syngas as well as remove coarse and fine slag from the scrubbing water.  Wet raw syngas from the gasification and scrubbing section is cooled and sent to the Acid Gas Removal (AGR) system and contains Hydrogen Sulfide gas.  The clean syngas is then sent to the power block system as fuel for the combustion turbines.  Nitrogen from the ASU is also sent to the combustion turbines for use as a diluent.  The power block uses two dual fueled gas turbine generators to pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028156,
      "SummaryText": "oduce electricity.  Steam generated within the gasification block is combined with steam from the power block to generate additional electricity in a steam turbine.  \n\n\n\nACCIDENTAL RELEASE PREVENTION MEASURES:\n\nEdwardsport IGCC Station has established an Accidental Release Prevention program for the Gasification system that meets or exceeds the requirements of both the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standard (29 CFR 1910.119) and the Environmental Protection Agency (EPA) Risk Management Program (RMP, 40 CFR 68).  To ensure safe operation, the Gasification system was designed to meet or exceed existing engineering standards and codes.  Safety features of the engineering design include, but are not limited to, emergency shutdown control systems, system over-pressurization protection, flare relief system, and process area detectors.  The station's release prevention program includes compliance with the PSM required 14 elements that include, but are not limited to, employee participation in evaluating/identifying/correcting hazards, maintaining process safety information available to employees, procedures and training for operating and maintaining the gasification system, conducting incident investigations,  a mechanical integrity inspection program for process equipment, and managing changes to the process.  To ensure a safe process, a process hazard analysis (PHA) is conducted at least every 5 years to review process hazards and identify potential improvements.  In addition, changes to the process design are reviewed for potential safety impact to identify if any additional protective measures are necessary.  This facility has been in production since October of 2012. \n\n\n\nFIVE-YEAR ACCIDENT HISTORY:\n\nThere have been no accidents involving a catastrophic release of RMP covered process chemicals.  \n\n\n\nEMERGENCY RESPONSE PLANS;\n\nThe Station's Emergency Response Plan, which meets OSHA Hazardous Emergency Response Plann"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028156,
      "SummaryText": "ing requirements (29 CFR 1910.120(q)- Hazwoper Standard) and Emergency Action Plan requirements (29 CFR 1910.38), has been coordinated with the Local Emergency Planning Committee (LEPC) and Emergency Response Agencies for Knox County and Daviess County.  All employees with operating responsibility for the gasification system receive initial classroom training, on-the-job training, and annual computer-based refresher training.  The operations group of employees are charged with first response to a chemical/gas release or fire incident.  The Emergency Response Team members are trained to the HazMat Technician Level and Fire Brigade Level requirements as outlined in the OSHA standards.  Refresher training includes, but is not limited to, annual Hazmat and Fire Brigade training including response drill scenarios.  In addition, the Station periodically conducts a facility-wide emergency drill in which personnel exercise the Emergency Action Plans (EAP) and Emergency Response Plans (ERP).\n\n\n\nMAINTAINING A SAFE OPERATION:\n\nDuke Energy's Edwardsport IGCC Station will continually work to safely manage the hazards of the processes to protect our employees, the local communities, contractors, and station visitors.  The Risk Management Program will be maintained to reduce the risk of accidental releases through training, procedures, equipment maintenance, and safe work practices.  Periodically, Duke will audit the program, review the Process Hazard Analysis, coordinate with emergency response organizations, and will update the program as needed to assure safe and efficient process is maintained.\n\n"
    }
  ]
}