{
  "FacilityID": 1000072936,
  "FacilityName": "Helena Agri-Enterprises, LLC - Dickinson, ND South",
  "FacilityStr1": "4354 Highway 22 South",
  "FacilityStr2": null,
  "FacilityCity": "Dickinson",
  "FacilityState": "ND",
  "FacilityZipCode": "58601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38089",
  "LEPC": "Stark County LEPC",
  "FacilityLatDecDegs": "46.781584",
  "FacilityLongDecDegs": "-102.788735",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Helena Agri-Enterprises, LLC",
  "Company2Name": null,
  "CompanyDUNS": 7036759,
  "Company2DUNS": 0,
  "OperatorName": "Helena Agri-Enterprises, LLC",
  "OperatorStr1": "PO Box 500",
  "OperatorStr2": null,
  "OperatorCity": "New England",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58647",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000191197",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-08 00:00:00",
  "SafetyInspectionBy": "North Dakota Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-09-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-09-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-09-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-09-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000091183,
      "AltID": "Storage and Handling",
      "FacilityID": 1000072936,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000113975,
          "ProcessID": 1000091183,
          "ChemicalID": 56,
          "Quantity": 278664.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000092428,
          "ProcessID": 1000091183,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000056921,
              "Process_NAICS_ID": 1000092428,
              "SafetyReviewDate": "2018-09-19 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "NFPA, Chapter 5; and North Dakota Anhydrous Ammonia Regulations",
              "FR_Comments": null,
              "HazardReviewDate": "2018-09-20 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Vehicle or Projectile Strike, Vandalism, Theft, or Terrorism",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Pneumatic Operated Internal Valves, Emergency Shutoff Valves and Pullaway Protection (Bulkhead, Tripod Safety Couplers)",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Audio, Visual and Olfactory Inspection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Re-plumbed process piping at the pressure vessel, installed pneumatic operated internal valves",
              "OpProceduresReviewDate": "2018-09-20 00:00:00",
              "TrainingReviewDate": "2018-04-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-09-18 00:00:00",
              "EquipmentInspectionDate": "2018-07-06 00:00:00",
              "EquipmentTested": "Pressure Vessel, Pressure Relief Devices, Piping, Valves, and Transfer hoses",
              "ComplianceAuditDate": "2016-07-13 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2017-11-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Branch Manager implements the Risk Management Plan (RMP) and Risk Management Program (RMPr) for the Storage & Handling of anhydrous ammonia at this Facility and is assisted by other Facility staff as directed.  The RMPr describes the Accident Prevention Program that includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, Incident Investigation, and Emergency Response.  \n\n\n\nThis Facility stores and handles anhydrous ammonia in a single stationary pressure vessel (PV) and nurse tanks.  The covered process equipment includes: (1) a single 30,000-gallon stationary PV and ancillary process piping, valves, liquid pump, gauges (volume, pressure, and temperature), safety systems (pneumatic operated internal valves, excess flow valves, emergency shutoff valves, backflow check valve, bulkhead, and breakaway equipment), and liquid meter system; (2) eight 1,000-gallon nurse tanks; and (3) fifteen 1,450-gallon nurse tanks.  \n\n\n\nThe Facility receives anhydrous ammonia by a Contractor that transports the anhydrous ammonia with a commercial tanker truck.  The commercial tanker truck is temporarily parked on the Facility property while the anhydrous ammonia is transferred to the stationary PV.  The Contractor performs the transfer of anhydrous ammonia from the commercial tanker truck to the stationary PV.  The Facility does not own or operate the commercial tanker truck.  The Contractor is responsible for training their operators and maintaining their equipment.  At a minimum, the Contractor must (1) have in place and certify compliance with applicable and relevant DOT, OSHA, state and local regulatory requirements, (2) make available to the Facility and EPA upon request any contractor-related documentation necessary to demonstrate compliance, and (3) certify that it has in place emergency shut-down procedures for anhydrous ammonia transfer operations.  The Facility coordinates with the Contractor on Emergency Contingency procedures and will provide access to the Facility RMPr upon request by the Contractor.\n\n\n\nTrained Process Operators operate the covered process which includes the: (1) monitoring of temperature, volume, and pressures during storage; (2) transfer of anhydrous ammonia from the stationary PV to the Facility owned nurse tanks; and (3) transfer of anhydrous ammonia from the stationary PV to Grower owned nurse tanks.  These operations are conducted in accordance with the RMPr Operating Procedures.  Trained personnel perform maintenance on this covered process in accordance with the RMPr Maintenance Procedures.  The Growers are responsible for maintenance on their nurse tanks.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000057629,
                  "PreventionProgram2ID": 1000056921,
                  "ProcessChemicalID": 1000113975
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000072936,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Dickinson Rural Fire Department",
    "CoordinatingAgencyPhone": "7014567877",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "This is a non-responding facility and it coordinates its response activities with the LEPC and local Fire Department. Notification information and procedures are provided in its Contingency Plan."
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000072936,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThe Helena Agri-Enterprises, LLC Dickinson, ND South Facility has submitted this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68.  Standards codified by the Occupational Safety and Health Administration at 29 CFR 1910.119 are not applicable to the operations at this facility because the facility is operated as a retail operation and is exempt from the OSHA standards.  However, the OSHA standards at 29 CFR 1910.111, Storage and Handling of Anhydrous Ammonia, are applicable and are included in the Risk Management Program (RMPr) document that is implemented by this Facility.  This electronic RMP summarizes the policies and procedures implemented by the Facility to minimize the likelihood of an accident, and to ensure that a response to a release will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nThe Facility is submitting this as a resubmission to reflect the change in: (1) company name; (2) nurse tank inventory; and (3) changes to process plumbing at the pressure vessel.  All relevant sections of the Facility RMPr have been reviewed and/or updated.  \n\n\n\nFACILITY\n\n\n\nThe operations at this Facility consist of agricultural fertilizer retail.  The Facility operates one (1) covered process that includes Storage and Handling of anhydrous ammonia.  Anhydrous ammonia is transported to this Facility by a Contractor owned and operated commercial tanker truck.  The Contractor transfers anhydrous ammonia from the commercial tanker truck to a single 30,000-gallon stationary pressure vessel (PV).  \n\n\n\nThe Facility stores the anhydrous ammonia in the single stationary PV and then transfers the anhydrous ammonia from the PV to Facility owned nurse tanks and Grower owned nurse tanks at the point of retail sale to the end user (i.e. Grower/Farmer).  Trained Process Operators perform the transfer of anhydrous ammonia in accor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000072936,
      "SummaryText": "dance with its RMPr accident prevention program.  The Facility owns (8) 1,000-gallon nurse tanks and (15) 1,450-gallon nurse tanks.  Grower owned nurse tanks are not stored at the Facility.  \n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nWorst case and alternative case consequence analyses were completed for the single covered process that is operated at this Facility.  The worst case release scenario assumes that all the contents in the largest single PV (i.e. 30,000 gallons) are released.   The release scenario consists of the PV being punctured on the side at the ground level and the release is modeled as a ground level horizontal jet.\n\n\n\nThe alternative (or more likely to occur) scenario assumes a 30-second release from a violent rupture of a 2-inch transfer hose caused by an impact or pull-away during a transfer operation.  This alternative scenario considers active mitigation of the safety equipment (i.e. emergency shutoff and excess flow valves on the commercial tanker truck; and pneumatic operated internal valves, backflow check valve, and emergency shutoff valve on the PV side of the bulkhead), and operating procedures that the Facility uses to safeguard against releases from ammonia transfer operations.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Branch Manager implements the risk management planning process at this Facility.  The Branch Manager is assisted by other Facility staff, as directed.  The Branch Manager is responsible for ensuring that Facility Staff are properly trained in the implementation of the Prevention Program which includes Safety Information, Hazard Analysis, Operating Procedures, Training, Maintenance, Compliance Audits, Incident Investigations, and Emergency Contingency Plans.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThis is a non-responding Facility.   The Facility has coordinated emergency response activities with its local emergency response agency and local fire department.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000072936,
      "SummaryText": " significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at this Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by the Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Facility adds, deletes, or makes changes to the process. The Emergency Response Program has been coordinated with the Stark County LEPC and the Dickinson Rural Fire Department.  \n\n\n\nNOTE: Sections 4, 5, 6, and 7 of the standard RMP produced by EPA's RMP Submit Program are not applicable to the Facility.\n\n\n\n"
    }
  ]
}