{
  "FacilityID": 1000006600,
  "FacilityName": "Tri-Con Industries, Ltd. Manufacturing Plant",
  "FacilityStr1": "4000 NW 44th st.",
  "FacilityStr2": null,
  "FacilityCity": "Lincoln",
  "FacilityState": "NE",
  "FacilityZipCode": "68524",
  "Facility4DigitZipExt": "1626",
  "FacilityCountyFIPS": "31109",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "40.854167",
  "FacilityLongDecDegs": "-096.781111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 176235224,
  "ParentCompanyName": "TS Tech Japan",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tri-Con Industries, Ltd",
  "OperatorStr1": "4000 NW 44th st.",
  "OperatorStr2": null,
  "OperatorCity": "Lincoln",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68524",
  "OperatorZipCodeExt": "1626",
  "RMPContact": "Tyrone Chatman",
  "RMPTitle": "HR/EHS Management",
  "FTE": 114,
  "OtherEPAFacilityID": "NED986375509",
  "EPAFacilityID": "100000089272",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-03-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.85181,
  "FRS_Long": -96.7826,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007764,
      "AltID": "Motorcycle, bicycle & par",
      "FacilityID": 1000006600,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000007911,
          "ProcessID": 1000007764,
          "NAICSCode": "336991",
          "_desc": {
            "NAICS_CODE": "336991",
            "NAICS_DESCRIPTION": "Motorcycle, Bicycle, and Parts Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008688,
          "ProcessID": 1000007764,
          "ChemicalID": 44,
          "Quantity": 45000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000008689,
          "ProcessID": 1000007764,
          "ChemicalID": 20,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 20,
            "ChemicalName": "Toluene 2,6-diisocyanate  [Benzene, 1,3-diisocyanato-2-methyl-]",
            "CASNumber": "91-08-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508688,
          "ProcessID": 1000007764,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508689,
          "ProcessID": 1000007764,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006600,
      "SummaryText": "EXECUTIVE SUMMARY\n\n1. SUMMARY OF OPERATION WHICH REQUIRES RMP\n\nTri-Con Industries LTD. Manufacturing Plant is a recreational vehicle seat manufacturer.  The scope of business includes injection molding, polyurethane foam production, vacuum forming, sewing and assembly.  At the foam production department we use a mixture of 2, 4-Toluene Diisocyanate and 2, 6- Toluene Diisocyanate as a catalyst held in a 6000 gallon tank.  There is also a 6000 gallon tank of polyol.  Because we have more than minimum threshold for regulated substances, 2, 4 and 2, 6- TDI, Tri-Con Industries LTD Manufacturing Plant is required to develop Risk Management Program.  Based on the modeling done with RMP COMP and other factors, Tri-Con Manufacturing Plant is a Level 2 program for these two chemicals.  2, 4 and 2, 6- TDI is contained in the 6000 gallon holding tank which is plumbed to the 55 gallon day tank for temperature control.  A piping system connects the day tank to the foam head on the robot. The foam head on the robot is the point at which the catalyst and the polyol are mixed together and shot into a mold.  The chemicals are periodically delivered by our supplier, Bayer, via a tank truck.  The maximum capacity of the tank is of 6000 gallons, which calculates out to approximately 62000 pounds of chemical (2,4  TDI 45000 pounds, 2,6  TDI 11000 pounds respectively).  However, we stored maximum for the last calendar year, 2008, 30000 pounds of 2,4  TDI and 7500 pounds of 2,6 TDI.\n\n2. TRI-CON'S APPROACH TO CHEMICAL SAFETY\nTri-Con's management is committed to minimize negative impact to the environment.  As one way to ensure proper handling of chemicals on site, Tri-Con registered in ISO 14001.  Through our ISO 14001 Environmental Management System, we achieve continual improvement by means of internal audits, corrective actions and management reviews.  Training is also an important part of ISO 14001.  Work instructions are developed and implemented for key processes.  Deviations from the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006600,
      "SummaryText": " procedures and/or work instructions are pointed out by internal audits, and corrective actions are developed and tracked to eliminate root causes.  A maintenance program and emergency response procedure are also segments of our ISO 14001 Environmental Management System and strictly followed.  Our ISO 14001 Environmental Management System covers chemicals that are not part of this Risk Management Program; however, the process covered under Risk Management Program is on of the most important aspects.\n\n3. THE WORST-CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE\n\nSCENARIO\n\nTHE WORST-CASE SCENARIO\nThe worst case scenario for our situation would be a total release of TDI mixture from the 6000 gallon holding tank.  There are several possibilities which will allow this to happen; however, we based our calculations on the following scenario: the valve that is located at the bottom of the tank would rupture or catastrophically fail allowing the whole content to spill from the tank.  The size of the possible rupture and the duration of the spill are described in the report.  The holding tank is located in a dike area that would hold the whole content of the tank.  The modeling of dispersion was done using RMP COMP which was downloaded from the EPA website and verified by CD distribution from EPA. The storage tank/diked area which will hold the whole content of the tank is enclosed by the building, thus reducing the chance of release outside of the facility.\n\nOTHER  ALTERNATIVE SCENARIO\n\nThe alternative and most likely scenario is that the pipe which connects the day tank and the foam mix head would rupture and spill the contents of the pipe system.  The duration of the spill is described in the report.  If this type of spill occurs, it would most likely be contained fairly quickly.  As soon as system becomes unbalanced, the system will automatically shut down.  The chemical we would lose is that contained in the piping system, which is about 1 gallon.  The spill would happ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006600,
      "SummaryText": "en in the foam production area where there is no mitigation system but enclosure.  The modeling was done using the RMP COMP which was downloaded from the EPA web site.\n\n4. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nAs previously mentioned, Tri-Con Industries LTD has a commitment to reduce negative environmental impacts.  The tool that we use is ISO 14001 Environmental Management System. The ISO 14001 Manual includes Procedures and Work Instructions, including process control, Preventive Maintenance and emergency response procedures.  Our ISO 14001 Environmental Management System requires Tri-Con Industries, Ltd. to achieve continual improvement by utilizing internal audit, corrective action and management review.  Internal audits identify any deviation from the preventive maintenance program and emergency response procedures.  When a non-conformance to ISO 14001 Procedures is found, corrective actions are generated, resolving the root causes which allow deviations to take place.  Management periodically reviews the results of internal audits and the Manual/Procedures/Work Instructions to improve on the system itself.  General chemical safety for the process that applies to RMP is a part of this ISO 14001 system.    Furthermore, our Safety Committee conducts monthly inspections. \n\n5. THE FIVE-YEAR ACCIDENT HISTORY\n\nWe have not had any accident involving the covered process in the last five years. \n\n6. THE EMERGENCY RESPONSE PROGRAM\n\nThe emergency response program is set up for fire, tornado and chemical spill.  The actual program in included in this report as a Microsoft Word text file (emergency response procedure.txt)  In the event of chemical spill of 2,4 A? and 2,6 TDI, we will evacuate the plant.  The initial response will be done by City of Lincoln Fire Department Hazardous Material team.  The clean up will be contracted out to firms that specialize in hazardous material clean up.  We plan to conduct a drill at lea"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000006600,
      "SummaryText": "se once a year.\n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\nWe registered to the ISO 14001 Environmental Management System requirements in 2009.  Currently, we are maintaining and improving our processes and procedures to guarantee environment compliances.  The integrity of the system is checked frequently and verified by outside auditors regularly.  There remains a slight possibility that we may switch to a different chemical with less 2,4 and 2,6 TDI."
    }
  ]
}