{
  "FacilityID": 1000075329,
  "FacilityName": "Kripple Kreek Gas Plant",
  "FacilityStr1": "1988 Brier Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "Bowie",
  "FacilityState": "TX",
  "FacilityZipCode": "76230",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48337",
  "LEPC": "Montague County LEPC",
  "FacilityLatDecDegs": "33.527130",
  "FacilityLongDecDegs": "-097.882610",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "421 West 3rd Street, Suite 150",
  "FacilityEmailAddress": "dewayne_gray@eogresources.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "EOG Resources, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 186830733,
  "Company2DUNS": 0,
  "OperatorName": "Pecan Pipeline",
  "OperatorStr1": "421 West 3rd Street",
  "OperatorStr2": "Suite 300",
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76102",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000205155",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O3240",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-01-09 00:00:00",
  "ErrorReportDate": "2009-01-26 00:00:00",
  "ReceiptDate": "2019-01-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-01-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-01-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000093785,
      "AltID": "Natural Gas Liquids Extra",
      "FacilityID": 1000075329,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000117335,
          "ProcessID": 1000093785,
          "ChemicalID": 155,
          "Quantity": 1360041.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000102305,
              "ProcessChemicalID": 1000117335,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000102306,
              "ProcessChemicalID": 1000117335,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000102307,
              "ProcessChemicalID": 1000117335,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000102308,
              "ProcessChemicalID": 1000117335,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000102309,
              "ProcessChemicalID": 1000117335,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000102310,
              "ProcessChemicalID": 1000117335,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000102311,
              "ProcessChemicalID": 1000117335,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000095050,
          "ProcessID": 1000093785,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000079901,
              "Process_NAICS_ID": 1000095050,
              "SafetyReviewDate": "2017-03-20 00:00:00",
              "PHA_Date": "2017-03-20 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-12-31 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-10-25 00:00:00",
              "TrainingReviewDate": "2018-05-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "CBT",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "CBT",
              "MaintenanceReviewDate": "2018-05-03 00:00:00",
              "EquipmentInspectionDate": "2017-09-01 00:00:00",
              "EquipmentTested": "UT testing for all of train 3 and 4",
              "ChangeMgmtDate": "2018-12-21 00:00:00",
              "ChangeMgmtReviewDate": "2018-02-15 00:00:00",
              "PreStartupReviewDate": "2018-12-11 00:00:00",
              "ComplianceAuditDate": "2018-06-28 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-02-01 00:00:00",
              "HotWorkPermitReviewDate": "2016-01-01 00:00:00",
              "ContractorSafetyReviewDate": "2016-01-01 00:00:00",
              "ContractorSafetyEvalDate": "2018-06-14 00:00:00",
              "CBI_Flag": 0,
              "Description": "Prevention Program applies to the entire Kripple Kreek Gas Plant facility.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000099200,
                  "PreventionProgram3ID": 1000079901,
                  "ProcessChemicalID": 1000117335
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000075329,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-12-06 00:00:00",
    "ERTrainingDate": "2018-12-06 00:00:00",
    "CoordinatingAgencyName": "City of Bowie Fire Department",
    "CoordinatingAgencyPhone": "9408722122",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075329,
      "SummaryText": "Executive Summary\n\nEOG Resources, Inc.\n\nKripple Kreek Gas Plant\n\n    \n\n    ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\n    \"EOG Resources has a longstanding commitment to public welfare and worker safety.  EOG addresses accidental release prevention through four factors:  design, training, operating parameters and regular maintenance.  Through design efforts, we have limited the public exposure.  Through training, we have prepared our personnel to respond effectively.  Limiting the operating parameters reduces the stress on process equipment.  And regular maintenance serves to prolong equipment life as well as discover potential problems before they become a safety issue.\n\n\n\nShould an accidental release of a regulated substance occur, EOG personnel will evaluate the  conditions, take actions within their capabilities to minimize the risk and notify the appropriate outside agencies.\"\n\n    \n\n    FACILITY BACKGROUND INFORMATION\n\n    \"The Kripple Kreek Gas Plant facility is a natural gas processing facility which includes fixed and skid mounted natural gas processing equipment and natural gas liquids storage tanks. The plant contains several regulated flammable substances including: propane, butane, ethane, methane, pentane, isobutene [Butane, 2-methyl-], and Isopentane [Propane, 2-methyl-]. These substances are listed in Tables 3-41 of the 40 CFR 68.130. This installation does not have any regulated toxic substances with an amount greater than the threshold quantity specified in 40 CFR 68.1302.\n\n\n\nMarplot indicates that there are no public and no environmental receptors within the 0.3 mile radius endpoint. There is one potential residential and two potential public receptors marginally beyond the 0.3 mile radius endpoint. These potential public receptors are one housing unit and two office buildings located:\n\n\n\n 1. East at 1,775' (office buildings), and \n\n 2. Southeast at 2,219' (housing unit).  \n\n\n\n\n\nThere are no public receptors within the area of the alternate release scenar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075329,
      "SummaryText": "io. Additionally, there are no environmental receptors in either the worst case scenario or the alternate release scenario area.\"\n\n    \n\n    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\n    The referenced process at the Kripple Kreek Gas Plant is regulated under both the Environmental Protection Agency's (EPA) Risk Management Plan (RMP)) and the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standards.  Since the scope of these two programs encompass much of the same material, we have presented the pertinent information following the outline established in the PSM program.\n\n    \n\n    Employee Participation\n\n    \"Employee participation is mandated by the corporate PSM manual.  In response to this mandate the Kripple Kreek Gas Plant has:\n\n 1.  Created a matrix of required employee participation.\n\n 2.  Posted information for employee participation in the Control Room.\n\n 3.  Reported the finding for PHAs, Compliance Audits and incident investigations during regularly   scheduled Safety Meetings.\n\n 4.  Directly involved employees in the establishment of maintenance and operating procedures.\n\n 5.  Sought input for training, both in subject matter and timing from employees.\n\n 6.  Trained all employees in the Management of Change (MOC) process.\n\n 7.  Included employee input in the Process Safety Information (PSI).\n\n 8.  Included employees with appropriate knowledge in the Process Hazard Analysis (PHA).\n\n 9.  Made all information associated with Accident Prevention available to all employees at the facility.\n\n\n\nThe Kripple Kreek Gas Plant actively encourages employee participation in all aspects of operation and safety.  The result is a more invested group of personnel and an ever increasing accident prevention awareness.\n\n\"\n\n    \n\n    Process Safety Information\n\n    \"The Kripple Kreek Gas Plant maintains a variety of information used to analyze the steps necessary to ensure the safe operation of the process.  This information includes:\n\n 1.  Inventories of re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075329,
      "SummaryText": "gulated chemicals.\n\n 2.  Data on chemical properties and associated release and exposure hazards and appropriate responses.\n\n 3.  Piping and Instrumentation Diagrams.\n\n 4.  Relief and vent system studies and designs.\n\n 5.  Process design as well as operating parameters and limits.\n\n 6.  Safety interlocks.\n\n 7.  Information on equipment design, materials, ratings and testing.\n\n 8.  Electrical equipment class and ratings.\n\n 9.  Maintenance history and records.\n\n10.  Historical operating records.\n\n\n\nKripple Kreek Gas Plant then uses this information to assess potential hazards, modify maintenance steps and frequency, adjust operating procedures, change process and equipment functioning limits as well as alter safety requirements necessary to ensure the effectiveness of the accident prevention program.\"\n\n    \n\n    Process Hazard Analysis (PHA)\n\n    \"The Kripple Kreek Gas Plant uses the Process Hazard Analysis (PHA) findings to improve operating procedures, consequence of deviations and mechanical integrity.  The PHA systematically evaluates each process for potential hazards and then recommends change where needed.  These PHAs are revalidated every five years.\n\n\n\nThe PHA team is selected from management and employees.   Members are chosen based on their knowledge in operating and maintaining the process and engineering expertise.\n\n\n\nThe Kripple Kreek Gas Plant considers a variety of factors when conducting the PHA using a combination of the \"\"What if\"\" and HAZOP methods for evaluating potential hazards.  Some of the factors considered are:\n\n 1.  All Process Safety Information (PSI).\n\n 2.  Cause and Effects.\n\n 3.  Human factors.\n\n 4.  Public health.\n\n 5.  Environmental factors.\n\n 6.  Safeguards in place.\n\n 7.  Facility siting.\n\n 8.  Incidents, accidents and near miss reports.\n\n 9.  Management of Change (MoC) information.\n\n10.  All previous PHAs.\n\n\n\nThe results of the PHAs are published and made available to all personnel.  The PHA follow-up items are promptly addressed based on t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000075329,
      "SummaryText": "heir priority ranking.  The responses to the PHA recommendations are tracked until they are resolved.  Kripple Kreek Gas Plant retains the records of previous PHAs. \n\n\"\n\n    \n\n    Operating Procedures\n\n    \"The Kripple Kreek Gas Plant maintains easily obtainable written operating procedures that address various aspects of the process.  These procedures cover normal startup, startup after turnaround, normal operation, temporary operation, emergency operation, normal shutdown and emergency shutdown.  In addition, the procedures list operating limits, consequence of deviations and responses, safety and health concerns and  safety systems.  Kripple Kreek Gas Plant uses these procedures for reference by experienced personnel and to provide a basis for consistent training of new operators.\n\n\n\nOperating procedures are reviewed and modified whenever there are changes in process chemicals, technology, equipment and/or facility.  Reviewing operating procedures is an element of the Management of Change (MOC) procedure.  In addition, the accuracy of all operating procedures are recertified annually.\"\n\n    \n\n    Training\n\n    To complement the written procedures for process operations, the Kripple Kreek Gas Plant has implemented a comprehensive training program for employees involved in operating a process. New operational employees receive training on the Kripple Kreek Gas Plant's Operating Procedures, and basic training in process operations if they are not already familiar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. After operators demonstrate adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 ye"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000075329,
      "SummaryText": "ars, or more frequently upon request. All of this training is documented for each operator, including skills demonstration used to verify that the operator understood the training. Process maintenance personnel are trained in their perspective duties for maintaining the mechanical integrity of critical process equipment and systems. Operational and maintenance personnel also receive training on the procedures for conducting hot work permitting; lockout/tag out, management of change; and other appropriate safe work practices.\n\n    \n\n    Contractors\n\n    \"The Kripple Kreek Gas Plant uses contractors to supplement its workforce for construction, maintenance and testing.  To ensure that these contractors meet the safety and workplace standard, Kripple Kreek Gas Plant personnel complete contractor evaluation forms at regular intervals.  These completed forms are evaluated by safety and management to determine compliance with the established policies, procedures and guidelines.  Contractors must maintain an acceptable score on these reviews to continue working at the facility.  In addition, the Safety Group reviews the contractor's written safety program, its implementation and training to ensure that it complies with the Kripple Kreek Gas Plant requirements.\n\n\n\nThe Kripple Kreek Gas Plant provides contractors with:\n\n 1.  A process overview\n\n 2.  Safety orientation and ensures their understanding through testing.\n\n 3.  Information about health and safety hazards.\n\n 4.  Emergency evacuation procedures and mustering location.\n\n 5.  All site specific safe work practices.\"\n\n    \n\n    Pre-startup Safety Reviews (PSSRs)\n\n    \"The Kripple Kreek Gas Plant conducted a Pre-startup Safety Review (PSSR) before commencing initial process operations.  The records of those PSSRs are maintained at the facility.  In addition a PSSR is conducted anytime a change is made that effects the Process Safety Information or before startup after a turnaround.  The records of those PSSRs are maintained as part of the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000075329,
      "SummaryText": " MOC process.  Kripple Kreek Gas Plant uses a standardized corporate PSSR checklist.  The PSSR serves to ensure that:\n\n 1.  Appropriate training has been conducted.\n\n 2.  Equipment, instruments, safety equipment and other elements are properly installed.\n\n 3.  Valves and controls are in the normal/safe position.\n\n 4.  Compressors and process equipment have been prepared for startup.\"\n\n    \n\n    Mechanical Integrity\n\n    \"The elements of the Kripple Kreek Gas Plant Mechanical Integrity program are periodic tests and inspections, regular maintenance, trained personnel, work order systems, written procedures and  record keeping.  The program includes pressure vessels, atmospheric tanks, piping, relief and vent systems, process equipment, pumps, compressors as well as dehydration, hot oil and flaring equipment.\n\n\n\nMaintenance personnel receive training including:\n\n(1) an overview of the process, \n\n(2) safety and health hazards, \n\n(3) applicable maintenance procedures, \n\n(4) emergency procedures, and \n\n(5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.\n\n\n\nWritten inspection, testing and maintenance procedures provide that work is performed in a consistent manner, and serve as a basis for training maintenance personnel in their assigned duties\n\n\n\nInspections and tests are performed to ensure that the equipment functions as intended and to establish a baseline for future monitoring. If a deficiency is identified that presents a safety concern, Kripple Kreek Gas Plant personnel will correct the deficiency before placing the equipment back into service.\n\n\n\n\"\n\n    \n\n    Safe Work Practices\n\n    Safe work practices at the Kripple Kreek Gas Plant are defined by  (1) the corporate safe practices manual, (2) a lockout/tag out procedure to isolate energy sources for equipment and piping undergoing maintenance, (3) a permit and procedure to control spark producing activities (i.e., hot work), and (4) a permit and procedure to verify that adequate pre"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000075329,
      "SummaryText": "cautions are in place before entry into a confined space. (5) procedures to control entry into the facility.  These practices along with training and procedures help to ensure that operating and maintenance activities at the plant are performed safely.\n\n    \n\n    Management of Change\n\n    \"The Kripple Kreek Gas Plant has a comprehensive system to manage changes to all covered processes. This system requires that changes to items such as process equipment, chemicals, technology (including operating conditions of the process), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) determine that adequate\n\ncontrols are in place to manage any new hazards and (2) verify that existing controls have not been\n\ncompromised by the change. Affected chemical hazard information, process operating limits,\n\nequipment information, and operating procedures are updated prior to incorporating these changes.\n\nIn addition, operating and maintenance personnel and affected contractors are provided any\n\nnecessary training on the change.\"\n\n    \n\n    Incident Investigation\n\n    \"The Kripple Kreek Gas Plant promptly investigates all incidents related to a covered process that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the factors that may have led to the incident, and develop corrective actions to prevent a recurrence of the incident\n\nor a similar incident. The investigation team documents its recommendations to prevent a\n\nrecurrence, and forwards these results to Kripple Kreek Gas Plant management for resolution. Corrective actions taken in response to the investigation team's recommendations are tracked until they are complete. The final resolution of each recommendation is documented, and the investigation results are\n\nreviewed with all employees (including contractors) who could be"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000075329,
      "SummaryText": " affected by the recommendations.\n\nIncident investigation reports are retained for at least 5 years so that the reports can be reviewed\n\nduring future and revalidated PHAs.\"\n\n    \n\n    Compliance Audits\n\n    \"To determine that the Accident Prevention Program is functioning properly, the Kripple Kreek Gas Plant conducts compliance audits every three years.  Kripple Kreek Gas Plant employs a third party to conduct the audit to ensure impartiality and a fresh perspective.  The audit results and any findings are shared with all personnel at a regularly scheduled safety event.  In addition, the final report is available at the Control Room for reference.\n\n\n\nAll audit findings are corrected in a timely fashion based upon priority ranking.  A record of all findings and the actions taken to resolve them is maintained at the plant for the two most recent audits.\"\n\n    \n\n    CHEMICAL-SPECIFIC PREVENTION STEPS\n\n    \"The Kripple Kreek Gas Plant has safety features to manage potential hazards, contain and control a spill, detect a release, mitigate the consequences of a release and ensure the continued safe operation of the process.  These features include:\n\n 1.  Monitoring and control with SCADA software.\n\n 2.  Management, surveillance and control by trained onsite operational personnel.\n\n 3.  Offsite monitoring and shutdown capabilities.\n\n\n\nContainment and control features include:\n\n 1.  Pressure relief devices to avoid over pressurizing.\n\n 2.  Valves that control and/or isolate part or all of the process.\n\n 3.  Interlocks and shutdown for specific process parameters.\n\n 4.  Curbing and/or diking to contain spills.\n\n\n\nActive and Passive mitigation features:\n\n 1.  Fire extinguishing equipment.\n\n 2.  Established and documented emergency procedures.\n\n 3.  Coordination with emergency responders.\n\n 4.  Personal Protective Equipment and other safety equipment.\"\n\n    \n\n    FIVE-YEAR ACCIDENT HISTORY\n\n    No RMP incidents have occurred at the Kripple Kreek Gas Plant during the past five (5) years.\n\n    \n\n    EMERGENCY"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000075329,
      "SummaryText": " RESPONSE PROGRAM INFORMATION\n\n    \"The Kripple Kreek Gas Plant operates under the Fort Worth Division Emergency Response Plan and the Kripple Kreek Gas Plant Supplements to that plan.  This supplement contains a site specific Emergency Action Plan including a drawing showing evacuation routes and Muster Point.  The Emergency Action Plan diagram is posted in the Control Room.  The supplement also contains the appropriate steps for the different types of emergencies and contact information for corporate and emergency responders.\n\n\n\nIn addition, all employees receive recurring training in environmental, safety and medical emergencies.  Also, Kripple Kreek Gas Plant has conducted periodic training events with Montague County Emergency Management agencies.\"\n\n    \n\n    DRIVING DIRECTIONS:\n\n    From the intersection of HWY 59 and HWY 287, drive west 2.3 miles on HWY 59, turn south onto FM 2583, travel south on FM 2583 for 0.5 miles, turn east onto Brier Creek Rd, travel east 0.6 miles on Brier Creek Rd., Kripple Kreek Gas Plant is on the north side of Brier Creek Rd.\n\n"
    }
  ]
}