{
  "FacilityID": 1000096086,
  "FacilityName": "Cargill Texturizing Solutions",
  "FacilityStr1": "1100 Indianapolis Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Hammond",
  "FacilityState": "IN",
  "FacilityZipCode": "46320",
  "Facility4DigitZipExt": "1094",
  "FacilityCountyFIPS": "18089",
  "LEPC": "Lake County LEPC",
  "FacilityLatDecDegs": "41.694444",
  "FacilityLongDecDegs": "-087.515833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "cargill.com",
  "FacilityEmailAddress": "adam_lawson@cargill.com",
  "FacilityDUNS": 5460753,
  "ParentCompanyName": "Cargill, Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 6249189,
  "Company2DUNS": 6249189,
  "OperatorName": "Cargill, Inc.",
  "OperatorStr1": "1100 Indianapolis Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Hammond",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46320",
  "OperatorZipCodeExt": "1094",
  "RMPContact": "Christopher Foster",
  "RMPTitle": "Environmental Manager",
  "FTE": 250,
  "OtherEPAFacilityID": "46320MRCNM1100I",
  "EPAFacilityID": "100000138576",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "089-44211-00203",
  "SafetyInspectionDate": "2018-10-18 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-10-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-10-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-10-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-10-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.69884,
  "FRS_Long": -87.52101,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119153,
      "AltID": "Starch Modification",
      "FacilityID": 1000096086,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000120506,
          "ProcessID": 1000119153,
          "NAICSCode": "311221",
          "_desc": {
            "NAICS_CODE": "311221",
            "NAICS_DESCRIPTION": "Wet Corn Milling"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000149017,
          "ProcessID": 1000119153,
          "ChemicalID": 12,
          "Quantity": 539881.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 12,
            "ChemicalName": "Propylene oxide  [Oxirane, methyl-]",
            "CASNumber": "75-56-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000649017,
          "ProcessID": 1000119153,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096086,
      "SummaryText": "2.0    EXECUTIVE SUMMARY [40 CFR 68, SUBPART G, ?68.155]\n\n2.1    Accidental Release Prevention and Emergency Response Policies [?68.155(a)]\n\nIt is the policy of Cargill to conduct all business activities in a manner that protects the environment and the health and safety of its employees, contractors, customers, and the public.\n\n?    Environment - Cargill will comply with all applicable laws and regulations; promote waste reduction, resource and property conservation and environmental protection; and train employees to be knowledgeable about all environmental matters relevant to their work.\n\n?    Health and Safety - Cargill will design, construct, maintain and operate facilities to protect human and physical resources; provide and require use of adequate protective equipment and measures, and insist that all work, however urgent, be done safely.\n\n?    Food and Product Safety - Cargill will provide safe food, feed, and materials for humans and animals by using production, storage and transportation facilities that ensure the safety of products; choose suppliers that meet Cargill and regulatory requirements for safe raw materials and ingredients; and provide employees the training and resources they need to meet their individual responsibilities.\n\n\n\nSenior management is fully committed to plant safety programs and implementation of accidental release prevention measures and emergency response.  In order to insure the safe and effective response to an unlikely emergency in the workplace, the plant coordinates safety and emergency response with local community and agency emergency response personnel.  Plant management makes information available to the public and its employees regarding hazards and risks.\n\n\n\n2.2    The Stationary Source and Regulated Substances Handled [?68.155(b)]\n\nThe Cargill Hammond plant produces corn syrup and various starches for food and non-food industries.  The starch production area uses propylene oxide which is regulated under 40 CFR Part 68.  The starch modif"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096086,
      "SummaryText": "ication process uses propylene oxide as a reactant to generate water soluble starch products.  Propylene oxide can potentially be stored in up to two (2) railcars, each with a capacity of 25,473 gallons or 176,435 lbs.  Propylene oxide is also stored in a 30,000-gallon capacity tank (rated capacity) which is hard-piped into the process area starch reactors.  The tank has a maximum storage capacity of 90% of the rated capacity, which equates to approximately 27,000 gallons or 186,300 pounds.  The maximum potential propylene oxide storage capacity onsite is 77,946 gallons or 539,170 pounds.  These capacities were computed based on a specific gravity of 0.83 (density of 6.926 lb/gal) for propylene oxide.\n\n\n\n2.3    General Accidental Release Prevention Program and Chemical-Specific Prevention Steps [?68.155(c)]\n\nThe Cargill Hammond plant complies with all OSHA requirements as part of its safety program such as Hazard Communication 29 CFR 1910.1200 as well as other applicable requirements under 29 CFR 1910.  Cargill primarily manages propylene oxide under the OSHA Process Safety Management (PSM) program standards in accordance with 29 CFR 1910.119 which has similar requirements to the RMP program.  Other technical and procedural elements and practices that are utilized as part of the facility's accidental release prevention program include:\n\n?    Security - limited access\n\n?    Process Hazard Analysis (PHA)\n\n?    Operating procedures and safe work practice procedures\n\n?    Mechanical integrity practices\n\n?    Comprehensive training\n\n?    Management of change process\n\n?    Pre-start up safety review\n\n?    Incident investigation\n\n?    Compliance audits\n\n\n\n2.4    Five-Year Accident History [?68.155(d)]\n\nDuring the past five years, there have not been any accidental releases or incidents involving propylene oxide that qualify for reporting under 40 CFR Part 68.  \n\n\n\n2.5    Emergency Response Program [?68.155(e)]\n\nCargill Hammond has established an Emergency Action Plan (EAP).  The plant's emergency response pe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000096086,
      "SummaryText": "rsonnel team is made up of select plant employees.  The plant coordinates emergency response with the Hammond Fire Department, the Hammond Police Department, the Lake County Sheriff's Department, and area ambulance/paramedic services for assistance as needed to control and resolve emergencies.  Emergency response training exercises and drills have included the Hammond Fire Department, and area ambulance/paramedic services.  The EAP details emergency notification and alert procedures.\n\n\n\n2.6    Planned Changes to Improve Safety [?68.155(f)]\n\nCargill Hammond's safety program is ongoing and incorporates continuous improvement through internally required evaluations of safety actions and programs.  The plant will continue to explore chemical substitution, process modifications and additional safety equipment that can reduce the risk for on and off site impact of potential releases.\n\n\n\n3.0    RISK MANAGEMENT PLAN - PROGRAM 3 [40 CFR 68, SUBPART D]\n\nThe following elements of the RMP are also detailed in the facility's Process Safety Management (PSM) program.  Cargill primarily manages propylene oxide under the OSHA Process Safety Management (PSM) program standards in accordance with 29 CFR 1910.119 which has similar requirements to the RMP program.  \n\n\n\n3.1    Process Safety Information [?68.65]\n\nCargill Hammond's PSM program maintains technical documents that are used to assist in accident prevention efforts.  Written safety information includes chemical properties, process descriptions and diagrams, equipment design information, and operational parameters.\n\n\n\n3.2    Process Hazard Analysis [?68.67]\n\nAs part of the PSM program, Cargill Hammond conducts process hazard analyses to ensure that hazards associated with processes are identified and abated effectively.  The Hazard and Operability (HAZOP) analysis technique is primarily used.  A team of qualified personnel with expertise in engineering, process operations, safety and maintenance participates in the analysis.  The team findi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000096086,
      "SummaryText": "ngs are presented to management for resolution as needed.  Implementation of mitigation actions is based on a relative risk ranking system completed by the team.  Team findings are tracked until they are completed and appropriately documented.  The HAZOP studies are revalidated at least once every five years.\n\n\n\n3.3    Operating Procedures [?68.69]\n\nCargill Hammond maintains written operating procedures for covered processes that address various modes of operations.  Operating modes include startup, normal operation, temporary operation, emergency shutdown, normal shutdown, and initial startup of new processes, among others.  These procedures are used for reference and used as the basis for training new employees.  The procedures are regularly reviewed and updated. \n\n\n\n3.4    Training [?68.71]\n\nThe plant has a comprehensive training program in place to ensure that employees operating the processes are competent.  New employees receive initial training on process basics and are given on the-job supervision until they demonstrate the ability to work independently.  Refresher training is provided periodically to ensure skill and knowledge is retained.\n\n\n\n3.5    Mechanical Integrity [?68.73]\n\nThe plant carries out documented maintenance inspections on pressure vessels, piping systems, relief and vent systems, controls, pumps, and emergency shutdown systems to ensure safe operating condition.  Maintenance operations are carried out by trained and qualified personnel.  Equipment deficiencies identified by the maintenance checks are resolved through corrective and preventive actions.  The plant has also implemented a leak detection and repair program pursuant to 40 CFR, Part 63, Subparts EEEE and H. \n\n\n\n3.6    Management of Change [?68.75]\n\nThe plant maintains written procedures to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel and other employees whose jobs are affected by a modification are informed of the change"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000096086,
      "SummaryText": "s and offered training to deal with the modification.\n\n\n\n3.7    Pre-Startup Safety Review [?68.77]\n\nThe plant has written procedures that address the startup of new or modified processes.  The reviews are conducted to ensure that construction, equipment, procedures, and personnel are appropriately prepared for startup before operation begins.\n\n\n\n3.8    Compliance Audits [?68.79]\n\nCargill conducts corporate supported audits of the accident prevention program to determine compliance with the procedures and practices developed.  Audits are conducted at least once every three years.  Any findings are forwarded to on site management to initiate corrective actions which are tracked until completed.    \n\n\n\n3.9    Incident Investigation [?68.81]\n\nCargill Hammond investigates any incident that results in, or has the potential for, a significant release of a regulated substance.  The investigations are conducted to identify the cause leading to the incident as well as any corrective actions and preventive actions.  Incident reports are maintained for a minimum of five years.  \n\n\n\n3.10    Employee Participation [?68.83]\n\nCargill encourages employees to participate in all aspects of process safety management and accident prevention.  Employees are encouraged to provide input on accident prevention and facility improvements.\n\n\n\n3.11    Safe Work Practices [?68.85]\n\nCargill Hammond utilizes safe work practice procedures to protect personnel and process equipment.  Procedures include confined space entry, hot work, and lockout/tagout, among others.  Permits are required for any hot work conducted near regulated substances.\n\n\n\n3.12    Contractors [?68.87]\n\nCargill Hammond uses contractors to conduct specialized maintenance and construction activities, and to supplement the workforce during peak maintenance periods.  A safety performance evaluation is conducted prior to selecting contractors.  Contractors are required to complete Cargill Hammond's safety training and are informed of any potential hazard"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000096086,
      "SummaryText": "s in their work areas prior to beginning work on site.  Contractors are also instructed to report all incidents to their Cargill contact and actions to take during an emergency such as evacuation assembly, etc."
    }
  ]
}