{
  "FacilityID": 1000030556,
  "FacilityName": "Americold-Darien",
  "FacilityStr1": "W8876 County Highway X",
  "FacilityStr2": null,
  "FacilityCity": "Darien",
  "FacilityState": "WI",
  "FacilityZipCode": "53114",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55127",
  "LEPC": "Walworth LEPC",
  "FacilityLatDecDegs": "42.591111",
  "FacilityLongDecDegs": "-088.732500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Americold Logistics Services",
  "Company2Name": "Americold Realty Trust",
  "CompanyDUNS": 85149378,
  "Company2DUNS": 0,
  "OperatorName": "Americold Logistics Services",
  "OperatorStr1": "W8766 County Highway X",
  "OperatorStr2": null,
  "OperatorCity": "Darien",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53114",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Elliott",
  "RMPTitle": "Regional Compliance Manager",
  "FTE": 192,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184276",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-07-03 00:00:00",
  "SafetyInspectionBy": "Wisconsin Department of Safety",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-12-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-09-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-09-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-09-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.59111,
  "FRS_Long": -88.72861,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000037224,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000030556,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000037586,
          "ProcessID": 1000037224,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044868,
          "ProcessID": 1000037224,
          "ChemicalID": 56,
          "Quantity": 41000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544868,
          "ProcessID": 1000037224,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030556,
      "SummaryText": "EXECUTIVE SUMMARY OF THE EPA RISK MANAGEMENT PLAN\n\n\n\nAmericold-Darien is a refrigerated warehousing and food distribution facility. The majority of products stored are foods for human consumption and inherently pose no known environmental or safety risks.  The refrigeration process utilizes pure grade anhydrous ammonia, a regulated substance above the RMP planning quantity.  Ammonia is commonly used in industrial refrigeration systems to maintain low temperatures for storage.  Inherent properties of anhydrous ammonia make it the refrigerant of choice and widely accepted as being among the most efficient as well as being environmentally friendly, it can be safely managed by trained operators.  The ammonia refrigeration process functions within a closed piping network serving the facility cold storage operations.  Newly completed ammonia calculation identifies a reduced ammonia inventory in this facility. Previously reported quantity of 65,000 has been reduced to approximately 41,000  pounds of ammonia inventory for this process.\n\nUpgrades to the Darien ammonia system recently includes piping changes, installation of new refrigeration compressors, removal of out dated refrigeration compressors, installation of a new ammonia recirculator vessel, an addition of a new evaporative condensr, upgraded ammonia detection system, and the safety relief vent system.\n\n\n\nAmericold Management has implemented the requirements of the Risk Management Plan at this location in order to operate this facility in accordance with regulations and support of best industry standards.  The ultimate objective is to minimize the risk of an accidental ammonia release.  The facility safety management has developed an Employee Emergency Action and Fire Prevention Plan along with emergency procedures and training to protect the employees, the public and the environment.  These safety fundamentals are based on, International Institute of Ammonia Refrigeration,  Ammonia Safety and Training Institute, t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030556,
      "SummaryText": "he International Association of Fire Chiefs, and International Association of Refrigerated Warehouse guidance.   Americold employees responsible for managing the ammonia refrigeration process are provided first responder training by specialists that are authorized to provide hazmat training.  Americold management believes it is important that employees participate in emergency response planning with local responders in order to be adequately trained in handling emergency situations with anhydrous ammonia systems.  This specialized HAZMAT training follows the guidelines of federal, state and local regulatory agencies.  In event any offensive response activity is required, trained Americold employees will assist if in a coordinated response under the authority of the local emergency management response unit.\n\nThe first responder training includes facility managers, refrigeration employees, and local emergency responders in order to protect life safety and the environment while providing a safe workplace.  Preventing accidental ammonia releases at Americold by following process safety management practices is an important part of daily operations.  PSM is the method to manage the ammonia refrigeration system properly.  This creates a safety culture to ensure the facility complies with OSHA, EPA, state, and local requirements, as well as its own internal standards.\n\n                                                                                                                                                                                       \n\nAmericold is committed to safe management and operation of the Ammonia Refrigeration System.  Maintenance employees are trained to observe operational procedures designed to be as fail-safe as possible to prevent accidental release of ammonia at any time.  Should any accidental release occur, all refrigeration employees are required to observe safe emergency response procedures.  They are trained to work in conjunction with the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000030556,
      "SummaryText": " local Emergency Planning Commission to minimize the impact of any accidental releases.\n\n\n\nAs part of Americolds safety programs, the OSHA Process Safety Management Plan is an integral part of our base safety manual.  The program covers the entire scope of safe work practices that are required for the operation of the ammonia refrigeration system.  \n\nNormal operations rely on the following:                                                              \n\nO The Mechanical Integrity portion of the PSM program is used to perform preventative\n\n maintenance and predictive maintenance work.  This\n\n helps to ensure that the closed ammonia system continues to work safely,\n\n reliably and efficiently in the originally intended manner.\n\n \n\nO Any set specifications of systems temperature, pressure, level or power \n\n interruption, that are exceeded or violated will normally trigger an alarm and\n\n safety shutdown.  Maintenance technicians are notified of a deviation from\n\n normal operational specifications through indicator or alarm systems.\n\n \n\nO In the event of deviations, technicians are trained to analyze the situation,\n\n follow personal safety procedures at all times, determine that everything\n\n is under control and correct problems and/or deviations.\n\n \n\nO If a problem cannot be corrected immediately, the equipment needing\n\n repair service will be safely locked out of service until such time as\n\n repairs have been completed.\n\n  \n\nO If a problem cannot be safely handled by the Maintenance Personnel, procedures are in place to obtain the required resources of qualified contractors to correct the situation.\n\n \n\nDuring the past five years there were no accidental releases to report at this facility that exceeded the reportable quantity of 100 pounds or any that affected off site receptors.  \n\n \n\n \n\n EMERGENCY READINESS INCLUDES THE THE FOLLOWNG PROGRAMS:\n\n \n\nO Written procedures for managing emergency incidents include emergency evacuation\n\n procedures, emergency shutdown instruc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000030556,
      "SummaryText": "tions, emergency response training, coordination with the LEPC, regulatory agency\n\n notification and other pertinent information.\n\n \n\n \n\nO The Emergency Response Hazmat Training for refrigeration employees  that are familiar with system and potential hazards in this facility helps to establish an effective and informed mutual emergency response team to assist local emergency responders.\n\n\n\nIt is the intent of Americold to not only meet the EPA/RMP regulatory requirements and prevention program, but also to take a pro-active approach into implementing these requirements as part of a working safety plan.                         \n\nAmericold is in a constant review process of its operations to meet industry standards to provide a safe working environment for our employees, tenants, customers and neighbors."
    }
  ]
}