{
  "FacilityID": 1000093529,
  "FacilityName": "Ingredion Incorporated Richland Plant",
  "FacilityStr1": "216 University Drive",
  "FacilityStr2": null,
  "FacilityCity": "Richland",
  "FacilityState": "WA",
  "FacilityZipCode": "99354",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.335435",
  "FacilityLongDecDegs": "-119.268217",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "LW",
  "FacilityURL": "www.ingredion.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Ingredion Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 831797738,
  "Company2DUNS": null,
  "OperatorName": "Ingredion Incorporated",
  "OperatorStr1": "216 University Drive",
  "OperatorStr2": null,
  "OperatorCity": "Richland",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "99354",
  "OperatorZipCodeExt": null,
  "FTE": 34,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000214298",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-01-15 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-05-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-05-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-05-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 46.33721,
  "FRS_Long": -119.265338,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116106,
      "AltID": "Storage",
      "FacilityID": 1000093529,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145135,
          "ProcessID": 1000116106,
          "ChemicalID": 70,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000117498,
          "ProcessID": 1000116106,
          "NAICSCode": "311221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000099341,
              "Process_NAICS_ID": 1000117498,
              "SafetyReviewDate": "2020-11-03 00:00:00",
              "PHA_Date": "2020-11-03 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Inspections",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Porcedures",
              "OpProceduresReviewDate": "2021-04-27 00:00:00",
              "TrainingReviewDate": "2021-04-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-04-27 00:00:00",
              "EquipmentInspectionDate": "2021-04-02 00:00:00",
              "EquipmentTested": "Storage building",
              "ChangeMgmtDate": "2020-03-24 00:00:00",
              "ChangeMgmtReviewDate": "2020-06-15 00:00:00",
              "PreStartupReviewDate": "2020-07-14 00:00:00",
              "ComplianceAuditDate": "2020-07-21 00:00:00",
              "AuditCompletionDate": "2021-08-30 00:00:00",
              "IncidentInvestigationDate": "2019-08-18 00:00:00",
              "InvestigationChangeDate": "2019-08-28 00:00:00",
              "ParticipationPlansReviewDate": "2021-04-27 00:00:00",
              "HotWorkPermitReviewDate": "2021-04-27 00:00:00",
              "ContractorSafetyReviewDate": "2021-04-27 00:00:00",
              "ContractorSafetyEvalDate": "2021-04-27 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000124508,
                  "PreventionProgram3ID": 1000099341,
                  "ProcessChemicalID": 1000145135
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000093529,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": "2020-07-17 00:00:00",
    "ERTrainingDate": "2021-04-01 00:00:00",
    "CoordinatingAgencyName": "Benton County Emergency Management",
    "CoordinatingAgencyPhone": "5096280333",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093529,
      "SummaryText": "ced resources available in the execution of its process safety and accident prevention programs.  To accomplish this, Ingredion encourages (and at times requires) contractors and employees at all levels of the organization to participate in these programs.  Operating unit personnel participate in hazard studies, incident investigations, periodic audits, and management of change reviews.  Teams with management, operator and contractor participation are responsible for the development of related programs and procedures.  Written policies reinforce the importance of employee participation and ensure process-related information is made available to those involved.  All employees actively participate in Ingredion's safety process.\r\n\r\n2.\tProcess Safety Information/Trade Secrets\r\n\r\nRecognizing the importance of developing and maintaining technical documentation, Ingredion has established documentation standards and developed a document control system.  When new or modified processes are developed, they are designed to meet or exceed all accepted trade and design standards.  Information from chemical suppliers, engineering and trade associations, regulatory agencies, and equipment suppliers is utilized to design processes.  Materials of construction, design specifications, safe operating limits, operating and maintenance procedures, chemical safety information, and other key information are collected or developed to ensure the process operates safely.  Maintenance, operating, emergency shutdown, and an emergency action plan are developed and maintained. Ingredion ensures that its processes are maintained within their process limits by using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown and safety systems).\r\n\r\nA process safety information file index helps direct personnel to the appropriate documents.  Ingredion's access to information policy ensures process safety information is available t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093529,
      "SummaryText": "o all personnel working in or affected by the process.\r\n\r\n3.\tProcess Hazard Analysis\r\n\r\nIngredion utilizes team-based hazard analysis techniques to help ensure all potential hazards are identified and multiple levels of protection are in place to prevent an incident.  Teams with engineers, operators, mechanics and safety professionals evaluate each component and procedure of each process.  If new processes are developed, hazard evaluations are conducted at each phase of the design and construction.  Multiple hazard evaluation techniques including hazop, what-if reviews and checklists are utilized.    \r\n\r\nTrained study leaders and written hazard study protocol ensure each study is effective.  Every change to a process is similarly evaluated, and each process is comprehensively re-evaluated at least every five years. Ingredion has established a system to ensure timely response to findings and recommendations.  The system helps ensure: recommendations are documented, actions prioritized, and responsibilities assigned; a written schedule for completing action is developed; action is taken and documented; and action is communicated to affected personnel. \r\n\r\n4.\tManagement of Change\r\n\r\nTo help ensure proposed changes to processes are properly evaluated before they are implemented, Ingredion has developed an effective management of change program.  All proposed changes are carefully evaluated by engineers, operators, safety professionals, and/or site management to ensure a change does not introduce an unforeseen hazard.  Changes to process equipment, chemicals, technology (including process-operating conditions), procedures, and other process changes are subject to the management of change review.  When changes are implemented, operating and maintenance procedures are updated, employees and mechanics are trained, documentation is updated, and spare parts systems are updated.  To ensure this occurs and the installation is completed as designed, a pre-startup safety review i"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000093529,
      "SummaryText": "uments its findings, develops recommendations to prevent a recurrence, prioritizes recommendations, and assigns responsibilities.  The incident report includes a section for corrective action tracking to ensure corrective actions are completed on a timely basis and appropriate documentation is maintained.  Incidents/near misses and corrective actions are shared with all affected personnel to help minimize the potential for recurrence.  The well-managed incident investigation process serves as a valuable input for the periodic hazard analyses.\r\n\r\n12.\tCompliance Audits\r\n\r\nTo help ensure the process safety and accident prevention program is functioning properly, Ingredion periodically conducts comprehensive audits.  The audits use USEPA's Guidance for Auditing RMPs/Programs under Clean Air Act Section 112(r) (USEPA 550-B99-008). Annex C to audit the non-prevention program elements. Compliance with the prevention program elements are assessed through completion of the PSM audit checklist prepared according to OSHA CPL 2-2.45A; an audit checklist prepared according to USEPA 550-B99-009; and a detailed audit report outlining the PSM and RMP compliance needs of the facility.\r\nTo ensure the audits accurately reflect the program effectiveness, employee interviews, written documentation reviews, and process observations are included. The audit team documents its findings, develops recommendations for improving the program, prioritizes recommendations, and assigns responsibilities.  An action item database is maintained to ensure corrective actions are completed on a timely basis and appropriate documentation is maintained.  Corrective action taken in response to the audit team's recommendations is documented and the two most recent audit reports are retained.\r\n\r\nChemical-specific Prevention Steps\r\n\r\nThe RMP covered process at Ingredion has hazards that must be managed to ensure continued safe operation.  The prevention program summarized previously applies to the Program 3 EP"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000093529,
      "SummaryText": "on requirements.  In addition, Ingredion has procedures that address maintenance, inspection, and testing of emergency equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency duties including evacuation.  Ingredion workers will respond to minor events that do not have the potential for significant effects (e.g., small fires or small leaks).  In the event of a larger fire or release, workers evacuate the area and contact the Richland Fire Department.\r\n\r\nIngredion's emergency action plan is updated when necessary based on modifications made to plant processes.  The emergency action plan is managed using ISO-compliant practices to ensure that all changes to the program are readily available and properly updated.\r\n\r\nThe overall emergency action plan for Ingredion is coordinated with the Richland Fire Department and the Benton County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings with the committee, which includes local emergency response officials, local government officials, and industry representatives.  Ingredion has been an active member of the committee.  Ingredion has around-the-clock communications capability with appropriate emergency response organizations (e.g., fire department) and LEPC officials.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, Ingredion conducts periodic emergency drills for all facility personnel and has worked with both the LEPC and emergency response organizations on county-wide chemical emergency response training.  Ingredion involves local responders in refresher training on the hazards of regulated substances in the facility. \r\n\r\nPlanned Changes to Improve Safety\r\n\r\nIngredion constantly strives to improve its safety performance and minimize pote"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000093529,
      "SummaryText": "ntial impact on the environment.  Routine audits and inspections, an effective incident investigation procedure, routine PHA's, employee participation, and community involvement all provide input on improvement opportunities.  At this time, no additional improvement opportunities have been identified."
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000093529,
      "SummaryText": "A RMP-covered process at Ingredion.  This prevention programs helps prevent potential accident scenarios that could be caused by equipment failures or human errors.  \r\n\r\nIn addition to the accident prevention program activities, Ingredion has installed safety features on many process units to quickly help detect a release, contain/control a release, and reduce the consequences of (mitigate) a release.  The safety features listed below are in use in various processes:\r\n\r\nRelease Containment and Control\r\n\r\nOverpack drums for all drums of POCl3\r\nContainment in storage building\r\nStorage building specifically designed for POCl3\r\n\r\nRelease mitigation\r\n\r\nTrained personnel supplemented by local fire department\r\nPersonal protective equipment\r\nSpill control materials\r\n\r\nFive-Year Accident History\r\n\r\nIngredion has an excellent safety record.  All incidents, including those with the potential to cause any injury or damage, are investigated.  The RMP Program regulations require the reporting of accident histories involving regulated substances that result in deaths, injuries, or significant property damage on-site or known deaths, injuries, evacuations, shelter-in-place, property damage, or environmental damage off-site.  There have been no accidents involving POCl3 that have resulted in injury or property damage on-site or off-site in the last ten years at this facility. \r\n\r\nEmergency Response Program\r\n\r\nIngredion maintains a written emergency action plan, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures to notify the Richland fire department to respond to a release of any hazardous substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  These procedures address evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontaminati"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093529,
      "SummaryText": "s conducted.\r\n\r\n5.\tOperating Procedures\r\n\r\nIngredion maintains detailed written procedures that address various modes of process operations, including unit startup, normal operations, temporary operations, emergency shutdown, normal shutdown, and initial startup of a new process.  These procedures are used as reference by experienced operators and provide the basis for consistent training of new operators.  Procedures are periodically reviewed and annually certified as current and accurate.  When process changes are made, the management of change process ensures affected procedures are updated and operators are re-trained.  Process control equipment and software have also been programmed to require compliance with operating procedures.    \r\n\r\n6.\tTraining\r\n\r\nTo complement the written procedures, Ingredion has developed a comprehensive training program for all of its employees and contractors.  New employees are required to complete a new hire orientation prior to assignment in the facility.  After successfully completing the new hire orientation, a new operator is paired with a senior operator to learn process-specific duties and tasks.  The new operator must demonstrate (through tests and skills demonstration) adequate knowledge to perform the duties and tasks in a safe manner prior to working independently.  In addition, all operators must successfully complete periodic refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years.  \r\n\r\nPrior to working at Ingredion, contractors are required to certify that each of their employees have necessary experience, credentials, and skills to ensure that the mechanical integrity of the systems is maintained.  Contractor management must provide this certification by listing the names of the individual contract employees.  Ingredion then provides additional training to every contractor employee prior"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000093529,
      "SummaryText": "to his or her assignment within the plant.  \r\n\r\nA training management process helps keep track of training for employees and makes sure refresher training is completed as required.  \r\n\r\n7.\tContractors\r\n\r\nPrior to working at the facility, potential contractors must pre-qualify, describing their management structure, insurance coverage, training process, historical safety performance, and a wide range of other pertinent information.  If the contractor meets Ingredion's stringent requirements, each contractor employee must complete Ingredion's contractor safety training.  This training includes a process overview, information about safety and health hazards, emergency action plan requirements, and safe work practices.  Ingredion periodically audits each contractor's safety performance and their overall safety process.  \r\n\r\n8.\tPre-startup Safety Review (PSSR)\r\n\r\nIngredion conducts a Pre-startup Safety Review (PSSR) for any new process or significant process modification.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all support systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n\r\n9.\tMechanical Integrity\r\n\r\nIngredion has well-established practices and procedures to maintain process equipment in a safe operating condition.  Written maintenance procedures have been established for key equipment to help ensure that the work is performed in a consistent manner and provide a basis for training.  Maintenance personnel and contractors working on the equipment are trained in t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000093529,
      "SummaryText": "he applicable maintenance procedures, the process itself, potential safety and health issues, emergency action plan requirements, and the site's safe work practices.   \r\n\r\nPreventive maintenance and testing is performed at recommended intervals.  Only trained and qualified mechanics or contractors perform maintenance on PSM processes.\r\n\r\nQuality assurance procedures have been established to ensure only specified repair parts are ordered and installed on the processes.  Plant design standards (meeting or exceeding recommended industry practices), tight purchasing specifications, and incoming material inspections ensure the correct part is ordered and received.  A parts identification system helps ensure the proper parts are issued to a job. Documented maintenance procedures and contractor/mechanic training ensure the part is properly installed.\r\n\r\n\r\n10.\tSafe Work Practices\r\n\r\nIngredion has effective safe work practices in place to help ensure worker and process safety.  Ingredion's Energy Isolation and Line Breaking procedures ensure process equipment is safe prior to performing repairs.  Confined Space Entry and Hot Work Programs require careful review prior to issuance of permits; allowing the safe performance of these activities.  Ingredion works with local emergency response agencies to ensure they are familiar with its safe work practices and to ensure that a well-trained emergency response team is readily available.  These procedures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.  \r\n\r\n11.\tIncident Investigation\r\n\r\nIngredion promptly investigates all incidents and near misses at its facility.  A team-based approach is utilized to ensure an in-depth, unbiased investigation is conducted.  The goal of each investigation is to determine the facts, identify the root causes, and develop corrective actions to prevent a recurrence of a similar incident.  The investigation team doc"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093529,
      "SummaryText": "Executive Summary\r\n\r\nIngredion Incorporated Richland Plant (Ingredion) is committed to operating its business in a manner that is safe for its workers, the public, and the environment.  As part of this commitment, Ingredion has established a comprehensive safety, health, and environmental management process to help ensure safe operation of the processes at this facility.  One part of this process is a Risk Management Program (RMP) that helps manage the risks at Ingredion and that complies with the requirements of the Environmental Protection Agency's (EPA's) regulation 40CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule).  One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at Ingredion.  This document is intended to satisfy the RMP Plan requirements of the RMP rule and to provide the public with a description of the program.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nIngredion is committed to the safety of its workers and the public, the preservation of the environment, and the prevention of accidental releases of hazardous substances.  Ingredion has made significant investments in process equipment, safety systems, and personnel to ensure the safety of its operations, minimize the impact of its operations on the environment, and prevent releases from occurring.  This commitment is clearly stated in Ingredion's Environmental, Health, & Safety Policy, and reinforced as a critical element in employee performance appraisals and the profit sharing plan.  A well-qualified Environmental, Health, & Safety (EHS) staff, a highly competent in-house engineering group, and a committed senior management team ensure process safety is given the highest priority.\r\n\r\nIngredion is also well prepared to respond to and contain a release if one should occur.  Ingredion has the immediate emergency response resources of the Richland fire departmen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093529,
      "SummaryText": "t, with additional resources on-call.  Regular interface with the Local Emergency Planning Committee (LEPC), fire department, and other response agencies ensures a large team of experts is ready to respond should they be needed.  Familiarity with Ingredion's processes and chemicals, established emergency action plan, and extensive training ensure local emergency agencies can provide the community appropriate support if needed.\r\n\r\nChemical Processes and Regulated Substances\r\n\r\nIngredion's primary business is the manufacture of specialty carbohydrate based products for food ingredients and the paper industry.  Ingredion is headquartered in Westchester, Il.   Ingredion's Richland facility has been in this location for over 20 years and is considered today to be an innovative leader in carbohydrate technology.\r\n\r\nIn the manufacture of its specialty products, Ingredion uses phosphorus oxychloride (POCl3), a chemical listed by the RMP rule as a regulated substance which is stored on site above the EPA threshold quantities.\r\n\r\nPOCl3 is stored for use in the starch modification process.  In this process a small quantity of POCl3 is reacted with starch to structurally modify or alter the basic natural starch polymer.  The resulting modified starch is used in specialty food ingredient starches.\r\n\r\nAccidental Release Prevention Program and Chemical-specific Prevention Steps\r\n\r\nThe following is a summary of the accident prevention program in place at the Penford facility in Richland, Washington.  Because processes at Penford that are regulated by the EPA RMP regulation are also subject to the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) standard, this summary and the subsequent section on emergency response address each of the OSHA PSM elements and describe the management system in place to implement the accidental prevention program.\r\n\r\n1.\tEmployee Participation\r\n\r\nIt is Ingredion's policy to utilize the most knowledgeable and experien"
    }
  ]
}