{
  "FacilityID": 1000084924,
  "FacilityName": "Sioux-Preme Packing Company",
  "FacilityStr1": "4241 US 75 Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sioux Center",
  "FacilityState": "IA",
  "FacilityZipCode": "51250",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19167",
  "LEPC": "Sioux County LEPC",
  "FacilityLatDecDegs": "43.035500",
  "FacilityLongDecDegs": "-096.177200",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.siouxpreme.com",
  "FacilityEmailAddress": "sxpreme@siouxpreme.com",
  "FacilityDUNS": 48732242,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sioux-Preme Packing Company",
  "OperatorStr1": "4241 US 75 Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Sioux Center",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51250",
  "OperatorZipCodeExt": null,
  "FTE": 220,
  "OtherEPAFacilityID": "IAD984594259",
  "EPAFacilityID": "100000195488",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-02-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-02-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-02-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-02-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000106114,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000084924,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132874,
          "ProcessID": 1000106114,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000107385,
          "ProcessID": 1000106114,
          "NAICSCode": "311611",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000089977,
              "Process_NAICS_ID": 1000107385,
              "SafetyReviewDate": "2019-03-22 00:00:00",
              "PHA_Date": "2019-03-22 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-12-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Exhaust system tied into ammonia monitors in the compressor room.",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Ammonia monitors in the engine room.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-04-09 00:00:00",
              "TrainingReviewDate": "2020-01-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-04-09 00:00:00",
              "EquipmentInspectionDate": "2020-01-14 00:00:00",
              "EquipmentTested": "Compressor Mechanical Integrity",
              "ChangeMgmtDate": "2020-01-08 00:00:00",
              "ChangeMgmtReviewDate": "2020-01-01 00:00:00",
              "PreStartupReviewDate": "2020-01-14 00:00:00",
              "ComplianceAuditDate": "2019-03-19 00:00:00",
              "AuditCompletionDate": "2020-12-31 00:00:00",
              "IncidentInvestigationDate": "2020-01-13 00:00:00",
              "InvestigationChangeDate": "2020-01-13 00:00:00",
              "ParticipationPlansReviewDate": "2020-01-01 00:00:00",
              "HotWorkPermitReviewDate": "2020-01-01 00:00:00",
              "ContractorSafetyReviewDate": "2020-01-01 00:00:00",
              "ContractorSafetyEvalDate": "2020-01-15 00:00:00",
              "CBI_Flag": 0,
              "Description": "\n\nMANAGEMENT SYSTEM\n\n\n\nThis element addresses the management system that Perdue Premium Meat Company, Inc. has adopted to implement the Risk Management Program (RMP).  The management system serves to integrate process safety concepts into the ongoing activities of everyone involved in the program implementation.\n\n\n\nPURPOSE AND SCOPE  \n\n\n\nThe purpose of this element is to establish the requirements for a simplified management system to meet OSHA requirements through continuous improvement and organizational learning.\n\n\n\nThe management system element of EPA Accidental Release Program Regulation Section 112(r) of the Clean Air Act requires assignment of a management system to oversee the implementation of all risk management program elements.  The management system helps to assure that the program elements are in place, in use, and effective.\n\n\n\nThe program regulations require the facility to assign a qualified person or position that has overall responsibility for the development, implementation, and integration of the risk management program elements.  When responsibility for the individual requirements of this part is delegated, the names or positions of the delegates must be documented, and the lines of authority defined through an organizational chart or similar document.\n\n\n\nThis facility has established a management system to ensure that all elements of the program are implemented as required.  The commitment to risk management and process safety requires that all elements of the program are integrated and implemented on an on-going basis and that all groups within the facility understand the lines of responsibility and communication.\n\n\n\nThis Program also includes procedures for managing implementation of the Program and for tracking recommendations resulting from Program activities such as compliance audits and process hazard analyses.\n\n\n\nREFERENCES \n\n\n\n40 CFR Part 68, Accidental Release Prevention Requirements: Risk Management Programs Under Clean Air Act Section 112(r)(7), subpart (D), Management (68.15).\n\n\n\nPROCEDURES FOR MANAGEMENT COMMITMENT\n\n\n\nThe Risk Management Program planning phase begins with management commitment. Without management commitment, RMP plans rarely, if ever, achieve their intended objectives.   Managers need to know what they are committing the company to and the reasons for this commitment.  The key to establishing management commitment is ensuring that management has the information and data they need to make informed decisions, direct the company, and meet the company's overall goals and objectives.\n\n\n\nRequired Action Steps\n\n\n\nStep 1: Provide training to management on the RMP/PSM regulatory requirements and the current safety and risk management programs in place at Perdue Premium Meat Company, Inc.  Maintain training levels as required for management turnover and periodic refresher training.\n\n\n\nStep 2: In order to demonstrate management commitment, the RMP Policy Statement has been posted. This policy statement will be updated as required.\n\n\n\nStep 3: Include the management and the facility team representatives on an ongoing basis to outline the Risk Management Program needs and requirements.  Define what must be done and how requirements are to be accomplished.\n\n\n\nStep 4: Assign the responsibility for the design, development, implementation, and control of the RMP at Perdue Premium Meat Company, Inc.  Re-assign responsibility as needs change.\n\n\n\nImplementation of the Plan\n\n\n\nActivities that are involved in implementing the Plan include:\n\n\n\n? Training management on the policies established by Perdue Premium Meat Company, Inc within the Plan;\n\n? Assessing systems and practices;\n\n? Analyzing formal and informal practices, process flows, available resources and responsibilities;\n\n? Evaluating the RMP management system;\n\n? Developing and/or modifying existing program documentation;\n\n? Reviewing and commenting on the draft RMP Plan;\n\n? Finalizing the RMP Plan;\n\n? Training employees; and,\n\n? Scheduling and implementing each program element.\n\n\n\nThis facility has passed the initial implementation phase and the above steps have been addressed.  However, continuing implementation of this Plan must include review of the relevant elements listed above.\n\n\n\nVerification of Compliance \n\n\n\nThe management system should serve as a formal means of communication between management and staff on the RMP and the needs and requirements of Perdue Premium Meat Company, Inc.  It is important that staff clearly understand the RMP/PSM requirements.  It is equally important that management understand the specifics of how staff plans to meet requirements and provide records to verify conformance (i.e. documentation) with the RMP and PSM regulations.\n\n\n\nActivities that are involved in verifying Compliance include:\n\n\n\n? Regular meetings with staff and management to review the implementation progress.\n\n? Annual review of documentation (a Compliance Audit example may serve as a good reference for these reviews). \n\n? Complete Compliance Audit every three years at a minimum, as required by OSHA regulations.\n\n\n\nEnsuring Compliance\n\n\n\nAfter checking the status of the Plan implementation, analyze the facility's performance for each program element.  If the desired results are not met in any one or more of the RMP/PSM elements, determine the reason(s) for not meeting the objectives specified in the Plan.\n\n\n\nOnce areas for improvement are identified through either the review or audit process:\n\n\n\n? Make changes in the Plan to better achieve the desired results.\n\n? Standardize elements that are meeting the desired results. \n\n? Ensure that employees and management are trained on the revisions.\n\n\n\nPROCEDURES FOR RECOMMENDATION TRACKING\n\n\n\nThe recommendation tracking system applies to any recommendations resulting from Process Hazard Analyses, Compliance Audit Findings, Incident Investigations, or other source requirements (e.g. employees, insurance companies, fire department inspections, or other certifying organizations).\n\n\n\nThe Program Manager leads the team review of the recommendations.  The management team will be selected by the Program Manager to include the minimum staffing of a Program Manager, one other Manager, and an operator.  The management team reviews each recommendation and decides to reject or accept the recommendation.\n\n\n\nProcedure for Implementing Recommendations\n\n\n\n1. For accepted recommendations, the Program Manager schedules the implementation with the management team and assigns a person to be responsible.  If the recommendation resulted from a Process Hazard Analysis (PHA), the risk rank of the consequence associated with the recommendation should be considered in the scheduling.  The team addresses who is the \"responsible person? for overseeing the implementation and documentation of the recommendation.\n\n\n\n2. The Program Manager authorizes the \"responsible person\" to implement the recommendation.  All system modifications (physical or procedure) must comply with the applicable requirements in this OSHA Program (e.g. Management of Change, Hot Work, Update Requirements).\n\n\n\n3. The \"responsible person\" documents the implementation, and the Program Manager oversees documentation for completeness.  Any recommendations require the Management of Change procedure. For use of the Management of Change Form to document the recommendation implementation. \n\n\n\n4. The Program Manager updates the Action Plan upon completion of each recommendation.\n\n\n\n5. The Program Manager is responsible for communicating the implication of each implemented recommendation to operators, maintenance, and other employees whose work assignments are in the process and are affected.\n\n\n\nProcedure for Rejecting Recommendations\n\n\n\nAs required by OSHA, Perdue Premium Meat Company, Inc must communicate the management team decision to reject the recommendation to the team or employee who originated the recommendation. In response, the originating team may develop subsequent recommendations to address the issue.  The management team must resolve any subsequent recommendations.\n\n\n\nDocument the management team's reason for rejecting the recommendation on the Management of Change (MOC) Form.  \n\n\n\nOSHA considers an employer to have resolved recommendations when the employer has either adopted the recommendations or justifiably declined to do so.  An employer can justifiably decline to adopt a recommendation where it can document that:\n\n\n\n? The analyses upon which the recommendations are based contain factual errors;\n\n? The recommendation is not necessary to protect the health of employees or contractors;\n\n? An alternative measure would provide a sufficient level of protection; or\n\n? The recommendation is not feasible.\n\n\n\nRESPONSIBILITY FOR IMPLEMENTATION\n\n\n\nThe Program Manager has the overall responsibility for implementation of the OSHA program at Perdue Premium Meat Company, Inc. \n\n\n\nThe Maintenance Manager has been selected as the Program Manager for the OSHA Program.  The Program Manager selects employees for involvement in the elements of the OSHA Program as needed to satisfy employee participation, including periodic meetings to review program issues.\n\n\n\nPerdue Premium Meat Company, Inc. accepts full responsibility for transferring responsibility and the status of the Program to the successor of the current Program Manager as well as for the appropriate level of training to manage this Program.\n\n\n\nDOCUMENTATION MANAGEMENT\n\n\n\nDocumentation Requirements\n\n\n\nThis OSHA Program and the associated appendices and documentation are made available for employee viewing as outlined in the Perdue Premium Meat Company, Inc. Policy Statement.  Training received by management, as well as non-management employees, will be documented using the forms and procedure outlined in (Training).  All program documentation will be controlled by the Program Manager and filed in the OSHA Program print and electronic filing systems.\n\n\n\nCorrections and changes to the management system will require an RMP update as outlined under the Update Requirements.\n\n\n\nDocumentation Locations\n\n\n\nThis OSHA Program manual and associated program appendices and documentation are located in the Program Manager?s office.  The Program is subject to review by the state and federal OSHA, the state and federal EPA, and other organizations with jurisdiction and oversight for this Program. \n\n \n\nDocumentation Archiving\n\n\n\nThe original documents are kept for 5 years, at a minimum, with the exception of Process Hazard Analysis (PHA) and Mechanical Integrity Program documentation, which is kept for the life of the process, and the Compliance Audits, the last two of which are kept on file.\n\n\n\nArchived documents are kept in the Program Manager?s office.  If another location is selected for archiving documents, the location will be determined and managed by the Program Manager.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000112056,
                  "PreventionProgram3ID": 1000089977,
                  "ProcessChemicalID": 1000132874
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000084924,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-06-06 00:00:00",
    "ERTrainingDate": "2020-01-31 00:00:00",
    "CoordinatingAgencyName": "Sioux Center Fire Department",
    "CoordinatingAgencyPhone": "7127223931",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084924,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe Perdue Premium Meat Company, Inc. refrigeration systems use anhydrous ammonia (a commonly used refrigerant for industrial systems) as the refrigerant.  Given the quantity handled, anhydrous ammonia is considered a hazardous substance by EPA. \n\n \n\nMany of the properties that make ammonia valuable as a refrigerant also requires that precautions and procedures be in place to protect employee and public health and safety during a chemical emergency.  It is the policy of Perdue Premium Meat Company, Inc. to be in compliance with all applicable federal and state rules and regulations.\n\n\n\nSafety at our facility is inherent on the manner in which anhydrous ammonia is handled.  While the design of the facility incorporates many safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.\n\n\n\nWe have a written Process Safety Management (PSM) plan that complies with the regulations stipulated by 29 CFR 1910.119.  A crucial component of this plan is the Emergency Response Plan, developed in compliance with the Emergency Response provisions of 29 CFR 1910.120(q).  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties. This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.\n\n\n\nFacility Description and Substances Handled\n\n\n\nThe Perdue Premium Meat Company, Inc. stores and distributes refrigerated and non-refrigerated foods and other items. Storage requires the use of a refrigeration system to preserve the integrity of the food items.  This refrigeration process uses ammonia as a refrigerant.  Access to the facility is restricted to authorized employees, management personnel, and contractors.\n\n\n\nThe regulated substance handled at this facility is anhydrous ammonia.\n\n\n\nThe ammonia refrigeration system maximum"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084924,
      "SummaryText": " inventory is 39,178 pounds of anhydrous ammonia.  There is no standby make-up inventory kept on-site.\n\n\n\nThe worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\n\n\nRelease scenarios were modeled using RMP*Comp (Version 1.07), a software program developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA.  Offsite receptors were defined using the LandView 5 (Version 1.0) system.  This system estimates residential population within the circle defined by the endpoint of the worst-case and alternative release scenarios. In addition, it lists whether certain types of public receptors and environmental receptors are within the circles.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nPerdue Premium Meat Company, Inc. complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations. The design and construction of this facility is in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.\n\n\n\nPerdue Premium Meat Company, Inc. written PSM plan incorporates many policies and procedures to ensure safe operation and maintenance of this facility.  Plan elements essential to safe operation of the refrigeration system include employee participation, process safety information, process hazard analysis, operating procedures, training, contractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits, incident investigation, emergency response and planning, and compliance audits. \n\n \n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures, and safety considerations.  Only qualified maintenance personnel operate and interact with the refrigeration system.  Thi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084924,
      "SummaryText": "s minimizes the chances of inadvertent error in operation that could lead to a release of ammonia.  Startup, shutdown, and any onstream adjustments are handled by these qualified persons.\n\n\n\nFive-Year Accident History\n\n\n\nThere have been no reportable accidents in the last five years.\n\n\n\nEmergency Response Program\n\n\n\nPerdue Premium Meat Company, Inc. has a written Emergency Response Plan to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  It complies with the provisions of OSHA Emergency Response regulations, 29 CFR 1910.120(q).  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events. This plan has been reviewed with the Sioux Center / Le Mars Fire and Rescue Department.\n\n\n\nThe approach in the development of this plan has been to identify the ammonia emergencies most likely to occur at Perdue Premium Meat Company, Inc. and establish precautions and procedures to protect life safety and health during an emergency.  The refrigeration process has back-up prevention systems to keep processing malfunctions from becoming ammonia release emergencies.  \n\n\n\nIf an emergency does occur, the following response personnel, facilities, and equipment are in place:\n\n\n\n? Emergency Alarm and Communication System\n\n? Evacuation Plans and Assembly Points\n\n? Personal Protective Equipment\n\n\n\nThe role and procedures for obtaining external emergency assistance have been formally established with the Sioux Center / Le Mars Fire and Rescue Department. \n\n\n\nAll Perdue Premium Meat Company, Inc. personnel will be trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify plan elements requiring improvement.\n\n\n\nThis plan will be reviewed annuall"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084924,
      "SummaryText": "y and updated as necessary by the Premium Meat Company, Inc. Facility Maintenance Manager.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nAny upgrades or extensive maintenance work performed in the future will be in compliance with codes and standards applicable at that time.\n\n\n\nAll Perdue Premium Meat Company, Inc. personnel are trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify elements requiring improvement.\n\n\n\nHigh priority items identified in the Process Hazard Analysis (PHA) and Priority List of Recommendations are scheduled to be completed by July 2020.  Lower priority items are scheduled for completion by May 2020.  \n\n\n\n"
    }
  ]
}