{
  "FacilityID": 1000063022,
  "FacilityName": "Fehrer Automotive - Gadsden",
  "FacilityStr1": "4330 Brooke Ave",
  "FacilityStr2": null,
  "FacilityCity": "Gadsden",
  "FacilityState": "AL",
  "FacilityZipCode": "35904",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01055",
  "LEPC": "Gadsden/Etowah County LEPC",
  "FacilityLatDecDegs": "33.996881",
  "FacilityLongDecDegs": "-86.075687",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fehrer.com",
  "FacilityEmailAddress": "info@fehrer.com",
  "FacilityDUNS": 833239234,
  "ParentCompanyName": "Fehrer Automotive North America LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Fehrer Automotive North America LLC",
  "OperatorStr1": "1825 E. Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Duncan",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29334",
  "OperatorZipCodeExt": null,
  "FTE": 375,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000235373",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-12-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-04-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 33.996581,
  "FRS_Long": -86.077615,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079099,
      "AltID": "Toluene Diisocyanate TDI",
      "FacilityID": 1000063022,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098525,
          "ProcessID": 1000079099,
          "ChemicalID": 44,
          "Quantity": 350000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000080341,
          "ProcessID": 1000079099,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000049589,
              "Process_NAICS_ID": 1000080341,
              "SafetyReviewDate": "2017-04-03 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2017-03-31 00:00:00",
              "ChangeCompletionDate": "2017-04-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-04-14 00:00:00",
              "TrainingReviewDate": "2017-04-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-04-14 00:00:00",
              "EquipmentInspectionDate": "2017-04-21 00:00:00",
              "EquipmentTested": "TDI Tank Farm",
              "ComplianceAuditDate": "2017-02-01 00:00:00",
              "AuditCompletionDate": "2017-04-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2017-04-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000050335,
                  "PreventionProgram2ID": 1000049589,
                  "ProcessChemicalID": 1000098525
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000063022,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-04-07 00:00:00",
    "ERTrainingDate": "2017-04-09 00:00:00",
    "CoordinatingAgencyName": "Gadsden Fire Department",
    "CoordinatingAgencyPhone": "2565494566",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000063022,
      "SummaryText": "Temporary Operations\r\n        4)\t     Emergency Shutdown and Operations\r\n        5)\t     Normal Shutdown\r\n        6)\t     Start-up following a shutdown or major change\r\n        7)\t     Consequences of deviation and steps to avoid deviation\r\n        8)\t     Equipment Inspections\r\n        9)\t     Product receipt and handling\r\n        10)\t     Disposal of off spec product and waste\r\nh.\tTraining and Competency Standard\r\ni.\tContractor Safety\r\nj.\tMaintenance and Inspection Standard\r\nk.\tIncident Investigation Standard\r\nl.\tEHS Audit Standard\r\nm.\tEmergency Response Plan\r\nn.\tHazard Communication Standard\r\no.\tControl of Hazardous Energy Standard\r\np.\tConfined Space Entry Standard\r\nq.\tHot Work Standard\r\nr.\tRespiratory Protection Standard\r\ns.\tNoise and Hearing Conservation Standard\r\nt.\tManagement of Change Standard\r\nu.\tFire Protection Standard"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000063022,
      "SummaryText": "rnate worst-case release scenario as a total release of one storage tank with an approximate weight of 70,000 pounds of TDI to a secondary containment area encompassing the interior tank farm.  Using an EPA approved model, Phast Risk, the results of the offsite consequence analysis estimated the distance to the toxic endpoint value to be 246 feet or roughly 0.05 mile.  This toxic endpoint does not extend beyond the property line.   \r\n\r\n4.0  Five Year Accident History\r\n \r\nFehrer has not, within the last five years, had any release of TDI at its Gadsden manufacturing facility.  \r\n\r\n5.0  EHS Management System\r\n\r\nFehrer Automotive has developed and implemented a EHS (Environment, Health and Safety) Management System that ensures all reasonable steps are taken to ensure the safety of its employees and environment.  Every employee responsible for handling TDI is trained in accordance with Occupational Safety and Health Administration (OSHA) regulations, specifically 29 CFR 1910.120 (Hazardous Waste Operations and Emergency Response) and the National Fire Protection Association (NFPA) Standard 472 (Professional Competence of Responders to Hazardous Materials Incidents).  The employees assigned to respond to TDI spills have received the 40-hour HAZWOPER training and the facility is equipped with adequate equipment to respond to the most likely spill scenarios. \r\nFehrer has also formally coordinated with the Gadsden Fire Department and received their commitment to respond in support of the plant's responders in the event of an emergency involving TDI.  \r\n\r\nThe EHS Management System includes the following components:\r\na.\tEHS Policy\r\nb.\tDocument Control and Management Standard\r\nc.\tRegulated Substance Inventory\r\nd.\tMaster Document Register\r\ne.\tSafety and Environmental Information Management Standard\r\nf.\tProcess Hazard Analysis Management Standard\r\ng.\tOperating Procedures and Work Instructions\r\n        1)\t     Initial Start-up\r\n        2)\t     Normal Operations\r\n        3)"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063022,
      "SummaryText": "Fehrer Automotive (Fehrer) operates the Gadsden, Alabama manufacturing facility to produce polyurethane foam seat cushions for the automotive industry. The foam is made by high pressure mixing of chemicals as they are poured into a mold that is attached by carrier to a continuously moving line which then moves the mold through a curing oven. Upon exiting the oven, the foam pads are removed from the mold, trimmed and prepared for shipment to customers.  Toluene Diisocyanate (TDI), which is regulated by EPA's Risk Management Program rule, is one of the reactants required to manufacture polyurethane foam. TDI is received at the plant by tank trailer, and is stored in 2 tanks located in the tank farm. The TDI is then transferred to the process utilizing a computer-controlled piping delivery system.  As a result of the storage and use of TDI, Fehrer must comply with the Chemical Accident Prevention rule issued by the United States Environmental Protection Agency (EPA) under the Clean Air Act and a Risk Management Plan (RMP) is required for the facility.  \r\n\r\nThe Gadsden manufacturing facility has the potential to store approximately 140,000 pounds of toluene diisocyanate (TDI) at any given time.  The TDI is stored in two separate vertical storage tanks with capacity for 7925 gallons (30 m3) each inside the main manufacturing building in a tank farm with secondary containment.   \r\n\r\n1.0  Accidental Release Prevention and Emergency Response\r\n \r\nFehrer is fully committed to compliance with all federal, state and local laws and regulations regarding the proper handling, use, storage, and emergency response preparedness to prevent accidental release of chemicals, toxic or otherwise.  Furthermore, Fehrer is committed to protecting the health and welfare of its employees, the community, as well as the environment. \r\n \r\nOur emergency response program is based on the requirements in OSHA's Hazardous Waste and Emergency Operations (HAZWOPER) regulation (29 CFR 1910.120) and both s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063022,
      "SummaryText": "tate and local regulations.   Fehrer Automotive uses all reasonable safety evaluations and training requirements to ensure the proper offloading, storage, and usage of TDI.  In case of serious release beyond the ability of the facility's emergency response team to control and remediate, it is the company's policy to immediately notify the City of Gadsden Fire Department by calling 911 and other parties in accordance with the Facility Emergency Response Plan.     \r\n\r\n2.0\tSite Information\r\nThe Fehrer Automotive facility is located at 4330 Brooke Ave., Gadsden, AL.  The physical location is 33°99'68.81 N and -86°07'56.87 W at an elevation of 603 feet above sea level.  The site is located on 18.7 acres with a primary building of 238,620 square feet and a secondary storage building with 3,150 square feet.  The Gadsden manufacturing facility has the potential to store approximately 140,000 pounds of toluene diisocyanate (TDI) at any given time.  The TDI is stored in two separate vertical storage tanks with capacity for 7925 gallons (30 m3) each inside the main manufacturing building in a tank farm with secondary containment.  \r\n\r\n2.1\tProduct Information\r\nDiisocyanates (also commonly known as isocyanates) are highly reactive and versatile chemicals with widespread commercial and consumer use. The primary two diisocyanates and their related polyisocyanates utilized by Fehrer Automotive in the US are MDI and TDI with TDI currently listed as a regulated chemical under the EPA's Risk Management Program rule. These chemicals have unique properties and functional versatility, and contain free isocyanate functional groups (-N=C=O).  When isocyanates are combined with other compounds that contain free hydroxyl functional groups (i.e. -OH) they react and begin to form polyurethane polymers.  This chemical reaction is completed when all of the initially free -N=C=O groups are bound within the polymer network. This process is commonly referred to as curing.  Products that contain"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063022,
      "SummaryText": "free -N=C=O groups are intended to react and undergo curing in the process of use.  Polyurethane products, such as foam mattresses, pillows, and seat pans, are considered completely cured products before they are sold.  Completely cured products are fully reacted and therefore are considered to be inert and non-toxic. \r\n\r\n3.0  Offsite Consequence Modeling\r\n\r\nFehrer Automotive has modeled the worst-case release scenario as a total release of one tank trailer load with an approximate weight of 45,000 pounds of TDI to a secondary containment area.  Using an EPA approved model, Phast Risk, the results of the offsite consequence analysis estimated the distance to the toxic endpoint to be 574 feet or roughly 0.1 mile.   TDI has a high boiling point and a low vapor pressure.  This will result in a neutrally buoyant plume close to the density of air.  The EPA RMP Offsite Consequence Analysis Guidance Document also indicates that TDI will have a neutrally buoyant plume.\r\n\r\nFehrer Automotive has modeled the required alternate worst-case release scenario as a total release of one storage tank with an approximate weight of 70,000 pounds of TDI to a secondary containment area encompassing the interior tank farm.  Using an EPA approved model, Phast Risk, the results of the offsite consequence analysis estimated the distance to the toxic endpoint value to be 246 feet or roughly 0.05 mile.   TDI has a high boiling point and a low vapor pressure.  This will result in a neutrally buoyant plume close to the density of air.  The EPA RMP Offsite Consequence Analysis Guidance Document also indicates that TDI will have a neutrally buoyant plume.\r\n\r\nThe Fehrer Automotive facility in Gadsden is in a light industrial and commercial area with only moderate development.   The 0.1 mile radius of toxic endpoint value for the worst case scenario does extend beyond the facility property line on the north side to the adjoining property that is used for adult education and training.  The .05 mile"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000063022,
      "SummaryText": "radius of toxic endpoint value for the alternate worst case scenario does not extend beyond the facility property line.\r\n\r\nThe Offsite Consequence Analysis focused on toxic release concerns for unreacted, uncured TDI as a product manufacturing feedstock.\r\nThe 2,4-TDI (CAS# 584-84-9) and the 2,6-TDI (CAS# 91-08-7) isomer mixture is known as Toluene Diisocyanate (CAS# 26471-62-5).\r\nThe U.S. OSHA Table Z-1 Limits for Air Contaminants (29 CFR 1910.1000) Ceiling Limit Value for TDI is 0.02 ppm, 0.14 mg/m3.\r\n\r\n3.1\tPhysical and Chemical Properties\r\nState of Matter\t\t\t        liquid\r\nAppearance\t\t\t\tliquid\r\nColor\t\t\t\t\tcolorless to light yellow\r\nFlash Point\t\t\t\t132°F (296°C)\r\nVapor Density\t\t\t\t6 (air is 1)\r\nVapor Pressure\t\t\t        0.056 at 95°F (35°C)\r\nSpecific Gravity\t\t\t1.22\r\nSolubility in Water\t\t\tInsoluble (reacts slowly with water to liberate CO2 gas)\r\nBulk Density\t\t\t\t10.2 lbs/gallon (1,220 kg/m3)\r\nLower Flammability Limit\t\t0.9% by air volume\r\nUpper Flammability Limit\t\t9.5% by air volume\r\n\r\n3.2\tQuantity Released\r\nThe EPA has defined a worst-case release as the release of the largest quantity of a regulated substance from a vessel or process line (pipe) failure that results in the greatest distance to a specified endpoint. For substances in vessels, facilities must assume release of the largest amount in a single vessel; for substances in pipes, facilities must assume release of the largest amount in a pipe.  The possible causes of the worst-case release or the probability that such a release might occur are not evaluated; the release is simply assumed to take place.\r\n\r\nFehrer Automotive has modeled the worst-case release scenario as a total release of one tank trailer load with an approximate weight of 45,000 pounds of TDI to a secondary containment area.  Using an EPA approved model, Phast Risk, the results of the offsite consequence analysis estimated the distance to the toxic endpoint to be 574 feet or roughly 0.1 mile.   \r\n\r\nFehrer Automotive has modeled the required alte"
    }
  ]
}