{
  "FacilityID": 1000071539,
  "FacilityName": "Caymus Plant",
  "FacilityStr1": "3500 N FM 1776",
  "FacilityStr2": null,
  "FacilityCity": "Coyanosa",
  "FacilityState": "TX",
  "FacilityZipCode": "79730",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48389",
  "LEPC": "Reeves County LEPC",
  "FacilityLatDecDegs": "31.336886",
  "FacilityLongDecDegs": "-103.030494",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.vaqueromidstream.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Vaquero Midstream LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Vaquero Permian Processing LLC",
  "OperatorStr1": "1790 Hughes Landing Blvd",
  "OperatorStr2": "Suite 475",
  "OperatorCity": "The Woodlands",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77380",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000232358",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "136596",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-10-11 12:01:35",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-10-11 12:01:35",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-10-11 12:01:35",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-10-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 31.336886,
  "FRS_Long": -103.030494,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R03",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000089600,
      "AltID": "Caymus Facility",
      "FacilityID": 1000071539,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000112088,
          "ProcessID": 1000089600,
          "ChemicalID": 155,
          "Quantity": 1412200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000097606,
              "ProcessChemicalID": 1000112088,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000097607,
              "ProcessChemicalID": 1000112088,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000097608,
              "ProcessChemicalID": 1000112088,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000097609,
              "ProcessChemicalID": 1000112088,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000097610,
              "ProcessChemicalID": 1000112088,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000090821,
          "ProcessID": 1000089600,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000071539,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-10-16 00:00:00",
    "ERTrainingDate": "2017-10-19 00:00:00",
    "CoordinatingAgencyName": "Reeves County Sheriff¿s Office",
    "CoordinatingAgencyPhone": "4324454901",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000071539,
      "SummaryText": "ACCIDENT RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nVaquero Midstream LLC owns and Vaquero Permian Processing LLC operates a natural gas processing plant, the Caymus Natural Gas Processing Facility, in Reeves County, Texas. The plant is designed to process natural gas and recover liquid product from natural gas by physical separation and cryogenic means. Petroleum condensates are transported to another facility for processing.\r\n\r\nVaquero Permian Processing, LLC has a long-standing commitment to worker and public safety. This commitment is demonstrated by our efforts in accident prevention, such as training personnel, quality assurance, and considering safety in the design, installation, operation and maintenance of our process. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However if a release does occur, facility trained personnel will evaluate the situation, take actions within the capabilities of the facility, and notify the necessary outside agencies.\r\n\r\n\r\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe Caymus Natural Gas Processing Facility is located near Coyanosa, Texas and operates a variety of processes to produce the following petroleum products:\r\n- Propane\r\n- NGLs\r\n- Condensate\r\n- Residue Gas\r\n\r\nThese substances can contain the following regulated chemicals:\r\n- Methane\r\n- Ethane\r\n- Propane\r\n- i-Butane\r\n- n-Butane\r\n- i-Pentane\r\n- n-Pentane\r\n\r\n\r\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\r\n\r\nA. Employee Participation\r\n\r\nVaquero Permian Processing, LLC encourages employees to participate in all facets of process safety management and accident prevention as follows:\r\n1. Updating and compiling technical documents and chemical information;\r\n2. Performing necessary calculations for PSM and RMP;\r\n3. Maintaining good engineering practices; and\r\n4. Participating as a member of a process hazard analysis (PHA) team.\r\n\r\nAdditionally, employees have access to all information pertainin"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000071539,
      "SummaryText": "and\r\n3. Notification of local emergency response agencies and the public if a release occurs.\r\n\r\nEmployees receive training in the procedures to be followed by employees who remain to operate critical plant operations before they evacuate. Vaquero Permian Processing, LLC has around-the-clock communication capability with appropriate emergency response organizations (Fire Department, Police Department, Sheriff's Office, or similar). This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition, Vaquero Permian Processing, LLC conducts periodic emergency drills and refresher training for plant personnel.\r\n\r\nN. PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nVaquero Permian Processing, LLC's management is committed to the following:\r\n-Preventing accidents;\r\n-Training our employees in correct response procedures in the event of an accident;\r\n-Participating in community emergency preparedness; and\r\n-Addressing any citizen concerns by fully explaining potential hazards associated with Vaquero Permian Processing, LLC operations and all steps being taken to prevent and mitigate accidents.\r\n\r\nWith these objectives in mind, this Risk Management Plan has been developed to provide information about our management of the risks associated with the natural gas treatment and liquids recovery process. Most importantly, we stress our commitment to ensuring a safe operation for our employees, our visitors, and our community."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000071539,
      "SummaryText": "taken in response to the investigation team's findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented and investigation reports are retained for at least 5 years.\r\n\r\nK. Specialized Safety Features\r\n\r\nSite specific detection and control equipment (safety features) are deployed throughout the plant to:\r\n1. Contain/control a release;\r\n2. Quickly detect a release; and\r\n3. Reduce the consequences of an RMP-regulated substance release.\r\n\r\nThe following type of safety features are used in the covered processes:\r\n1. Release Detection\r\n   a. Hydrocarbon and hydrogen sulfide detectors with alarms.\r\n2. Release Containment/Control\r\n   a. Process relief valves that discharge to a flare to capture and incinerate episodic releases;\r\n   b. Automated and manual valves to isolate the process;\r\n   c. Automated plant shutdown system to shut down all engines, plant utilities, and automatically operate all automatic valves to their fail-safe position, diverting all incoming gas to the emergency flare;\r\n   d. Curbing or diking to contain liquids releases;\r\n   e. Redundant equipment and instrumentation; and\r\n   f. Atmospheric relief devices.\r\n3. Release Mitigation\r\n   a. Fire suppression and extinguishing system;\r\n   b. Trained emergency response personnel;\r\n   c. Personal protective equipment; and\r\n   d. Blast-resistant building to help protect control systems and personnel.\r\n\r\nL. FIVE YEAR ACCIDENT HISTORY\r\n\r\nThe Caymus Natural Gas Processing Facility has had no RMP-reportable accident during the past five years. \r\n\r\nM. EMERGENCY RESPONSE PROGRAM INFORMATION\r\n\r\nThe plant maintains a written emergency response plan, which is in place to help protect employee and public safety as well as the environment. The plan identifies steps to be taken in case of an accidental release including:\r\n1. Proper first aid and medical treatment for exposures;\r\n2. Evacuation plans and accounting for personnel after an evacuation;"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000071539,
      "SummaryText": "g to the accident prevention program.\r\n\r\nB. Process Safety Information\r\n\r\nVaquero Permian Processing, LLC keeps a variety of technical documents that are used to help maintain safe operation of the covered processes. These technical documents address the following:\r\n1. Chemical properties and associated hazards;\r\n2. Necessary Block Flow Diagrams of the processes;\r\n3. Maximum intended inventories;\r\n4. Upper and Lower limits of process fixed and rotating equipment;\r\n5. Equipment design basis and configuration information;\r\n6. Identification of all necessary Regulatory equipment design documents; and \r\n7. Sufficient information to assure good engineering practices.\r\n\r\nThe location of the technical documents referenced above is listed in the Process Safety Information portion of the PSM manual. Chemical specific information, including hazard and emergency response/exposure considerations, is provided in safety data sheet (SDS). For specific process areas, the facility has documented safety-related limits for specific process parameters such as temperatures, level, and composition in the operator procedures manual. The facility maintains the processes within these limits by using process controls and monitoring instruments, trained personnel, and protective instrument systems such as automated shutdown systems.\r\n\r\nThe facility also maintains numerous technical documents that provide information about the design and construction of the process equipment. This information includes materials of construction, design pressures, temperatures, and electrical ratings. This information, in combination with procedures and equipment operating history, provides a basis for inspection and maintenance activities, as well as for evaluating proposed process and facility changes to safety features in the processes.\r\n\r\nC. Process Hazard Analysis (PHA)\r\n\r\nVaquero Permian Processing, LLC has a comprehensive program to identify and control hazards associated with the RMP covered processes. T"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000071539,
      "SummaryText": "his program systematically examines for potential hazards and puts controls in place to manage hazards. The team identifies, evaluates, and makes recommendations to management of potential hazards. The team's findings are forwarded to Vaquero Permian Processing, LLC Management for resolution. The approved mitigation options in response to the PHA team's findings are tracked until they are completed. The final resolution of each finding is documented and retained.\r\n\r\nThe facility periodically updates and revalidates the PHA. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained.\r\n\r\nD. Operating Procedures\r\n\r\nVaquero Permian Processing, LLC maintains written Operating Procedures of the covered processes that address primary operations mandated by OSHA, EPA, Good Engineering Practice, and manufacturers' specifications. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. Procedures are periodically reviewed and annually certified as current and accurate by management. The procedures are maintained current and accurate, revising them as necessary by employee suggestion, compliance audit, PHAs, Good Engineering practice, Pre-Startup Safety Review (PSSR) and implementing them through Management of Change.\r\n\r\nCovered Process Operating Procedures are readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job task and maintain the covered process unit operating within its safe limits.\r\n\r\nE. Training\r\n\r\nVaquero Permian Processing, LLC has implemented a comprehensive training program for all employees involved in operating the covered processes. New employees receive basic training in process operations if they are not already familiar with such operations. After successfully comp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000071539,
      "SummaryText": "leting this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. After the operator demonstrates adequate knowledge to perform the duties and tasks in a safe manner on their own, they are allowed to work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years, or more frequently if necessary. All training is documented for each operator, including the means used to verify and demonstrate skills.\r\n\r\nF. Contractors\r\n\r\nVaquero Permian Processing, LLC uses contractors to supplement its workforce during periods of increased maintenance or construction activities. Because some contractors work on or near covered process equipment, the facility has procedures in place to ensure that contractors:\r\n1. Perform their work in a safe manner;\r\n2. Have the appropriate knowledge and skills;\r\n3. Are aware of the hazards in their workplace;\r\n4. Understand what they should do in the event of an emergency;\r\n5. Understand and follow site safety rules; and \r\n6. Inform facility personnel of any hazard that they find during their work.\r\n\r\nThis is accomplished by providing contractors with:\r\n1. A process overview;\r\n2. Information about safety and health hazards;\r\n3. Emergency response plan requirements; and\r\n4. Safe work practices before beginning work.\r\n\r\nIn addition, Vaquero Permian Processing, LLC Management will evaluate the contractor safety program and performance during the selection of a contractor. Facility personnel periodically monitor contractor performance with regard to their safety obligations.\r\n\r\nG. Pre-Startup Safety Review\r\n\r\nVaquero Permian Processing, LLC conducts a PSSR for any new facility modification that requires a change in the process safety information. The purpose of the PSSR is to see that safety features, procedures, per"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000071539,
      "SummaryText": "sonnel, and equipment are appropriately prepared for startup before placing the equipment into service. This review provides one additional check that construction is in accordance with the design specifications and that all supporting systems are operationally ready. A PSSR involves field verification of the construction and serves as quality assurance and verification that the accident prevention program requirements are properly implemented.\r\n\r\nH. Safe Work Practices\r\n\r\nVaquero Permian Processing, LLC has standing safe work practices as mandated by OSHA, EPA, Industrial Standards, and Good Engineering Practice in place to help provide employee, public, and process safety.\r\n\r\nI. Management of Change\r\n\r\nVaquero Permian Processing, LLC has a comprehensive system to manage changes to all covered processes. This system requires that changes to items such as process equipment, chemicals, technology, and procedures be properly reviewed and authorized before being implemented. Changes are reviewed to:\r\n1. Determine that adequate controls are in place to manage any new hazards; and\r\n2. Verify that existing controls have not been compromised by the proposed change.\r\n\r\nAffected chemical hazard information, process operating limits, and equipment information and procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are trained on the changes.\r\n\r\nJ. Incident Investigation\r\n\r\nVaquero Permian Processing, LLC promptly investigates all incidents related to a covered process that resulted in, or reasonably could have resulted in a fire/explosion, property damage, environmental loss or personal injury. The goal of each investigation is to determine the facts and develop corrective action to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent future occurrences, and forwards these results to facility management for resolution. Corrective actions"
    }
  ]
}