{
  "FacilityID": 1000024738,
  "FacilityName": "Marysville Ethanol, LLC",
  "FacilityStr1": "2510 Busha Highway",
  "FacilityStr2": null,
  "FacilityCity": "Marysville",
  "FacilityState": "MI",
  "FacilityZipCode": "48040",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26147",
  "LEPC": "St. Clair County LEPC",
  "FacilityLatDecDegs": "42.883350",
  "FacilityLongDecDegs": "-082.491547",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "PP",
  "FacilityURL": null,
  "FacilityEmailAddress": "ametevia@marysvilleethanol.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Marysville Ethanol, LLC",
  "OperatorStr1": "2510 Busha Highway",
  "OperatorStr2": null,
  "OperatorCity": "Marysville",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48040",
  "OperatorZipCodeExt": null,
  "RMPContact": "Aric Metevia",
  "RMPTitle": "Plant Manager",
  "FTE": 29,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209348",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-07-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-11-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-11-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-11-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-11-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030345,
      "AltID": "Ammonia Storage & Use",
      "FacilityID": 1000024738,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000030647,
          "ProcessID": 1000030345,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000036469,
          "ProcessID": 1000030345,
          "ChemicalID": 56,
          "Quantity": 93000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000536469,
          "ProcessID": 1000030345,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000030346,
      "AltID": "Natural Gasoline",
      "FacilityID": 1000024738,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000030648,
          "ProcessID": 1000030346,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000036471,
          "ProcessID": 1000030346,
          "ChemicalID": 155,
          "Quantity": 1030625.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000030558,
              "ProcessChemicalID": 1000036471,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000030559,
              "ProcessChemicalID": 1000036471,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000030560,
              "ProcessChemicalID": 1000036471,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000030561,
              "ProcessChemicalID": 1000036471,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000536471,
          "ProcessID": 1000030346,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024738,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n1.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY POLICIES\n\nMarysville Ethanol, LLC recognizes management's responsibility in protecting its employees, equipment, property, and the environment against the hazards of an unintentional release of ammonia. The safety and health of all employees and the public is very important. The control of accidents has been and will continue to be a basic responsibility of all personnel in the facility.\n\n\n\nMarysville Ethanol, LLC believes that employee participation is the key to a successful program. Operating level employees have been involved in the PSM/RMP program development, implementation and integration and they assume the major responsibility for operating facility safely. The Marysville Ethanol, LLC Emergency Response Program has been developed with the cooperation and support of the Marysville Fire Department. All Marysville Ethanol, LLC employees have received documented emergency response training.\n\n\n\n2.  STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nMarysville Ethanol, LLC is an ethanol fuel production facility that is permitted to produce 65 million gallons per year. The facility is located just south of Marysville, Michigan, and just east of Interstate 94. The site encompasses 42 acres, and is located adjacent to and on lands occupied by Marysville Hydrocarbons, LLC, who is leasing the property to Marysville Ethanol, LLC. Although these are separate entities, they share a common plant fence line.\n\n\n\nThe feedstock for the fuel ethanol facility is corn, which will be delivered by truck and rail. The corn is milled to a coarse powder, and fed to the cook section where enzymes are added to break the starch down into sugars. The sugars are broken down further in the slurry tank with the addition of enzymes, and the initial introduction of yeast. From the slurry tank the solution goes to the fermentation tanks. The fermentation process takes approximately 50 hours to complete. The fermented solutio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024738,
      "SummaryText": "n, which is approximately 10% ethanol, is then distilled to 190 proof. This intermediate product is further refined to pure (i.e., 200 proof) ethanol. At this stage, the ethanol is denatured and stored in one of two 750,000 gallon above ground tanks before the product is loaded onto railcars or trucks for shipment. The final product is approximately 95% ethanol. \n\nMarysville Ethanol, LLC uses natural gasoline, which is a regulated flammable material under the RMP regulations, in the process to denature the ethanol and make it unsuitable for human consumption. The natural gasoline will be delivered to the site by truck, and pumped into a 165,000-gallon bulk storage tank with a floating roof.\n\n\n\nSeveral safety features are designed into the natural gasoline system:\n\n?    Standard operating procedure is for the tank to not be filled more than 90% of capacity. This will help ensure that spills do not occur from overfilling.\n\n?    Fusible links that will stop flow in the event of a fire near the storage tank or pumps.\n\n\n\nAnhydrous ammonia is used in the process to control the pH of the solution in the slurry tank, and the fermenters. Using ammonia also creates free nitrogen, which is an essential nutrient for the yeast. The anhydrous ammonia will be delivered to the site by truck, and pumped into the 18,000 gallon bulk ammonia tank.\n\n\n\nSeveral safety features are designed into the anhydrous ammonia system:\n\n?    Standard operating procedure is for the tank to not be filled more than 90% of capacity, i.e., 16,200 gallons. This will help ensure that spills do not occur from overfilling.\n\n?    This tank is hard piped to the slurry and fermentation tanks. Several vent valves have been installed in case of over-pressurization of the ammonia lines, and the tank itself has several relief valves.\n\n?    Excess flow valves that will close if excess flow (e.g., broken pipe) is sensed.\n\n?    Air operated emergency shutoff valves that will be reopened manually.\n\n\n\nEthanol itself is a regulated substan"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024738,
      "SummaryText": "ce under 29 CFR 1910.119 (PSM) and is covered under the facility's PSM program, but is not regulated under 40 CFR Part 68 (RMP) and is not addressed in this document.\n\n\n\n\n\n3.  SUMMARY OF WORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nWorst case and alternate scenarios have been defined for a release of anhydrous ammonia.\n\n\n\nFor anhydrous ammonia, EPA requires that the worst-case scenario consider the release and vaporization of the entire contents of the ammonia system. This release has a maximum toxic endpoint (distance to the safe point of dispersion of the gas of 3.3 miles. The potential impacted population is estimated to be 13,000 people. The alternate scenario involves release of the volume of an ammonia delivery truck. The distance to the toxic endpoint in the alternate scenario is 0.6 miles. Approximately 430 are estimated to live in this area.\n\n\n\nFor natural gasoline, a flammable mixture, EPA requires that the worst-case scenario consider the release of the entire contents of the natural gasoline storage tank (which is the vessel containing the largest inventory of flammable covered chemical) and subsequent formation of a vapor cloud.  The entire contents of the vapor cloud are assumed to be within the flammable limits, and the cloud is assumed to explode. Per the EPA requirements, 10 percent of the flammable vapor in the cloud is assumed to participate in the explosion, and the consequence distance is taken as the distance to an overpressure level of 1 pound per square inch (psi). This release has a distance to the 1 psi overpressure level of 0.81 miles. The potential impacted population is estimated to be 78 people.\n\nThe alternate scenario involves a rupture of the 3-inch pipe/valve at the base of the tank and subsequent draining of the entire contents of the tank followed by the formation of a vapor cloud with a concentration at the lower flammable limit; the distance to the lower flammable limit in the alternate scenario is 0.041 miles. No residential re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024738,
      "SummaryText": "ceptors were identified in this area. The impacted population would consist entirely of the workforce at the facility.\n\n\n\n\n\n4.  GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nMarysville Ethanol, LLC complies with the OSHA PSM for Highly Hazardous Chemicals standard relative to anhydrous ammonia, natural gasoline, and ethanol. Therefore, this facility has programs to ensure proper operation and maintenance of the ammonia and natural gasoline storage and supply systems. Further, operations personnel have been trained and are knowledgeable in the safe operation of these systems.\n\n\n\nThe ammonia system at this facility has been designed and constructed using good engineering practices and to conform to industry standards. The system includes emergency shutdown switches located in the control room and inside the Process Building west entrance as well as safety relief valves to avert serious system overpressure. Periodic maintenance on the ammonia system is ensured via the use of a computerized maintenance management system.\n\n\n\nThe natural gasoline system at this facility has been designed and constructed using good engineering practices and to conform to industry standards. The system includes emergency shutdown systems to avert serious system conditions. Periodic maintenance on the natural gasoline system is ensured via the use of a computerized maintenance management system.\n\n\n\n\n\n5.  5 -YEAR ACCIDENT HISTORY\n\nDuring the past five years, this facility has had no significant accidental releases of ammonia. Natural gasoline will be used at the facility starting in late 2011. Operation of the facility began in October 2007.\n\n\n\n6.  EMERGENCY RESPONSE PLAN\n\nThis ethanol production facility has procedures in place to respond to the release of a hazardous substance. Employees are trained to evacuate their respective areas in accordance with OSHA 1910.38(a). Coordination with the local volunteer fire department is initiated during an emergency situation. The St. Clair County LEP"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000024738,
      "SummaryText": "C has been notified regarding the Marysville Ethanol, LLC emergency action plan and of the potential nature of an anhydrous ammonia release or a release of the natural gasoline denaturant.\n\n  \n\n7  PLANNED CHANGES FOR SAFETY IMPROVEMENT\n\nMarysville Ethanol, LLC is committed to continuous improvement of the safety programs for its employees and offsite receptors. Marysville Ethanol, LLC will evaluate the safety programs, including the passive and active mitigation systems associated with the covered storage and use systems in the light of any release or potential incidents, protection systems in place at other facilities, and industry practices on a regular basis."
    }
  ]
}