{
  "FacilityID": 1000092984,
  "FacilityName": "C. L. Hauthaway & Sons Corporation",
  "FacilityStr1": "638 Summer Street",
  "FacilityStr2": null,
  "FacilityCity": "Lynn",
  "FacilityState": "MA",
  "FacilityZipCode": "01905",
  "Facility4DigitZipExt": "2092",
  "FacilityCountyFIPS": "25009",
  "LEPC": "Lynn LEPC",
  "FacilityLatDecDegs": "42.457396",
  "FacilityLongDecDegs": "-70.974242",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.hauthaway.com",
  "FacilityEmailAddress": "info@hauthaway.com",
  "FacilityDUNS": 1008093,
  "ParentCompanyName": "C. L. Hauthaway & Sons Corporation",
  "Company2Name": null,
  "CompanyDUNS": 1008093,
  "Company2DUNS": null,
  "OperatorName": "C. L. Hauthaway & Sons Corporation",
  "OperatorStr1": "638 Summer Street",
  "OperatorStr2": null,
  "OperatorCity": "Lynn",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01905",
  "OperatorZipCodeExt": "2092",
  "FTE": 39,
  "OtherEPAFacilityID": "MAR05J021",
  "EPAFacilityID": "100000246325",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-06-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-03-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-03-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-07-17 00:00:00",
  "DeRegistrationEffectiveDate": "2023-07-03 00:00:00",
  "AnniversaryDate": "2026-03-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115412,
      "AltID": "TDI Process",
      "FacilityID": 1000092984,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144294,
          "ProcessID": 1000115412,
          "ChemicalID": 77,
          "Quantity": 13464.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000116864,
          "ProcessID": 1000115412,
          "NAICSCode": "32552",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000098737,
              "Process_NAICS_ID": 1000116864,
              "SafetyReviewDate": "2021-01-05 00:00:00",
              "PHA_Date": "2021-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-01-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "water mist system.  Redundant system for sprinkler system.  Specifically listed as not to pull this in the event of a TDI spill only; only for flash fire, static fire, etc.",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Local and movable TDI ventilation; Water fog system in Urethane and Churn departments",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-12-01 00:00:00",
              "TrainingReviewDate": "2021-03-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Fire & Spill Drills",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-02-16 00:00:00",
              "EquipmentInspectionDate": "2021-02-15 00:00:00",
              "EquipmentTested": "Water fog system: Nitrogen bank pressure at desired range",
              "ChangeMgmtDate": "2020-11-01 00:00:00",
              "ChangeMgmtReviewDate": "2020-12-11 00:00:00",
              "PreStartupReviewDate": "2021-01-14 00:00:00",
              "ComplianceAuditDate": "2021-02-23 00:00:00",
              "AuditCompletionDate": "2021-12-10 00:00:00",
              "IncidentInvestigationDate": "2021-02-01 00:00:00",
              "InvestigationChangeDate": "2021-02-05 00:00:00",
              "ParticipationPlansReviewDate": "2020-12-10 00:00:00",
              "HotWorkPermitReviewDate": "2020-09-10 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2021-01-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000123777,
                  "PreventionProgram3ID": 1000098737,
                  "ProcessChemicalID": 1000144294
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000092984,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-09-30 00:00:00",
    "ERTrainingDate": "2020-07-17 00:00:00",
    "CoordinatingAgencyName": "City of Lynn Fire Department",
    "CoordinatingAgencyPhone": "7815931234",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092984,
      "SummaryText": "of 24 drums stored in the Warm Room was considered.  The release rate to outside air for the worst case scenario was 0.0452 lbs./minute.  The hazard impact distance (HID) to the level of concern of TDI (0.007 mg/L) extended 0.1 miles, which included a commercial facility across the Summer Street and several residences in the vicinity of the facility.  The Saugus River adjacent to the site and the entire site property is an environmental sensitive area (ACEC) designated by the state.  The process was therefore considered a Program Level 3 process for RMPlan.    There were no schools, daycare, senior citizen center, hospitals, prison/correctional facility within the WCS HID.  It may be noted that most of the time, the facility stores less than 24 drums of TDI in the Warm Room and in case of accidental releases, most of the time, the WCS HID will be significantly less than 0.1 mile and could be confined within the facility boundary.\r\n\r\nAs part of the hazard assessment, the facility also conducted an alternative release scenario (ARS) analysis. The ARS was developed based on process hazard analysis (PHA) of the TDI handling and storage at the facility and consisted of slippage of four (4) drums on the forklift at the loading dock of Building 1 (outdoor), puncture of drums and spillage of TDI.  The outdoor scenario was considered for reporting in the RMPlan because of higher potential for impacting the area surrounding the facility.  The release rate to outdoor air for ARS was 0.0129 lbs./minute.  The ARS HID was 0.1 miles, the minimum distance reported in the RMP*COMP software. There were no schools, daycare, senior citizen center, hospitals, prison/correctional facility within the WCS HID.  As mentioned above, the Saugus River adjacent to the site and the entire site property is an environmental sensitive area (ACEC) designated by the state.  \r\n\r\nThe facility did not have any reportable accidental release of TDI in the last five years.\r\n\r\nAs part of the RMPlan, a PHA w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092984,
      "SummaryText": "as conducted for TDI handling, storage, and process. The PHA used What-if/Checklist methodology and included participants from operations, maintenances, and Environmental Health and Safety (EH&S) management at the facility.  A copy of the PHA is available at the facility and the findings have been communicated to the appropriate facility personnel.\r\n\r\nThe facility takes responsibility for safe operations seriously and has developed a robust process safety management (PSM) program for toxics and flammable substances handled and processed in the facility.  This prevention program is applicable to TDI also.  Specifically for TDI, the prevention programs elements include:\r\n\r\n·       Detailed process safety information (PSI) for all areas where TDI is handled, stored, or used;\r\n·       Process hazard analysis (PHA) for all areas where TDI is handled, stored, or used;\r\n·       Safe operating procedures for handling, storage and movement of TDI within building;\r\n·       Mechanical integrity program including preventive maintenance for TDI handling equipment;\r\n·       Incident reporting and investigation program for the facility;\r\n·       Pre-startup safety review program;\r\n·       Management of change program;\r\n·       Emergency response plan for the facility;\r\n·       Training to operators handling TDI;\r\n·       Contractor safety program;\r\n·       Hot work permit program; and\r\n·       Inspection and audit program\r\nOther general safety programs at the facility includes:\r\n·       Safety data sheets for all flammable and toxic substances available at locations accessible to the facility operators;\r\n·       Emergency showers and spill prevention kits are available throughout Building 1;\r\n·       Forklift operators are trained on safe handling of loads;\r\n·       Fume extraction systems are used during operations in the reactors;\r\n·       Sprinkler system is available throughout Building 1 at strategic locations;\r\n·       Spill Prevention: Gate valve to close in event of releas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092984,
      "SummaryText": "e. Closing gate valve diverts spill to three stormceptors.\r\n·       Respiratory Protection Program\r\n\r\nThe facility strives to develop a strong safety culture within the personnel handling toxic and flammable substances and to others in general.  The facility has developed an intensive training program for facility operators and maintenance personnel handling toxic and flammable substances including TDI.  This training program includes annual classroom training and as needed on-the-job training.  Written and oral tests are used to verify competency of the operators.\r\n \r\nThe facility has developed a written Emergency Response Plan (ERP), which includes specific actions to be taken in response to accidental releases of regulated flammable and toxic substances.  The plan also includes procedure for informing the public and local agencies and information on emergency health care in case of accidental releases.  The emergency response plan has been reviewed and updated to include TDI. The ERP requires facility personnel to attend to small releases and contact the local emergency response agency (City of Lynn Fire Department Ph: 911 and Aspen Environmental Emergency Response Ph: 1-877-337-9936) for larger releases.\r\n\r\nThe facility has developed a RMP/PSM management program, in which the senior management will be involved to review and make decisions as and when necessary.  The program will be managed on a continuous basis by the EH&S Manager at the facility.  The facility has always committed to safe operations and will continue to do so with the TDI RMPlan."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092984,
      "SummaryText": "C. L. Hauthaway and Sons (Hauthaway) operates a batch chemical manufacturing facility at 638 Summer Street, Lynn, MA.  The facility uses Toluene Diisocyanate (TDI) as a raw material for manufacturing polyurethane product in several reactors within Building 1 of the facility.  TDI is brought into the facility by trucks in 55-gallon drums, through either of the two gates on Summer Street.  The trucks are directed to the unloading docks of Building 1.  At the unloading dock, the TDI drums are inspected by facility personnel for possible loss of integrity and safety.  The drums are then transported by forklifts and stored in a closed area within Building 1 identified as Warm Room.  The TDI drums are stored in the Warm Room on pallets and the room is maintained at an appropriate temperature to prevent solidification of TDI. As and when required in the reactors, TDI drums are transported from the Warm Room to the reactor via forklifts.  Drums of TDI are hoisted to the mezzanine floor on top of the reactors and poured into the reactor at predetermined rate and quantity depending on the process requirements.  TDI is consumed in the reaction and the product and waste streams contain less than 1% TDI.  The empty TDI drums are stored at a specified location within the facility and transported off-site.  There are no other storage or processes for TDI at the facility.\r\n\r\nThe facility has determined that up to twenty-four (24) TDI drums could be stored at any one time within the Warm Room.  This quantity exceeds the United States Environmental Protection Agency's (USEPA) Risk Management Program (RMP) applicability threshold of 10,000 lbs for TDI.  Therefore, the facility has prepared and submitted a Risk Management Plan (RMPlan).\r\n\r\nAs part of the RMPlan, the facility has conducted a hazard assessment for accidental release of TDI per USEPA guidelines and using USEPA's RMP*COMP software.  A very conservative worst-case scenario (WCS) of catastrophic release of entire quantity"
    }
  ]
}