{
  "FacilityID": 1000045441,
  "FacilityName": "Grain Processing Corporation",
  "FacilityStr1": "1600 Oregon St.",
  "FacilityStr2": null,
  "FacilityCity": "Muscatine",
  "FacilityState": "IA",
  "FacilityZipCode": "52761",
  "Facility4DigitZipExt": "0072",
  "FacilityCountyFIPS": "19139",
  "LEPC": "Muscatine County LEPC",
  "FacilityLatDecDegs": "41.397861",
  "FacilityLongDecDegs": "-091.060889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.grainprocessing.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 198484180,
  "ParentCompanyName": "Muscatine Foods Corporation, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 5269923,
  "Company2DUNS": 5269923,
  "OperatorName": "Grain Processing Corporation",
  "OperatorStr1": "1600 Oregon St.",
  "OperatorStr2": null,
  "OperatorCity": "Muscatine",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52761",
  "OperatorZipCodeExt": "0072",
  "RMPContact": "Ron Zitzow",
  "RMPTitle": "Sr. Vice President of Operations",
  "FTE": 600,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000052603",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "03-TV-029",
  "SafetyInspectionDate": "2014-04-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-07-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-07-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.39814,
  "FRS_Long": -91.06258,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056400,
      "AltID": "Starch Modification",
      "FacilityID": 1000045441,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000057342,
          "ProcessID": 1000056400,
          "NAICSCode": "311221",
          "_desc": {
            "NAICS_CODE": "311221",
            "NAICS_DESCRIPTION": "Wet Corn Milling"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068766,
          "ProcessID": 1000056400,
          "ChemicalID": 9,
          "Quantity": 260000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 9,
            "ChemicalName": "Ethylene oxide  [Oxirane]",
            "CASNumber": "75-21-8",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000068767,
          "ProcessID": 1000056400,
          "ChemicalID": 12,
          "Quantity": 153000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 12,
            "ChemicalName": "Propylene oxide  [Oxirane, methyl-]",
            "CASNumber": "75-56-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568766,
          "ProcessID": 1000056400,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568767,
          "ProcessID": 1000056400,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045441,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nA. Accidental Release Prevention and Emergency Response Policy\n\nGrain Processing Corporation, GPC, uses every means at its disposal to operate a safe workplace. This includes implementing the provisions of 29 CFR 1910.119 (OSHA PSM-Process Safety Management) and 40 CFR 68 (EPA RMP-Risk Management Plan) which are systematic approaches for chemical process hazards management designed to eliminate or minimize the potential for major catastrophes caused by the release of highly hazardous chemicals. GPC employs these measures to ensure that the means for preventing a catastrophic release, fire, or explosion are understood by all personnel onsite, and to ensure the necessary preventative measures and mitigation measures are installed and maintained. Management ensures that these measures are properly established and utilized.\n\n\n\n\n\nB. Stationary Source and Regulated Substances Handled:\n\nGPC is located in the southeast portion of the city of Muscatine, Muscatine County, Iowa. The facility covers approximately 110 acres. GPC is a corn wet milling operation. Located adjacent to the Mississippi River, GPC produces beverage and denatured ethyl alcohol, crude corn oil, conventional and modified corn starches, maltodextrins, corn syrup solids, superabsorbent polymers, and animal feed by-products. GPCA?s facility includes storage vessels, equipment, and processes typical of a corn wet milling plant.\n\n\n\nThe primary plant operations of concern for RMP are starch modification processes, which include the following subsystems:\n\n\n\n1. Ethylene Oxide Railcar unloading\n\n2. Propylene Oxide Tank Truck unloading\n\n3. Ethylene oxide storage and transfer systems\n\n4. Propylene oxide storage and transfer systems\n\n\n\nUse of regulated substances:\n\nEthylene oxide and propylene oxide are reacted with cornstarch in the modified starch area to produce modified corn starches for both food and industrial use. \n\n\n\nQuantities of all chemicals stored include:\n\nEthylene Oxide\n\nMinimum inv"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045441,
      "SummaryText": "entory    -0-\n\nMaximum inventory    258,400 lbs.\n\n\n\nPropylene Oxide\n\nMinimum inventory    -0-\n\nMaximum inventory    179,143 lbs.\n\n\n\n\n\nC. General Accident Release Prevention Program and Chemical Specific Prevention Steps\n\nThe general accidental release prevention program and chemical specific prevention steps at GPC includes but are not limited to:\n\nAll elements of 29 CFR 1910.119 (OSHA PSM) - these include key items such as employee participation in planning and evaluations, Process Hazard Analysis, compilation and routine review of operating procedures, employee and contractor training programs, Pre-Startup Safety Reviews, Mechanical Integrity Evaluations, a Hot Work Permit Program, a Management of Change program to review proposed changes to the processes, Incident investigations, emergency and response planning, and compliance audits of safety and hazard programs. \n\nNFPA (National Fire Protection Association) Guidelines  \n\nEPA, API (American Petroleum Institute) Standards\n\nASTM (American Society for Testing of Material) Standards\n\nNBIC (National Board of Boiler and Pressure Vessel Inspections)\n\nASME (American Society of Mechanical Engineers) Guidelines\n\nIn addition, policies and procedures are set forth in GPC's Corporate Safety and PSM Manuals outlining both normal operating procedures and emergency procedures.\n\nGPC has conducted as part of our Process Safety Management Program (PSM), process safety hazard analyses, PHA's, of PSM covered areas and critical processes. Based on the findings and recommended actions of the PHA's, changes to improve safety have been implemented and are ongoing. Numerous mitigation systems and safety systems have been installed and are maintained for regulated chemicals. These mitigation systems include such items as area and perimeter monitoring (both MSA and Gas Chromatograph measuring systems), deluge systems, foam systems, secondary containment dikes, control system interlocks, remote emergency shutdown systems, excess flow valves"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045441,
      "SummaryText": ", and an emergency Ethylene Oxide eduction and neutralization system. \n\n\n\n\n\nD. Five-year Accident History\n\nThere have been no chemical spills or critical releases within the last five years that have had any off site or on site consequence.\n\n\n\n\n\nE. Emergency Response Program\n\nThe facility's emergency response program is coordinated with the city of Muscatine's Local Emergency Planning Committee (LEPC). GPC is represented on the LEPC by one of the Safety Department Industrial Hygienists.\n\n\n\nSafety committees consisting of both salaried and hourly personnel meet quarterly to evaluate and implement, as deemed prudent, safety recommendations. In addition, plant wide safety meetings for all GPC personnel are held on a monthly basis. The Sr. Vice President of Production and the Plant Safety Director meet on a regular basis to ensure recommendations are being addressed in a timely and practical manner.\n\n\n\nS.O.P.'s, standard operating procedures, and emergency procedures have been developed for each of the critical process areas. Emergency drills are conducted annually in the Ethylene Oxide and Propylene Oxide process areas. These drills involve all applicable plant operations, maintenance, and security personnel and include a follow-up critique of the drill and review/revision of procedures as warranted. These drills provide one of several means for the plant to increase safety and hazard awareness, practice emergency procedures and identify opportunities to improve communication, and execution.\n\n\n\n\n\nF. Planned Changes to Improve Safety\n\nSafety improvements are constantly ongoing. Improvements are identified from review of procedures, review of drills, review of storage, handling and safety systems by outside vendors, etc. Improving safety is a perpetual process for transportation, quality assurance, maintenance, operations, engineering, contractors, and virtually all aspects of our operation. All contractors on site must have a minimum of the 10-hr OSHA Construction certi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045441,
      "SummaryText": "fication that must be renewed every three years. All contractors must complete a safety orientation class and be badged accordingly to work on site. We enforce a no facial hair policy for everyone working in the plant to enable a positive seal for a respirator if needed. Safety policies and practices are continuously scrutinized for practicality and for improvement."
    }
  ]
}