{
  "FacilityID": 1000020841,
  "FacilityName": "Lightburn Extraction Plant",
  "FacilityStr1": "6644 Old Mill Road",
  "FacilityStr2": null,
  "FacilityCity": "Jane Lew",
  "FacilityState": "WV",
  "FacilityZipCode": "26378",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54041",
  "LEPC": "Lewis/Upshur County LEPC",
  "FacilityLatDecDegs": "39.1327222",
  "FacilityLongDecDegs": "-80.4490639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.dom.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 116025180,
  "ParentCompanyName": "Dominion Transmission, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 116025180,
  "Company2DUNS": 0,
  "OperatorName": "Dominion Transmission, Inc.",
  "OperatorStr1": "445 West Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Clarksburg",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26301",
  "OperatorZipCodeExt": "2450",
  "RMPContact": "Roger Clegg",
  "RMPTitle": "Safety Specialist",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000213841",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "R30-04100013-20",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-11-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-03-30 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-03-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-03-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025414,
      "AltID": "NaturalGas Liquid Extract",
      "FacilityID": 1000020841,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000025775,
          "ProcessID": 1000025414,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030203,
          "ProcessID": 1000025414,
          "ChemicalID": 155,
          "Quantity": 231386.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 103740,
              "ProcessChemicalID": 1000030203,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 103741,
              "ProcessChemicalID": 1000030203,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 103742,
              "ProcessChemicalID": 1000030203,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 103743,
              "ProcessChemicalID": 1000030203,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 103744,
              "ProcessChemicalID": 1000030203,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 103745,
              "ProcessChemicalID": 1000030203,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000530203,
          "ProcessID": 1000025414,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000020841,
      "SummaryText": "1.    Accidental Release Prevention and Emergency Response Policies\nDominion Transmission, Inc. Lightburn Extraction Plant (LEP) is committed to employee, public and environmental safety.  This commitment is demonstrated by the release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility.  It is Dominion's policy to implement appropriate controls to prevent possible releases of regulated substances.  If a release does occur, regular personnel are at hand to control and mitigate the effects of the release.  Dominion has contracted Weavertown Environmental Group as an Oil Spill Response Organization to provide additional emergency response expertise.  Also, Dominion will contact the Lewis County Emergency Dispatch to obtain additional resources from local volunteer fire departments, law enforcement and emergency medical services.\n\n2.    Stationary Source and Regulated Substances Handled\nThe LEP is a natural gas extraction plant which receives inlet gas which is then scrubbed to remove free liquids in the gas, compressed and dehydrated utilizing one molecular sieve bed.  After dehydration, the pressure is reduced and the gas is cooled through the expander side of the expander/compressor.  The gas is sent to an absorber where liquids condense and fall to the bottom.  The overhead gas is warmed, compressed, and sent back to Dominion Transmission, Inc.'s transmission pipeline system.  The mixed natural gas liquid (NGL) product containing pentane, isopentane [butane, 2-methyl], butane, isobutane [propane, 2-methyl], propane, and ethane is sent to one of the four 60,000 gallon product storage tanks.  The NGL product is a flammable mixture that meets the NFPA-4 criteria and is present onsite in a process in an amount that exceeds the threshold quantity (10,000 pounds) for applicability under the U.S. Environmental Protection Agency's (USEPA) Risk Management Program "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000020841,
      "SummaryText": "(RMP) requirements.\n\n3.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps \nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements, which are set out under 40 Code of Federal Regulations (CFR) Part 68.  This facility was designed and constructed in accordance with ASME B31.3.  The LEP facility is also subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.  The LEP facility is classified as a Program 3 process under USEPA's RMP.  The following sections briefly describe the elements of the release prevention program that is in place at this stationary source.\n\nProcess Safety Information\nDominion LEP personnel maintain detailed records of process safety information that describes the hazards of regulated substances, operating parameters and equipment designs associated with the regulated process.  Much of this information was compiled during the preparation of the Process Hazard Analysis (PHA).  Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).\n\nProcess Hazard Analysis\nDominion LEP personnel conduct comprehensive studies to ensure that hazards associated with the regulated process are identified and controlled efficiently.  Dominion LEP utilized the What-If and HAZOP method analysis techniques to perform these evaluations.  The studies were undertaken by a team of qualified personnel with expertise in engineering and process operations.  The PHA will be revalidated at regular intervals of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within the covered process, Dominion LEP personnel maintain written operating procedures that provide clear instructions for safely conductin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000020841,
      "SummaryText": "g activities involved in each covered process consistent with the process safety. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the process.  Dominion LEP personnel develop and implement safe work practices to provide for the control of hazards during operations such as lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into a stationary source by maintenance, contractor, laboratory, or other support personnel.  These safe work practices apply to employees and contractor employees.\n\nTraining\nDominion LEP has a training program in place to ensure that employees who are operating the regulated process are competent in the operating procedures associated with the process.  Initial training for gas plant operations is provided and refresher training is conducted at least every three years or more frequently as needed.  Both initial and refresher training is documented and records of training are maintained onsite for at least three years.\n\nMechanical Integrity\nDominion LEP has written procedures for (1) maintaining on-going integrity of process equipment, which incorporates training for process maintenance activities, inspection and testing, (2) corrective action for equipment deficiencies, and (3) the application of quality assurance measures.  Dominion LEP personnel perform and document maintenance checks on process equipment to ensure proper installation and operation.  Process equipment examined by these checks may include, but is not limited to:  pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Qualified and trained personnel perform maintenance operations at the site.  Any equipment deficiencies "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000020841,
      "SummaryText": "identified by the maintenance checks are corrected in a safe and timely manner.  The Dominion LEP operating procedures also incorporate quality assurance measures to ensure that equipment and parts are suitable for the process application for which they will be used.\n\nManagement of Change\nWritten procedures are in place at the Dominion LEP facility to manage changes in process chemicals, technology, equipment and procedures.  These Management of Change procedures will be updated as needed.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-Startup Reviews\nPre-startup safety reviews related to new processes and to modifications in established processes will be conducted as a regular practice at the Dominion LEP facility.  These reviews are conducted to confirm that construction and equipment are in accordance with design specifications, and that safety, operating, maintenance, and emergency procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nDominion LEP personnel conduct audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out by at least one person knowledgeable in the process and are conducted at least every three years.  Audit findings are documented in a report.  Any corrective actions noted during the audits are undertaken in a safe and prompt manner.  Documentation of these corrective actions is also maintained.  The facility will maintain the two most recent compliance audit reports.\n\nIncident Investigation\nDominion LEP personnel promptly investigate any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  An incident investigation will be initiated as promptly as possible, but no later than 48 hours after"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000020841,
      "SummaryText": " the incident, and will involve at least one person knowledgeable of the process involved.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  A report will be prepared at the conclusion of the investigation and will include any resolutions and corrective action.  All reports are retained for a minimum of five years.\n\nEmployee Participation\nDominion LEP personnel believe that Process Safety Management (PSM) and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from the process hazard analyses.\n\nHot Work Permit\nDominion LEP personnel will issue a hot work permit for hot work operations conducted on or near a covered process.  The permit shall document that the fire prevention and protection requirements have been implemented prior to beginning the hot work operations; it shall indicate the date(s) authorized for hot work; and identify the object on which hot work is to be performed.  The permit will be kept on file until completion of the hot work operations.\n\nContractors\nDominion hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Before any contractors are allowed to work at the LEP facility, they undergo an orientation conducted by the PSM team.  During this orientation contractors are made aware of the known potential hazards related the contractors work, the hazards of regulated substances within the LEP facility, the safe work procedures required by Dominion, and a review of the Hot Work Permit Policy and the Lock Out/Tag Out Procedures used "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000020841,
      "SummaryText": "at the LEP facility.  Contractors are informed of all the procedures for emergency response should an accidental release of a regulated substance occur.  This information includes evacuation routes and assembly points.  Dominion LEP personnel will document that the contractor has received and understands the training.\n\nChemical Specific Prevention Steps\nThe covered process at the Dominion LEP facility has hazards that must be managed to ensure continued safe operation.  Collectively, these prevention program activities described above help prevent potential accidental scenarios that could be caused by equipment failures and human error.  In addition, the Dominion LEP facility incorporates safety features on its equipment to help (a) contain/control a release (e.g., diking and enclosures); (b) quickly detect a release (e.g., hydrocarbon detectors with alarms), and (c) reduce the consequences of (mitigate) a release (e.g., fire suppression and extinguishing).\n\n4.    Five-year Accident History\nThe Dominion LEP facility is a new facility and has no five-year accident history.\n\n5.    Emergency Response Program\nThe Dominion LEP facility has a written emergency action plan to deal with accidental releases of hazardous materials, which is in place to protect worker and public safety as well as the environment.  The plan addresses evacuations, notification of local emergency response agencies and the public.  Employees receive training in emergency procedures.  To ensure proper functioning, the emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within the processes that would require a modified emergency response.  The emergency plan has been reviewed with the Jane Lew Fire Department.\n\nOn May 12, 2009, Senate Bill 279, entitled Emergency Response Regulations, more commonly known as the Fifteen Minute Rule was signed into law in West Virginia.  The bill amends the Code of West V"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000020841,
      "SummaryText": "irginia, Chapter 131, adding new provisions that will require RMP subject industrial facilities (among others) to provide certain information to state and local emergency responders within 15 minutes of an accident or emergency.  Local emergency responders must be provided information related to public health, safety and welfare regarding hazardous waste or material releases.\n\n6.    Planned Changes to Improve Safety\nDominion LEP personnel will continue to improve safety at the facility through training, process knowledge, safe job procedures, and encouragement of employee awareness and communication of unsafe practices or near misses.\n"
    }
  ]
}