{
  "FacilityID": 1000044595,
  "FacilityName": "Gibbon Packing, LLC.",
  "FacilityStr1": "218 East Highway 30",
  "FacilityStr2": null,
  "FacilityCity": "Gibbon",
  "FacilityState": "NE",
  "FacilityZipCode": "68840",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31019",
  "LEPC": "Buffalo County LEPC",
  "FacilityLatDecDegs": "40.751892",
  "FacilityLongDecDegs": "-98.838007",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 603952581,
  "ParentCompanyName": "American Foods Group LLC",
  "Company2Name": null,
  "CompanyDUNS": 604257738,
  "Company2DUNS": null,
  "OperatorName": "Gibbon Packing, LLC.",
  "OperatorStr1": "P.O. Box 730",
  "OperatorStr2": null,
  "OperatorCity": "Gibbon",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68840",
  "OperatorZipCodeExt": null,
  "FTE": 550,
  "OtherEPAFacilityID": "NED053317087",
  "EPAFacilityID": "100000003916",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-07-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-07-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.75213,
  "FRS_Long": -98.83727,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055129,
      "AltID": "Ammonia",
      "FacilityID": 1000044595,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067183,
          "ProcessID": 1000055129,
          "ChemicalID": 56,
          "Quantity": 32008.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000055974,
          "ProcessID": 1000055129,
          "NAICSCode": "311611",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000046094,
              "Process_NAICS_ID": 1000055974,
              "SafetyReviewDate": "2008-10-14 00:00:00",
              "PHA_Date": "2013-12-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-01-30 00:00:00",
              "TrainingReviewDate": "2014-01-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-12-15 00:00:00",
              "EquipmentInspectionDate": "2014-01-30 00:00:00",
              "EquipmentTested": "Refrigeration system operational parameters",
              "ChangeMgmtDate": "2014-03-18 00:00:00",
              "ChangeMgmtReviewDate": "2011-10-01 00:00:00",
              "PreStartupReviewDate": "2014-03-18 00:00:00",
              "ComplianceAuditDate": "2011-10-01 00:00:00",
              "AuditCompletionDate": "2012-10-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-06-25 00:00:00",
              "HotWorkPermitReviewDate": "2014-01-15 00:00:00",
              "ContractorSafetyReviewDate": "2014-05-30 00:00:00",
              "ContractorSafetyEvalDate": "2014-05-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000055640,
                  "PreventionProgram3ID": 1000046094,
                  "ProcessChemicalID": 1000067183
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000044595,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-03-08 00:00:00",
    "ERTrainingDate": "2014-05-08 00:00:00",
    "CoordinatingAgencyName": "Buffalo County LEPC",
    "CoordinatingAgencyPhone": "3082333225",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044595,
      "SummaryText": "mospheric stability is classified as F (stable).  The results of the worst-case assessment for ammonia show that the plume will travel 1.60 miles (2.58 kilometers) before dispersing to the endpoint concentration of 201 ppm.\r\nThe selected alternative-release scenario for the ammonia systems is a release from a relief valve due to overpressure of a compressor unit.  The largest relief valve in the system was used in this scenario.  The largest relief valve has a relief rate of 57.7 pounds of air per minute.  As a matter of convention, the specified release rate of any relief valve is always in pounds of air per minute.  The release rate of 57.7 pounds of air per minute correlates to a release rate of 41.4 pounds of ammonia vapor per minute.  This release rate was applied to a release from the BAC Tower relief valve located approximately 10 feet above the roof surface.\r\nThe ammonia refrigeration document provides calculated endpoint distances for typical meteorological conditions (3 m/s wind speed, D atmospheric stability, 50% relative humidity).  It has been determined, through a review of Gibbon PackingA¿s operational history, that the total release would likely be 500 pounds or less of ammonia.  Based on the release rate of 41.1 lbs/min, the duration for a 500-pound release is 12 minutes.  Other assumptions include, no active or passive mitigation measures are currently in place and an urban dispersion environment in the near field.  The results of the alternative-release scenario for an ammonia release indicate that the endpoint concentration of 201 ppm is reached at 0.1 miles (160 meters) from the release point.\r\n\r\n\r\n\r\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\r\n\r\nThe Gibbon, Nebraska facility is governed by a set of OSHA and USEPA regulations that require planning and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequences of a release to"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044595,
      "SummaryText": "d safely completed.\r\n\r\n\r\n\r\nFive Year Accident History\r\n\r\nGibbon Packing has not had a release of ammonia that resulted in an OSHA recordable injury within the last five years.\r\n\r\n\r\nEmergency Response Program\r\n\r\nGibbon Packing, LLC. has personnel trained in emergency response at the facility 24 hours per day, seven days per week.  These personnel receive annual training on emergency procedures and response techniques.\r\n\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nGibbon Packing, LLC. completes a thorough review of the ammonia systems each time a design change is implemented.  Gibbon Packing is committed to using these methods to identify and implement ways to improve the safety of these systems. Based  upon this review no current plans are scheduled."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044595,
      "SummaryText": "the employees of the facility, the public and to the environment.  These regulations include:\r\n\t40 CFR Part 68, Accidental Release Prevention\r\n\t40 CFR Part 112, Spill Prevention, Control and Countermeasure\r\n\t40 CFR Part 264, Hazardous Waste Contingency Plan\r\n\t29 CFR Part 119, Process Safety Management\r\n\t40 CFR Part 302, Emergency Planning and Community Right-to-Know Act (EPCRA)\r\n\r\nThe key concepts in Gibbon Packings release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees.  Gibbon Packing has developed and documented these elements in their process safety management plan (PSM).  The PSM plan is incorporated with this document by reference.\r\nEmployee participation in the release prevention program is encouraged and supported by Gibbon Packing management.  Key personnel are responsible for conducting and implementing the findings from the Process Hazard Analysis (PHA) for the ammonia systems.  Gibbon Packing employees are also members of the facility emergency response team.\r\nGibbon Packing's policy is to construct all new equipment, systems, and facilities to ensure the appropriate safety and release prevention systems are included from the beginning of each project.  Gibbon Packing maintains a computerized program of maintenance activities to ensure that key systems are maintained appropriately to minimize the risk of a release.\r\nGibbon Packing, LLC. is committed to providing appropriate training to all employees regarding safety procedures.  Each new employee is provided comprehensive safety training during his or her initial orientation for the facility.  In addition, Gibbon Packing conducts regularly scheduled safety training for all employees each year.  Additional training is provided to maintenance personnel for the systems they are responsible for.  Members of Gibbon PackingA¿s emergency response team receive annual training to ensure that response actions are promptly an"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044595,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\n\r\nAccident Release Prevention Program and Emergency Response Policy\r\n\r\nIt is the policy of the Gibbon Packing, LLC. (Gibbon Packing) facility management to implement the requirements of this Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) program.  The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to Gibbon Packing employees, the public and the environment.  This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.  This plan covers all Gibbon Packing owned activities at this facility.\r\n\r\nGibbon Packing's management is committed to providing the resources necessary to implement this policy.\r\n\r\n\r\nFacility Description\r\n\r\nGibbon Packing operates a cow slaughter, processing, and hide washing facility at this location.  Cows are trucked to the facility, slaughtered and processed.  Gibbon Packing operates rendering systems for dried blood, low protein beef byproducts, and inedible tallow.  Support operations include cold storage and administrative offices.\r\nOne chemical is utilized at the facility in sufficient quantities to be subject to the requirements of 40 CFR Part 68.  This chemical is ammonia and is used as a refrigerant throughout the facility.\r\n\r\n\r\n\r\nWorst-Case and Alternative-Release Scenarios\r\n\r\nRMP regulations require that each facility identify worst-case and alternative case release scenarios.  EPA has defined a worst-case release as the release of the entire contents of the largest vessel that contains a regulated substance in a 10-minute period.  This release rate is then evaluated using modeling techniques and/or reference tables to define the distance to a s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044595,
      "SummaryText": "pecified endpoint (concentration or overpressure).  The distance to the endpoint is affected by several factors including molecular weight, volatility, heat of combustion, and physical setting (urban or rural).\r\nThe alternative release scenario must be one that is more likely to occur than the worst-case scenario and that reaches an endpoint offsite, unless no such scenario exists.  The alternative release scenario is also evaluated to define the distance to the specified endpoint.\r\nUnder 40 CFR 68 Subpart B 68.22(e), the RMP rule identifies surface roughness as a parameter to be used in the hazard assessment to determine the physical setting of the site, urban or rural.  A¿Urban means there are many obstacles in the immediate area; obstacles include buildings or trees.  Rural means there are no buildings in the immediate area and the terrain is generally flat and unobstructed.\r\nDue to the presence of trees, hills, and/or other structures in the immediate vicinity of the Gibbon, Nebraska facility, an urban dispersion environment was assumed.\r\n\r\n\r\n\r\nAmmonia\r\n\r\nThe data provided in the document Risk Management Program Guidance for Ammonia Refrigeration (May 2000) was used to estimate the toxic endpoint distance for the worst-case and alternative ammonia release scenarios.  The ammonia refrigeration document provides calculated endpoint distances for typical meteorological conditions.\r\nThe worst-case release scenario for an anhydrous ammonia release included a release of all the contents of the new accumulator in a 10-minute period (per EPA guidelines).  This release translates to a release of 17,260 pounds of ammonia in 10 minutes or 1,726 pounds per minute (lbs/min).  Other assumptions included in the worst-case assessment are: the ammonia is a liquefied gas; the new accumulator is not diked; the release does not take place indoors; the near field dispersion environment is characterized as urban; 10-minute averaging period; the wind speed is 1.5 meters/sec and the at"
    }
  ]
}