{
  "FacilityID": 1000032480,
  "FacilityName": "Natrium NGL Extraction and Fractionation Plant",
  "FacilityStr1": "14786 Energy Road",
  "FacilityStr2": null,
  "FacilityCity": "Proctor",
  "FacilityState": "WV",
  "FacilityZipCode": "26055",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "54051",
  "LEPC": "Marshall/Wetzel County LEPC",
  "FacilityLatDecDegs": "39.759694",
  "FacilityLongDecDegs": "-80.861722",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.dom.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 78581448,
  "ParentCompanyName": "Dominion Natrium, LLC",
  "Company2Name": null,
  "CompanyDUNS": 116025180,
  "Company2DUNS": 116025180,
  "OperatorName": "Dominion Transmission, Inc.",
  "OperatorStr1": "14786 Energy Road",
  "OperatorStr2": null,
  "OperatorCity": "Proctor",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26055",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000219961",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-05-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-05-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-05-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 39.759694,
  "FRS_Long": -80.861722,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000039653,
      "AltID": "Extraction/Fractionation",
      "FacilityID": 1000032480,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000047653,
          "ProcessID": 1000039653,
          "ChemicalID": 107,
          "Quantity": 3500000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000047652,
          "ProcessID": 1000039653,
          "ChemicalID": 98,
          "Quantity": 7700000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000047654,
          "ProcessID": 1000039653,
          "ChemicalID": 118,
          "Quantity": 3600000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000047655,
          "ProcessID": 1000039653,
          "ChemicalID": 155,
          "Quantity": 3400000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000040639,
              "ProcessChemicalID": 1000047655,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000040640,
              "ProcessChemicalID": 1000047655,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000040641,
              "ProcessChemicalID": 1000047655,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000040642,
              "ProcessChemicalID": 1000047655,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000040643,
              "ProcessChemicalID": 1000047655,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000040638,
              "ProcessChemicalID": 1000047655,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000040056,
          "ProcessID": 1000039653,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000034644,
              "Process_NAICS_ID": 1000040056,
              "SafetyReviewDate": "2012-07-11 00:00:00",
              "PHA_Date": "2012-07-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-12-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-04-16 00:00:00",
              "TrainingReviewDate": "2012-07-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "online",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-07-30 00:00:00",
              "EquipmentInspectionDate": "2013-04-21 00:00:00",
              "EquipmentTested": "PSV 800F",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2012-07-22 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-07-30 00:00:00",
              "HotWorkPermitReviewDate": "2012-07-30 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2012-07-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000040963,
                  "PreventionProgram3ID": 1000034644,
                  "ProcessChemicalID": 1000047654
                },
                {
                  "PrimaryKey": 1000040962,
                  "PreventionProgram3ID": 1000034644,
                  "ProcessChemicalID": 1000047652
                },
                {
                  "PrimaryKey": 1000040964,
                  "PreventionProgram3ID": 1000034644,
                  "ProcessChemicalID": 1000047653
                },
                {
                  "PrimaryKey": 1000040965,
                  "PreventionProgram3ID": 1000034644,
                  "ProcessChemicalID": 1000047655
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000032480,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Washington Lands Fire and Rescue",
    "CoordinatingAgencyPhone": "3048456644",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000032480,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies - Dominion Natrium, LLC is committed to employee, public and environmental safety.  This commitment is demonstrated by the release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at the facility.  It is Dominion's policy to implement appropriate controls to prevent possible releases of regulated substances.  If a release does occur, regular personnel are at hand to control and mitigate the effects of the release.   Also, Dominion has coordinated response activities with the Washington Lands Fire and Rescue Department.  \r\n\r\n2. The Stationary Source and the Regulated Substances Handled - The Natrium extraction and fractionation facility will extract natural gas liquids (NGLs) from a 200 MMSCFD inlet production natural gas stream delivered by pipeline.  The facility is designed to fractionate a total of 60,000 bbl/day of product (C2+) of which 54,000 bbl/day of product is expected from the inlet gas stream and 6,000 bbl/day are estimated to be NGLs imported by truck from other liquids extraction processing facilities nearby.  The product from the extraction/fractionation process includes natural gasoline, propane, isobutane, and normal butane which are sent to dedicated storage tanks.  Propane, isobutane and normal butane are regulated substances present in the process above their threshold quantities (10,000 pounds) for applicability under the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) requirements.  The NGL product is a flammable mixture that meets the NFPA-4 criteria and is present onsite in an amount that exceeds the threshold quantity (10,000 pounds).  Thus, NGL product is also subject to the RMP requirements.\r\n\r\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps - The facility has taken all the necessary steps to compl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000032480,
      "SummaryText": "y with the accidental release prevention requirements, which are set out under 40 Code of Federal Regulations (CFR) Part 68 of the EPA.  This facility is also subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.  The following sections briefly describe the elements of the accidental release prevention program that is in place at this facility.\r\n\r\nProcess Safety Information - Natrium maintains a detailed record of process safety information that describes the hazards of regulated substances, operating parameters and equipment designs associated with all processes.  Much of this information was compiled during the preparation of the Process Hazard Analysis (PHA).  Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).\r\n\r\nProcess Hazard Analysis - The facility conducts comprehensive studies to ensure that hazards associated with the processes are identified and controlled efficiently.  The HAZOP method was used to perform these evaluations.  The studies were undertaken by a team of qualified personnel with expertise in engineering and process operations and will be revalidated at regular intervals of 5 years.  All findings related to the hazard analysis are addressed in a timely manner.\r\n\r\nOperating Procedures - For the purposes of safely conducting activities within the covered process, Natrium maintains written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the process safety.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.  Safe w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000032480,
      "SummaryText": "ork practices have been developed to provide for the control of hazards during operations such as lockout/tagout; confined space entry; opening process equipment or piping; and control over entrance into a stationary source by maintenance, contractor, laboratory, or other support personnel.  These safe work practices apply to employees and contractor employees.\r\n\r\nTraining - A training program is in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Initial training on gas plant operations is provided, and refresher training will be conducted at least every three years or more frequently as needed.  Employee training is documented and records of training will be maintained onsite for at least three years.\r\n\r\nMechanical Integrity - Written procedures are in place for maintaining the on-going integrity of process equipment, which incorporates training for process maintenance activities, inspection and testing, corrective action for equipment deficiencies, and the application of quality assurance measures.  Documented maintenance checks are carried out on process equipment to ensure proper installation and operation.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Qualified and trained personnel carry out maintenance operations at the site.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  The plant also incorporates quality assurance measures to ensure that equipment and parts are suitable for the process application for which they will be used.\r\n\r\nManagement of Change - Written procedures are in place to manage changes in process chemicals, technology, equipment and procedures.  These procedures will be updated as needed.  Process operators, maintenance personnel or any other employee wh"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000032480,
      "SummaryText": "ose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\r\n\r\nPre-startup Reviews - Pre-startup safety reviews related to new processes and to modifications in established processes will be conducted as a regular practice at Natrium.  These reviews are conducted to confirm that construction and equipment is in accordance with design specifications, and safety, operating, maintenance, and emergency procedures are suitable for safe startup prior to placing equipment into operation.\r\n\r\nCompliance Audits - Regularly scheduled audits will be conducted to determine whether the provisions set out under the RMP rule are being implemented.  These audits will be carried out by at least one person knowledgeable in the process and conducted at least once every three years.  Audit findings will be documented in a report and corrective actions required from the audits will be undertaken in a safe and prompt manner and documented.\r\n  \r\nIncident Investigation - Any incident that results in, or could reasonably result in a catastrophic release of a regulated substance will be promptly investigated.  An incident investigation will be initiated as promptly as possible, but no later than 48 hours after the incident, and will involve at least one person knowledgeable of the process involved.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  A report will be prepared at the conclusion of the investigation and will include any resolutions and corrective action. \r\n \r\nEmployee Participation - Dominion believes that PSM and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, employees have access to all information created as part of the facility's implementation"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000032480,
      "SummaryText": "of the RMP rule, including information resulting from process hazard analyses in particular.\r\n\r\nHot Work Permit - Hot work permits for hot work operations conducted on or near a covered process will be issued by facility safety leaders.  The permit shall document that the fire prevention and protection requirements have been implemented prior to beginning the hot work operations; it shall indicate the date(s) authorized for hot work; and identify the object on which hot work is to be performed.  The permit will be kept on file until completion of the hot work operations.\r\n\r\nContractors - Dominion hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Before any contractors are allowed to work on the Natrium facility, they undergo an orientation conducted by the PSM team.  During this orientation contractors are made aware of the known potential hazards related the contractor's work, the hazards of regulated substances, the safe work procedures insisted on by Dominion, and familiarized with the Hot Work Permit Policy and the Lock Out/Tag Out Procedures used at Natrium.  Contractors are informed of all the procedures for emergency response should an accidental release of a regulated substance occur, and this information includes evacuation routes and assembly points.  Dominion will document that the contractor has received and understands the training.\r\n\r\nChemical Specific Prevention Steps - The processes at Natrium have hazards that must be managed to ensure continued safe operation.  Safety features applicable to prevention of accidental releases of regulated substances at the facility are in place to help prevent potential accidental scenarios that could be caused by equipment failures and human error.  The facility utilizes safety features on many units to help minimize/control a release, quickly detect a release (e.g., flame"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000032480,
      "SummaryText": "and gas detectors with alarms), and reduce/mitigate the consequences of a release (e.g., fire suppression and extinguishing).\r\n\r\n4. Five-year Accident History - The Natrium facility is a new facility with no history of accidents.\r\n\r\n5. Emergency Response Program - The facility has coordinated emergency response activities with the Washington Lands Fire and Rescue Department.  The facility has a written emergency plan to deal with accidental releases of regulated substances which is in place to protect worker and public safety, as well as the environment.  The plan includes actions to be taken including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.  Employees receive training in emergency procedures.  To ensure proper functioning, the emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within the processes that would require a modified emergency response.  The emergency response activities have been coordinated with the Marshall/Wetzel County Local Emergency Planning Committee (LEPC).\r\n\r\nOn May 12, 2009, Senate Bill 279, entitled Emergency Response Regulations, more commonly known as the Fifteen Minute Rule was signed into law. The bill amends the Code of West Virginia, Chapter 131, adding new provisions that will require RMP subject industrial facilities (among others) to provide certain information to state and local emergency responders within 15 minutes of an accident or emergency. Local emergency responders must be provided information related to public health, safety and welfare regarding hazardous waste or material releases.\r\n\r\n6. Planned Changes to Improve Safety - Natrium will continue to look for ways to continually improve safety at the facility."
    }
  ]
}