{
  "FacilityID": 1000018276,
  "FacilityName": "BC Systems King City",
  "FacilityStr1": "600 Airport Dr",
  "FacilityStr2": null,
  "FacilityCity": "King City",
  "FacilityState": "CA",
  "FacilityZipCode": "93930",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36.225833",
  "FacilityLongDecDegs": "-121.125833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 154483457,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BC Systems King City",
  "OperatorStr1": "950 E. Blanco Rd",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jaime Britt",
  "RMPTitle": "Global (EHS) Manager",
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000213253",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-10-25 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-11-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-11-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-11-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-08-22 00:00:00",
  "DeRegistrationEffectiveDate": "2016-04-05 00:00:00",
  "AnniversaryDate": "2015-11-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000022410,
      "AltID": "Cooling Perishable Food",
      "FacilityID": 1000018276,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000022692,
          "ProcessID": 1000022410,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000026528,
          "ProcessID": 1000022410,
          "ChemicalID": 56,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000526528,
          "ProcessID": 1000022410,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000018276,
      "SummaryText": "Executive Summary\nAccidental Release Prevention and Emergency Response Policies\nBC Systems is committed to maintaining a safe work environment. The Plant Engineer for the BC Systems King City site ensures that safe practices are followed in operations involving hazardous materials. This site has established emergency procedures. The BC Systems King City emergency personnel will coordinate with the local Fire Department to ensure rapid and appropriate response to hazardous material emergencies, which include response to emergencies related to the ammonia refrigeration system covered by this RMP/PSM Program. The site has written evacuation, reporting, and response procedures in place to protect BC Systems employees, the public, and the environment in the event of an ammonia release. \nStationary Source and Regulated Substance\nThe BC Systems facility covered by this RMP is to be located at 600 Airport Road in King City, California. The facility receives produce to be processed and packaged for consumer use in various salad mixes. The produce is kept for short-term storage, transported and distributed from the site.\nThe regulated substance is anhydrous ammonia. One fixed ammonia refrigeration system is used for refrigerating produce at various temperatures. The total charge to this refrigeration system is estimated at 8,400 pounds of anhydrous ammonia. Since the amount of ammonia in the system is equal to the RMP and PSM Program threshold quantity of 8,400 pounds, the process that uses the ammonia is covered by the RMP/PSM Program requirements.\nPortable Sources and Regulated Substance\nThere are 3 portable units stationed at this facility identified as RC3, RC4 & RC9 covered by this RMP located at 600 Airport Road in King City, California. The facility receives produce to be processed and packaged for consumer use in various salad mixes. The produce is kept for short-term storage, transported and distributed from the site.\nThe regulated substance is anhydrous ammonia. Thr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000018276,
      "SummaryText": "ee portable ammonia refrigeration systems are used for refrigerating produce at various temperatures. The total charge for RC3 is 3,500 pounds; RC4 contains 3,600 pounds; and RC9 contains 1,500 pounds of anhydrous ammonia. Since the amount of ammonia in each portable unit is equal to the RMP and PSM Program threshold quantity of 8,900 pounds, the process that uses the ammonia is covered by the RMP/PSM Program requirements.\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\nPrevention of accidental ammonia releases at BC Systems is accomplished through sound industry practice in the original system design and construction, the specification and review of system modifications prior to their occurrence, and the regular operation, maintenance and monitoring of the system. This includes:\nA?    Compliance with industry standards and codes in effect at the time of initial construction of the system, as well as in the event of system modifications through a management of change process.\nA?    Performance of a Process Hazard Analysis (PHA) at least once every five years using accurate process safety information.\nA?    Implementation of operating, maintenance and monitoring procedures. \nA?    Training of system operations and maintenance personnel, as well as ongoing training of the on-site Chemical Response Team. \nA?    Performances of preventive and corrective maintenance according to system component manufacturer recommendations and pursuant to hot work permit program requirements to ensure mechanical integrity.\nA?    Application of established auditing, inspection, and pre-start-up review protocols.\nA?    Use of qualified contractors for work on the system.\nThe detailed Prevention Program for this system is contained in a supporting document, which is to be maintained at by the site by the Plant Engineer.\nFive Year Accident History\nThis is a new installation of an ammonia refrigeration system. Therefore, no ammonia releases resulting in on-site or off-site injuries, "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000018276,
      "SummaryText": "deaths, or property damage, or off-site environmental damage, evacuations, or sheltering in place have occurred. \nEmergency Response Program\nThis facility has established emergency procedures and coordinates with the local Fire Department to ensure rapid and appropriate response to hazardous material emergencies, which include response to emergencies related to the ammonia refrigeration system covered by this RMP/PSM Program. \nThe Emergency Response procedures are accessible at the site, and copies are maintained in the King City Plant Engineer's files. The document describes response procedures for various emergency scenarios, including the mitigation of hazardous material releases, agency notification procedures in the event of a hazardous material release, and emergency equipment available at the site. \nPlanned Changes to Improve Safety\nBased on the process hazard analysis studies conducted for the system, which are contained in a separate document, the following consolidated list of actions were identified to ensure safe operation of the ammonia refrigeration system.\n#    Recommended Follow Up Actions    PHA Table\nItem #    Individual Assignee    Due Date /\nStatus\n    System-Wide\n1.        Develop and implement 5-year replacement schedule for all PRVs.    3, 5, 17, 20, 23, 25, 27, 30, 31,        Carlos Malvarez        Completed\n2.        Ensure that operator training is conducted and documented as required.    10, 17, 20, 30, 31, 33,          Trinidad Ramirez / Edgar Barba        Completed\n3.        Develop and implement process for periodic inspection of all piping and vessels for integrity.    19        Carlos Malvarez        Completed\n4.        Develop and implement mechanical integrity standard operating procedures (e.g., regular walk through and inspections)    7        Carlos Malvarez / Trinidad Ramirez / Edgar Barba         Completed\n5.        Ensure that hot work permit program is developed and implemented at site.    44        Carlos Malvarez        Completed\n    Node 1:  High Pressure Receiver\n6.        Determine whether manual bypass is permitted; if so, establish and communica"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000018276,
      "SummaryText": "te written procedures.    1        Carlos Malvarez        Completed\n7.        Update drawing R4.1 to show isolation valves.    5        Wes Beebe        Completed\n8.        Develop and implement operating procedure for oil pot drainage.    5        Carlos Malvarez        Completed\n    Node 2:  Compressors\n9.        Develop and implement a procedure to verify oil level on a daily basis.    9        Carlos Malvarez        Completed\n10.        Develop and implement a PM procedure for oil pot and filter change out.    12        Carlos Malvarez        Completed\nNode 3:  Evaporative Condenser\n11.        Develop and implement process for conducting inspections, monitoring and maintenance of condenser.    Human Factors, 27, 28        Carlos Malvarez        Completed\n12.        Develop and implement procedures for ensuring water or air is not in the system.    20        Carlos Malvarez        Completed\n13.        Develop and implement procedure for daily inspection of condenser.    23, 25, 27, 28        Carlos Malvarez        Completed\n14.        Develop and implement a process for conducting routine water level checks.    24        Carlos Malvarez        Completed\n15.        Ensure emergency procedures are developed and implemented for wastewater discharges.    24        Carlos Malvarez        Completed\n16.        Add float valve for city water supply. (make up water back up)    25        Carlos Malvarez        Cancelled\nNode 4:  High Pressure Receiver and Thermosyphon Receiver\n17.        Develop and implement an unloading procedure for ammonia.    33        Edgar Barba        Completed\n18.        Develop and implement process for conducting daily inspections of HPR.    34        Carlos Malvarez        Completed\nNode 5:  Diffusion Tank\n19.        Verify that diffusion tank is protected from physical damage.    Sitting Issues,         Carlos Malvarez        Completed\n20.        Develop and implement a process to monitor tank water level daily.    Previous Incidents and Near Misses, 37        Carlos Malvarez        Completed\nNode 6:  Fan Coils\n21.        Verify that forklift height is limited so that piping and coils cannot be hit.    Sitting Issues,        Carlos Malvarez        Cancelled\n22.        Develop and implement process to insure hot gas defrosts is working through visual inspections.    39        Carlos Ma"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000018276,
      "SummaryText": "lvarez        Completed\n23.        Develop and implement process for daily visual inspection of fan coil system piping.    40        Carlos Malvarez        Completed\n24.        Add battery back up to motorize makeup ball valve to low pressure receiver    41        Carlos Malvarez        Cancelled\n25.        Include inspection for combustibles in daily inspections.    44        Trinidad Ramirez / Edgar Barba        Completed\nNode 7:  General System \"What-If\" Analysis \n26.        Ensure that BC Systems ammonia loading procedure is developed and implemented. Procedure includes BC Systems supervision of ammonia supplier loading.    49        Edgar Barba        Completed\n\n\n"
    }
  ]
}