{
  "FacilityID": 1000108385,
  "FacilityName": "CS-5 Recovered Energy Facility",
  "FacilityStr1": "10510 11th Street, SW",
  "FacilityStr2": null,
  "FacilityCity": "Manning",
  "FacilityState": "ND",
  "FacilityZipCode": "58642",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38025",
  "LEPC": "Dunn County LEPC",
  "FacilityLatDecDegs": "47.255880",
  "FacilityLongDecDegs": "-102.718201",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "assetmanagment@ormat.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "OREG-2, Inc.",
  "Company2Name": "Ormat Nevada, Inc.",
  "CompanyDUNS": 929315661,
  "Company2DUNS": null,
  "OperatorName": "OREG 2, Inc.",
  "OperatorStr1": "6140 Plumas Street",
  "OperatorStr2": null,
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89519",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000204566",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-05-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-05-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-05-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 47.251575,
  "FRS_Long": -102.7194,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000135451,
      "AltID": "1",
      "FacilityID": 1000108385,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000169933,
          "ProcessID": 1000135451,
          "ChemicalID": 125,
          "Quantity": 67662.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000136925,
          "ProcessID": 1000135451,
          "NAICSCode": "221118",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000116938,
              "Process_NAICS_ID": 1000136925,
              "SafetyReviewDate": "2013-10-31 00:00:00",
              "PHA_Date": "2019-08-05 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-08-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "FM-200 Suppression System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-05-01 00:00:00",
              "TrainingReviewDate": "2023-11-13 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-11-16 00:00:00",
              "EquipmentInspectionDate": "2023-04-27 00:00:00",
              "EquipmentTested": "Semi-annual and annual maintenance: vaporizer/condenser - level and pressure transmitters, feed pump - flow, temperature and pressure transmitters. Pentane system control valve operation. All support",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2018-02-10 00:00:00",
              "PreStartupReviewDate": "2012-11-11 00:00:00",
              "ComplianceAuditDate": "2024-01-18 00:00:00",
              "AuditCompletionDate": "2024-08-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2011-02-01 00:00:00",
              "HotWorkPermitReviewDate": "2013-06-02 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2013-02-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000146757,
                  "PreventionProgram3ID": 1000116938,
                  "ProcessChemicalID": 1000169933
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000108385,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-06-20 00:00:00",
    "ERTrainingDate": "2018-09-01 00:00:00",
    "CoordinatingAgencyName": "West Dunn Fire Protection District",
    "CoordinatingAgencyPhone": "7017646043",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000108385,
      "SummaryText": "e Plant Manager. If the Plant Manager is not reached in a timely manner the parent company, Ormat Nevada Inc. will be notified on the 24-hour phone number 775-852-1912. If a fire is detected, the monitoring staff will notify local emergency personnel including the fire and police departments.\n\nNotification of Norther Pipeline Personnel:\nAny Northern Border Pipeline personnel which may be at the site during the alarm condition must also be notified through Northern Border Pipeline procedures. Northern Border Pipeline personnel do not respond to alarm conditions at CS-5."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000108385,
      "SummaryText": "trical hazards that could cause serious personal injuries and costly property damage if safety procedures are not fol1owed. Safety training, conducted monthly and required of all employees, identifies the different hazards to be found on the sites. These subjects include electrical safety, fire prevention and protection, lock out and tag out procedures, hazard communication, gas detectors, fire panels, personal protective equipment, and the safe use of tools and equipment. Safety training is supplemented by the use of the Industrial Hygiene and Standard safety procedures Manuals.\n\n\n\nProcess Hazard Analysis\n\nOREG2 utilized personnel experienced in organic Rankine power cycles to perform a hazard analysis appropriate to the complexity of the process for identifying, evaluating, and controlling hazards involved in the process. A Hazop analysis supplemented with what if/checklist was selected and utilized.\n\nThe process hazard analysis were conducted/revalidated in 2008, 2009, 2014, and 2019. The 5 year PHA revalidation is scheduled for 2024.\n\nAccident History\n\nOREG2 CS-5 REG facility has not had any reportable accidents.\n\nEmergency Response Plan\n\nCS-5 personnel are trained to recognize emergencies, mitigate the emergency to the extent possible, and notify local emergency responders and Northern Border Pipeline personnel. Plant personnel do not fight pentane fires. Upon detection of a pentane fire, personnel are instructed to initiate automatic shutdown of the process which removes heat, closes isolation valves, and depressurizes equipment. CS-5 and Northern Border Pipeline personnel are then alerted of the need to evacuate the site. Responding fire department personnel assume incident command upon arrival. \n\nCallout protocol\nIf any of the following alarm conditions are indicated by the CS-5 monitoring system, the call-out protocol must be followed: OEC failure, security/fire alarm trip. If any of these events should occur the monitoring staff will immediately contact th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000108385,
      "SummaryText": "uterized Maintenance Management software (CMMS) program. This CMMS contains information on all equipment in the facility requiring maintenance, inspections, testing, certification, and calibration.. Recognized and generally accepted good engineering practices, manufacturer's recommendations, and operations experience have been utilized to produce a comprehensive maintenance work order system that produces maintenance requests at appropriate frequencies. Employees report any equipment deficiencies  and generate work orders for the repair or assessment of the problem. Routine comprehensive inspections are performed using checklists. \n\nStandard Operating Procedures:\nOperating procedures are developed to address plant startup, shutdown, normal operation, monitoring, and emergency shutdown.\n\nSafety Systems:\nThe principal methods of accident prevention include equipment design safeguards, written procedures, and operator training. Safety systems are present in the plant that provide alarms and control interlocks to place the process in a safe state. High pressure safety systems are one such example. An initial alarm alerts the control room operator both audibly and visually of the pressure rise. This initial alarm affords the operator the opportunity to take some corrective action. If the pressure rise continues unabated, automatic shutdown of select process equipment is initiated to mitigate the problem. If the initial alarm and subsequent shutdown fail to mitigate the pressure rise, pressure safety valves are in place to relieve the pressure safely to atmosphere or to larger volume, lower pressure, systems. Another safety system component is the combustible gas detection system. Sensors are strategically located in each plant. Control Room audio and visual alarms annunciate concentrations of concern. There are also cameras that can be used to monitor and view possible issues. \n\n\nTraining: some equipment in the OREG2 facilities poses potential fire, explosion, and elec"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000108385,
      "SummaryText": "ively isolated area surrounded by farmland. The facility is approximately 11 km south-southeast of Killdeer, and about 5 km northeast of Manning, ND. Examination of topographic maps, aerial photographs, and visual observation of the potentially affected area in a worst-case scenario did not identify any residential structures or parks. However, this facility is adjacent to the compressor station that provides the heat source and this station is within the affected area. The compressor station staff is not employed by Ormat, nor does Ormat control their access to the compressor station. Given this proximity to public receptors, this facility cannot qualify for an RMP program level 1. In the initial RMP submittal, compressor station employees were not considered public receptors; hence, a program level 1 was designated. Although program level 1 was initially designated, the OREG always had a program level 3 prevention program in place and are now registered as a program level 3 facility.\n\nAlternate Case Scenario Description\n\nThe alternate case scenario is based on a pool fire.  The pool is formed upon a hose rupture that occurs during tanker truck offloading to the pentane storage tank. It is very conservatively assumed that it takes approximately 10 minutes to stop the flow.\nEnd Point Distance: 0.1 miles\nConsequence Analysis: Calculated by RMP*Comp\n______________________________________________\n\nResults of Consequence Analysis\nChemical: Pentane\nCAS #: 109-66-0\nCategory: Flammable Liquid\nScenario: Alternate Case\nQuantity Released: 1,020 lbs/minute over 10 minutes\nRelease Type: Pool Fire\nEstimated Distance to heat radiation of 5 kw/sq. meters: 0.1 miles (0.2 kilometers)\n\n --------Assumptions About This Scenario-------- \nWind speed: 3.0 meters/second (6.7 miles/hour)\nStability Class: D\nAir Temperature: 77 degrees F (25 degrees C)\n______________________________________________\n\nPrevention Program Description\n\nSafety Information:\n\nMaintenance procedures: \nOrmat has a Comp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000108385,
      "SummaryText": "nt, pentane unloading system, vapor recovery system, evacuation system and non-condensable removal system. Each section is protected by pressure relief systems that may include pressure safety valves, pressure control valves, control system shutdown, intervention logic, and administrative practices.\n\nQuantities Handled or Stored\n\nThe pentane is normally found in both the operating and static portions of the process. When in operation, most of the pentane is found in the working binary process. There is some additional pentane present in the connected storage tank. For the purpose of defining registration quantities, a fully charged operating system is assumed plus a storage tank that is ½ full. The basis for the registration quantities is as follows:\n\nFacility Name\tBinary Process Inventory (lbs)\tStorage Tank Inventory (lbs)\tTotal Inventory and Registration Quantity (lbs)\nCS-05\t49,287\t24,837\t74,124\n\nWorst Case Scenario Description\n\nWorst case scenario is based on a vapor cloud explosion. Although safeguards are in place, that makes a worst case scenario extremely unlikely, it was assumed the explosion originates at a full pentane storage tank, which represents the largest single container onsite.  The tank is assumed to be filled to 90% of water capacity. ______________________________________________\n\nEnd Point Distance: 0.3 miles\nConsequence Analysis: Calculated by RMP*Comp\n\nResults of Consequence Analysis\nChemical: Pentane\nCAS #: 109-66-0\nCategory: Flammable Liquid\nScenario: Worst-case\nQuantity Released: 44,699 lbs\nRelease Type: Vapor Cloud Explosion\nEstimated Distance to 1 psi Overpressure: 0.3 miles (0.5 kilometers)\n\n --------Assumptions About This Scenario-------- \nWind speed: 1.5 meters/second (3.4 miles/hour)\nStability Class: F\nAir Temperature: 77 degrees F (25 degrees C)\n______________________________________________\n\nThe RMP comp model is a conservative screening tool and may overestimate distances to endpoint.\n\nOREG2 CS-5 REG facility is located in a relat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000108385,
      "SummaryText": "he thermal oil passes through the thermal oil surge tanks and the thermal oil feed pumps, which discharge it into the WHOH. The power from this project is sold to Basin Electric Power Cooperative based in Bismarck, ND.\n\nThe basic Rankine cycle model consists of four components:\n1. Pump -Work Input\n2. Waste Heat Boiler -Heat Input\n3. Turbine -Work Output\n4. Condenser -Heat Rejection\n\nThe Rankine cycle consists of pressurizing a liquid (pentane), vaporizing the high-pressure liquid, expanding the high-pressure vapor and condensing the low-pressure vapor for reuse in the closed loop process. The energy necessary for the vaporization is provided by thermal oil at a maximum temperature of 572°F. The thermal energy is transferred to the pentane working fluid via tube and counter-current shell heat exchangers. The OREG2 facility uses a commercial pentane with a dry cooling heat rejection system.\n\nPrimary Activities \n\nWaste thermal energy is converted to electric power. The facility is rated at 6000 KW. The net power output to the electrical grid is rated at 5100 KW. Power output is reduced in warm weather due to limitations of the air cooled heat exchangers.\n\nUse of Regulated Substance\n\nPentane, a flammable vapor/liquid is used as a binary working fluid. Liquid pentane is pumped from a condenser to shell and tube heat exchangers. Thermal energy provided by thermal oil is transferred to the pentane. The thermal oil heat input causes the pentane to change physical states from liquid to high pressure superheated vapor that is passed through a turbine to produce electric power. The vapor is condensed and recycled back to a pressurized liquid recuperator vessel to complete the Rankine cycle. A pentane storage tank is available for makeup. The facility design is segregated into multiple sections, each having its own design specifications dictated by the pentane conditions in that section. The sections include: the low pressure process equipment, the high pressure process equipme"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000108385,
      "SummaryText": "Risk Management Plan Executive Summary\n\nDescription of Corporate Prevention and Emergency Response Approach\n\nThis OREG 2, Inc. (OREG2 ) Recovered Energy Generation (REG) facility complies with numerous standards for pressure vessel design and testing as well as all Federal and North Dakota process safety management requirements. It is our policy to adhere to all applicable federal, state, and local laws. Copies of emergency response, process hazard analyses, process safety management plans, and all technical drawing (P&IDS) for process equipment are maintained onsite for reference. Regular inspection and testing of the pentane and thermal oil systems are performed to ensure equipment integrity is maintained. The facility is equipped with a network of leak detection equipment, automatic shutdown logic controls, insulation, safety relief valves, and fire detection monitors. OREG2 provides high levels of training in operating procedures, safety and emergency response. If an emergency were to occur, it is our policy to implement the emergency response procedures to mitigate damages, and to notify the nearest fire department and request their assistance.\n\nDescription of Stationary Source\n\nThe OREG2 power units are fueled by waste heat from a compressor turbine exhaust that is transferred from thermal energy into mechanical energy. This is accomplished by utilizing the organic Rankine cycle technology. The hot gases of the turbine exhaust flow through a Waste Heat Oil Heater (WHOH), where the heat from the gases is transferred to a thermal oil heat transfer fluid. The thermal oil is then circulated to the shell and tube vaporizer of an Ormat Energy Converter (OEC). The motive fluid on the shell side is vaporized and these vapors drive a special organic fluid turbine. This turbine drives a generator which produces grid compatible power. The motive f1uid then passes through a heat exchanger and enters the cycle again as a liquid. After exiting the various heat exchangers, t"
    }
  ]
}