{
  "FacilityID": 1000005999,
  "FacilityName": "Kingsburg Cogeneration Facility",
  "FacilityStr1": "11765 Mountainview",
  "FacilityStr2": null,
  "FacilityCity": "Kingsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "93631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.539188",
  "FacilityLongDecDegs": "-119.580026",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 965412935,
  "ParentCompanyName": "KES Kingsburg L.P.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "KES Kingsburg, L.P.",
  "OperatorStr1": "11765 Mountainview",
  "OperatorStr2": null,
  "OperatorCity": "Kingsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93631",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": "Cal000073539",
  "EPAFacilityID": "100000121343",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-12-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-05-24 00:00:00",
  "DeRegistrationEffectiveDate": "2023-05-04 00:00:00",
  "AnniversaryDate": "2014-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.546786,
  "FRS_Long": -119.579425,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007042,
      "AltID": "Ammonia Injection System",
      "FacilityID": 1000005999,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000007884,
          "ProcessID": 1000007042,
          "ChemicalID": 56,
          "Quantity": 57000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000007168,
          "ProcessID": 1000007042,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000005516,
              "Process_NAICS_ID": 1000007168,
              "SafetyReviewDate": "2008-12-30 00:00:00",
              "PHA_Date": "2008-10-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-06-18 00:00:00",
              "TrainingReviewDate": "2008-02-25 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-02-25 00:00:00",
              "EquipmentInspectionDate": "2008-04-30 00:00:00",
              "EquipmentTested": "Major equipment of the system.",
              "ChangeMgmtDate": "2004-04-15 00:00:00",
              "ChangeMgmtReviewDate": "2008-09-07 00:00:00",
              "PreStartupReviewDate": "2008-09-07 00:00:00",
              "ComplianceAuditDate": "2008-09-07 00:00:00",
              "AuditCompletionDate": "2009-12-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-03-02 00:00:00",
              "HotWorkPermitReviewDate": "2009-03-02 00:00:00",
              "ContractorSafetyReviewDate": "2009-03-02 00:00:00",
              "ContractorSafetyEvalDate": "2009-03-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000006399,
                  "PreventionProgram3ID": 1000005516,
                  "ProcessChemicalID": 1000007884
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000005999,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-03-02 00:00:00",
    "ERTrainingDate": "2009-03-31 00:00:00",
    "CoordinatingAgencyName": "Fresno County Health Department",
    "CoordinatingAgencyPhone": "5594453271",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000005999,
      "SummaryText": "Accidental Release Prevention\nKingsburg Cogeneration Facility has developed a risk management program and an emergency response plan to address California Accidental Release Prevention (CalARP) Program requirements (California Code of Regulations, Title 19, Division 2, Chapter 4.5, Â§2735-2785) in June 1999. Kingsburg Cogeneration Facility is extremely diligent in the handling of all chemicals and is dedicated to the safety of its employees and the neighboring community. The facilityÂ¿s staff is highly trained and utilizes modern equipment to monitor the facility and provide safeguards, while effectively and safely using ammonia for controlling NOx emissions. \n\nKingsburg Cogeneration Facility has a long standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Ammonia Injection System. Kingsburg Cogeneration FacilityÂ¿s policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. \n\nStationary Source and Regulated Substance \nKingsburg Cogeneration Facility is a combined cycle cogeneration plant located at 11765 Mountainview, Kingsburg, CA 93631.  The total facility covers about 1.8 acres of land and includes, in addition to the cogeneration (plant), which occupies an area of approximately 50,000 square feet (sq. ft), a sugar concentration process totaling approximately 26,000 sq. ft.  \n\nThe construction of the facility began in fall 1990 on SunMaid Growers of California (SunMaid) property.  The transportation routes near the facility include Mountainview to the north, Bethel Avenue to the east, which also provides the access road and entrance to the facility, and California Route 99 immediately to the west.  The elevation of Route 99 is approximately that of the facility ground level.\nThe plant produces electrical power, and supplies steam for operation o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000005999,
      "SummaryText": "f the concentrator process as well as the thermal host's processes.  The remaining electrical power, after satisfying the facility auxiliary energy needs, is sold to Pacific Gas and Electric Company (PG&E).  The plant supplies energy for cogeneration by sending steam to the concentrator process as well as supplying process steam to the thermal host.  The equipment and systems have been selected or designed specifically for the Kingsburg facility.  The plant produces a net maximum electrical output of 34.5 megawatts (MW) while supplying all necessary steam to support operation of the multiple processes.\n\nThe regulated substance manage at the Facility is anhydrous ammonia.  The maximum intended inventory is 57,000 lbs of anhydrous ammonia and it is stored at the facility for emissions control.  Routine deliveries of anhydrous ammonia transported to the facility when it is necessary to refill the storage tank.  The anhydrous ammonia stored on site is used for controlling concentration of oxides of nitrogen (NOx) in the combustion flue gas from the boiler unit.  This solution is volatilized into anhydrous ammonia vapor prior to injection into the boiler.  The anhydrous ammonia is consumed by the selective catalytic reduction (SCR) system to convert NOx emissions into nitrogen and water.\n\nHazard Assessment Summary/Offsite Consequence Analysis \n\nWorst-Case Release Scenario Results Summary\nScenario Description: Per the CalARP Regulations, one worst-case analysis has been defined and modeled for the ammonia injection system.  The results can be found in the Hazard Assessment documentation located behind the Tab 2 of the CalARP Submittal Binder.\nAlternative Release Scenario Results Summary\nScenario Description: Two alternative release scenarios were modeled. The results can be found in the Hazard Assessment documentation located behind the Tab 2 of the CalARP Submittal Binder.\n\nRisk Considerations\nAlthough the storage and use of anhydrous ammonia has inherent potential risks"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000005999,
      "SummaryText": ", and worst-case release scenarios can potentially reach the community; Kingsburg Cogeneration Facility has recognized these potential risks and structured its safety programs to make the worst case type of event non-credible.  In addition to the safety practices of the company and plant personnel to make this worst-case event non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event (e.g., In the event of a release, sudden rupture and flashing of ammonia would be highly turbulent. Turbulence causes entrainment of air and the released vapor dilutes much more quickly than is shown in the model).\n\nIn addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with an ammonia release:\n\nÂ¿Automatic / Manual Shutdown\nÂ¿Ammonia Detection and Alarms\nÂ¿Deluge System\n\nThe history of the Kingsburg Cogeneration Facility (i.e., no CalARP-applicable ammonia releases) reflects the adequacy of the design and diligence of the plant staff in safely operating the Ammonia Injection System.\n\nAccidental Release Prevention Program \nAs part of the implementation of this CalARP Program, key Prevention Program elements were documented and implemented by Kingsburg Cogeneration Facility to manage process safety issues associated with the use of ammonia for the NOx abatement system.  Furthermore, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being performed.\n\nThe facility maximum intended inventory of anhydrous ammonia is 57,000 lbs.  Therefore, the regulated substance is over the 10,000 lbs threshold for EPA RMP and the Cal/OSHA PSM threshold quantities and over the 500 lbs state threshold for California Accidental Release Preventio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000005999,
      "SummaryText": "n (CalARP) Program.  As a result, the anhydrous ammonia covered process is subject to CalARP Program Level 3, EPA RMP Program Level 3 Cal/OSHA PSM.\n\nThe Anhydrous Ammonia Prevention Program 3 elements include:\n\nÂ¿Process Safety Information\nÂ¿Process Hazard Analysis\nÂ¿Operating Procedures\nÂ¿Training\nÂ¿Mechanical Integrity\nÂ¿Management of Change\nÂ¿Pre-Startup Safety Review\nÂ¿Compliance Audits\nÂ¿Incident Investigation\nÂ¿Employee Participation\nÂ¿Hot Work Permit\nÂ¿Contractors\n\nIn addition, key emergency response elements were addressed in the Business Emergency Plan. See EMERGENCY RESPONSE PROGRAM below.\n\nFive-Year Accident History \nThere have been no CalARP-applicable releases of ammonia at Kingsburg Cogeneration Facilityin the past five years.\n\n\nEmergency Response Program\nThe Emergency Response Plan consists of elements including applicability to specific emergencies, outlining of responsibilities, and symptoms and indications of various emergencies.  It also contains immediate and supplementary actions to be taken.  These actions are identified in outline form, supplemented with precautions to be considered during the response.  Each procedure also contains an emergency call list specific to the response.  Site personnel, business neighbors, site ownership and regulators are included in the call list, as are medical contacts.  Site personnel are trained annually on all emergency response procedures, and the contact lists are reviewed on a monthly basis.\n\nExternal Events Analysis Information\nPursuant to the requirements of California Health & Safety Code, Title 19, Division 2, Chapter 4.5, Â§2745.7(q); the following external events analysis information shall be submitted:  \n\nÂ¿The types of natural and human caused external events considered in PHA Section 2760.2 or Hazard Review Section 2755.2.  \n\n-During the December 2007 PHA a broad list of external events was considered by the Team.  General events external to the plant that can conceivably cause a release of ammoni"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000005999,
      "SummaryText": "a were addressed.  The External Events that were considered credible include, but are not limited to, earthquake, vandalism, sabotage, external fire, human error/misoperation, and vehicle impact.\n\nÂ¿The estimated magnitude or scope of external events which were considered. If not known, the owner or operator of the stationary source shall work closely with the AA to determine what is required. If seismic events are applicable, the parameters used in the consideration of the seismic analysis and which edition of the Uniform Building Code was used when the process was designed.\n\n-The magnitudes of the external events considered are detailed within the PHA Worksheets and were qualitatively risk-ranked by the PHA Team.\n\nÂ¿For each external event, with a potential to create a release of a regulated substance that will reach an endpoint offsite, apply \n\n1)The expected date of completion of any changes resulting from the PHA;\n2)Major hazards identified;\n3)Process controls in use;\n4)Mitigation systems in use;\n5)Monitoring and detection systems in use; and,\n6)Changes since the last Hazard Review (HR) or PHA\n\n-Refer to Section 7.4 of the RMP*Submit 2004 Printout for the required PHA information.\n\nÂ¿The date of the most recent field verification that equipment is installed and maintained as designed.\n\n-The most recent field verification of equipment was conducted April 2009 and included the major equipment of the process.\n\nPlanned Changes To Improve Safety \nThe Process Hazard Analysis (PHA) study has been conducted to examine mitigation measures to improve safety at the facility.  Planned changes to improve safety are listed as recommendations in the December 10th, 2007 PHA Report.  Any outstanding recommendations will be addressed by December 2009.\n\nFlammables: Worst Case \nThe use of flammable materials at Kingsburg Cogeneration Facility is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable. \n\nFlammables: Alternative Re"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000005999,
      "SummaryText": "lease \nThe use of flammable materials at Kingsburg Cogeneration Facility is not encompassed by either the federal or state RMP requirements.  Therefore, this section is not applicable."
    }
  ]
}