{
  "FacilityID": 1000059144,
  "FacilityName": "SYSCO Jackson LLC",
  "FacilityStr1": "4400 Milwaukee Street",
  "FacilityStr2": null,
  "FacilityCity": "Jackson",
  "FacilityState": "MS",
  "FacilityZipCode": "39209",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28049",
  "LEPC": "Hinds Co. Emergency Management",
  "FacilityLatDecDegs": "32.338784",
  "FacilityLongDecDegs": "-090.243812",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sysco.com",
  "FacilityEmailAddress": "hochstetler.beth@corp.sysco.com",
  "FacilityDUNS": 98174592,
  "ParentCompanyName": "Sysco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sysco Corporation",
  "OperatorStr1": "1390 Enclave Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77077",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Byron Pitman",
  "RMPTitle": "Director of Safety & Security",
  "FTE": 279,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215091",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-07-08 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-07-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-07-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-07-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000073755,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000059144,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000074919,
          "ProcessID": 1000073755,
          "NAICSCode": "42441",
          "_desc": {
            "NAICS_CODE": "42441",
            "NAICS_DESCRIPTION": "General Line Grocery Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000091046,
          "ProcessID": 1000073755,
          "ChemicalID": 56,
          "Quantity": 12752.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000591046,
          "ProcessID": 1000073755,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059144,
      "SummaryText": "Facility Name:  Sysco Jackson, LLC\n\nEPA ID:  1000 0021 5091\n\n\n\nSysco Jackson, LLC\n\nJackson, Mississippi\n\n\n\nRISK MANAGEMENT PLAN\n\nExecutive Summary\n\n\n\nA. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n    \n\nAt this Sysco facility, we utilize anhydrous ammonia which is considered hazardous by the Environmental Protection Agency (EPA).  The properties which make ammonia valuable as a refrigerant also necessitate certain safety precautions.  Sysco strives to protect all its valuable resources and assets - both personnel and property.  We live and have families in this community.  We want to prevent exposure to all our personnel as well as nearby members of our community, natural resources, and the surrounding environment.  It is our policy to comply with all Federal, State, and Local regulations.  Through continual training and various safety devices and procedures, we work to minimize potential releases.\n\nOur emergency response program has specific procedures for accidental releases of anhydrous ammonia as well as other emergencies.  We work in conjunction with the local Fire Department and the Hinds County Office of Emergency Management to prepare for necessary notification of all affected neighbors.\n\n\n\nB. THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\n\n\nThe primary purpose of our facility is the temporary storage and distribution of wholesale grocery items, some of which are refrigerated and/or frozen.  We utilize anhydrous ammonia as the primary means for refrigeration and freezing.  An outside company is used to fill our main receiver tank.  Piping then carries the ammonia to the needed cooling or freezing units.  Access to the site is restricted to facility employees, authorized management personnel, and authorized contractors.\n\nThe regulated substance used at our facility is anhydrous ammonia.  The maximum amount of ammonia stored at this facility is 12,752 pounds.  We have the capacity for more, but do not operate above 80% of total syst"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059144,
      "SummaryText": "em capacity.\n\n\n\nC. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThis Sysco facility complies with all applicable Federal, State, and Local regulations including EPA's Accidental Release Prevention Rule.  Our personnel are trained in this during our Hazard Communications Training and through access to our written programs.  Our refrigeration maintenance operators receive On-the-Job training as well as outside training courses such as the RETA Industrial Refrigeration Operators Courses, taught at Lanier Technical College in Oakwood, Georgia.  Operating personnel are also observed by senior maintenance personnel in order to demonstrate proper job skills and knowledge.  The ammonia system is operated, tested, and maintained to the standard of International Institute of Ammonia Refrigeration, the most stringent standard of the ammonia industry.\n\n\n\nD. FIVE-YEAR ACCIDENT HISTORY\n\n\n\nThis facility has not had an accident involving ammonia within the last five years.\n\n\n\nE. THE EMERGENCY RESPONSE PROGRAM\n\n\n\nWe work very closely with the Jackson Fire Department, HAZMAT team, and the Hinds County Office of Emergency Management for emergency preparedness.  We meet periodically with representatives of each to address any changes in the facility or any new concerns. \n\n\n\nBecause of the limited amount of maintenance personnel on site, this Sysco facility does not respond to any large ammonia releases.  Our company policy dictates that in the event of a catastrophic ammonia release, all employees are evacuated to the appropriate assembly area and the local Fire Department and First Responders are notified.  Once on-site, the Fire Department and/or the First Responders coordinate with the appropriate Sysco personnel on what actions to take in order to minimize the effects of the release.\n\n\n\nF. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nCurrently, Sysco trains and tests all refrigeration technicians.  Our preventative maintenance program is above"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059144,
      "SummaryText": " standard.  Our ammonia Process Safety Management Program and our Risk Management Program is reviewed and updated annually (or as system modifications dictate).  Our programs are improved continuously through these annual updates.  We also take advantage of new technologies when safer and more economical alternatives are available.\n\n"
    }
  ]
}