{
  "FacilityID": 1000047510,
  "FacilityName": "A Sambado & Son, Inc.",
  "FacilityStr1": "16461 E. Comstock Road",
  "FacilityStr2": null,
  "FacilityCity": "Linden",
  "FacilityState": "CA",
  "FacilityZipCode": "95236",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland region 4 LEPC",
  "FacilityLatDecDegs": "38.044722",
  "FacilityLongDecDegs": "-121.114944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.primafrutta.com",
  "FacilityEmailAddress": "tims@pf-pv.com",
  "FacilityDUNS": 38132296,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lawrence Sambado",
  "OperatorStr1": "PO Box 438",
  "OperatorStr2": "16461 E. Comstock",
  "OperatorCity": "Linden",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95236",
  "OperatorZipCodeExt": null,
  "FTE": 91,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000174553",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0368657059900",
  "SafetyInspectionDate": "2013-09-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Revised 2009 Update 10/20/09",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-03-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-11-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-11-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-11-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 38.04444,
  "FRS_Long": -121.11675,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059285,
      "AltID": "NH3 Refrigeration",
      "FacilityID": 1000047510,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000072562,
          "ProcessID": 1000059285,
          "ChemicalID": 56,
          "Quantity": 110234.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000060355,
          "ProcessID": 1000059285,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000049364,
              "Process_NAICS_ID": 1000060355,
              "SafetyReviewDate": "2014-02-04 00:00:00",
              "PHA_Date": "2014-02-04 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-02-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-02-04 00:00:00",
              "TrainingReviewDate": "2013-12-20 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-02-03 00:00:00",
              "EquipmentInspectionDate": "2014-02-04 00:00:00",
              "EquipmentTested": "Compressors, Back pressure regs, temperature control, condensers",
              "ChangeMgmtDate": "2012-05-10 00:00:00",
              "ChangeMgmtReviewDate": "2013-12-20 00:00:00",
              "PreStartupReviewDate": "2003-04-26 00:00:00",
              "ComplianceAuditDate": "2013-12-20 00:00:00",
              "AuditCompletionDate": "2014-12-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-12-20 00:00:00",
              "HotWorkPermitReviewDate": "2013-12-20 00:00:00",
              "ContractorSafetyReviewDate": "2013-12-20 00:00:00",
              "ContractorSafetyEvalDate": "2013-01-20 00:00:00",
              "CBI_Flag": 0,
              "Description": "NH3 Refrigeration; Fruit & Vegetable postharvest processing",
              "_chemicals": [
                {
                  "PrimaryKey": 1000060193,
                  "PreventionProgram3ID": 1000049364,
                  "ProcessChemicalID": 1000072562
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000047510,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Linden Fire Department",
    "CoordinatingAgencyPhone": "2098873710",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047510,
      "SummaryText": "A. Sambado & Sons, Inc.\n\nRMP Executive Summary \n\n\n\nA. Sambado & Sons, Inc. is revising their 2014 5 year RMP update as requested by the new CUPA. The CUPA requested any Air Operating permit be considered as Title V so the Freon ARBRMPR3 number was input, and they also requested a small seasonal creek/ditch be added as an environmental receptor for the worst case. Since 2009 there have been several expansions and increased inventory of NH3. These changes included adding compressors, evaporative condensers, rooms, High Pressure Receiver and Hydro-coolers.\n\nThis RMP resubmission includes; revised Executive Summary and Registration, Offsite Consequence Analysis, 5 year Accident History, Prevention Program 3 dates, and change to Emergency Action Plan. Our employees will evaluate, evacuate, notify and take defensive mitigation actions without entering a hazardous area. A current detailed copy of RMP, and Prevention Program including PHA materials can be reviewed at the facility by contacting Lawrence or Tim Sambado.\n\n \n\nPublication or sharing of OCA portions of RMP materials can be in violation of the Chemical Safety Information, Site Security and Fuels Regulatory Relief Act (PL106-40). This facility will not make specific RMP or OCA information available to the public until a final ruling is made. Any accidental or authorized release of information in section 2-5 by government officials violates Federal Law.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nWe at A Sambado & Son, Inc. are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\nThe Stationary Source and the Regulated Substances Handle"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047510,
      "SummaryText": "d\n\nOur facility?s primary activities encompass growing, packing, processing, storage and shipping of fresh produce.  We have 1 regulated substance above federal thresholds present at our facility.  The substance is Ammonia (anhydrous) NH3.  Ammonia (anhydrous) is used as refrigerant in a closed loop flooded ammonia refrigeration system.\n\n\n\nThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nTo evaluate the worst case scenarios, alternative release scenario analysis we have used the EPA's RMP*Comp software.  The EPA's Risk Management Program Guidance for Ammonia Refrigeration was used as a reference.  The following paragraphs provide details of the chosen scenarios.\n\n\n\nThe worst case release scenario submitted for Program 3 toxic substances as a class involves a catastrophic release from the largest vessel.  In this scenario Ammonia (anhydrous) is released from the largest High Pressure receiver #5.  The toxic liquid released is assumed to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 minutes.  There are no mitigation measures since this HPR is outside.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 2.4 miles is obtained corresponding to a toxic endpoint of 0.14 mg/L. All liquid releases can be contained on-site. Two small seasonal creek/ditch are within the distance to toxic endpoint in the worst case release. They are not public recreational areas.\n\n\n\nThe alternative release scenario for Ammonia (anhydrous) involves a gas release typical of a compressor shaft seal failure.  The scenario involves a gas release from a ? inch diameter hole with a pressure of 181 PSIG/95?F. The release rate is 12 pounds/min. inside an enclosed space in direct contact with outside air. Under neutral weather conditions, the maximum distance to the toxic endpoint"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047510,
      "SummaryText": " of 0.14 mg/L of Ammonia (anhydrous) is 0.06 miles which is reported as <.1 miles.\n\n\n\nThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The oldest part of the facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition and then applicable later building codes associated with each expansion.    The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nA Sambado & Son, Inc. maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes. This includes updated and current P&ID's.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is ?What if Checklist?.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 yrs..  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 02/4/14.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, A Sambado & Son, Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\n\n\n\nA Sambado & Son, Inc. has a comprehensive training program in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000047510,
      "SummaryText": " place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every 3 years and more frequently as needed.\n\n\n\nMechanical Integrity\n\nA Sambado & Son, Inc. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by a qualified refrigeration contractor or employees with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at A Sambado & Son, Inc. to manage changes in process chemicals, technology, equipment and procedures.  We complete annual and 5 year reviews.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at A Sambado & Son, Inc..  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nA Sambado & Son, Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 12/20/13.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits ar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000047510,
      "SummaryText": "e undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nA Sambado & Son, Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nA Sambado & Son, Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility?s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nContractors\n\nOur company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  A Sambado & Son, Inc. has a strict policy of informing the contractors of known potential hazards related the contractor?s work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\nFive-year Accident History\n\n\n\nA Sambado & Son, Inc. has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\nEmergency Action Plan\n\nA Sambado & Son, Inc. carries a written emergency action plan to deal with accidental releases of hazardous materials.  The plan includes, evacuations, notification of local emergency response agencies and the public, as well as defensive mitigation actions without entering hazardous areas. We coordinate w"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000047510,
      "SummaryText": "ith the local fire department for additoinal resources. The plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response. Inland region 4 LEPC is the Local Emergency Planning Committee (LEPC) and local fire deaprtment are who our emergency plan has been coordinated and verified.\n\n\n\nPlanned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Implementation of the 2013 compliance audit recommendations and recent PHA revalidation recommendations will make our facility more regulatory compliant. Better documentation of testing and inspections, additional ventilation, updates to registration information and training are some of the major steps we want to take to improve safety at our facility.  These changes will be implemented over the next 12 months."
    }
  ]
}