{
  "FacilityID": 1000063937,
  "FacilityName": "James T. Anderson Water Filtration Plant",
  "FacilityStr1": "1381 Brucetown Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Clearbrook",
  "FacilityState": "VA",
  "FacilityZipCode": "22624",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51069",
  "LEPC": "Winchester Joint LEPC",
  "FacilityLatDecDegs": "39.258719",
  "FacilityLongDecDegs": "-078.088181",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "fcsa-water.com",
  "FacilityEmailAddress": "northern@fcsa-water.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Frederick County Sanitation Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Frederick County Sanitation Auth.",
  "OperatorStr1": "1381 Brucetown Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Clearbrook",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22624",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brandon Abshire",
  "RMPTitle": "Chief Operator",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180038",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-07-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-07-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-07-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-07-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-07-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 39.25869,
  "FRS_Long": -78.0875,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000080173,
      "AltID": null,
      "FacilityID": 1000063937,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000081395,
          "ProcessID": 1000080173,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000099921,
          "ProcessID": 1000080173,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000599921,
          "ProcessID": 1000080173,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063937,
      "SummaryText": "Executive Summary\n\n\n\nFrederick County Sanitation Authorities' Risk Management Program is intended to reduce the risk to employees and the public of injury or death from accidental release of chemicals. FCSA's management is committed to this goal.\n\n\n\nThe Facility and the Regulated Chemical\n\n\n\nThe James T. Anderson Water Filtration Plant, 1381 Brucetown Rd., Clearbrook, VA 22624, withdraws water from abandoned limestone quarries. The water is treated to comply with Safe Drinking Water Act standards and pumped into the distribution system. Chlorine gas is used to disinfect the water and make it safe for consumption. The treatment plant may inventory a maximum of 8,000 lbs. chlorine in one ton containers. \n\n\n\nPrevention Program Procedures:\n\n\n\nOur prevention program ensures that the elements of the risk management program are integrated and implemented on an ongoing basis, and that there is accountability and responsibility for the overall program and for each element of the program. An organizational table describing the lines of accountability and responsibility is included in the written plan. Our hazard prevention program follows the guidelines of Section 68.175 and addresses the following elements that are tailored to suit the degree of hazards present at our facility and the degree of complexity of our facility's operations:? Process safety information, Section 68.65\n\nPrior to conducting any process hazard analyses, our facility compiles written process safety information regarding process chemicals, process technology, and process equipment. The purpose of compiling this written material is to enable our facility, and the employees involved in the operating processes at our facility, to identify and understand the potential hazards of processes that involve highly hazardous chemicals.\n\n\n\n? Process hazard analysis, Section 68.67\n\nOur facility follows a thorough, orderly, and systematic approach for identifying, evaluating, and controlling processes that involve hig"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063937,
      "SummaryText": "hly hazardous chemicals. Each analysis is performed by a team with expertise and knowledge specific to the process being evaluated. In addition, at least one team member is knowledgeable of the specific process hazard analysis method being used. We have performed an initial process hazard analysis (hazard evaluation) of the chlorine processes at our facility; the analysis is appropriate to the complexity of the process.\n\n\n\n? Operating procedures, Section 68.69\n\n\n\nThe standard operating procedures at our facility provide clear instructions for properly conducting all activities associated with a covered process. We have developed and implemented written operating procedures that provide clear instructions to safely conduct activities that are involved in each process. Effective OPs, when combined with operator training, are instrumental in ensuring safe operation of the systems and preventing accidental releases.\n\nOPs are required for all stages of system operation, including initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup following emergency shutdown. This procedure applies to the EPA RMP and OSHA PSM regulated process.\n\n\n\n\n\n? Training, Section 68.71\n\n\n\nThe employee training program at our facility helps our employees understand the nature and the causes of problems that may arise from process operations.\n\nThe purpose of this procedure is to ensure that personnel working on or near OSHA PSM and/or EPA RMP-regulated chlorine process are adequately trained and understand the inherent process hazards and appropriate response actions to accidental chlorine releases. Well-trained operators are integral to preventing and mitigating the effects of accidental chemical releases. \n\n\n\n? Mechanical integrity, Section 68.73\n\n\n\nAt our facility, we ensure that all equipment used to process, store, or handle highly hazardous chemicals is designed, constructed, installed, and maintained in order to mini"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063937,
      "SummaryText": "mize the risk of chemical release. We have also established and implemented written procedures to maintain the on-going mechanical integrity of our process equipment.\n\n\n\nThe purpose of the mechanical integrity program is to ensure the continued integrity of process equipment. An effective mechanical integrity program is integral to preventing accidental chemical releases that may result from mechanical failure of improperly maintained equipment.\n\n\n\nThis procedure outlines the elements of the mechanical integrity program, which include the following:\n\n\n\n Identification of critical equipment and instrumentation\n\n Written maintenance, testing, and inspection schedules and procedures.\n\n Maintenance personnel training.\n\n Maintenance, testing, and inspection completion and documentation.  Correction of equipment deficiencies.\n\n Quality assurance of new equipment.\n\n The mechanical integrity program covers OSHA PSM and/or EPA RMP-regulated processes at \n\n the facility, which is presently limited to the chlorine process.\n\n\n\n? Management of change, Section 68.75\n\n\n\nThe purpose of the Management of Change (MoC) procedure is to ensure that system changes are properly reviewed against original system design specifications and can be accomplished safely, and that the systems are ready to operate safely in accordance with original system design intent following implementation of the change.\n\n\n\nFCSA will complete a MoC review for any temporary or permanent change, other than replacement in kind, affecting OSHA PSM and/or EPA RMP-regulated processes, which presently include the chlorine processes. Change is defined as all modifications to raw materials, process technology (i.e., processing conditions), facility (e.g., building, fire protection, services, etc.), equipment, and procedures. Replacement in kind is defined as a replacement of existing equipment with identical equipment or with equipment that meets the original design specifications.\n\n\n\n? Pre-startup review, Section 68.77"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000063937,
      "SummaryText": "\n\n\n\nA Pre-startup Safety Review (PSSR) will be performed for new processes regulated under OSHA PSM and EPA RMP, and modified existing regulated processes when the modification is significant enough to require a change in the process safety information. The purpose of the PSSR is to ensure that the facility is ready to safely operate new and modified regulated processes.\n\n\n\nPSSRs will be performed in conjunction with the Management of Change (MoC) procedure for major modifications to the covered systems at the facility. A major modification is defined as a modification that requires a change in process safety information. In addition, PSSRs will be performed for all new processes regulated under OSHA PSM and EPA RMP.\n\n\n\n? Compliance audits, Section 68.79\n\n\n\nOur compliance audits evaluate the effectiveness of our compliance with the risk management program, identify any deficiencies in the program, and ensure that corrective actions are implemented in a timely manner. We conduct our audits at least every 3 years and retain the two most recent compliance audit reports. Our audits are conducted by at least one person who is knowledgeable of the process and we ensure that a report of any findings of the audit is developed and all deficiencies are corrected.\n\n\n\n The compliance audits will evaluate each PSM and RMP element, develop and implement corrective actions to address any identified deficiencies, and document the entire procedure. Compliance with each requirement will be evaluated based on the answers to the following questions:\n\nDo the established program procedures satisfy the EPA RMP and OSHA PSM standards?\n\nAre the established procedures being followed?\n\n\n\n? Incident investigation, Section 68.81\n\n\n\nOur incident investigations examine the incidents that either resulted in, or could have resulted in, a catastrophic release of a highly hazardous chemical at our facility. Our investigations are initiated within 48 hours following the incident, and all written repor"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000063937,
      "SummaryText": "ts are retained for at least five years. The written report that is prepared at the conclusion of the investigation includes the following types of information:\n\n\n\n? The date of the incident\n\n? The date the investigation began\n\n? A description of the incident\n\n? The factors that contributed to the incident\n\n? The recommendations from the investigation\n\n? Employee participation, Section 68.83\n\n\n\nIn order to create an awareness of the aspects of the risk management plan, our facility involves our employees in the planning process. We have developed a written plan, which explains how we involve our employees, as well as contractor employees, in the plan.\n\n\n\nWe consult with our employees on the conduct and development of the elements of the risk management plan, and the overall content of the plan. We also provide our employees access to process hazard analysis and other related information developed under the risk\n\n\n\n\n\n? Hot work permit, Section 68.85\n\n\n\nThe hot work permits issued at our facility document that all fire prevention and protection requirements have been implemented prior to the start of any hot work operations. Each permit identifies the date(s) authorized to perform the hot work, and the equipment on which the hot work is to be performed.\n\n\n\nThe purpose of this procedure is to ensure that a hot work permit is issued for all hot work operations conducted on or near the chlorine processes. Hot work is defined as any work that may generate a source of ignition and includes but is not limited to welding, torch cutting, and use of spark-producing equipment.\n\n\n\nThe hot work permit is required for all hot work operations conducted on or near a OSHA PSM and/or EPA RMP Program 3 regulated process, which presently includes the chlorine processes.\n\nAfter the hot work is complete, an inspection of the affected area and equipment/piping will be performed prior to releasing the area or system for use or operation. The inspection will include a visual check of the sys"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000063937,
      "SummaryText": "tem for damage and a leak check of the system piping and vessels if appropriate.\n\n\n\nAll personnel who may be performing hot work must receive training to understand that hot work permits must be obtained prior to performing hot work (i.e., as part of RMProgram training). Those who can authorize hot work will review and be thoroughly familiar with this procedure and the requirements of 29 CFR 1910.252.\n\n\n\n? Contractors, Section 68.87\n\n\n\nWhenever contractors perform maintenance or repair, major renovation, or specialty work in and around processes that involve highly hazardous materials, they do so without compromising the health and safety of the employees at our facility. The contractors at our facility are trained to safely perform their jobs, are trained in the applicable provisions of the emergency response plan, and are knowledgeable of the hazards relating to their jobs.\n\n\n\nThe purpose of this procedure is to ensure that only contractors with good health and safety programs are selected to perform work on and around processes that use highly hazardous chemicals, and that the contractors and the processes are properly prepared to safely complete the work. Processes that use highly hazardous chemicals currently include the chlorine processes.\n\nThis procedure covers evaluating contractor's health and safety information before selection, and evaluating contractors safety performance while working at the facility. This procedure is specific to those contractors who perform work (e.g., maintenance or repair, turnaround, renovation, or specialty work) on and around the OSHA PSM and EPA RMP-regulated processes.\n\n\n\nOffsite Consequence Analysis\n\n\n\nChlorine gas is the only regulated substance used at this plant requiring OCA. Chlorine gas is delivered to the plant in one-ton cylinders. The cylinders are unloaded directly into a building used solely for chlorine. The cylinders remain in the building until they are loaded directly onto a truck for immediate return to the su"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000063937,
      "SummaryText": "pplier.  The building has a volume  of over 6000 cubic feet. This is sufficient to contain the release of this amount of chlorine without causing a building failure due to pressure. The mitigating factor of the building is not considered in computing the release rate to the atmosphere for either scenario. \n\n\n\nThe worst-case scenario assumes a one-ton cylinder fails and discharges 2000 pounds of chlorine gas in ten minutes. This results in a discharge rate of 200 pounds per minute to the atmosphere. No active or passive factors are assumed to mitigate this release. The EPA CEPP RMP Guidance, dtd October 1998 (RMP Guidance), determines a footprint with a radius of 1.3 miles around the plant is the area affected by this release. The area has a population of 5200 and public receptors of residences and schools.\n\n\n\n\n\nThe alternate scenario assumes the fusible plug metal blows out on a one ton cylinder filled to capacity. This causes chlorine gas to escape through a 3/8-inch hole. This scenario creates the greatest release of gas to the atmosphere. Using the RMP Guidance, the release rate is 37 pounds per minute with the radius of 0.1 miles around the plant as the footprint of the area affected. This footprint does not affect any public or environmental receptors.\n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\n\n\nOur emergency planning and response program addresses the actions that our employees are to take in the event of an unwanted release of a highly hazardous chemical at our facility. We have established an emergency action plan, which provides procedures for planning and responding to a release of a highly hazardous chemical.\n\n\n\nThe purpose of this procedure is to ensure that FCSA maintains up-to-date and complete written emergency action plans (EAPs) and effective response capabilities for all covered processes. Comprehensive emergency action plans, when combined with emergency response training and drills, can effectively minimize the impact of an accidental release by ensuri"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000063937,
      "SummaryText": "gned duties and responsibilities in an emergency. A draft outline of the emergency response training program content is provided in the EAPs.\n\n\n\nRefresher training of sufficient content and duration will be provided annually to all emergency response team personnel. The intent of refresher training is to ensure all emergency response personnel maintain a required level of competency. The plant operators will typically be designated as emergency response team members.\n\n\n\n Coordination With Local Responders\n\n\n\nThe Chief Operator will provide all community responder organizations who will assist in major incidents with a copy of the EAP and every update. The Chief Operator will arrange for one meeting, drill or exercise each year with these local organizations to promote preparedness for effective response in the event of an incident. \n\n\n\nThe Five Accident History\n\n\n\nThe facility did not have any reportable accidents in the last five years."
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000063937,
      "SummaryText": "ng proper and quick facility response.\n\n\n\nEmergency action plans are required for all facilities with OSHA  PSM and/or EPA RMPregulated processes that conduct emergency response. This procedure outlines FCSA plan for updating and maintaining the existing emergency action plans.\n\n\n\nUpdating Existing EAPs\n\n\n\nThe EAP will be reviewed annually to ensure that they are current and comply with OSHA PSM and EPA RMP regulations. An updated EAP will be prepared that will provide up-to-date, facility-specific information and procedures in the following sections:\n\n\n\n     Emergency evacuation procedures, routes, and safe assembly points.\n\n     Procedures for recognizing emergencies, securing incident areas, and responding to releases and leaks.\n\n     Procedures for accounting for all personnel following an evacuation.\n\n     Emergency first aid procedures for exposure to hazardous chemicals.\n\n     Procedures for notifying the public and local emergency response agencies of a release.\n\n     Reportable quantities of chemical accidental releases.\n\n     Procedures for use, inspection, testing, and maintenance of emergency response equipment and personal protective equipment (PPE) (e.g., SCBA, B-suits, B-kits, etc.).\n\n     List of facility personnel by title and/or name who can provide additional information regarding the contents of the EAP.\n\n     A description of facility alarm systems and meaning of individual alarm signals.\n\n     List of facility personnel currently assigned as members of the emergency response team and descriptions of personnel roles during an emergency.\n\n     Training requirements and frequency for emergency response team members and all facility personnel.\n\n     Outline of pre-emergency coordination activities with local community and outside responders.\n\n\n\n Emergency Response Training\n\n\n\nFCSA will conduct awareness-level emergency response training of all personnel on-site. In addition, all personnel who are emergency response team members will receive responder-level training, depending on assi"
    }
  ]
}