{
  "FacilityID": 1000061357,
  "FacilityName": "Trident Seafoods Pier-91 Facility",
  "FacilityStr1": "2001 West Garfield",
  "FacilityStr2": "Pier-91 Building 392",
  "FacilityCity": "Seattle",
  "FacilityState": "WA",
  "FacilityZipCode": "98119",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53033",
  "LEPC": "King County LEPC",
  "FacilityLatDecDegs": "47.636892",
  "FacilityLongDecDegs": "-122.383312",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G4",
  "LatLongDescription": "PG",
  "FacilityURL": "tridentseafoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 63362370,
  "ParentCompanyName": "Trident Seafoods Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Trident Seafoods Corporation",
  "OperatorStr1": "5303 Shilshole Ave",
  "OperatorStr2": null,
  "OperatorCity": "Seattle",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98107",
  "OperatorZipCodeExt": "4000",
  "FTE": 181,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197663",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "21148",
  "SafetyInspectionDate": "2015-01-15 00:00:00",
  "SafetyInspectionBy": "Department of Labor",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-12-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-12-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-12-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-06-12 00:00:00",
  "DeRegistrationEffectiveDate": "2020-01-01 00:00:00",
  "AnniversaryDate": "2021-12-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 47.633488,
  "FRS_Long": -122.37606,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "The Trident Seafoods Pier-91 Facility has been sold to another company.",
  "_processes": [
    {
      "ProcessID": 1000076705,
      "AltID": null,
      "FacilityID": 1000061357,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000095272,
          "ProcessID": 1000076705,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000077887,
          "ProcessID": 1000076705,
          "NAICSCode": "31171",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000064471,
              "Process_NAICS_ID": 1000077887,
              "SafetyReviewDate": "2016-11-02 00:00:00",
              "PHA_Date": "2017-06-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-05-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-05-17 00:00:00",
              "TrainingReviewDate": "2016-06-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-06-27 00:00:00",
              "EquipmentInspectionDate": "2016-05-13 00:00:00",
              "EquipmentTested": "Auto Purger",
              "ChangeMgmtDate": "2016-10-04 00:00:00",
              "ChangeMgmtReviewDate": "2016-06-27 00:00:00",
              "PreStartupReviewDate": "2016-05-11 00:00:00",
              "ComplianceAuditDate": "2016-05-11 00:00:00",
              "AuditCompletionDate": "2017-06-01 00:00:00",
              "IncidentInvestigationDate": "2014-05-01 00:00:00",
              "InvestigationChangeDate": "2014-05-01 00:00:00",
              "ParticipationPlansReviewDate": "2016-05-11 00:00:00",
              "HotWorkPermitReviewDate": "2016-05-11 00:00:00",
              "ContractorSafetyReviewDate": "2016-05-11 00:00:00",
              "ContractorSafetyEvalDate": "2016-05-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000079510,
                  "PreventionProgram3ID": 1000064471,
                  "ProcessChemicalID": 1000095272
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000061357,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-10-04 00:00:00",
    "ERTrainingDate": "2016-11-02 00:00:00",
    "CoordinatingAgencyName": "Seattle Fire Department",
    "CoordinatingAgencyPhone": "0009110000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061357,
      "SummaryText": "is comprehensive.  \r\n\r\n \r\nTridents Seafoods is always striving to make improvements in our process and systems. This philosophy also applies towards our views on safety. During the writing and implementation of the PSM Program, we conducted a comprehensive Process Hazard Analysis (PHA) on the ammonia refrigeration system. From that analysis we found and identified several safety issues needing attention. We have since addressed all issues on that punch list. In May of 2016, our PHA team conducted a third Process Hazard Analysis on the ammonia refrigeration system and we are now addressing the recommendations of that PHA.  It is Trident Seafood's policy to correct any and all safety related issues in an expedient manner.  \r\n\r\nThe facility has refrigeration control systems to maintain plant safety and improve energy efficiency. We have converted our existing preventative maintenance (PM) program to the MP2 Maintenance Software Program which allows us to be fully proactive regarding the preventative maintenance of the refrigeration system.\r\n\r\nWe, at Trident's Pier 91 Facility strive for excellence and make every effort to comply with the Risk Management Plan and the Process Management Program. Safe and efficient operation is an integral part of the Trident Seafoods Corporation safety culture. \r\n\r\n\r\nSincerely,\r\n\r\nMike Eagan\r\nFacilities Manager/Chief Engineer"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061357,
      "SummaryText": "t Pier-91 Facility utilizes this large common refrigeration system to create refrigeration effect for several distinct processes and temperatures. This facility has two distinct business units; one half of the plant is a large cold storage and distribution facility, the other half is a food processing facility. The common refrigeration system has capabilities to provide three different temperature ranges in the plant. The smallest portion of the of the refrigeration load is to maintain + 40ºF to +50ºF refrigeration for plant processing water, air conditioning and loading dock temperature control. The second largest refrigeration load operates at -20ºF for our large cold stores and a smaller holding freezer. The last and largest portion of the refrigeration load is for the \r\n-45ºF Processing (blast) freezers.  \r\n\r\nThe facility refrigeration system was engineered and designed to industry standards and regulations and has been certified by a Professional Engineer (PE) The refrigeration system uses industry standard materials, components, and follows the International Institute of Ammonia Refrigeration (IIAR) and Refrigeration industry guidelines which provide for overlapping layers of safety and protection of the refrigeration system and components. These overlapping layers of protection are provided through the use of automatic and manual controls which minimize the operating deviations and maintain the system within safe operational parameters. In the most critical operations, there are also redundant back-up systems.\r\n\r\nAlong with the inherent sound engineering and design that was originally built into the system, Trident Seafoods has taken a very pro-active approach to all aspects of safety, especially our approach to chemical safety as it pertains to ammonia. We have done extensive training for every employee on site as to the hazards involved with ammonia and other chemicals, and we conduct mock evacuation drills on a regular basis to train all employees of their"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061357,
      "SummaryText": "EPA Risk Management Plan \r\n\r\nUpdated Executive Summary:\r\n\r\nTrident Seafoods Pier-91 Seattle Facility is located on Port of Seattle Pier's 89 -91 properties located in the Inter Bay region of Seattle proper. The Pier Property covers over 152 Acres and Trident's Facility is located almost exactly in the middle of the Pier's property; and covers over 168,000 square feet on the ground level. Fortunately the central location gives the Trident Facility a fairly large buffer area to the North, East and West, and directly to the south is another Cold Storage that also uses ammonia as a refrigerant. This central location with buffer zones helps mitigate some of our exposure to the residential areas that surround the pier property.\r\n\r\nTrident Seafoods Corporate and Management Staff are continually committed to the Health and Safety of its employees, surrounding communities and the environment. The Trident Pier 91 Facility's Managers and employees are as equally committed to these same safety and health values.  We have built and implemented a very compete and well established safety plan and policy. Our preparation of the Process Safety Management (PSM) and Risk Management Programs (RMP) are further evidence of our commitment to the safety and health of the employees, community and environment.\r\n\r\nThe Trident Seafoods Pier-91 Seattle facility has on the premises a large refrigeration system that uses anhydrous ammonia as a refrigerant; with a total amount above the reportable threshold quantity of 10,000 pounds. \r\n\r\nIt employs this refrigeration system to freeze and store seafoods and various other food products. The quantity of ammonia contained in the system at this facility does require Trident Seafoods to comply with an OSHA\\WISHA Process Safety Management Program as well as the EPA Level 3 Risk Management Program. These programs are designed to ensure the health and safety of all on-site employees, as well as all offsite public and environmental receptors. \r\n\r\nThe Triden"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061357,
      "SummaryText": "roles and responsibilities should an emergency arise.     \r\n\r\nThrough the long process of developing these safety programs and procedures, Trident Seafoods has made every possible effort to comply with all applicable OSHA, WISHA, and EPA regulations. All aspects of our general plant safety program, procedures and policies comply with the latest WISHA Standards. The Facility has obtained OSHA Voluntary Protection Program (VPP) status. The PSM Program was written to OSHA and WISHA Guidelines and the system design also complies with the American Society of Heating, Refrigerating and Air Conditioning Engineers (ASHRAE) and the American national Standards Institute (ANSI) Standards. The ammonia Piping System is labeled and marked and tagged in accordance with OSHA recommendations in following the IIAR best practices. Piping and Instrumentation Diagrams (P&ID's) are current and there is a block flow diagram in place.  Standard Operating Procedures (SOP's) are used for all refrigeration tasks and Personal Protective Equipment (PPE) is mandated for all SOPs.  It is our policy at this facility to conduct monthly safety meetings and there are certain individuals who require yearly refresher training on certain aspects of the ammonia system operation.\r\n\r\nTrident Seafoods Pier-91 Facility can report there have been no on-site or off-site ammonia related incidents resulting in any injury, death, property or environmental damage during the 5 year accident history period.\r\n\r\n\r\nTridents Pier-91 Facility developed and implemented our emergency response plan with input from all departments. Every employee has training and practice on the facility emergency response plan. We have worked closely with local emergency responders on how to mitigate and reduce the exposure of ammonia to our employees and the surrounding community and environments. The Seattle Fire Department's HAZMAT Team has reviewed our Risk Management Plan and we are working closely with them to ensure that our program"
    }
  ]
}