{
  "FacilityID": 1000067720,
  "FacilityName": "ARDENT MILLS, LLC",
  "FacilityStr1": "715 East 13th Street North",
  "FacilityStr2": null,
  "FacilityCity": "Wichita",
  "FacilityState": "KS",
  "FacilityZipCode": "67214",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20173",
  "LEPC": "Sedgwick County LEPC",
  "FacilityLatDecDegs": "37.70806",
  "FacilityLongDecDegs": "-97.32941",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ardentmills.com/",
  "FacilityEmailAddress": "anthony.yount@ardentmills.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 79413900,
  "Company2DUNS": 0,
  "OperatorName": "Ardent Mills LLC",
  "OperatorStr1": "715 EAST 13TH STREET NORTH",
  "OperatorStr2": null,
  "OperatorCity": "WICHITA,",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67214",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Byers",
  "RMPTitle": "Plant Manager",
  "FTE": 70,
  "OtherEPAFacilityID": "110017588403",
  "EPAFacilityID": "100000237825",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-01-08 00:00:00",
  "SafetyInspectionBy": "City of Wichita building inspector",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-01-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-01-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-01-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-01-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085380,
      "AltID": "Flour Bleaching",
      "FacilityID": 1000067720,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000086622,
          "ProcessID": 1000085380,
          "NAICSCode": "31121",
          "_desc": {
            "NAICS_CODE": "31121",
            "NAICS_DESCRIPTION": "Flour Milling and Malt Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106608,
          "ProcessID": 1000085380,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606608,
          "ProcessID": 1000085380,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067720,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n1. Accidental release prevention and emergency response policies:\n\n\n\nWe at Ardent Mills are committed to employee, public and environmental safety. In our Wichita, Kansas facility, we handle chlorine, which is considered hazardous by United States Environmental Protection Agency. Chlorine is needed in our milling process, it is necessary to observe safety precautions in handling chlorine to prevent unnecessary human exposure, to reduce the threat to our\n\npersonal health as well as our coworkers.\n\n\n\nWe have a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement controls to prevent the possible release of regulated substances. Our emergency response procedure includes notification of the local fire authority and of any potentially effected neighbors. Access to the site is restricted to authorized plant employees, management personnel and contractors. Our chlorine system is enclosed within the plant building. It is our policy to adhere to all applicable Federal and state rules and regulations.\n\nSafety depends upon the manner in which we handle chlorine, combined with the safety devices inherent in the design of this facility, and combined with the safe handling procedures that we use, and the training of our personnel.\n\n\n\n2. The stationary source and regulated substances handled:\n\n\n\nOur facilities primary activities are flour milling, grinding wheat into flour. The only regulated substance handled at this facility is chlorine. Chlorine is used to whiten the flour and provide specified baking and cooking properties required by our clients for their breads, batter, mixes and similar flour products.\n\n\n\nChlorine is received by truck in 2,000 pound cylinders. A total of four cylinders are stored in a recently constructed, purpose built, building. Our maximum capacity"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067720,
      "SummaryText": " is 16,000 pounds.\n\n\n\n3. The general accidental release prevention program and the specific prevention steps:\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. One process at our facility is subject to the OSHA PSM standard under 29 CFR 1910.119.\n\n\n\nThis facility complies with EPA's Accidental Release Prevention and with applicable state codes and regulations including OSHA's Process Safety Management Standard. This facility was designed and constructed in accordance with good engineering practices to provide a safe system for our employees as well as our neighbors and environment. The delivery drivers have been thoroughly trained in regard to chlorine hazards and emergency response. Our employees watch the delivery of each truck bringing chlorine to our site. In addition, we contract out to chlorine system professionals to periodically inspect our chlorine system, and make any necessary adjustments to either equipment or procedures to continue to ensure safe handling and use of chlorine.\n\n\n\n4. Five-year accident history:\n\n\n\nThere have been no reportable accidental releases, injuries, or environmental damage resulting from our chlorine system in at least the past 10 years.\n\n\n\n5. The emergency response program:\n\n\n\nThe site has a written emergency response plan to deal with accidental releases hazardous materials. The plan includes all aspects of emergency response including adequate first aid, medical treatment, evacuations, notification of local emergency response agencies and the public.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. The plan is promptly updated to reflect any changes taking place within our processes that would require a modified emergency response.\n\n\n\n6. Planned changes to improve safety:\n\n\n\nThe latest hazard review of the chlorine system was conducted on Oct 30, 2013. All recommendations w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067720,
      "SummaryText": "ill be implemented as soon as possible, no later than Dec 30, 2014."
    }
  ]
}