{
  "FacilityID": 1000093706,
  "FacilityName": "City of Cloverdale Wastewater Treatment Plant",
  "FacilityStr1": "700 Asti Road",
  "FacilityStr2": null,
  "FacilityCity": "Cloverdale",
  "FacilityState": "CA",
  "FacilityZipCode": "95425",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06097",
  "LEPC": null,
  "FacilityLatDecDegs": "38.795833",
  "FacilityLongDecDegs": "-123.009444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "https://www.cloverdale.net/",
  "FacilityEmailAddress": "mrincon@ci.cloverdale.ca.us",
  "FacilityDUNS": 959157157,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Cloverdale",
  "OperatorStr1": "124 North Cloverdale Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Cloverdale",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95425",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": "SIC Code 9511",
  "EPAFacilityID": "100000086248",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-04-05 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-05-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-05-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 1,
  "PostmarkDate": "2021-05-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-05-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 38.79528,
  "FRS_Long": -123.00667,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116274,
      "AltID": null,
      "FacilityID": 1000093706,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145335,
          "ProcessID": 1000116274,
          "ChemicalID": 62,
          "Quantity": 5500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000117686,
          "ProcessID": 1000116274,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000073495,
              "Process_NAICS_ID": 1000117686,
              "SafetyReviewDate": "2019-04-05 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 1,
              "FR_OtherType": null,
              "FR_Comments": "Safety procedures follow local fire, building codes Sonoma County of Emergency Services and state re",
              "HazardReviewDate": "2019-04-15 00:00:00",
              "ChangeCompletionDate": "2019-04-15 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Gas leak alarms for both gas storage and process rooms",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Gas leak detector added to process room. New detector connected to audible alarm.",
              "OpProceduresReviewDate": "2019-04-15 00:00:00",
              "TrainingReviewDate": "2019-04-15 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Chlorine Safety, Fire Department, Operation and Maintenance Course - Sacramento State",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": "Due to COVID-19, all training in 2020-2021 was conducted in-house by City Staff",
              "MaintenanceReviewDate": "2019-04-15 00:00:00",
              "EquipmentInspectionDate": "2020-12-01 00:00:00",
              "EquipmentTested": "Chlorine Leak Detectors, Chlorine conveyance equipment, Eye Wash Stations",
              "ComplianceAuditDate": "2019-04-15 00:00:00",
              "AuditCompletionDate": "2019-04-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "This process includes two interconnected chlorine cylinders which are piped to chlorinators within the same building. From the chlorinators the chlorine is piped to chlorovacs for mixing with flow.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000074243,
                  "PreventionProgram2ID": 1000073495,
                  "ProcessChemicalID": 1000145335
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000093706,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-04-15 00:00:00",
    "ERTrainingDate": "2021-03-18 00:00:00",
    "CoordinatingAgencyName": "Police Department",
    "CoordinatingAgencyPhone": "7078942150",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093706,
      "SummaryText": "Executive Summary\n\n\n\nThe City of Cloverdale wastewater treatment and disposal facilities have been designed to serve the incorporated community of Cloverdale. The wastewater treatment plant is a biological treatment type, secondary treatment facility designed for an average dry weather flow of approximately 1.0 million gallons per day.  The treatment plant facilities consist of a headworks, aeration ponds, storage ponds, chlorination equipment, effluent pumping facilities, dechlorination equipment and effluent outfall.\n\n\n\nAs part of the treatment process, one regulated substance, chlorine is used.  Chlorine is part of the treatment process used to disinfect the plant effluent. Chlorine is piped and mixed with water using chlorovacs.  \n\n\n\nThe City of Cloverdale aggressively pursues the best practices available when preparing safety and risk management plans.  In the past five years, the wastewater treatment plant has had only minor issues with chlorine.\n\n\n\nIn an effort to assure that plant personnel are aware of emergency procedures when handling regulated substances, the City has annual on-site training sessions with the experts from the chemical supply company(ies). NOTE: Due to COVD-19, all training was conducted in-house by city Staff for 2020-2021.  In addition, included in the plants operation manual is a listing of the emergency operations to follow in the event of a problem.  The following outlines the City's emergency response procedure:\n\n\n\n1. In the event of a chemical release - Get Help - Call 911 and obtain police and fire department assistance. Notify the public works foreman and the City Manager of the situation. If the release is large, the Fire Department will assist Sonoma County Fire & Emergency Services with containment and the police will evacuate the surrounding area. Never enter an area where chemicals have been released without first notifying the authorities.\n\n2. Obtain proper safe distance and assist Emergency Services. Avoid low-lying areas "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093706,
      "SummaryText": "where released chemicals can accumulate. Ensure that safety equipment including protective clothing, protective eyewear, tools for repairs and emergency repair kit are available on-site for emergency responders.\n\n3. Locate a chlorine leak by tying a cloth soaked in 26% solution ammonia to the end of a stick and holding it close to the suspected area. A white cloud will result if there is a leak.\n\n4. Never use water on a chlorine leak. The corrosive action of chlorine and water will further damage containment systems and facilities.\n\n5. Detailed descriptions of standard procedures for controlling leaks in equipment and pipes, valves, and the containers.\n\n6. Detailed descriptions of standard procedures for applying first aid when minor chemical exposures occur.\n\n7. Detailed descriptions of standard procedures for applying first aid when serious chemical exposures occur.\n\n\n\nThe last date for for major equipment upgrades is 5/5/2021 when a pair of Chlorine Analyzers were added to the Chlorine Contact Tank at the facility. This change allows the operators to monitor chlorine residual in processed wastewater in real-time.  The operators review the operating procedures on an annual basis. The operators inspect/test all safety and monitoring equipment on a monthly basis. Chlorine process equipment is inspected annually by the manufacturer representative for the chlorine process equipment. All chlorine process equipment is tagged with the last inspection date and the name of the inspector.\n\n\n\nWe have included a worst case scenario, which includes the total release of a 1-ton cylinder of chlorine.  The chlorine cylinders are housed in a storage room.  Under the worst case scenario, the 1-ton chlorine cylinder will leak 2000 pounds of chlorine into the storage room over a ten minute period.  The storage room is not fitted with windows and the doors are always closed.  The 4576 cubic foot room does have one manually operated fan, which is capable of exchanging the air in the ro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093706,
      "SummaryText": "om 13 times per hour.  Following EPA RMP guidelines, this leak will release 110 pounds of chlorine per minute, and cover a theoretical area of approximately 0.9 miles until its end-point is reached. This scenario was revised from our previous report as directed by the CA Certified Unified Program Agency (CUPA) in December, 2014. This revision does not represent a change in the wastewater treatment process, quantity of chlorine stored or procedures.\n\n\n\nThe City of Cloverdale considers the worst-case coverage area discussed herein as theoretical due to the following mitigating factors not factored in the EPA COMP calculation.  Firstly, the treatment facility is located down gradient from the neighboring urban center (downtown Cloverdale).  Since chlorine is heavier than air, it tends to travel along the ground to reach the lowest point, which in this case is away from sensitive receptors.  Secondly, State Highway 101 is located between the wastewater treatment plant and downtown Cloverdale. This places a large raised earthen causeway between the facility and sensitive receptors.  Thirdly, prevailing winds travel from northwest to southeast.  The plant is located southeast of and, therefor, down wind from sensitive receptors. \n\n\n\nIncluded in our alternative release scenario is a look at what the coverage area would be if the manual exhaust fans, which are located in the chlorine room, were not turned on.  In this case, the same spill would slowly vent through the floor vent in the building.  The air exchange in the room would drop significantly to possibly one per hour.  In this scenario, the guidelines indicate that the chemicals endpoint would be reach at approximately 0.5 miles and include approximately 200 people.  Again, this coverage area is theoretical and does not take into account the factors mentioned in the previous paragraph.\n\n\n\n"
    }
  ]
}