{
  "FacilityID": 1000056544,
  "FacilityName": "Flint Hills Resources Alaska, LLC",
  "FacilityStr1": "1100 H&H Lane",
  "FacilityStr2": null,
  "FacilityCity": "North Pole",
  "FacilityState": "AK",
  "FacilityZipCode": "99705",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "02090",
  "LEPC": "Fairbanks Area LEPC",
  "FacilityLatDecDegs": "64.733374",
  "FacilityLongDecDegs": "-147.333469",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 143369416,
  "ParentCompanyName": "Flint Hills Resources, LP",
  "Company2Name": null,
  "CompanyDUNS": 56576507,
  "Company2DUNS": null,
  "OperatorName": "Flint Hills Resources Alaska, LLC",
  "OperatorStr1": "1100 H&H Lane",
  "OperatorStr2": null,
  "OperatorCity": "North Pole",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99705",
  "OperatorZipCodeExt": null,
  "FTE": 36,
  "OtherEPAFacilityID": "AKD000850701",
  "EPAFacilityID": "100000069864",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "AQ0071TVP02",
  "SafetyInspectionDate": "2010-06-11 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-03-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-03-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-03-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2018-05-30 00:00:00",
  "DeRegistrationEffectiveDate": "2018-05-23 00:00:00",
  "AnniversaryDate": "2021-03-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 64.737264,
  "FRS_Long": -147.34844,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "2500",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "the facility does not use, store or produce a regulated substance above the TQ",
  "_processes": [
    {
      "ProcessID": 1000070574,
      "AltID": "Tank Farm",
      "FacilityID": 1000056544,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087208,
          "ProcessID": 1000070574,
          "ChemicalID": 155,
          "Quantity": 110000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000074730,
              "ProcessChemicalID": 1000087208,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000074731,
              "ProcessChemicalID": 1000087208,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000074732,
              "ProcessChemicalID": 1000087208,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000071777,
          "ProcessID": 1000070574,
          "NAICSCode": "32411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000059057,
              "Process_NAICS_ID": 1000071777,
              "SafetyReviewDate": "2013-03-08 00:00:00",
              "PHA_Date": "2014-12-01 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-12-08 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Process / Equipment / Procedural changes managed under the site's MOC Program to address PHA Recommendations and other operational initiatives.",
              "OpProceduresReviewDate": "2015-05-30 00:00:00",
              "TrainingReviewDate": "2015-05-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-22 00:00:00",
              "EquipmentInspectionDate": "2015-04-07 00:00:00",
              "EquipmentTested": "PSV-05538-EC-2427A to Crude P-05538",
              "ChangeMgmtDate": "2014-11-05 00:00:00",
              "ChangeMgmtReviewDate": "2014-02-19 00:00:00",
              "PreStartupReviewDate": "2014-12-14 00:00:00",
              "ComplianceAuditDate": "2015-02-25 00:00:00",
              "AuditCompletionDate": "2018-09-30 00:00:00",
              "IncidentInvestigationDate": "2012-05-17 00:00:00",
              "InvestigationChangeDate": "2021-12-31 00:00:00",
              "ParticipationPlansReviewDate": "2010-01-12 00:00:00",
              "HotWorkPermitReviewDate": "2014-04-02 00:00:00",
              "ContractorSafetyReviewDate": "2015-08-24 00:00:00",
              "ContractorSafetyEvalDate": "2014-05-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000072403,
                  "PreventionProgram3ID": 1000059057,
                  "ProcessChemicalID": 1000087208
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000056544,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-01-10 00:00:00",
    "ERTrainingDate": "2015-09-29 00:00:00",
    "CoordinatingAgencyName": "City of North Pole Fire Dept.",
    "CoordinatingAgencyPhone": "9074882232",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "RCRA Reg. 40 CFR 265 and 279.52 plus OPA 90 Reg. 40 CFR 112"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056544,
      "SummaryText": "2.1\tRisk Management Plan Executive Summary\r\nThe Executive Summary gives an overview of each of the components of the Risk Management Program, including:\r\n\r\n¿\tA narrative on the accidental release prevention and emergency response policies as required by 40 CFR 68.155(a);\r\n¿\tA description of the stationary source and regulated substances handled as required by 40 CFR 68.155(b);\r\n¿\tA section on general accidental release prevention and chemical-specific prevention steps as required by 40 CFR 68.155(c);\r\n¿\tThe Five-Year Accident History of the facility as required by 40 CFR 68.155(d);\r\n¿\tA description of the emergency response program as required by 40 CFR 68.155(e); and\r\n¿\tA discussion of planned changes to improve safety as required by 40 CFR 68.155(f).  \r\n\r\n\r\nThe Executive Summary to be included in RMP*eSubmit is shown in its entirety in Section 2.1.1 to 2.1.7 below.\r\n\r\n2.1.1\tIntroduction and Policies\r\nFlint Hills Resources Alaska LLC (FHRA) is owner and operator of a petroleum facility in North Pole, Alaska (the Facility). FHRA purchased this facility in April 2004 from Williams Alaska Petroleum, Inc. Since doing so, FHRA has gone to great efforts to further develop and prioritize health and safety performance at the facility. At FHRA, safety is a value. As such, it defines who FHRA is and what FHRA believes in. The facility has made a commitment to both employee and public safety. FHRA's vision is to be recognized as a leader for safe operations ensuring the health and safety of employees, contractors, customers, and neighbors. FHRA's first priority is prevention. This priority is demonstrated by the resources FHRA has invested in accident prevention.  These include designing and constructing equipment to meet stringent, nationally recognized standards of performance. FHRA operates and maintains equipment to ensure reliability, which also serves as a measure of how safe an operation is. FHRA trains employees to recognize the importance of safety and to incorpora"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056544,
      "SummaryText": "te safety as a value, both at work and at home. In the event that a release does occur, FHRA's personnel and contractors will respond to, control, and contain the release.\r\n\r\nFHRA is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors, and the public while fully complying with applicable laws and regulations.  FHRA's management philosophy goals are achieved through the implementation of its Environmental Health and Safety Management Systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators. \r\n\r\nThe purpose of this Risk Management Plan is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency response plans in the event of an accidental release, the five-year accident history of the facility, and planned changes to improve safety at the plant.\r\n\r\n2.1.2\tStationary Source and Regulated Substances\r\nThe facility previously operated a variety of processes to produce various grades of gasoline, diesel fuel, home heating oil, asphalt, and jet fuel, from crude oil. The facility handles regulated flammables above the RMP threshold quantity but does not handle or process threshold quantities of toxic regulated substances per this regulation. As a result, no toxic chemicals are reportable for the facility RMP. On May 24, 2014, FHRA ceased crude oil processing. The Extraction Unit was shut down and de-inventory activities commenced on May 1, 2014. Crude Unit #2 was shut down and de-inventory activities commenced on May 24, 2014. The closure of these units ended production of refined products. FHRA will continue to market fuels through the North Pole Terminal. \r\n\r\n&#8195;\r\n2.1.3\tAccidental Release Prevention and Emergency Response Policies\r\nThe accidental release prevention and emergency response programs in place at the facility are part of th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000056544,
      "SummaryText": "ibility for maintaining up-to-date process safety information.  Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets (SDS).  The facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition, flow, pressure).  The facility ensures that the process is maintained within these limits using process controls and monitoring instruments, trained personnel, and protective instrument systems (e.g. automated shutdown systems).  The facility also maintains other technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design temperature and pressure ratings, electrical rating of equipment, etc.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\nProcess Hazard Analysis\r\nFHRA has a comprehensive program to ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined on a regular basis to identify hazards and ensure that adequate controls are in place to manage these hazards.  FHRA primarily uses the hazard and operability (HAZOP) technique to perform these evaluations.  These analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\n\r\nIf ways are found to make processes safer, all appropriate individuals, in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000056544,
      "SummaryText": "cluding corporate management, are involved in implementing the improvements.  FHRA addresses those changes which can have the greatest impact on safety first.  Recommendations for improvement are tracked, to be sure that they are implemented in a timely manner.  The final resolution of a finding is documented and retained.  FHRA periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years until the process is no longer operating.  The HAZOP, What-If, and Checklist techniques are utilized during the Hazard Analysis Revalidation process.  The results and findings from these updates are documented and retained.  Once again, the team findings are forwarded to management for implementation, and the final resolution of the findings is documented and retained.\r\n\r\nOperating Procedures\r\nFHRA maintains written procedures that address all modes of process operations, including (1) equipment startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, \r\n(5) normal shutdown, and (6) initial startup of new equipment.  These procedures can be used as a reference by experienced operators and provide consistent training of new operators.  These procedures are annually reviewed and certified as current and accurate.  The written procedures are readily available to operators in the process units and for other personnel to use as necessary to safely perform their jobs.\r\n\r\nTraining\r\nTo complement the written procedures for process operations, FHRA has implemented a comprehensive training program for employees involved in operating a process.  After operators demonstrate through tests, skills demonstration, and other methods used to determine that they have adequate knowledge to perform the duties and tasks in a safe manner on their own, they are allowed to work independently.  In addition, all operators receive refresher training to ensure that their skills and knowledge are maintained at the highest"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000056544,
      "SummaryText": "level.  Training is documented for each operator, including the means used to verify that the operator understood the training.\r\n\r\nContractors\r\nFHRA uses contractors to supplement its workforce as part of routine practices and during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the facility has policies in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, \r\n(5) understand and follow site safety rules, and (6) inform facility personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, FHRA evaluates contractor safety programs and performance during the selection of a contractor.  Facility personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\r\n\r\nPre-startup Safety Reviews (PSSRs)\r\nFHRA conducts a PSSR for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that supporting systems are operationally ready.  The PSSR review team uses checklists to verify readiness.  A PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n\r\nMech"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056544,
      "SummaryText": "e high standards striven for by FHRA.  These high standards include:\r\n\r\n¿\tOperating in compliance with required environmental permits and regulations. \r\n¿\tOperating and maintaining the assets in such a manner that unintentional releases \r\nare minimized.\r\n¿\tOperating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible.\r\n¿\tCorrecting non-compliance found by regular audits of the facility.\r\n\r\n2.1.4\tPrevention Program\r\nThe following is a summary of the accident prevention program in place at FHRA. Program 3 processes at the facility that are regulated by the EPA RMP regulation are also subject to the OSHA PSM standard. This summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\nEmployee Participation\r\nFHRA encourages employees to participate in all facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team. Employees have access to all information created as part of the facility accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the facility and addresses each accident prevention program element. In addition, the facility has a number of initiatives that address process safety and employee safety issues.\r\n\r\nProcess Safety Information\r\nFHRA has available technical documents that are needed to maintain safe operation of the facility. These documents address chemical properties and associated hazards, limits for key process parameters, specific chemical inventories, and equipment design basis/configuration information. Specific departments within the facility are assigned respons"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000056544,
      "SummaryText": "anical Integrity\r\nFHRA has practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  This program includes: (1) training, (2) written procedures, (3) regular inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that reliably maintains the mechanical integrity of the process equipment.  Maintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable work practices to help ensure that they can perform their job in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service, or a MOC team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.  Another integral part of the mechanical integrity program is quality assurance.  FHRA incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\r\n\r\nSafe Work Practices\r\nFHRA has safe work practices in place to help ensure worker and process safety.  Examples of these include (1) Security control and badge reader systems that regulate the entrance and exit of personnel, a Log Sheet to track personnel that have entered/exited covered processes, (2) a work permit pro"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000056544,
      "SummaryText": "cedure, work performed in the process area is to be performed under the direction of a work permit, lockout/tagout procedure is an integral part of the work permit to ensure isolation of energy sources for equipment undergoing maintenance, (3) a policy for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and policy to control spark-producing activities (i.e., hot work), and (5) a permit and policy to ensure that adequate precautions are in place before entry into a confined space.  These policies (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\nManagement of Change (MOC)\r\nFHRA has a system to manage changes to processes.  This system requires that changes to process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes are properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards, and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\r\n\r\nIncident Investigation\r\nFHRA promptly investigates incidents that result in, or could result in, a fire/explosion, chemical loss of containment, major property damage, environmental impact, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and tracks response to the recommendations in the site's Action Item Management System (LYNX).  Th"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000056544,
      "SummaryText": "e final resolution of each finding or recommendation is documented, and the investigation results are accessible to all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.\r\n\r\nCompliance Audits\r\nTo help ensure that the Chemical Accident Prevention Program is functioning properly, FHRA periodically conducts an audit to determine whether the procedures and practices required by the Chemical Accident Prevention Program are being implemented.  Compliance audits are conducted at least every 3 years.  The audit team typically is an independent, autonomous group, and contains at least one or more individuals knowledgeable in the process being audited.  The audit team develops findings that are forwarded to facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n\r\n2.1.5\tFive-Year Accident History\r\n\tFHRA has had no RMP reportable accidental releases of a regulated substance in the past 5 years.\r\n\t\r\n2.1.6\tEmergency Response Program\r\n\tFHRA maintains a written emergency response plan program to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidently released.  The procedures address areas of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, and notification of local emergency response agencies.  In addition, FHRA has procedures that address maintenance, inspection, and testing of emergency response equipment.  Employees receive training in these proced"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000056544,
      "SummaryText": "ures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to facility processes or other facility operations.  The emergency response program for the facility has been coordinated with the Fairbanks North Star Borough.  FHRA has around-the-clock communications capability with emergency response organizations (e.g., fire department), who provide the means of notifying the public of an incident, if necessary, as well as facilitating quick response.\r\n\r\n\r\n&#8195;\r\n2.1.7\tPlanned Changes to Improve Safety\r\nDiligent compliance with the Risk Management Program forms the framework to continue to improve the level of safety at FHRA.  Some key components of the safety improvements are as follows:\r\n¿\tThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in safety standards.\r\n¿\tThe Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed, and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program.\r\n¿\tCompliance audits will ensure FHRA maintains and increases the level of safety protection."
    }
  ]
}