{
  "FacilityID": 1000106867,
  "FacilityName": "GT Logistics Omniport CP Chem",
  "FacilityStr1": "1998 Hwy 73 West",
  "FacilityStr2": null,
  "FacilityCity": "Port Arthur",
  "FacilityState": "TX",
  "FacilityZipCode": "77640",
  "Facility4DigitZipExt": "1759",
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "29.869358",
  "FacilityLongDecDegs": "-93.995097",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.howardenergypartners.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 51271714,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "GT Logistics, LLC",
  "OperatorStr1": "1998 Highway 73",
  "OperatorStr2": null,
  "OperatorCity": "Port Arthur",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77640",
  "OperatorZipCodeExt": "1759",
  "FTE": 21,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000251755",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-09-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-09-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-09-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-09-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": ".74",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000133805,
      "AltID": null,
      "FacilityID": 1000106867,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000167652,
          "ProcessID": 1000133805,
          "ChemicalID": 155,
          "Quantity": 2389392.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000150442,
              "ProcessChemicalID": 1000167652,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000150441,
              "ProcessChemicalID": 1000167652,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000150440,
              "ProcessChemicalID": 1000167652,
              "ChemicalID": 129
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000135238,
          "ProcessID": 1000133805,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000115315,
              "Process_NAICS_ID": 1000135238,
              "SafetyReviewDate": "2022-12-12 00:00:00",
              "PHA_Date": "2022-12-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-12-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-12-12 00:00:00",
              "TrainingReviewDate": "2022-12-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-09-13 00:00:00",
              "EquipmentInspectionDate": "2023-09-13 00:00:00",
              "EquipmentTested": "Tank Storage",
              "ChangeMgmtDate": "2023-09-13 00:00:00",
              "ChangeMgmtReviewDate": "2023-09-13 00:00:00",
              "PreStartupReviewDate": "2023-09-15 00:00:00",
              "ComplianceAuditDate": "2023-09-15 00:00:00",
              "AuditCompletionDate": "2024-09-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-09-13 00:00:00",
              "HotWorkPermitReviewDate": "2023-09-13 00:00:00",
              "ContractorSafetyReviewDate": "2023-09-13 00:00:00",
              "ContractorSafetyEvalDate": "2023-09-13 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000144699,
                  "PreventionProgram3ID": 1000115315,
                  "ProcessChemicalID": 1000167652
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106867,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-09-13 00:00:00",
    "ERTrainingDate": "2023-09-13 00:00:00",
    "CoordinatingAgencyName": "Jeffersin County LEPC",
    "CoordinatingAgencyPhone": "4098358757",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000106867,
      "SummaryText": "lated substance release during the past five year as it is a new facility.\n\nP. EMERGENCY RESPONSE PROGRAM INFORMATION\nThe terminal maintains a written emergency action plan, which is in place to help protect employees and public safety as well as the environment. The plan identifies steps to be taken in case of an accidental release including: \n1. proper first aid and medical treatment for exposures\n2.evacuation plans and accounting for personnel after an evacuation, \n3.notification of local emergency response agencies and the public if a release occurs. \n\nEmployees receive training in the procedures to be followed by employees who remain to operate critical terminal operations before they evacuate. GT Logistics has around-the-clock communications capability with appropriate emergency response organizations (Fire Department, Police, Sheriff\u0092s Office, or similar). This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition, GT Logistics conducts periodic drills and annual refresher training for terminal personnel.\n\n\nQ. PLANNED CHANGES TO IMPROVE SAFETY\nGT Logistics' management is committed to the following:\n1. Preventing accidents\n2. Training our employees in correct response procedures in the event of an accident\n3. Participating in community emergency preparedness\n4. Addressing any citizen concerns by fully explaining potential hazards associated with GT Logistics\noperations and all steps being taken to prevent and mitigate accidents.\n\nWith these objectives in mind, this Risk Management Plan has been developed to provide information about our management of the risks associated with the natural gas treatment and liquids recovery process. Most importantly, we stress our commitment to ensuring a safe operation for our employees, our visitors, and our community."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000106867,
      "SummaryText": "on is documented and investigation reports are retained for at least 5 years.\n\nL. Compliance Audits\nAt least every 3 years a Compliance Audit addressing OSHA, EPA, RMP and Good Engineering Practices are conducted by employees and management of GT Logistics. This audit team develops findings that are forwarded to facility management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are completed. Final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nM. Chemical-Specific Prevention Steps\nThe following is a description of existing features applicable to prevention of accidental release ofregulated substances in this facility.\n\nUniversal Prevention Activities\nGT Logistics accident release prevention and response policies are applied to all RMP-covered processes. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nN. Specialized Safety Features\nSite specific detection and control equipment (safety features) are deployed throughout the plant to:\n1. Contain/control a release\n2. Quickly detect a release, and\n3. Reduce the consequences of an RMP-regulated substance release\n\nThe following type of safety features are used in the covered process:\n\n1.\tRelease Containment/Control\n2.\tProcess relief valves that discharge to a flare to capture and incinerate episodic releases\n3.\tAutomated and manual valves to permit isolation of the process\n4.\tAutomated plant shutdown system, diverting all incoming product to the vapor control system.\n5.\tRedundant equipment and instrumentation\n6.\tAtmospheric relief devices\n\nRelease Mitigation\n1. Fire extinguishers with suppression system\n2. Trained emergency response personnel\n3. Personal protective equipment\n4. Blast-resistant control room to help protect control systems\n\n\nO. FIVE YEAR ACCIDENT HISTORY\nGT Logistics CP Chem Plant has had no RMP-regu"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000106867,
      "SummaryText": "nd determine what action is necessary.\n\nAn integral part of the mechanical integrity program is quality assurance. GT Logistics incorporates quality assurance measures into equipment purchases and repairs. This helps to determine that new equipment is suitable for its intended use and the proper materials and spare parts are used when repairs are made.\n\nI. Safe Work Practices\nGT Logistics has long-standing safe work practices as mandated by OSHA, EPA, Industrial Standards and Good Engineering Practice in place to help provide employee, public and process safety.\n\nJ. Management of Change\nGT Logistics has a comprehensive system to manage changes to all Reported Covered Processes. This system requires that changes to items such as process equipment, chemicals, technology and procedures be properly reviewed and authorized before being implemented. Changes are reviewed to:\n\n1. Determine that adequate controls are in place to manage any new hazards\n2. Verify that existing controls have not been compromised by the proposed change\n\nAffected chemical hazard information, process operating limits, and equipment information and\nprocedures are updated to incorporate these changes. In addition, operating and maintenance.\npersonnel are trained on the changes.\n\nK. Incident Investigation\nGT Logistics promptly investigates all incidents related to a covered process that resulted in, or reasonably could have resulted in a fire/explosion, property damage, environmental loss or personal injury. The goal of each investigation is to determine the facts and develop corrective action to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent future occurrences and forwards these results to facility management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendati"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106867,
      "SummaryText": "ards\n3.\tEmergency response plan requirements\n4.\tSafe Work Practices before beginning work\nG. Pre-Startup Safety Review\nGT Logistics conducts a PSSR for any new facility modification that requires a change in the\nprocess safety information. The purpose of the PSSR is to see that safety features, procedures,\npersonnel and equipment are appropriately prepared for startup before placing the equipment into service. This review provides one additional check that construction is in accordance with the design specifications and that all supporting systems are operationally ready. A PSSR involves field verification of the construction and services as quality assurance verification that the accident prevention program requirements are properly implemented.\n\nH. Mechanical Integrity\nGT Logistics has established practices and procedures for the safe operation of fixed, rotating andemergency shutdown equipment. The basic aspects of the program include, but are not limited to the following:\n1. Conducting training\n2. Developing written procedures\n3. Performing inspections and tests\n4. Correcting identified deficiencies\n5. Applying quality assurance measures\n\nIn combination, these activities form a system to maintain the mechanical integrity of the process.\nMaintenance personnel receive training on:\n1. Overview of the process\n2. Safety and Health hazards\n3. Applicable maintenance procedures\n4. Emergency response plan\n5. Applicable safe work practices to help ensure that they can perform their jobs in a safe manner.\n\nWritten procedures provide that work is performed in a consistent manner and serve as a basis for training. Inspections and tests are performed to help verify that equipment functions as intended, and that equipment is within acceptable limits. If a deficiency is identified and the situation presents an immediate safety concern, the deficiency is corrected before placing the equipment back into service. The management of the change team will review the use of equipment a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106867,
      "SummaryText": "SR) and implemented through Management of Change (MOC).\n\nCovered Process Operating procedures are readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job task and maintain the covered process unit operating within its safe limits.\n\nE. Training\nGT Logistics has implemented a comprehensive training program for all employees involved in operating the covered process. New employees receive basic training in process operations if they are not already familiar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. A performance review must be successfully completed during this training period. After the operator demonstrates adequate knowledge to perform the duties and tasks in a safe manner on their own, they are allowed to work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years, or more frequently upon request. All training is documented for each operator, including the means used to verify and demonstrate skills.\n\nF. Contractors\nGT Logistics uses contractors to supplement its workforce during periods of increased maintenance or construction activities. Because some contractors work on or near Covered Process equipment, the facility has procedures in place to ensure that contractors:\n1. Perform their work in a safe manner\n2. Have the appropriate knowledge and skills\n3. Are aware of the hazards in their workplace\n4. Understand what they should do in the event of an emergency\n5. Understand and follow site safety rules\n6. Inform facility personnel of any hazard that they find during their work\n\nThis is accomplished by providing contractors with:\n1.\tA process overview\n2.\tInformation about safety and health haz"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106867,
      "SummaryText": "and facility changes to safety features in the\nprocess is not compromised.\n\nC. Process Hazard Analysis (PHA)\nGT Logistics has a comprehensive program to identify and control hazards associated with the RMP covered process. This program systematically examines for potential hazards and puts controls in place to manage hazards. Process Hazard Analysis is conducted using Hazard and Operability Analysis (HAZOP). HAZOP is a structured and systematic examination of a planned or existing process or operation to identify and evaluate problems that may represent risks to personnel or equipment or prevent efficient operation. A HAZOP is a qualitative technique based on guidewords and is carried out by a multi-disciplinary team. The team identifies, evaluates and makes recommendations to management of potential hazards identified. The team's findings are forwarded to the Management team for resolution. The approved mitigation options in response to the PHA team's findings are tracked until they are completed. The final resolution of each finding is documented and retained. \n\nThe facility periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained.\n\nD. Operating Procedures\nGT Logistics maintains written Operating Procedures of the covered process that address primary operations mandated by OSHA, EPA, good engineering practice and manufacturers. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. Procedures are periodically reviewed and annually certified as current accurate by management. The procedures are maintained in current and accurate status by revising them as necessary by employee's suggestion, compliance audit, PHAs, good engineering practice, Pre- Startup Safety Review (PS"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106867,
      "SummaryText": "s follows:\n1. Updating and compiling technical documents and chemical information\n2. Performing necessary calculations for PSM and RMP\n3. Maintaining good engineering practices\n4. Participating as a member of a process hazard analysis (PHA) team.\n5. Employees have access to all information pertaining to the accident prevention program.\n\nB. Process Safety Information\nGT Logistics keeps a variety of technical documents that are used to help maintain safe operation of the processes. These technical documents address the following:\n1. Chemical properties and associated hazards\n2. Necessary Block Flow Diagrams of the process\n3. Maximum intended inventories\n4. Upper and Lower limits of process fixed and rotating equipment\n5. Equipment design basis and configuration information\n6. Identification of all necessary Regulatory equipment design documents\n7. Sufficient information to assure good engineering practices\n\nThe location of the technical documents referenced above is listed in the Process Safety Information portion of the PSM.\nChemical specific information, including hazard and emergency response/exposure considerations, is provided in safety data sheet (SDS). For specific process areas, the facility has documented safety- related limits for specific process parameters such as temperatures, level and composition in the operators' procedures manual. The facility maintains the process within these limits by using process controls and monitoring instruments, trained personnel and protective instrument systems such as automated shutdown systems. \n\nThe facility also maintains numerous technical documents that provide information about the design and construction of the process equipment. This information includes materials of construction, design pressures, temperature and electrical ratings. This information, in combination with procedures and equipment operating history, provides a basis for inspection and maintenance activities, as well as for evaluating proposed process"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106867,
      "SummaryText": "ACCIDENT RELEASE PRVENTION AND RESPONSE POLICIES\n\nGT Logistics owns and operates GT Logistics CP Chem facility. The facility is designed for a liquid propane/propylene (PP) mix unloading system for further processing into polymer grade propylene (PGP) while recovering any remaining vapor in the rail cars, and a system to unload the PGP back into rail cars for shipping. Excess vapor is sent to an existing vapor combustion unit (VCU). The PP mix unloading is done through eight (8) rail car stations and the PGP is loaded to two (2) rail cars stations. A maximum of twenty-three (23) rail cars of PP and four (4) rail cars of PGP can be loaded in a 24-hour period.\n\nGT Logistics has a long-standing commitment to workers and public safety. This commitment is demonstrated by our efforts in accident prevention, such as training personnel, quality assurance, and considering safety in the design, installation, operation and maintenance of our process. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, facility trained personnel will evaluate the situation, take actions within the capabilities of the facility, and notify the necessary outside agencies.\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\nThe facility has two 90,000 gallons PP mix tanks. These tanks receive products by 8 rail cars via transloading in a closed pipe system. This system is connected to an existing VCU at the facility. In addition to handling PP mix, the facility can handle polymer grade PP mix directly from a pipeline to two rail cars, which is regulated under 49 CFR.\n\nThese substances can contain the following components:\na. Propylene (115-07-01), 63%-85%\nb. Propane (74-98-6), 13%-35%\nc. Ethane (74-84-0), 0.1%- 1.4%\n\n\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\nA. Employee Participation\nGT Logistics encourages employees to participate in all facets of process safety management and accident prevention a"
    }
  ]
}