{
  "FacilityID": 1000043769,
  "FacilityName": "Panther Creek Gas Plant",
  "FacilityStr1": "1 mile W and 9 miles N of Canute",
  "FacilityStr2": null,
  "FacilityCity": "Canute",
  "FacilityState": "OK",
  "FacilityZipCode": "73626",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40039",
  "LEPC": "Custer LEPC",
  "FacilityLatDecDegs": "35.548950",
  "FacilityLongDecDegs": "-099.293984",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.oneok.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 964315345,
  "ParentCompanyName": "ONEOK Partners, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 7907827,
  "Company2DUNS": 0,
  "OperatorName": "ONEOK Field Services Company,L.L.C.",
  "OperatorStr1": "P. O. Box 871",
  "OperatorStr2": null,
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74102",
  "OperatorZipCodeExt": "0871",
  "RMPContact": "Ronnie Harris",
  "RMPTitle": "Manager, Plant Operations",
  "FTE": 3,
  "OtherEPAFacilityID": "OK0000872200",
  "EPAFacilityID": "100000058466",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "97-157-TV",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Five-Year Update (2009-06-15)",
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 35.54972,
  "FRS_Long": -99.29444,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054078,
      "AltID": "NGL Extraction",
      "FacilityID": 1000043769,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054869,
          "ProcessID": 1000054078,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065837,
          "ProcessID": 1000054078,
          "ChemicalID": 155,
          "Quantity": 210000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000055638,
              "ProcessChemicalID": 1000065837,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000055639,
              "ProcessChemicalID": 1000065837,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000055640,
              "ProcessChemicalID": 1000065837,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000055641,
              "ProcessChemicalID": 1000065837,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000055642,
              "ProcessChemicalID": 1000065837,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000565837,
          "ProcessID": 1000054078,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043769,
      "SummaryText": "ONEOK Field Services Company, L.L.C. (OFS - Owner/Operator)\n\nPANTHER CREEK GAS PLANT\n\n\n\nINTRODUCTION AND POLICIES\n\n\n\nONEOK Partners, L.P. (ONEOK - Parent Company) is committed to being associated with unmatched environmental performance as measured by our employees, customers, regulators, and the public.  Our management philosophy goals are achieved by the personal commitments of our employees and contractors, and by open communication with our employees, customers, neighbors, and with regulators. The accidental release prevention and emergency response programs we have at our facilities are part of the high standards for which we strive.  Our high standards are achieved by operating in compliance with all required environmental permits and regulations, by operating and maintaining our assets in such a manner that any unpermitted release will be unintentional and acknowledged as unacceptable, by remedying any shortcomings found during regular audits of our facilities, and by reporting promptly to regulators any shortcomings found during the course of our audits as required by law.\n\n\n\nSUBSTANCES HANDLED\n\n\n\nThe Panther Creek Gas Plant (Facility) is one of many facilities operated by OFS.  At the facility, we receive wellhead gas from wells via pipeline.  We separate the liquid hydrocarbons out by employing a 90,000,000 cubic feet per day cryogenic/turbo-expander/demethanizer process.  The demethanized residue gas is recompressed for delivery to customers as high pressure gas.  There is a product surge tank with a maximum capacity of 30,000 gallons which contains demethanized product.  This demethanized product is the only flammable substance at the facility in an amount greater than threshold quantity that is regulated under the Risk Management Program (RMP).  There are no RMP-covered toxic substances present at the facility in amounts greater than threshold quantity.  The facility is classified as Program Level 1 under the regulation within no public receptors in the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043769,
      "SummaryText": " Worst Case scenario endpoint distance.  The purpose of this RMP is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release should occur, our 5-year accident history, and our planned changes to improve safety at the facility.\n\n\n\nPREVENTION PROGRAM\n\n\n\nThe Panther Creek Gas Plant has been operating under the strict guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program since 1995.  Our ongoing analysis of the potential hazards of our process, detailed training of our employees, and constant emphasis on safety have helped us avoid any serious accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include:\n\n\n\n* We installed a continuously-lit flare system that will burn off any hydrocarbon vapor when high pressure is encountered within the facility.\n\n \n\n* We provided manual emergency shutdown (ESD) buttons (which are tested semiannually) at several locations within the facility in order to shutdown the entire facility during emergency situations.  The ESD system will also isolate the CRYO facility but not at the incoming field pipelines.\n\n \n\n* We have  gas detectors installed in the compressor room and in critical locations in the plant area in order to detect flammable hydrocarbon vapors and alarm the control room.\n\n \n\n* We have high pressure and low-flow shutdown switches installed on our product pipeline as well as high pressure shutdown on the demethanizer and vent of hydrocarbon vapors from the demethanizer to the flare prior to any release to atmosphere through the relief valve.\n\n \n\n* We provided fire extinguishers throughout the facility for extinguishing incipient fires.  These fire extinguishers are inspected annua"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043769,
      "SummaryText": "lly by third party inspectors and monthly by plant employees.\n\n \n\nThese safeguards as well as the vigilance of our trained employees have helped us operate safely at this facility for many years.\n\n \n\nFIVE YEAR ACCIDENT HISTORY\n\n \n\nNo incident having resulting in onsite or offsite impacts from a hydrocarbon release has occurred at the Panther Creek Gas Plant within the last five years.  Although we take pride in that record, we also place daily emphasis on our prevention and safety programs to ensure this record continues.\n\n \n\nEMERGENCY PLAN\n\n \n\nWe will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Panther Creek Gas Plant with the Custer County Department of Civil Emergency Management.  Also involved in emergency response for the facility would be the Clinton Fire Department, Clinton Sheriff, Clinton Hospital, Canute Volunteer Fire Department, and the Oklahoma Department of Public Safety.  The Panther Creek Gas Plant Operator is responsible for coordinating all emergency actions.  A specific Emergency Response Plan (ERP) for the facility is in place and that plan has been coordinated with local officials, along with evacuation procedures and training.  Our ERP provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\n \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n \n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the Panther Creek Gas Plant.  Some of the key components of the safety improvements we expect to achieve are as follows:\n\n \n\n* The Management of Change provisions ensures that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.  The Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043769,
      "SummaryText": "hereby leading to continual improvements in our safety standards.\n\n  \n\n* The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\n\n\n\n* Internal compliance audits will ensure we maintain and increase our level of safety protection.  An ongoing dialogue with the Custer County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community.\n\n\n\n* We encourage all interested citizens or community organizations to contact the Custer County Emergency Management Director for the latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis."
    }
  ]
}