{
  "FacilityID": 1000006455,
  "FacilityName": "Rosemount LPG Terminal",
  "FacilityStr1": "15938 Canada Circle",
  "FacilityStr2": null,
  "FacilityCity": "Rosemount",
  "FacilityState": "MN",
  "FacilityZipCode": "55068",
  "Facility4DigitZipExt": "1736",
  "FacilityCountyFIPS": "27037",
  "LEPC": "Dakota County LEPC",
  "FacilityLatDecDegs": "44.718510",
  "FacilityLongDecDegs": "-093.131484",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.nglenergypartners.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "NGL Supply Terminal Company LLC",
  "Company2Name": "NGL Energy Partners LP",
  "CompanyDUNS": 0,
  "Company2DUNS": 965465086,
  "OperatorName": "NGL Supply Terminal Company LLC",
  "OperatorStr1": "550 W. County Road 125 S.",
  "OperatorStr2": null,
  "OperatorCity": "Lebanon",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46052",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Fansher",
  "RMPTitle": "Manager of Terminal Operations",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000188423",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-15 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-11-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007558,
      "AltID": "LPG Terminal",
      "FacilityID": 1000006455,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000007685,
          "ProcessID": 1000007558,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008464,
          "ProcessID": 1000007558,
          "ChemicalID": 118,
          "Quantity": 3990168.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000008465,
          "ProcessID": 1000007558,
          "ChemicalID": 98,
          "Quantity": 8048632.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508464,
          "ProcessID": 1000007558,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508465,
          "ProcessID": 1000007558,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006455,
      "SummaryText": "Accidental release prevention and emergency response policies:\n\nThe Rosemount Terminal has implemented all the elements of an EPA 40 CFR Part 68 Accidental Release Prevention Requirements, Program 3 Risk Management Plan (RMP) and all the elements of OSHA 29 CFR Part 1910.119 Process Safety Management (PSM) of Highly Hazardous Chemicals regulation.  The Rosemount Terminal complies with National Fire Protection Association NFPA-58 Liquefied Petroleum Gas Code requirements for LP-Gas Storage, and it is company policy to adhere to all applicable federal, state, and local laws.  If an emergency were to occur, it is company policy to notify the Rosemount, MN Fire Department and request that they respond to the emergency.\n\nThe Stationary Source and Regulated substances:\n\nThe Rosemount Terminal is a bulk liquefied petroleum gas terminal that receives butane and propane by rail car and truck transport, and propane by pipeline.  Butane and propane is stored at the Rosemount Terminal and distributed by customer truck transports.\n\nGeneral Accidental Release Prevention Program:\n\nThe  Rosemount Terminal has developed and implemented the all the elements of the EPA 40 CFR Part 68 Accidental Release Prevention Requirements, Program 3 Risk Management Plan (RMP) and all the elements of OSHA 29 CFR Part 1910.119 Process Safety Management (PSM) of Highly Hazardous Chemicals regulations.  The Rosemount Terminal adheres to the National Fire Protection Association NFPA-58 Liquefied Petroleum Gas Code requirements for LP-Gas Storage and all applicable federal, state, and local laws.\n\nProcess Safety Information (PSI):\n\nThe Rosemount Terminal has compiled written process safety information for all PSM covered processes.  The process safety information includes the hazards of chemicals used or produced in the process, process technology information, and process equipment data.  The process safety information is updated whenever process changes are made using management of changes and pre-star"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006455,
      "SummaryText": "tup safety reviews.\n\nAccurate and complete process safety information enables the Rosemount Terminal employees involved in operating and maintaining the terminal to identify and understand the hazards of the process.  Process safety information is used to conduct process hazard analysis on the existing process or a proposed modification to a process.\n\nProcess Hazard Analysis (PHA):\n\nThe Rosemount Terminal is committed to performing a detailed hazard analysis of each covered process to identify, evaluate, and control hazards involved in the processes.  Each process is systematically examined to identify potential hazards, controls in place to manage these hazards, and recommend additional controls, as appropriate.\nThe Rosemount Terminal uses the hazard and operability (HAZOP) and check list PHA methodologies, which are conducted by a team of people who have operating and maintenance experience, engineering expertise and PHA facilitator training.  The PHA team identifies and evaluates potential hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and / or mitigation measures.\n\nAs a minimum the Rosemount Terminal performs periodic PHA reviews or revalidations every 5 years as long as the process is operating.\n\nPHA findings and recommendations and their resolution are documented.  The Rosemount Terminal has implemented a system to address and resolve all PHA findings and recommendations in a timely manner through a written schedule.  All PHA findings and recommendation resolutions are communicated to all effected employees.  All recommendations must be resolved and documented by management.\n\nOperating Procedures (OP):\n\nThe Rosemount Terminal has developed and implemented written operating procedures that describe the tasks that terminal operators and transport drivers must perform, the safe process operating parameters that must be maintained, and safety precautions for operations and maintenance "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006455,
      "SummaryText": "activities.\n\nThe Rosemount Terminal written operating procedures address steps for each operating phase, including: (1) initial start-up, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) emergency operations, (6) normal shutdown, and (7) start-up after turnaround.\n\nThe Rosemount Terminal written operating procedures state the operating limits including the consequences of deviation and the steps required to correct or avoid the deviation.\n\nThe Rosemount Terminal written operating procedures describe all the process safety systems and their functions.\n\nThe Rosemount Terminal written operating procedures are reviewed and certified annually for current practices and accuracy.\n\nSafe Work Practices and Procedures:\n\nThe Rosemount Terminal has developed and implemented safe work practices in accordance with the OSHA 29 CFR Part 1910 requirements that include methods for controlling plant entry, presence and exit of support personnel, and lockout/ tagout procedures to ensure isolation of energy sources for equipment undergoing maintenance, hot work procedures and permits for work with the potential for generating ignition sources in the presence of flammable or combustible material, and confined space entry permits and procedure to ensure that adequate precautions are in place before entry is allowed into a permit required confined space.\n\nTraining:\n\nThe Rosemount Terminal has developed and implemented formal operator and maintenance training programs.  Initial training insures that new or reassigned personnel are trained in an overview of the process and operating procedures.  Refresher training is performed at least every three (3) years to ensure that the operator understands and adheres to the current operating procedures of the process.  Employees are tested to demonstrate their understanding of the training and competency.\n\nContractors:\n\nThe Rosemount Terminal has developed and implemented a program to ensure that contractors used to supple"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000006455,
      "SummaryText": "ment its workforce to perform maintenance, renovation or specialty work on or near RMP / PSM covered processes are qualified to perform the work and are informed of the potential hazards.  The Rosemount Terminal personnel monitor the contractor activities throughout all maintenance, renovation or specialty work on or new RMP / PSM covered processes.\n\nPre-startup Safety Reviews (PSSR):\n\nThe Rosemount Terminal requires a pre-startup safety review (PSSR) to be performed and documented for any physical modification in the PSM covered processes.  Additionally, any new units added at the Rosemount Terminal which is considered PSM covered processes will also require a PSSR to be performed and documented.\n\nMechanical Integrity:\n\nThe Rosemount Terminal has developed and implemented procedures to maintain the on-going mechanical integrity of critical process equipment in accordance with National Fire Protection Association NFPA-58 Liquefied Petroleum Gas Code requirements for LP-Gas Storage and industry recognized and generally accepted good engineering practices.\nInspections and tests are documented and deficiencies outside of the acceptable limits are corrected before further use or in a safe and timely manner.  \n\nHot Work Permits:\n\nThe Rosemount Terminal has developed and implemented a hot work permit system in accordance with the OSHA 29 CFR Part 1910 requirements for hot work operations conducted on or near a covered process.\n\nManagement of Change:\n\nThe Rosemount Terminal requires that a management of change (MOC) be performed for any modification to equipment, procedures, products and process parameters of a PSM covered process.  \n\nIncident Investigation:\n\nThe Rosemount Terminal requires that any incidents that resulted in the release of regulated substances, or a near miss, must be investigated as soon as possible, but no later than 48 hours following the incident.  The Rosemount Terminal has established a system to promptly address and resolve incident investigation f"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000006455,
      "SummaryText": "indings and recommendations.  \n\nCompliance Audits:\n\nThe Rosemount Terminal conducts audits on a regular basis to ensure that the facility is in compliance with applicable all the elements of the EPA 40 CFR Part 68 Accidental Release Prevention Requirements, Program 3 Risk Management Plan (RMP), all the elements of OSHA 29 CFR Part 1910.119 Process Safety Management (PSM) of Highly Hazardous Chemicals regulation, and the requirements of the National Fire Protection Association NFPA-58 Liquefied Petroleum Gas Code requirements for LP-Gas Storage and all applicable codes and regulations.\n\nFive-year Accident History:\n\nNo release of a regulated substance has occurred in the last 5 years.  \n\nEmergency Response Program Information:\n\nThe Rosemount Terminal Emergency Response Plan is site-specific.  It includes required actions by plant employees as well as required notification and coordination with local responders and agencies. All employees are trained in the execution of the Emergency Response Plan and drills are conducted.\nEmergency response program changes are administered through the MOC process.\n\nTrade Secrets:\n\nThere are no trade secrets applicable to the Rosemount Terminal processes.\n\nPlanned Changes to Improve Safety:\n\nThe Rosemount Terminal is adding remotely actuated safety valves on all LPG storage tanks in accordance with the requirements of the National Fire Protection Association NFPA-58 Liquefied Petroleum Gas Code requirements for LP-Gas Storage.\n"
    }
  ]
}