{
  "FacilityID": 1000097985,
  "FacilityName": "Molnlycke Manufacturing US, LLC (Formally Rynel )",
  "FacilityStr1": "11 Twin Rivers Dr.",
  "FacilityStr2": null,
  "FacilityCity": "Wiscasset",
  "FacilityState": "ME",
  "FacilityZipCode": "04578",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "23015",
  "LEPC": "Lincoln County LEPC",
  "FacilityLatDecDegs": "43.962029",
  "FacilityLongDecDegs": "-69.695767",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.molnlycke.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 77477412,
  "ParentCompanyName": "Molnlycke Mnaufacturing US, LLC",
  "Company2Name": null,
  "CompanyDUNS": 165301032,
  "Company2DUNS": null,
  "OperatorName": "Molnlycke Manufacturing US LLC",
  "OperatorStr1": "11 Twin Rivers Drive",
  "OperatorStr2": null,
  "OperatorCity": "Wiscasset",
  "OperatorStateFIPS": "ME",
  "OperatorZipCode": "04578",
  "OperatorZipCodeExt": null,
  "FTE": 115,
  "OtherEPAFacilityID": "04578RYNLN11TWI",
  "EPAFacilityID": "100000217865",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-05-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-10-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-12-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-12-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-12-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 43.96022,
  "FRS_Long": -69.69569,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000121396,
      "AltID": "foam production",
      "FacilityID": 1000097985,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000152026,
          "ProcessID": 1000121396,
          "ChemicalID": 20,
          "Quantity": 13806.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000152025,
          "ProcessID": 1000121396,
          "ChemicalID": 44,
          "Quantity": 55226.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000122769,
          "ProcessID": 1000121396,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000097985,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-12-01 00:00:00",
    "ERTrainingDate": "2021-11-17 00:00:00",
    "CoordinatingAgencyName": "Lincoln County EMA",
    "CoordinatingAgencyPhone": "2078827332",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Code of Maine Rules Chapter 851 and 855 (applicable sections only)"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000097985,
      "SummaryText": "ion Control and Cleanup Plan for Hazardous Matter (in accordance with Title 38 M.R.S.A., Section 1318-C) and a Facility Emergency Response Plan (in accordance with Title 37-B, Section 795).  This ICP addresses the storage, handling and management requirements of BASF Luprenate as well as the emergency response procedures and protocols for managing a release of BASF Luprenate.  Emergency Coordinators and other responsible persons are trained annually on the implementation of the ICP including the types of response required for managing an incidental release of BASF Luprenate or one requiring an emergency response. Molnlycke conducts a mock drill of the ICP on an annual basis in accordance with Title 38 M.R.S.A., Section 795(2) and invites representatives from the Town of Wiscasset Fire and Police departments, and the Lincoln County Emergency Management Agency (LCEMA) to participate.  Molnlycke also maintains annual emergency response agreements with the Town of Wiscasset Fire and Police departments, LCEMA, NRC/US Ecology (formally ENPRO Services), Inc. (local emergency response contractor), Mid Coast Hospital, Lincoln Health Hospital and the Maine Department of Environmental Protection.\r\n\r\nF.\tPlanned Changes to Improve Safety\r\nThere have been no accidents or accidental (non-incidental) releases of TDI at Molnlycke since it began manufacturing operations at its Wiscasset facility in 2005.  Changes have been made to prevent spills and improve safety such as storing TDI behind barricades on spill pallets, safe handling by instituting  siphon tubes, and annual training of all employees, including all new hires receiving this training during the first few days of employment."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000097985,
      "SummaryText": "e also conducts annual exercise of its Emergency Evacuation Plan.   Molnlycke has employees with considerable education (chemists and engineers) and experience and are very knowledgeable working with TDI.\r\n\r\nB.\tRegulated Substances Handled at Molnlycke\r\nMolnlycke stores and uses BASF Luprenate which contains 80% 2,4-toluene diisocyanate (TDI) and 20% 2,6-TDI, both of which are listed in 40 CFR Section 68.130 as regulated substances under the RMP.  Since Molnlycke stores 10,000 pounds or more of BASF Luprenate in an area within their warehouse, it is required to comply with EPA's RMP.  Luprenate is used in manufacturing operations at the facility to produce polyurethane pre-polymer which is used in the production of hydrophilic polyurethane foam products. Included in Molnlycke's product lines are advanced wound care products which were developed to meet the medical market demand for wound care devices.\r\n\r\nC.\tThe General Accidental Release Program and Chemical-Specific Prevention Steps\r\nIn addition to being subject to EPA's RMP at the Program 1 Level, Molnlycke is subject to 29 CFR 1910.38, OSHA's Emergency Action Plan, CMR Chapter 851 and 855 for Hazardous Waste Contingency Planning and Title 37-B M.R.S.A. Section 795(1) and EPCRA for Facility Emergency Response Planning for an Extremely Hazardous Substance (TDI).  Molnlycke conducts periodic internal environmental and safety audits that review environmental and safety requirements for the storage of TDI on site. \r\n\r\nD.\tThe Five-Year Accident History\r\nMolnlycke has not had any accidents that have resulted in any offsite death, injury or response or restoration activities at an environmental receptor that were associated with the release of Luprenate since it began operations in 1973, as of reporting today 12/1/2021.\r\n\r\nE.\tThe Emergency Response Program\r\nMolnlycke has developed an Integrated Contingency Plan (ICP) which incorporates a Hazardous Waste Contingency Plan (in accordance with 40 CFR 264.52), a Spill Prevent"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000097985,
      "SummaryText": "Executive Summary for Risk Management Plan\r\nMolnlycke Manufacturing US, LLC (Molnlycke) (Formally known as Rynel Inc.)\r\nWiscasset, Maine\r\n\r\nMolnlycke Manufacturing US, LLC (formally known as Rynel Inc. (Rynel)) has prepared the following elements of an Executive Summary in accordance with 40 CFR Section 68.155 as a component of its Risk Management Plan (RMP):\r\n\r\nA.\tAccidental Release Prevention and Emergency Response Polices at Molnlycke Manufacturing US, LLC \r\nMolnlycke takes the onsite storage and use of toluene diisocyanate very seriously and has developed and incorporated safety and emergency response procedures in its operating procedures to ensure the safety of its employees and the surrounding community.  Molnlycke has conducted a hazard analysis of storing TDI drums in their warehouse and has implemented additional safety procedures to minimize the accidental release of TDI.  Some of these procedures include TDI drum designation and segregation, secondary containment, protection from fork lift driver error, storage location away from shipping doors, etc.).  Spill response equipment is readily available and fully stocked and inspected monthly.  Molnlycke has prepared a neutralizing solution that can be applied immediately to any TDI spill.  Once applied, the neutralizing solution will react with TDI removing its toxic component.  Employees who work with TDI have received Integrated Contingency Plan, Hazard Communication and respirator training.  Molnlycke has a written respiratory program and respirator fit test and pulmonary tests are conducted on applicable employees annually.  The employees (who work with TDI and Emergency Responders) have received training on the proper application of the neutralizing solution.  As mentioned below, Molnlycke conducts annual training on the implementation of its Integrated Contingency Plan (which includes the Facility Emergency Response Plan for TDI) and a mock drill of the ICP with emergency responding agencies.  Molnlyck"
    }
  ]
}