{
  "FacilityID": 1000081012,
  "FacilityName": "Water Reclamation Plant No. 7",
  "FacilityStr1": "80-609 Avenue 38",
  "FacilityStr2": null,
  "FacilityCity": "Indio",
  "FacilityState": "CA",
  "FacilityZipCode": "92201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.771806",
  "FacilityLongDecDegs": "-116.258278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "LC",
  "FacilityURL": "www.cvwd.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Coachella Valley Water District",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Coachella Valley Water District",
  "OperatorStr1": "80-609 Avenue 38",
  "OperatorStr2": null,
  "OperatorCity": "Indio",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92201",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": "CAL000356670",
  "EPAFacilityID": "100000167632",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-03-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-07-15 12:40:59",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-15 12:40:59",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-07-15 12:40:59",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 33.771806,
  "FRS_Long": -116.258278,
  "FRS_Description": "LOADING AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101270,
      "AltID": "Chlorination",
      "FacilityID": 1000081012,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126926,
          "ProcessID": 1000101270,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000102532,
          "ProcessID": 1000101270,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000085517,
              "Process_NAICS_ID": 1000102532,
              "SafetyReviewDate": "2019-04-02 00:00:00",
              "PHA_Date": "2019-04-04 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-10-21 00:00:00",
              "TrainingReviewDate": "2019-06-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-06-01 00:00:00",
              "EquipmentInspectionDate": "2019-06-28 00:00:00",
              "EquipmentTested": "vacuum regulator and lines",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2019-06-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2019-05-22 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-06-01 00:00:00",
              "HotWorkPermitReviewDate": "2017-12-01 00:00:00",
              "ContractorSafetyReviewDate": "2019-06-21 00:00:00",
              "ContractorSafetyEvalDate": "2019-06-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000106677,
                  "PreventionProgram3ID": 1000085517,
                  "ProcessChemicalID": 1000126926
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081012,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-01-01 00:00:00",
    "ERTrainingDate": "2018-06-07 00:00:00",
    "CoordinatingAgencyName": "Riverside County Fire Department",
    "CoordinatingAgencyPhone": "7608637075",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081012,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nThis document comprises the Five Year Update for the Federal Risk Management Plan (Federal RMP Plan)and the California Accidental Release Prevention Program Risk Management Plan (CalARP RMP) for Water Reclamation Plant No. 7 located at 63-002 Fillmore Street, Thermal California 92254 (hereinafter referred to as WRP No. 7 or the Plant). The Plant is owned and operated by the Coachella Valley Water District (with a mailing address of P.O. Box 1058; Coachella, California 92236). The purpose of this document is to comply with the risk management plan requirements as set forth in the Code of Federal Regulations, Title 40, Part 68 (also known as the Federal Risk Management Plan Regulations) and the California Code of Regulations, Title 19, Division 2, Chapter 4.5, Article 3, Section 2745.3 (also known as the California Accidental Release Prevention Program Risk Management Plan - CalARP RMP Regulations).\r\nThe scope of the Federal RMP and CalARP RMP includes all operations conducted at the subject facility that involve the storage, handling and/or use of chlorine at WRP7.\r\n\r\nPolicy Statement\r\nIt is the Policy of the Coachella Valley Water District (District) to conduct all District activities safely to prevent job related accidents, illnesses, and injuries to employees and others and damage to District and Others' property. A well organized safety program provides a safe working environment and promotes increased efficiency at ALL levels (IIPP).\r\nES 1.0 DESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\r\nThe primary operation conducted at WRP No. 7 is the treatment of wastewater (NAICS Code 22132 - Sewage Treatment Facilities). WRP No. 7 uses chlorine to disinfect secondary effluent before the effluent is discharged to an irrigation customer. The Plants are manned on the day shift and the processes areas monitored 24-hours per day, 7-days per week, 365-days per year at the District Headquarters located in Coachella.\r\nMaximum Inventory of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081012,
      "SummaryText": "Regulated Substances\r\nThe District's Maximum intended Inventory of Chlorine and is 16,000-pounds each (i.e., eight one ton cylinders).\r\n \r\nSite Security\r\nIn order to ensure the security of the site, the District has erected a chain link fence around the entire site. Additionally, the site is equipped with a perimeter security system. Lastly, ALL building entries are equipped with intruder alarms to alert control of unauthorized access. These site security provisions are intended to prevent unauthorized access to areas of the Plant where chlorine is stored, handled or used and seek to provide an added level of safety for the storage of chlorine at the plant.\r\n\r\nES 2.0 ACCIDENTAL RELEASE SCENARIOS\r\nThe Federal RMP regulations and the CalARP RMP regulations require that at least two types of release scenarios be evaluated for their potential to impact off-site populations: the worst case release; and an alternative release (an accident scenario that is more credible than the worst-case release scenario). A number of hypothetical accidental release scenarios were postulated and evaluated for the Five Year Federal RMP/CalARP RMP Update, included those listed in the RMP requirements. These scenarios were categorized into worst-case release scenarios and alternative release scenarios. Each of these categories of hypothetical accidental release scenarios is discussed below.\r\n\r\nCHLORINE\r\nWorst-Case Release Scenarios for Chlorine. In this scenario, one of the one-ton containers on site experiences a catastrophic failure due to an unknown event. This scenario could be initiated by an external event (i.e., an airplane crash or earthquake) impacting the storage enclosure or area where the one ton containers are located. It is highly improbable that this scenario would be initiated by a seismic event. However, the possibility of this scenario being initiated by a seismic event cannot be completely discarded. This scenario is considered to be extremely unlikely. In the extremely u"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081012,
      "SummaryText": "nlikely case that this scenario occurs, up to 2,000-pounds of chlorine could be released (in the worst-case). The release would occur to the outdoors. It was assumed that the chlorine released during the catastrophic accident forms a cloud of vapor which is then free to migrate off-site. Offsite receptors within the impact zone were then determined through the use of MARPLOT and the USGS maps. \r\n\r\nAlternative Release Scenarios\r\nAlternative release scenarios which are considered to be more likely to occur are those which may result in the release of anywhere from less than one-pound to up to 2000 -pounds (worst case). These scenarios include situations such as delivery of a leaking one-ton container to the Plant, a pinhole leak in the transfer piping, a partial or complete failure of the transfer lines (100-percent vapor) at various points in the system (out-doors or in-doors), the rupture or separation of the flexible connections from the online one-ton container, or a leak from the valve assembly of the one ton container. In order to be conservative in the estimation of the impact zone.  For these scenario's it was assumed that an accident would occur which involved the valve assembly on an online one ton container. It was assumed that the chlorine or released during the catastrophic accident forms a cloud of vapor which is then free to migrate off-site. Offsite receptors within the impact zone were then determined through the use of MARPLOT and the USGS maps.\r\n\r\nES 3.0 FIVE YEAR ACCIDENT HISTORY\r\nDuring the five years preceding the submittal of the Five Year Federal RMP/CalARP RMP Update, WRP 7 has NOT had any accidental releases of chlorine  that have resulted in: Onsite deaths, injuries, or significant property damage; or Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\r\n\r\nES 4.0 ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS/DEVICES\r\nThe Accidental Release Prevention Progra"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081012,
      "SummaryText": "m consists of a series of programs, procedures and policies designed to minimize the risk of accidental releases involving chlorine. These programs include design and operating controls such as compliance with specified codes, the District's health and safety program, numerous standard operating procedures, the equipment inspection and maintenance program (including a mechanical integrity and preventive maintenance program), the management of change program, pre-start-up review, fire protection and hot work permit programs, management of- and safety of- contractors, accident/incident investigation procedures, emergency response plan, the Federal RMP/CalARP RMP/OSHA PSM Program compliance auditing program, the Federal RMP/CalARP RMP/OSHA PSM Program recordkeeping program and a variety of personnel training programs. Details of each of these components of the Plant's Accidental Release Prevention Program are provided in the document entitled Federal Risk Management Plan (Federal RMP), California Accidental Release Prevention Program Risk Management Plan (CalARP RMP), OSHA Process Safety Management (OSHA PSM) Program. It is highly unlikely that the Worst Case Release Scenario or Alternative Release Scenarios will occur at the plants for the following reasons:\r\nThe process and process areas are inspected daily; The containers and storage rooms are monitored 24-hours per day, 7-days per week, 365-days per year for process leaks via automatic leak detectors; The leak detectors are considered critical equipment and thus are incorporated into the Mechanical Integrity Program. As such, each detector is well maintained and tested twice each month; all storage, handling and use area entry doors are equipped with intruder alarms to guard against unauthorized entry and/or vandalism; all one ton containers are inspected prior to acceptance and storage onsite; all one-ton containers stored/managed onsite are secured in-place via two chain binders to prevent movement or dislodging"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081012,
      "SummaryText": "due to seismic events; and all Plant Operators and Members of the Emergency Response Team are trained to respond to- and stop process leaks.\r\nThere are a number of detection and monitoring devices and alarms designed to ensure the continued safe operation. These devices are located throughout the Plant and monitor various aspects of Plant Operations.\r\n\r\nAlarms\r\nWRP No. 7 is equipped with Leak Detectors that are designed to detect chlorine in the chlorine storage and use areas at or above 1-ppm. When one of these detectors senses a gas leak at or above 1.0-ppm, audible alarms activate locally and an alarm is transmitted to District Control at Headquarters. At 3-ppm the visual alarm(beacon light) on top of the building is activated. Ventilation fans in the chlorinator room run constantly 24-hours per day. The alarms can only be reset and cleared after the leak detectors sense less than 1-ppm of gas. The alarms are tested by District Operators twice each month. Additionally, the District's Communications Shop inspects, tests and calibrates the chlorine alarm system on a monthly schedule.\r\n\r\nES 5.0 EMERGENCY RESPONSE\r\nThe Coachella Valley Water District recognizes that emergency planning and emergency response are an integral component of risk management. As such, the District, as part of its hazardous materials business plan (HMBP) and Emergency Response Program for Water Reclamation Plant No. 7, has developed and implemented an emergency response plan and an emergency evacuation plan.\r\n\r\nCall Outs\r\nWhen a gas leak alarm occurs during the hours that a Plant is staffed, the Plant Operators will respond to the leak with three operators. The Chlorine Response Team can be dispatched to the Plant during the staffed hours if the Plant Staff are unable to respond to the leak with a three person crew.  When control receives a gas leak alarm after hours, the Control Operator will call out the Chlorine Response Team and the Sanitation Standby Operator. Upon arrival at the scene,"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000081012,
      "SummaryText": "both will wait at the entrance gate for the other to arrive and will enter the Plant together.\r\n\r\nResponse Teams\r\nEmergency response and any work with chlorine connections requires a minimum of three employees to be present. ALL Plant Operators are trained in Emergency Response.  After hours this two-person crew responds with the standby operator to unmanned Plants or to other Plants that may need assistance. There are always three employees on call with pagers ready to respond to chlorine emergencies. The on call crew is rotated weekly.\r\n\r\nTraining\r\nChlorine response personnel are scheduled to be trained quarterly in the use of emergency repair kits, the use of personal protective equipment (PPE), and District Emergency Response Procedures. Furthermore, emergency response personnel are trained annually in the safe storage and handling and in CPR/First Aid.\r\n \r\nResponse to Minor Leaks\r\nTwo employees will respond with Self-Contained Breathing Apparatuses (SCBAs), Chlorine B Repair Kits, gloves and a bottle of 26 Baume Ammonia. The third crew member will also respond with an SCBA and stay near the truck radio.\r\nThe first and second person will don their SCBAs, keeping each other in sight at all times. Using the ammonia, they will locate the chlorine leak. Once the leak is located and confirmed to be a system leak and not a vessel tank, the gas supply valve on the container can be shut off by turning the valve clockwise one full turn. When this has been done, the Third Crew Member will let Control know whether repairs have been made or if further assistance is needed.\r\n\r\nResponse to Major Leaks\r\nThe District's response to Major Leaks is similar to its response for Minor Leaks, except that the Response Team will wear fully encapsulated suits if a severe gas leak has occurred or if the Response Team finds a vessel/tank leak. The Third Crew Member will notify Control to send Police and Fire Department Personnel to the scene to secure and evacuate the surrounding area,"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000081012,
      "SummaryText": "as necessary. The District's standby personnel and Environmental Safety Specialist will be called as well.\r\n\r\nES 6.0 PLANNED CHANGES TO IMPROVE SAFETY\r\nEmergency ventilation scrubbers are being designed; these scrubbers are expected to be installed by late 2019.  Additional internal and external WRP cameras, relayed to the central operators controls room (which is manned 24/7) will be installed.  Door entries at each building are also being automated to limit access to just those authorized.\r\n \r\nES 7.0 FOR MORE INFORMATION\r\nThe Coachella Valley Water District recognizes that some persons may be interested in obtaining more detailed information regarding the Five Year Federal RMP and CalARP RMP Update and various Prevention Program components not discussed herein. Interested parties that have additional questions regarding the Risk Management Plan for Water Reclamation Plant No. 7 and or the Prevention Program, are directed to contact:\r\nMr. Carlos Huerta \r\nEnvironmental Safety Specialist\r\nc/o Coachella Valley Water District\r\nREF: Water Reclamation Plant No. 7\r\nP.O. Box 1058\r\nCoachella, California 92236"
    }
  ]
}