{
  "FacilityID": 1000025681,
  "FacilityName": "Atlantic Beach WTP # 2",
  "FacilityStr1": "City of Atlantic Beach WTP #2",
  "FacilityStr2": "2301 Mayport Road",
  "FacilityCity": "Atlantic Beach",
  "FacilityState": "FL",
  "FacilityZipCode": "32233",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12031",
  "LEPC": "District 4 LEPC",
  "FacilityLatDecDegs": "30.349537",
  "FacilityLongDecDegs": "-81.41213",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.coab.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 81944514,
  "ParentCompanyName": "City of Atlantic Beach",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Atlantic Beach",
  "OperatorStr1": "902 Assisi Lane",
  "OperatorStr2": null,
  "OperatorCity": "Atlantic Beach",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32233",
  "OperatorZipCodeExt": "2855",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000121192",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-03-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-01-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-01-09 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-01-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-01-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.349167,
  "FRS_Long": -81.411944,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000031511,
      "AltID": "Chlorination of Water",
      "FacilityID": 1000025681,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000038177,
          "ProcessID": 1000031511,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000031793,
          "ProcessID": 1000031511,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000021549,
              "Process_NAICS_ID": 1000031793,
              "SafetyReviewDate": "2015-03-16 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2014-03-19 00:00:00",
              "ChangeCompletionDate": "2014-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Man made/Terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "projectile shield",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-07-28 00:00:00",
              "TrainingReviewDate": "2014-03-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-03-19 00:00:00",
              "EquipmentInspectionDate": "2016-03-25 00:00:00",
              "EquipmentTested": "Cl2 equipment, monitors",
              "ComplianceAuditDate": "2014-07-08 00:00:00",
              "AuditCompletionDate": "2014-10-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2015-03-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000021875,
                  "PreventionProgram2ID": 1000021549,
                  "ProcessChemicalID": 1000038177
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000025681,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-12-27 00:00:00",
    "ERTrainingDate": "2016-12-27 00:00:00",
    "CoordinatingAgencyName": "Jacksonville Fire Department",
    "CoordinatingAgencyPhone": "9046302472",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000025681,
      "SummaryText": "The City of Atlantic Beach (COAB) Public Works Department operates the COAB Water                             Treatment Plant (WTP) #2 located at 2301 Mayport Road, Atlantic Beach, Duval Country, Florida. This facility is one of five water and wastewater plants operated by the City. WTP #2 and three other plants have quantities of regulated hazardous chemicals above the EPA threshold. The City has a unified Risk Management Program which applies to each plant. Only WTP #2 operations and policies are presented in this Plan.\r\n\r\n1.\tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \r\nCOAB WTP #2 Accidental Release Prevention Program involves a unified approach that integrates technologies, procedures and management practices. The prevention program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR 68.\r\n\r\n2.\tMANAGEMENT SYSTEM \r\nCOAB has a management system in place which is led by the Deputy Public Works Director, who oversees the implementation and on-going use of the RMP elements. This program, along with other City-wide and plant-specific policies, eliminates and /or reduces the likelihood of a hazardous chemical release at the plant.\r\n\r\n3.\tPREVENTION PROGRAM LEVEL 2 \r\nCOAB maintains policies, procedures, and systems as part of their prevention program. These are applied to WTP #2 and each COAB treatment plant. The COAB program addresses each of the elements needed to implement the EPA RMP Program Level 2, which are also addressed in the OSHA Process Safety Management (PSM) program. Being a public entity, COAB is subject to only the EPA RMP Level 2 Prevention Program. The policies and procedures are maintained in the COAB Document Management System (DMS).\r\n\r\n4.\tSITE DESCRIPTION \r\nThe site is owned and operated by the City of Atlantic Beach. The site is located at 2301 Mayport Road, Atlantic Beach, Duval County, Florida. The site is bordered by a mini-storage warehouse on the north"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000025681,
      "SummaryText": "and Mayport Road on the west, and a golf course on the east and south. The facility includes a chlorine storage and distribution system contained in a specially designed storage and process building. The boundaries of the chlorine system subject to the RMP regulation include the Bulk Chlorine Storage and Feed Control rooms and the associated vent make up and exhaust systems. These are detailed in the Process and Instrument Drawings (P&IDs) which are part of the plant Process Safety Information (PSI).\r\nCOAB WTP# 1 employs two full-time employees engaged in water treatment plant and field operations. Chlorine is used as part of the treatment process.\r\n\r\n5.\tREGULATED SUBSTANCE \r\nChlorine is the only regulated substance onsite which exceeds the 40 CFR 68 threshold quantity. The COAB chlorine process was installed as part of the process of purifying water for public consumption. It operates under permit from the State of Florida Department of Environmental Protection (FDEP). The chlorine is received, stored and distributed to the process control systems.  Chlorine is an EPA and OSHA-listed toxic chemical. It is an irritant and it is corrosive. Chlorine is a halogen with the formula Cl2. It is a chlorinating or oxidizing agent that is not flammable. It has a 1 ppm OSHA ceiling Permissible Exposure Limit (PEL) and a NFPA health rating of 4, severe; with immediate and delayed health hazards. Chlorine is not a carcinogen.\r\n\r\n6.\tWORST AND ALTERNATIVE CASE RELEASE SCENARIOS \r\nTwo offsite consequence analyses were conducted which include two chlorine release scenarios.\r\nThe first is a \"worst case release\". The second is a more probable \"alternative release scenario\". The first scenario is defined by EPA, which states that \"the ... shall assume that the ... maximum quantity in the largest vessel ... is released as a gas over 10 minutes\" due to an unspecified failure.  The alternative scenario is defined as \"more likely to occur than the worst case scenario\".  An atmospheric disp"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000025681,
      "SummaryText": "ersion assessment was performed to determine the distance traveled by the chlorine released before its concentration decreases to the \"toxic endpoint.\" The EPA-selected endpoint for chlorine is 0.0087 mg/l or 3 parts per million (ppm). The 3 ppm endpoint is the Emergency Response Planning Guideline Level 2 (ERPG- 2). This is defined by the American Industrial Hygiene Association (AIHA) as the \"maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\" The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined, \"to estimate the population potentially affected.\"\r\n\r\na.\tWORST CASE \r\nAn atmospheric dispersion assessment for the worst case scenario was performed using the EPA assumptions. Results demonstrate a distance of ____ miles to the toxic endpoint. The residential population that could potentially be affected by the release is estimated at ______ people.\r\n\r\nb.\tALTERNATIVE CASE \r\nThe alternative release scenario involves the failure of the yoke assembly regulator of the vacuum system connected to one of the one ton-containers. This failure is equal to creating a 1/16 inch diameter hole in the yoke assembly, the drip tube, a pipe, or even the container. Assessment using the EPA water guidance demonstrated the rate of chlorine release is 20.0 lb/min. The toxic endpoint distances determined is ___ miles. The residential population potentially that would be impacted by this release is _____.\r\n\r\n7.\tACCIDENTAL RELEASE PREVENTION PROGRAM \r\nThe COAB Accidental Release Prevention Program is based on the OSHA PSM Standard.  Since the facility is a public owned entity, it is subject to the EPA RMP Level 2 Prevention Program. The COAB Prevention Program has been in place and effectively used since the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000025681,
      "SummaryText": "RMP rule was promulgated. It is part of the plants operating culture. There are two parts to the program. The first is the general overall City-wide and WTP #2 site program. The second is the chlorine-specific actions within the site program coordinated with the City of Jacksonville Fire Department.\r\n\r\na.\tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \r\nPlant-wide, many elements of the prevention program are used for all operations. The overviews of these programs are listed below:\r\n¿\tCOAB has detailed process safety information on each of its operations.\r\n¿\tThe DMS is integral to the management of change for all operations on-site control.\r\n¿\tTraining is the backbone of employee knowledge, job operations and is ongoing in each area.\r\n¿\tEmployee training in operations and maintenance emphasizes awareness of the hazardous and toxic properties of all chemicals used.\r\n¿\tRoutine and preventive maintenance are used for each piece of equipment, with the goal of maintaining mechanical integrity. \r\n¿\tIncident investigations of accidents and near-miss incidents ensure that lessons are learned from each event as well as the root causes of the incident.\r\n¿\tEmployees participate in all aspects of the plant as listed under emergency response.\r\n¿\tSafe work practices are used throughout the facility including: \r\no\tHot Work Permits, \t\r\no\tLock Out /Tag Out Permits, \r\no\tVessel Entry Permits, \r\no\tSite Security, and \r\no\tBreaking Into Chemical Lines.\r\n\r\nContractors must meet COAB safety and technical standards as part of selection and ongoing evaluations. \r\n\r\nb.\tCHLORINE-SPECIFIC RESPONSE PROGRAM \r\nChemical-specific prevention features of the plant include: the policies and procedures listed above and those of the chlorine specific program. These include:\r\n¿\tSpecific procedures for the operation of the chlorine process.\r\n¿\tCompletion of a Pre-startup Safety Review prior to startup of the modified chlorine system.  The latest review was conducted in April 2009.\r\n¿\tSpecific emergency respo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000025681,
      "SummaryText": "nse procedures for chlorine releases as outlined under both operating procedures and in the emergency response procedures.\r\n¿\tSpecific training in the properties, hazards, handling requirements, and leak repair for chlorine.\r\nFinally, the details of both facility and equipment design are key to the safe operations of the chlorine system.\r\ni.\tFacility Design\r\nThe plant and support equipment of the chlorine storage and control building meet and exceed design codes standards and good engineering practices. The building is equipped with ambient ventilation storage area and a fan-ventilated control room.\r\nii.\tEquipment Design\r\nThe low pressure chlorine system operates under a vacuum pressure of 13 inches of mercury. All the pipe, tubes, and equipment are chlorine compatible nonmetallic piping. The system is designed with a safety factor covering the typical vacuum or positive pressure in it. There is a chlorine monitor which detects the presence of chlorine in the storage building rooms. The audible alarms and lights in the plant alert employees of a potential chlorine leak, and are connected to the SCADA system to alert operators even if the plant is unmanned.\r\n\r\n8.\tFIVE-YEAR ACCIDENT HISTORY \r\nCOAB WTP #2 had no accidental releases of chlorine in the past five years per 40 CFR 67.42 (a).\r\n\r\n9.\tEMERGENCY RESPONSE PROGRAM \r\nEmergency response procedures are described in the COAB Emergency Response Plan.  Emergency phone numbers are posted at each facility, indicating who to call first and what to do if that person is unreachable. The Jacksonville Fire Department (911) is the first call listed.  The Plant also has site- specific emergency actions defined in the plant operating procedures. Emergency response drills and drill evaluations are conducted annually by the operating department. Emergency operation and response procedures are reviewed and updated based on the results of the drill.\r\n\r\nThe emergency response program is reviewed by the Jacksonville Fire Department, w"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000025681,
      "SummaryText": "hich coordinates with local Duval County Emergency Response Planning Committee (LEPC) and Jacksonville Fire Department HazMat Team, all located in Duval County, Florida. Copies of the program are given to key local agencies including the fire, medical, rescue, management, and police departments in Atlantic Beach. Besides the specific emergency response program, key elements of the prevention programs are incorporated in the operating culture of the COAB WTP # 2.\r\n\r\nThe Contingency Plan procedures detail the actions and responses to chlorine spills (releases). The plan includes training of all chlorine-area operators. The primary response team is the Jacksonville Fire and Rescue, plus the HazMat Team, who respond to severe chlorine leak situations. Actions include catastrophic, severe, and moderate leaks. A Chlorine \"B\" Leak Repair Kit is maintained on site to aid in stopping leaks. Public notification is facilitated through the Atlantic Beach Police Department, which has an automated emergency dialing message system for public notification.\r\n\r\n10.\tPERSONNEL \r\nPersonnel are the key resource of COAB prevention program. Our employees are the operators of the chlorine handling equipment. COAB fosters involvement in every aspect of the chlorine system operations including participation in:\r\n¿\tDevelopment of operating procedures,\r\n¿\tCompliance audits,\r\n¿\tHazard evaluations, and\r\n¿\tOn-going training of the operators and other involved staff.\r\n\r\n11.\tCHANGES TO IMPROVE SAFETY \r\nCOAB continually reviews implemented and potential safety improvements for all of its operations, to minimize consequences in the event of a release of chlorine."
    }
  ]
}