{
  "FacilityID": 1000101549,
  "FacilityName": "Worsham-Steed Gas Storage Facility",
  "FacilityStr1": "8151 Hwy 281 South",
  "FacilityStr2": null,
  "FacilityCity": "Perrin",
  "FacilityState": "TX",
  "FacilityZipCode": "76486",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48237",
  "LEPC": "Jack County LEPC",
  "FacilityLatDecDegs": "33.087500",
  "FacilityLongDecDegs": "-098.071667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": "https://www.nortexmidstream.com/",
  "FacilityEmailAddress": "grandall@nortexmidstream.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Williams Field Service Group LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Worsham-Steed Gas Storage, LLC",
  "OperatorStr1": "840 Gessner Road, Suite 250",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77024",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000202942",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "02488",
  "SafetyInspectionDate": "2013-05-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Submitted 6/17/2008, initial RMP",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-16 00:00:00",
  "ErrorReportDate": "2008-06-20 00:00:00",
  "ReceiptDate": "2022-07-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-07-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-07-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 33.0875,
  "FRS_Long": -98.071667,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000126059,
      "AltID": "Entire Site",
      "FacilityID": 1000101549,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000157680,
          "ProcessID": 1000126059,
          "ChemicalID": 93,
          "Quantity": 22603.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000157703,
          "ProcessID": 1000126059,
          "ChemicalID": 155,
          "Quantity": 176975.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000139269,
              "ProcessChemicalID": 1000157703,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000139245,
              "ProcessChemicalID": 1000157703,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000139246,
              "ProcessChemicalID": 1000157703,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000139247,
              "ProcessChemicalID": 1000157703,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000139248,
              "ProcessChemicalID": 1000157703,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000139249,
              "ProcessChemicalID": 1000157703,
              "ChemicalID": 94
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000127452,
          "ProcessID": 1000126059,
          "NAICSCode": "48621",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000108605,
              "Process_NAICS_ID": 1000127452,
              "SafetyReviewDate": "2021-05-18 00:00:00",
              "PHA_Date": "2018-03-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-05-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Gas detection in building and around product pumps on the cryo plant pump skid",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-05-31 00:00:00",
              "TrainingReviewDate": "2019-12-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-06-25 00:00:00",
              "EquipmentInspectionDate": "2020-08-28 00:00:00",
              "EquipmentTested": "Testing of Gas Monitors",
              "ChangeMgmtDate": "2021-03-18 00:00:00",
              "ChangeMgmtReviewDate": "2020-06-25 00:00:00",
              "PreStartupReviewDate": "2021-01-13 00:00:00",
              "ComplianceAuditDate": "2020-06-25 00:00:00",
              "AuditCompletionDate": "2021-06-03 00:00:00",
              "IncidentInvestigationDate": "2020-06-09 00:00:00",
              "InvestigationChangeDate": "2020-06-29 00:00:00",
              "ParticipationPlansReviewDate": "2014-10-01 00:00:00",
              "HotWorkPermitReviewDate": "2022-04-12 00:00:00",
              "ContractorSafetyReviewDate": "2022-05-23 00:00:00",
              "ContractorSafetyEvalDate": "2022-06-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000136184,
                  "PreventionProgram3ID": 1000108605,
                  "ProcessChemicalID": 1000157703
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101549,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-08-18 00:00:00",
    "ERTrainingDate": "2021-07-13 00:00:00",
    "CoordinatingAgencyName": "Jacksboro Fire Department",
    "CoordinatingAgencyPhone": "9405672883",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000101549,
      "SummaryText": "ng equipment deficiencies when identified, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\r\nSafe Work Practices: Worsham-Steed has long-standing safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e. hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\nManagement of Change: Worsham-Steed Gas Storage Facility has a comprehensive system to manage changes to all covered processes. This system requires that changes to items such as process equipment, technology (including process operating conditions), procedures, and other facility changes be carefully reviewed and authorized before being implemented. Changes are reviewed to ensure that adequate controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as maintenance personnel are provided any necessary training on the change.\r\n\r\nIncident Investigation: Worsham-Steed Gas Storage Facility promptly investigates all incidents that resulted in or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to gather the facts, determine the root cause, and develop corrective action to prevent the re-occurrence of th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101549,
      "SummaryText": "ve basic training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years. Training is documented for each operator including the means used to verify that the operator understood the training.\r\nContractors: Worsham-Steed uses contractors to supplement its workforce during periods for increased maintenance or construction activities. Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have appropriate skills, (3) are aware of the hazards of their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site specific safety rules, and (6) inform gas plant personnel of any hazards that they find during their work. This is accomplished by providing contractors with orientation sessions pertaining to these key points.\r\nPre-startup Safety Review (PSSR): Worsham-Steed Gas Storage Facility conducts a PSSR on any new facility or facility modification that requires a change in process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with design specifications and that all-supporting systems are operationally ready. The PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\nMechanical Integrity: Worsham-Steed facility has well established practices and procedures for maintaining process equipment. The basic aspects of this program include (1) training, (2) developing written procedures, (3) performing inspections and tests, (4) correcti"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000101549,
      "SummaryText": "e incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a re-occurrence, and forwards these results to the business management team for resolution.\r\nCompliance Audits: To help ensure that the accident prevention program is functioning properly, the Worsham-Steed Gas Storage Facility periodically conducts an audit to determine whether procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. Both hourly and staff personnel participate as audit team members. The audit team develops findings that are forwarded to Worsham-Steed Gas Storage Facility management for resolution. Corrective actions are taken in response to the audit team's findings and tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101549,
      "SummaryText": "re used to help maintain safe operation of the process. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. Chemical-specific information, including exposure hazards and emergency response / exposure treatment considerations, is provided in Safety Data Sheets (SDSs).\r\nProcess Hazard Analysis (PHA): Worsham-Steed Gas Storage Facility has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. The facility primarily uses the HAZOP technique to perform these evaluations. The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures when the team believes such measures are necessary. Periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating.\r\nOperating Procedures: Worsham-Steed Gas Storage Facility maintains written procedures that address various modes of process operations, such as startup, normal operations, temporary operations, emergency shutdown, normal shutdown, and initial startup of a new process. These procedures provide guidance for experienced operators and provide the basis for training new operators. Operating procedures are periodically reviewed and annually certified as current and accurate. The review and certification process involves both operators and technical staff.\r\nTraining: In addition to training on operating procedures, the facility has a comprehensive training program for all employees involved in operating the process. New employees recei"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101549,
      "SummaryText": "The following is a summary of the accident prevention program in place at the Worsham-Steed Gas Storage Facility. Because the processes at the plant are regulated by the Environmental Protection Agency's (EPA) Risk Management Program (RMP) and are also subject to the OSHA Process Safety Management (PSM), this summary addresses each of the OSHA PSM elements.\r\nEmployee Participation: Active employee participation and involvement in the development and implementation of Worsham-Steed Gas Storage Facility's PSM program is an important step toward achieving the objective to prevent or minimize the consequences of catastrophic releases of toxic, reactive, flammable, or explosive chemicals. Employee involvement will help to ensure that all perspectives regarding PSM are considered, and that the best ideas are implemented. Open communications are encouraged between supervisors and employees regarding all safety and health issues. Worsham-Steed Gas Storage Facility strongly promotes employee involvement in safety issues through existing programs. These programs include Unit Safety Teams (which are made up of a cross section of employees and supervision), regularly scheduled safety meetings, tail-gate safety meetings, Hazard Communication, Safety Suggestion Forms, and special training programs (emergency response training, first aid, etc.).\r\nProcess Safety Information: Complete and accurate written process safety information (PSI) concerning process chemicals, process technology, and process equipment is essential to effective PSM and RMP programs and to completing and maintaining a process hazard analysis (PHA). The PSI will be useful to the operators; the team performing the PHA; those in charge of training; contractors; those conducting pre-startup safety reviews; and those in charge of updating the emergency preparedness plans. Process safety information is readily available to all employees. Worsham-Steed Gas Storage Facility keeps a variety of technical documents that a"
    }
  ]
}