{
  "FacilityID": 1000094688,
  "FacilityName": "Delaware Basin Gas Plant",
  "FacilityStr1": "1220 County Road 101",
  "FacilityStr2": null,
  "FacilityCity": "Coyanosa",
  "FacilityState": "TX",
  "FacilityZipCode": "79730",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48389",
  "LEPC": "Reeves County LEPC",
  "FacilityLatDecDegs": "31.284161",
  "FacilityLongDecDegs": "-103.109936",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "FC",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise Field Services, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Enterprise Products Operating, LLC",
  "OperatorStr1": "P.O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77219",
  "OperatorZipCodeExt": "4324",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000232777",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-07-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-07-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-07-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117557,
      "AltID": "NGL Extraction",
      "FacilityID": 1000094688,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000147028,
          "ProcessID": 1000117557,
          "ChemicalID": 155,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000130045,
              "ProcessChemicalID": 1000147028,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000130046,
              "ProcessChemicalID": 1000147028,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000130047,
              "ProcessChemicalID": 1000147028,
              "ChemicalID": 98
            }
          ]
        },
        {
          "ProcessChemicalID": 1000147029,
          "ProcessID": 1000117557,
          "ChemicalID": 98,
          "Quantity": 1600000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000147030,
          "ProcessID": 1000117557,
          "ChemicalID": 155,
          "Quantity": 1300000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000130048,
              "ProcessChemicalID": 1000147030,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000130049,
              "ProcessChemicalID": 1000147030,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000130050,
              "ProcessChemicalID": 1000147030,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000130051,
              "ProcessChemicalID": 1000147030,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000130052,
              "ProcessChemicalID": 1000147030,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000130053,
              "ProcessChemicalID": 1000147030,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000130054,
              "ProcessChemicalID": 1000147030,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118911,
          "ProcessID": 1000117557,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094688,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Reeves County LEPC",
    "CoordinatingAgencyPhone": "4324481531",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094688,
      "SummaryText": "Delaware Basin Gas Plant\n\nEnterprise Products Operating LLC.\n\nExecutive Summary\n\nRisk Management Plan\n\nEPA Identifier:  1000 0023 2447\n\n\n\nAccidental Release Prevention and Response\n\n\n\nAt Enterprise, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n\n\n* A description of our facility and use of substances regulated by EPA's RMP regulation\n\n* A summary of results from our assessment of the potential off site consequences from accidental chemical releases\n\n* An overview of our accidental release prevention programs\n\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n\n* An overview of our emergency response program\n\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\n\n\nThe Delaware Basin Gas Plant located in Reeves County, Texas is owned by Enterprise Gas Processing LLC and is operated by Enterprise Products Operating, LLC.\n\n\n\nThe Delaware Basin Gas Plant is a is a cryogenic natural gas liquid recovery plant designed to utilize the cryogenic turbo expander process to recover natural gas liquids from the inlet gas. Produced natural gas is delivered to the facility from a gas gathering system and inlet gas pipeline. The plant processes the gas utilizing a cryogenic turbo expander to remove recoverable natural gas liquids from the inlet gas.  The mixed hydrocarbon liquid stream produced at the Delawar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094688,
      "SummaryText": "e Basin Gas Plant is removed from the plant by liquid pipeline for storage and fractionation elsewhere.  The residue gas is also removed by a gas pipeline for transport to end users.\n\n\n\nThe Delaware Basin Gas Plant was evaluated to determine if any regulated flammable or toxic substances exceeded the threshold quantity.  Enterprise identified the regulated substances and quantities kept on site based on process knowledge.  Listed flammable substances which are present above the threshold quantities at the Delaware Basin Gas Plant are natural gas (methane), ethane, propane, iso-butane, normal butane, iso-pentane and pentane.  Refrigerant grade propane is also used at the facility in the refrigeration system.\n\n\n\nThe Plant is subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) regulation and is classified as a Program Level 1 site under the EPA RMP program.\n\n\n\nGeneral Accidental Release Prevention Program\n\n\n\nThe following is a summary of the accidental release prevention program in place at Milner Terminal.  The process at the facility is regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1).  Release prevention is provided through the use of written operating procedures, employee training in written procedures, including normal operation and emergency release procedures, and in the design of safety and release prevention equipment installed at the terminal site.  In addition, a written safety program designed to comply with all applicable OSHA safety performance regulations is strictly enforced at all Enterprise facilities, including the Milner Terminal facility.  As part of the Enterprise safety program, the facility utilizes procedures that are included in the Enterprise program, but may not specifically be required at non-PSM and/or RMP Program 1 facilities (e.g. Safe work practice training; safe work permitting and hot work permitting).\n\n\n\nOffsite Consequence Anal"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094688,
      "SummaryText": "ysis Results\n\n\n\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\n\n\n\nUniversal Prevention Activities\n\n\n\nThe accident prevention program summarized previously is applied to all RMP covered processes at the Delaware Basin Gas Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\n\n\nSpecialized Safety Features\n\n\n\nDelaware Basin Gas Plant has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\n\n\nRelease Detection\n\n* Hydrocarbon (hazardous gas) detectors and alarms\n\n* Fire detectors on gas compression equipment\n\n* Plant video surveillance system\n\n\n\nRelease Containment and Control\n\n* Process relief valves that discharge to a flare to capture and incinerate episodic releases\n\n* Valves to permit isolation of the process (manual or automated).\n\n* Automatic shutdown systems for specific process parameters (e.g., high pressure).\n\n* Secondary containment (curbs and dikes) to contain any release of liquid chemicals\n\n* Redundant equipment and instrumentation where advisable\n\n* Dual mechanical seals with seal failure alarms installed on hydrocarbon liquid pumps.\n\n* Atmospheric relief devices\n\n\n\nRelease Mitigation\n\n* Hand-held and wheeled cart fire extinguishers\n\n* Personnel trained in emergency response and procedures.\n\n* Personnel protective equipment (e.g., chemical protective clothing, hard hats, safety glasses, etc.)\n\n\n\nFive Year Accident History\n\n\n\nDuring the last five years, there have been no large or small releases which resulted in any injuries, property damage, or offsite consequences.\n\n\n\nEmergency Procedures Information\n\n\n\nDelaware Basin Gas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094688,
      "SummaryText": " Plant maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.\n\nThe overall emergency procedure program for Delaware Basin Gas Plant is coordinated with the Reeves County Emergency Planning Committee organization (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives.  Delaware Basin Gas Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nDelaware Basin Gas Plant resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at Delaware Basin Gas Plant.\n\n\n\n* Enterprise is currently in the process of reviewing and revising the entire safety management / accident prevention program to ensure that the program can be fully administered across the diverse nature of the facilities owned or operated by the company."
    }
  ]
}