{
  "FacilityID": 1000039712,
  "FacilityName": "Birds Eye Foods LLC",
  "FacilityStr1": "W8880 County Road X",
  "FacilityStr2": null,
  "FacilityCity": "Darien",
  "FacilityState": "WI",
  "FacilityZipCode": "53114",
  "Facility4DigitZipExt": "1312",
  "FacilityCountyFIPS": "55127",
  "LEPC": "Walworth LEPC",
  "FacilityLatDecDegs": "42.589444",
  "FacilityLongDecDegs": "-088.736944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 55182732,
  "ParentCompanyName": "Pinnacle Foods Group LLC",
  "Company2Name": "Pinnacle Foods INC",
  "CompanyDUNS": 2212611,
  "Company2DUNS": 145078395,
  "OperatorName": "Thomas R. Timm",
  "OperatorStr1": "W8880 County Road X",
  "OperatorStr2": null,
  "OperatorCity": "Darien",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53114",
  "OperatorZipCodeExt": "1312",
  "FTE": 612,
  "OtherEPAFacilityID": "53114THLRSPOB",
  "EPAFacilityID": "100000075303",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-01-18 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-03-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-03-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10",
  "FRS_Lat": 42.589444,
  "FRS_Long": -88.736944,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048864,
      "AltID": "Refrigeration",
      "FacilityID": 1000039712,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059283,
          "ProcessID": 1000048864,
          "ChemicalID": 56,
          "Quantity": 131473.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000049301,
          "ProcessID": 1000048864,
          "NAICSCode": "311411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000042281,
              "Process_NAICS_ID": 1000049301,
              "SafetyReviewDate": "2013-04-13 00:00:00",
              "PHA_Date": "2013-08-27 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-12-19 00:00:00",
              "TrainingReviewDate": "2011-03-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-07-31 00:00:00",
              "EquipmentInspectionDate": "2013-12-03 00:00:00",
              "EquipmentTested": "Level Controls",
              "ChangeMgmtDate": "2013-08-16 00:00:00",
              "ChangeMgmtReviewDate": "2010-02-02 00:00:00",
              "PreStartupReviewDate": "2014-03-03 00:00:00",
              "ComplianceAuditDate": "2012-07-31 00:00:00",
              "AuditCompletionDate": "2014-07-31 00:00:00",
              "IncidentInvestigationDate": "2013-12-04 00:00:00",
              "InvestigationChangeDate": "2014-01-01 00:00:00",
              "ParticipationPlansReviewDate": "2013-04-05 00:00:00",
              "HotWorkPermitReviewDate": "2013-09-27 00:00:00",
              "ContractorSafetyReviewDate": "2013-11-20 00:00:00",
              "ContractorSafetyEvalDate": "2013-04-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000050444,
                  "PreventionProgram3ID": 1000042281,
                  "ProcessChemicalID": 1000059283
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039712,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-06-26 00:00:00",
    "ERTrainingDate": "2013-06-26 00:00:00",
    "CoordinatingAgencyName": "Darien Fire Dept.",
    "CoordinatingAgencyPhone": "2627243678",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039712,
      "SummaryText": "EXECUTIVE SUMMARY\r\nPINNACLE FOODS - Birds Eye Foods Darien Operations\r\n\r\nINTRODUCTION\r\n\r\nBirds Eye Foods Darien facility is located at W8880 County Road X, Darien Wisconsin. The facility was built, owned and operated by the Libby, McNeil, Libby Company in 1963. The facility has under gone numerous changes in ownership: Nestle Foods 1976, Larson Company 1980, Dean Foods 1986, Agralink 1998 and Pinnacle Foods 2009. The ammonia refrigeration system was built in 1963 with additions in 1974, 1985, 1989, 2002, 2003, 2008, 2011 and 2012. The system has followed the provisions of the Process Safety Management (PSM) since 1993 and Risk Management Program (RMP) since 1999. \r\n\r\n\r\nA. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nBirds Eye Foods (BEF) is committed to providing a safe workplace that is operated in an environmentally responsible manner. Birds Eye Foods strives to protect all its valuable resources and assets - both personnel and property. We live and have families in this community. We want to prevent exposure to all our personnel as well as nearby members of our community, existing natural resources, and the surrounding environment. Birds Eye Foods is also committed to complying with all applicable laws and regulations relating to safety in the workplace and the\r\nprotection of the environment. Through continual, accurate training and various safety devices and procedures, we work to minimize potential releases.\r\n\r\nIt is Birds Eye Foods policy that to promote overall public and associate safety by developing, implementing and \r\nmaintaining all required elements of the EPAs RMP provisions and OSHAs PSM standard regarding the storage, handling, and processing of anhydrous ammonia used at this facility. The incorporation of these programs helps to prevent the occurrence, and minimize the consequences, of significant releases of highly hazardous materials as well as fires, explosions, and other types of catastrophic incidents.\r\n\r\nThis facility incor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039712,
      "SummaryText": "porates a comprehensive management system to oversee the continued development,\r\nImplementation and maintenance of the RMP. The Plant Manager is responsible for the implementation of the RMP. In turn, he has designated the facility Refrigeration Supervisor as the PSM Coordinator having overall authority for and oversight of the Facility PSM program and The Environmental Supervisor has overall authority for, and oversight of, the Facility RMP program. As part of the PSM and RMP, the facility has an Emergency Response Plan and Procedures Manual which provides instructions and responsibilities required of facility personnel in case of the following plant emergencies: employee illness/injury, ammonia release, fire, and severe weather. The management team is committed to safety and the implementation of safe procedures at the facility.\r\n\r\n\r\nB. FACILITY OVERVIEW AND REGULATED SUBSTANCES HANDLED\r\n\r\nThe facility is located on 600 acres in a rural setting 1.5 miles from the village of Darien. Interstate 43 borders the property on the southwest to northeast boundary. County Road X is on the south with the western border abutting farmland.  The facility consists of one main plant building with over 700,000 square feet under roof. The Darien   facility processes fresh green beans and carrots from July- November and packages frozen vegetables and ready to eat meals year round. We utilize anhydrous ammonia for refrigeration for space cooling of production areas and storage areas for incoming food ingredients and finished product. Ammonia is also used in processing of the ingredients going into the frozen meal products and for freezing of the green beans and carrots. The Environmental Protection Agency (EPA) considers anhydrous ammonia as hazardous; therefore necessitate certain safety precautions.\r\n\r\nAs set forth in PSM, BEF Darien uses Recognized and Generally Accepted Good Engineering Practice (RAGAGEP) as the guideline in our management of the ammonia systems.  The redundancy"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039712,
      "SummaryText": "built into the system ensures that a release will be minimized and controlled in a short period of time. A nationally recognized, reputable and professional ammonia delivery company is used to recharge the system when needed, which is approximately once a year. Steel piping then carries the ammonia to the refrigeration equipment. Access to the site is restricted to company employees and authorized contractors and visitors. \r\n\r\nAnhydrous ammonia is the only RMP regulated substance (toxic or flammable) above the applicable threshold that is used at our facility. The refrigeration system consists of 4 separate systems with a total of 131,473LBS. The engine rooms are locating within the plant. Each ER is enclosed and has automatic mechanical ventilation and ammonia detection systems designed for the specific room.\r\n\r\n\r\nC. FIVE-YEAR ACCIDENT HISTORY\r\n\r\nNo major releases of ammonia have occurred that have resulted in: deaths, injuries, significant property damage on site or offsite. \r\n\r\n\r\nD. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\r\n\r\nThe ammonia refrigeration system design and construction is based upon accepted and proven engineering\r\ndesign practices for a safe operating refrigeration plant. The system was designed and constructed to meet\r\nthe Uniform Building Code, Uniform Mechanical Code, Uniform Fire Code, ANSI / ASHRAE Standard 15 and\r\nthe National Electrical Code. Shut-off valves are strategically located throughout the refrigeration system to\r\nallow emergency shut-off, periodic maintenance and repair. Pressure vessels are ASME rated to 250 psig and\r\nfitted with either a single or dual safety relief valve as required by ASME. The facility has an automatic\r\nammonia detection, notification system, and response system for the engine room and refrigerated spaces.\r\n\r\nThe facility complies with applicable Federal, State and Local regulations including the EPA's Accidental\r\nRelease Prevention Rule. Personnel are trained about th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039712,
      "SummaryText": "is during our Hazard Communications Training and\r\nthrough access to our Written Programs.\r\n\r\nThe facility has reviewed and revised the documents and procedures for compliance with OSHA's PSM and\r\nEPA's Risk Management Program for ammonia use and storage. A management system has been established\r\nto maintain the elements of the PSM and Risk Management Programs. Applicable written elements of the\r\nPSM and the Risk Management Program are readily accessible by employees.\r\n\r\n\r\nE. THE EMERGENCY RESPONSE PROGRAM\r\n\r\nThe Emergency Planning and Response Plan covers the ammonia refrigeration system in accordance with\r\nProcess Safety and Risk Management. Our emergency plan has specific procedures for accidental releases of\r\nanhydrous ammonia as well as other emergencies. If a release of ammonia is detected by the ammonia\r\ndetection system or by employees, the procedures within this manual will be followed including notification\r\nof hazardous materials responders (refrigeration technicians) by radio and as required, the involvement of\r\nthe incident commander. The manual describes the level of personal protective equipment to be used to\r\nrespond to ammonia incidents. Facility responders have received initial and annual refresher training in\r\naccordance with 29 CFR 1910.120. Facility-wide training regarding emergency procedures and evacuation\r\nroutes occurs annually.\r\n\r\nThe facility has an in-house HAZMAT team that initially responds and works in conjunction with the Darien Voluntary Fire Department and the Walworth County Local Emergency Planning Committee on emergency\r\npreparedness. The Darien Fire Departments and Walworth County Sheriff's Department will handle public\r\nnotification in coordination with the LEPC. We meet periodically with representatives of each to address any changes in the facility or any new concerns. Birds Eye Foods will work with these agencies as necessary to notify the public about an ammonia release. The manual also contains procedures for emergency aler"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000039712,
      "SummaryText": "ting and response procedures for on-site personnel, off-site emergency contacts, and adjacent plants. Senior management will handle media relations. \r\n\r\nWe strive to minimize off-site consequences through the implementation of emergency response program elements: pre-emergency planning, facility evacuation procedures, emergency response procedures,\r\nemergency medical and first aid procedures, post-emergency guidelines, and training program\r\n\r\n\r\nF. PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nBEF Darien manages all the plant processes through the implementation of Continuous Improvement programs.  We continue to improve the safety of the system by implementing recommendations from various PSM program elements such as Standard Operating Procedures (SOP) reviews, PSM/RMP audits and Mechanical Integrity Assessments (MIA). Our Refrigeration staff is kept current with industry changes through on the job training, offsite seminars and provided with access to the International Institute of Ammonia Refrigeration (IIAR) and the Industrial Refrigeration Consortium (IRC) publication and training materials."
    }
  ]
}