{
  "FacilityID": 1000094329,
  "FacilityName": "Lanxess Corporation - West Plant",
  "FacilityStr1": "5821 Shuler Road",
  "FacilityStr2": null,
  "FacilityCity": "Magnolia",
  "FacilityState": "AR",
  "FacilityZipCode": "71753",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05139",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "33.183889",
  "FacilityLongDecDegs": "-092.937778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "2226 Haynesville Hwy",
  "FacilityEmailAddress": "james.langan@lanxess.com",
  "FacilityDUNS": 43195429,
  "ParentCompanyName": "Lanxess Corporation",
  "Company2Name": null,
  "CompanyDUNS": 333335490,
  "Company2DUNS": 0,
  "OperatorName": "Lanxess Corporation",
  "OperatorStr1": "P.O. Box 7020",
  "OperatorStr2": null,
  "OperatorCity": "El Dorado",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "71730",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000059018",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0286-AOP-R14",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-07-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-07-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-07-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.18557,
  "FRS_Long": -92.70448,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117088,
      "AltID": "Bromine",
      "FacilityID": 1000094329,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146472,
          "ProcessID": 1000117088,
          "ChemicalID": 56,
          "Quantity": 136000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000146473,
          "ProcessID": 1000117088,
          "ChemicalID": 62,
          "Quantity": 280000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000146474,
          "ProcessID": 1000117088,
          "ChemicalID": 60,
          "Quantity": 1440000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000146614,
          "ProcessID": 1000117088,
          "ChemicalID": 53,
          "Quantity": 214000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118502,
          "ProcessID": 1000117088,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000100197,
              "Process_NAICS_ID": 1000118502,
              "SafetyReviewDate": "2019-11-22 00:00:00",
              "PHA_Date": "2020-06-26 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-06-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-09-25 00:00:00",
              "TrainingReviewDate": "2020-07-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-05-28 00:00:00",
              "EquipmentInspectionDate": "2021-01-29 00:00:00",
              "EquipmentTested": "Bromine Storage Tank",
              "ChangeMgmtDate": "2021-07-01 00:00:00",
              "ChangeMgmtReviewDate": "2010-02-26 00:00:00",
              "PreStartupReviewDate": "2021-01-29 00:00:00",
              "ComplianceAuditDate": "2020-06-30 00:00:00",
              "AuditCompletionDate": "2020-09-30 00:00:00",
              "IncidentInvestigationDate": "2021-02-26 00:00:00",
              "InvestigationChangeDate": "2021-02-26 00:00:00",
              "ParticipationPlansReviewDate": "2021-05-28 00:00:00",
              "HotWorkPermitReviewDate": "2021-05-28 00:00:00",
              "ContractorSafetyReviewDate": "2021-05-28 00:00:00",
              "ContractorSafetyEvalDate": "2021-04-30 00:00:00",
              "CBI_Flag": 0,
              "Description": "Bromine; Safety Procedure Manual",
              "_chemicals": [
                {
                  "PrimaryKey": 1000125659,
                  "PreventionProgram3ID": 1000100197,
                  "ProcessChemicalID": 1000146472
                },
                {
                  "PrimaryKey": 1000125660,
                  "PreventionProgram3ID": 1000100197,
                  "ProcessChemicalID": 1000146473
                },
                {
                  "PrimaryKey": 1000125661,
                  "PreventionProgram3ID": 1000100197,
                  "ProcessChemicalID": 1000146474
                },
                {
                  "PrimaryKey": 1000125779,
                  "PreventionProgram3ID": 1000100197,
                  "ProcessChemicalID": 1000146614
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094329,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2021-04-30 00:00:00",
    "ERTrainingDate": "2020-09-01 00:00:00",
    "CoordinatingAgencyName": "Union County, LEPC",
    "CoordinatingAgencyPhone": "8708752273",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "National Response Center"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094329,
      "SummaryText": "Risk Management Plan Executive Summary for \n\nThe LANXESS Corporation West Plant Magnolia, Arkansas\n\n\n\n1.Accidental Release Prevention and Emergency Response Policies\n\nWe at LANXESS Corporation, West Plant (Lanxess) are strongly committed to employee, public and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeably, if such a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.  We are also completely coordinated with     Union County LEPC which provides additional emergency response expertise.\n\n\n\n2.The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass refining bromine from a feed brine stream. We have 4 regulated substances present at our facility. These substances include ammonia, bromine, chlorine, and hydrochloric acid. The regulated substances at our facility are involved in several uses. Ammonia is used for acid adjustment and neutralization. Bromine is used for chemical synthesis. Chlorine is used for bromine replacement. Ammonia (anhydrous) and Hydrochloric acid are used to neutralize the tail brine.\n\n\n\nThe maximum inventory of bromine at our facility is 1,440,000 lb. while chlorine, ammonia and hydrochloric acid are present at our facility in quantities of 280,000 lb., 136,000 lb. and 214,000 lb. respectively.\n\n\n\n3. Offsite Consequence Analysis\n\nThe Worst Case Release Scenario and the Alternative Release Scenarios were considered, modeled using RMP Comp, and following the requirements of 40 CFR Part 68. The scenarios, include administrative controls and mitigation measures to limit the distances for each "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094329,
      "SummaryText": "reported scenario. \n\n\n\n4. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. This facility was designed and constructed in accordance with State Building Codes. A number of processes at our facility are subject to the OSHA PSM standard under 29 CFR 1910.119. Our facility is also subject to EPCRA Section 302 notification requirements. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nLanxess maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is what if checklist. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years. Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Lanxess maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nLanxess has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these proces"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094329,
      "SummaryText": "ses. Refresher training is provided at least every three years and more frequently as needed.\n\n\n\nMechanical Integrity\n\nLanxess carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Lanxess to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Lanxess. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nLanxess conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nLanxess promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any correct"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094329,
      "SummaryText": "ive actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nLanxess truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Lanxess has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n5. Five-year Accident History\n\nLanxess has had an excellent record of preventing accidental releases over the last 5 years. Due to our stringent release prevention policies, accidental releases have been kept to a minimum during this period.\n\n\n\nLanxess has experienced no releases of regulated substances during the last 5 years.\n\n\n\n6. Emergency Response Plan\n\nLanxess carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination. Additionally, annual drills are performed and critiqued.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes takin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000094329,
      "SummaryText": "g place within our processes that would require a modified emergency response. Due to the small number of employees at the West Plant Emergency Response is coordinated with the Cairo and Mt. Holly, Arkansas Volunteer Fire Departments.\n\n\n\nUnion County, Arkansas is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated.\n\n\n\n7. Planned Changes to Improve Safety\n\nLanxess plans to continuously improve and update operating procedures, replace or maintain equipment to original specifications or design codes and develop and implement safety improvement capital projects. These are some of the major steps we want to take to improve safety at our facility.\n\n\n\n8. Certification Statement\n\nThe undersigned certifies that to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate and complete.\n\n"
    }
  ]
}