{
  "FacilityID": 1000028039,
  "FacilityName": "Leader Creek Fisheries, Inc.",
  "FacilityStr1": "Mile Marker 3",
  "FacilityStr2": "Alaska Peninsula Highway",
  "FacilityCity": "Naknek",
  "FacilityState": "AK",
  "FacilityZipCode": "99663",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "02060",
  "LEPC": null,
  "FacilityLatDecDegs": "58.746417",
  "FacilityLongDecDegs": "-156.949857",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "NW",
  "FacilityURL": null,
  "FacilityEmailAddress": "info@leadercreekfisheries.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Leader Creek Fisheries. Inc.",
  "OperatorStr1": "4601 Shilshole Avenue NW",
  "OperatorStr2": null,
  "OperatorCity": "Seattle",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98107",
  "OperatorZipCodeExt": null,
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000217712",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-10-25 00:00:00",
  "SafetyInspectionBy": "Safety Engineering Consultants",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-06-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-06-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-06-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 58.746214,
  "FRS_Long": -156.949466,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034338,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000028039,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041488,
          "ProcessID": 1000034338,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000034622,
          "ProcessID": 1000034338,
          "NAICSCode": "311712",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000030220,
              "Process_NAICS_ID": 1000034622,
              "SafetyReviewDate": "2012-01-12 00:00:00",
              "PHA_Date": "2012-01-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-09-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-05-21 00:00:00",
              "TrainingReviewDate": "2011-10-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": "Interactive employee participation required in Training",
              "MaintenanceReviewDate": "2012-01-12 00:00:00",
              "EquipmentInspectionDate": "2012-05-08 00:00:00",
              "EquipmentTested": "All strainers, filters, piping, relieft vales, installing detection systems",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2012-05-20 00:00:00",
              "PreStartupReviewDate": "2012-05-20 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-01-12 00:00:00",
              "HotWorkPermitReviewDate": "2012-01-12 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2012-01-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000036346,
                  "PreventionProgram3ID": 1000030220,
                  "ProcessChemicalID": 1000041488
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000028039,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-03-22 00:00:00",
    "ERTrainingDate": "2012-03-14 00:00:00",
    "CoordinatingAgencyName": "Bristol Bay Borough",
    "CoordinatingAgencyPhone": "9072464224",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028039,
      "SummaryText": "Leader Creek Fisheries RMP Executive Summary\r\n\r\n\r\nIntroduction\r\n\r\nLeader Creek Fisheries owns and operates a seasonal Salmon processing facility located approximately three miles from Naknek Alaska.  The facility is located in a very remote area of Alaska in the Bristol Bay Borough.\r\n\r\nThe plant operates for approximately three months per year (from June to August) and employees approximately 400 people, all of whom live on-site during the period of plant operation.  The facility uses an ammonia-based refrigeration and freezing system, comprising both refrigerated seawater underground holding tanks, as well as tunnel freezers.  Total system capacity is approximately 13,000 lbs. of anhydrous ammonia.\r\n\r\nFish are received at the plant via a pump barge that is moored in the Nushigak River which fronts the southern perimeter of the facility property.  The fish are pumped from the barge to holding tanks, and finally into the plant area where they are processed by employees into process ready salmon.  The fish are then frozen in tunnel and blast freezers.  After freezing, the fish are packaged in boxes, palletized and then loaded into cold storage container vans which are shipped directly to customers via common carrier barge.\r\n\r\nThe facility is located in a sparsely populated area of rural Alaska, located between the villages of King Salmon and Naknek. \r\n\r\nOur company provides seasonal employment to over 400 people, and economic benefits to the entire Bristol Bay area.  For many of our long-term employees, employment in the seafood industry has been their life's work.  Leader Creek managers and employees alike understand that the success and long-term survival of the company depends on maintenance and encouragement of a healthy ecosystem that the Wild Alaskan Salmon must have for their lifecycle.\r\n\r\nLeader Creek Seafood's management dedication to safety and quality - in the workplace, our products, and the environment - are anchored by personal accountability and respons"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028039,
      "SummaryText": "ibility.\r\n\r\nOne of our primary goals is to produce the highest quality salmon in an a food safe ethical manner.  This goal will be carried out by the assignment and acceptance of employee and management accountability and responsibility. \r\n \r\n\r\n\r\n\r\nPost-season refrigeration expansion - 2011\r\n\r\nIn the fall of 2011, following the processing season, Leader Creek completed a significant expansion of its Refrigerated Seawater (RSW) fish holding capacity.  Underground, concrete-lined tanks were completed that are installed between the river and the processing plant.\r\n\r\nThe installation of these concrete-lined vaults makes it possible to purchase and hold fish at a very cold temperature.  Our facility is therefore able to purchase, store and process significantly more fish during the very short season.  Instead of adding to the above-ground tank fronting the main highway of the facility, an innovative concrete vaulted system of underground storage tanks was installed in a much more secure area of the site.\r\n\r\nThe construction and addition of this new capacity increased the amount of ammonia in the refrigeration system to approximately 13,000lbs., thus subjecting the facility to the OSHA Process Safety Management (PSM) standard, and the EPA Risk Management Plan (RMP) rule for the first time.\r\n\r\nLeader Creek contracted with a Occupational and Industrial Hygiene consulting firm (the Synergy Group, Inc.) to assist in development and implementation of the PSM/RMP.  A e Plant Site visit and inspection was conducted during the week of October 25, 2011, and provided a detailed on-site analysis of the ammonia refrigeration system.  The visit was instrumental in beginning development of an Emergency Preparedness and Response Plan based on the National One-Plan guidance document.  \r\n\r\nA nucleus of four crew-members (one primary team of two and one back-up) were selected and were trained and certified as 8-Hour Hazwoper first responders at the operations level. \r\n\r\nAs clearly stat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028039,
      "SummaryText": "ed in Leader creek's policies and Procedures Manuals, and during hands-on training, the primary objective of all facility employees - including the Emergency Response Team - is to ensure the safe and orderly evacuation of the facility.\r\n\r\nThe Synergy Group will continue to work with Leader Creek employees and managers on several areas that present areas for improvement, including:\r\n\r\n¿\tPhased  and prioritized compliance with industry best-practices, including the ASRAE CODE for Ammonia Refrigeration Facilities \r\n¿\tDetection and Alarming of work and sleeping areas\r\n¿\tLabeling of piping and instrumentation\r\n¿\tDevelopment and documentation of Standard Operating procedures and Preventative Maintenance Schedule\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nLeader Creek is committed to operating a safe facility for the protection and benefit of our employees, customers, and community members.  As our company has grown, we have increased the  and scope of our safety and ammonia release prevention activities. \r\n\r\nAn increase to the production capacity of the Plant resulted in a commensurate enlargement of the ammonia-based refrigeration system during post-season work in late 2011.  Leader creek retained a professional PSM/RMP Consulting firm to assist in developing a comprehensive prevention-based approach to the Standards.  Our program incorporates best practices consistent with other companies in our industry.\r\n\r\nWe developed and adopted an Emergency Response Plan (ERP), consistent with the outline detailed in the National One-Plan guidance document.\r\n\r\nOur policy regarding accidental releases is that they are best prevented by an aggressive and documented preventative maintenance program.\r\n\r\nLeader Creek Fisheries management believes in - and more importantly - dedicates the necessary resources to provide a safe and healthful work environment for each employee.  This philosophy and practice extend to all areas of our business, including food prod"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028039,
      "SummaryText": "uct quality and safety, as well as compliance with applicable local, state and federal environmental standards and laws.\r\n\r\nOur Emergency Response Policies, as stated in our ERP is:\r\n\r\n4.\tEmergency Response Priorities\r\n\r\nOur emergency response priorities are the protection of:\r\n\r\n1)\tPeople\r\n2)\tEnvironment \r\n3)\tProperty.\r\n\r\nThe protection of the lives and health of people are paramount, and will establish the timing, intensity, and necessity of any emergency response activities.\r\n\r\nIn our planning and execution of response activities, the following rule will be observed:\r\n\r\nOur primary goal will be the safe and orderly evacuation of all people from the danger zone.  Once this has been accomplished, all other priorities are secondary to the physical safety and health of our emergency response team.  Put another way, this means that response work necessary to protect the plant or the environment may be carried out only if it can be done without compromising the health or safety of our employees.\r\n\r\nIn accordance with this philosophy:\r\n\r\n¿\tLeader Creek Fisheries employees will not enter any area in which a visible cloud of ammonia is present, except to rescue people and only after donning appropriate respiratory protective equipment.;\r\n\r\n¿\tLeader Creek Fisheries employees will rely on mechanical and natural ventilation to disperse any visible cloud prior to entry of any area for property/environmental damage control. \r\n\r\nLeader Creek Emergency Response Program\r\n\r\nAs noted, we believe that the best emergency response program is rooted in the ideas and practices - such as aggressive preventative maintenance - that make an emergency release and response unlikely.\r\n\r\nNevertheless, given the volume of ammonia on-site, the number of employees and the mechanical nature of the apparatus, management recognizes that an accidental release could occur.\r\n\r\nTo this end we maintain and train a six to eight person team that comprise our facility Emergency Response team (ERT).  As state"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000028039,
      "SummaryText": "d above the primary purpose of the ERT is to ensure complete and safe personnel evacuation of the facility.  Since the Naknek area is largely rural, little, if any assistance is contemplated from outside resources\r\n\r\nEmployees will be alerted to an ammonia emergency via hand-held air horns (note: installation of a hard-wired general plant alarm is on the facilities acquisition list within the next two years.  All-employee evacuation drills will be conducted at least twice per season.  Each drill and response will be critiqued to determine how we might improve response in the future.\r\n\r\nERT equipment is also slated for improvement in the next two to three years.  The ERT response is based on the buddy-system, which means that Leader Creek should have a minimum of four (and preferably five) SCBA units, along with back-up air tanks, in addition to six Level B Splash Suits\r\n\r\nThere have been no reportable ammonia releases in the past five years."
    }
  ]
}