{
  "FacilityID": 1000040241,
  "FacilityName": "Snowden Enterprises - Modesto",
  "FacilityStr1": "514 Hosmer Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Modesto",
  "FacilityState": "CA",
  "FacilityZipCode": "95351",
  "Facility4DigitZipExt": "4048",
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.624178",
  "FacilityLongDecDegs": "-120.990730",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 128450574,
  "ParentCompanyName": "Snowden Enterprises, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lynn Nielson",
  "OperatorStr1": "P.O. Box 3309",
  "OperatorStr2": null,
  "OperatorCity": "Modesto",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95353",
  "OperatorZipCodeExt": "3309",
  "RMPContact": "Kirk Shermer",
  "RMPTitle": "President",
  "FTE": 3,
  "OtherEPAFacilityID": "011195CA001",
  "EPAFacilityID": "100000058064",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-01-29 00:00:00",
  "SafetyInspectionBy": "Stanislaus County Haz. Mat. Div.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-12-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 37.62436,
  "FRS_Long": -120.99081,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049621,
      "AltID": "Repackaging of SO2",
      "FacilityID": 1000040241,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000050083,
          "ProcessID": 1000049621,
          "NAICSCode": "49319",
          "_desc": {
            "NAICS_CODE": "49319",
            "NAICS_DESCRIPTION": "Other Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000060131,
          "ProcessID": 1000049621,
          "ChemicalID": 49,
          "Quantity": 370000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000560131,
          "ProcessID": 1000049621,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000040241,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nSnowden Enterprises is a family owned / operated business that provides sulfur dioxide to the various farming industries throughout the central valley of California. Snowden Enterprises has prided itself in ensuring a safe operation at both locations dating back to startup of the company in 1936.\n\n\n\nSnowden Enterprises' President is personally committed to offer superior service and to maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  The President administers the company's safety and environmental policies. He is also responsible for various inspections of the company's two locations to ensure compliance, and oversees the entire safety and environmental programs.  These programs include forklift safety, hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturers documentation, Emergency Response, DHS Site Security Plan (SSP)as well as the Risk Management Plan.\n\n\n\nSnowden Enterprises has an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n\n\n1.)  To save lives.\n\n2.)  To minimize and avoid injuries.\n\n3.)  To protect the environment.\n\n4.)  To minimize property damage.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe process is located at 514 Hosmer Avenue in Modesto, California. The Snowden Modesto facility repackages sulfur dioxide (which is delivered in 90 ton railcars) into cylinders which range in capacity from 10 pounds to 1 ton. The process flow begins at the 90 ton rail car. Liquid sulfur dioxide is transferred from the rail car into the two receivers. The sulfur dioxide liquid is then transferred from the receivers to the five fill stations; one-ton fill stations (2), 150 pound cylinder fill "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000040241,
      "SummaryText": "stations (2), and the specialty fill station. The specialty fill station services smaller cylinders which range from 10 to 50 pounds.\n\n\n\nSulfur dioxide compressors can apply pressure to either the rail car or the receivers (2) which enables the liquid to be transferred from either of the vessels.  A vacuum tank is connected to all of the fill stations, as well as the rail car and receivers, which allows a vacuum to be pulled on any one of them.  Once the sulfur dioxide is transferred into its final container, it is stored in the \"full storage\" area of the warehouse until delivery.\n\n\n\nThe sulfur dioxide is delivered approximately every 14 to 16 weeks in a 90 ton rail car by the Union Pacific Railroad Company.  The rail car is connected (piped) to the receivers only during sulfur dioxide transfer, which may occur 2 to 3 times per rail car.  Each fill station is operated on an \"as needed\" basis and may not be used daily.\n\n\n\nThe maximum quantity of sulfur dioxide that can be stored on site is 185 tons.\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nSnowden Enterprises has a Process Safety Management program in place to manage the handling of sulfur dioxide.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed. \n\n\n\nSnowden Enterprises also has engineering controls in place to further reduce the consequences of a failure. These include Snappy Joe excess-flow shut off valves on the sulfur dioxide railcars. In addition, the two sulfur dioxide receivers are equipped with air-actuated shut off valves that can be remotely actuated from three shut-off buttons located throughout the facility.\n\n\n\nThe process equipment is inspected daily and is shut down if any guests or visitors are on site (hence there are no contractor evaluations). Only employees are allowed in the facility while operations are in progress.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nBased on the review of the fiv"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000040241,
      "SummaryText": "e year accident history included in the Hazard Assessment Update (April 2009 - April 2014), there have been no releases of sulfur dioxide that exceeded the Federal Reportable Quantity of 500 pounds or the California threshold of \"any\" release.  In addition, there have been no injuries resulting from a sulfur dioxide release. \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Snowden Enterprises has an emergency response plan in effect at the facility.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document.  The Plan provides the response organization and notification procedures, evacuation routes, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility. There are 3 Technicians on-site with SCBA Level A training.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM, RMP, and CalARP regulations, and to ensure that the plan is kept current.\n\n\n\nSnowden Enterprises employs three technicians trained to First Responder Technician Level (SCBA and Level A suits) to respond to a release of sulfur dioxide. \n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nSnowden Enterprises has conducted a PSM/RMP Compliance Audit (February 2014) and revalidated the Process Hazard Analysis (February 2014). Both studies resulted in minor procedural modifications to ensure a safe operation. These modifications are currently being implemented. The President of Snowden Enterprises is personally responsible for ensuring that these recommendations are implemented. \n\n\n\nIn addition to the mitigation measures included in the Compliance Audit and Process Hazard Analysis Revalidation, the Process Safety Management team continues to ensure employee involvement in Safety Plan Development and training requirement protocol."
    }
  ]
}