{
  "FacilityID": 1000038561,
  "FacilityName": "Quality Sausage Company",
  "FacilityStr1": "1925 Lone Star Drive",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75212",
  "Facility4DigitZipExt": "6300",
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.771944",
  "FacilityLongDecDegs": "-096.858611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Quality Sausage Company",
  "OperatorStr1": "1925 Lone Star Drive",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75212",
  "OperatorZipCodeExt": "6300",
  "RMPContact": "Fred Koelewyn",
  "RMPTitle": "Vice President Operations",
  "FTE": 268,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187406",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-10-03 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-02-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-02-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-02-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-02-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000047309,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000038561,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000047732,
          "ProcessID": 1000047309,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000057453,
          "ProcessID": 1000047309,
          "ChemicalID": 56,
          "Quantity": 54911.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000557453,
          "ProcessID": 1000047309,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000038561,
      "SummaryText": "Quality Sausage Company's primary business is processing, preparation, and wholesale distribution of meat products for human consumption.  The facility is located at 1925 Lone Star Drive, Dallas, Texas 75212.  The SIC code for the operation is 2013; the NAICS code is 311612.  The facility has approximately 268 full time employees.  The facility typically operates 24 hours per day, five days per week, 52 weeks per year.  Staffing is greater during normal business hours due to the presence of management and administrative personnel.\n\n\n\nThe facility operates an ammonia refrigeration system as part of the process to keep products and raw materials fresh.  40 CFR 68.130 lists anhydrous ammonia as a hazardous chemical subject to the RMP regulation with a threshold quantity of 10,000 lbs.  The refrigeration system inventory at the facility exceeds the 10,000 lb. threshold.\n\n\n\nThe facility has evaluated and reported one worst case scenario and has evaluated alternate scenarios and reported one which will result in an offsite impact that is more likely to occur than the worst case scenario.\n\n\n\nThe facility has not experienced an accidental release of ammonia during the previous five years that resulted in deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.\n\n\n\nAmmonia is recirculated in the system as a liquid and gas depending on system operating pressures and temperatures.  The refrigeration system is designed, installed and operated in accordance with the applicable guidelines and standards of the American Society of Mechanical Engineers (ASME), the American National Standards Institute (ANSI), the International Institute of Ammonia Refrigeration (IIAR), the American Society of Heating, Refrigerating, and Air-conditioning Engineers, Inc. (ASHRAE).  \n\n\n\nThe facility has developed and implemented a Process Safety Management Program (PSM) in accordance with the Occupational Safety and Health Administration (OSHA) Standard, 29 CFR 1910.1"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000038561,
      "SummaryText": "19.  This serves as the prevention plan required by RMP.  Qualified outside contractors are used for construction and major repairs or modifications to the system.  The facility's PSM program includes provisions for process hazard analyses, management of change, pre-start up safety reviews, safe work practices, inspections, testing, maintenance, compliance audits, and contractor qualifications.  The PSM program is reviewed annually and updated as necessary.  All significant changes to the system are reviewed in accordance with the PSM / RMP management of change provisions in the facility's plan.\n\n\n\nThe system is monitored and inspected by technicians that are trained, qualified, and experienced in ammonia refrigeration in accordance with the facility's PSM program.  The system is inspected periodically for proper operation 24 hours per day.  System parameters are logged in a permanent record, as are routine maintenance activities.\n\n\n\nThe system is equipped with a series of redundant failsafe devices, sensors, and overrides.  In the event a malfunction occurs that could result in an ammonia release, these protective devices shut the system down.  The system can't be restarted until the cause of the shutdown is identified and corrected.  The system is equipped with a shutdown system that is triggered by the presence of ammonia in the engine room.  The system shutdown is located adjacent to the engine room.\n\n\n\nThe facility has made arrangements with the local fire department to respond to emergencies involving ammonia.  The facility conducts periodic incident response drills.  The facility has never experienced an ammonia release that resulted in employee, contractor or off-site injuries, or offsite evacuation or sheltering in place.  Facility personnel are trained to safely control small, incidental releases of ammonia, in the event they should occur.\n\n\n\nThe facility has complied with the requirements of section 302 and 303 of the Emergency Planning and Community Righ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000038561,
      "SummaryText": "t to Know Act (EPCRA) by notifying the State Emergency Response Commission (SERC), the Local Emergency Planning Committee (LEPC), and the Fire Department of the presence of ammonia at the site.  The facility files a Tier 2 Chemical Inventory each year with the SERC, LEPC and the Fire Department as required by sections 311 and 312 of EPCRA.  The facility's Emergency Action Plan includes procedures for notifying the proper agencies in the event of a reportable release of ammonia.  A release of 100 pounds or more must be reported to the National Response Center, the SERC, and LEPC, in accordance with section 304 of EPCRA.  The Fire Department will be provided with a copy of the facility's Emergency Action Plan upon request.\n\n"
    }
  ]
}