{
  "FacilityID": 1000080726,
  "FacilityName": "Heck Ranch",
  "FacilityStr1": "Half mile south of Nevada Ave. and",
  "FacilityStr2": "S. 19th Ave.",
  "FacilityCity": "Stratford",
  "FacilityState": "CA",
  "FacilityZipCode": "93266",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06031",
  "LEPC": null,
  "FacilityLatDecDegs": "36.131333",
  "FacilityLongDecDegs": "-119.780361",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Buttonwillow Warehouse Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Buttonwillow Warehouse Company",
  "OperatorStr1": "3430 Unicorn Road",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Hayes",
  "RMPTitle": "Safety Director",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000235827",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-09-26 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100870,
      "AltID": "Ammonia",
      "FacilityID": 1000080726,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102130,
          "ProcessID": 1000100870,
          "NAICSCode": "111998",
          "_desc": {
            "NAICS_CODE": "111998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Crop Farming"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126314,
          "ProcessID": 1000100870,
          "ChemicalID": 56,
          "Quantity": 51000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000626314,
          "ProcessID": 1000100870,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080726,
      "SummaryText": "1. Executive Summary\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n- California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Buttonwillow Warehouse Company (BWC) Heck Ranch has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 BWC Heck Ranch, Risk and Process Safety Management Program\n\n\n\nThis is to inform all interested persons, including employees, that BWC Heck Ranch has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following process which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nProcess Name                 | Process Chemical               | Process Quantity(lbs.)\n\nAmmonia Fertilizer             Anhydrous Ammonia                51,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\n\n\n\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1. Prepared a unified program based o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080726,
      "SummaryText": "n the PSM regulation to meet CalARP and RMP obligations as well\n\n2. Organized the program so that it meshes closely with general business practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Description\n\n\n\nButtonwillow Warehouse Company Heck Ranch is a fertilizer storage and resale facility. The ammonia process operates as follows. Ammonia is supplied by a vendor into the ammonia storage tank. From there it is stored until a sale is made, at which time a Buttonwillow Warehouse Company Heck Ranch employee transfers ammonia from the storage tank into a smaller trailer-mounted nurse tank. The nurse tanks are towed by trucks off site for the fertilizer application.\n\n\n\nThe ammonia process at Buttonwillow Warehouse Company Heck Ranch consists of a single storage vessel. Therefore, the ammonia storage vessel is treated as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nBWC Heck Ranch has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia fertilizer process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 Anhydrous Ammonia\n\n\n\nThe ammonia fertilizer process at the BWC Heck Ranch facility is an integral part of the overall business and operates most of the year. The ammonia process contains a total charge of approximately 51,000 (LBS). It i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080726,
      "SummaryText": "s extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\nOur personnel monitor the ammonia fertilizer process and keep an active log book of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside contractors that we use. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n\n\n1.4 Five Year Accident History\n\n\n\nBWC Heck Ranch has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\n\n\nBWC Heck Ranch's emergency action and response program has been developed to satisfy the following requirements:\n\n- Cal/OSHA's Emergency Action Plan - Title 8 CCR ?3220\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Emergency Action Plans - Title 29 CFR ?1910.38\n\n- California Accidental Release Prevention (CalARP) Program [Emergency Response Program Requirements] - Title 19 CCR, Division 2, Chapter 4.5 ?2765.1-2765.2\n\n- California Hazardous Materials Business Plan (HMBP) [Emergency Response Plans and Procedures] - Title 19 CCR, Division 2, Chapter 4 ?2731\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\n\n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nBWC Heck Ranch has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, BWC Heck Ranch continually strives to improve in all areas, including safety.\n\nBy utilizing PSMWriter software, all necessary"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080726,
      "SummaryText": " employees have access to every aspect of the RMP-PSM program. This has improved BWC Heck Ranch's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that BWC Heck Ranch's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nBWC Heck Ranch has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, BWC Heck Ranch has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\nFor the future, BWC Heck Ranch now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for BWC Heck Ranch employees, but allows for feedback and continual improvement. Through the RMP-PSM program BWC Heck Ranch will continue to maintain overall plant worker and public safety."
    }
  ]
}