{
  "FacilityID": 1000044159,
  "FacilityName": "Rokeby Generating Station",
  "FacilityStr1": "8000 SW 12th Street",
  "FacilityStr2": null,
  "FacilityCity": "Lincoln",
  "FacilityState": "NE",
  "FacilityZipCode": "68523",
  "Facility4DigitZipExt": "9141",
  "FacilityCountyFIPS": "31109",
  "LEPC": "Lancaster County LEPC",
  "FacilityLatDecDegs": "40.731917",
  "FacilityLongDecDegs": "-096.737083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G5",
  "LatLongDescription": "AB",
  "FacilityURL": "www.les.com",
  "FacilityEmailAddress": "mmckibbin@les.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Lincoln Electric System",
  "Company2Name": null,
  "CompanyDUNS": 51259786,
  "Company2DUNS": 0,
  "OperatorName": "Lincoln Electric System",
  "OperatorStr1": "1040 \"O\" Street",
  "OperatorStr2": "P.O. Box 80869",
  "OperatorCity": "Lincoln",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68501",
  "OperatorZipCodeExt": "0869",
  "RMPContact": "Melissa McKibbin",
  "RMPTitle": "Environmental Specialist",
  "FTE": 10,
  "OtherEPAFacilityID": "NED000687160",
  "EPAFacilityID": "100000147806",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.73192,
  "FRS_Long": -96.73708,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "6.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054546,
      "AltID": "Ice System",
      "FacilityID": 1000044159,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055340,
          "ProcessID": 1000054546,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066393,
          "ProcessID": 1000054546,
          "ChemicalID": 56,
          "Quantity": 29300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000566393,
          "ProcessID": 1000054546,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044159,
      "SummaryText": "Executive Summary\n\n\n\n1.Accidental release prevention and emergency response policies. \n\n\n\nThe Lincoln Electric System (LES) is a municipally-owned and operated electric utility with sole service responsibility in and around Lincoln, Nebraska. As a publicly owned utility, LES operates and maintains all of the equipment in the LES system in a manner representing prudent utility practices and in conformance with our customer/owner's expectations. LES strives for excellence in its facility operations, and for full compliance with all local, state, and federal laws and regulations.\n\n\n\nMeeting environmental requirements is part of our policies and LES continues to comply with federal Chemical Accident Prevention Provisions (40CFR Part 68) and the Risk Management Program defined in it. We are committed to the accidental release prevention program. \n\n\n\nLES has a detailed Emergency Response Plan which specifically addresses an ammonia release for the Rokeby Station. The plan will be certified by plant managers and distributed to local response organizations and others. \n\n\n\n2.The stationary source and regulated substances handled.\n\n\n\nThe Rokeby Station, owned and operated by LES, provides emergency, peaking and base load electric power generation. There are three gas turbines located on the 160 acre site. To augment power output at the LES Rokeby Station during high summer air temperatures, a cooling system is used to lower turbine inlet air temperatures. The cooling system uses ammonia refrigeration to make ice that is stored in two separate concrete tanks with capacities of 1.1 million gallons and 3 million gallons respectively. The cooling system consists of Ice System #1, which was commercial in 1991, and Ice System #2 which was commercial in 1999.\n\n\n\nThe ammonia refrigeration cooling system contains a total of approximately 29,300 pounds of anhydrous ammonia (Ice System #1 and Ice System #2  combined), and this is the maximum plant inventory. This ammonia quantity requir"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044159,
      "SummaryText": "es that Rokeby Station develop a Risk Management Program and Plan. Rokeby Station is covered by Program 2 requirements. \n\n\n\n3.The worst-case release scenario and the alternative release scenario including administrative controls and mitigation measures including a water deluge system to limit the distances for each reported scenario.\n\n\n\nThe worst-case release scenario selected for the Rokeby Station is the same scenario selected in 1999, 2004 and 2009 as it still represents the most amount of anhydrous ammonia that could be released at one time at this location. The scenario is the release of 3,250 lbs of refrigerated anhydrous ammonia from the high pressure receiver tank on Ice System #1. The water deluge system local water cannons and perimeter monitoring would significantly reduce the off-site impacts from the release. Modeling shows that the worst-case scenario would have a toxic footprint of 456 yards (0.26 miles) with a population of 14 people within the toxic footprint.\n\n\n\nThe alternative release scenario selected in 2014 represents air modeling projections of a 2\" diameter hole in the ice maker of Ice System #1. The scenario is the same as was selected in 1999 because it still represents the most probable scenario where significant amount of anhydrous ammonia could accidentally be released to the atmosphere. This 2013 scenario predicted a toxic footprint of 112 yards (0.064 miles) which differs from the 909 yard (0.52 mile) footprint predicted in the 2008 model. The change in dimension of the footprint is attributable to installation of a full water deluge system in addition to the water cannons previously installed which were reflected in the 2014 ALOHA computer model.\n\n \n\n4.The general accidental release program and the specific prevention steps. \n\n\n\nRokeby Station has met all of the requirements of RMP Hazard Review regulations, and for most aspects involved has significantly exceeded minimum requirements. The latest Hazard Review made no recommendation f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044159,
      "SummaryText": "or additoinal improvements. The report merely stated, \"LES should continue the excellent prevention program works implemented at the Rokeby Generating Station.\"\n\n\n\n5.Five-year accident history.\n\n\n\nThe Rokeby Station has not had a reportable accidental releases of anhydrous ammonia in the past five years. \n\n\n\n6.The emergency response program.\n\nLES has a detailed Emergency Response Plan which specifically addresses an ammonia release for the Rokeby Station. The The plan will be certified by plant managers and distributed to local response organizations and others. LES is committed to being a good neighbor in the community and a responsible one. \n\n\n\n7.Planned changes to improve safety.\n\n\n\nRokeby Station has met all of the requirements of RMP Hazard Review regulations, and for most aspects involved has significantly exceeded minimum requirements. There are no recommendations for further action by the Hazard Review. LES remains committed to the ammonia incident prevention program and diligent about finding ways to enhance the safety of the system. "
    }
  ]
}