{
  "FacilityID": 1000045628,
  "FacilityName": "The Gas Company SNG Plant",
  "FacilityStr1": "91-390 Kauhi Street",
  "FacilityStr2": null,
  "FacilityCity": "Kapolei",
  "FacilityState": "HI",
  "FacilityZipCode": "96707",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "15003",
  "LEPC": "Honolulu LEPC",
  "FacilityLatDecDegs": "21.308889",
  "FacilityLongDecDegs": "-158.090556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.hawaiigas.com",
  "FacilityEmailAddress": "jgrimmers@hawaiigas.com",
  "FacilityDUNS": 110398513,
  "ParentCompanyName": "Macquarie Infrastructure Company, LLC",
  "Company2Name": null,
  "CompanyDUNS": 177487654,
  "Company2DUNS": 0,
  "OperatorName": "The Gas Company",
  "OperatorStr1": "91-390 Kauhi Street",
  "OperatorStr2": null,
  "OperatorCity": "Kapolei",
  "OperatorStateFIPS": "HI",
  "OperatorZipCode": "96707",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Kita",
  "RMPTitle": "Director, Supply & Logistics",
  "FTE": 39,
  "OtherEPAFacilityID": "HID066272360",
  "EPAFacilityID": "100000077757",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-04-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-07-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-07-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-07-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 21.31188,
  "FRS_Long": -158.09839,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056657,
      "AltID": "Synthetic Natural Gas",
      "FacilityID": 1000045628,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000057599,
          "ProcessID": 1000056657,
          "NAICSCode": "22121",
          "_desc": {
            "NAICS_CODE": "22121",
            "NAICS_DESCRIPTION": "Natural Gas Distribution"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000069157,
          "ProcessID": 1000056657,
          "ChemicalID": 155,
          "Quantity": 600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000058804,
              "ProcessChemicalID": 1000069157,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000058805,
              "ProcessChemicalID": 1000069157,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000058806,
              "ProcessChemicalID": 1000069157,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000058807,
              "ProcessChemicalID": 1000069157,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000069508,
          "ProcessID": 1000056657,
          "ChemicalID": 155,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000058998,
              "ProcessChemicalID": 1000069508,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000058999,
              "ProcessChemicalID": 1000069508,
              "ChemicalID": 149,
              "_chemical": {
                "ChemicalID": 149,
                "ChemicalName": "Hydrogen",
                "CASNumber": "1333-74-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000569157,
          "ProcessID": 1000056657,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000569508,
          "ProcessID": 1000056657,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045628,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Gas Company owns and operates a synthetic natural gas plant as part of its gas distribution system on the Island of Oahu.  The facility operates under strict federal and state regulations for safety of its employees, its products and the environment.  By maintaining a comprehensive safety program and documenting the program in this Risk Management Plan, The Gas Company is complying with HIOSH and OSHA Process Safety Management Standards (called PSM) and EPAA?s Risk Management Program regulations (called RMP).\n\n\n\nThe Gas Plant has been safely operating since 1974.  At The Gas Company, we realize that constant diligence in operation and proper maintenance of our facility can reduce risks to our workers and to the public.  This RMP documents the procedures and controls in place to ensure that accidental releases of flammable materials are prevented and to promptly respond to and mitigate any incident that does occur.\n\n\n\nOur RMP and PSM programs are applied to all onsite activities that could involve or affect the facility.  Our safety programs prevent accidents because they focus on the rules, procedures and practices that govern individual processes, activities or pieces of equipment.  These rules are periodically reviewed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\nA mixture of flammable liquids and gases called naphtha is transferred by pipeline from an adjacent refinery and stored in pressure vessels.  The mixture is largely butane gas, pentane and hexane liquids and other light hydrocarbons.  A total storage capacity of 600,000 lb. is stored in 5 pressure vessels.  The naphtha is then pumped into the process facility, which uses a series of catalytic reactions to manufacture synthetic natural gas (called SNG).  The processes utilize catalysts in fixed beds and in tubes.  Catalysts are solid materials t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045628,
      "SummaryText": "hat promote the reaction of naphtha and its components with hydrogen and oxygen to form SNG and a byproduct.  CO2 is then supplied to a product pipeline.  The CO2 is piped to a local plant that bottles the gas and makes dry ice.  The SNG is distributed throughout the City of Honolulu and a number of surrounding communities.  System components include boilers, compressors, condensers, reactors, accumulators, piping and valves, instrumentation and controls and other miscellaneous components.\n\n\n\nNaphtha and its components are highly flammable and stored as a pressurized liquid in 5 horizontal storage tanks.  The tanks are protected by a water deluge system as well as fixed hydrants and monitors.  The process plant is located a considerable distance away from the storage area and it is unlikely that a fire in the process would involve the storage vessels.  The vessels are connected to the process by piping and therefore the process facility has been included in the RMP.  The primary hazard of the stored products and the process facility is the risk of explosion or fire.  The butane and other feed components are not considered acutely toxic material, although it could cause asphyxiation in large quantities.\n\n\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\nThe SNG Plant has integrated program elements described in the RMP to deal with the risks involved with the storage and handling of naphtha and other flammable materials throughout the manufacturing process. In this way, we promote overall plant, worker and public safety.  These program elements include:\n\n\n\nProcess Safety Information : The facility has been designed and installed by reputable vendors who are well known in the industry.  We require that information on the design and operation of the facility be documented and maintained for as long as we operate it.\n\n\n\nProcess Hazard Analysis : Our processes involving flammables have been thoroughly analyzed for unseen hazards using techniques that are common in process i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045628,
      "SummaryText": "ndustries.  Using trained teams of employees, with experienced hazard analysis leaders, we systematically review the details of design and construction.  Hazard analyses generate items that potentially could pose a risk to operations,  or could reduce risk or improve operability.  The hazard analysis findings are analyzed to determine if a change to the facility would be beneficial.  Items are addressed on a priority basis based upon safety and feasibility.\n\n\n\nOperating Procedures : Formal written operating procedures for operation and maintenance of our facility have been developed.  Procedures provide steps for each operating phase; they also document operating limits, safety and health considerations, and safety systems and their functions.\n\n\n\nTraining : The Gas Company has a very experienced workforce.  The average experience of operations is 16 years.  The Gas Company certifies that their operators are competent.  We ensure that newly hired employees are proficient at safely carrying out their duties and responsibilities before assigning them to critical tasks. \n\n\n\nMechanical Integrity : Preventive maintenance practices have been in place since the facility was constructed in 1974.  We perform routine safety checks, inspections, and preventive maintenance tasks to reduce the likelihood and severity of equipment failures.  Outside experts, including pressure vessel and piping inspectors are employed as needed to provide ongoing verification of the integrity of the system.  Hot work procedures, Lockout/Tagout procedures and others are used to document and control safe work practices.  \n\n\n\nManagement of Change : Changes to the process, including chemicals, technology, equipment and procedures and changes to equipment that could affect the process or storage of flammables are managed through use of a written management of change procedures.  Designated management personnel must authorized changes under this program element.\n\n\n\nPre-startup Safety Review : Before a m"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045628,
      "SummaryText": "ajor change can be instituted, Pre-startup Safety Review requires that construction and equipment is in accordance with design specifications, procedures are in place and adequate, process hazard analysis is performed, recommendations resolved, and training is conducted.\n\n\n\nCompliance Audits : Under the RMP, The Gas Company is required to evaluate compliance with the RMP and PSM regulations at least every three years.\n\n\n\nIncident Investigation : The RMP requires that incidents which resulted in or could reasonably have resulted in a catastrophic release of naphtha be investigated promptly by a team of investigators with the appropriate knowledge and experience to thoroughly investigate the incident.  An Incident Investigation Committee has been formed consisting of the site ESH officer, a member of the corporate ESH department, a member of the maintenance department and an operator.  \n\n\n\nEmployee Participation : We actively encourage and require our employees to participate in program development and enforcement.  We have a documented system that verifies employee participation in each program element.\n\n\n\nHot Work Permit : Before work is performed which involves a potential source of ignition, designated personnel must inspect the work area, review the procedures and document precautions necessary to prevent fires or explosions.  The written permit authorizes work on specific dates and on specific equipment.\n\n\n\nContractors : The Gas Company has a program in place to collect safety program and performance information from its contractors and evaluate the contractorsA? suitability.  Contractors are audited to verify that they are meeting their obligations under the RMP and other facility safety rules.  The ContractorA?s safety record, training program and procedures are evaluated before they are hired and periodically during the course of the contract.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nEPA requires that facilities document a five year history of accidental releases that "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000045628,
      "SummaryText": "caused serious onsite or offsite consequences.  The SNG Plant had one reportable incident in the last five years.  Operator error caused in excess amount of NaOH to be added into the Neutralizing Pit which was eventually dumped to our underground injection well.  The amount of NaOH was in excess of its reportable threshold limit.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe SNG facility has an emergency response plan to address actions taken by employees during an emergency.  The plan provides for immediate response by facility operators and for emergency notification of public and company response resources.  The emergency response plan details how The Gas Company will interface with the public and local agencies.  All employees at the facility are periodically trained in the provisions of the emergency response plan and the relevant aspects of the Incident Command System utilized by The Gas Company and other response agencies.\n\n\n\nThe Gas Company is also an active participant in Campbell Local Emergency Action Network (CLEAN), a volunteer organization established to promote emergency planning and public education in the Campbell Industrial Park.  As a member of CLEAN, The Gas Company participated in the development of the award winning Campbell Industrial Park Emergency Action Guide.  It provides comprehensive information to the nearby communities and to Park businesses on emergency preparedness.  It has established a framework for emergency coordination among both private and public response groups.  The Fire Department and Honolulu City and County Civil Defense actively participate in CLEAN activities and assisted in developing the plan.  CLEAN also launched an initiative to purchase and distribute emergency alert radios throughout the Industrial Park and nearby sensitive populations that could be affected by an emergency.  These devices, when activated through the Emergency Alert System can provide warning and instruction to Campbell Industrial Park businesses and to near"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000045628,
      "SummaryText": "by sensitive receptors in event of an emergency.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThrough the process of developing and implementing Process Safety Management and Risk Management Programs, The Gas Company has identified and implemented numerous improvements to its program and facility.  Through the cycles of hazard analysis, audits, management of change and other programs, items of potential improvements are continuously identified, prioritized, and resolved.  Some of these items that will addressed in the upcoming months include:\n\n\n\n?         Upgrade piping to prevent under insulation corrosion\n\n?         Construction of a bridge over previously underground naphtha piping to allow for monitoring of the piping\n\n?         Installation of valves (locked in the open position) to facilitate PSV inspection and replacement\n\n"
    }
  ]
}