{
  "FacilityID": 1000039940,
  "FacilityName": "DuPont Yerkes Plant",
  "FacilityStr1": "Sheridan Drive & River Road",
  "FacilityStr2": "3115 River Road",
  "FacilityCity": "Buffalo",
  "FacilityState": "NY",
  "FacilityZipCode": "14207",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36029",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.968333",
  "FacilityLongDecDegs": "-078.914167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "WWW.DuPont.com",
  "FacilityEmailAddress": "info@dupont.com",
  "FacilityDUNS": 116841945,
  "ParentCompanyName": "DuPont Specialty Products USA, LLC.",
  "Company2Name": null,
  "CompanyDUNS": 116841945,
  "Company2DUNS": 0,
  "OperatorName": "DuPont Company",
  "OperatorStr1": "Sheridan Drive & River Road",
  "OperatorStr2": "3115 River Road",
  "OperatorCity": "Buffalo",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14207",
  "OperatorZipCodeExt": null,
  "RMPContact": "Julie Sansone",
  "RMPTitle": "Environmental Engineer",
  "FTE": 550,
  "OtherEPAFacilityID": "14207DPNTYSHERI",
  "EPAFacilityID": "100000096308",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "914640003100292",
  "SafetyInspectionDate": "2018-08-02 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-03-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.96939,
  "FRS_Long": -78.9115,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049248,
      "AltID": "Tedlar* Manufacturing",
      "FacilityID": 1000039940,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000049711,
          "ProcessID": 1000049248,
          "NAICSCode": "326113",
          "_desc": {
            "NAICS_CODE": "326113",
            "NAICS_DESCRIPTION": "Unlaminated Plastics Film and Sheet (except Packaging) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059733,
          "ProcessID": 1000049248,
          "ChemicalID": 102,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 102,
            "ChemicalName": "Vinyl fluoride  [Ethene, fluoro-]",
            "CASNumber": "75-02-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000559733,
          "ProcessID": 1000049248,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039940,
      "SummaryText": "DUPONT YERKES PLANT EXECUTIVE SUMMARY\n\n\n\nINTRODUCTION\n\n\n\nAt the DuPont Yerkes Plant, we use a combination of accidental release prevention and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.  This RMP document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n\n\no Accidental release prevention and emergency response policies\n\no Facility description and substance regulated by Risk Management Plan (RMP) regulation\n\no Worst-case and alternative-case release scenarios\n\no Five-year accident history for accidental releases of RMP chemicals\n\no General accidental release prevention program and chemical-specific prevention steps\n\no Overview of our emergency response program\n\no Planned facility changes to improve safety and prevent accidental releases \n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe DuPont Yerkes plant is committed to operating and maintaining all of our processes in a safe and responsible manner.  A guiding principle, as stated in our Yerkes Vision Statement, is \"We will secure our future by.... advancing our Core Values of Safety, Ethics, Environmental Stewardship and Respectful Treatment of People\", both at our facility and in our community.\n\n\n\nThe DuPont Yerkes Plant adheres to Corporate policies.  These policies are embodied in numerous Environmental, Safety, Health & Security standards, which apply globally.  These standards can be summarized as follows:\n\n\n\no    Zero injuries, occupational illnesses, and incidents, all are preventable. \n\no    Protecting resources by driving towards zero waste and emissions.\n\no    Designing, building, operating, and maintaining our facilities to effectively manage process safety and other \n\n        hazards and to \n\n        minimize process and product risks.\n\no    Securing the physical and cyber integrity of our facilities and working with our va"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039940,
      "SummaryText": "lue chain to do the same. \n\no    Delivering products and solutions that contribute to a safer and more sustainable future throughout the \n\n        product life cycle. \n\no    Resolving circumstances responsibly that require corrective action. \n\n\n\nFACILITY DESCRIPTION AND SUBSTANCE REGULATED BY RMP REGULATION\n\n\n\nThe Yerkes plant covers approximately 100 acres in a highly industrialized section of the Town of Tonawanda, NY.  The facility is fully fenced and monitored 24 hours a day by a security force.  Various products have been manufactured on the site since 1921.  Currently, the site consists of two manufacturing businesses:\n\n\n\no Tedlar(R); polyvinyl fluoride films\n\no Corian(R); sheet building materials\n\n\n\nThe only EPA RMP listed substance at Yerkes is VINYL FLUORIDE (VF), a flammable.  VF is located in the Tedlar &reg; unit.  \n\n\n\nWORST-CASE AND ALTERNATIVE-CASE RELEASE SCENARIOS\n\nFollowing are brief summaries of the Worst and Alternate case scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario:\n\n\n\nWorst-case Release Scenario: Vinyl Fluoride, Regulated Flammable Chemical\n\nThe worst-case release scenario following RMP regulation guidelines is a Vinyl Fluoride storage tank failure, with no mitigation assumed.  A release, if ignited, could result in a vapor cloud explosion that can have an off-site impact, but no impact on public receptors.   A release is unlikely to due proper equipment design and strict mechanical integrity evaluations. There is also a water deluge fire protection system and emergency venting to further protect against this scenario.\n\n\n\nAlternative Release Scenario Vinyl Fluoride, Regulated Flammable Chemical\n\nThe alternate-case release scenario is the most likely hazardous event discussed in the 2016 cyclic Process Hazards Analysis \"2016 VF Unloading and Storage\".  This scenario would consist of a  1/4 inch hole in a portion of the process containing liquid VF, such"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039940,
      "SummaryText": " as;  an unloading flexible hose, any part of a storage tank, or associated piping.   The hole is assumed to be directing the leak towards the ground, which would provide the most opportunity for increase confinement.  This could result in a vapor cloud fire.  Further details of this scenario are available in the Process Hazards Analysis.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY FOR ACCIDENTAL RELEASES OF RMP CHEMICALS\n\nWithin the past five years, the Tedlar(R); process has had no accidental release that caused offsite impacts provided in the Risk Management Plan regulation, (40 CFR 68.10(b)(1)).\n\nIncident investigation reports are maintained in the unit. \n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND VINYL FLUORIDE SPECIFIC PREVENTION STEPS\n\nYerkes accidental release prevention programs and contingency planning efforts help us effectively manage the hazards of VF.  The site takes a systematic, proactive approach to prevent accidental releases of VF.  The process to react Vinyl Fluoride to form polyvinyl fluoride follows the requirements of the DuPont Corporate Process Safety Management (PSM) standard.  This standard includes the requirements of 29 CFR 1910.119 and 40 CFR Part 68.  Yerkes management systems address each of the key features of the layers of protection necessary for a successful prevention program including:\n\no Equipment Specifications \n\n     ?    Industry specific standards are followed for all equipment.\n\n     ?    Document design specifications and calculations for storage tanks, piping, \n\n        safety relief valves and other Process Safety \n\n        Management critical equipment are maintained as controlled documents.\n\n     ?    VF delivery tank trucks are equipped with an excess flow valve and pressure \n\n        relief device.\n\n     ?    VF tank truck unload hoses have  break away couplings that would automatically \n\n        close valves if the connection is broken between the trailer and process.\n\no Training\n\n     ?  Operations, maintenance and contractor per"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039940,
      "SummaryText": "sonnel working with or close \n\n        to VF equipment are trained per OSHA and DOT standards.\n\n     ?    Operators working with VF equipment as well as supervision, and site \n\n        emergency response team are HAZWOPER trained (29 CFR1910.120).\n\no Operating and Safety Procedures\n\n     ?    Whenever there is a change to technology, facilities or a subtle \n\n        change, the site Management of Change Process covers \n\n        updating operating procedures and safe work practices.\n\n     ?    Operating and Safety procedures are reviewed and reauthorized at \n\n        intervals not to exceed three years. \n\n     ?    Checklists and/or procedures for PSM critical operations are \n\n        controlled and reviewed.\n\n     ?  Operating procedures are certified annually to be current and accurate \n\n        in the covered process. \n\n     ?    Pre-start up safety reviews (PSSRs) are conducted on new, or modified \n\n        equipment \n\n        as part of the management of change process. \n\n     ?    Remote continuous leak detection monitoring of VF is performed.\n\n     ?    Qualified operators observe VF unloading during the entire duration of \n\n        the task.\n\n\n\n o Maintenance Inspection Systems\n\n     ?    All PSM critical equipment have a periodic inspection frequency.\n\n     ?    Mechanical work plans are reviewed via the work order system.\n\n     ?    VF tank trucks are dedicated, inspected, and maintained per 49 CFR 180.407(c).\n\n     ?    Preventative Maintenance (PM) is performed routinely on existing equipment.\n\no Safety and Emergency Systems\n\n     ?    A Process Hazard Analysis of the VF storage and unloading operation is \n\n        performed every 5 years.\n\n     ?    Incident investigations are conducted for all incidents and near \n\n        misses to prevent re-occurrences.\n\n     ?    An emergency vent stack is designed to direct VF away from the \n\n        occupied area to a safe location. \n\n     ?  A safety interlock system protects portions of the process by shutting down \n\n        operating equipment prior to,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000039940,
      "SummaryText": " or during an emergency event.\n\n     ?    A 600 GPM water deluge system will automatically activate in the event of a \n\n        fire from the VF tank farm. \n\n     ?  The water deluge system is manually activated per Emergency response procedures \n\n        in the event of a significant release from the system. \n\n     ?    All vessels containing VF are continuously monitored for temperature and \n\n        pressure. An alarm will sound if conditions are \n\n        outside of standard operating parameters.\n\n     ?    A computerized work order system, that issues PMs, is used to track inspections \n\n        of all  PSM equipment.\n\n\n\nOVERVIEW OF OUR EMERGENCY RESPONSE PROGRAM\n\nYerkes maintains an integrated emergency control plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning.\n\nThe site program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, we coordinate our plan with the Town of Tonawanda, NY Emergency Services.  Our program can be summarized as follows:\n\no Tedlar(R); Specific Procedures include:\n\n    ?    Emergency shutdown procedure for an uncontrolled reaction, explosion, or fire;\n\n    ?    Emergency shutdown for a VF leak inside the Polymer Area barricade;\n\n    ?    Emergency shutdown for a VF leak outside the Polymer Area barricade.\n\n\n\no Yerkes Emergency Control Plan Overview\n\n    ?    Plant fire alarm is sounded in area of emergency and emergency responders report.\n\n    ?    Disaster alarm sounded as needed and Emergency Control Plan activated.\n\n    ?    Central and Field Control Organizations report to designated areas.\n\n    ?    Community emergency responders are notified as appropriate.\n\n\n\no External Resources\n\n    ?    Local fire department with hazmat capabilities are aware of the hazards and have toured the site.\n\n    ?    Yerkes has contracts with external companies for emergency response assistance.\n\n    ?    Yerkes is"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000039940,
      "SummaryText": " a member of the local Hazardous Materials Advisory Council for mutual \n\n        aid.\n\n    ?    DuPont Yerkes is an active member of the Erie County Local Emergency Planning Committee.\n\n\n\no Training and Preparation\n\n    ?    Yerkes personnel receive emergency response training.\n\n    ?    Yerkes holds site emergency drills and participates in community drills.\n\n    ?    Community and contract emergency responders tour the Yerkes Plant.\n\n    ?    Yerkes Risk Management Plan has been presented to Erie County LEPC.\n\n\n\n\n\nPLANNED FACILITY CHANGES TO IMPROVE SAFETY AND PREVENT ACCIDENTAL RELEASES\n\nThe following is a list of improvements that we are planning to implement at Yerkes to help prevent and / or better respond to accidental chemical releases:\n\n\n\n    ?   A deluge system at VF unloading pad.\n\n    ?   New VF storage tanks to replace the existing tanks."
    }
  ]
}