{
  "FacilityID": 1000027559,
  "FacilityName": "Phibro-Tech, Inc.",
  "FacilityStr1": "8851 Dice Road",
  "FacilityStr2": null,
  "FacilityCity": "Santa Fe Springs",
  "FacilityState": "CA",
  "FacilityZipCode": "90670",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.960300",
  "FacilityLongDecDegs": "-118.066100",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.phibrotech.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 20521373,
  "ParentCompanyName": "Phibro Animal Health Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dwight Glover",
  "OperatorStr1": "8851 Dice Road",
  "OperatorStr2": null,
  "OperatorCity": "Santa Fe Springs",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90670",
  "OperatorZipCodeExt": null,
  "FTE": 63,
  "OtherEPAFacilityID": ".",
  "EPAFacilityID": "100000065172",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-10-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Anhydrous Ammonia System (Federal)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-04-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-04-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-04-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 33.95995,
  "FRS_Long": -118.0676,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000033649,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000027559,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000040653,
          "ProcessID": 1000033649,
          "ChemicalID": 56,
          "Quantity": 58000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000033906,
          "ProcessID": 1000033649,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000029379,
              "Process_NAICS_ID": 1000033906,
              "SafetyReviewDate": "2012-03-30 00:00:00",
              "PHA_Date": "2012-03-30 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Adjacent liquid CO2 Tank Rupture",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Administrative Controls",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-02-04 00:00:00",
              "TrainingReviewDate": "2012-02-24 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Onsite Job Training Courses and Discussions",
              "MaintenanceReviewDate": "2012-02-24 00:00:00",
              "EquipmentInspectionDate": "2010-11-10 00:00:00",
              "EquipmentTested": "Ammonia Storage Tanks",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2007-03-30 00:00:00",
              "PreStartupReviewDate": "2012-02-24 00:00:00",
              "ComplianceAuditDate": "2010-10-06 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-02-24 00:00:00",
              "HotWorkPermitReviewDate": "2012-02-24 00:00:00",
              "ContractorSafetyReviewDate": "2012-02-24 00:00:00",
              "ContractorSafetyEvalDate": "2012-02-24 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anhydrous Ammonia Unloading, Storage and Transfer",
              "_chemicals": [
                {
                  "PrimaryKey": 1000035040,
                  "PreventionProgram3ID": 1000029379,
                  "ProcessChemicalID": 1000040653
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000027559,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2011-12-24 00:00:00",
    "ERTrainingDate": "2012-03-06 00:00:00",
    "CoordinatingAgencyName": "City of Santa Fe Springs Fire Dept.",
    "CoordinatingAgencyPhone": "5629449413",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "California Code of Regulations 2735.1 et.seq. (CalARP), 29CFR1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027559,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n\n\nThis Executive Summary contains Phibro-Tech, Inc.'s administrative and operational programs to prevent ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is ammonia.  The following topics are addressed in this Executive Summary:\n\n\n\n?    Accidental Release Prevention and Emergency Response Policies,\n\n?    Stationary Source and Regulated Substance,\n\n?    Off-site Consequence Analysis,\n\n?    Accidental Release Prevention Program and Chemical-Specific Prevention Steps,\n\n?    Five-Year Accident History,\n\n?    Emergency Response Program, and\n\n?    Planned Changes to Improve Safety.\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe Phibro-Tech facility abides by the emergency procedures and policies detailed in the Emergency Action Plan manual.  This Plan was designed to meet the following objectives:\n\n\n\n1.)    To save lives.\n\n2.)    To minimize and avoid injuries.\n\n3.)    To protect the environment.\n\n4.)    To minimize property damage.\n\n\n\nPhibro-Tech maintains an emergency response committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, anhydrous and aqueous ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the Process Safety Management (PSM) and Risk Management Program (RMP) regulations, as well as to incorporate any facility changes.\n\n\n\nThe anhydrous ammonia process at Phibro-Tech is a Program Level 3 process under PSM, RMP, and California Accidental Release Prevention (CalARP). \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Phibro-Tech facility is located at 8851 Dice Road in Santa Fe Springs, California.  The facility is located approximately "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027559,
      "SummaryText": "1.8 kilometers (1.1 miles) east of the 605 Freeway and 0.6 kilometers (0.4 miles) south of Slauson Avenue.  This area consists of mostly industrial complexes with the nearest residential areas to the west and northwest.\n\n\n\nThe regulated substance of concern at Phibro-Tech is ammonia, both anhydrous and aqueous (less than 20 percent).  The process that uses or generates the regulated substance is the anhydrous and aqueous Ammonia Etchant System.  The occurrences of the regulated substances are described below.\n\n\n\nAqueous Ammonia Etchant System:\n\n\n\nThe facility stores a maximum of 58,000 pounds (10,200 gallons) of anhydrous ammonia in the bulk anhydrous ammonia tank.  The facility also stores etchant product solution that is an aqueous solution of ammonia at concentrations of less than 20 percent.  The approximately 48,000 gallons of etchant product storage capacity will hold less than 58,000 pounds of ammonia in the form of aqueous ammonia in product solutions.  A Material Safety Data Sheet (MSDS) for ammonia is given in Appendix B.\n\n\n\nAnhydrous ammonia, water, carbon dioxide (CO2), and other additives are combined with ammonium chloride solutions in mix tanks (reactor vessels) to produce product (etchant).  The process is a batch process.  The ammonium chloride solutions are produced in the cupric chloride and copper ammonium chloride systems elsewhere in the facility.  Ammonium chloride and CO2 are not covered chemicals under RMP and CalARP.  The ammonia remaining in the spent etchant returned to Phibro-Tech for processing is not a covered process as the partial pressure of ammonia in the spent etchant is less than the RMP threshold value of 10 millimeters of mercury. \n\n\n\nThe product solutions created in the mix tanks are transferred to storage tanks for holding.  These solutions are then transferred to drums and totes for shipment to customers.  Prior to filling, all drums and totes are washed to remove the remains of prior etchant solutions.  A scrubbing system r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027559,
      "SummaryText": "emoves ammonia from the exhaust of all process vents.  A system of ammonia sensors is in the process area and at strategic locations along the fence line to detect accidental releases of ammonia.  A process logic controller (PLC), in conjunction with various sensors, interlocks, and the electronically controlled anhydrous ammonia valves, ensures proper operation of the process.\n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nIn light of security concerns, and consistent with U.S. Environmental Protection Agency (EPA) policy, discussion of the Off-site Consequence Analysis (OCA) has been omitted from the text of this RMP / PSM plan.  \n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe Phibro-Tech facility, including each chemical recovery system, was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of chemical recovery systems.  These safety features include ammonia sensors, automatic shut down buttons, and scrubbers, each of which are described below.\n\n  \n\nAmmonia Detectors\n\n\n\nThe ammonia sensors are located in the vicinity of the ammonia storage tank, cupric oxide reactor, the maintenance shop, the laboratory, and on the north side of the facility, along the fence line (2).  The ammonia sensors are located outside and therefore are protected with a porous plastic cover to prevent contact with chemicals, dirt, water, or dust contaminants. \n\n\n\nEmergency Shut Down Buttons\n\n\n\nAmmonia remote emergency shutdown (ESD) buttons are placed throughout the facility.  In the event of an emergency, the operator can use one of these buttons to shut off the ammonia flow.  The four ammonia ESD buttons are located near the ammonia etchant area, the maintenance shop, and the production office (2).\n\n\n\nChemical Storage Dike Areas\n\n\n\nAll of the chemical recovery process equipment and acid storage vessels are located in diked areas at different locations throughout the facility."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000027559,
      "SummaryText": "  There is no containment around the anhydrous ammonia storage tank.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThe accident history researched back 13 years to June 1999 shows that the Phibro-Tech facility has not had an accidental release or 'near miss' release of ammonia in the 13 previous years.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Phibro-Tech has an Emergency Action Plan in effect at the facility.  The Plan is detailed in the Emergency Planning and Response section of this PSM/RMP document.  \n\nThe Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate facility changes due to the renovation of the facility.\n\n\n\nProcess Hazards Analysis \n\n\n\nA five-year PHA update was conducted on March 15, 2012, at the Phibro-Tech facility.  No significant changes to the anhydrous and aqueous ammonia processes have occurred since the 2007 PHA.  Consistent with the findings of the 2007 PHA, no hazardous operating modes were identified that required immediate attention.  Consequently, the focus of the PHA review was the implementation of the recommendations from the prior 2007 PHA, potential external events, human factors that could contribute to a release, and residual risk reduction in the covered processes.\n\n\n\nRecommended Changes to Improve Safety:\n\n\n\nSeven recommendations were developed during the 2012 PHA and seismic review as potential improvements for safety.\n\n\n\n1)    Phibro-Tech should review all piping and instrument diagrams for the Ammonia Etchant system and update those found to be out of date to reflect current as-built conditions\n\n2)    Implement the Management of Change and Pre-Startup Safety Review procedures for all covered "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000027559,
      "SummaryText": "modifications to the anhydrous ammonia and aqueous ammonia processes.\n\n3)    Preventative maintenance is recommended to prevent further deterioration of the structural supports for the ammonia tank and associated piping.  Inspection and maintenance of all areas of corrosion in the ammonia system should be performed, including removal of visible rust and deteriorated material and the application of a corrosion protection coating.\n\n4)    Evaluate installation of secondary containment around the anhydrous ammonia tank as an improvement for worker safety in the event of a leak or rupture of the anhydrous ammonia tank.\n\n5)    Evaluate the benefit of labeling hoses and hose connections to ensure that proper connections are made during batch production of etchant.  Associated with the labeling of connections, evaluate if connection diagrams should be made available to operators in the process area and if the production procedures and checklist should be modified to add a step to verify the hose connections prior to startup of the batch process.\n\n6)     Evaluate the feasibility of installation of an ammonia sensor in the exhaust of the scrubber system as a means of early detection of process upset in the Ammonia Etchant system.  \n\n7)    Evaluate the feasibility of improving the acquisition and display of sensor and monitoring data over the plant network to allow analysis of temporal and other trends in monitored parameters at individual work stations.  Such display of data improves safety by allowing more flexible realtime review of ammonia and other process operating conditions.\n\n"
    }
  ]
}