{
  "FacilityID": 1000011427,
  "FacilityName": "Tolt Treatment Facility",
  "FacilityStr1": "39025 NE North Fork Road",
  "FacilityStr2": "PO BOX 1029",
  "FacilityCity": "Duvall",
  "FacilityState": "WA",
  "FacilityZipCode": "98019",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53033",
  "LEPC": "King County LEPC",
  "FacilityLatDecDegs": "47.705623",
  "FacilityLongDecDegs": "-121.823659",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "OT",
  "FacilityURL": "http://www.seattle.gov/utilities",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "American Water CDM",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Seattle Public Utilities",
  "OperatorStr1": "39025 NE North Fork Road",
  "OperatorStr2": "PO BOX 1029",
  "OperatorCity": "Duvall",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98019",
  "OperatorZipCodeExt": null,
  "RMPContact": "Larry Wilt",
  "RMPTitle": "Facility Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173368",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-10-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-10-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-10-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 47.70556,
  "FRS_Long": -121.82333,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013624,
      "AltID": "Water Treatment Facility",
      "FacilityID": 1000011427,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000013985,
          "ProcessID": 1000013624,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015637,
          "ProcessID": 1000013624,
          "ChemicalID": 62,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000515637,
          "ProcessID": 1000013624,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011427,
      "SummaryText": "American Water Services CDM is contracted with the city of Seattle to treat and supply water to SPU customers.\n\n\n\nFacility Overview and Process Flow.  The facility treats up to 120 million gallons of water per day (MGD) from the Tolt Reservoir with filtration, ozonation, chloridation, fluoridation and the addition of lime for corrosion control. It provides about one third to one half of the water for the city of Seattle and its regional customers. The facility is also designed to conform to anticipated environmental regulations.\n\n\n\nTreatment\n\n?    South Fork Tolt river:  Supplies untreated water that is gravity fed from the Tolt Reservoir into the regulation basin and then to the facility.\n\n?    Ozone Generation: Liquid oxygen stored in tanks is vaporized and fed as a gas and is passed through an electric field and a percent is converted into ozone. Ozone, a very strong oxidant, is finely bubbled through the water to create measurable residual for primary disinfection.\n\n?    Cationic polymers and Ferric Chloride are added to further oxidize and conglomerate the solids.\n\n?    Filtration: Six high-rate water filters are employed to remove particulates and pathogens.  Water flows down through six feet of anthracite coal filter media.  The filters are cleaned regularly by reversing the water flow (backwashing).  The backwash water is collected and routed to the Recovery Basins for clarification and particulate/solids removal and the decanted water is then returned to the plant. Solids are then removed and disposed of via land use application to farm land.\n\n?    Final Treatment: After filtration, chemicals are added for residual disinfection, fluoridation, and corrosion control.\n\n?    Clearwell storage consists of 7.4 million gallon buried reservoir used to store treated water and balance fluctuations in demand.  Two storage units allow for the facility to remain in service while inspections and maintenance take place in the one unit.\n\n\n\nWater treatment Compounds and Disinfectants. The To"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011427,
      "SummaryText": "lt water treatment facility uses a variety of compounds to achieve optimal water quality.\n\n?    Liquid oxygen:  The feed gas for ozone generation\n\n?    Chlorine:  To provide a secondary disinfectant to meet State Department of Health requirements.\n\n?    Carbon Dioxide and Lime:  To adjust the pH and alkalinity of filtered water to meet SPU standards.\n\n?    Ferric chloride: The primary coagulant\n\n?    Cationic Polymer:  A coagulant aid\n\n?    Anionic/ nonionic polymer: A filtration and waste wash water clarifier aid.\n\n?    Hydrofluosilicic acid:  A fluoride source for dental benefits.\n\n?    Sodium Bisulfite:  Used to quench excess ozone residual.\n\n\n\n\n\nChemicals stored at the Tolt Treatment Facility that are targeted by the PSM and/or the RMP are chlorine, ozone and propane. \n\n\n\nChlorine     - stored in quantities above the WAC 296-67 threshold limit of 1,500 lbs.\n\n- stored in quantities above the 40 CFR Part 68 threshold limit of 2,500 lbs.\n\n\n\nOzone    - stored in quantities below the WAC 296-67 threshold limit of 100 pounds.\n\n\n\nPropane     - used solely for comfort heating.\n\n\n\nTherefore, chlorine is the chemical addressed in this Process Safety Management & Risk Management Plan, as required by the WISHA Process Safety Management Regulation WAC 296-67 and the EPA Risk Management Plan Regulation 40 CFR Part 68.  \n\n\n\nThe Tolt Water Treatment Facility will store up to 20 tons of chlorine gas in one-ton containers.  Containers will be stored in an enclosed building with a chlorine scrubber and gas containment provided by the building.  The facility is equipped with gas detectors that will activate the scrubber system in the event of a chlorine release.  The facility is staffed 24 hours a day by one licensed Water Treatment Operator.  During normal business hours there may be other employees, contractors, and/or consultants engaged in work at the facility.  The chlorine storage area at the facility is a secured zone and all access doors will be locked at all times unless authorized personnel are present. "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011427,
      "SummaryText": "  American Water Services CDM is committed to protecting employees, the public, and the environment from the release of chlorine gas.\n\n\n\nCHLORINE PROCESS CHEMISTRY  \n\n\n\nChlorine is added to water for disinfection and to maintain chlorine residual in the distribution system.  Chlorine can be added as a primary and/or secondary disinfectant during the water treatment process.  At the Tolt Treatment Facility, chlorine is added only as a secondary disinfectant to provide a chlorine residual for the water entering the distribution system.\n\n\n\nCHLORINATION PROCESS\n\n\n\nTwo banks of four chlorine containers provide an online and standby chlorine supply system. The containers are connected to a common manifold system by a 36\" long flexible container connector for the gas feed.  The preset manifold pressure-drop controls an automatic switch over system using isolation valves that are also activated by the chlorine leak detectors.  When a chlorine cylinder is depleted, the switchover system automatically switches the feed to the stand-by containers.  \n\n\n\nChlorine flows through the evaporators. The gas flows through a pressure control valve and then a vacuum-regulating valve before entering the chlorinator.  The gas is drawn by vacuum into the chlorinator where the flow rate is adjusted and controlled.  The vacuum is generated by water flowing through the eductor venturi and opens the check valve in the eductor.  Gas flows through the vacuum line into the eductor where the chlorine is mixed with water and fed to the filtered water channels and/or backwash water. \n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\n(WAC 296-67-053)\n\n\n\nAmerican Water Services CDM, in cooperation with Seattle Public Utilities has developed and implemented an emergency response plan for the Tolt Treatment Facility in accordance with the provisions of WAC 296-67-053, WAC 296-24-567 and 296-62 WAC, Part P.  Small releases of chlorine that do not require emergency response actions are covered under the facility's Stand"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011427,
      "SummaryText": "ard Operating Procedures found in the Hazardous Materials Management Plan.   The Hazardous Materials Management Plan provides guidelines and instruction to staff on when and how to determine whether any given chlorine release requires Emergency Response.\n\n\n\nIn the event Emergency Response is deemed necessary, staff will follow the detailed procedures in the Hazardous Materials Management Plan (HMMP) to alert outside responders of the event.  American Water Services CDM personnel will not respond to Chlorine Emergencies at the Tolt Facility.  \n\n\n\nAmerican Water Services CDM has chosen to coordinate emergency response efforts with the local emergency response provider, Eastside Fire & Rescue.  In the event of a chlorine emergency, American Water Services CDM staff will follow procedures provided in the HMMP.  The facility also has an Emergency Evacuation Plan that is appended to the (HMMP). \n\n\n\nNew audible alarms have been installed to the outside and inside, so operators and staff will be able to hear when there is a leak alarm.\n\n\n\nThe Emergency Response Plan (HMMP and Emergency Evacuation Plan)  is reviewed annually to ensure that it remains in compliance with WISHA PSM and EPA RMP regulations. \n\n\n\nEMERGENCY RESPONSE TRAINING\n\n\n\nAmerican Water Services CDM will conduct awareness-level emergency response training (296-62 WAC, Part P) of for all personnel on-site. Refresher training of sufficient content and duration will be provided annually to all personnel. The intent of refresher training is to ensure all personnel maintain a required level of competency. A review of the training program will be conducted after the emergency drills and training have been completed.  Annual Haz-Mat training is now conducted on site in conjunction with East Side Fire and Rescue. \n\n\n\nAmerican Water Services CDM will provide all community responder organizations that will assist in major incidents with a copy of the ERP and every revision. The Facility Manager will arrange for one mee"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011427,
      "SummaryText": "ting, drill or exercise each year with these local organizations to promote preparedness for effective response in the event of an incident. American Water Services CDM may also provide information on the ERP to residents and institutions in the area that may be impacted by a chlorine emergency.\n\n\n\nThere has been no Chlorine release or accident is the last ten years.\n\n\n\n"
    }
  ]
}