{
  "FacilityID": 1000050398,
  "FacilityName": "City of Toledo Division of Water Treatment",
  "FacilityStr1": "3040 York Street",
  "FacilityStr2": null,
  "FacilityCity": "Toledo",
  "FacilityState": "OH",
  "FacilityZipCode": "43605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39095",
  "LEPC": "Lucas County LEPC",
  "FacilityLatDecDegs": "41.665580",
  "FacilityLongDecDegs": "-083.475803",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Toledo",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Patekka Pope-Bannister",
  "OperatorStr1": "3040 York Street",
  "OperatorStr2": null,
  "OperatorCity": "Toledo",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43605",
  "OperatorZipCodeExt": null,
  "FTE": 85,
  "OtherEPAFacilityID": "OH0030759",
  "EPAFacilityID": "100000122903",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-23 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-07-20 15:41:06",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-06-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-06-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-06-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.66604,
  "FRS_Long": -83.47585,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "39.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000063407,
      "AltID": "Chlorination",
      "FacilityID": 1000050398,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000078371,
          "ProcessID": 1000063407,
          "ChemicalID": 62,
          "Quantity": 136000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000064549,
          "ProcessID": 1000063407,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000052679,
              "Process_NAICS_ID": 1000064549,
              "SafetyReviewDate": "2015-04-29 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-04-29 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-11-15 00:00:00",
              "TrainingReviewDate": "2013-12-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-29 00:00:00",
              "EquipmentInspectionDate": "2018-05-30 00:00:00",
              "EquipmentTested": "Process equipment is inspected daily as part of normal operations.",
              "ChangeMgmtDate": "2015-04-30 00:00:00",
              "ChangeMgmtReviewDate": "2015-04-29 00:00:00",
              "PreStartupReviewDate": "2015-04-29 00:00:00",
              "ComplianceAuditDate": "2016-08-25 00:00:00",
              "AuditCompletionDate": "2016-11-25 00:00:00",
              "IncidentInvestigationDate": "2012-09-18 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-10-21 00:00:00",
              "HotWorkPermitReviewDate": "2013-10-21 00:00:00",
              "ContractorSafetyReviewDate": "2013-10-21 00:00:00",
              "ContractorSafetyEvalDate": "2013-10-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000064703,
                  "PreventionProgram3ID": 1000052679,
                  "ProcessChemicalID": 1000078371
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050398,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "City of Toledo Fire Department",
    "CoordinatingAgencyPhone": "4192451180",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050398,
      "SummaryText": "inding is documented and retained.\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the City of Toledo Water Division Water Treatment Plant periodically updates and revalidates the hazard analysis results.  Results are communicated to affected employees. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the Chlorination Process is no longer in operation.  The results, findings and resolutions of these updates are documented and retained.\r\n\r\n3.3  Operating Procedures\r\nCity of Toledo Water Division engineers, operators, and management work together to develop and maintain written operating procedures to define how tasks related to the Chlorination Process operation should be safely performed. Operating procedures are reviewed annually to ensure they are accurate and up to date. These written procedures address various modes of process operations, such as:\r\n* normal startup,\r\n* normal operations,\r\n* temporary operations,\r\n* emergency shutdown,\r\n* normal shutdown, and\r\n* initial startup of a new process.\r\n  The written operating procedures include:\r\n* steps for safely conducting process tasks,\r\n* applicable process safety information, such as safe operating limits and consequences of process deviations, steps to correct or avoid deviations and\r\n* safety and health considerations, such as chemical hazards, personal protective equipment requirements, and action(s) to take in the event of an exposure to a hazardous substance.\r\n\r\n3.4  Training\r\nThe City of Toledo Water Division Water Treatment Plant trains workers to safely and effectively perform their assigned tasks.  The City of Toledo Water Division Water Treatment Plant training program includes both initial and refresher training that covers:\r\n* a general overview of the Chlorination Process,\r\n* the properties and hazards of the substances in the process, and\r\n* a de"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000050398,
      "SummaryText": "essary training related to the change.\r\n\r\n3.7  Pre-startup Review\r\nThe City of Toledo Water Division Water Treatment Plant performs a safety review of all new or modified processes prior to their being placed into service to ensure that these processes have been prepared to operate safely.  This review is designed to confirm:\r\n* construction and equipment are in accordance with design specifications,\r\n* adequate safety, operating, maintenance, and emergency procedures are in place,\r\n* employee training has been completed, and\r\n* for covered processes, a PHA has been performed for new processes and management of change requirements have been completed for modified processes.\r\nA pre-startup review team uses checklists to verify all aspects of readiness.  The review involves field verification of the construction elements and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n\r\n3.8  Compliance Audit \r\nThe City of Toledo Water Division Water Treatment Plant conducts periodic audits of the Chlorination Process to ensure the City of Toledo Water Division Water Treatment Plant Prevention Program has been effectively implemented and addresses the safety issues of our operations.  Compliance audits are conducted at least every three years by a team of hourly and management personnel who are knowledgeable of the RMP Rule and the Chlorination Process.  The team evaluates the City of Toledo Water Division Water Treatment Plant Prevention Program and other aspects of the City of Toledo Water Division Water Treatment Plant Risk Management Program.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the Prevention Program are implemented.  The City of Toledo Water Division Water Treatment Plant maintains records of at least the last two audits conducted.\r\n\r\n3.9  Incident Investigation\r\nThe City of Toledo Water Division Water Treatment Plant pro"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000050398,
      "SummaryText": "tion conduct their work in a safe manner.  Under the program, the record of all contractors is reviewed to ensure that City of Toledo Water Division Water Treatment Plant hires contractors who can safely perform work on or near covered process equipment.  Our program ensures that contractors:\r\n* perform their work in a safe manner,\r\n* have the appropriate knowledge and skills,\r\n* are aware of the hazards in the workplace,\r\n* understand what to do in the event of an emergency,\r\n* understand and follow the City of Toledo Water Division Water Treatment Plant's safety rules, and\r\n* inform City of Toledo Water Division Water Treatment Plant personnel of any hazards identified during their work.\r\nProgram efforts are accomplished by providing contractors with:\r\n* a process overview,\r\n* information about safety and health hazards,\r\n* emergency response plan requirements, and\r\n* safe work practices prior to beginning work.\r\n\r\n4.0  Chemical Specific Prevention Steps\r\nIndustry standards are followed at the City of Toledo Water Division Water Treatment Plant to help ensure safe handling of chlorine.  The vendor supplies chlorine via a Department of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The chlorination process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works Association, ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to the guidelines required by the City of Toledo Water Division.\r\n\r\n5.0  Emergency Response Programs\r\nThe City of Toledo Water Division Water Treatment Plant has prepared a written emergency action plan that complies with the RMP Rule, other federal standards and industry guidelines.  This plan has been communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  The City of"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050398,
      "SummaryText": "edo Water Division Water Treatment Plant Chlorination Process is covered by the OSHA Process Safety Management standard.  The requirements of the OSHA Process Safety Management standard are nearly identical to the RMP Rule Program 3 Prevention Program requirements.  The Chlorination Process Prevention Program consists of the following elements.\r\n\r\n3.1  Process Safety Information\r\nThe City of Toledo Water Division Water Treatment Plant maintains a variety of technical documents that help ensure the safe operation of our processes.  These documents address:\r\n* physical properties of hazardous substances handled,\r\n* chemical properties and associated hazards of those substances,\r\n* operating parameters and limitation(s) of the process equipment,\r\n* design basis and configuration of the equipment, and\r\n* specific chemical inventories.\r\nThe City of Toledo Water ensures that the process safety information is available to all City of Toledo Water Division Water Treatment Plant employees, the Local Emergency Planning Committee (LEPC), and the local fire department. \r\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets (SDSs).  This information is supplemented by other technical information specific for these chemicals.  Continuous attention is given to revisions and updates on the hazards of chlorine and other chemicals used in our process.  Information regarding toxicity, environmental impacts, corrosion concerns, inadvertent mixing hazards, and other safety and health concerns are addressed and communicated to the appropriate parties.\r\nThe City of Toledo Water Division Water Treatment Plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes:\r\n* materials of construction,\r\n* design pressures,\r\n* temperature rating,\r\n* flow limits,\r\n* block flow diagrams,\r\n* consequences of devi"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000050398,
      "SummaryText": "Toledo Water Division periodically conducts emergency drills to test our emergency plan and coordinate these drills with the local fire department.\r\n\r\n6.0 Five Year Accident History\r\nOur facility has had no EPA reportable incidents in the last five years. \r\n \r\n7.0  Planned Changes to Improve Safety\r\nThe City of Toledo Water Division Water Treatment Plant continuously strives to improve the safety of our processes through incident investigation, Process Hazard Analysis, and employee suggestions.  Our engineering and technical personnel stay abreast of technology advancements which may improve the safety of our processes.  As a result of these efforts, the City of Toledo Water Division is improving the comprehensiveness of our mechanical integrity, and training programs. Additionally, improvements to the process areas that will increase safety for our personnel and the public are currently in progress."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050398,
      "SummaryText": "tailed review of the process operating procedures and safe work practices.\r\nIn addition to the above mentioned classroom training, each operator is required to work for a period of time with an experienced operator until clear understanding of the operating procedures is demonstrated.  Refresher training is conducted annually as part of the City of Toledo Water Division Water Treatment Plant's ongoing safety training effort.\r\n\r\n3.5  Mechanical Integrity\r\nThe City of Toledo Water Division Water Treatment Plant maintains the mechanical integrity of Chlorination Process equipment to help prevent failures that could endanger workers, the public, or the environment.  The City of Toledo Water Division Water Treatment Plant mechanical integrity program includes:\r\n* an inspection and testing program to help identify equipment deterioration and damage before the equipment fails,\r\n* a quality assurance program to help ensure that the new and replacement equipment meet the design standards required for service in our process,\r\n* procedures for safe work practices such as lockout/tagout, hot work, confined space entry and line or equipment opening,\r\n* training of maintenance personnel, and\r\n* documentation of maintenance activities.\r\n\r\n3.6  Management of Change\r\nThe City of Toledo Water Division Water Treatment Plant has a comprehensive program to manage changes to processes.  Under this program, all proposed changes to chemicals, equipment, and procedures for the Chlorination Process must be evaluated and approved to help ensure the change does not negatively affect safe operations.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, and procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided with any nec"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050398,
      "SummaryText": "ation from operating limits,\r\n* safety systems,\r\n* applicable design codes and standards,\r\n* process chemistry, and\r\n* design basis for relief and ventilation systems.\r\nMany of the operating parameters are included in the operating procedures to aid in the safe and proper operation of the process.  These documents are used to:\r\n* train employees,\r\n* perform Process Hazard Analyses (PHAs), and\r\n* maintain the equipment.\r\nAll the above mentioned information, in combination with written procedures and trained personnel, provide a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the Chlorination Process are not compromised.\r\n\r\n3.2  Process Hazard Analysis\r\nThe City of Toledo Water Division Water Treatment Plant performed and will periodically update process hazard analyses (PHAs) of the Chlorination Process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  Within this program, the Chlorination Process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\nTo perform the PHAs, City of Toledo Water Division Water Treatment Plant primarily uses the What-if/Checklist technique.  The PHAs are conducted using a team of people with experience in engineering and Chlorination Process operation & maintenance and a leader with experience in process hazard analysis techniques. This team identifies and evaluates hazards of the process as well as accident prevention and/or mitigation measures, when appropriate.  The team then prepares a written report describing the results of the analysis, including a list of recommendations ranked according to relative risk ratings assigned by the team.  Responsibility to resolve the recommendations is assigned to the appropriate team members and is tracked through completion.  The final resolution of each f"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050398,
      "SummaryText": "City of Toledo Water Division\r\nRisk Management Program\r\nExecutive Summary\r\n\r\n1.0  Accidental Release Prevention and Response Policies\r\nThe City of Toledo Water Division has a long-standing commitment to operating our facilities in a manner that is safe for our employees, the public, and the environment.  A primary aspect of this commitment is the implementation of a Prevention Program to help ensure the safe operation of the water chlorination process.  Our commitment is demonstrated by the resources invested in accident prevention, such as considering safety in the design, installation, operation and maintenance of our process, as well as extensive training of our operating personnel. \r\nIn the event of an accidental release, the City of Toledo Water Division uses industry recommended procedures and equipment designed to contain and neutralize the release on site in a manner that will be safe for our employees.  Personnel receive thorough training in emergency response procedures. Emergency planning is coordinated with the Lucas County Local Emergency Planning Committee (LEPC) and Fire Department.\r\nIn order to effectively implement these policies, the City of Toledo Water Division established a management system to ensure the proper implementation and effectiveness of our Risk Management Program.\r\n\r\n2.0  City of Toledo Water Division Water Treatment Plant and Regulated Substances\r\nThe City of Toledo Water Division Water Treatment Plant handles one substance regulated by the OSHA Process Safety Management Standard and the EPA Risk Management Program Rule (RMP Rule) in quantities above the Threshold Quantity. Chlorine is used for the disinfection of water for consumption by the public. The chlorine is stored and handled using safety procedures in accordance with industry standards and compliant with the OSHA Process Safety Management Standard and the EPA Risk Management Program Rule (RMP Rule).\r\n\r\n3.0  Accidental Release Prevention Program - Program 3\r\nThe City of Tol"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000050398,
      "SummaryText": "mptly investigates all incidents that resulted in, or reasonably could have resulted in a toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\r\n\r\n3.10  Employee Participation\r\nThe City of Toledo Water Division Water Treatment Plant developed a written employee participation program for the Chlorination Process and other aspects of our operations to ensure that the safety concerns are addressed.  The City of Toledo Water Division Water Treatment Plant encourages the active participation of our employees in the Prevention Program for all processes and tasks at our facility.  Employees are consulted on and informed of all aspects of the City of Toledo Water Division Water Treatment Plant Risk Management Plan (RMP) and participate on PHA and Compliance Audit teams.\r\n\r\n3.11  Hot Work Permits\r\nThe City of Toledo Water Division Water Treatment Plant established a Safe Work Permit program to control spark or flame producing activities that could result in fires or explosions in the processes at our facility.  The City of Toledo Water Division Water Treatment Plant utilizes a Safe Work Permit form designed after the OSHA fire prevention and protection requirements found in 29 CFR 1910.252(a).  Personnel who are to perform the Hot Work are required to complete the form which is reviewed by the area supervisor.  The form must be approved before work can proceed.  Training in the use of the Safe Work Permit form is provided to all affected personnel.\r\n\r\n3.12  Contractors\r\nThe City of Toledo Water Division Water Treatment Plant established a program to help ensure that contractors who are used to supplement the workforce during periods of increased maintenance or construc"
    }
  ]
}