{
  "FacilityID": 1000093066,
  "FacilityName": "Desert Star Energy Center",
  "FacilityStr1": "701 Eldorado Valley Drive",
  "FacilityStr2": null,
  "FacilityCity": "Boulder City",
  "FacilityState": "NV",
  "FacilityZipCode": "89005",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32003",
  "LEPC": "Boulder City Fire Department",
  "FacilityLatDecDegs": "35.788250",
  "FacilityLongDecDegs": "-114.994583",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 90012373,
  "ParentCompanyName": "San Diego Gas and Electric",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "San Diego Gas and Electric",
  "OperatorStr1": "8326 Century Park Court",
  "OperatorStr2": null,
  "OperatorCity": "San Diego",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92123",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kevin Lampman",
  "RMPTitle": "Plant Manager",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168711",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "A00652",
  "SafetyInspectionDate": "2021-01-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-03-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.78672,
  "FRS_Long": -114.99283,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115495,
      "AltID": "Aqueous Ammonia System",
      "FacilityID": 1000093066,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000116948,
          "ProcessID": 1000115495,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144417,
          "ProcessID": 1000115495,
          "ChemicalID": 57,
          "Quantity": 112800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644417,
          "ProcessID": 1000115495,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093066,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThe Desert Star Energy Center, previously called the El Dorado Energy, LLC. Power Plant (facility), is located approximately 15 miles southwest of Boulder City, Nevada. This Risk Management Plan (RMP) was originally submitted to the Administering Agency, the Nevada Department of Environmental Protection (NDEP), in September 1999. The most recent RMP update for the facility occurred on April 1, 2016. This revision and update is for a 5-year update, as required by 40 Code of Federal Regulations (CFR) 68.190(b)(1). A log of revisions is provided in Section 3 of this RMP.\n\n\n\nThe federal RMP regulations require periodic updating of the RMP program information, but do not require that the entire plan be recreated in its entirety. In fact, the RMP regulations require that many of the program documents be retained for the life of the plan. The RMP is expected to change and evolve as the facility changes, as new information on chemical hazards is developed, as the affected system is modified, and as the surrounding community changes. In some instances, new program elements supersede previous versions; in other cases, the new program element supplements the previous version. To ease the administrative burden for the facility, the previous version of the RMP is incorporated by reference into this RMP update.\n\n\n\nPursuant to the regulations outlined in the Nevada Administrative Code (NAC) Chapter 459.9542, the Clean Air Act Section 112(r), and 40 CFR 68, this RMP has been prepared and submitted by the Desert Star Energy Center. In Nevada, the Risk Management Program is implemented under the Chemical Accident Prevention Program (CAPP) of the NDEP Bureau of Waste Management (BWM).\n\nThe aqueous ammonia storage and handling process at the Desert Star Energy Center was identified as the only process that triggers the RMP/CAPP requirements. This process is covered under the federal RMP Program 2 and CAPP Tier B,  Program Level I requirements, based on the storage "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093066,
      "SummaryText": "of 15,000 gallons of aqueous ammonia with an ammonia concentration of 28 percent by weight. There have been no changes to the facility or regulated process since the date  of the last RMP submittal in 2016 that would affect the RMP program level for this facility.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe Desert Star Energy Center has a long-standing commitment to worker and public safety and is committed to operating and maintaining all of its processes in a safe and responsible manner. To help ensure the safety of its employees and the public, as well as to protect the environment, the Desert Star Energy Center has implemented a combination of accidental release prevention and emergency action planning programs. The objective is to minimize the risk of a release of a hazardous material and, if a release occurs, to minimize the potential impact to employees, the public, and the environment. The Desert Star Energy Center management is committed to providing appropriate training to employees and coordinating emergency action activities, as necessary, with the local emergency response providers to ensure a safe operation.\n\n\n\nSTATIONARY SOURCE DESCRIPTION\n\n\n\nThere have been no significant changes to the facility since the original RMP was developed in 1999. The facility is an electric generating station consisting of one 160 megawatt (MW) steam turbine and two 160 MW combustion turbine generators capable of generating 480 MW of electricity. The two 160 MW turbines burn pipeline quality sweet dry natural gas exclusively and are equipped with Selective Catalytic Reduction (SCR) systems for the control of nitrogen oxide (NOx) emissions. The SCRs employ ammonia injection technology that reduces NOx to the targeted level of 3.5 parts per million by volume (ppmv) at 15 percent oxygen (O2). The ammonia source for the SCRs is aqueous ammonia with an ammonia concentration of 28 percent by weight.\n\n\n\nREGULATED SUBSTANCES HANDLED\n\n\n\nThere have been n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093066,
      "SummaryText": "o significant changes to the ammonia storage and handling system since the development of the original RMP.\n\n\n\nThe ammonia storage and handling system at the facility is comprised of a single storage tank, pumps, piping, and two (2) ammonia flow control unit skids (AFCU) (one for each SCR). Each AFCU consists of filters, a flow regulator, and two (2) blowers with a generator that deliver the vaporized ammonia stream to the SCRs.\n\n\n\nThe tank is a horizontally-oriented cylindrical tank, rounded on each end. The tank is constructed of carbon steel, which is compatible with aqueous ammonia. The tank has a total capacity of 16,466.5 gallons and is equipped with pressure relief valves, a flame arrestor, and temperature, pressure, and level indicators. The maximum capacity of the tank is administratively limited to 15,000 gallons.\n\nThe tank is installed within a concrete secondary containment structure. The containment structure has a surface area of 1,123.5 square feet (53.5 feet by 21 feet) and a wall height of 3.5 feet. The total containment capacity is  29,413 gallons. The piping from the tank to the vaporizer is also carbon steel with a diameter of 1 to 2 inches, depending on the service.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe facility has onsite spill prevention and control procedures, including daily visual inspections and planned maintenance activities, which help to reduce the potential for hazardous material releases to the soil or surface waters. The following provides a summary of the Accidental Release Prevention Prog ram.\n\n\n\nDISCHARGE DETECTION BY PERSONNEL\n\n\n\nThe facility operators perform a visual inspection of the facility during each shift. During the inspection, deficiencies are noted on a checklist and corrections are initiated either immediately or through generation of a work request, depending on the nature of the problem. Records of the inspection checklist are kept in the Control Building.\n\n\n\nAMMONIA "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093066,
      "SummaryText": "AUTOMATIC DETECTION\n\n\n\nAutomatic ammonia vapor electronic warning sensors are installed on the ammonia storage tank and skids. All sensors are connected to the Control Room. If ammonia fumes are detected, an alarm will annunciate. Should an alarm be triggered, the procedures outlined in the Desert Star Energy Center Policies and Procedures Manual (PPM) Section 8.02 - Emergency Action Plan, Subsection 4.e, Hazardous Material Release, will be initiated, as appropriate.\n\n\n\nThe Control Room Operator and appropriate management personnel shall be notified of the release. Management will evaluate the incident and proceed with appropriate actions, which may include implementing the facility's contingency plan and/or calling for a plant evacuation. Once an initial assessment is made, the appropriate action of either shutting down the piece of equipment or initiating a clean-up of discharged material should be performed. Based on this assessment, minor releases within the facility will be immediately contained and cleaned with either absorbent material or rags or additional clean-up personnel and equipment may be dispatched to the site and deployed to control and contain the spill. Clean-up equipment and material will be used in the manner most effective for rapid and complete clean-up of all spilled product. Spill clean-up material is located throughout the facility for this purpose. \n\n\n\nAMMONIA LOADING/UNLOADING PROCEDURES\n\n\n\nIn order to assist in the prevention of an accidental release of ammonia, the Desert Star Energy Center implements a standard operating procedure (SOP) for ammonia loading and unloading. The ammonia loading/ unloading procedures are incorporated into this RMP by reference and are provided in PPM Section 11.38 - Ammonia Load-Unload Procedures. \n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidents involving the release of aqueous ammonia in the past five years or since the original RMP was developed in 1999.\n\n\n\nEMERGENCY ACTION PROGRAM\n\n\n\nThere "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093066,
      "SummaryText": "have been no significant changes to Desert Star Energy Center's Emergency Action Program since the RMP was originally developed in 1999 other than updates to emergency contact information. The Emergency Action Plan was last updated in April 2020. Based on the facility's accident history, no other changes are recommended at this time.\n\n\n\nPer NAC 459.95418(3), emergency action training is required to be given at least once every three years, and more often if it is determined to be necessary after consultation with the employees who operate the aqueous ammonia system, to ensure that the employees understand and adhere to the current operating procedures of the process. At this time, ammonia awareness and Emergency Action Program trainings are given annually. The date of the last Emergency Action Program refresher training was December 8, 2020, and included an emergency action drill meeting the notification exercise requirements of 40 CFR 68.96(a). The date of the last ammonia awareness refresher training was October 20 and October 22, 2020.\n\n\n\nDesert Star Energy Center's Emergency Action Program includes the following core elements:\n\n\n\n - Specific actions to be taken in response to an accidental release of aqueous ammonia, which is to follow the procedures outlined in PPM Section 8.02 - Emergency Action Plan, Subsection 4.e, Hazardous \n\n   Material Release, and the evacuation of all personnel upwind of the ammonia vapor in accordance with PPM Section 8.02 - Emergency Action Plan, Subsection 4.g, Plant Evacuation.\n\n - Procedures to notify the public and local emergency response agencies, including the Boulder City Fire Department, as necessary.\n\n - Information on emergency health care.\n\n - Information regarding the emergency action training of employees.\n\n - A list of the other federal and state emergency response requirements to which this facility is subject.\n\n\n\nDesert Star Energy Center staff are not trained to respond to emergencies involving a release of aqueous a"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000093066,
      "SummaryText": "mmonia. Therefore, the facility's Emergency Action Plan is coordinated with the Boulder City Fire Department (702-293-9228). The last inspection by the Boulder City Fire Department was conducted on January 11, 2021. During these inspections, the Boulder City Fire Department is provided with a copy of the facility's updated Emergency Action Plan and any other information necessary to coordinate emergency response in accordance with 40 CFR 68.93. A copy of the plan is incorporated by reference to this RMP update and is provided in PPM Section 8.02 - Emergency Action Plan.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nSince there have been no accidents involving the release of aqueous ammonia in the past five years or since the original RMP was developed in 1999, no additional changes are planned to improve safety other than what is currently performed.\n\n \n\n"
    }
  ]
}