{
  "FacilityID": 1000093846,
  "FacilityName": "Ennis Power Company, LLC",
  "FacilityStr1": "4001 West Ennis Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Ennis",
  "FacilityState": "TX",
  "FacilityZipCode": "75119",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48139",
  "LEPC": "Ellis LEPC",
  "FacilityLatDecDegs": "32.320700",
  "FacilityLongDecDegs": "-096.678500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "FC",
  "FacilityURL": "https://www.vistracorp.com/",
  "FacilityEmailAddress": "media.relations@vistracorp.com",
  "FacilityDUNS": 185542268,
  "ParentCompanyName": "Vistra Corp.",
  "Company2Name": null,
  "CompanyDUNS": 80457910,
  "Company2DUNS": 0,
  "OperatorName": "Ennis Power Company, LLC",
  "OperatorStr1": "4001 West Ennis Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Ennis",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75119",
  "OperatorZipCodeExt": null,
  "RMPContact": "Neal Coffey",
  "RMPTitle": "Plant Manager",
  "FTE": 17,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177202",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2149",
  "SafetyInspectionDate": "2010-12-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-05-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-05-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-05-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-05-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.32025,
  "FRS_Long": -96.67392,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116434,
      "AltID": "Ammonia",
      "FacilityID": 1000093846,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117850,
          "ProcessID": 1000116434,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145580,
          "ProcessID": 1000116434,
          "ChemicalID": 57,
          "Quantity": 127177.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000645580,
          "ProcessID": 1000116434,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093846,
      "SummaryText": "Ennis Power Company, LLC operates a 320-megawatt (MW) electrical generation facility in Ennis, Ellis County, Texas.  The facility began commercial operation in May 2002.  The land use immediately surrounding the facility is rural.\n\n\n\nThe facility combusts natural gas in one combustion turbine to generate electricity.  The combustion turbine is equipped with a heat recovery steam generator (HRSG) that utilizes waste heat from the exhaust to convert water to steam.  The steam from the HRSG is utilized to drive a steam turbine.  Electricity is generated at the gas turbine and the steam turbine.  A selective catalytic reduction (SCR) system is located within the HRSG to reduce nitrogen oxide (NOx) emissions from the combustion turbine exhaust gas.  The SCR consists of a catalyst and injection grid within the HRSG. Ammonia is injected through the grid upstream of the catalyst.  The ammonia mixes with the exhaust gas, and as the exhaust/ammonia mixture passes through the catalyst, NOx emissions are reduced to nitrogen and water.\n\n\n\nThere is one covered process at the facility containing a toxic chemical. \n\n\n\nThe regulations require the development, implementation and documentation of written programs and procedures to reduce the risk of accidental release of aqueous ammonia.  The elements of the facility's RMP program include:\n\n1. A prevention program, which covers safety precautions, monitoring, standard operating procedures, employee training, preventative maintenance, maintaining specific process safety information, incident    investigations, hazard reviews, and compliance audits;\n\n2. An emergency response program, which spells out emergency health care, employee training measures and procedures for informing the public and response agencies (e.g, LEPC or fire department) should an accident occur; and \n\n3. Hazard assessments that detail an accident history of the last five years, the potential effects of an accidental release, and an evaluation of worst-case and alter"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093846,
      "SummaryText": "native accidental release scenarios.\n\n\n\nThe Plant Manager, has overall responsibility for maintaining the Risk Management Program.  Responsibilities for specific program elements are shared among the Plant Manager, the Production Support Manager, and the Operator Technicians.\n\n\n\nSafety information is maintained onsite at the facility.  To date, no modifications to the safety information have been made.  Standard operating procedures have been implemented at the facility and address the operating conditions of the aqueous ammonia system. A preventative maintenance program is in place and consists of maintenance procedures and testing and inspection schedules.  Hot work procedures, along with other hazard permits (general work permit, lockout/tagout, etc.), exist at the facility and are applicable to work conducted onsite.  Contractors working on the ammonia system or other equipment/systems are required to comply with the facility's contractor safety program. \n\n\n\nPlant personnel must complete initial and refresher training on procedures applicable to their position.  Operators undergo a qualification process that addresses the aqueous ammonia system standard operating procedures and preventative maintenance procedures as well as emergency response training.\n\n\n\nEmployee participation is a key to safe operation of the facility.  Employees are included in hazard reviews and incident investigations.  In addition, employees hold safety meetings and participate in periodic emergency response drills.\n\n\n\nThe initial Hazard Review was conducted before plant startup and was updated in 2006, 2011, 2016, and again in May 2021.  The Hazard Review identified the hazards associated with the process, opportunities for equipment malfunctions or human errors that could cause an accidental release, safeguards used or needed to control the hazards or prevent equipment malfunctions or human error, and steps used or needed to detect or monitor releases.  \n\n\n\nThe facility has been operatin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093846,
      "SummaryText": "g for approximately twenty (20) years.  There has been one (1) incident which was reported and investigated in 2011, but no offsite impacts occurred. The incident report has been filed under the Incident Investigation and Reporting tab.\n\n\n\nAn emergency response program has been implemented at the facility.  The emergency response program includes an emergency response plan and coordination of emergency information and activities with the City of Ennis Fire Department.  The emergency response plan contains the information and procedures necessary to respond to a release of aqueous ammonia. Emergency information includes a list of emergency response personnel, notification requirements, evacuation procedures, and health/first aid data.  A copy of the emergency response program has been provided to the City of Ennis Fire Department.  Officials from the City of Ennis Fire Department have toured the facility to familiarize its personnel with plant operations and the locations of potential hazards.  In addition, facility personnel are trained in the procedures necessary to respond to emergency releases."
    }
  ]
}