{
  "FacilityID": 1000095951,
  "FacilityName": "Johnson Space Center White Sands Test Facility",
  "FacilityStr1": "14 mi E and 6 mi N of Las Cruces",
  "FacilityStr2": "Off Highway 70",
  "FacilityCity": "Las Cruces",
  "FacilityState": "NM",
  "FacilityZipCode": "88012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35013",
  "LEPC": "Dona Ana LEPC",
  "FacilityLatDecDegs": "32.483965",
  "FacilityLongDecDegs": "-106.613895",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.nasa.gov/centers/wstf/home/index.html",
  "FacilityEmailAddress": "robert.m.cort@nasa.gov",
  "FacilityDUNS": 194555207,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "NASA JSC White Sands Test Facility",
  "OperatorStr1": "Post Office Box 20",
  "OperatorStr2": null,
  "OperatorCity": "Las Cruces",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "88004",
  "OperatorZipCodeExt": "0020",
  "FTE": 620,
  "OtherEPAFacilityID": "NM8800019434",
  "EPAFacilityID": "100000137871",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-05-18 00:00:00",
  "SafetyInspectionBy": "Voluntary Protection Program",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-09-08 19:54:28",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-09-08 19:54:28",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-09-08 19:54:28",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-09-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 32.483965,
  "FRS_Long": -106.613895,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000118980,
      "AltID": "500 Area MMH Storage",
      "FacilityID": 1000095951,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000148749,
          "ProcessID": 1000118980,
          "ChemicalID": 3,
          "Quantity": 55005.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000120333,
          "ProcessID": 1000118980,
          "NAICSCode": "92711",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000102004,
              "Process_NAICS_ID": 1000120333,
              "SafetyReviewDate": "2019-07-25 00:00:00",
              "PHA_Date": "2019-07-25 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "NASA Specific Method",
              "PHACompletionDate": "2019-07-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Overheating, Flying Debris, Lightning, Freezing, Personnel Exposure to High Heat, Personnel Falling from Ladders, Exothermic Reaction",
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Procedures",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Remote Impounding Tanks",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable MMH Chemical Vapor Detectors",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-08-21 00:00:00",
              "TrainingReviewDate": "2021-01-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Often a combination of the Classroom and On-the-Job training depending upon the Qualification Area.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-07-08 00:00:00",
              "EquipmentInspectionDate": "2020-07-08 00:00:00",
              "EquipmentTested": "Area Inspection for Leaks Including Inspection of Drums/DOT 4BWs",
              "ChangeMgmtDate": "2019-07-11 00:00:00",
              "ChangeMgmtReviewDate": "2019-07-11 00:00:00",
              "PreStartupReviewDate": "2020-04-13 00:00:00",
              "ComplianceAuditDate": "2020-06-01 00:00:00",
              "AuditCompletionDate": "2020-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-01-14 00:00:00",
              "HotWorkPermitReviewDate": "2021-01-14 00:00:00",
              "ContractorSafetyReviewDate": "2021-01-14 00:00:00",
              "ContractorSafetyEvalDate": "2021-01-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000128048,
                  "PreventionProgram3ID": 1000102004,
                  "ProcessChemicalID": 1000148749
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000095951,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-10-25 00:00:00",
    "ERTrainingDate": "2021-08-10 00:00:00",
    "CoordinatingAgencyName": "Dona Ana County/Las Cruces LEPC",
    "CoordinatingAgencyPhone": "5755260795",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000095951,
      "SummaryText": "1.0\tIntroduction\r\nThis document summarizes an updated Risk Management Plan (RMP) for the NASA White Sands Test Facility (WSTF). NASA stores, handles, and uses monomethyl hydrazine (MMH) in excess of the 15,000-pounds (lbs) threshold quantity identified in 40 CFR § 68.3. A previous RMP revision was submitted on September 8, 2016, and in accordance with 40 CFR § 68.190(b)(1), NASA is required to submit an updated RMP at least once every five years from the date of its initial submission or most recent update to the Environmental Protection Agency (EPA). Since the 2016 RMP submission, WSTF continued modifying covered processes to improve the safety of personnel by removing large quantities of propellant storage from the WSTF test areas. This resulted in the elimination of an RMP covered process in the 400 Area (2016 NASA WSTF RMP Process ID # 1000051778). This 2021 NASA WSTF RMP update includes a revised Process Hazard Analysis (PHA) for the remaining covered process in the WSTF 500 Area Propellant Storage and Distribution location (2016 NASA WSTF RMP Process ID # 1000051779) and a revised hazard assessment with off-site consequence analyses for worst-case and alternative release scenarios. This document supplements the information provided in the required RMP electronic submission though the EPA's RMP*eSubmit application. An electronic copy of the EPA RMP submittal and certification page is provided in Appendix A.\r\n\r\n2.0\tAccidental Release Prevention \r\nNASA is committed to providing a safe place of employment by meeting or exceeding applicable health and safety requirements to assure personnel, community, and environmental safety and preservation of resources at WSTF. The WSTF Safety Program is described in WSTF Manual (WM)-SAF-0001, Chapter 1 General Safety & Health Program that is incorporated into the WSTF Integrated Management System (WIMS). The Safety Program emphasizes the concept that safety is the individual and personal responsibility of everyone at WSTF. Thi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000095951,
      "SummaryText": "s safety concept is reinforced by WSTF's Star status in the Occupational Safety and Health Administration (OSHA) Voluntary Protection Program (VPP). Embedded within the WIMS processes, procedures, and instructions are key safety controls to properly contain and maintain the hazardous substances used and stored at WSTF. The application of controls follows NASA's risk reduction hierarchy of controls. Embedded within the WIMS are emergency protocols to be followed in the event of an accidental release of a hazardous substance. WSTF's International Organization for Standardization (ISO) 9001 registered management system also establishes a strong basis for conformance to NASA policies and procedures and compliance with applicable federal, state, and local regulations.\r\n\r\nNASA's efforts to prevent accidental releases at WSTF begin with sound engineering practices that incorporate lessons learned from past experiences. NASA has been conducting research and hazardous rocket engine testing with liquid propellants at WSTF since the early 1960s. This research and associated test experience over the past decades not only helped define hypergolic propellant hazards at WSTF, but also for the entire aerospace industry. NASA understands that awareness of hazards is the first step in being able to design, build, operate, and maintain safe, reliable systems. These safely designed, built, and maintained systems are key to preventing accidental releases during testing and operational activities. \r\n\r\n2.1\tAccidental Release Prevention Controls\r\nPrimary engineering controls focus on the safe design, build up, and operation of systems. Secondary controls, also embedded within the WIMS, include administrative controls such as the use of safety, caution, and warning devices; training; and personal protective equipment. Each type of control has one or more management system documents dedicated to its implementation. These controls are integral to Process Safety Management instructions (WM-SAF"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000095951,
      "SummaryText": "-0002, Chapter 3 Process Safety Management of Highly Hazardous Chemicals) at WSTF, which are based on 29 CFR § 1910.119, Process Safety Management of Highly Hazardous Chemicals and includes each of the Process Safety Management elements.\r\n\r\nThe Pressure Systems Program at WSTF establishes, implements, and verifies mechanical integrity of testing equipment and hazardous chemical storage vessels. The design standards under this program are based on the American Society of Mechanical Engineers (ASME) code and other relevant national consensus standards. The WSTF Emergency Preparedness Plan (WSTF Standard Procedure [WSP] 25-0009) provides directions for activities which: eliminate or reduce the probability of disaster; prepare measures which protect life, the environment, and property; respond appropriately during emergencies; and establish a recovery system returning the facility to normal or improved operation following an emergency. WSTF also has chartered an Emergency Preparedness Planning Board which has the responsibility to continuously review the plan and assure its effective maintenance.\r\n\r\n3.0\tStationary Source and Regulated Substances Handled \r\nSeveral hazardous chemicals are used at WSTF during rocket engine testing and research activities, but only the hypergolic propellant MMH is stored, handled, or used in a quantity above the Risk Management Program rule threshold for regulated toxic substances of 15,000 lbs. This propellant is used in several NASA, Department of Defense, and commercial aerospace propulsion subsystems. MMH storage containers (tanks, drums, cylinders, etc.) are present in the 300, 400, and 500 Areas and are stored at ambient temperature and pressures up to 60-80 pounds per square inch in gauge. Dump tanks were historically used to receive propellant from run tanks not consumed during an engine test or as an emergency dump location as needed. Propellants in dump tanks were typically transferred back to run tanks or to longer-term storage t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000095951,
      "SummaryText": "anks, but could be stored in the dump tanks, if necessary. Run tanks are present at the points of use (test stands) and are used to store propellant for immediate use in engine testing. Propellants contained in run tanks can be saturated with helium up to 600 pounds per square inch absolute and temperature conditioned between 40 and 120 °F. Propellants can be pressure transferred between storage, run, dump tanks, and the planned Reserve Tank Systems (RTSs) discussed in Section 8.0.\r\n\r\nIn the 2014 and 2016 WSTF RMP submittals, NASA indicated propellant storage and distribution systems would be removed from the 300 and 400 Areas, with the bulk of MMH storage transferred to the 500 Area Propellant Storage and Distribution location. In the 2016 RMP update, NASA highlighted the completion of this process in the 300 Area and reconfirmed its commitment to lower MMH storage capacity in the WSTF 400 Area. The Ready Storage Units (RSUs) were removed from the 400 Area and maximum intended inventory was reduced in the 400 Area to 1,900 gallons (gal; 13,794 lbs using the density of MMH unit 7.26 lbs/gal). This volume reduction reflects a change in NASA's testing and propellant management philosophy at WSTF, which includes relocating large quantities of propellant out of the 300 and 400 Areas to the dedicated propellant storage area in the WSTF 500 Area Propellant Storage and Distribution location. Smaller transport containers now provide the quantity of propellant required for propulsion testing.\r\n\r\nThe Process Hazard Analysis for Propulsion Test Areas General Hazards (Including Highly Hazardous Chemicals) (PTO-GEN-BSL-HAZA-008-PHA.E) identifies a maximum intended inventory of 1,900 gal (13,794 lbs) of MMH for the WSTF 300 Area and 400 Areas, which is below the 15,000 lbs threshold quantity for MMH. Instructions for monitoring and controlling propellant volumes are provided in the administrative WSTF Job Instruction (WJI) titled Propellant and Propane Accountability (WJI-PROP-GE"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000095951,
      "SummaryText": "N-0002.J). The instructions describe the required proper tank labeling and process for reading liquid level indicators, which prevents the exceedance of the regulated threshold level for MMH.\r\n\r\nThis RMP summarizes the one remaining process in the WSTF 500 Area Propellant Storage and Distribution location that meets the definition of a covered process in which MMH is stored in a quantity above the regulated threshold of 15,000 lbs (~2,066 gal). The 500 Area Propellant Storage and Distribution location is used for long-term storage of MMH in drums or 4BW cylinders that meet Department of Transportation specification requirements (49 CFR § 178.61). The storage area is fenced separately, and access is controlled by lock and key. The Maximum Intended Inventory for MMH in the 500 Area Propellant Storage and Distribution location is 123,424 lbs (17,000 gal). This can include mixtures of fuels that contain non-regulated substances such as hydrazine and Aerozine-50 (50/50 mixture of hydrazine and unsymmetrical dimethylhydrazine [UDMH]). The Maximum Intended Inventory of the largest vessel (tank) of MMH in the WSTF 500 Area Propellant Storage and Distribution location is 23,959 lbs (3,300 gal).\r\n\r\n4.0\tGeneral Accidental Release Prevention Program and Chemical-Specific Prevention\r\n4.1\tWSTF Accidental Release Program \r\nNASA is strongly committed to safely conducting operations involving toxic and flammable substances, identifying and controlling to the greatest extent possible any hazards associated with these substances, and reducing any subsequent risk to the surrounding community and the environment at WSTF. This commitment is inherent to the WSTF comprehensive accidental release prevention program that covers areas of design, installation, operations, maintenance, and employee training associated with the RMP covered processes. The one RMP covered process identified in the Stationary Source and Regulated Substances section, contains a \"highly hazardous chemical\" above the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000095951,
      "SummaryText": "threshold quantities listed in 29 CFR § 1910.119, Process Safety Management of Highly Hazardous Chemicals (PSM). Because MMH is a highly hazardous chemical listed in the PSM, this RMP works in conjunction with PSM program requirements to increase communication and reduce risk associated with MMH storage and use at WSTF. Safety depends upon the way NASA handles these products combined with the safety devices inherent in the design of this WSTF facilities. Thoroughly reviewed operating and maintenance procedures, safe work practices, and training of WSTF personnel supplement the inherent safe design of the MMH distribution systems.\r\n\r\nNASA has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR § 68, Chemical Accident Provisions at WSTF. Facility personnel have conducted a comprehensive review of all RMP covered processes, as well as a review of administrative, operating, and maintenance procedures, in addition to the other required program elements of the RMP Rule. NASA implemented the elements of the 40 CFR § 68 Subpart D Program 3 Prevention Program for the RMP covered process at WSTF, which include:\r\n¿\t§ 68.65 Process safety information\r\n¿\t§ 68.67 Process hazard analysis\r\n¿\t§ 68.69 Operating procedures\r\n¿\t§ 68.71 Training\r\n¿\t§ 68.73 Mechanical integrity\r\n¿\t§ 68.75 Management of change\r\n¿\t§ 68.77 Pre-startup review\r\n¿\t§ 68.79 Compliance audits\r\n¿\t§ 68.81 Incident investigation\r\n¿\t§ 68.83 Employee participation\r\n¿\t§ 68.85 Hot work permit\r\n¿\t§ 68.87 Contractors\r\nThe following sections briefly describe the elements of the release prevention program that is in place at WSTF.\r\n\r\n4.1.1\tProcess Safety Information\r\nDetailed engineering drawings of the MMH distribution systems, chemical safety, operating parameters, and equipment safety information is compiled and readily available to operators and personnel involved in the operation and maintenance of the MMH distribution systems. The following information is compile"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000095951,
      "SummaryText": "d for the RMP covered process:\r\n¿\tHazards Information for MMH used in the RMP covered process in the WSTF 500 Area Propellant Storage and Distribution location.\r\n¿\tTechnology Information (process chemistry, maximum intended inventory, safe upper and lower limits for operating parameters, and an evaluation of the consequences of deviation).\r\n¿\tEquipment Information (materials of construction, electrical classification, relief system design and design basis, ventilation system design, design codes and standards, material and energy balances, and safety systems).\r\nThis Process Safety Information enables WSTF to perform a Process Hazard Analysis for each RMP covered process.\r\n\r\n4.1.2\tProcess Hazard Analysis\r\nNASA conducts comprehensive studies to ensure hazards associated with the processes are identified and controlled efficiently at WSTF. The methodology used to carry out these analyses uses a What-If/Checklist to determine and evaluate the hazards of the process being analyzed (other appropriate hazard analysis methodologies may be used for subsystems). The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at least every five years after the initial analysis. Any findings related to the hazard analysis are addressed with all due speed, considering the complexity of the recommendation and the difficulty of implementation.\r\n\r\nThe Process Hazard Analysis for Propulsion Test Area General Hazards (Including Highly Hazardous Chemicals) (PTO-GEN-BSL-HAZA-008-PHA) includes the RMP covered process in the WSTF 500 Area Propellant Storage and Distribution location. This PHA was conducted in accordance with WSTF Standard Instruction (WSI) 04-SW-0002, Hazard Analysis and WM-SAF-0002, Chapter 3 Process Safety Management of Highly Hazardous Chemicals. The PHA addresses:\r\n¿\tHazards of the processes.\r\n¿\tIdentification of any previous incidents with relevance to the process which had a likely potential for"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000095951,
      "SummaryText": "catastrophic consequences.\r\n¿\tEngineering and administrative controls applicable to the hazards.\r\n¿\tConsequences of failure of the engineering or administrative controls.\r\n¿\tFacility siting and hazardous area restrictions.\r\n¿\tHuman factors, such as ergonomics, fatigue, visibility.\r\n¿\tQualitative evaluations of potential health and safety effects.\r\nPHA recommendations and residual risks are addressed in accordance with WM-PM-0001, Chapter 8 Design Review and Control; WSI 04-SW-0003, System Safety Analysis; and the WIMS Safety and Readiness Review Infrastructure Process. WSTF maintains the original analysis and resolution of recommendations for the life of the process.\r\n\r\n4.1.3\tOperating Procedures\r\nFor the purposes of safely conducting activities within the RMP covered process, NASA maintains written operating procedures for WSTF in the WIMS. Due to the nature of WSTF's operations, typically with a more short-term testing focus than long-term process focus, WSTF prepares specific testing operating procedures that utilize the RMP covered process. These test procedures are reviewed and approved by qualified NASA project managers and contractor project leaders prior to any testing operations. Test procedures no longer applicable are cancelled. NASA also performs some longer-term testing that utilizes the RMP covered process. In these cases, procedures are reviewed annually until the testing requirements are cancelled. In addition to specific testing procedures, NASA also maintains Test Area procedures that address area emergency response, propellant accountability, and facility setup and shutdown sheets. These Test Area procedures are readily accessible to employees who work in or maintain the process. The operating procedures may be reviewed more frequently to reflect current operating practices resulting from changes in process chemicals, technology, equipment, and facilities. These procedures provide clear instruction for safely conducting activities that utilize the"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000095951,
      "SummaryText": "RMP covered process and are consistent with the Process Safety Information and the Process Hazards Analysis.\r\nIn addition to test specific procedures, NASA's framework for its accidental release prevention program at WSTF includes:\r\n¿\tTraining of employees, from new hire status through in-depth system training, is accomplished and tracked in the System for Administration, Training, and Educational Resources for NASA (SATERN) Database.\r\n¿\tSystem safety is accomplished in the design stages of programs through design review, system safety analyses, operational readiness inspections, and test readiness reviews. Integral to these reviews are the presentation of Failure Modes and Effects Analyses and PHAs. Changes to existing systems or processes require review and approval by appropriate personnel to ensure continued safe operations.\r\n¿\tProcess control is accomplished in the buildup and test phases of projects through step-by-step work instructions that are reviewed and authorized by project leaders and project managers. Emergency procedures are embedded within any instruction involving the use or handling of hazardous chemicals. WSTF pressure systems engineers approve appropriate standards of system construction, such as ASME pressure and piping codes for fluid systems.\r\nThese elements are described in greater detail in the following paragraphs.\r\n\r\n4.1.4\tTraining\r\nPersonnel whose job tasks are related to the operation and maintenance of MMH systems are provided training on safe operation of those systems and safe use of the highly hazardous chemicals. Employees may be involved through self-managed learning (e.g., Hazard Communication training offered through SATERN), coaching and mentoring new employees, presenting training as subject matter experts, or on-the-job training. The training program includes both initial and refresher training. The training program is approved by NASA and is revised when process or equipment changes occur. Classroom training, written tests,"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000095951,
      "SummaryText": "demonstration, and observation are types of training used to verify personnel understand the training material before they can resume work on the systems. WSTF has a comprehensive training program to ensure that employees are competent in the operating procedures associated with these processes. Refresher training is provided at least every three years and more frequently as needed.\r\n \r\n4.1.5\tMechanical Integrity\r\nNASA guidelines are followed for maintaining the mechanical integrity of process and storage equipment to help prevent equipment failures that could endanger personnel, the public, and the environment. The mechanical integrity program includes inspection, testing and re-certification of the storage systems and equipment to help identify equipment deterioration, malfunction, and damage. Mechanical integrity requirements and the employee roles and responsibilities are documented in WSI 09-SW-0005, Legacy Pressure Systems and WSI 09-SW-0024, Pressure Systems. Both provide instructions for the design, certification, repair, modification and decertification of ground-based pressure vessels and pressurized systems at or for WSTF, consistent with NASA-STD-8719.17, NASA Requirements for Ground-Based Pressure Vessels and Pressurized Systems.\r\n\r\nThe EPA requires in 40 CFR § 68.56(d) inspections and tests on process equipment. This regulation further identifies that the inspection and testing procedures utilized shall follow recognized and generally accepted good engineering practices (RAGAGEP). The frequency of inspections and tests of process equipment are consistent with applicable manufacturers' recommendations, industry standards or codes, good engineering practices, and prior operating experience. Similarly, OSHA requires in 29 CFR § 1910.119(D)(3)(ii) documentation that equipment complies with RAGAGEP. WSTF has an ongoing process safety program to ensure facility design, construction, and maintenance use good engineering practices consistent with recognized c"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000095951,
      "SummaryText": "odes and standards. These national consensus codes and standards include those published by the National Fire Protection Association, ASTM International, American National Standards Institute, and American Petroleum Institute, where applicable. Equipment deficiencies, with regard to process operating parameters and hardware discrepancies, are recorded and corrected in accordance with WM-GP2-0001, Chapter 17 Nonconformance Control.\r\n\r\n4.1.6\tManagement of Change\r\nProposed changes to the equipment and operating procedures are evaluated and approved to ensure the change does not adversely affect the safety of operations. Processes are in place to manage changes in process chemicals, technology, equipment, procedures, and process facilities. Essential to the success of the Management of Change system is the active participation of affected employees in the review and evaluation process to determine the impacts of proposed changes. Employees participate in the analysis, documentation, and implementation of changes to the process as described in WM-SAF-0002, Chapter 3 Process Safety Management of Highly Hazardous Chemicals. Personnel whose job task will be affected are informed of and trained on changes made to a process and on the impacts of the changes prior to startup of the process. Appropriate peer reviews (e.g., design review, system safety analysis) and management reviews (e.g., test readiness review, system readiness review, safety review) are conducted in accordance with the WM-SAF-0002, Chapter 3 requirements to document changes to covered processes and ensure changes comply with applicable safety requirements. No exclusions are allowed for temporary systems or temporary system changes (e.g., a temporary increase in highly hazardous chemical inventory).\r\n&#8195;\r\n4.1.7\tPre-startup Review\r\nA safety review of a new or modified process is performed following NASA guidelines before the system is brought into service. This review confirms the design and construction o"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000095951,
      "SummaryText": "f the equipment are in accordance with the design specifications; safety, operating, maintenance and emergency procedures are in place; employee training has been completed; and a process hazard analysis has been completed. The training cited previously, along with safety and readiness reviews such as Facility Readiness Reviews, System Readiness Reviews, and Test Readiness Reviews; the process operation briefings, and combined system validations are Pre-startup Reviews of the process conducted by management and the employees.\r\n\r\n4.1.8\tCompliance Audit\r\nCompliance audits of the MMH distribution and storage systems associated with the covered process in the WSTF 500 Area Propellant Storage and Distribution location are conducted periodically as part of WSTF's internal audit program. This ensures the prevention program effectively addresses the safety of the storage systems. The PHA for the covered process is revalidated at least every five years after the initial analysis. Revalidation requirements and due dates are identified in WM-SAF-0002 Section 3.7.3, Process Hazardous Analysis (PHA) and the document's associated three-year audit plan. The audits are conducted by trained auditors with knowledge of the process or similar processes. All audits are reviewed by NASA personnel. Audit results are documented, recommendations are resolved following a developed schedule, and appropriate enhancements to the prevention program are implemented. Employees participate in compliance audits as internal auditors and interviewees. These audits are conducted at least every three years and any corrective actions required because of the audits are undertaken in a safe and prompt manner.\r\n\r\n4.1.9\tIncident Investigation\r\nNASA promptly investigates all incidents that have resulted in or could reasonably have resulted in a serious injury to personnel, the public, or the environment so similar accidents can be prevented at WSTF. An investigation team initiates an investigation to identify"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000095951,
      "SummaryText": "the situation leading to the incident, as well as any corrective actions to prevent the release from reoccurring. All reports are retained for the life of the process. Employees participate in the incident investigations as described in WM-SAF-0001, Chapter 9 Mishap Preparedness and Contingency Plan. Specific training for mishap investigation team members is provided. Upon management acceptance of the report, all affected personnel are informed of any changes and may be involved in the implementation of recommendations. Resolutions and corrective actions are documented. Close calls are investigated at WSTF as described in WM-SAF-0001, Section 9.7 Close Call Reporting, Tracking, and Corrective Action. The objective of the close call system is to correct the root cause of close call incidents to prevent incident recurrences and avoid potentially catastrophic results.\r\n\r\n4.1.10\tEmployee Participation\r\nNASA believes process safety management and accident prevention is a team effort at WSTF. The purpose of the WSTF Employee Participation Plan is to encourage employees and their representatives to participate, where applicable, on the development of the various elements contained within 29 CFR § 1910.119, Process Safety Management of Highly Hazardous Chemicals. All employee concerns are addressed promptly. All employees have access to process documentation archived as management system records. In addition, WSTF employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\r\n&#8195;\r\n4.1.11\tHot Work Permits\r\nWSTF employees request a Hot Work Permit for hot work operations on or near the RMP covered process per Chapter 6 in WM-SAF-0002, Hot Work Permit for Welding, Cutting, Open Flame or Spark Producing Operations. Hot work is defined as work involving electric or gas welding, cutting, brazing, or similar flame or spark-producing operations. (Note: Cutting as used in"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000095951,
      "SummaryText": "the procedure means any spark-producing cutting, not the use of a hacksaw.) Employees ensure fire prevention and protection requirements have been implemented prior to starting the hot work. The job is physically inspected, and the Hot Work Permit signed (approved) by a WSTF Emergency Services representative prior to beginning the operation.\r\n\r\n4.1.12\tContractors\r\nWSTF has a program with procedures to ensure contractor activities are performed in a safe manner. The safety record of contractors is reviewed annually. Employees participate in the contractor element through the procurement process when contractors or subcontractors are needed. This includes evaluating performance before and after contract award, notifying personnel of potential hazards, and developing, implementing, and monitoring safe work practices. Contractors are also informed of all procedures for emergency response, should an accidental release of a regulated substance occur. Off-site or on-site contractors and service vendors performing maintenance, repair, renovation, or specialty work on or adjacent to a covered process must adhere to the requirements of WM-SAF-0002, Chapter 3 Process Safety Management of Highly Hazardous Chemicals.\r\n\r\n4.2\tWSTF Chemical-Prevention Steps\r\nIn addition to the Program Level 3 elements required for RMP covered processes, safety features specific to the RMP covered chemical (MMH) has been implemented in accordance with NASA guidelines. NASA implements appropriate controls to prevent possible releases of regulated substances at WSTF. The Preventive Program 3 provides extensive maintenance and operator training to ensure the mechanical integrity of the systems is maintained for the life of the RMP covered process. Program Level 3 also incorporates administrative controls when modifications are made to the covered process, so the training and preventative programs are updated as the system expands and changes.\r\nThe RMP covered MMH process is also regulated by Process Sa"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000095951,
      "SummaryText": "ities and functions performed during an emergency are not hazard specific. This approach accounts for activities before, during, and after the emergency. WSTF addresses emergency management in four phases:\r\n¿\tMitigation activities eliminate or reduce the probability of a disaster occurring. Included are those long-term activities that lessen the undesirable effects of unavoidable hazards, such as natural disasters.\r\n¿\tPreparedness activities develop the response capabilities needed in the event of an emergency. Planning and training are among the activities conducted under this phase.\r\n¿\tResponse is the actual provision of emergency services during a crisis that helps to reduce casualties and damage and to speed recovery. Response activities include warning, evacuation, rescue, and other similar operations.\r\n¿\tRecovery operations include restoring vital services to the facility and restoring the facility to normal operations. Examples of recovery actions are temporary relocation of offices disrupted by structural damage, restoration of non-vital government services, and reconstruction of damaged areas.\r\nThe WSTF Emergency Response Plan (a.k.a. Emergency Preparedness Plan WSP 25-0009) was last updated on October 25, 2019. Attachment Q of this document was updated at that time to include Resource Conservation and Recovery Act emergency coordinators. The plan is reviewed annually for accuracy by the WSTF Safety and Mission Assurance and Environmental Departments. Emergency response training is provided to all WSTF employees during safety and environmental new hire training and annual environmental awareness training (ENV-02), which was last provided on August 17, 2021. Environmental awareness training is usually conducted monthly for those employees who are approaching their annual training requirement date. Specific Emergency Preparedness Plan training (ENV-06) is also conducted annually with plan stakeholders.\r\n\r\n7.2\tEmergency Response Plan Content Areas\r\nAttachment"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000095951,
      "SummaryText": "fety Management. WSTF's Process Safety Management instruction, WM-SAF-0002, Chapter 3 Process Safety Management of Highly Hazardous Chemicals, addresses all 14 elements of 29 CFR § 1910.119. Process hazard analyses are performed utilizing the site instruction, WSI 04-SW-0002, Hazard Analysis. Mechanical integrity is achieved primarily through the site's pressure systems program as implemented by WSI 09-SW-0005, Legacy Pressure Systems and WSI 09-SW-0024, Pressure Systems. The design review process includes thorough consideration of materials of construction and fluid compatibility. The Hypergol Material Approval Committee and the Pressure Systems Design Group coordinate on fluid/material evaluations and component and system level analyses. System configurations, review documentation, procedures, and maintenance records are controlled by an ISO-certified quality management system. Employee training is extensive and is managed through NASA's online training database, SATERN. At the process level, the following are examples of additional risk mitigations employed:\r\n¿\tPressure system certification to NASA standards at defined interval (primarily based on degradation mechanisms, not to exceed 10 years).\r\n¿\tWeekly propellant accountability checks.\r\n¿\tDaily scans at random system locations with propellant vapor detectors to ensure systems are leak tight.\r\n¿\tSpecial cold weather protocols are in place to restrict personnel access and increase scans for chemical vapors particularly in process locations known to leak at temperatures below 35 °F.\r\n¿\tPropellants are stored over concrete surfaces with secondary containment and water deluge systems.\r\n¿\tBulk quantity transports are coordinated with site Protective Services personnel, who then decide how to stage themselves, based on location and wind direction, to support an unplanned release.\r\n¿\tReadiness reviews, dry runs of approved procedures, and pre-task safety briefings are performed to ensure personnel understand the task"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000095951,
      "SummaryText": "at hand, are aware of what to expect, and can recognize and respond to an upset condition when it occurs.\r\n¿\tChemical-specific prevention steps for MMH are detailed in several site documents. For example:\r\no\tWSI PROP-0047, Special Requirements and Precautions for Conducting Toxic Propellant Operations details guidelines for the handling of the earth storable propellants, nitrogen tetroxide, and the hydrazine family of fuels.\r\no\tWSI 09-SW-0012, Control of Materials Used in Hypergolic Propellant Systems, details the materials of construction for fluid system piping and specifies the type of valve soft goods that may be used for the hydrazine family of fuels.\r\no\tWSI 09-SW-0013, Chemical and Particulate Cleanliness for WSTF Fluids, specifies the level of cleanliness that must be obtained and maintained before wetting a system with MMH.\r\no\tWM-SAF-0002, Chapter 4 Toxic Propellant Safety provides instructions for temporary storage of propellants, for special handling, marking of system components used in hypergolic propellant systems, and instructions for scrapping, excessing, or loaning components or systems.\r\n\r\n5.0\tThe Five-Year Accident History\r\nWhen an RMP is updated as required by 40 CFR § 68.190 of the rule, it must contain an updated Five-Year Accident History including all accidents that meet the reporting criteria and that occurred within five years of the date on which the updated RMP is submitted. The Five-Year Accident History involves the reporting of significant accidental releases of RMP covered substances from an RMP covered process in the five years prior to the submission of an initial or updated Risk Management Plan. The Five-Year Accident History only includes certain releases that meet these criteria:\r\n¿\tThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\r\n¿\tThe release must have caused at least one of the following:\r\no\tOn-site deaths, injuries, or significant property damage (4"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000095951,
      "SummaryText": "0 CFR § 68.42(a)); or\r\no\tKnown off-site deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (40 CFR § 68.42(a)).\r\nThe EPA also identifies in EPA 555-B-04-001, General Guidance on Risk Management Programs for Chemical Accident Prevention that if there has been a release of a regulated substance from a process where the regulated substance is held below its threshold quantity, then a facility does need to report that release even if the release caused one of the listed impacts.\r\n\r\nAn incident investigation is a requirement of the rule (40 CFR § 68.60 and 40 CFR § 68.81). Since WSTF is a Prevention Program Level 3, each incident which resulted in, or could reasonably have resulted in, a catastrophic release of a regulated substance must be investigated. WM-SAF-0001, Chapter 9 Mishap Preparedness and Contingency Plan provides instruction for notifications, investigation and documentation of mishaps and contains the WSTF Mishap Preparedness and Contingency Plan. A mishap is defined as an event that causes death, injury, or unexpected property damage or environmental harm. Damage to a test article is not a mishap if the test article damage was expected to occur as a result of the test and the expectation is formally documented and customer agreement obtained (reference to NPR 8621.1, NASA Procedural Requirements for Mishap and Close Call Reporting, Investigating, and Recordkeeping). In Section 5.3.6.d, this procedure identifies that once a mishap report has been accepted (endorsed), Supervisors submit a corrective action plan, including identification of individuals responsible for corrective action performance and estimated date of completion, to the appointing official for approval.\r\n\r\nIn Section 5.3.7, this procedure identifies that NASA and/or contractor Safety and Mission Assurance will verify corrective actions are implemented before closure and track all items to completion, noting specific results and rationale for closure."
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000095951,
      "SummaryText": "A file of mishap reports and closure rationale is maintained and incident summaries, lessons learned, or alerts are distributed as determined appropriate by WSTF Management and Safety and Mission Assurance.\r\n\r\nWM-SAF-0001, Section 9.7 Close Call Reporting, Tracking, and Corrective Action provides instructions for reporting and investigating close calls. The objective of the close call system is to correct the root cause of close call incidents in order to prevent incident recurrences and avoid potentially catastrophic results. A close call is defined as an occurrence in which there is no injury (first aid or medical treatment), no significant equipment/property damage (less than $1,000), and no significant interruption of productive work, but which possesses a potential for mishap. Anyone on-site can use WSTF Form 412, WSTF Close Call Reporting, to identify unsafe acts or conditions observed in the workplace or on-site. The WSTF Form 412A, Close Call Response, Approval & Follow-up Form, is used to address close calls and to document corrective actions (if any).\r\nOSHA's Log of Work-Related Injuries and Illnesses, OSHA Form 300, is used for recording and classifying recordable occupational injuries and illnesses, and for noting the extent and outcome of each case. The log shows when the occupational injury or illness occurred, to whom, what the injured or ill person's regular job was at the time of the injury or illness exposure, the kind of injury or illness, how much time was lost, and whether the case resulted in a fatality.\r\n\r\nThe WSTF Environmental Department documents spill/releases that occurred to the environment, which includes the substances from RMP covered processes. A records review was conducted, and it was determined that there was no release of the regulated substance (MMH) to the environment from the RMP covered process in the WSTF 500 Area Propellant Storage and Distribution location. \r\n\r\n5.1\tSummary\r\nThere has not been an accidental release of the"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000095951,
      "SummaryText": "substances from the RMP covered processes at WSTF in the last five years that has resulted in death, injury, or significant property damage on-site, nor any deaths, injuries, evacuations, sheltering in place, property damage or environmental damage off-site. This determination was reached after reviewing the WSTF Mishaps, Close Calls, OSHA Form 300 Log of Work-Related Injuries and Illnesses, and the Environmental Spill Reports. In accordance with 40 CFR § 68.195(a), NASA will update this RMP with any new accident history information for any accidental release meeting the Five-Year Accident History reporting criteria of 40 CFR § 68.42. NASA will submit the release data with respect to that accident within six months of the release or by the time the RMP is updated under 40 CFR § 68.190, whichever is earlier.\r\n\r\n6.0\tWorst-Case and Alternative Release Scenarios\r\nToxic plume dispersion modeling for the covered process under Program Level 3 was performed for a Worst-Case Release Scenario and an Alternative Release Scenario using the software program Areal Locations of Hazardous Atmospheres (ALOHA&reg; ) Version 5.4.7. ALOHA is part of the CAMEO&reg;  software suite, which is developed jointly by the National Oceanic and Atmospheric Administration and the EPA. ALOHA was used because it allows a user to enter details about a potential chemical release, and model threat zone estimates. ALOHA models toxic gas cloud, flammable gas clouds, boiling liquid expanding vapor explosions (BLEVEs), jet fires, pool fires, and vapor cloud explosions. Information about the scenario (e.g., chemical, weather conditions, and the type of release) is entered into a series of dialog boxes. The scenario information and calculation results are summarized in a printable, text-only window. Once ALOHA's calculations are complete, the defined threat zone can be exported to display in a variety of graphical outputs.\r\n\r\n6.1\tWorst-Case Release Scenario\r\nFailure of a MMH storage tank associated with the"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000095951,
      "SummaryText": "RMP covered process in the 500 Area Propellant Storage and Distribution location was simulated as the worst-case scenario. The MMH storage tank in this area has a maximum storage capacity of 3,500 gal. The Maximum Intended Inventory for this tank is 3,300 gal (23,959 lbs), which is less than the maximum storage capacity. This reduced volume allows for ullage and is controlled by the WSTF operating procedure PTO-GEN-BSL-HAZA-008-PHA, Process Hazard Analysis for Propulsion Test Areas General Hazards (Including Highly Hazardous Chemicals). The Worst-Case Release Scenario simulates a catastrophic release from the tank when the operating volume of 3,300 gal (23,959 lbs) of MMH is instantaneously released at ground level into a 2,880-square foot concrete diked area. Upon release of the MMH into the concrete diked area, there was subsequent vaporization of MMH into the air.\r\n\r\nMeteorological conditions used for the Worst-Case Release scenario were those specified by 40 CFR § 68.22. The ambient and in-vessel fluid temperature used was 109.5 °F, which represents the maximum recorded temperature at the Jornada Experimental Range (JER) within the last three years. The JER is located immediately adjacent to the northern boundary of WSTF. Thirty percent humidity was determined to be the average humidity over the last year. The guidance specified wind speed of 1.5 meters per second (3.4 miles per hour [mph]) was used in the model. An atmospheric stability class of \"F\" (very stable) was also used. The topography was identified as rural for WSTF. The EPA identifies that a rural terrain is one which is generally flat and unobstructed in the immediate area. Rural terrain is designated by the \"open space\" setting in ALOHA.\r\n\r\nThe MMH toxic endpoint from 40 CFR Part 68, Appendix A is 0.0094 milligrams per liter. The Risk Management Program Guidance for Offsite Consequence Analysis (EPA 550-B-99-009), Exhibit B-2, indicates a converted value of 5 parts per million, which was used in th"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000095951,
      "SummaryText": "e model. Once the MMH was released from the tank, it formed a pool within the concrete diked area. From the model output, the maximum average sustained release rate was 32.8 pounds per minute during the ALHOA limited duration simulation period of 1 hour.\r\n\r\nThe ALOHA model results indicate a maximum MMH toxic endpoint distance of 2.0 miles. ALOHA input parameters and output results are provided in Appendix B. The toxic endpoint goes beyond the WSTF administrative boundary into the JER, but there are no Part 68 defined potential public or environmental receptors within the exceedance area (Figure 6.1). This statement is based on the fact that not all off-site areas contain potential public receptors. In this case, there are no areas within the exceedance area where members of the public are expected to routinely gather.\r\n\r\nThere are no residences, institutions (i.e., school, hospitals), buildings, parks, or recreation areas within the exceedance area. The JER is an access controlled ecological and agricultural research center owned by the United States Department of Agriculture that contains many inaccessible tracts of land that lack public facilities and do not get used routinely. Chapter 2 of the EPA's General Risk Management Program Guidance (April 2004) also acknowledges that in general, farmland is not considered a public receptor. The farm-like rangeland and ecological research being conducted at the JER would fit the RMP non-public farmland scenario, because the JER land in the exceedance area is not routinely occupied by farm workers or other members of the public. Figure 6.1 provides land ownership within and outside the WSTF administrative boundary. All land within the toxic endpoint is access restricted inside the WSTF administrative boundary or with the access-controlled JER.\r\n\r\nThe General RMP Guidance (April 2004) specifically limits environmental receptors that must be considered during RMP off-site consequence analysis to natural areas. These natural"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000095951,
      "SummaryText": "areas include national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas; and Federal wilderness areas. Because none of these areas are located within the exceedance area, no impacted environmental receptors were identified in the RMP off-site consequence worst-case release scenario.\r\n\r\n6.2\tAlternative Release Scenario\r\nAlternative Release Scenario Analysis is required by 40 CFR § 68.28(a) states that the facility shall identify and analyze at least one alternative release scenario for each regulated toxic substance held in a covered process(es) and at least one alternative release scenario to represent all flammable substances held in covered processes. Upon consideration of possible releases, a shipping container mishandling scenario was selected for the covered process. The Alternative Release Scenario chosen involves one 120-gal 4BW cylinder of MMH being transported from the 500 Area Propellant Storage and Distribution location Interim Storage Area to the 400 Test Area. Process Hazard Analysis for Propulsion Test Areas General Hazards (Including Highly Hazardous Chemicals) (PTO-GEN-BSL-HAZA-008-PHA.E) identifies the maximum rated capacity for this container as 110 gal when allowing for ullage. While unloading the 4BW cylinder of MMH from the transport trailer in the 400 Area, there is an accident that causes the cylinder to be physically dropped off the transport vehicle. This results in a rupture of the container and a release of MMH.\r\n \r\nThe Alternative Release Scenario is a liquid release of 100% MMH. The simulated release resulted in the 110 gal (~798.6 lbs) of MMH being released at ground level onto an unconfined soil area (not diked). The 110 gal assumes the full operating volume of the 4BW is released to the environment. A continuous release was modeled to assume the entire contents of the 4BW were released over a 1-hour ALOHA simulation period. Actual volume released and incident duration woul"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000095951,
      "SummaryText": "d likely be less because it is estimated that WSTF Emergency Services would respond and curtail the release from the 4BW within 15 minutes.\r\n\r\nUpon release of the MMH onto the unconfined soil area, ALOHA simulates volatilization of MMH into the atmosphere. Meteorological conditions used for the Alternative Release Scenario were selected from data in the WSTF Facility Master Plan and available meteorological data from the adjacent JER facility. The shipping container mishandling scenario was modeled as a liquid stream released continuously at 62.5 °F at ground level, with 30% humidity, and with a wind speed of 15 mph. An atmospheric stability class of \"F\" (stable) was used. The topography was identified as rural for WSTF, using the open space ground roughness parameter in ALOHA. From the model output, the maximum evaporation rate from the released MMH was 13.3 lbs/minute with a total evaporation time of 60 minutes. The ALOHA results indicate a maximum MMH toxic endpoint distance of 0.71 miles. This area is within the WSTF administrative boundary, which is located 1.47 miles from the release point (Figure 6.2). No public or environmental receptors outside the WSTF boundary would be impacted by this release. ALOHA input parameters and output results are provided in Appendix B.\r\n\r\n7.0\tEmergency Response Program\r\nThe WSTF Emergency Preparedness Plan (WSP 25-0009) is the basis for the WSTF emergency response program. This Plan provides direction to mitigate the effects of hazards, preserving life and minimizing damage to WSTF operations and infrastructure. This Plan directs response during emergencies and establishes a recovery system in order to return the facility to normal operations after a major incident, such as a natural disaster or a technological accident.\r\n\r\n7.1\tEmergency Response Plan \r\nThe Plan, which is maintained at WSTF, establishes an Emergency Preparedness Coordinator, who is responsible for direction and control of emergency response elements at WSTF. Th"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000095951,
      "SummaryText": "e Plan establishes an Executive Group, top-level managers who are responsible for consultation of site issues and allocation of resources to contend with an emergency beyond those inherently provided to an Incident Commander.\r\n\r\nThe Emergency Services Section, which includes the WSTF Fire Department, provides the resources to deal with emergency situations related to firefighters, emergency medical response, hazardous materials response, and confined space rescue response. The WSTF Fire Department is responsible for the training and equipment of the team. The WSTF Fire Department coverage is provided full-time, 24-hours a day.\r\n\r\nWSTF has developed plans and procedures to protect life and property from the effects of hazardous events. The Emergency Preparedness Plan provides a Hazard/Threat Identification Analysis table that lists the possible hazards and the likelihood of occurrence. The priority for the Plan follows the likelihood of a hazard occurrence. This policy is based upon the concept that emergency functions for various organizations involved in emergency management will generally parallel normal day-to-day functions. Activities that do not contribute directly to resolving the emergency may be postponed or redirected for the duration of any emergency, making labor, materials, and equipment available for emergency use.\r\n\r\nWSTF utilizes the Incident Command System (ICS) in the handling of emergencies. Fire, medical, and chemical spills that exceed WSTF local area capabilities to handle safely are examples of emergencies that will be handled using the ICS. Emergencies of all types will be dealt with at the lowest level that is practical and safe. When an incident is elevated to an emergency classification, there is a clear transition of authority to an Incident Commander once they arrive on the scene, and the local person in charge functions as a unified commander or technical advisor. WSTF follows an all-hazard approach and acknowledges that most responsibil"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000095951,
      "SummaryText": "Q, HAZMAT/ Hazardous Material/Waste Spill Response of the WSTF Emergency Preparedness Plan provides the policies and procedures for responding to emergency releases of hazardous material/waste and potential accidents that can have impact(s) on the environment. Individual area emergency response plans are developed to include specific hazards and responses in that area (such as the 300 Area, 400 Area, and 500 Area). The area plans indicate the individual (by function) in charge of local events and who is responsible for elevating the classification to an emergency status when the ability to safely contain the event is exceeded. Area-specific plans are consistent with the WSTF Emergency Preparedness Plan (WSP 25-0009). Typically, the local area emergency response plans address incidental releases (minor spills) in that area. Provided below are some examples of local area emergency response plans (which interface with the WSTF Emergency Preparedness Plan):\r\n¿\tWSI PROP-0044, Propulsion Test Area Spill Plan\r\n¿\tWSI PROP-0055, 300 and 400 Area Propulsion Test Emergency Procedures Implementation\r\nThe WSTF HAZMAT Response Team consists of WSTF Fire Department personnel who are trained to the HAZMAT Technician level. The Fire Department is responsible for HAZMAT Response Team training and equipment. Within the WSTF hazardous test areas, supervisors are responsible for writing plans for emergency response actions to secure the test systems, alert personnel, and evacuate personnel to assembly areas as directed by the cognizant Office Chief or Department Manager/Director. The HAZMAT Response Team will be called when it is determined by the local area person in charge that the condition constitutes an emergency. Incidental spills (minor spills) are handled and controlled by appropriately trained personnel within the area. If an emergency situation is endangering a neighboring community, and has the potential to place them at risk, local authorities will be notified promptly by th"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000095951,
      "SummaryText": "e Emergency Preparation Coordinator.\r\n\r\nAttachment A, Warning of the WSTF Emergency Preparedness Plan provides a plan for disseminating timely warnings to the WSTF community and its employees, including the Aerospace Data Facility-Southwest and White Sands Complex (Tracking and Data Relay Satellite) stations, and other jurisdictions who could be affected by an impending hazardous situation. All components of the warning system are tested at least monthly. For hazardous chemical spills, a siren is utilized to notify employees of a chemical release requiring evacuation to a designated assembly area (shelter in place). WSTF also has a \"ringdown\" phone system for communication between test areas and the NASA Dispatch Center.\r\n\r\nAttachment C, Shelter and Mass Care, and Accountability of the WSTF Emergency Preparedness Plan defines the areas at WSTF that will be used for the shelter and care of personnel in the event of short-duration emergencies and establishes employee accountability expectations and procedures.\r\n\r\nAttachment E, Evacuation of the WSTF Emergency Preparedness Plan provides for the orderly and coordinated evacuation of all or any part of WSTF, if it is determined that such action is the most effective means available for protecting employees from the effects of a disaster or hazardous material/waste release.\r\n\r\nAttachment H, Medical and Occupational Health of the WSTF Emergency Preparedness Plan coordinates health and medical services during emergency situations to reduce death and injury. This attachment also outlines damage assessment and restoration of essential health and medical services within WSTF during and immediately following a disaster. The on-site Clinic and Emergency Medical Services are responsible for the day-to-day provision of medical services at WSTF. Provided in WJI-OPS-EMS-0004, Emergency Medical Services are instructions for care for medical emergencies that are responded to by WSTF Fire and Emergency personnel. Additionally, in WM-SA"
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 1000095951,
      "SummaryText": "F-0003, Chapter 13 WSTF Clinic Operating Plan, instructions are provided for staffing, planning, and performing duties in the WSTF Clinic in support of the occupational medicine activities at WSTF.\r\n\r\nAttachment I, Emergency Public Information of the WSTF Emergency Preparedness Plan provides for effective collection, control, and dissemination of emergency public information and for the minimization of confusion, misinformation, and rumors during times of emergency. WSTF is prepared to carry out initial emergency response and short-term actions on an independent basis. Should on-site resources prove to be inadequate during an emergency, requests for assistance from other local jurisdictions and other agencies may be made in accordance with existing or emergency negotiated mutual aid agreements. WSTF will coordinate help requested from off-site with outside agencies to fully establish a comprehensive plan to address hazards at WSTF. Such assistance may take the form of equipment, supplies, personnel, or other available capabilities. This coordination effort differs from those emergencies handled on a daily basis by WSTF firefighters, security, and medical services personnel.\r\n\r\nAttachment P, Hazard Mitigation of the WSTF Emergency Preparedness Plan describes hazard mitigation planning and implementation measures to accomplish the long-term prevention or reduction of the adverse impact of natural and other hazards at WSTF.\r\n\r\nAttachment T, Training of the WSTF Emergency Preparedness Plan provides planning for a comprehensive training program in emergency management for all departments and personnel who support the emergency services at WSTF. All employees who work on-site have the potential of being exposed to hazardous materials (such as MMH); therefore, must annually take WSTF-OHS-HAZCOMCBT, WSTF Hazard Communication and Emergency Response. After first taking an instructor-led class, employees take annual training through the on-line training class accessible throug"
    },
    {
      "ESSeqNum": 28,
      "FacilityID": 1000095951,
      "SummaryText": "h SATERN. Employees that work directly with or routinely handle hazardous chemicals receive additional substance-specific chemical training depending upon their job duties.\r\n\r\nWSTF emergency plans are updated as necessary based upon deficiencies identified by drills and exercises, changes in local management structure, and technological changes. Exercises of the Emergency Response Program are performed annually. WSTF has an Emergency Preparedness Planning Board which is appointed by the NASA WSTF Manager with responsibility for maintenance and review of the WSTF Emergency Preparedness Plan, with the goal to ensure WSTF emergency preparedness is in a continual state of readiness. Additional responsibilities (not an exhaustive list) are 1) to ensure WSTF local area emergency response plans and procedures are consistent with the WSTF Emergency Preparedness Plan and 2) develop, plan, and conduct emergency exercises to effectively challenge and improve individual and collective response to an emergency at WSTF.\r\n\r\n7.3\tEmergency Response Plan Coordination\r\nAdditionally, 40 CFR § 68.95(c) identifies the emergency response plan must be coordinated with the community plan developed under the Emergency Planning and Community Right-to-Know Act (EPCRA, also known as SARA Title III). The Dona Ana County/City of Las Cruces Local Emergency Planning Committee (LEPC) receives the annual SARA Title III Emergency and Hazardous Chemical Inventory Tier II Report from WSTF. In addition, at the request of local emergency planning or response officials, a facility must provide any information necessary for developing and implementing the community plan.\r\nWSTF recognizes the need for public awareness where hazardous chemicals are concerned. Representatives from WSTF participate in the Dona Ana County/Las Cruces LEPC. They brief the committee on what chemicals are located on-site, what processes they are involved in, and what safety precautions are taken to ensure the safety of employees as"
    },
    {
      "ESSeqNum": 29,
      "FacilityID": 1000095951,
      "SummaryText": "well as the public. The Dona Ana County/City of Las Cruces All-Hazard Emergency Operations Plan identifies the WSTF Fire Department as a critical resource dependency for Emergency Medical Services transport and for HAZMAT Response.\r\n\r\n7.4\tRMP Emergency Contact Information\r\n40 CFR § 68.195(b) identifies that within one month of any change in the RMP emergency contact information required under §68.160(b)(6), WSTF shall submit a correction of that information. 40 CFR § 68.160(b)(6) identifies that the RMP must include the name, title, telephone number, 24-hour telephone number, and the e-mail address (if an e-mail address exists) of the emergency contact. WSTF will update emergency contact information identified in this plan within one month of any change of the required contact information. The current RMP Emergency Contact information is unchanged from the 2016 submission and is summarized below:\r\nName: Dennis B. Pacheco\r\nTitle of person or position: WSTF Fire Department Chief\r\nPhone: (575) 524-5217\r\n24-Hour Phone: (575) 524-5911\r\nEmail address for emergency contact: dennis.b.pacheco@nasa.gov \r\nFacility or Parent Company E-mail Address: robert.m.cort@nasa.gov \r\nFacility Public Contact Phone Number: (575) 524-5771\r\n\r\n8.0\tPlanned Changes to Improve Safety\r\nNASA is currently working on a project to install additional infrastructure to safely transport and use on-demand quantities of hypergolic propellants, including MMH, at rocket engine testing locations in the WSTF 300 and 400 Areas. RTSs will replace the antiquated Auxiliary Conditioning Units and RSUs that previously stored large amounts of liquid propellants near work areas. The RTSs project represents the next phase in NASA's efforts to reduce liability associated with handling large volumes of liquid propellants."
    }
  ]
}