{
  "FacilityID": 1000092323,
  "FacilityName": "Sunset Water Treatment Facility",
  "FacilityStr1": "2700 Willow Beach Road",
  "FacilityStr2": null,
  "FacilityCity": "Guntersville",
  "FacilityState": "AL",
  "FacilityZipCode": "35976",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01095",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "34.334000",
  "FacilityLongDecDegs": "-086.329900",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "bchandler@gvillewater.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Guntersville Water and Sewer Board",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Guntersville Water and Sewer Board",
  "OperatorStr1": "705 Blount Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Guntersville",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35976",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bay Chandler",
  "RMPTitle": "Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000141312",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-02-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-03-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.33063,
  "FRS_Long": -86.33204,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114633,
      "AltID": "Chlorination Process",
      "FacilityID": 1000092323,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000116026,
          "ProcessID": 1000114633,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143262,
          "ProcessID": 1000114633,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000643262,
          "ProcessID": 1000114633,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092323,
      "SummaryText": "Risk Management Program\n\nExecutive Summary \n\n3/26/2019\n\n\n\nSunset Water Treatment Facility\n\nGuntersville, Alabama\n\n\n\n\n\n1.0  Introduction\n\n\n\nThe Guntersville Water  Board operates a water treatment facility in Guntersville, Marshall County, Alabama. Due to the quantity of chlorine stored at the facility the facility is subject to the United States Environmental Protection Agency's Risk Management Program. \n\n\n\nThe purpose of the Risk Management Program is to prevent or reduce the severity of an accidental release of a hazardous chemical. Among the requirements of the Risk Management Program is the submission of a Risk Management Plan (RMP) summarizing the overall program. The following information is an Executive Summary of the information contained in the Risk Management Program. This Executive Summary includes a description of the facility's accidental release prevention and safety policies, a facility and process description, an explanation of the accidental release scenarios studied, a five-year accident history, and details of the facility's accidental release prevention program.\n\n\n\n2.0  Accidental Release Prevention Policies\n\n\n\nThe Guntersville Water and Sewer Board takes great care to ensure the safety of its employees and the surrounding community. Safety programs and policies are stressed in all aspects of facility operations.\n\n\n\nThe Guntersville Water and Sewer Board's safety program provides rules and guidance for the safe operation, maintenance, and construction of the treatment facility. The safety program includes the required personal protective equipment and safe work practices including lockout and tagout, hot work permitting, confined space entry, and hazardous chemical handling. \n\n\n\n3.0  Facility and Process Description\n\n\n\nThe Sunset Water Treatment Facility treats drinking water for the City of Guntersville.\n\n\n\n4.0  Regulated Substances Present\n\n\n\nChlorine is the only substance used at the facility that is subject to the Risk Management Program regu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092323,
      "SummaryText": "lations. \n\n\n\n5.0  Release Scenarios\n\n\n\nAs required by the Risk Management Program regulations, The Guntersville Water and Sewer Board determined the offsite impact of an accidental release for both a worst case release and an alternate release scenario.\n\n\n\nThe regulations define the worst case release as the loss of the entire maximum inventory of the largest tank or vessel. The regulations require that the offsite impact of the worst case release be calculated using very conservative, worst case weather conditions. USEPA has published reference tables to be used in calculating the distance offsite that an accidental release would travel. These tables employ very conservative assumptions and therefore provide conservative estimates of the offsite distance that an accidental release would travel. The Guntersville Water and Sewer Board used the USEPA reference tables to calculate a worst-case offsite impact radius.\n\n\n\nThe Guntersville Water and Sewer Board also calculated the offsite impact distance for an alternate, more realistic accidental release scenario. This release scenario took into consideration safety systems and controls in place to reduce the severity of an accidental release and considered a more realistic release rate of the toxic chemical.\n\n\n\n6.0  Accidental Release Prevention Program\n\n\n\nThe facility's accident prevention program includes each of the elements required by the Risk Management Program regulations. \n\n\n\n6.1 Process Safety Information\n\n\n\nThe Guntersville Water and Sewer Board has gathered the necessary documentation of safety information on the covered process including the maximum/minimum pressure, temperature, and inventory in covered tanks, the tank and piping materials of construction, documentation of design codes and standards used for the tanks and piping, and a description of safety systems in place. This information is periodically reviewed to ensure that the process is constructed according to good engineering practices.\n\n\n\n6.2  Pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092323,
      "SummaryText": "ocess Hazard Review\n\n\n\nA Process Hazard Review has been conducted on the covered processes to determine the potential hazards of the process and to determine the possible equipment failures or human errors that could lead to a release. The results of the review were used to determine the appropriate safeguards needed to prevent failures or errors that could lead to a release.\n\n\n\n6.3  Operating Procedures\n\n\n\nWritten operating procedures have been developed for operations. The purpose of the written operating procedures is to make sure that each employee before operating a process is knowledgeable of the correct operating methods, is aware of the chemical hazards present, and is qualified to respond correctly in an emergency situation.\n\n\n\n6.4  Training\n\n\n\nNew employees are trained in the safe operation of plant processes and their performance is periodically evaluated. As needed, refresher training is provided. Employees are given safety training and are trained in the emergency response procedures discussed in Section 8.0.\n\n\n\n6.5  Maintenance\n\n\n\nWritten maintenance procedures and training guide the safe work practices of maintenance employees and ensure that they are made aware of the potential hazards of the plant processes. A hot work permitting program, lockout tagout procedures, an confined space entry procedures have been put in place to protect maintenance workers while servicing equipment. Preventive maintenance inspections and testing are schedule based on manufacturers recommendations so that aging equipment can be replaced before failing and possibly causing an accidental release.\n\n\n\n7.0  Five Year Accident History\n\n\n\nNo serious accidents have occurred at the facility in the last five years.\n\n\n\n8.0  Emergency Response Coordination\n\n\n\nFacility personnel will not respond to a significant release of chlorine but will contact offsite emergency responders. The facility has developed an emergency plan for responding to small releases and for contacting emergency "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092323,
      "SummaryText": "responders in the event of a large release.\n\n\n\n9.0  Planned Future Safety Enhancements\n\n\n\nPlanned safety enhancements include the continued development of the facility's preventive maintenance program and ongoing safety training and new employee orientation. Together, these programs will continue to ensure the safety of employees and the community."
    }
  ]
}