{
  "FacilityID": 1000082640,
  "FacilityName": "BASF Corporation - St. Louis",
  "FacilityStr1": "3568 Tree Court Industrial Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Kirkwood",
  "FacilityState": "MO",
  "FacilityZipCode": "63122",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29189",
  "LEPC": "St. Louis LEPC",
  "FacilityLatDecDegs": "38.561389",
  "FacilityLongDecDegs": "-090.458056",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.basf.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6278907,
  "ParentCompanyName": "BASF",
  "Company2Name": null,
  "CompanyDUNS": 1307032,
  "Company2DUNS": null,
  "OperatorName": "BASF",
  "OperatorStr1": "#26 Davis Drive",
  "OperatorStr2": null,
  "OperatorCity": "Research Triangle P",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27709",
  "OperatorZipCodeExt": null,
  "FTE": 75,
  "OtherEPAFacilityID": "63122whtmr3568t",
  "EPAFacilityID": "100000106397",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-02-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-09-24 15:42:22",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-24 15:42:22",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-09-24 15:42:22",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 38.560791,
  "FRS_Long": -90.457932,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103270,
      "AltID": "Warehouse Storage",
      "FacilityID": 1000082640,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129281,
          "ProcessID": 1000103270,
          "ChemicalID": 118,
          "Quantity": 290000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000129282,
          "ProcessID": 1000103270,
          "ChemicalID": 98,
          "Quantity": 290000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000104548,
          "ProcessID": 1000103270,
          "NAICSCode": "49319",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000082640,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-03-04 00:00:00",
    "ERTrainingDate": "2019-03-04 00:00:00",
    "CoordinatingAgencyName": "St. Louis LEPC",
    "CoordinatingAgencyPhone": "3146285400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082640,
      "SummaryText": "Executive Summary: Production - Propellant Storage\r\n\r\nThe accidental release prevention and emergency response policies at our facility: This facility complies with NFPA-58 requirements for LP-Gas storage, and it is our policy to adhere to all federal, state, and local laws.  If an emergency were to occur, it is our policy to notify the Valley Park Fire Protection District Fire Department and request that they respond to the emergency.\r\n\r\nA description of our facility and the regulated substances handled: This facility is a finished product storage and shipping warehouse.  Finished product stored on site includes pesticide liquid and granular materials, and storage of aerosol pesticide finished products containing propellants.  Several types of propellants are used in the insecticide aerosol can products which include NP-70 (propane/n-butane) and Dimethyl Ether (DME).  NP-70 (propane/n-butane) is chosen as a representative sample since it has the worst-case impact.  The quantity in cans stored in the warehouse exceeds the 10,000 lbs propane/n-butane threshold.  The worst case scenario is based on a case of 12 aerosol cans exploding.  The RMP modeling was based upon a mixture: equal amounts of butane and propane.\r\n\r\nThe general accidental release prevention program and chemical-specific prevention steps:  This facility complies with EPA's accident prevention rule and all applicable state and local codes and regulations.  The propellant system is designed, installed, and maintained in accordance with NFPA-58 and state law.\r\n\r\nFive-year accident history:  We have never had an accident involving the propellant system that caused deaths, injuries, property or environmental damage, evacuations, or shelterings in place.\r\n\r\nThe emergency response program:  In the event of an emergency involving our propellant system, it is our policy to notify the Valley Park Fire District Fire Department and request that they respond to the emergency.  We have discussed this policy with th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082640,
      "SummaryText": "e fire department and they are aware of their responsibility.\r\n\r\n\r\nExecutive Summary: Warehouse Storage\r\n\r\nThe accidental release prevention and emergency response policies at our facility:  This facility complies with NFPA-58 requirements for LP-Gas storage, and it is our policy to adhere to all applicable federal, state, and local laws.  The packaging and storing of the aerosol cans follow accepted industry standards.  If an emergency were to occur, it is our policy to notify the Valley Park Fire Protection District Fire Department and request that they respond to the emergency.\r\n\r\nA description of our facility and the regulated substances handled:  This facility is an insecticide manufacturer for use by commercial applicators.  We use a number of propellants in our insecticide aerosol can products.  We chose NP-70 (propane/n-butane) as a representative sample since it has the worst-case impact.  The quantity of cans stored in our warehouse puts us over the 10,000 lbs propane/n-butane threshold.  The worst-case scenario is based on a single can exploding.\r\n\r\nThe general accidental release prevention program and chemical-specific prevention steps:  The facility complies with EPA's accident prevention rule and all applicable state and local codes and regulations.  All systems are designed, installed, and maintained in accordance with NFPA-58 and state law.  The warehouse follows accepted industry standards in packaging and storing the aerosol insecticide products.\r\n\r\nFive-year accident history:  We have never had an accident involving the warehouse aerosol propellant storage areas that caused deaths, injuries, property or environmental damage, evacuations, or shelterings in place.\r\n\r\nThe emergency response program:  In the event of an emergency involving our warehouse facility, it is our policy to notify the Valley Park Fire Protection District Fire Department and request that they respond to the emergency.  We have discussed this policy with the fire department and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082640,
      "SummaryText": "they are aware of their repsonsibility.\r\n\r\nPlanned changes to improve safety:  None."
    }
  ]
}