{
  "FacilityID": 1000078518,
  "FacilityName": "Reclaimed Water Plant",
  "FacilityStr1": "2 Lawton Canal Road",
  "FacilityStr2": null,
  "FacilityCity": "Hilton Head Island",
  "FacilityState": "SC",
  "FacilityZipCode": "29928",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "45013",
  "LEPC": "Beaufort County EMD",
  "FacilityLatDecDegs": "32.136783",
  "FacilityLongDecDegs": "-080.781004",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PC",
  "FacilityURL": "www.sipsd.com",
  "FacilityEmailAddress": "brad@sipsd.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "South Island Public Service District",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "South Island PSD",
  "OperatorStr1": "P.O. Box 5148",
  "OperatorStr2": null,
  "OperatorCity": "Hilton Head Island",
  "OperatorStateFIPS": "SC",
  "OperatorZipCode": "29938",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brad O'Keefe",
  "RMPTitle": "Operations Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000153567",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-05-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-05-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-05-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.14083,
  "FRS_Long": -80.78583,
  "FRS_Description": null,
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097909,
      "AltID": "Chlorination",
      "FacilityID": 1000078518,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099151,
          "ProcessID": 1000097909,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122826,
          "ProcessID": 1000097909,
          "ChemicalID": 62,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000622826,
          "ProcessID": 1000097909,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000097910,
      "AltID": "Dechlorination",
      "FacilityID": 1000078518,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000099152,
          "ProcessID": 1000097910,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122827,
          "ProcessID": 1000097910,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000622827,
          "ProcessID": 1000097910,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078518,
      "SummaryText": "South Island PSD Reclaimed Water Plant\n\n1. Accidental release prevention and emergency response policies:The South Island Public Service District (PSD) Reclaimed Water Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices. Accidental release prevention is a function of the safety devices (technology) inherent in the facility design, safe material handling practices used (procedures) and commitment to training of plant employees (management practices). All applicable requirements of the U.S. Environmental Protection Agency (EPA) Risk Management Prevention Program (40 CFR 68.65-87) are adhered to. It is a goal of the South Island PSD Reclaimed Water Plant to ensure plant and community safety through an aggressive program of hazard analysis, preventive maintenance, equipment testing, standard operating procedures, and employee training.\n\n\n\nThe South Island PSD Reclaimed Water Plant emergency response policy involves the preparation of an emergency preparedness plan which is tailored to the facility and to the emergency response services available in the community. The emergency preparedness program includes procedures for notification of the Beaufort County HAZMAT Team (off-site mutual aid response), Beaufort County LEPC (community response plan), and SCDHEC (state response plan). The South Island PSD Reclaimed Water Plant emergency preparedness program is based upon recommendations of the Water Environment Federation (WEF), Compressed Gas Association, and the Chlorine Institute and is in compliance with the EPA Risk Management Emergency Respons Program (40 CFR 68.90) requirements.\n\n\n\n2. Stationary source and regulated substances handled:The regulated substances handled and used at the South Island PSD Reclaimed Water Plant are chlorine and sulfur dioxide. The maximum intended inventory of chlorine at the facility at any time is 20,000 pounds. The maximum intended inventory of sulfur di"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078518,
      "SummaryText": "oxide at the facility at any time is 6,000 pounds\n\n\n\nThe South Island PSD Reclaimed Water Plant provides biological treatment for sanitary wastewater collected from throughout the South Island service area. Chlorine is used at the reclaimed water treatment process to destroy nuisance and pathogenic microorganisms present in the wastewater (i.e., chlorine use as a wastewater disinfectant is an industry standard.) The chlorination process includes chlorine container handling and storage facilities, chlorine feed system (piping, vacuum chlorinators, and injectors), and related safety equipment and instrumentation. Sulfur dioxide is used in the reclaimed water treatment process to remove residual chlorine from the treated wastewater prior to discharge from the plant (i.e., sulfur dioxide use to dechlorinate treated wastewater is an industry standard). The dechlorination process includes sulfur dioxide container handling and storage facilities, sulfur dioxide feed system (piping, vacuum sulfonators, and injectors), and related safety equipment and instrumentation. The South Island PSD Reclaimed Water Plant is manned 12-hours a day and access to the plant is restricted to authorized personnel.\n\n\n\n3.  General accidental release program and the chemical-specific prevention steps:\n\nThe South Island PSD Reclaimed Water Plant complies with EPA's RMP rule, OSHA's Process Safety Management standard (20 CFR 1910.119), and with all applicable state and local codes and regulations. The chlorination and dechlorination processes were constructed, and are operated, in accordance with recommendations of the WEF, Compressed Gas Association, and Chlorine Institute. The South Island PSD Reclaimed Water Plant accidental release prevention program is based on the following key elements:\n\na.  High level of training for operators and maintenance personnel.\n\nb.  Equipment inspection, testing, and preventive maintenance.\n\nc.  Use of \"industry standard\" process and safety equipment\n\nd.  Use of a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078518,
      "SummaryText": "ccurate and effective operating procedures\n\ne.  Performance of hazard review of equipment and procedures\n\nf.  Implementation of an internal and external auditing program\n\ng.  Segregation of chemical processes for compatibility and fire prevention/control\n\nh.  Chlorine and sulfur dioxide leak detectors and alarm systems\n\ni.  Availability of chlorine and sulfur dioxide container leak repair kits\n\nj.  Approved parts inventory.\n\n\n\n4.  Five-year accident history:\n\nThe South Island PSD Reclaimed Water Plant has an excellent record of preventing accidental releases over the past five years. Due to the effectiveness of the release prevention program, there have been no accidental releases of chlorine or sulfur dioxide during the past five years.\n\n\n\n5.  Emergency Response Program:\n\nThe South Island PSD Reclaimed Water Plant has an emergency preparedness plan that is integrated with the LEPC plan. The South Island PSD Reclaimed Water Plant maintains a mutual aid agreement with the Beaufort County HAZMAT Team to provide emergency response services in the event of a chlorine or sulfur dioxide release. Emergency response exercises are conducted on a routine basis. The plant emergency preparedness plan includes procedures for the notification of offsite mutual aid responders, LEPC, SCDHEC, and the public along with a discussion of actions to be taken in the event of a chlorine or sulfur dioxide release. The plan also addresses first aid and medical treatment.\n\n\n\n6.  Planned changes to improve safety:\n\nThe lastest chlorination and dechlorination Process Hazard Analysis (PHA) updates were performed in April 2016 and they resulted in no recommended process or operational changes. A PSM compliance audit was conducted in April 2017 and it resulted in no recommended changes."
    }
  ]
}