{
  "FacilityID": 1000065019,
  "FacilityName": "Brems",
  "FacilityStr1": "2451 North Peabody Street",
  "FacilityStr2": null,
  "FacilityCity": "Knox",
  "FacilityState": "IN",
  "FacilityZipCode": "46534",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "18149",
  "LEPC": "Starke County LEPC",
  "FacilityLatDecDegs": "41.338722",
  "FacilityLongDecDegs": "-086.696417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "vbrown@starkecountycoop.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Stake County Farm Bureau Cooperative Assn., Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Starke County Farm  Bureau Co-op",
  "OperatorStr1": "2451 North Peabody Street",
  "OperatorStr2": null,
  "OperatorCity": "Knox",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46534",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael W Williams",
  "RMPTitle": "Safety & Risk Coordinator",
  "FTE": 15,
  "OtherEPAFacilityID": "ind985085281",
  "EPAFacilityID": "100000096166",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-07-12 00:00:00",
  "SafetyInspectionBy": "Co-Alliance, LLP Safety  Risk Management Departmen",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-08-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-08-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-08-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-08-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.34043,
  "FRS_Long": -86.69488,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000081555,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000065019,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000082797,
          "ProcessID": 1000081555,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000101563,
          "ProcessID": 1000081555,
          "ChemicalID": 56,
          "Quantity": 860000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000601563,
          "ProcessID": 1000081555,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000065019,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nSTARKE COUNTY CO-OP\n\nBREMS \n\n\n\n1. Accidental release prevention and emergency response policies:\n\n\n\nThis facility is a wholesale farm supply distribution center. We store and distribute a wide variety of pesticides and fertilizers including anhydrous ammonia. We are committed to the prevention of accidental releases of these products at our facilities.  It is necessary to observe certain safety precautions in handling anhydrous ammonia to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of the community. It is our policy to adhere to all applicable Federal and state rules and regulations. Safety depends upon the manner in which we handle anhydrous ammonia, combined with the safety devices inherent in the design of this facility combined with the safe handling procedures that we use and the training of our personnel.\n\n\n\nOur emergency response program for anhydrous ammonia is based on the OSHA standard 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\". The facility has a written emergency action plan, in accordance with OSHA Standard 29 CFR 1910.38; has provided state and local authorities the emergency planning and right-to-know information as required under SARA Title III (EPCRA); has coordinated response actions with the Knox  Fire Department, including pre-emergency planning and emergency training, and has verified that the County Emergency Plan includes the facility in the event of a release of regulated substances; and,  has  instructed employees on  procedures for notification of the local fire authority ( Knox Fire Department) and notification of any potentially affected neighbors. \n\n\n\n2. The stationary source and regulated substances handled.\n\n    \n\n The anhydrous ammonia storage and handling facility was updated to comply with the new Indiana State Ammonia Rules in 2003. Anhydrous ammonia is received by trucks and is stored in"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000065019,
      "SummaryText": " bulk and portable (nurse)  tanks. This   facility has equipment for unloading   transports and rail and equipment to load nurse tanks.. Access to the site is restricted to authorized facility employees, authorized management personnel, customers, and authorized contractors. \n\n\n\n3. The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and\n\nmitigation measures to limit the distances for each reported scenario.\n\n\n\n     Worst case Scenario: Release of the total contents of the largest tank (or the largest tank attached to a rail car) would be released as a gas over 10 minutes. According to RMP Comp modeling, this release (distance from point of dispersion to 200 ppm) would have off-site impact.\n\n      Alternative Release Scenario: According to RMP Comp modeling, this release (distance from point of dispersion to 200 ppm) would have off-site impact. \n\n\n\n4. The general accidental release prevention program and the specific prevention steps. \n\n\n\nThis distribution facility complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and\n\nregulations. The facility's  anhydrous ammonia plant has  implemented the OSHA standard 29 CFR 1910.111, \"Storage and Handling of Anhydrous Ammonia\"; periodic inspections by the Indiana State Chemists Office are also conducted. Employees involved in anhydrous ammonia activities are trained thoroughly by our Safety Coordinator, contractor and insurance companies, and industry experts; an annual formal refresher course (required by Indiana Law) as well as periodic training is also provided.  \n\n  The major hazards identified with anhydrous ammonia include toxic release, over pressurization,  overfilling, equipment failure, earthquake, and tornado. Process controls, such as relief valves, check valves, manual shutoffs, Emergency shutoff valves, alarms and procedures, and excess flow devices are utilized to minimize the potential for release. \n\n  Mitigation sy"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000065019,
      "SummaryText": "stems available include a deluge or water curtain provided by the responding fire department in the event of a release which would \"knock down\" the vapor cloud and neutralize the ammonia. In addition,  passive mitigation systems limiting the filling of tanks to 85% capacity (through tank gauges and onsite personnel) are utilized.\n\n  Employees are trained on an initial and ongoing basis. Employee Training is provided as well as periodic refresher training available from our Safety Coordinator, industry seminars, and vendor programs. Competency is measured through written and oral testing, demonstration (hands-on), and observation.\n\n   Maintenance programs are in place. Items are replaced if they fail, present a risk to the user, are required by law or standard, are out-of-date,  or if a system or process is changed or upgraded. OSHA 1910.111 standards and Indiana State Ammonia Rules are used to identify those needs. The Indiana State Chemist also makes periodic unannounced visits to our facility to inspect equipment, tanks, and safety training (they do not always leave documentation). In addition, employees utilizing the equipment on a nearly daily basis informally inspect the equipment for leaks, cracks, soundness, etc.\n\n\n\n\n\n5. Five-year accident history. \n\n\n\nStarke County Co-op, Brems Agronomy had a release of Anhydrous Ammonia on 4/19/2009.  The release occured when an employee was pulling away from the riser and caught the fill hose in the wheel assembly of the Anhydrous Ammonia Riser.  The release amounted to 8,000 pounds of Anhydrous and lasted approximately 22 minutes.  The Know Fire Department as well as employees from the facility were able to get the equipment shut down.  There were no injuries in this incident.  Since the release management at Brems Agronomy have worked to redesign the setup of the riser as well as, are in the process of adding at least two more emergency shutoff's to the existing pneumatic system.\n\n\n\n\n\n6. The emergency response program.\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000065019,
      "SummaryText": "\n\nThis facility has an emergency action plan, in accordance with OSHA standard 1910.38. We have  coordinated response actions with the Knox fire department, including pre-emergency planning and emergency training. We have discussed this program with the\n\n County Local Emergency Planning Committee, and our  facility is included in the county emergency plan. In the event of a release of regulated substances, our employees have been instructed on the  procedures for notification of the local fire authority Knox fire department, emergency personnel,  and notification of any potentially affected neighbors. \n\n\n\n\n\n\n\n7. Planned changes to improve safety.\n\n\n\nAt his facility, safety improvement is an ongoing process.  Periodic evaluations are performed to assess the maintenance of safe conditions. This facility is  in compliance with the OSHA 29 CFR 1910.111 standard and the Indiana State Ammonia Law, enforced by the Indiana State Chemist.  Updates or improvements are constantly occurring. ."
    }
  ]
}