{
  "FacilityID": 1000009607,
  "FacilityName": "Pastoria Energy Facility",
  "FacilityStr1": "39789 Edmonston Plant Road",
  "FacilityStr2": null,
  "FacilityCity": "Lebec",
  "FacilityState": "CA",
  "FacilityZipCode": "93243",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "34.950111",
  "FacilityLongDecDegs": "-118.833528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.calpine.com",
  "FacilityEmailAddress": "bmcbride@calpine.com",
  "FacilityDUNS": 112710876,
  "ParentCompanyName": "Calpine",
  "Company2Name": null,
  "CompanyDUNS": 109464888,
  "Company2DUNS": 0,
  "OperatorName": "Pastoria Energy Facility, LLC",
  "OperatorStr1": "P.O. Box 866",
  "OperatorStr2": null,
  "OperatorCity": "Lebec",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93243",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Rinehart",
  "RMPTitle": "Plant Manager",
  "FTE": 28,
  "OtherEPAFacilityID": "CAR000099812",
  "EPAFacilityID": "100000188664",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "S-3636",
  "SafetyInspectionDate": "2008-06-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000011295,
      "AltID": "Ammonia System",
      "FacilityID": 1000009607,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011677,
          "ProcessID": 1000011295,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012883,
          "ProcessID": 1000011295,
          "ChemicalID": 56,
          "Quantity": 126525.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512883,
          "ProcessID": 1000011295,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009607,
      "SummaryText": "1. Accidental release prevention and emergency response policies:\n\nPastoria Energy Facility (PEF) employees are committed to conducting their operation in a safe and responsible manner.  They conduct operations in compliance with applicable industry standards, Cal-OSHA's Process Safety Management Standard and EPA's Chemical Accident Prevention Provisions. PEF personnel are trained and prepared to respond to operational emergencies safely and effectively, minimizing the risk to personnel, the public, and the community-at-large. They ensure that their emergency response plans and capabilities are compatible with the local emergency response agencies.\n\n2. The facility and regulated substances handled:\n\nThe Pastoria Energy Facility is approximately 40 acres in size and is located approximately 30 miles south of Bakersfield, California and six miles east of I-5. PEF produce as much as 750 megawatts of electric power using three natural gas-fueled combustion turbines in concert with two steam turbines. Hot exhaust gases are recycled to generate steam, which is used to generate additional power in two steam turbines. This configuration makes the facility as much as forty percent more efficient than most existing gas-fired power plants.  In addition to relying exclusively upon clean natural gas, PEF is equipped with advanced emissions control systems to significantly reduce emissions. \n\nAmmonia is used to reduce the nitrogen oxide emissions, which improves air quality.  The emissions control operations include two 30,000 gallon storage tanks that each contain a maximum of 24,000 gallons of anhydrous ammonia [Note: A maximum fill of 24,000 gallons is 80% of tank capacity which is the administrative control that PEF has instituted in their procedures].   \n\nThe anhydrous ammonia is delivered to the site by truck. Anhydrous ammonia is transferred from the truck to the storage tank by means of a truck-mounted pump. Liquid anhydrous ammonia (99.5 to 99.7 percent concentration) is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009607,
      "SummaryText": " maintained in the storage tanks that are allowed to follow ambient air temperature. Tank pressure corresponds to saturated ammonia conditions at tank temperature. During periods of low ambient temperature where the ammonia tank pressure drops below the required ammonia vapor supply pressure, an electric vaporizer is used to maintain sufficient tank pressure to meet the required delivery pressure. \n\nFrom the storage tanks, ammonia vapor is delivered by tank pressure to each combustion turbine unit via pipeline. The regulated ammonia vapor supply from the storage tank is mixed with air provided by air blowers on the ammonia dilution skid next to each combustion turbine. The ammonia/air mixture is forwarded to the ammonia injection grid located in the combustion turbine's hot gas exhaust stream upstream of the catalyst module in the Heat Recovery Steam Generator (NOx reduction process).\n\n3. Accidental release prevention program:\n\nThe facility's accidental release prevention program is modeled after and in compliance with federal and State programs for managing hazardous chemical processes. It meets the requirements of Cal-OSHA's Process Safety Management standard, EPA's Chemical Accident Prevention Provisions, and the California Accidental Release Prevention Program (CalARP).\n\nSpecific elements of the program include: Employee Participation, Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Contractor Safety, Contractor and Visitor Orientation, Pre-Job Startup Review, Mechanical Integrity, Code of Safe Practices, Management of Change, Incident Investigation, Emergency Planning and Response, and Compliance Audits.\n\nSpecific accident prevention steps include the following programs, procedures, and practices:\no Initial and annual training in PSM;\no Integrity testing and inspection of process equipment/piping;\no Employee participation in the MOC process and PHA;\no Unrestricted access to process safety information by employees and contrac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009607,
      "SummaryText": "tors;\no Operator training program which includes initial, on the job training, and refresher training and demonstration of competency;\no Hot Work Permit procedure;\no Confined Space Entry procedure;\no Lockout/Tagout/Try Procedure;\no Code of Safe Work Practices;\no Respiratory Protection Program\no HAZCOM program;\no Procedure for opening process equipment and piping;\no Controlled/limited access to facility and process areas;\no Periodic training on selected health, safety, and environmental topics;\no Emergency Action & Response Plan for all plant personnel;  \no Contractor Safety Selection and Monitoring Policy.\n\n4. The five-year accident history:\n\nPEF has had no reportable accidents or incidences that resulted in injury, environmental damage, or off-site impact related to the ammonia system/process.\n\n5. The emergency response program:\n\nThe emergency response program/plan is written and posted in each office of the Administration Building and in a dedicated binder located in Control Room. The plan describes the evacuation procedures, the emergency actions to take, individual responsibilities during an emergency, and the appropriate notifications and contacts to make for specific types of emergency events.  Plant evacuations are initiated by activating an audible signal, and communications through employee radios. The plan is reviewed and coordinated with the Kern County Fire Department on a periodic basis.\n\nEmergency Action and Response training is conducted at least annually with all PEF employees. Training includes the specific responsibilities and duties that each PEF employee should take in the event of an emergency. Training will also include coordination, involvement and emergency drill exercises with local emergency responder (Kern County Fire Department and Hazardous Materials Division, and the Hazardous Material Contractor selected by PEF.\n\nMaintenance and testing of the emergency equipment is scheduled in the facility's computerized maintenance management system"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009607,
      "SummaryText": " and performed by the maintenance personnel at the appropriate interval.  \n\nIn addition, PEF's ammonia system also includes area sensors for the detection of ammonia leaks, a manually activated deluge system over the ammonia storage tanks with secondary containment and area fire water monitors. \n\n6. Planned changes to improve safety:\n\nPlanned changes to improve safety include implementing PHA recommendations and continuing the effort to review/update the facility's RMP and PSM programs and operating procedures. \n\nA brief summary of PHA recommended action items include, but not limited to, the following:\no Continue to follow facility procedures and training for Operators and Contractors.\no Continue to maintain all PSVs and systems in accordance with facility procedures and manufacturing recommendations.  "
    }
  ]
}