{
  "FacilityID": 1000081064,
  "FacilityName": "Monocacy Water Treatment Plant",
  "FacilityStr1": "1950 North Market St",
  "FacilityStr2": null,
  "FacilityCity": "Frederick",
  "FacilityState": "MD",
  "FacilityZipCode": "21701",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24021",
  "LEPC": "County Emergency Service Dpt.",
  "FacilityLatDecDegs": "39.445151",
  "FacilityLongDecDegs": "-077.391241",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cityoffrederick.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Frederick, MD",
  "Company2Name": null,
  "CompanyDUNS": 74927054,
  "Company2DUNS": null,
  "OperatorName": "City of Frederick",
  "OperatorStr1": "101 North Court",
  "OperatorStr2": null,
  "OperatorCity": "Frederick",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21701",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000120255",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-09-18 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-04-08 08:27:57",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-04-08 08:27:57",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-04-08 08:27:57",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-04-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.445151,
  "FRS_Long": -77.391241,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101347,
      "AltID": "Chlorination Water Treatm",
      "FacilityID": 1000081064,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126999,
          "ProcessID": 1000101347,
          "ChemicalID": 62,
          "Quantity": 6300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000102609,
          "ProcessID": 1000101347,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000085583,
              "Process_NAICS_ID": 1000102609,
              "SafetyReviewDate": "2017-03-11 00:00:00",
              "PHA_Date": "2018-02-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-03-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Sabotage or Terrorist Attack",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Fusible plugs relieve pressure / heat; tied to SCADA for alarms, etc.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Other than delivery full 150 lb cylinders are kept in an enclosed room.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "To install emergency vent scrubber, revise piping and add emergency Generator in 2/2018.",
              "OpProceduresReviewDate": "2017-03-11 00:00:00",
              "TrainingReviewDate": "2017-03-11 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Operating staff have to be certified water treatment operators.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-03-11 00:00:00",
              "EquipmentInspectionDate": "2017-04-11 00:00:00",
              "EquipmentTested": "chlorination system, weekly checks",
              "ChangeMgmtDate": "2018-09-07 00:00:00",
              "ChangeMgmtReviewDate": "2017-03-11 00:00:00",
              "PreStartupReviewDate": "2017-12-09 00:00:00",
              "ComplianceAuditDate": "2017-12-09 00:00:00",
              "AuditCompletionDate": "2019-03-30 00:00:00",
              "IncidentInvestigationDate": "2005-02-13 00:00:00",
              "InvestigationChangeDate": "2005-06-30 00:00:00",
              "ParticipationPlansReviewDate": "2017-03-11 00:00:00",
              "HotWorkPermitReviewDate": "2017-03-11 00:00:00",
              "ContractorSafetyReviewDate": "2017-03-28 00:00:00",
              "ContractorSafetyEvalDate": "2017-03-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000106764,
                  "PreventionProgram3ID": 1000085583,
                  "ProcessChemicalID": 1000126999
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081064,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-03-11 00:00:00",
    "ERTrainingDate": "1017-03-28 00:00:00",
    "CoordinatingAgencyName": "Frederick Co Div Fire-Rescue",
    "CoordinatingAgencyPhone": "3016001536",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Maryland Department of Environmental Protection"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000081064,
      "SummaryText": "ease 150 lbs. from a single cylinder\r\n¿\tUrban surroundings (many obstacles in the immediate area)\r\n¿\t30 minute duration\r\n¿\tMitigation by enclosure, Storage Room\r\n¿\tActive mitigation by emergency vent scrubber\r\n¿\tWind speed three meters/second\r\n¿\tStability class D\r\n¿\tAir temperature 77° F\r\nThe toxic endpoint is *** miles and in the process safety information.  The residential population that would be impacted by this release is *** and is recorded in the process safety information.  Receptors in this area were identified as industrial areas, etc., (***Data is in PSI).\r\n\r\n4.  ACCIDENTAL RELEASE PREVENTION PROGRAM (D)\r\nThe City of Frederick accidental release prevention program is based on OSHA's PSM program and similar EPA's RMP Level 3 prevention program.  The PSM/RMP programs have been effectively used for many years.  They are part of the plant's operating culture.  There are two parts to the program.  The first is the overall Water Division-wide program and the Water Treatment Plant site program.  The second is the chlorine-specific actions within the site program.  Both are coordinated with the Frederick County Fire/Rescue Department (including the HazMat Team), the Fort Detrick HazMat Team and the Regional LEPC.\r\n\r\n4.1.  GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM (D) (1)\r\nPlant-wide, many elements of the prevention program are used for all operations.  An overview of the generally written programs is listed below:\r\nThe City of Frederick has detailed process safety information on each of its operations.\r\nThe document maintenance system is integral to the management of change for all operations on site control.  This system is computer based.  \r\nTraining is the backbone of employee knowledge, job operations and is ongoing in each area.  Employee training in operations and maintenance emphasizes awareness of the hazardous, toxic properties and effects of all chemicals used.  \r\nMaintenance and preventive maintenance are used for all operations making mechanical i"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000081064,
      "SummaryText": "ntegrity a part of each piece of equipment.  The maintenance program uses a computer based work order system for scheduled mechanical integrity as well as for unplanned repairs and maintenance.  \r\nIncident investigations of accidents and near-miss incidents ensure we learn from each event as well as correct the causes of the incident.  If there is a chlorine release, significant injury, property damage or an incident that could have catastrophic results, an investigating team is formed within 48 hours.  The team reviews the incident, and a report is drafted that defines the findings and resolution of the occurrence.  \r\nEmployees participate in all aspects of the plant as listed below under Emergency Response.  Employees are also Safety Committee Members, Process Hazards Review Members, Accident Investigation Team Members, and assist in the development of the various P&Ps. \r\nSafe work practices are used throughout the facility including: 1) Hot Work Permits, 2) Lockout/Tagout Permits, 3) Vessel Entry Permits, 4) Site Security, and 5) Breaking Into Chemical Lines.\r\nContractors must meet The City of Frederick's high safety and technical standards as part of selection and ongoing evaluations.  In addition, City of Frederick demands training of contractors to its standards.\r\n\r\n4.2.  CHLORINE SPECIFIC RESPONSE PROGRAM (D) (2)\r\n\r\n4.2.1.  Chlorine-Specific Operating Safety Information\r\nChemical-specific prevention features of the plant include: the policies and procedures listed above and those of the chlorine specific program.  These include:\r\n\r\n4.2.2.  Specific procedures for the management of the chlorine process\r\nThere is a specific procedure for the completion of a Management of Change for all modified and/or new processes.  This is followed by completion of a Pre-startup Safety Review prior to startup of the modified or new chlorine system.  There are specific emergency response procedures for chlorine releases as outlined below under both operating procedures for sma"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000081064,
      "SummaryText": "ll releases and in the emergency response procedures for large releases.  See the Emergency Response Program manual.  There is specific training in the properties, hazards, handling requirements, and leak repair for chlorine.  Finally, the details of both facility and equipment design are key in the operations manual of the chlorine system.\r\n\r\n4.2.3.  Facility Design\r\nThe plant includes a combined chlorine storage feed room/control room which meet and exceed design codes standards and good engineering practices.  The storage area/control building room is equipped with an emergency vent scrubber also an exhaust fan ventilation system.  There is a chlorine area monitor inside the room.  If chlorine is detected, the monitor alarms and a flashing red light illuminates as well as in the water plant control room.  The alarm system stops the vent system and starts the emergency vent scrubber.  All of these systems are tied into the emergency generator and supervisory control and data acquisition (SCADA) system which also alerts management.\r\n\r\n4.2.4.  Equipment Design\r\nThere are two types of chlorine pipe systems, high pressure and low (vacuum) pressure.  The high pressure chlorine cylinder piping system consists of a yoke and chlorine gas vacuum check regulator on each of the six 150 lb. cylinders.  Chlorine under vacuum pressure enters a flexible tube connects from each cylinder gas vacuum check regulator to the header that has a main block valve.  These parts are made of anhydrous (elemental) chlorine compatible materials; steel, copper or chlorine compatible non-metallic compound (not corroded by chlorine) rated to 500 psig.  The maximum pressure of the chlorine in the high pressure system is 150 psig, giving a three-to-one safety factor.  There are six 150-pound cylinders in a single bank and each bank feeds one of three gas chlorinator and unit injectors.   There is another bank of six 150-pound cylinders on standby.  Each cylinder has a fusible plug to release pressu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081064,
      "SummaryText": "tment plant operations and RMP Program implementation.  The attached City organization chart defines the RMP program lines of authority.  This program, along with other City-wide and plant-specific policies, eliminates and/or reduces the likelihood and severity of a hazardous chemical release at the plant.  \r\n\r\n1.3.  PREVENTION PROGRAM LEVEL 3 (A) (2)\r\nThe City of Frederick maintains policies, procedures and systems as part of their prevention program.  These are applied to each treatment plant and specifically the Monocacy Water Treatment Plant.  The program address each of the EPA's, RMP Level 3 Program-listed 12 elements needed to implement the program, and the like elements in place in the plant's OSHA PSM program.  The City is in compliance with both.  These documents are maintained and implemented by City of Frederick's Water Treatment Superintendent and by the City's Manager of Risk, Safety, and Compliance.  \r\n\r\n2.  STATIONARY SOURCE AND REGULATED SUBSTANCE\r\nThe City of Frederick Monocacy Water Treatment Plant employs ten (10) full-time employees engaged in water treatment plant and field operations.  Chlorine is used as part of the water disinfection treatment process.\r\n\r\n2.1. SITE DESCRIPTION (B) (1)\r\nThe site is owned and operated by The City of Frederick and managed by its Public Works Department.  The site is located at 1950 North Market Street, Frederick, Frederick County, Maryland.  The site is located in an industrial area on North Market Street.\r\nThe plant includes a separate combined chlorine storage feed room/control room which also houses the injection feed distribution system.  The chlorinated water from the injectors feeds various points in the plant.  \r\nChlorinated water beyond the chlorine control room is outside of the boundaries of this RMP process.  The boundaries of the chlorine system subject to the RMP regulation include: full or in use 150-pound cylinders in the Chlorine Storage Feed Control/Chlorination Control Room.  Also included are"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081064,
      "SummaryText": "all associated safety equipment including the 2019 installed emergency vent scrubber as well as vent makeup air, exhaust systems and chlorine injection units in the area that supports the system.  It also includes the empty cylinder storage on the dock in front of the Chlorination Room.  These are detailed in the Process and Instrument Drawings (P&ID) which are part of the plant Process Safety Information (PSI).  All drawings are maintained in the plant's PSM/RMP Process Safety Information.\r\n\r\n2.2. REGULATED SUBSTANCE (B) (2)\r\nChlorine is the only regulated substance on-site which exceeds the EPA 40 CFR-68 rule threshold quantity of 2,500 pounds.  The City of Frederick chlorine process was installed as part of the process of disinfecting and purifying water for public consumption.  It operates under permit from the State of Maryland, Maryland Department of the Environment (MDE).\r\nThe chlorine is received and stored in 150-pound cylinders.  Six cylinders are in the in-use bank and another six are in the stand by bank.  Each cylinder has a chlorine vacuum check regulator mounted on it.  The vacuum lines from these six units are manifolded into a bank.  There two banks, one on-line the other on standby.  The on-line bank feeds chlorine to three process control systems.  The chlorine from the cylinder's chlorinator is drawn into the injectors by high pressure water flow.  The resultant chlorinated water flows into the plant's water system which is outside the regulated systems boundaries.\r\n\r\nChlorine is an EPA and OSHA-listed toxic chemical.  It is an irritant and corrosive.  Chlorine is a halogen with the formula CL2.  Chlorine is an oxidizing agent that is non-flammable.  It has a one ppm OSHA ceiling (15-minute) permissible exposure limit (PEL) and a NFPA health rating of 4, severe.  The immediate dangerous health (IDLH) level is 10 ppm and a lethal concentration (LC-5O) is 250 ppm.  Chlorine is not a carcinogen.\r\nThe maximum threshold quantity stored on site is twe"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000081064,
      "SummaryText": "Contingency Plan procedures detail the actions and responses to chlorine spills (releases).  The plan includes training of all chlorine-area operators, mechanics and staff.  All operators and mechanics are trained to the EPA HazMat Operations Level for stopping of small leaks.  The primary response team includes the Frederick County Fire and Rescue, and Frederick County HazMat Teams.  All of these respond to severe chlorine leak situations.  Actions include response to catastrophic, severe, and moderate leaks.  A Chlorine A Leak Repair Kit is maintained at the chlorine storage area to aid in stopping of cylinder leaks.  Public notification is facilitated through the City Police and County Sheriff's Office, which has an automated emergency dialing message system for public notification.\r\n\r\n7.  PERSONNEL (F) (1)\r\nPersonnel are the key resource of the City of Frederick's prevention program.  City employees make up the operators and emergency first response teams.  The City of Frederick fosters a high level of involvement in every aspect of the chlorine system operations including participation in:\r\n¿\tAccident/Incident Investigation Team\r\n¿\tPSM/RMP safety teams\r\n¿\tDevelopment of the operation procedures\r\n¿\tHazard evaluations\r\n¿\tProcess Hazards Analysis\r\n¿\tOn-going training of the operators and other involved staff\r\n\r\n8.  CHANGES TO IMPROVE SAFETY (G)\r\nChanges to improve safety are in progress.  These include installation of an emergency backup generator, an emergency scrubber, chlorine cylinder pipe configurations and upgrade of the normal ventilations system.  During the PHA these were reviewed.  Also, recommended actions were identified in the internal safety HazOp and audit of the RMP program to meet requirements of the Risk Management Prevention Program.  These recommended actions have to be evaluated and implemented as required.  Audits were conducted to review the RMP program in 1999, April 2005, May 2010, August 2014 and December 2017.  The key safety action it"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000081064,
      "SummaryText": "ems were completed.  Additional video monitoring cameras were added to our surveillance system.  The City of Frederick continually reviews implemented operating procedures for potential safety improvements for all of its operations.  Currently, the City of Frederick management team and process safety team are reviewing potential upgrades to the existing design of the chlorine operations to make the system even safer to prevent a release and minimize consequences in the event of a release of chlorine.\r\nThe City of Frederick Water Treatment Plants compiled the EPA/OSHA-required Vulnerability Assessment (VA).  Recommendations from the VA Report improve site security and safety overall including that of the chlorine system.  The city will conduct a Risk and Resilience Survey for each of its four water treatment plants as required by the EPA's 2018, America's Water Infrastructure Act."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081064,
      "SummaryText": "CITY OF FREDERICK, EPA # 100000120255\r\nFREDERICK MONOCACY WATER TREATMENT PLANT\r\nRISK MANAGEMENT PROGRAM RE-SUBMITTAL\r\n\r\nEXECUTIVE SUMMARY\r\n\r\n1.  EXECUTIVE SUMMARY INTRODUCTION 68.155\r\n\r\nThe City of Frederick's Water Treatment Department operates the Monocacy Water Treatment Plant at 1950 North Market Street, Frederick, Frederick County, Maryland.  This plant is one of four water plants operated by the City.  The City also operates one wastewater treatment plant.  The Monocacy Water Treatment Plant as well as the Linganore Water Treatment Plant has quantities of regulated hazardous chemicals above the EPA threshold.  The City has a unified Risk Management Program which applies to each plant.  Only the Monocacy Water Treatment Plant operations and policies are presented in this Plan.  The plant is undergoing major changes and safety upgrades and has been under construction since September 2017 when all chlorine was removed from the plant. The anticipated introduction of chlorine and startup date is set for spring 2021.\r\n\r\n1.1. ACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE POLICIES (A)\r\nThe City of Frederick Water Treatment Plant accidental release prevention policy involves a unified approach that integrates technologies, procedures, training and management practices.  The plant prevention program complies with all applicable procedures of the U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) 40 CFR-68 Prevention Program as well as Occupational Health and Safety Administration (OSHA) 27-CFR-1910-119 under the Clean Air Act Amendments of 1990.\r\n\r\n1.2. MANAGEMENT SYSTEMS (A) (1)\r\nThe City of Frederick has a management system in place which is lead by the City's Mayor, who delegates implementation and on-going use of the RMP elements to the Deputy Director of Public Works for Engineering and Operations.  The Deputy Director delegates the RMP program to the Assistant Deputy Director of Operations - Utilities who has responsibility for water trea"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000081064,
      "SummaryText": "re if the cylinder temperature is over 155 to 160 degrees Fahrenheit.\r\nThe low pressure system operates under a vacuum pressure to 13 inches of mercury.  A pressure relief valve is in each to the vacuum check regulator.  The valve vents if the pressure in the line reaches over several inches of water pressure.  All the pipes, tubes, and equipment are also chlorine compatible.  The system is designed to complete vacuum giving it a large safety factor over the typical vacuum (negative) pressure in it.  .\r\n\r\n5.  FIVE YEAR ACCIDENT HISTORY (E)\r\nThe plant has been chlorine reportable and release free since 1992 to the present, 27 years as defined by 40 CFR-68.\r\n\r\n6.  EMERGENCY RESPONSE PROGRAM (F)\r\nEmergency response procedures are contained in both the Plant Emergency Response Policy and City Emergency Response Plan which is coordinated with the Frederick County Contingency Plan (Emergency Response Plan).  The plan includes an emergency response decision tree and a notification plan.  The Plant also has site-specific emergency actions for small and large (reportable) releases defined in the operating procedures and Emergency Response Plan.  Emergency response drills and evacuation drills are conducted annually by the operating department.  Emergency operation and response procedures are also reviewed annually.\r\nThe emergency response program (contingency plan) is coordinated (reviewed by) with the water plant Safety Committee, the City Fire and Police Departments.  The Water Plant and Fire Department coordinates with Local Frederick County Emergency Response Planning Committee (LEPC) and the Frederick County HazMat Team and the Fort Detrick HazMat team.  All are located in Frederick County, Maryland.  Copies of the program are given to key local agencies including: fire, medical, rescue, management, and police departments.  Besides the specific of the prevention programs, they are incorporated in the operating culture of the City water plant.\r\nThe Emergency Response or"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081064,
      "SummaryText": "nty-four (36) cylinders of 150 lbs. each.  This equals 5,400 pounds.  \r\n\r\n3.  HAZARD ASSESSMENT\r\nA hazard assessment was performed in March 2017 to determine the effects a release would have on the plant, the public and environmental receptors surrounding the plant.  The tobe installed chlorine emergence vent scrubber, the revised chlorine cylinder control system and the new emergency generator were included in the March PHA.  For chlorine, the distance to the endpoint concentration of the gas was determined.  In addition, an estimate of the population that could be affected by a release of chlorine was determined, and sensitive receptors such as hospitals, schools, and nursing homes were identified.  The hazard assessment considers two release scenarios; a worst case and an alternative case.  The City maintains a Five-Year Accident History for the WTP chlorine system (see Section 4 below; five-year accident history.\r\n\r\nTwo offsite consequence analyses were conducted.  The first is a worst case release.  The second is a more probable alternative release scenario.  The first scenario is defined by EPA, which states that the operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes due to an unspecified failure.  The alternative scenario is defined as more likely to occur than the worst-case scenario.  It was define during the most recent, 2017 Process Hazards Analysis Team members.\r\nAtmospheric dispersion modeling was performed to determine the distance traveled by the chlorine released before its concentration decreases to the toxic endpoint.  The EPA specified endpoint for chlorine is 0.0087 mg/l which equals three ppm.  The three ppm endpoint is the Emergency Response Planning Guideline Level 2 (ERPG- 2).  This is defined by the American Industrial Hygiene Association (AIHA) as the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081064,
      "SummaryText": "without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.  The residential population within a circle with a radius corresponding to the toxic endpoint distance was defined to estimate the population potentially affected.\r\n\r\n3.1.  WORST CASE (C) (1)\r\nAtmospheric dispersion modeling for the worst case scenario was performed using the EPA assumptions and EPA's RMP Comp air dispersion program.  Data and assumptions used were:\r\n¿\tLargest single container size 150 lbs.\r\n¿\tA gas is liquefied under pressure\r\n¿\tCylinder release of 150 lbs.\r\n¿\tDuration of release is 10 minutes\r\n¿\tNo passive mitigation measure\r\n¿\tTopography:  urban surroundings (many structures in area)\r\n¿\tWind speed 1-5 meters/second\r\n¿\tStability Class F\r\n¿\tAir temperature 77 degrees F\r\nResults demonstrate a distance to the toxic endpoint of *** miles containing *** square miles of area assuming an urban topography without an enclosure.  The residential population that could potentially be affected by the release is *** individuals based on the U.  S.  Census 2010 demographic data.  There are residences and other receptor sites included in that release area (schools, commercial facilities and parks) (*** data is in PSI).\r\n\r\n3.2.  ALTERNATIVE CASE (C) (2)\r\nThe alternative release scenario involves the failure of one 150-pound cylinder.  This failure was defined during the recent, 2017 Process Hazards Analysis.  This failure is equal to creating a 0.01 square inch hole in the cylinder below the liquid level.  Modeling using the EPA/RMP Comp and EPA's guidance demonstrated the rate of chlorine release is 31.7 lbs. per minute for a period of 6 minutes releasing a total of 150 pounds of chlorine from one container.  The toxic endpoint distance was determined using the following assumptions:\r\n¿\tLargest single contains size 150 lbs.\r\n¿\tA gas is liquefied under pressure\r\n¿\t31.7 lbs./min release\r\n¿\tQuantity rel"
    }
  ]
}