{
  "FacilityID": 1000055258,
  "FacilityName": "APS, LLC",
  "FacilityStr1": "40 Herman Melville Blvd",
  "FacilityStr2": null,
  "FacilityCity": "New Bedford",
  "FacilityState": "MA",
  "FacilityZipCode": "02740",
  "Facility4DigitZipExt": "2087",
  "FacilityCountyFIPS": "25005",
  "LEPC": "SouthCoast REPC",
  "FacilityLatDecDegs": "41.640066",
  "FacilityLongDecDegs": "-070.923529",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.highlinerfoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 143532203,
  "ParentCompanyName": "High Liner Foods USA, Inc",
  "Company2Name": null,
  "CompanyDUNS": 1110055,
  "Company2DUNS": 0,
  "OperatorName": "APS, LLC",
  "OperatorStr1": "40 Herman Melville Blvd",
  "OperatorStr2": null,
  "OperatorCity": "New Bedford",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02740",
  "OperatorZipCodeExt": "2087",
  "RMPContact": "Erika Pouliot",
  "RMPTitle": "EH&S Manager",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173965",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-01-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-09 00:00:00",
  "ErrorReportDate": "2007-06-19 00:00:00",
  "ReceiptDate": "2016-02-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-02-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-02-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.63889,
  "FRS_Long": -70.92111,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000069146,
      "AltID": "Seafood Processing",
      "FacilityID": 1000055258,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000070308,
          "ProcessID": 1000069146,
          "NAICSCode": "31171",
          "_desc": {
            "NAICS_CODE": "31171",
            "NAICS_DESCRIPTION": "Seafood Product Preparation and Packaging"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000085313,
          "ProcessID": 1000069146,
          "ChemicalID": 56,
          "Quantity": 28900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000585313,
          "ProcessID": 1000069146,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055258,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT YOUR FACILITY\n\nIt is APS's policy to adhere to all applicable federal, State, and local laws.  The ammonia refrigeration process at APS (process) has been designed and operates in compliance with EPA's Accidental Release Prevention Rule, and applicable State and local codes and regulations. APS has qualified engineering, operations, and maintenance personnel knowledgeable in the safe operation of ammonia refrigeration systems in direct responsibility of the process.  The process is also designed and operated in compliance with the Occupational Safety and Health Administration's Process Safety Management (OSHA-PSM) rule. \n\n\n\nThrough its Emergency Action Plan (i.e., Contingency Plan) as required under OSHA PSM, APS has emergency response procedures in place that comply with the Accidental Release Prevention Program (ARPP).\n\n\n\nA DESCRIPTION OF YOUR FACILITY AND THE REGULATED SUBSTANCES HANDLED\n\nAPS is a food processing facility primarily engaged in the preparation and packaging of seafood products.  The facility has a maximum inventory capacity of 28,900 pounds of anhydrous ammonia within the process.  The ARPP applicability threshold for anhydrous ammonia is 10,000 pounds.  As APS's anhydrous ammonia storage capacity exceeds this threshold, the facility is subject to the program and is required to prepare a RMP for this process.  The anhydrous ammonia refrigeration system at APS is the only process that stores a substance in greater quantities than the ARPP applicability threshold.\n\n\n\nThe process is subject to Risk Management Program 3 because it is subject to OSHA-PSM provisions and it is not eligible for Program 1.\n\n\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe process is currently designed and maintained in compliance with American National Standards Institute / American Society of Heating, Refrigerating and Air-Conditioning Engine"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055258,
      "SummaryText": "ers guidance, and American Society of Mechanical Engineering (ASME) guidance.  Process verification takes place through design audits by trained personnel and/or certified consultants.  The schedule of such verifications is at least once every three years.\n\n\n\nAn off-site consequences analysis has been completed for the worst-case release scenario and an alternative release scenario to document the radius of impact (i.e., distance to toxic endpoint) for each scenario and the potential population, public receptors and environmental receptors that fall within the radius of impact for each scenario. \n\n\n\nPreventative maintenance (PM) is an active part of APS's daily operations.  PM is performed in accordance with OSHA-PSM and, in many cases; the process safety equipment PM schedule prescribed by APS exceeds recommended equipment maintenance schedules.  Ammonia detection sensors are present at twenty four locations and are tested every six months.  Relief valves are replaced by an ASME certified agent on a five-year schedule. \n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nIn the last five years there have been no federal reportable releases that caused death, injury, hospitalization or property damage.  In the last five years there was one release incident (by the prior owner and operator of the facility) that occurred in August 2009 and involved the mechanical failure of a valve which released approximately 100 pounds of ammonia.  No injuries resulted from the release.   \n\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nA process release would be detected by ammonia sensors located in process and perimeter locations.  A process release would also be detected by the employees through odor.  The ammonia sensors are tested quarterly.  An alarm signal is triggered and would sound throughout the facility.  An alarm system auto-dialer is also activated if ammonia is detected.\n\n\n\nIn the event of a process release, the alarm system auto-dialer calls the facility maintenance department, which would in turn c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055258,
      "SummaryText": "ontact the New Bedford Fire Department if any of the following conditions are present:\n\n\n\n?    Upon investigating the incident, APS determines that the release is severe enough to require response assistance; \n\n?    Reportable quantities of ammonia are released; and\n\n?    A potential for fire exists.\n\n\n\nThe Local Emergency Planning Committee (LEPC or New Bedford Fire Department) is trained and equipped to respond to ammonia releases at APS.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nA Process Hazard Analysis Update was conducted in 2013 and amended in January 2016.   The 2013 Update identified several areas where process improvements could improve the safety of the facility, including relief and ventilation system upgrades and updating of the existing preventative maintenance plan, which were completed in 2014.  The 2015 amendment was completed in conjunction with a revised Off-Site Consequence Analysis and involved updating of the Integrated Contingency Plan.\n\n\n\n"
    }
  ]
}