{
  "FacilityID": 1000024176,
  "FacilityName": "Hebert Trunk Station and Hebert Terminal",
  "FacilityStr1": "15645 West Port Arthur Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Beaumont",
  "FacilityState": "TX",
  "FacilityZipCode": "77705",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "29.984127",
  "FacilityLongDecDegs": "-94.060676",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sunoco Logistics Partners, LP",
  "Company2Name": null,
  "CompanyDUNS": 606086668,
  "Company2DUNS": 0,
  "OperatorName": "Sunoco Logistics Partners, LP",
  "OperatorStr1": "15645 West Port Arthur Road",
  "OperatorStr2": null,
  "OperatorCity": "Beaumont",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77705",
  "OperatorZipCodeExt": null,
  "RMPContact": "Foyce Winn",
  "RMPTitle": "Area Supervisor",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215402",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "4824500079",
  "SafetyInspectionDate": "2011-04-25 00:00:00",
  "SafetyInspectionBy": "Railroad Commission of Texas",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-10-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-10-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": null,
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-10-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-10-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029584,
      "AltID": null,
      "FacilityID": 1000024176,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029887,
          "ProcessID": 1000029584,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035509,
          "ProcessID": 1000029584,
          "ChemicalID": 118,
          "Quantity": 1405961.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000535509,
          "ProcessID": 1000029584,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024176,
      "SummaryText": "Sunoco Logistics Partners, LP. - Hebert Trunk Station and Hebert Terminal Butane Blending System was constructed in accordance with the National Fire Protection Association (NFPA Code) #58 (2011 Edition) for Liquefied Petroleum Gas Storage, and it is the facilitys' policy to adhere to all applicable federal, state and local laws/codes.  It is the intent of the Hebert Trunk Station and Terminal to incorporate the most recent construction and procedural guidance (NFPA # 58-2011 Edition) into this process.  If an emergency were to occur, it is the facilitys' policy to notify the Port Arthur Fire Department as well as the Jefferson County Office of Emergency Management and Homeland Security.  Medical emergencies will require notification of the local Emergency Medical Services (Southeast Texas EMS Ambulance Service) and Southeast Texas Medical Center.\n\n\n\nSunoco Logistics Partners, LP. - Hebert Trunk Station is a petroleum pipeline distribution facility that includes butane blending operations whereas the Terminal includes storage and truck distribution.  This Risk Management Plan (RMP) covers the butane blending system, including the associated piping and four (4) 84,000 gallon butane storage vessels. \n\n\n\nThe facility's worst case scenario is the failure of the system 84,000 gallon butane storage vessel when filled to the greatest amount allowed (85% fill shut-off with alarm at 80%) resulting in a vapor cloud explosion.  The facility's alternate (potential for off-site impacts) release scenario is a single vessel \"BLEVE\" accident and associated fireball.\n\n\n\nSunoco Logistics Partners, LP. - Hebert Trunk Station and Terminal comply with the U.S. Environmental Protection Agency's (EPA) Accident Prevention Rules (40 CFR Part 68 Subpart D), the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard (29 CFR Part 1910.119) along with its fourteen (14) compliance elements, and all applicable state and local laws and regulations.  The butan"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024176,
      "SummaryText": "e blending system is designed, constructed, and maintained in accordance with NFPA #58 and the manufacturer's (Sunoco Partners Butane Blending, LLC) specifications.\n\n\n\nAs this is a new system, this facility has never had an accident involving the butane process which has resulted in deaths, injuries, property/environmental damage, evacuations or sheltering in place.\n\n\n\nIn the event of an emergency involving the Sunoco Logistics Partners, LP. - Hebert Trunk Station and Terminal butane blending system, it is the policy of the facility to initially contact the Port Arthur Fire Department (Primary Responder, Station #3) and request their assistance.  The facility emergency response plans are coordinated with fire department and the Jefferson County Office of Emergency Management.  The Port Arthur Fire Department has participated in the initial RMP/PSM training session for this system.\n\n\n\nProcess safety controls include excess flow valves, low-melting point (<250oF) pneumatic valve feeds to pneumatic valves (fail closed), 85% fill shut-off (80% alarm and 90% ESD actuation) on the vessel, emergency shut-off devices on the system and video display terminal, line thermal/hydrostatic reliefs, grounding interlock devices, hydrocarbon detection and ESD tie-ins, and vessel pressure reliefs.  \n\n\n\nIn an effort to improve and promote system safety, Sunoco Logistics Partners, LP. looks for, and seeks employee input, on process safety improvements.  Additionally, the Port Arthur Fire Department is contacted regarding participation in site emergency response drills which will involve potential LP releases.  Additional actions include consolidating separate Facilitys' inspection checklists for ease of completion.\n\n"
    }
  ]
}