{
  "FacilityID": 1000086085,
  "FacilityName": "Always Bagels",
  "FacilityStr1": "3010 Hanford Drive",
  "FacilityStr2": null,
  "FacilityCity": "Lebanon",
  "FacilityState": "PA",
  "FacilityZipCode": "17042",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42075",
  "LEPC": "Lebanon County LEPC",
  "FacilityLatDecDegs": "40.345252",
  "FacilityLongDecDegs": "-76.463877",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 29783896,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Anthony Pariti",
  "OperatorStr1": "10 Keyland Court",
  "OperatorStr2": null,
  "OperatorCity": "Bohemia",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "11716",
  "OperatorZipCodeExt": "2620",
  "RMPContact": "Anthony Pariti",
  "RMPTitle": "Vice President",
  "FTE": 80,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000210764",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-01-14 00:00:00",
  "SafetyInspectionBy": "ABI Food Safety Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-03-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-03-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-03-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107535,
      "AltID": null,
      "FacilityID": 1000086085,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000108787,
          "ProcessID": 1000107535,
          "NAICSCode": "31181",
          "_desc": {
            "NAICS_CODE": "31181",
            "NAICS_DESCRIPTION": "Bread and Bakery Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000134437,
          "ProcessID": 1000107535,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000634437,
          "ProcessID": 1000107535,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086085,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nAlways Bagels operates a food manufacturing facility in Lebanon, PA. Like many food facilities, we use anhydrous ammonia in our refrigeration system. Ammonia is the best refrigerant available for our use.  Because of its moderate toxicity and slight flammability, ammonia is considered a hazardous material.\n\n\n\nAlways Bagels is committed to maintaining a safe manufacturing operation for our employees and the surrounding community. Our refrigeration system obeys our local building and fire codes, as well as industry-consensus codes and standards where appropriate.  Finally, to comply with requirements of the Occupational Safety and Health Administration and the United States Environmental Protection Agency, we have a Process Safety Management program to help us operate and maintain the system safely.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe primary business of Always Bagel is manufacturing and cold storage of bakery goods. Anhydrous Ammonia is the regulated substance that is used in a closed-loop refrigeration system. This refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for the storage of ice. \n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nIn order to operate the ammonia refrigeration system, the facility complies with the EPA Risk Management Program (RMP) and the OSHA Process Safety Management Program (PSM).\n\n\n\nAdministrative Measures:  The facility operates in accordance with the guidelines and standards published by International Institute of Ammonia Refrigeration (IIAR).  \n\n\n\nThe Always Bagel ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086085,
      "SummaryText": "the operation of the system.  It is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia. For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  Pressure relief valves on all pressure vessels protect the equipment from overpressurization.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe EPA defines \"accident\" as the following: \n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. \n\n\n\nThe release must have caused at least one of the following: \n\n\n\n?    On-site deaths, injuries, or significant property damage; or \n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\" \n\n\n\nBased on the above definition and an investigation into the facility's accident history conducted during the PHA meeting, there have been no releases of ammonia that meet this criteria in the past five years (February 2015 - February 2020). In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an Emergency Action Plan (plan) in effect.  This Plan was designed to meet the following objectives:  \n\n\n\n?    save lives;\n\n?    minimize and avoid injuries;\n\n?    protect the environment; and\n\n?    minimize property damage.\n\n\n\nThe Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  \n\n\n\n\n\nPLANNED"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086085,
      "SummaryText": " CHANGES TO IMPROVE SAFETY\n\n\n\nThe PHA Revalidation was performed on February 18, 2020. This meeting reviewed previous study recommendation and generated mitigation measures (recommendations) to improve safety at the facility.  The mitigation measures include additional training, key maintenance related tests/inspection, and enhanced emergency response policies and procedures.  The facility is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n\n\n3. Continue employee involvement through safety team participation.\n\n\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n\n\n\n\n"
    }
  ]
}