{
  "FacilityID": 1000042324,
  "FacilityName": "CEREX Advanced Fabrics, Inc.",
  "FacilityStr1": "610 Chemstrand Road",
  "FacilityStr2": null,
  "FacilityCity": "Cantonment",
  "FacilityState": "FL",
  "FacilityZipCode": "32533",
  "Facility4DigitZipExt": "6857",
  "FacilityCountyFIPS": "12033",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "30.591667",
  "FacilityLongDecDegs": "-087.252222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "OT",
  "FacilityURL": "www.cerex.com",
  "FacilityEmailAddress": "wwhitfield@cerex.com",
  "FacilityDUNS": 877181768,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CEREX Advanced Fabrics, Inc.",
  "OperatorStr1": "610 Chemstrand Road",
  "OperatorStr2": null,
  "OperatorCity": "Cantonment",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32533",
  "OperatorZipCodeExt": "6857",
  "FTE": 90,
  "OtherEPAFacilityID": "32533JMSRV610CH",
  "EPAFacilityID": "100000155529",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-02-09 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-03-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.57006,
  "FRS_Long": -87.26064,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052174,
      "AltID": "Hydrogen Chloride",
      "FacilityID": 1000042324,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000063250,
          "ProcessID": 1000052174,
          "ChemicalID": 54,
          "Quantity": 155650.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000052800,
          "ProcessID": 1000052174,
          "NAICSCode": "31323",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000044095,
              "Process_NAICS_ID": 1000052800,
              "SafetyReviewDate": "2014-04-21 00:00:00",
              "PHA_Date": "2014-07-30 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": "Pamphlet 57 of Chlorine Institute",
              "PHACompletionDate": "2016-03-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-04-21 00:00:00",
              "TrainingReviewDate": "2014-08-04 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Intranet document review and verification system",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": "Intranet document review and verification system",
              "MaintenanceReviewDate": "2016-01-26 00:00:00",
              "EquipmentInspectionDate": "2016-02-15 00:00:00",
              "EquipmentTested": "EBV's",
              "ChangeMgmtDate": "2014-01-23 00:00:00",
              "ChangeMgmtReviewDate": "2009-07-28 00:00:00",
              "PreStartupReviewDate": "2014-03-10 00:00:00",
              "ComplianceAuditDate": "2016-02-09 00:00:00",
              "AuditCompletionDate": "2016-03-08 00:00:00",
              "IncidentInvestigationDate": "2015-12-07 00:00:00",
              "InvestigationChangeDate": "2015-12-07 00:00:00",
              "ParticipationPlansReviewDate": "2009-06-02 00:00:00",
              "HotWorkPermitReviewDate": "2008-07-31 00:00:00",
              "ContractorSafetyReviewDate": "2007-07-25 00:00:00",
              "ContractorSafetyEvalDate": "2012-10-26 00:00:00",
              "CBI_Flag": 0,
              "Description": "\n\nWoth regard to questions below:\n\n7.14. Date of most recent review or revision of contractor safety procedures:    \n\n7.15. Date of most recent evaluation of contractor safety performance:    \n\nWe do not allow contractors to work on covered process.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000052926,
                  "PreventionProgram3ID": 1000044095,
                  "ProcessChemicalID": 1000063250
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000042324,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2012-10-26 00:00:00",
    "ERTrainingDate": "2014-01-31 00:00:00",
    "CoordinatingAgencyName": "Escambia County Emergency Mgt.",
    "CoordinatingAgencyPhone": "8505953311",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Department of Homeland Security; Department of Transportation"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042324,
      "SummaryText": "This RMP is submitted by CEREX Advanced Fabrics, Inc. for its nylon nonwoven manufacturing process which uses a regulated substance, anhydrous Hydrogen Chloride (aHCl). This nonwoven manufacturing process has been in continuous operation since January, 1970. The process was originally developed by Monsanto Company in the late '60s and operated by Monsanto until sold to James River Corporation in September, 1985. Since 1985, the ownership of the nylon nonwoven manufacturing operation changed through several corporate owners, and then became privately held as CEREX Advanced Fabrics (CEREX) in 1994. The covered process includes a single piping system that continuously delivers Anhydrous Hydrogen Chloride from one of three tube trailers to a single injection point where the material is mixed and substantially diluted for use as a process aid to bond nylon fibers to form a fabric. The covered process also includes a vent system used to evacuate and purge the process piping to a \"drowning jet\" whereby the material is diluted and neutralized.\n\n\n\nA. Accidental release prevention and emergency response policies:\n\no PRRMPHCL001: Pensacola Cerex Plant Emergency Management Program for the HCl Process Master Program Document;\n\n    This procedure outlines and summarizes all Cerex internal systems and documentation related to the operation and maintenance of the above listed covered process, meeting all requirements established by OSHA/EPA for highly hazardous chemicals.\n\no PRSFTY009: HCl Emergency Procedure Document;\n\n    The purpose of this procedure is to outline proper response by any Cerex Advanced Fabrics employee to a release of Hydrogen Chloride\n\no RM034: HCl Emergency Decision Tree for Operations;\n\n    The purpose of this flowchart is to outline proper response by any Cerex Advanced Fabrics employee to a release and/or indication of a release of Hydrogen Chloride\n\no PRSFTY010: HCl Emergency Equipment Checks;\n\n    The purpose of this procedure is to outline the HCl Emergen"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042324,
      "SummaryText": "cy Equipment to be checked at procedure least monthly by Instrument Technician and Operations Technician. Equipment to be checked from remote push buttons in the Inspection Area includes 3 EBV's (Emergency Block Valves) on each of the tube trailer unloading flex lines.\n\no PRSFTY010: HCl Emergency Equipment Checks Form;\n\n    The purpose of this procedure is to document the HCl Emergency Equipment to be checked per PRSFTY010.\n\no PRSFTY01: Routine Management of the HCL Process;\n\n    The purpose of this procedure is to outline the routine management of the aHCl process to ensure compliance to OSHA's Process Safety Management (PSM) rule 20 CFR 1910.119 and EPA's rule for Risk Management Plan (RMP) 40 CFR Part 68\n\no PRSFTY012: Process Safety Management;\n\n    The purpose of this document is to ensure compliance Florida Accidental Release Prevention and Risk Management Planning Act (Chapter 252, Part IV) and the US Environmental Protection Agency's Chemical Accident Prevention Provisions (40 CFR part 68); by instituting a Process Safety Management (PSM) system to ensure that the appropriate procedures, personnel, and equipment to prevent an accidental release of anhydrous Hydrogen Chloride (AHCl) are in place and functioning effectively.\n\no SFTY024C: HAZCOM INFORMATION FOR HCl;\n\n    The purpose of this document is to provide hazard information regarding AHCl\n\n\n\nB. Stationary Source and regulated substances handled:\n\nThe Anhydrous Hydrogen Chloride (aHCl) is transported to CEREX and stored in Tube Trailers, each consisting of 6 tubes, individually valved, and isolated from a common manifold on the trailer. The manifold is double valved and plugged when delivered. The trailer is received with the tubes configured to deliver gas continually to the CEREX process. Each tube is rated well above aHCl critical pressure at normal ambient temperatures. The total trailer volume is approximately 22,000 pounds, and in the \"Worst Case Scenario\", an unlikely breach of all tubes is describ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042324,
      "SummaryText": "ed. In the more likely, but remote, alternative case scenario, a failure of the manifold on the tube trailer is described. In this scenario, all tubes are open to accommodate process requirements, and the scenario response dictates manually closing each tube isolation valve by our Emergency Response Team. CEREX uses one tube trailer every 2-3 weeks, and utilizes a \"drop and swap\" protocol to ensure continual supply to the process. Three unloading spots are\n\nin place; one for the on-line trailer, one for the leaving and one for the arriving trailer. Reorders occur when the Tube trailer is near empty (approximately 3,000 pounds). This protocol limits the maximum amount of aHCl on site at any one time to approximately 25,000 pounds.\n\n\n\nC. General accidental release prevention program and chemical-specific prevention program:\n\nThe details of these programs are embodied in the documents listed in paragraph (A). In summary, CEREX has implemented systems to prevent an accidental aHCl release that include the following:\n\n    Closed circuit monitoring of the tube trailer unloading area with multi-point monitoring in the facility.\n\n    Emergency response systems that are designed to detect a minor leak (before it becomes a major release) and provide the means to mitigate the impact of a release on the surrounding community. These emergency response systems and procedures include:\n\n   An aHCl multi-point Draeger vapor detection and alarm system that surrounds the tube trailer and process piping with sensors calibrated to trigger an alarm in the event of a leak\n\n   Redundant rupture disk and pressure relief valve in the supply pipe system. The relief exhaust system conveys gas to a \"drowning system\" to neutralize any escaping gases\n\n    Remote activated \"fail-close\" emergency block valves located at the tube trailer connection point. When activated, this system will also simultaneously close downstream valves that supply aHCl to the process.\n\n   Cerex alarm systems are integral"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000042324,
      "SummaryText": " to a large site wide alarm network (Ascend Performance Materials manufacturing site)\n\n    Emergency response services provided by Ascend Performance Materials who employs a highly trained hazmat emergency response team for rapid on-site response.\n\n\n\nD. Five year accident history:\n\nThere have been no accidents in the past five years that have resulted in death, injury, or significant property damage on site, nor any known off-site occurrences of death, injury, evacuations, shelter-in-place, property damage, or environmental damage. In the 45+ year existence of the process which utilizes aHCl, there have been no incidents meeting this criteria.\n\n\n\nE. Emergency Response program:\n\nEmergency response program details are embodied in the documents listed in paragraph (A). In summary, the CEREX manufacturing site is located within the Ascend Performance Materials (formerly known as Monsanto Company and Solutia Inc.) Pensacola site boundaries. CEREX is an integral part of the Ascend site emergency response system which includes a site wide emergency alarm system, emergency radio communications, and access to Escambia County's Community Automated Telephone Alert system. First response is provide by Ascend's highly trained hazmat/industrial emergency response team that has the equipment and personnel needed to handle Highly Hazardous Material emergencies.\n\n\n\nF. Planned changes to improve safety:\n\nRecent changes have significantly lowered on-site storage quantities of aHCl, thus lowering the potential impact of emergency scenarios. Cerex Advanced Fabrics utilizes a progressive Safety Program that consists of regular safety meetings, a comprehensive safety observation program\n\nand a multi-disciplinary team that drives continuous improvement activities for the safe"
    }
  ]
}