{
  "FacilityID": 1000008876,
  "FacilityName": "AES Redondo Beach, LLC",
  "FacilityStr1": "1100 North Harbor Drive",
  "FacilityStr2": null,
  "FacilityCity": "Redondo Beach",
  "FacilityState": "CA",
  "FacilityZipCode": "90277",
  "Facility4DigitZipExt": "2077",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.850278",
  "FacilityLongDecDegs": "-118.395000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.aes.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 841411346,
  "ParentCompanyName": "AES Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "AES Redondo Beach, LLC",
  "OperatorStr1": "1100 North Harbor Drive",
  "OperatorStr2": null,
  "OperatorCity": "Redondo Beach",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90277",
  "OperatorZipCodeExt": "2077",
  "RMPContact": "Tony Chavez",
  "RMPTitle": "Plant Manager",
  "FTE": 48,
  "OtherEPAFacilityID": "CAR000038893",
  "EPAFacilityID": "100000149788",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "115536",
  "SafetyInspectionDate": "2009-04-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.85233,
  "FRS_Long": -118.39637,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010350,
      "AltID": "2 NH3 NOx SCRs:Units 5-8",
      "FacilityID": 1000008876,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010698,
          "ProcessID": 1000010350,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011809,
          "ProcessID": 1000010350,
          "ChemicalID": 57,
          "Quantity": 93000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000511809,
          "ProcessID": 1000010350,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008876,
      "SummaryText": "Executive Summary\nAES Redondo Beach, LLC\nRedondo Beach, California\n29.4% Aqueous Ammonia Selective Catalytic NOx Reduction (SCR) Systems\nUnits 5, 6, 7, and 8\n\n\nINTRODUCTION\n\nGENERAL RESUBMITTAL BACKGROUND\nThis June 2009 Risk Management Plan (RMP) is a 5-year resubmittal of the AES Redondo Beach, LLC's RMP (originally filed in June 1999 for the Units 7 and 8 SCR system, with an update prepared in 2001 for the SCR system newly installed on Units 5 and 6).  The RMP was prepared in compliance with both the U.S. Environmental Protection Agency (USEPA) and California Accidental Release Prevention (CalARP) Program requirements.  This resubmittal includes an updated narrative description (in this Executive Summary) of the AES Redondo Beach aqueous ammonia accident prevention program, the additional data elements required by the April 2004 USEPA revised RMP regulations, and represents a thorough review of operating and maintenance procedures, and a review of the process hazard analyses previously conducted.     \n\nAs documented in the Offsite Consequence Analysis prepared for the 2001 RMP revision, the additional SCR system installed for Unit 5 & 6 did not result in an increase of the offsite consequence analysis (OCA) impact distance for ammonia, the hazardous substance of concern, from the original June 1999 RMP.  Therefore, in accordance with USEPA regulations at Title 40 of the Code of Federal Regulations (CFR), Part 68, at 40 CFR 68.190(b)(4), an RMP update filing with the USEPA was not required since the OCA impact distance did not change by more than a factor of two. The California Code of Regulations (CCR), Title 19, Division 2, Chapter 4.5, Section 2745.10 also does not require a filing of an updated RMP under the CalARP Program if the OCA impact distance does not change by more than a factor of two unless the process modification is considered \"significant.\"\n\nHowever, in order to maintain a fully accurate and up to date facility RMP, in late 2001 AES Redondo Beach r"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008876,
      "SummaryText": "eportedly filed a revised version of the RMP with the City of Redondo Beach Fire Department.  The 2001 RMP was not filed with the USEPA since an update was determined not to be required under federal regulations.  \n\nFor this 2009 RMP resubmittal, AES Redondo Beach LLC is preparing and resubmitting the RMP as a single integrated program document which includes both SCR deNOx systems, and is intended to reset the 5-year resubmittal period to run until June 2014.  \n\nThe 2004 RMP resubmittal process included the following and no changes to the system have occurred since that time:\n\n1. The SCR systems were reviewed by an experienced multi-disciplinary team of AES Redondo Beach personnel (operations, environmental, engineering and maintenance), facilitated by a 2-person HazOp-experienced ESCI EnviroServices, Inc. team.  There were no additional hazards or consequences identified, no necessary or significant recommendations, and no change to any off-site consequence analysis (no change to worst case or alternative case release scenarios). \n2. The list of recommendations previously made in the 2001/2002 RMP submittal were verified to have been implemented.\n3. The current off-site consequence analysis (worst case and alternative case release scenarios) were evaluated in detail and found to be still valid and representative, and no change in impact, distance, or receptors have been identified.  All data, assumptions and calculations have been verified.\n4. AES Redondo Beach has last reviewed the operational and maintenance procedures in June of 2009.  The primary source of procedures are the SCR system manufacturer documentation (the Mitsubishi operation and maintenance manuals for Units 5&6, and the Noell manuals for the Units 7&8 SCR system), along with certain other AES Redondo Beach-specific procedures (such as the ammonia loading and unloading & ordering procedure).  The procedures were verified to be current.\n5. SCR and ammonia-related training and training status was re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008876,
      "SummaryText": "viewed and discussed.  Training is current.  \n6. Any identified corrective actions from the latest (07/12/2007) RMP compliance audit was verified to have been completed by 01/12/2008.\n7. The emergency response program and emergency procedures were reviewed, recently updated and are maintained current.  \n8. The additional elements required by the federal RMP changes have been added.\n9. The level of detail in the executive summary has been modified, and now includes a summary discussion of the applicable RMP and CalARP program elements.  These summaries also have been revised from the 2002 submittal to read more clearly.  Regarding Process Safety Information, all drawings, specifications and system details are maintained at the AES Redondo Beach facility and in the references system manuals; the equipment numbers are no longer listed in the submittal documents.\n\nThe RMP*3SubmitTM program was used to electronically submit the RMP to USEPA, with a modified hard copy (along with California-required CalARP data elements included) submitted to the Redondo Beach Fire Department.   \n\n\nRMP EXECUTIVE SUMMARY COMPONENT\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\nAES Redondo Beach has had an active hazardous materials management and accident prevention program for many years, and emphasizes safety and good management practices in all its activities - conducting all activities in accordance with a detailed, well established Accident Prevention Manual that includes active participation by management, line and contractor employees. The AES Redondo Beach facility has an exceptionally strong safety team and committee program, which are actively and visibly supported by facility management. The facility has in place long-established procedures and policies governing hazardous materials and waste handling, spill prevention, environmental compliance and inspections, as well as safety-related policies.  AES Redondo Beach has a strong commitment to worker and public safety.  This"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008876,
      "SummaryText": " commitment is demonstrated by the resources invested in accident prevention (such as SCR system awareness and considering safety in the design, installation, operation and maintenance of the aqueous ammonia SCR systems).  Specific to the SCR system, aboveground storage tanks, and the underground storage tank, a multitude of release prevention design, procedural and operational elements and controls are in place and effective.  As an integral part of the external events analysis for the AES Redondo Beach Risk Management Program, the facility had conducted a series of Seismic Hazards Analyses that evaluated the stability and integrity of the SCR mechanical systems and related equipment relative to earthquake and related hazards. The recommendations made in these seismic hazards analyses were evaluated and implemented as appropriate.  As detailed in the Maintenance Section of the RMP, AES Redondo Beach has in place a multi-faceted inspection and maintenance program that includes daily visual inspections and annual maintenance overhauls.\n\nThe AES Redondo Beach policy is to implement reasonable and sustainable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, facility and ammonia vendor personnel (if applicable) will take immediate actions to stop a release, if such actions can be taken immediately and safely.  If not, the facility will evacuate the affected area, contact outside response agencies for assistance, and provide whatever logistical and technical support as deemed necessary by those responding agencies. \n\nGENERAL FACILITY OVERVIEW AND PROCESS DESCRIPTION\nThe Redondo Beach Generation Station, purchased from Southern California Edison (SCE) in 1998 by AES Corporation as part of California's deregulation program, has provided power to Southern California for over 50 years. The AES Redondo Beach, LLC facility is located in the northwestern corner of the City of Redondo Beach, California.  SCE retained the electr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000008876,
      "SummaryText": "ical transmission facilities (e.g. the switchyards and power distribution lines).\n\nThe AES Redondo Beach, LLC power generating facility burns natural gas in boilers to produce steam. The steam is used in turbine generators to produce electricity. Currently, the station actively operates four primary boiler/steam turbine generating units, designated Units 5, 6, 7, and 8. Units 5 and 6 are operated from a common control room and are rated at 175 megawatts (MW) each.  Units 7 & 8 are operated from a common control room and are rated at 480 MW each.  A small boiler, Boiler 17 is also occasionally operated.\n\nThe basic flow path of each boiler is as follows:  (1) combustion air is supplied by fans to the air preheater where it is heated, (2) the heated air is mixed with fuel in burners to produce a flame and hot flue gases (combustion products), (3) the hot flue gases flow through the radiant and then convective passes of the boiler, (4) heat is removed from the flue gas as it flows over the outside of tubes in the boiler, (5) water flowing in the inside of the tubes is converted to steam as this heat is absorbed, (6) the flue gas flows through the air preheater where a final increment of heat is removed in preheating the incoming combustion air, and (7) the flue gas exits the boiler stack.                                              \n                                                                                                                                     \nAs part of any fossil fuel combustion process, a small amount of nitrogen oxides (NOx) is produced and exhausted to the atmosphere with the other flue gas constituents (mostly nitrogen, carbon dioxide, and water vapor). The amount of NOx that the station is allowed to emit is regulated by the South Coast Air Quality Management District (SCAQMD).  In 1991 - 1992, the SCAQMD revised its Rule 1135 which reduced the allowed NOx emissions and specifically required that SCE (the previous owner of the generating sta"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000008876,
      "SummaryText": "tion) install a NOx emission reduction system on the two largest boilers - Units 7 and 8.  In 1993 - 1994, SCE installed a Selective Catalytic Reduction (SCR) NOx Control System on Units 7 and 8, which are operated from a common control room.  Identical SCR systems were designed and installed by the same firm, Noell, Inc., at several Southern California SCE generating stations.   \n\nIn December 2001, AES completed installation of an additional SCR system within the existing boilers of Units 5 and 6 to further reduce NOx emissions from the AES Redondo Beach, LLC facility.  This installation included one new 20,000-gallon double-walled aboveground aqueous ammonia storage tank and associated metering pumps and SCR catalyst grids. \n                                                                           \nThe SCR process involves injecting aqueous ammonia into the boiler flue gas in the boiler's convective pass. The ammonia/flue gas mixture flows through a catalyst installed between the convective pass and the air preheater.  In the presence of the catalyst, the ammonia and NOx react to form nitrogen and water vapor, which exits out the boiler stack.  About 90% of the NOx is removed in this manner. The SCR system uses a 29.4% aqueous ammonia solution in the SCR system. The aqueous ammonia for Units 7 and 8 is stored in a 20,000-gallon double-walled underground storage tank; the aqueous ammonia for Units 5 and 6 is stored in one aboveground, double-walled tank with a containment berm.  Both installations feature a bermed tank loading area which is connected to a subsurface emergency containment sump.  Aqueous ammonia is one of several hazardous materials used at the facility that are critical to the safe and continued generation of electricity for the community.  As AES Redondo Beach utilizes aqueous ammonia over the federal 10,000 pound RMP threshold, the facility and the SCR process are covered under the federal and state Risk Management Prevention program. \n\nWORST CAS"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000008876,
      "SummaryText": "E AND ALTERNATE RELEASE SCENARIOS\nSeveral potential release scenarios were evaluated as part of the RMP Offsite Consequence Analysis (OCA).  The OCA was performed in accordance with USEPA and California CalARP OCA guidance.  The results of this OCA, which included worst case and alternative release scenarios, were considered in the implementation of the prevention program and in facility emergency planning.  The results of the facility's Process Hazard Review was used to determine the most likely (e.g. credible) alternative case release scenario based on operations and system design and maintenance.  The specific details and results of the RMP are maintained by the facility and have been reviewed with local emergency response and planning agencies (primarily the Redondo Beach Fire Department).  The administrative controls and mitigation measures to limit the distances for each scenario are summarized in this RMP submittal.  Details are integrated within the various program implementation documents (such as operating and ammonia loading procedures) maintained at the facility.  The 1999 and 2001 off-site consequence analysis submitted to Redondo Beach Fire Department (worst case and alternative case release scenarios) were evaluated and found to be still valid and representative, and no change in impact, impacted population or sensitive receptors have been identified.  All data, assumptions and calculations have been verified.\n\nFIVE YEAR ACCIDENT HISTORY\nThe AES Redondo Beach SCR systems have had an excellent record of accident prevention since installation.  Over the last 5 years, no accidents meeting the definition of an RMP/CalARP accident have occurred at the facility (on-site deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place).  No accidents of any kind associated with the SCR systems have been recorded.   Should an RMP-reportable accident occur in the fut"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000008876,
      "SummaryText": " flame arrester minimizes the potential for an open flame to be drawn into the main tank.  The secondary containment tank is also vented to atmosphere 12 feet above grade through a dryer canister in parallel with a conservation pressure vent.  This arrangement prevents breathing in moisture while allowing a bypass path to prevent pressure build up in the secondary containment.\n\nA two-inch fill line and a two-inch vapor return line are routed from the primary vessel through block valves to quick connect type couplings for truck unloading.  The fill line allows the transfer of aqueous ammonia from the delivery truck to the tank, while the vapor return line allows the displaced ammonia vapors form the tank to be returned to the truck.  The fill and vapor return piping is securely anchored at the truck unloading station.  The unloading station is within the spill containment barrier that runs along the perimeter of the tank.  The tank has a visual level gauge in the vicinity of the loading station to assist the unloading truck operator and to prevent overfilling.  A ground cable is provided for connection to the unloading truck.  Safety eyewash/shower combinations are provided at the storage tank and adjacent to the metering pump skid for each unit.\n\nThe aqueous ammonia truck unloading area was redesigned in late 1996 to include an 1,800-gallon capacity truck unloading containment basin connected to an open plant wastewater drain system.  The basin is underlined by a synthetic membrane liner.  A drain was installed in the unloading area for the aqueous ammonia trucks.  It extends out and connects with the existing equipment drain system located near Unit 8 South forced draft fan enclosure.  The floor drain's ultimate discharge is to the station's South Retention Basin.\n\nA containment area pad was also installed adjacent to the aqueous ammonia storage area.  This containment is designed to capture any spill that may occur during the process of unloading the aqueous ammon"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000008876,
      "SummaryText": "nvestigate incident which would meet, or could have resulted in, an accident  meeting the 'RMP reportable 5-year accident criteria' (on-site deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place).  Should an RMP-reportable accident occur in the future, AES Redondo Beach will revise the RMP to include information about the accident within six months of the accident's occurrence, and revise the incident investigation information in the RMP.  Specifically, AES Redondo Beach will revise (1) the date of investigation to reflect the date of the investigation of the accident being included in the five year history; and (2) the expected date of completion of any changes due to that accident investigation, and submit a corrected RMP within six months of the date of the accident.  As stated previously, there have been no accidents meeting this threshold since SCRs have been in use at AES Redondo Beach.  There have been no recordable accidents of any kind involving the SCR system."
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000008876,
      "SummaryText": "ure, AES Redondo Beach will revise the RMP to include information about the accident within six months of the accidentA?s occurrence, and revise the incident investigation information in the RMP. Specifically, AES Redondo Beach will revise (1) the date of investigation to reflect the date of the investigation of the accident being included in the five year history; and (2) the expected date of completion of any changes due to that accident investigation, and submit a corrected RMP within six months of the date of the accident. \n\nEMERGENCY RESPONSE PROGRAM INFORMATION\nAES Redondo Beach maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  AES Redondo Beach is a member of the Beach Cities Community Awareness and Emergency Response (CAER) program. Employees who, in the course of their job duties, are involved in the operation, maintenance, sampling, engineering or supervision of hazardous material or waste storage facilities receive training in hazardous waste and materials management, as do all facility hazardous waste generators. This training includes the facility's Emergency Response Business Plan which includes the required elements of a hazardous materials business emergency plan (required by Title 19 CCR) and a  hazardous waste contingency plan (required by Title 22 CCR).  In addition, the facility has procedures that address the maintenance, testing, and inspection of emergency response and ammonia release detection equipment.  The AES Redondo Beach Emergency Response Business Plan is updated on an annual basis with the new revisions coordinated and reviewed by the Redondo Beach Fire Department upon issuance. Emergency response and emergency planning issues are also reviewed with the Redondo Beach Fire department on a periodic ongoing basis, including on-site preplanning tours by the fire department.  \n\nThe AES Redondo Beach hazardous materials emergency response program supports and p"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000008876,
      "SummaryText": "rovides for the trained response by designated facility emergency response personnel to incidents involving a wide range of materials. The facility conducts training for such responses. Specifically as it relates to the aqueous ammonia and SCR systems, AES Redondo Beach personnel are trained to only respond to an aqueous ammonia release if it can be done so safely and without possible risk to safety or health (e.g. minor, incidental spills of low volume). AES Redondo Beach will immediately contact and rely upon outside response agencies, as well as a pre-contracted, qualified emergency response contractor for all other aqueous ammonia releases.  Primary public response agencies are the Redondo Beach Fire Department and Los Angeles County Fire Department Hazardous Materials Unit (by automatic aid).  Copies of the SCR systems technical information are available for responding agency use.\n\nThe latest emergency plan revision, January 15, 2006 (with the June 2009 revision in progress) includes the following elements:\n\nA? List of Emergency Coordinators and Alternates \nA? Internal and External Notifications and Reporting (including neighboring businesses)\nA? Incident Command System (Responsibilities)\nA? Incident/Hazard Evaluation\nA? Area Control of Incident\nA? Evacuation and Shelter-in-Place\nA? Containment and Removal of Hazardous Waste Release\nA? Scene and Environmental Restoration and Incident Closure (including use, testing and maintenance of emergency response equipment).\nA? Accident / Incident Investigation\nA? Corrective and Preventive Actions\nA? Response Plan Critique\nA? Plan Revisions and Maintenance\nA? Training\n\nThe plan also includes specific information relative to publicity and community or public release of information.  \n\nThe AES Redondo Beach facility's hazardous materials emergency response program conforms to the Emergency Response Program requirements in 40 CFR 68.95 and 19 CCR 2545.8.  However, due to the nature and hazard of the material, the significant"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000008876,
      "SummaryText": " personal protective equipment and specialized response techniques, and the rarity of any emergency involving the SCR system and storage tank, pursuant to 40 CFR 68.90(b), AES Redondo Beach is classifying itself as a `Non-Responding Facility,' specifically as associated with emergency responses involving aqueous ammonia (also reference the USEPA April 2004 RMP Guidance, Chapter 8).  In working with the Beach Cities CAER Association, and in coordinating the AES Redondo Beach business emergency plan submittal with the Redondo Beach Fire Department, the facility has coordinated with local response agencies to help ensure that they will be prepared to respond to an emergency at the AES Redondo Beach facility, including procedures to notify emergency responders when there is need for a response.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nBased on a detailed review of the previous Process Hazard Analyses for the SCR systems and the operational review performed as part of this resubmittal, no specific changes are recommended to improve safety.  The facility will continue to implement it's accidental release prevention program and verify conformance to operational, loading, and maintenance procedures.  \n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\nThe following is a summary of the accident prevention program (relating to the aqueous ammonia SCR systems) in place at the AES Redondo Beach facility.  This summary addresses each of the RMP/CalARP elements and describes the management system in place to implement the accident prevention plan.\n\n\nMANAGEMENT SYSTEM FOR RMP\nAES Redondo Beach has developed an overall management structure/system in order manage various facility operations, controls, and environmental and safety programs including implementing various elements of the facility's Risk Management Program.  A full description of this management structure, including the list of position titles and their general responsibilities, is available for review at the facility.  In summa"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000008876,
      "SummaryText": "ry:\n\nThe AES Redondo Beach Plant Manager has the overall management responsibility for implementing the RMP for aqueous ammonia facilities at AES Redondo Beach.  In carrying out this responsibility, the Plant Manager utilizes the other positions listed below to develop, implement and integrate specific aspects of the Risk Management Program.\n\nTeam Leaders report to the Plant Manager.  The Team Leaders have responsibility for all station operating and maintenance personnel.  The Team Leaders are responsible for ensuring that all equipment is properly monitored and operated and maintained.  The Team Leaders have overall responsibility for implementing the operational aspects of the Risk Management Program.  \n\nControl Room Personnel report to their designated Team Leader.  From their duty stations in the control rooms, Control Room Personnel continuously oversee the operation and monitoring of all station equipment, including providing detailed technical direction to the Plant Technicians for the immediate tasks at hand.  They are responsible for operating and monitoring the Selective Catalytic Reduction system alarms and controls, which are remotely handled (from the control room), and for directing the Plant Technicians to those alarms and controls, which are handled locally. \n\nPlant Technicians report to their designated Team Leader, and receive technical direction from on-duty Control Room Personnel.  They perform local equipment operations at the direction of the respective Control Room Personnel.  The Plant Technicians make a visual inspection of all station equipment twice a shift.  Inspections include checking that all gage readings are normal, no unusual vibration or noise exists, lubrication levels are proper, and no leaks exist.  They are responsible for immediately reporting any abnormalities detected to the Control Room, and will monitor the start up of the Selective Catalytic Reduction system air blowers, pumps, piping and other equipment.  During aqueous"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000008876,
      "SummaryText": " ammonia deliveries, Control Room Personnel will dispatch one or more Plant Technicians to the aqueous ammonia truck at the appropriate storage tank location. The Plant Technician will be equipped with the appropriate personal protective equipment and two-way communication.  They verify the content of the delivery truck, the proper fill connections, valving, and monitors the area until delivery is complete.  In the event of an aqueous ammonia release, the Plant Technician would contact the Control Room immediately. \n\nStation Support Personnel are responsible for the facility safety and environmental issues, and for overall RMP regulatory compliance and administration.  The Station support personnel ensures that all station safety and environmental procedures are followed, coordinates all station safety and environmental training, and maintains records relating to all station safety and environmental issues.  One Station support staff person is also designated as the Risk Management Program Coordinator.\n\nThe Engineering support staff has the responsibility of technical review of the various projects occurring at the station.  This individual is responsible in determining the work scope and the proper installation of station modifications.  The Engineering support staff works with other departments within the station and throughout AES to ensure proper operation of existing station systems.  The Engineering support staff is responsible for ensuring that the aqueous ammonia facility and equipment is designed, fabricated, and installed in accordance with applicable codes and regulations, that field construction meets all applicable codes and regulations, and for providing training and initial startup support to AES Redondo Beach facility personnel.  Finally, the Engineering support staff is responsible for providing the station with a system description, equipment manuals and data, prints, and procedures of sufficient detail to allow the station to assume responsibility"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000008876,
      "SummaryText": " for the operation and maintenance of the aqueous ammonia facility and equipment for its lifetime, commencing at the conclusion of initial start-up activities.\n\nPROCESS SAFETY INFORMATION\nAES Redondo Beach facility keeps on file a variety of technical documents that are used to help design and maintain safe operation of the aqueous ammonia SCR system.  These documents address chemical properties and associated hazards, limits for key process parameters, and equipment design basis/configuration information.  Facility maintenance and engineering personnel within the facility are assigned responsibility for maintaining up-to-date process safety information.   Chemical specific information, including exposure hazards and emergency response/exposure treatment considerations is provided in material safety data sheets (MSDSs).  As part of the SCR system design documents, this information was supplemented by documents that specifically address known corrosion concerns.  As part of the manufacturer's SCR system design documentation on file at the facility, documented safety-related limits for specific process parameters (e.g. pressure, flow rate, temperature, etc.) are maintained.  The facility ensures that the process is maintained within these limits using process controls, and monitoring instruments, trained personnel, and manual and automated shutdown systems.\n\nThe AES Redondo Beach facility maintains numerous technical documents that provide information about the design and construction of the SCR system (including ammonia storage).  The information includes materials of construction, design pressure, temperature ratings, and electrical ratings of equipment. This information, in combination with written procedures and trained personnel, provides the basis for establishing inspection and maintenance activities, as well as evaluating proposed process and facility changes to ensure that safety features are not compromised.\n\n\nSummary System Descriptions\n\nGeneral\nThe SCR sys"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000008876,
      "SummaryText": "tem for Units 7 and 8 was designed by Noell, Inc.  The ammonia storage system was designed by Southern California Edison.  All equipment was installed by Powerplant Specialists, Inc., under contract to Noell, Inc.  For Units 5 and 6, the SCR design and ammonia storage systems were designed by a consortium made up primarily from Mitsubishi Heavy Industries and The Industrial Company (TIC).  The design of the SCR and ammonia storage systems is governed by the California Occupational, Safety and Health Administration (Cal/OSHA), American Society of Mechanical Engineers (ASME), American National Standards Institute (ANSI), Uniform Building Code (UBC), National Fire Protection Association (NFPA), and California codes.  Installation was governed by the same codes.  The underground piping and tank design and installation were permitted and approved by the Los Angeles County Department of Public Works and the Redondo Beach Fire Department.\n\nAn ammonia vapor detector system is provided with four ammonia detectors installed above grade on the perimeter of each storage tank facility with additional detectors located around the metering pumps and unloading areas. The detectors are wired to a local ammonia monitor and alarm panel which will also annunciate to control room operators via the plant DCS.  A safety shower is available in each tank area and at the metering pump skids.\n\nThe control system has been upgraded using a Rosemount 9000 DCS.  Interlocks have been incorporated to shut off aqueous ammonia flow to the SCR system in case of low boiler load below 130 MW, low gas temperature in the boiler below 350F, low SCR fan flue gas flow less than 4,000 scfm, boiler fuel trip or aqueous ammonia tank pump failure.\n\nAES Redondo Beach intends to ensure ongoing mechanical and process integrity of equipment by incorporating manufacturers' maintenance, inspection, and testing procedures in the applicable facility operational and maintenance procedures.\n\nUnits 5 and 6\nAES uses a 29.4 "
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000008876,
      "SummaryText": "percent aqueous ammonia solution for the SCR system on Units 5 and 6.  Aqueous ammonia for this SCR system is stored in one aboveground carbon steel ammonia storage tank.  The tank is horizontal, and has a nominal capacity of 20,000 U.S. gallons.  The tank is capable of withstanding pressures of 25 pounds per square inch gauge (psig), which is designed for the worst-case ambient temperature conditions of 125 degrees Fahrenheit.  The storage tank is an ASME-registered U-stamped pressure vessel designed for ammonia service.  To minimize potential ammonia leakage, the tank utilizes a double-wall design.  The inner-wall space is isolated from the main storage space and can be drained independent of the main storage area.\n\nThe tank is placed within a concrete berm.  The berm has a design capacity of 110 percent of the tank volume, which accounts for 6.5 inches (over 24 hours) cumulative rainfall for a 25-year frequency storm.\n\nThe ammonia storage tank is filled via vendor tanker truck deliveries scheduled at regular intervals based upon ammonia consumption.  Truck supply hoses are connected to a loading bulkhead.  Transfer pumps, hose purge equipment, and loading controls are provided on the tanker truck.  \n\nA two-inch fill line and a two-inch vapor return line are routed from the primary vessel through block valves to quick connect type couplings for truck unloading.  The fill line allows the transfer of aqueous ammonia from the delivery truck to the tank, while the vapor return line allows the displaced ammonia vapors form the tank to be returned to the truck.  To retain a closed system and minimize potential leakage, the loading system incorporates both liquid fill hoses and vapor return hoses.  Upon completion of filing operations, all lines are purged with compressed air prior to being disconnected. The fill and vapor return piping is securely anchored at the truck unloading station.  The unloading station is within the spill containment barrier that runs along the "
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000008876,
      "SummaryText": "perimeter of the tank.  The tank has a visual level gauge in the vicinity of the loading station to assist the unloading truck operator and to prevent overfilling.  A ground cable is provided for connection to the unloading truck.  Safety eyewash/shower combinations are provided at the storage tank and adjacent to the metering pump skid for each unit.\n\nThe tanker truck unloading area for Units 5 and 6 includes a bermed/diked truck unloading basin (12' x 4') sloped to a drain trough connected to a 2\" drain line tied to an underground catchment sump approximately 2,700 gallons in capacity.  An existing 2-foot diameter drainage opening above the catchment is covered with a manhole lid and is used only for accessing the inside of the catchment.  A 4\" pipe is installed as a vapor vent from the catchment, which vents approximately 12 feet above grade.  Under normal circumstances, ammonia vapors from the catchment would only escape to the atmosphere from the 4\" vapor vent pipe.\n\nUnits 7 and 8\nAES also uses a 29.4 percent aqueous ammonia solution for the SCR system on Units 7 and 8.  The storage facility for Units 7 and 8 includes a single 20,000-gallon, double-wall underground tank system with three aqueous ammonia supply pumps, piping, valves, instrumentation, controls, and electrical.  The aqueous ammonia storage tank system consists of a 50 psig primary horizontal pressure vessel (designed and manufactured in accordance with ASME Boiler and Pressure Vessel Code Section VIII) enclosed within a secondary containment tank (designed and manufactured in accordance with UL Standard 58) which is externally clad with fiberglass reinforced polyester resin (in accordance with UL Standard 1746).  The fiberglass resin was Holiday tested after delivery to ensure its integrity and corrosion inhibiting capability.\n\nThe primary vessel is equipped with a vacuum breaker with flame arrester and a large capacity relief valve set at 50 psig and vented to atmosphere 12 feet above grade.  The"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000008876,
      "SummaryText": "ia, directing the product to the station's retention basin. \n\nA liquid leak detection system is provided for the storage tank with leak detector elements installed in the secondary containment compartment (two elements), supply pump columns (one element each), safety relief valve discharge (one element), and underground piping secondary containment (one element).  The elements are wired to a local leak monitor and alarm panel which will also annunciate to control room operators via the plant distributed control system (DCS).  Detection of liquid in the underground piping secondary containment will trip the supply pumps.\n \nPROCESS HAZARD ANALYSIS (PHA)\nThe AES Redondo Beach RMP program includes a process to ensure that hazards associated with the aqueous ammonia SCR systems are identified and controlled.  Within this program, before any not-in-kind changes are implemented for the SCR systems, the process change is systematically examined to identify hazards and ensure that adequate safeguards are in place to manage these hazards.  \n\nAES Redondo Beach primarily uses the hazard and operability (HAZOP) analysis technique to perform these evaluations. HAZOP analysis in recognized as one of the most systematic and thorough hazard evaluation techniques.  A team of people who have operating and maintenance experience as well as engineering expertise conducts the analyses. This team identifies and evaluates hazards of the process as well accident prevention and mitigation measures. The team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.  \n\nThe PHA teams findings are forwarded to facility management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. The ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options are tracked until "
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000008876,
      "SummaryText": "they are completed. The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from original design safety features, AES Redondo Beach, as part of the five year resubmittal process, reviews (and if necessary) updates and revalidates the hazard analysis results.  Documentation of all PHAs conducted are maintained for inspection at the facility.\n\n\nOPERATING PROCEDURES\nThe AES Redondo Beach facility maintains written procedures that address various modes of SCR system (including storage tanks) operations.  These procedures generally include:\n\nA? Unit start up (boiler and flue gas blower) and operation;\nA? SCR system normal start-up, normal shut down and emergency shutdown;\nA? SCR system on-line operational procedures;\nA? Aqueous ammonia ordering and truck unloading procedure.\n\nOther AES Redondo Beach procedures potentially impact the operation of the SCR system and storage tanks, but are not directly related to SCR system or tank operations. These include general safety and fire protection policies, procedures and practices. The SCR system's general operation and maintenance is governed by these policies and practices where they apply.\n\nThese operational procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed to assure they are current and accurate.  The last informal review was conducted as part of the RMP resubmittal process in June 2004.  The procedures are kept current and accurate by annotating/revising them as necessary to reflect changes made through an formal management of change process.  The facility maintains several master sets of operational and maintenance procedures including a set in the relevant control room.\n\nTRAINING\nTo complement the written procedures for process operations, AES Redondo Beach has implemented a training program f"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000008876,
      "SummaryText": "or all employees involved in operating or maintaining the SCR systems.  As an integral part of the safety and hazardous materials training, training which includes the safe receiving, operation and maintenance of the SCR system and associated tanks is provided to all personnel who are or may be working with the SCR system and/or aqueous ammonia.  This training is accomplished utilizing resources available inside and outside the station.  In general, new employees receive basic training in plant operations if they not already familiar with such operations and all new workers working with the SCR system or associated tanks are trained in the SCR system operating procedures as well as the specific hazards of ammonia.  After successfully completing this training, a new operator is paired with an experienced operator to learn process-specific duties and tasks.  After operators demonstrate (e.g. through tests, skills demonstration, etc.) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. \n\nThe specific individual training programs at AES Redondo Beach is supported by the facility's Injury and Illness Prevention Program (IIPP) and written safety procedures manual, which emphasizes communication of safety hazards and requirements on a continuous basis, as well as general safety and safe work practices training.  As noted elsewhere in the RMP, hazardous materials emergency response training is also provided.  Training documentation is maintained by the facility.  \n\nThe SCR system and other safety training at AES Redondo Beach may be performed in various formats and environments including classroom, field-based, on-the-job, safety meeting, team meeting and informal 'one-off' type interactions.  In addition, the facility's current aqueous ammonia vendor implements its own training program for their employees (including drivers) and assists in conducting biennial refresher training at AES for truck delivery and "
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000008876,
      "SummaryText": "unloading procedures.  At AES Redondo Beach, the ammonia vendor also participates in the facility's on-site training related to ammonia handling.  The Redondo beach Fire Department also participates in on-site ammonia training.\n\nInitial SCR system operational and maintenance training was conducted for all station operations, maintenance and engineering personnel at the time each SCR system was constructed/installed as an integral part of each system's initial system start up and performance evaluation.  The training was conducted/supervised by the SCR system manufacturer/design company.  The training was both formal classroom-based and field-based.  A separate RMP program implementation training class was conducted in 1999 detailing the management and compliance requirements and responsibilities of the RMP/CalARP program.\n\nIn addition, all operators periodically receive refresher training on the operating procedures and hazards to ensure their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted as an integral part of the AES Redondo Beach ongoing safety training program, but is assured met at least every 3 years.  At AES Redondo Beach, recent periodic refresher training has included the hazards of ammonia, ammonia truck delivery, loading and emergency procedures, off site consequences, general emergency response, and SCR system maintenance. The SCR system and RMP compliance is a periodic element of the facility's monthly safety meetings, with the last RMP topic covered in 2008.\nAs an integral part of the Process Safety Information and Operating Procedures elements of the RMP, should the safety information or procedures be modified in any significant fashion, refresher training will be conducted.  \nAs part of the RMP submission, pursuant to 40 CFR 68.54(a) and 19 CCR 2755.4(a), AES Redondo Beach is hereby certifying that AES employees have the required knowledge, skills, and abilities to safely carry out the duties and re"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000008876,
      "SummaryText": "sponsibilities as provided in the operating procedures. \n\nMAINTENANCE\nAES Redondo Beach has established practices and procedures to maintain facility systems and controls, including those associated with the aqueous ammonia SCR systems and storage tanks.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, and (4) correcting identified deficiencies.  In combination, these activities form a process that maintains the mechanical integrity of the process.  Equipment-specific maintenance requirements and specifications for the SCR systems and storage tanks are contained in the multi-volume set of SCR System Operating and Maintenance Manuals provided by the two SCR system designers, NOELL and Mitsubishi.  Facility maintenance personnel use these manuals and the procedures contained therein as the primary references whenever performing SCR and storage tank inspection, maintenance, test and necessary repair/replacement.  These maintenance/operational procedures are maintained readily available to relevant personnel at the AES Redondo Beach facility.\n\nMaintenance personnel have received initial formal classroom training prior to initial SCR system startup as discussed in 'Training'.  SCR system equipment was incorporated into the AES Redondo Beach existing Preventive Maintenance Program.  The facility tracks and documents all manufacturer and regulatory-required maintenance and inspection activities, including a tickle file system for the Preventive Maintenance Program, on AES's computerized maintenance tracking system.  The maintenance procedures and requirements for the SCR systems was last reviewed in June 2009.\n\nEquipment routinely inspected includes pumps, lines, vents, detection systems, controls & settings, tank vessels, tank pressure relief valves (PRVs) and settings, system and piping markings, and other elements.  During any related or adjacent maintenance activities (whether "
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000008876,
      "SummaryText": "or not on the SCR system and tanks), any damage observed during these activities is repaired/replaced as appropriate.\n\nDesignated facility personnel perform daily housekeeping inspections, which specifically include the SCR system and tanks. As part of the facility's Clean Water Act/Hazardous Waste (RCRA) compliance program, all equipment is visually inspected by designated facility personnel a minimum of twice each shift, with the results documented on the RCRA and CWA Inspection Report.  Any damage or malfunction noted is reported and appropriately corrected.  Safety equipment associated with the ammonia systems (eye wash/shower, respirator protection, etc.) is also routinely inspected as part of the facility's ongoing existing occupational safety programs.\n\n\nCOMPLIANCE AUDITS\nTo help ensure that the accident prevention program is functioning properly, AES Redondo Beach periodically conducts an audit to determine whether the procedures and practices required by the risk management and accident prevention program are being implemented. Compliance audits are conducted at least every 3 years.  This audit reviews each of the USEPA-required prevention program elements to ensure that they are up-to-date and are being implemented and will help identify problem areas and if necessary take corrective actions.  Compliance audits are conducted by a team lead by AES Corporation corporate compliance personnel assisted by an outside compliance auditing consultant.  AES Redondo Beach personnel also participate in the audit.  An RMP compliance audit checklist is used during the audit.  The last audit (which included the RMP) was performed in July 2007 with the audit report issued to facility management for development and implementation of any corrective action in January 2008.  Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retaine"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000008876,
      "SummaryText": "d.\n\n\nINCIDENT INVESTIGATION\nA primary tool used by AES Redondo Beach to identify the contributing factor(s) responsible for accidents, incidents, occupational illnesses, or unusual hazardous events is a thorough and properly completed incident / accident investigation.  The incident investigation will attempt to focus on root causes or contributing factors associated with an accident or incident.  From these findings, corrective action will be initiated as necessary to reduce the potential for recurrence.  The incident investigation procedures used are an existing, integral part of the AES Redondo Beach Safety and Injury and Illness Prevention Program. The goal of each investigation is to determine the facts, identify causal factors and root causes, then develop corrective actions to prevent a recurrence of the incident or a similar incident.  The incident investigation procedures in effect at AES Redondo Beach are contained in the AES Redondo Beach Safety Manual (last revised 1/15/2009) and the Hazardous Materials Emergency Response Business Plan (a June 2009 revision is in progress).\n\nThe investigation team documents its findings, develops recommendations to prevent recurrence, and forwards these results to management for resolution. Corrective actions taken in response to the investigation teams findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so reports can be reviewed during future RMPs, PHAs and PHA revalidation.\n\nAlthough all industrial accidents or injuries are formally investigated as part of the facilityA?s ongoing safety program, specific to the aqueous ammonia handled in the SCR systems and associated storage tanks, AES Redondo Beach will make additional investigative efforts when i"
    }
  ]
}