{
  "FacilityID": 1000067786,
  "FacilityName": "Lund's Fisheries Inc.",
  "FacilityStr1": "997 Ocean Drive",
  "FacilityStr2": null,
  "FacilityCity": "Cape May",
  "FacilityState": "NJ",
  "FacilityZipCode": "08204",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34009",
  "LEPC": "Cape May County OEM",
  "FacilityLatDecDegs": "38.957453",
  "FacilityLongDecDegs": "-074.876243",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A5",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 69020774,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lund's Fisheries",
  "OperatorStr1": "997 Ocean Drive",
  "OperatorStr2": null,
  "OperatorCity": "Cape May",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08204",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Snyder",
  "RMPTitle": "Maintenance manager",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000237889",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-01-05 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-04-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-01-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-01-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-01-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085043,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000067786,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000086226,
          "ProcessID": 1000085043,
          "NAICSCode": "11411",
          "_desc": {
            "NAICS_CODE": "11411",
            "NAICS_DESCRIPTION": "Fishing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106081,
          "ProcessID": 1000085043,
          "ChemicalID": 56,
          "Quantity": 64700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606081,
          "ProcessID": 1000085043,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067786,
      "SummaryText": "Executive Summary\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nWe at Lund's Fisheries. are strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\nThe Stationary Source and the Regulated Substances Handled\n\nLunds Fisheries primary activities encompass Freezing of fish. We have 1 regulated substance present at our facility, ammonia (anhydrous).  \n\n\n\nThe Worst Case Release Scenario and the Alternative Release Scenario\n\n\n\nTo perform the required offsite consequence analysis for our facility, we have used the EPA's RMP Guidance for Ammonia Refrigeration Reference Tables or Equations\n\n\n\nThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n\n\nLunds Fisheries complies with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. \n\n\n\nThe following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nLunds Fisheries maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\nLunds Fisheries conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is What If/Checklist (combined). The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of every 5 years.  Any findings related to the hazard analysis are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067786,
      "SummaryText": " addressed in a timely manner.\n\n\n\nOperating Procedures\n\nTo safely conduct activities within our covered processes, Lunds Fisheries maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nLunds Fisheries has a comprehensive operator training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every 3 years and more frequently as needed.\n\n\n\nMechanical Integrity\n\nLunds Fisheries carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. \n\n\n\nMaintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Lunds Fisheries to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Lunds Fisheries. These reviews are conducted to confirm that construction, equipment,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067786,
      "SummaryText": " operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nLunds Fisheries conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every year and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nLunds Fisheries promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years. There have not been any accidents in the past 5 years.\n\n\n\nEmployee Participation\n\nLunds Fisheries truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Lunds Fisheries has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n\n\nEmergency Response Plan\n\nLunds Fisheries carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067786,
      "SummaryText": " includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nPlanned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program. "
    }
  ]
}