{
  "FacilityID": 1000046184,
  "FacilityName": "Town of Tonawanda Water Treatment Plant",
  "FacilityStr1": "218 Aqua Lane",
  "FacilityStr2": null,
  "FacilityCity": "Tonawanda",
  "FacilityState": "NY",
  "FacilityZipCode": "14150",
  "Facility4DigitZipExt": "7702",
  "FacilityCountyFIPS": "36029",
  "LEPC": "Erie County LEPC",
  "FacilityLatDecDegs": "42.950250",
  "FacilityLongDecDegs": "-078.916778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 147902555,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Town of Tonawanda",
  "OperatorStr1": "218 Aqua Lane",
  "OperatorStr2": null,
  "OperatorCity": "Tonawanda",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14150",
  "OperatorZipCodeExt": "7702",
  "RMPContact": "Daniel J. Weigel",
  "RMPTitle": "General Foreman",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122379",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-08-01 00:00:00",
  "SafetyInspectionBy": "NYS DOL PESH",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-08-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-08-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-08-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-08-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.96489,
  "FRS_Long": -78.92181,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "6",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000057429,
      "AltID": "2",
      "FacilityID": 1000046184,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000058369,
          "ProcessID": 1000057429,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070151,
          "ProcessID": 1000057429,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000570151,
          "ProcessID": 1000057429,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046184,
      "SummaryText": "This RMP submission applies to the Town of Tonawanda Water Treatment Plant located at 218 Aqua Lane in the Town of Tonawanda, New York (foot of Sheridan Drive). The facility supplies potable water to the Town of Tonawanda, and the village of Kenmore. In order to disenfect the drinking water, gaseous chlorine is utilized. This type of system is commonly used at most water treatment plants. The facility has a maximum capacity of\n\n16 one-ton cylinders (32,000 pounds) although, at most 8,000 pounds of chlorine are connected to the process (four one-ton cylinders). Following are the required seven elements for Water Treatment Plant.\n\n\n\nAccidental release prevention and emergency response policies- The Water Treatment Plant Complies with all Federal, State and Local requirements for chlorine processes.\n\nThe facility was designed and constructed in accourdance with applicable industry standards and codes. In an emergency the facility will call 911 and the local volunteer fire departments will respond. The facility has a written set of emergency response procedures that describes who to call under what conditions.\n\n\n\nStationary source and regulated substances handled-The facility is a potable water treatment plant. The facility has 32,000 pounds of chlorine on-hand at any one time.\n\n\n\nWorst case release scenario and alternative release scenario including administrative controls and mitigation measures to limit the distance for each reported scenario-\n\nThe worst case release scenerio is a rupture of a one-ton cylinder which is the largestvessel in the system. A release from the cylinder would include 2,000 pounds of chlorine. The release would be a liquid spilled onto the floor in the chlorine room. The cylinder room doors and windows are kept closed which will help mitigate the release.\n\nThe liquid will vaporize to from a vapor cloud. The cloud will be released from the building either via leakage, or by exhaust from the building, over a period of time, by the ventilation s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046184,
      "SummaryText": "ystem in the cylinder room. The alternate scenario would consist of a relaese from a broken cylinder pigtail that connects the chlorine to the process. \n\nThe release would be in the cylinder storage room. For both the worst case and alternate releases scenarios,chlorine detectors are in place that will detect the release and notify the treatment plant operator, which is on-duty 24 hours per day, seven days per week. The operator in turn will follow written procedures for notification of emergency personnel.\n\n\n\nGeneral accidental release prevention program and chemical specific prevention steps.\n\nThe facility complies with EPA's Risk Management Program requirements and all applicable state local codes and standards in effect at the time the facility was constructed. \n\n\n\nFive year accident history- There have been no releases from this facility in the past five years.\n\n\n\nEmergency Response Program- In the event of an emergency the facility will call 911 and request that the local fire department/hazmat team respond to the emergency. Several members of the Town of Tonawanda Water Plant have appropriate training on the use of personal protective equipment and may assist the fire departments with rescue,isolation, and shut-off of the release. Written emergency response procedures are provided in the facility's Emergency Response Plan. The local fire department has trained at the facility and will in the future attend drills at the facility.\n\n\n\n\n\n"
    }
  ]
}