{
  "FacilityID": 1000100086,
  "FacilityName": "Itafos Conda LLC",
  "FacilityStr1": "3010 Conda Road",
  "FacilityStr2": null,
  "FacilityCity": "Soda Springs",
  "FacilityState": "ID",
  "FacilityZipCode": "83276",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16029",
  "LEPC": "LEPC District 5, Pocatello, ID",
  "FacilityLatDecDegs": "42.737470",
  "FacilityLongDecDegs": "-111.541448",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.itafos.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 81009335,
  "ParentCompanyName": "Itafos",
  "Company2Name": null,
  "CompanyDUNS": 100405371,
  "Company2DUNS": 0,
  "OperatorName": "Itafos Conda LLC",
  "OperatorStr1": "3010 Conda Road",
  "OperatorStr2": null,
  "OperatorCity": "Soda Springs",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83276",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carlyle Miller",
  "RMPTitle": "EHS & S Manager",
  "FTE": 269,
  "OtherEPAFacilityID": "83276NWSTN3010C",
  "EPAFacilityID": "100000108082",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T1-2016.0015",
  "SafetyInspectionDate": "2021-10-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-02-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-02-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-02-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.73418,
  "FRS_Long": -111.54528,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000123774,
      "AltID": "NH3 Processes",
      "FacilityID": 1000100086,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000125167,
          "ProcessID": 1000123774,
          "NAICSCode": "325312",
          "_desc": {
            "NAICS_CODE": "325312",
            "NAICS_DESCRIPTION": "Phosphatic Fertilizer Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000154642,
          "ProcessID": 1000123774,
          "ChemicalID": 56,
          "Quantity": 1324012.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000654642,
          "ProcessID": 1000123774,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000100086,
      "SummaryText": "Executive Summary of the RMP Plan for\n\nItafos Conda LLC\n\n3010 Conda Road\n\nSoda Springs, Idaho 83276\n\n\n\n1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nWe at Itafos Conda LLC are strongly committed to employee, public and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Itafos has a fully implemented PSM program.\n\n\n\n2. THE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\n\n\n\nOur facility's primary activities encompass manufacturing agricultural chemicals; phosphoric acid and phosphate fertilizer. We have one (1) regulated substance present at our facility: Ammonia (anhydrous). Ammonia (anhydrous) is used for formulation of granular phosphate fertilizer.\n\n\n\n3. THE WORST CASE RELEASE SCENARIO(S) AND THE ALTERNATIVE RELEASE SCENARIO(S) \n\n\n\nWell-documented offsite consequence analyses are essential for adequate communication of potential hazards at the stationary source. Itafos Conda LLC conducted offsite consequence analyses, using the Environmental Protection Agency's (EPA's) RMP Offsite Consequence Analysis Guidelines. Itafos developed these analyses to determine a reasonable \"outer bound\" for emergency response planning and for explaining potential hazards to the community if affected. Details of the release scenarios, the anticipated off-site impact area, and the likely population in that area have been provided to the EPA.\n\n\n\n&#8195;\n\n4. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 by the EPA. The following sections briefly describe the ele"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000100086,
      "SummaryText": "ments of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nItafos Conda LLC maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis (PHA)\n\nOur facility conducts comprehensive PHA's to ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is What If/Checklist (combined). The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of five years. Any findings related to the hazard analysis are addressed in a timely manner. \n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Itafos Conda LLC maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, startup after an emergency shutdown, and normal shutdown and startup. The information is regularly reviewed and is readily accessible to operators involved in the processes. The facility has a fully implemented Startup, Shutdown and Malfunction (SSM) Plan, per 40 CFR 63.6(e)(3). The SSM Plan is on file with the Idaho Department of Environmental Quality. \n\n\n\nTraining\n\nItafos Conda LLC has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least every three (3) years and more frequently as needed.\n\nMechanical Integrity\n\nItafos Conda LLC carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes among others; pressure vessels, storage"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000100086,
      "SummaryText": " tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Itafos Conda LLC to manage changes in process chemicals, technology, equipment, and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at Itafos Conda LLC. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nItafos Conda LLC conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nItafos Conda LLC promptly investigates any incident that has resulted in or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.\n\n\n\n\n\nEmployee Participation\n\nItafos Conda LLC truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevent"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000100086,
      "SummaryText": "ion issues and to recommend improvements. In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. Itafos Conda LLC has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n5. FIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere has been no accidental release of an RMP regulated substance at Itafos Conda LLC facility during the last five (5) years that resulted in death, injury, or significant property damage onsite.\n\n\n\n6. EMERGENCY RESPONSE PLAN\n\n\n\nItafos Conda LLC has a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nOur emergency response equipment is regularly inspected and serviced to ensure proper function. In addition, the emergency response plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nLEPC District 5, Pocatello, ID is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nItafos Conda LLC is an OSHA VPP STAR facility. We maintain a continuous improvement process, including Safety. As developments and findings result from the implementation"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000100086,
      "SummaryText": " of the various elements of our accidental release prevention program, steps will be taken to improve safety at our facility. These changes will be implemented in a timely fashion.\n\n"
    }
  ]
}