{
  "FacilityID": 1000083394,
  "FacilityName": "Fresh Express, Incorporated",
  "FacilityStr1": "900 East Blanco Road",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": null,
  "FacilityLatDecDegs": "36.651140",
  "FacilityLongDecDegs": "-121.637290",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 154483457,
  "ParentCompanyName": "Chiquita Brands International",
  "Company2Name": null,
  "CompanyDUNS": 154483457,
  "Company2DUNS": 0,
  "OperatorName": "Fresh Express, Incorporated",
  "OperatorStr1": "900 East Blanco Road",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 592,
  "OtherEPAFacilityID": "CAL000354418",
  "EPAFacilityID": "100000080137",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-01-01 00:00:00",
  "SafetyInspectionBy": "Cypress Engineering Group",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-11-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-11-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-11-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-11-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.65287,
  "FRS_Long": -121.63785,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000104250,
      "AltID": null,
      "FacilityID": 1000083394,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000130572,
          "ProcessID": 1000104250,
          "ChemicalID": 56,
          "Quantity": 57000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000105583,
          "ProcessID": 1000104250,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000088194,
              "Process_NAICS_ID": 1000105583,
              "SafetyReviewDate": "2018-12-12 00:00:00",
              "PHA_Date": "2019-09-10 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-03-10 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 1,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Water Diffusion",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Annual Implementation of Safety Cutout Tests",
              "OpProceduresReviewDate": "2018-12-12 00:00:00",
              "TrainingReviewDate": "2018-12-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-12-12 00:00:00",
              "EquipmentInspectionDate": "2019-09-12 00:00:00",
              "EquipmentTested": "All Equipment (Inspected Weekly)",
              "ChangeMgmtDate": "2018-11-28 00:00:00",
              "ChangeMgmtReviewDate": "2018-11-28 00:00:00",
              "PreStartupReviewDate": "2018-11-28 00:00:00",
              "ComplianceAuditDate": "2017-05-04 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": "2018-11-10 00:00:00",
              "InvestigationChangeDate": "2018-11-20 00:00:00",
              "ParticipationPlansReviewDate": "2017-03-08 00:00:00",
              "HotWorkPermitReviewDate": "2017-03-20 00:00:00",
              "ContractorSafetyReviewDate": "2019-01-11 00:00:00",
              "ContractorSafetyEvalDate": "2018-11-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "The process is a closed loop system. Under normal operation, the system neither exposes nor releases ammonia to the surrounding atmosphere. The process transfers heat from evaporator coils (located in the areas to be cooled).",
              "_chemicals": [
                {
                  "PrimaryKey": 1000109923,
                  "PreventionProgram3ID": 1000088194,
                  "ProcessChemicalID": 1000130572
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000083394,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Salinas Fire Department",
    "CoordinatingAgencyPhone": "8317587466",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083394,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThis Executive Summary contains Fresh Express's administrative and operational programs to prevent ammonia-related accidents and reduce potential risks. The regulated substance of concern and focus of this document is ammonia. The following topics are addressed in the Executive Summary:\n\n\n\n?    Accidental Release Prevention and Emergency Response Policies\n\n?    Stationary Source and Regulated Substance\n\n?    Hazard Assessment Summary\n\n?    Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n?    Five Year Accident History\n\n?    Emergency Response Program\n\n?    Planned Changes to Improve Safety\n\n?    Updating\n\n\n\nThe following Data Elements sections are attached:\n\n\n\n?    Section 1:    Registration Information\n\n?    Section 2:    Toxics - Worst Case Release \n\n?    Section 3:    Toxics - Alternative Release \n\n?    Section 4:    Flammables - Worst Case Release (NOT APPLICABLE)\n\n?    Section 5:    Flammables - Alternative Release (NOT APPLICABLE)\n\n?    Section 6:    Five Year Accident History\n\n?    Section 7:    Prevention Program 3 Component \n\n?    Section 8:    Prevention Program 2 Component (NOT APPLICABLE)\n\n?    Section 9:    Emergency Response Component\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nFresh Express is a ready-to-eat salad production company. The facility was constructed in 1999.\n\n\n\nFresh Express is not only committed to maintaining a safety and environmental program to promote a safe environment for all employees and the surrounding communities, but also to offering superior service. Fresh Express Business Plan, employee safety manuals, manufacturer's documentation, Emergency Response, as well as the Risk Management Plan.\n\n\n\nThe Fresh Express facility has independently coordinated emergency response efforts with the local Fire Department. In the case of an ammonia emergency, it is the policy of Fresh Express to evacuate the employees and to allow the fire department/HazMat team to respond to the emergency.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Fres"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083394,
      "SummaryText": "h Express facility is located at 900 East Blanco Road, in Salinas, California, which is approximately 2 miles west of Highway 1 and 1/4 miles south of San Juan Road.  The area immediately surrounding the facility is urban.\n\n\n\nWhen in service, the refrigeration process equipment operates continuously. The Compressors cycle on and off to comply with system demand during operation.  The Compressors, Suction Accumulators, Emergency Control Box, and Auto Purger are located inside the Engine Room, the Evaporative Condensers and the High Pressure Receivers are located outside, and the Low Pressure Receivers, Air Units, and Water Chillers are located in Processing Zones 1 - 6.\n\n\n\nThe refrigeration cycle begins with the transfer of liquid ammonia from the Evaporative Condensers (EC-1, EC-2, EC-3, EC-4, EC-5, EC-6, EC-7) to the High Pressure Receivers (HVR-1, HVR-2). \n\n\n\nThe Suction Accumulators (SA-1, SA-2, SA-3, SA-4) receive high pressure liquid from the High Pressure Receivers. The liquid ammonia travels through a sub-cooling coil inside of the vessel, which reduces the temperature of the liquid. The resulting subcooled liquid is then fed to the Low Pressure Receivers (LPR-1, LPR-2, LPR-3, LPR-4, LPR-5, LPR-6), and to the Compressors (SC-1, SC-2, SC-3, SC-4, SC-5, SC-6, SC-7) for oil cooling. The Suction Accumulators also receive return suction from the Low Pressure Receivers. Liquid present in the return suction drops to the bottom of the vessel where it is boiled off by the coils, and the vapor rises to the top of the vessel and is drawn off by the Compressors. \n\n\n\nThe Low Pressure Receivers receive subcooled liquid ammonia from the Suction Accumulators. The liquid ammonia is then pumped to Air Units located in Zones 1, 2, 3, and 4, and to Water Chillers in Zones 5 and 6, where it is partially vaporized as heat is removed from the water, product, and cooler/processing rooms. The resulting liquid/vapor is drawn back to the Low Pressure Receivers. \n\n\n\nHigh stage suction i"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083394,
      "SummaryText": "s drawn from the Suction Accumulators  by the Compressors, where the pressure and temperature of the vapor is increased. Compressor discharge (high pressure ammonia vapor, or hot gas) is then sent to the Evaporative Condensers, where the vapor condenses into a high pressure liquid and is returned to the High Pressure Receivers to begin the refrigeration cycle again. Some compressor discharge is also sent to the Air Units in Zones 1, 2, 3, and 4, for hot gas defrost purposes. Liquid injection oil cooling is provided by the High Pressure Receivers. \n\n\n\nThe vessels and compressor oil separators are equipped with pressure relief valves which vent to the Ammonia Diffusion Tank.\n\n\n\nAn auto purger (AP-1) is present to remove non-condensables from the system. There is an Emergency Control Box in place as well to help refrigeration operators diffuse high pressure scenarios before pressure relief valves activate.\n\n\n\nThe maximum intended inventory of ammonia is 57,000 pounds.\n\n\n\nThe system is monitored 24 hours a day via the control system. When off-site, operators are notified in the event of an alarm and/or system shutdown. \n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nThe Fresh Express ammonia system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. \n\n\n\nThe PSM / RMP / CalARP program ensures that all security and safety procedures are addressed.  Staff is trained in operation, maintenance and emergency procedures related to the operation of the ammonia system. All pressure vessels in the ammonia system are equipped with relief valves that vent to the Ammonia Diffusion Tank at a certain pressure set point. A preventative maintenance program assures that equipment is maintained and serviced on a regular schedule and that worn, aging, or defective components are replaced as required to maintain equipment in good operating condition.  Controls and s"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000083394,
      "SummaryText": "he amount of risk identified in the facility's PSM / RMP / CalARP document, then Fresh Express will do the following:\n\n\n\n1.    Notify the Monterey County Health Department, Environmental Health Bureau in writing of the intent to modify the facility at least five calendar days before implementing any modifications. As part of the notification process, the Engineering/Maintenance Manager shall consult with the Monterey County Health Department, Environmental Health Bureau to determine the necessary documentation modification requirements. If pre-notification is not possible, Fresh Express will provide a written notice no later than 48 hours following the modification.\n\n\n\n2.    Update the necessary documentation within 60 days from the date of the modification.\n\n\n\nNote:    The CalARP Program Regulation defines a reportable accident [19 CCR 2750.9 (a)] to be the following:\n\n\n\n\"The owner or operator shall include in the Five Year Accident History all accidental releases from covered processes that resulted in death, injuries, or significant property damage on site or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\"\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083394,
      "SummaryText": "afety devices are inspected regularly to ensure proper operation.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nEPA's RMP Program defines \"accident\" as the following:\n\n\n\n\"An unanticipated emission of a regulated substance or other extremely hazardous substance into the ambient air from a stationary source.\"\n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nBased on the above definition and upon verification with the facility on September 13, 2019, there have been no releases of ammonia that meet this criteria in the past five years (September 2014 - September 2019). There were, however, two \"near miss\" events at the Fresh Express facility: the first occurred at 10:40 PM on September 25, 2016, and the second occurred at 8:30 AM on November 11, 2018.  \n\n\n\nThe September 2016 event consisted of a leak coming from a liquid solenoid coil stem in Zone 3 that released approximately twenty-one (21) pounds of ammonia to the environment (air). Immediate corrective action taken was an isolation of the leak. An employee of PSSI (contractor) who was exposed to the ammonia vapor was taken to the hospital and released the same day with no injuries after a medical evaluation. \n\n\n\nThe November 2018 event consisted of a pinhole leak on the return line of an air-cooling evaporator in Zone 2. The leak was noticed by a mechanic at 8:30 AM, an evacuation of the facility's employees was ordered and the fire department was called at 8:37 AM, and an all clear for the facility was given a representative from the Monterey County Health Department at 3:00 PM. The immediate corrective action taken was an isolation of the leak, there were no injuries that resulted due to this release of ammonia, and a total of approximately forty-eight (48) pounds of ammonia to the environment (air).\n\n\n\nEMERGENC"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000083394,
      "SummaryText": "Y RESPONSE PROGRAM\n\n\n\nFresh Express is a non-responding facility and has an emergency action plan (EAP) in effect. This Plan was designed to meet the following objectives:\n\n\n\n1. To save lives.\n\n2. To minimize and avoid injuries.\n\n3. To protect the environment.\n\n4. To minimize property damage.\n\n\n\nThe operator of the facility maintains a safety committee whose members are the designated emergency coordinators for the facility. The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan was reviewed and updated to ensure compliance with the PSM / RMP / CalARP regulations.\n\n\n\nIn the event of an ammonia emergency, the operator of the Fresh Express facility plans to evacuate all employees in the facility and alert the local emergency responders (fire department). The operator of the facility plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n \n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazard Analysis (PHA) study, conducted on September 10-12, 2019, including a What-If study and a facility inspection, provided mitigation measures to improve safety at the Fresh Express facility. Fresh Express's safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees. These changes include the following items:\n\n\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n\n\nUPDATING\n\n\n\nIn addition to maintaining the records that support the PSM / RMP / CalARP documents, Fresh Express is obligated to"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000083394,
      "SummaryText": " update these documents in accordance with and 19 CCR ?2745.10. This includes submitting the modifications in a method and format to the Monterey County Health Department, Environmental Health Bureau. The following items outline the criteria for updating the PSM / RMP / CalARP document.\n\n\n\n1.    Within five years of its initial submission or most recent update required by items 2 through 7 (NOTE: Five year update criteria shifts to five years from the revision date if an update is required as per items 2 through 7);\n\n\n\n2.    No later than three years after a newly regulated substance is first listed by the California Office of Emergency Services;\n\n\n\n3.    No later than the date on which a new regulated substance is first present in an already covered process above a threshold quantity;\n\n\n\n4.    No later than the date on which a regulated substance is first present above a threshold quantity in a new process;\n\n\n\n5.    Within six months of a change that requires a revised HAZOP or Hazard Review;\n\n\n\n6.    Within six months of a change that requires a revised off-site consequence analysis (Hazard Assessment) (i.e. process is moved so as to affect different sensitive receptors, the quantity of the regulated substance is increased, etc.);\n\n\n\n7.    Within six months of a change that alters the program level that applied to any covered process (Program 1, 2, or 3).\n\n\n\n8.    Within six months of the date of an \"accident\" (see note on the following page); a correction to reportable information must be made to Monterey County Health Department, Environmental Health Bureau.\n\n\n\n9.    Within one month of a change to emergency contact information; a correction must be filed with the Monterey County Health Department, Environmental Health Bureau.\n\n\n\nIn the event that Fresh Express intends to make a modification to the ammonia system and that modification may result in a significant increase in either, (i) the amount of ammonia handled at the facility; or (ii) the risk of handling the ammonia as compared to t"
    }
  ]
}