{
  "FacilityID": 1000099483,
  "FacilityName": "Arctic Cold LLC.",
  "FacilityStr1": "2600 Sakioka Drive",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.213506",
  "FacilityLongDecDegs": "-119.139542",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tim Dayton",
  "OperatorStr1": "2600 Sakioka Drive",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93030",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Saldana",
  "RMPTitle": "Plant Manager",
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000247672",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-09-30 00:00:00",
  "SafetyInspectionBy": "Oxnard Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-02-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-02-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-02-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000123033,
      "AltID": "Refrigeration System",
      "FacilityID": 1000099483,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000124445,
          "ProcessID": 1000123033,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000153836,
          "ProcessID": 1000123033,
          "ChemicalID": 56,
          "Quantity": 38018.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000653836,
          "ProcessID": 1000123033,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000099483,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nArctic Cold, LLC. is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process equipment at the facility. \n\n\n\nArctic Cold, LLC. senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. Arctic Cold, LLC. safety and environmental policies as they relate to the ammonia refrigeration system are administered by the General Manager with assistance from the Chief Engineer, who conducts inspections of the facility to ensure compliance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Arctic Cold, LLC. facility is located at 2600 Sakioka Drive in Oxnard, California, which is approximately 0.5 miles south of US Route 101 and approximately 1.7 miles east of CA Highway 1. Currently, the area immediately surrounding the facility is rural with a mixture of light industrial. The area surrounding the facility is anticipated to be an industrial park with an Amazon warehouse already operational. The facility was constructed 2021 and will began operations in December of the same year. \n\n\n\nThe primary business of Arctic Cold, LLC. is to provide cooling and cold storage of various food products. To conduct operations, the facility maintains a refrigeration system containing approximately 38,000 pounds of anhydrous ammonia, a regulated substance. The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) to provide refrigeration for the cold storage of food products. \n\n\n\nACC"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000099483,
      "SummaryText": "IDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n\n\nEPA's Risk Management Program (RMP);\n\nOSHA's Process Safety Management (PSM); and\n\nCalifornia Accidental Release Prevention Program (CalARP). \n\n\n\nAdministrative Measures:\n\n\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\nIIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie ins\"\n\n\n\nIIAR 6, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\" \n\n\n\nIIAR, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\"\n\n\n\nThe Arctic Cold, LLC. ammonia refrigeration system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. For example, the Arctic Cold, LLC. facility operates in accordance with the Process Safety Management (PSM), Risk Management Program (RMP), and California Accidental Release Prevention (CalARP) Program. It is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia. For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits. Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.\n\n\n\nEngineering Measures:\n\n\n\nOther safety features of the ammonia refrigeration system include: emergency shutdown switches that kill power to the engine room equipment (located outside the Engine Room door), an emergency pressure control system to relieve pressure from a high pressure suction line to a lower"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000099483,
      "SummaryText": " pressure suction line, relief valves on all pressure vessels, continuous ventilation (controlled by a thermostat), and emergency ventilation in the Engine Room to prevent explosions. The facility has also installed ammonia sensors at strategic locations throughout the facility.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe refrigeration system at Arctic Cold, LLC. is of new construction at the time the PSM / RMP / CalARP documentation was submitted (December 2021). System start-up is scheduled for mid-December 2021. Therefore, there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds, or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material in the past five years. In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Arctic Cold, LLC. facility has an emergency action plan in effect. The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM / RMP / CalARP document. This Plan was designed to meet the following objectives:\n\n\n\n1.) To save lives.\n\n2.) To minimize and avoid injuries.\n\n3.) To protect the environment.\n\n4.) To minimize property damage.\n\n\n\n\n\nThe Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility. This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the PSM, RMP and CalARP regulations.\n\n\n\nArctic Cold, LLC. personnel circulate throughout the plant, taking note of unusual conditions in any portion of the system. If an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate are"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000099483,
      "SummaryText": "a who are unaware of the danger, and the supervisor. The supervisor will contact the designated personnel to evaluate and ascertain the significance of the leak. If the ammonia leak is considered minor and/or minimal, the repair will be conducted by the Arctic Cold, LLC. refrigeration maintenance staff. An outside refrigeration contractor may be contracted to further assist in the potential repairs to the equipment pertaining to the ammonia system. For major ammonia leaks, emergency agencies will also be notified as necessary as outlined in the Emergency Action Plan. Action is promptly taken to mitigate the leak so normal operations can resume.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazard Analysis, performed in September 2021, generated mitigation measures (recommendations) to improve safety at the Arctic Cold, LLC. facility located in Oxnard, California. The mitigation measures include training, key maintenance related tests/inspection, and enhanced emergency response policies and procedures. The Arctic Cold, LLC. management is planning to complete several items, including the recommendations, over the next 2.5 years or sooner as a continual effort to provide a safe work environment for their employees. \n\n"
    }
  ]
}