{
  "FacilityID": 1000053020,
  "FacilityName": "Air Liquide Large Ind. US, L.P., El Segundo H2 Fac",
  "FacilityStr1": "1310 East El Segundo Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "El Segundo",
  "FacilityState": "CA",
  "FacilityZipCode": "90245",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.905833",
  "FacilityLongDecDegs": "-118.401944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Air Liquide Large Industries US, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 3312600,
  "Company2DUNS": null,
  "OperatorName": "Air Liquide Large Industries US, LP",
  "OperatorStr1": "9811 Katy Freeway",
  "OperatorStr2": "Suite 100",
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77024",
  "OperatorZipCodeExt": null,
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190232",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "148236",
  "SafetyInspectionDate": "2015-04-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-07-05 12:11:02",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-10-28 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-10-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-10-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.905833,
  "FRS_Long": -118.401944,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000066688,
      "AltID": "Hydrogen Production",
      "FacilityID": 1000053020,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000082435,
          "ProcessID": 1000066688,
          "ChemicalID": 155,
          "Quantity": 33264.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000070312,
              "ProcessChemicalID": 1000082435,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000070313,
              "ProcessChemicalID": 1000082435,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000070311,
              "ProcessChemicalID": 1000082435,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000067850,
          "ProcessID": 1000066688,
          "NAICSCode": "32512",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000053020,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-07-18 00:00:00",
    "ERTrainingDate": "2015-09-04 00:00:00",
    "CoordinatingAgencyName": "El Segundo Fire Department",
    "CoordinatingAgencyPhone": "3105242395",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000053020,
      "SummaryText": "AND REGULATED SUBSTANCES HANDLED\r\nThe Hydrogen Facility is located at 1310 East El Segundo Blvd, El Segundo, California, 90245 on the Chevron El Segundo Refinery property. The facility's mailing address is 214 Main St. PMB #286, El Segundo, California, 90245. The Hydrogen Facility's size is approximately 3.5 acres, and it is located in the south east corner of the refinery. The area directly east of the facility is predominately zoned for heavy industrial activities. However, to the South residential property is located within approximately 0.4 miles. Also, no environmental receptors have been identified within this area.\r\n\r\nThe products from the Hydrogen Facility are hydrogen and steam. The unit produces raw hydrogen, which is then purified. There are three types of feed stock for the unit: pentane, natural gas, and refinery fuel gas. The fuel for the reformer furnace is off-gas from the pressure swing adsorption unit, supplemented with refinery fuel gas or natural gas.\r\nThe hydrogen process is a combination of feedstock and product streams and meets the criteria for classification as a flammable mixture pursuant to the regulations at Title 19 of the California Code of Regulations (19 CCR), Division 2, Chapter 4.5,  Section 2770.2 (b)(2). The total quantity of flammable mixture present at the facility is 44884 pounds. The quantity of flammable mixture exceeds the 10,000 pound threshold for both the EPA RMP and CalARP regulations, therefore; considered a covered process.\r\nFacility personnel have completed a determination for the quantities of all potentially regulated substances at the facility. Refer to Appendix A, A-1 for the calculations regarding the flammable mixture for RMP and CalARP regulations.  \r\n\r\n1.3 \tHAZARD ASSESSMENT RESULTS\r\nTo meet the EPA RMP and the CalARP regulations, the Hydrogen Facility has analyzed several worst-case scenarios to determine the scenario with the greatest distance in any direction to the end point resulting from an accidental r"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000053020,
      "SummaryText": "1.0 \tExecutive Summary\r\n\r\nAir Liquide Large Industries US, L.P. (Air Liquide) operates a hydrogen plant within the Chevron refinery located in El Segundo, California (Hydrogen Facility). This document addresses the requirements of the United States Environmental Protection Agency's (EPA) Risk Management Plan (RMP) and the California Accidental Release Prevention (CaIARP) program with regards to the hydrogen processes on site. The following summarizes the required elements of a Program 1 facility.\r\n\r\n1.1 \tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\nOur commitment to Safety and Environmental Protection in the Air Liquide, El Segundo Hydrogen Plant must extend beyond the gates. As part of the community, we have a responsibility to our customers and to those who live in the surrounding area to help provide a safe working and living environment. Through safety, concern for the environment, and community involvement, we can develop a true partnership with our customers and neighbors.\r\n\r\nThe Hydrogen Facility has accidental release protection programs for all covered processes, which includes a prevention program with the following elements:\r\n¿\tMaintaining up-to-date safety information;\r\n¿\tConducting a process hazard analysis;\r\n¿\tImplementing operating procedures;\r\n¿\tImplementing a staff training program;\r\n¿\tImplementing a maintenance program;\r\n¿\tConducting compliance audits; and\r\n¿\tConducting incident investigations.\r\n\r\nAn Emergency Action Plan has been developed to help instruct personnel how to respond in case of an emergency. Emergency response actions involve the system operators and maintenance staff, as well as the local El Segundo Fire Department. In addition, the Plant Manager or an appointed representative serves as the focal point during and following an accidental release for notifying the Chevron El Segundo Refinery, reporting to the appropriate agencies, and providing information to the public.\r\n\r\n1.2 \tDESCRIPTION OF THE STATIONARY SOURCE"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000053020,
      "SummaryText": "elease of regulated flammable and toxic substances from covered processes under worst-case conditions. Administrative controls and passive mitigation devices are present to mitigate off-site consequences, however none of these devices were considered in the Worst Case Scenario (WCS). Historical data from industry reported chemical accidents were reviewed to ensure a credible event was chosen. All modeling was done with EPA RMP*Comp version 2.01.\r\nIt was determined from the analysis of flammable mixture, that the pentane feedstock had the greatest distance in any direction to the end point resulting from an accidental release of regulated flammable substance from covered processes.\r\n1.3.1 WCS Flammable\r\nThe pentane feedstock meets the criteria for classification as a flammable mixture, which consists of butane, isopentane, and pentane. The predominant component in this mixture is isopentane. The largest quantity of this flammable mixture contained in a single location within the facility is at the pentane feed surge drum, V-100. The maximum quantity of flammable mixture that could be contained in this vessel has been estimated at 30,754 pounds. The worst-case scenario (WCS) associated with a flammable material at the Hydrogen Facility is a catastrophic failure of the feed surge drum due to over-pressurization from a fire near the tank. The WCS has been modeled such that the entire contents of this vessel are released as a vapor within 10 minutes.\r\n\r\nEPA's RMP*Comp software was used to model this WCS. The estimated impacts (distance to endpoint) from the worst-case release scenario involving the flammable mixture extends to 0.2 miles. Within this circle of 0.2 miles radius, there are no public receptors. The closest area onsite that is occupied by the onsite contractors is a small parking lot on the Chevron Refinery. This lot is 0.28 miles from the pentane tank, which is outside the modeled WCS area.\r\n\r\n1.4 \tGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\nIn addition t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000053020,
      "SummaryText": "o the CalARP and EPA RMP regulations, processes at the Hydrogen Facility are also subject to the OSHA Process Safety Management (PSM) standard. Although not required for Program 1 facilities under Ca1ARP and EPA RMP regulations, a prevention program has been developed by the Hydrogen Facility that includes the following elements (also indicates the applicable internal regulation number):\r\n¿\tEmployee participation in process safety management and accident prevention (PSM - Employee Participation, 2B-LIPSM-ADM-0319-P); \t\t\t\r\n¿\tProcess safety information to address chemical properties and associated hazards,\r\nequipment design/configuration information, specific chemical inventories and\r\noperation limits for key process parameters (El Segundo SMR Process Safety\r\nInformation for PSM/RMP/Ca1ARP Covered Processes, 3-ELSSMR-HS-0005-Y);\r\n¿\tProcess hazard analysis to help ensure that hazards associated with the various processes are identified and controlled (Implementing Process Hazard Analysis, 2B-LI-ORM-0008-P);\r\n¿\tMaintenance of written operating procedures that address various modes of process operations (PSM/RMP Annual Review and Certification of Operating Documents, 2B-LIPSM-OPS-0300-P);\r\n¿\tImplementation of a formal training program for all employees involved in operating the process (El Segundo SMR Training Matrix, 3-ELSSMR-TRN-0001-T);\r\n¿\tPre-startup safety reviews of new/modified facilities or processes before placing those facilities or processes into service (Large Industries Pre-Startup Safety Review, 2B-LI-ORM-0003-P);\r\n¿\tPractices and procedures to ensure mechanical integrity and to maintain pressure vessels, piping systems, relief valve and vent systems, controls, pumps, compressors, and emergency shutdown systems in a safe operating condition (El Segundo SMR RMP Mechanical Integrity, 3-ELSSMR-OPS-1004-P);\r\n¿\tSafe work practices in place to help ensure employee and process safety. The facilities Life Critical procedures include the following (Safe Work Permit,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000053020,
      "SummaryText": "2-ALL-HSS-0220-P, Hot Work,, 2-ALL-HSS-0200-P, El Energy Control and Isolation, 2-ALL-HSS-0260-P-1, Confined Space Entry, 2-ALL-HSS-0240-P and Process Line Break, 2-ALL-HSS-0200-P);\r\n¿\tManagement of change requirements for ensuring that proposed process or equipment changes or changes indirectly affecting processes are evaluated, approved and documented prior to implementation (Large Industries Management of Change, 2B-LI-ORM-0002-P);\r\n¿\tIncident investigation and reporting to proactively identify root causes and correct them rather than simply addressing the symptom of the incident (Large Industries Reliability, Safety, PSI, PSSI and Near Miss, 2B-LI-OPS-0018-P);\r\n¿\tCompliance audits to help ensure the accident prevention program is functioning properly (PSM/RMP Compliance Audit, 2B-LI-AUD-0303-P); and \r\n¿\tContractors pre-qualification and assessment process in place to ensure the safety of our contractors and  communicate process safety risk prior to initiation of work  (Large Industries Contractor Safety, 2B-LI-HS-0010-P0)\r\n\r\n1.5 \tCHEMICAL SPECIFIC PREVENTION STEPS\r\nThe processes at the Hydrogen Facility have hazards that must be managed to ensure continued safe operation. The accident prevention program summarized in Section 1.4 is applied to CalARP/RMP covered flammable mixture process in the Hydrogen Facility. These prevention program activities help prevent potential accident scenarios that could be caused by (1) equipment failures and (2) human errors.\r\nIn addition to the accidental release prevention program, the Hydrogen Facility has safety features designed to (1) quickly detect the release, (2) contain/control the release; (3) reduce the consequence of (mitigate) a release.\r\n\r\nThe following types of safety features are used in various processes:\r\n¿\tDetection of Release: Several cameras have been installed in order to monitor releases/spills/fires in the process area remotely from the control room. Personnel carry portable 4 gas detectors which include f"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000053020,
      "SummaryText": "lammable LEL, carbon monoxide and oxygen. \r\n¿\tRelease Containment/Control: A containment dike has been installed to mitigate the release of pentane from the feed surge vessel, V-100; and\r\n¿\tRelease Mitigation: Twelve firewater monitors have been installed on the perimeter of the facility and are capable of cooling the process equipment. Fire extinguishers are also installed throughout the facility. \r\nIn addition, the City of El Segundo's Mass Notification System that can alert citizens of emergencies via cell phone, text message, e-mail, or home phone. Persons who are registered for notifications via the City's website 0A):11www.elsegundo.or0 will receive notifications for emergencies, including significant events at the refinery or Air Liquide what would affect surrounding residents.\r\n\r\n1.6 \tFIVE-YEAR ACCIDENT HISTORY\r\nCalARP regulations require facilities to compile a five-year accident history. This is defined as all accidental releases from covered processes that resulted in death, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage (19 CCR, Chapter 4.5, Section2750.9). According to information provided by Air Liquide personnel, there have been no accidental releases of flammable mixtures that meet the above definition since the Hydrogen Facility was constructed in 2004.\r\n\r\n1.7 \tEMERGENCY RESPONSE PROGRAM INFORMATION \r\nThe Hydrogen Facility is designated as a non-responding plant, falling under Title 40 of the Code of Federal Regulations (40 CFR) CFR Section 68.90(b) with respect to the EPA RMP and under 19 CCR Division 2 Chapter 4.5 section 2765.2 with respect to Ca1ARP. The El Segundo Hydrogen Facility employees are trained only to the First Responder Awareness Level, First Aid Fire Responder, and for First Aid and CPR. The El Segundo Hydrogen Facility is located within the Chevron El Segundo refinery, and the facility, in cooperation with the refiner"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000053020,
      "SummaryText": "y, has jointly reviewed the Air Liquide Emergency Action Plan to insure appropriate action can be taken in the event of an accidental release. The Refinery Emergency Responders will perform emergency response for Air Liquide in the event of an accidental release. The procedure for activating the Refinery's Emergency Notification System is found in the Emergency Action Plan El Segundo SMR, 3-ELSSMR-HS-0001K that was last reviewed on July 18, 2014. This document describes the coordination of response activities with local response agencies, outside agency notification procedures, and provides detailed evacuation procedures in the event of an ammonia release and/or fire.\r\n\r\nIf an emergency occurs that will have off-site consequences, a Unified Command structure will be established based on the Chevron El Segundo Refinery Emergency Response Plan. The El Segundo Hydrogen Facility Emergency Response Coordinator will work with the Unified Command to ensure they are aware of the on-site hazardous materials and familiar with the El Segundo Hydrogen Facility Emergency Action Plan.\r\n\r\n1.8 \tPLANNED CHANGES TO IMPROVE SAFETY\r\nSafety items at the Hydrogen Facility were addressed in the initial process hazard analysis. No upgrades to improve the safety of the covered process were being considered or planned at the time of this document's preparation and submittal."
    }
  ]
}