{
  "FacilityID": 1000038450,
  "FacilityName": "Priority Cooling, LLC",
  "FacilityStr1": "4899 East Gila Ridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Yuma",
  "FacilityState": "AZ",
  "FacilityZipCode": "85365",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04027",
  "LEPC": "Yuma County LEPC",
  "FacilityLatDecDegs": "32.678111",
  "FacilityLongDecDegs": "-114.547778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mann Packing",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Priority Cooling, LLC",
  "OperatorStr1": "4899 East Gila Ridge Road",
  "OperatorStr2": null,
  "OperatorCity": "Yuma",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85365",
  "OperatorZipCodeExt": null,
  "RMPContact": "Doug Leach",
  "RMPTitle": "Plant Manager",
  "FTE": 54,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178167",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-15 00:00:00",
  "SafetyInspectionBy": "KIE Consultants",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "5yr Update 2/2009; Original 2002",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-02-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-02-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-02-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-02-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 32.68396,
  "FRS_Long": -114.56633,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000047200,
      "AltID": "Ammonia Process",
      "FacilityID": 1000038450,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000047602,
          "ProcessID": 1000047200,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000057272,
          "ProcessID": 1000047200,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000557272,
          "ProcessID": 1000047200,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000038450,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policy\n\n\n\nPriority Cooling, LLC operates a cold storage and shipping facility in Yuma, AZ. Risk prevention and emergency response procedures are in place at this facility. The Emergency Response Plan lists the responsible personnel and the policies for responding to an accident involving the regulated substance.\n\nPriority Cooling facility has a both fixed and portable refrigeration systems onsite. The fixed system is composed of six (6) reciprocating compressors, three (3) screw compressors, two (2) high pressure receivers, two (2) low pressure receivers, one (1) suction accumulators, four (4) ammonia pumps, four (4) surge drums, three (3) evaporative condensers, twenty one (21) evaporative cooling coils, and miscellaneous equipment like oil pots and oil separators. Portable equipment composed of three (3) vacuum tubes, two (2) refrigeration trailers and one (1) ice generator trailer.  All compressors have safety switches that would shut down the compressors upon detection of unsafe operating conditions. Safety relief valves protect all pressure vessels and compressors against high-pressure situations. There are ammonia detectors in the cold rooms for alarming. A list of responders experienced with ammonia refrigeration has been dedicated to respond and determine specific responses for any incident. Safeties and detection equipment are tested and maintained by experienced maintenance personnel as spelled out in the SOPs (Standard Operating Procedures) and testing and inspection program.\n\nEmergency response training will be conducted yearly for current employees and as required for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\n\n\n\n2. Description of Source and Substance Handled\n\nThe ammonia refrigeration system is used for vacuum cooling, storage cooling, and ice generation. The total charge on site is approximately 30,500 lb.\n\nThe refrigeration system f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000038450,
      "SummaryText": "or the facility is a single stage system providing cold (34?F) storage temperatures.\n\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See Material Safety Data Sheet for Anhydrous Ammonia provided in RMP onsite.\n\n\n\n3. Accidental Release Prevention Program\n\nPriority Cooling, LLC maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release (see Appendix N - Incident Investigation in hard copy RMP).\n\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. Ammonia detectors are installed in all refrigerated rooms which tied to central control system that notifies the operator. Personnel will automatically be notified if any detector exceeds set point. Monitoring is 24 hours per day.\n\n\n\n4. Emergency Response Program\n\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Safety Coordinator is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The Safety Coordinator will also be"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000038450,
      "SummaryText": " responsible for evacuation of employees if necessary and for coordination with community emergency responders if offsite evacuations are required. A description of the Emergency Response Program is included in the onsite RMP.\n\n\n\n5. Five-Year Accident History\n\nAccording to Priority Cooling personnel, in the past five years there have been no releases of anhydrous ammonia resulting in reportable quantities or injuries.\n\n\n\n6. Planned Safety Improvements\n\nSpecific recommendations resulting from the PHA and safety inspection are listed in the Hazard Mitigation Recommendations section of the onsite RMP. All refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation."
    }
  ]
}