{
  "FacilityID": 1000106522,
  "FacilityName": "Grace  Curtis Bay",
  "FacilityStr1": "5500 Chemical Road",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21226",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24005",
  "LEPC": "Baltimore City, MD",
  "FacilityLatDecDegs": "39.216111",
  "FacilityLongDecDegs": "-076.570000",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "www.grace.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3093606,
  "ParentCompanyName": "W R Grace & Co. -- Conn",
  "Company2Name": null,
  "CompanyDUNS": 1367846,
  "Company2DUNS": null,
  "OperatorName": "W R Grace & Co. -- Conn",
  "OperatorStr1": "7500 Grace Drive",
  "OperatorStr2": null,
  "OperatorCity": "Columbia",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21044",
  "OperatorZipCodeExt": null,
  "FTE": 450,
  "OtherEPAFacilityID": "21226WRGRC5500C",
  "EPAFacilityID": "100000194657",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "24-510-0076",
  "SafetyInspectionDate": "2019-08-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-08-09 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-08-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-08-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.216111,
  "FRS_Long": -76.57,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000133049,
      "AltID": "Emulsion Catalyst",
      "FacilityID": 1000106522,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000166771,
          "ProcessID": 1000133049,
          "ChemicalID": 51,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000134502,
          "ProcessID": 1000133049,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000114718,
              "Process_NAICS_ID": 1000134502,
              "SafetyReviewDate": "2023-03-19 00:00:00",
              "PHA_Date": "2023-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-03-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-06-01 00:00:00",
              "TrainingReviewDate": "2023-05-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-05-16 00:00:00",
              "EquipmentInspectionDate": "2022-07-23 00:00:00",
              "EquipmentTested": "Block 23 HCl/Metal Halide flex hose replacement",
              "ChangeMgmtDate": "2023-06-10 00:00:00",
              "ChangeMgmtReviewDate": "2023-01-27 00:00:00",
              "PreStartupReviewDate": "2023-06-07 00:00:00",
              "ComplianceAuditDate": "2023-03-30 00:00:00",
              "AuditCompletionDate": "2025-06-01 00:00:00",
              "IncidentInvestigationDate": "2022-09-22 00:00:00",
              "InvestigationChangeDate": "2023-01-05 00:00:00",
              "ParticipationPlansReviewDate": "2023-02-24 00:00:00",
              "HotWorkPermitReviewDate": "2022-05-09 00:00:00",
              "ContractorSafetyReviewDate": "2023-02-27 00:00:00",
              "ContractorSafetyEvalDate": "2021-04-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000143938,
                  "PreventionProgram3ID": 1000114718,
                  "ProcessChemicalID": 1000166771
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106522,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-03-27 00:00:00",
    "ERTrainingDate": "2022-06-17 00:00:00",
    "CoordinatingAgencyName": "Baltimore City",
    "CoordinatingAgencyPhone": "4103965690",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106522,
      "SummaryText": "p ensure proper functioning, our emergency response equipment is regularly inspected and serviced. In addition, the plan is promptly updated to reflect pertinent changes taking place within our processes that would require a modified emergency response.\n\nBaltimore City is the local Emergency Planning Committee (LEPC) with which our emergency plan is to be coordinated and verified.\n\n7.Planned Changes to Improve Safety\nUpdated equipment materials of construction and operating practices have been established for TiCl4."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106522,
      "SummaryText": "hese investigations are undertaken to identify the situation leading to the incident as well as corrective actions to prevent the release from reoccurring. Reports are retained for a minimum of 5 years.\n\nEmployee Participation\nW R Grace-CONN Curtis Bay, Maryland Plant truly believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to information created as part of the facility's consideration of the RMP rule, including information resulting from process hazard analyses in particular. There is a site procedure for Employee Participation and a Plant Safety Committee has been established with monthly meetings.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. W R GraceCONN\nCurtis Bay, Maryland Plant has a strict policy of informing the contractors of known potential hazards related the contractor's work and the facility. Contractors are also informed of the procedures for emergency response should an accidental release of a regulated substance occur.\n\n5. Five-year Accident History\nW R Grace-CONN Curtis Bay, Maryland Plant has had an excellent record of preventing accidental releases. For this new, covered RMP process, there have been no accidental releases during the previous 5 year period.\n\n6. Emergency Response Plan\nW R Grace-CONN Curtis Bay, Maryland Plant carries a written emergency response plan to deal with accidental releases of hazardous materials. The plan includes aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo hel"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106522,
      "SummaryText": "Grace-CONN Curtis Bay, Maryland Plant carries out highly documented maintenance checks on facility equipment to ensure proper operations. Equipment examined by these checks may include; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change\nWritten procedures are in place at W R Grace-CONN Curtis Bay, Maryland Plant to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes or to modifications to the facility are conducted as a regular practice at W R Grace-CONN Curtis Bay, Maryland Plant. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nW R Grace-CONN Curtis Bay, Maryland Plant conducts audits on a regular basis to determine whether the provisions set out under regulatory rules are being implemented. These audits are carried out at least every 3 years and corrective actions required as a result of the audits are undertaken in a safe and prompt manner. Third party audits are also utilized to provide independent assessment of site regulatory compliance programs.\n\nIncident Investigation\nW R Grace-CONN Curtis Bay, Maryland Plant promptly investigates incidents that result in, or could reasonably result in a catastrophic release of a regulated substance. T"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106522,
      "SummaryText": "ng Standards.  The titanium tetrachloride handling process at the facility is subject to the OSHA PSM standard under 29 CFR 1910.119. The facility is also subject to EPCRA Section 302 notification requirements. The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nW R Grace-CONN Curtis Bay, Maryland Plant maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the facility in accordance with Unit Safety Files per the  W R Grace-CONN PSM Program.\n\nProcess Hazard Analysis\nThe facility conducts comprehensive studies to ensure that hazards associated with processes conducted on site are identified and controlled efficiently. The methodology used to carry out these analyses is HAZOP and What-If per the  W R Grace-CONN PSM Program. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of 5 years. Findings related to the hazard analyses are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within the covered processes, W R Grace-CONN Curtis Bay, Maryland Plant maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nW R Grace-CONN Curtis Bay, Maryland Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes. Refresher training is provided at least three years and more frequently as needed.\n\nMechanical Integrity\nW R"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106522,
      "SummaryText": "1.  Accidental Release Prevention and Emergency Response Policies\nThe W R Grace-CONN Curtis Bay, Maryland Plant is strongly committed to employee, public and environmental safety. This commitment is demonstrated by a comprehensive accidental release prevention program that covers areas such as design,\ninstallation, operating procedures, maintenance, and employee training. It is company and site  policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeably, if such a release does occur, the site has trained individuals on site to control and mitigate the effects of incipient releases.  They do not have the ability to respond to emergencies requiring Class A or B PPE. The site is also part of SBIMAP and coordinates with the Baltimore City Fire Department Hazmat Unit which provides additional emergency response expertise.\n\n2.  The Stationary Source and the Regulated Substances Handled\nThe facility's primary activities encompass catalyst manufacture. The site  has only one  substance, titanium tetrachloride, present at our facility, that is regulated under RMP. The maximum inventory of titanium tetrachloride (TiCl4) present at our facility is  12000 pounds in containers of nominal maximum 1700 pounds net weight, DOT rated portable cylinders of  118 gallons. Waste will be stored in a DOT rated cylinder holding 1980 gallons or tanker truck.\n\n3.The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and \nmitigation measures to limit the distances for each reported scenario. -  Omitted as recommended by USEPA\n\n4.The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken necessary steps to comply with the accidental release prevention requirements set out under 40 CFR \npart 68 of the EPA.  This facility was designed and constructed in accordance with various industry codes including; API, ASME NFPA, and Grace Engineeri"
    }
  ]
}