{
  "FacilityID": 1000043312,
  "FacilityName": "Water Station #1",
  "FacilityStr1": "215 Stockbridge Ave",
  "FacilityStr2": null,
  "FacilityCity": "Kalamazoo",
  "FacilityState": "MI",
  "FacilityZipCode": "49001",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26077",
  "LEPC": "Kalamazoo County LEPC",
  "FacilityLatDecDegs": "42.277500",
  "FacilityLongDecDegs": "-085.585500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "WM",
  "FacilityURL": "www.kalamazoocity.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79283214,
  "ParentCompanyName": "City of Kalamazoo",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Kalamazoo",
  "OperatorStr1": "1415 N. Harrison St.",
  "OperatorStr2": null,
  "OperatorCity": "Kalamazoo",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49007",
  "OperatorZipCodeExt": "2565",
  "FTE": 0,
  "OtherEPAFacilityID": "WSSN03520",
  "EPAFacilityID": "100000087149",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-03-19 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.277541,
  "FRS_Long": -85.585505,
  "FRS_Description": "WATER MONITORING STATION",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053402,
      "AltID": "Water chlorination",
      "FacilityID": 1000043312,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064790,
          "ProcessID": 1000053402,
          "ChemicalID": 62,
          "Quantity": 25000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000054168,
          "ProcessID": 1000053402,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000035098,
              "Process_NAICS_ID": 1000054168,
              "SafetyReviewDate": "2014-05-30 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute, The Chlorine Manual;",
              "FR_Comments": "Great Lakes-Upper Mississippi Rvr Brd of State Sanitary Engrs, Recommended Stnds for Water Works",
              "HazardReviewDate": "2014-05-30 00:00:00",
              "ChangeCompletionDate": "2014-06-20 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Vacuum regulator chlorinator feed system; Chlorine gas leak detectors",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Vacuum feed system; Chlorine gas leak detectors; scrubber for active container",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-06-17 00:00:00",
              "TrainingReviewDate": "2014-05-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Operating Procedures and safety procedures are discussed at tail gate safety and staff meetings",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": "Procedures evaluated by supervisor following on-the-job training",
              "MaintenanceReviewDate": "2014-06-04 00:00:00",
              "EquipmentInspectionDate": "2014-06-20 00:00:00",
              "EquipmentTested": "Chlorination equipment including regulator, tubing, instrumentation and scrubber components are inspected by water operator/maintainer during daily station checks",
              "ComplianceAuditDate": "2014-05-31 00:00:00",
              "AuditCompletionDate": "2014-06-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000036308,
                  "PreventionProgram2ID": 1000035098,
                  "ProcessChemicalID": 1000064790
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043312,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-12-16 00:00:00",
    "ERTrainingDate": "2013-10-17 00:00:00",
    "CoordinatingAgencyName": "Kalamazoo Dept. of Public Safety",
    "CoordinatingAgencyPhone": "6163378992",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 34,
      "FacilityID": 1000043312,
      "SummaryText": "e tubing develops a leak or otherwise fails, vacuum is lost and the flow of chlorine gas is immediately halted by the vacuum regulator.  In addition, a vacuum alarm condition will result which will alert system operators of the loss of chlorine feed.  \r\nb.\tPVC piping- Schedule 80 PVC piping is used to convey chlorine gas, under vacuum, from the chlorinators to the injectors and chlorine solution, under pressure, from the injectors to the various chlorination locations.  No inspection or testing is required for the piping under vacuum conditions since the piping is under vacuum and is inherently safe.  If the piping develops a leak or otherwise fails, vacuum is lost and the flow of chlorine gas is immediately halted by the vacuum regulator.  In addition, a vacuum alarm condition will result which will alert system operators of the loss of chlorine feed.  The chlorine solution piping is not regulated under the PSM standard and inspection and testing is not required.\r\n\r\nValves \r\nTwo types of valves are used in the chlorination system.\r\n\r\n\r\na.\tStandard ton container valves- The valves on the ton container are industry standard valves.  No maintenance on the valves is attempted with the possible exception of tightening the packing if a leak develops.  If a valve is found to be defective, the other container valve may be used or the container is returned to the supplier.  In addition, an auxiliary container isolating valve is used to prevent moisture from entering the piping system during a container changeout.  This isolating valve is the same type of valve as the container valve.\r\nb.\tPVC ball valves- Numerous PVC ball valves are installed on the chlorine gas (vacuum) and chlorine solution lines.  The valves used for vacuum service may require replacement of internal gaskets, O-rings, etc.  These valves are included in the PM system and are exercised regularly.  Kits for re-building these valves are kept in stock in storage at Central Pumping Station.\r\n\r\nTon Containers"
    },
    {
      "ESSeqNum": 33,
      "FacilityID": 1000043312,
      "SummaryText": "agers to determine the extent of maintenance that is required for a particular item or system.\r\n\r\nCorrective or demand work orders are handled similarly.  The Water Operators prepare the demand work order and provide this information to the Water Services Manager. The Water Services Manager then generates a demand work order after entry of certain information into the data base.  When completed, the demand work order tasks are initialed and returned to the Operator.  This information becomes part of the equipment history file.\r\n\r\nThe operations and maintenance manuals or instructions provided by the manufacturers of the equipment are an important element of the maintenance management system.  These manuals or instructions often contain recommended PM tasks, written instructions for performing maintenance, replacement parts identification, and other important data.  These manuals and instructions are kept in Engineering..  Extra copies of some of the more frequently used manuals are kept in the offices of the Maintenance Supervisor or Water Operations Supervisor.  Where there are no O&M manuals or instructions, reliance on maintenance fundamentals and staff experience may be necessary for PM or demand maintenance activities.\r\n\r\nChlorination system equipment items are listed in Table 4-5 along with the locations of their maintenance or technical support information, if any.\r\n\r\nSome special maintenance considerations are noted in the following sections.  This is not intended to be a complete listing of all chlorination system components.  Additional written information is available in O&M manuals or instruction documents identified in Table 4-5.\r\n\r\nPiping\r\nThe types of piping that are in use in the chlorination system.\r\na.\tPolypropylene tubing- This tubing is used to convey chlorine gas under vacuum from vacuum regulator nos. 1 & 6 to chlorinator no. 4.  No inspection or testing is required for this tubing since the tubing is under vacuum and is inherently safe.  If th"
    },
    {
      "ESSeqNum": 35,
      "FacilityID": 1000043312,
      "SummaryText": "Chlorine is delivered to the KPSWD in one-ton containers.  The supplier is required to perform a pressure test on each of these containers every 5 years.  The date of the last pressure test is stamped into the outside surface of the container near one end.  The Water Operations maintenance staff verifies that the container number matches that on the bill of lading and records the pressure test date.  \r\n\r\nVacuum Regulators\r\nThe Vacuum Regulators are routinely inspected and preventive maintenance is performed Operations and Maintenance staff.\r\n\r\n\r\nTable 4-9\r\nSummary of Inspection & Preventative Maintenance Activities\r\nWPS #1 Chlorination System\r\n\r\nDESCRIPTION\tFREQUENCY\r\nChlorine ton container inspection\tEach delivery\r\nHoist - check braking mechanism\tEach delivery & certified annually\r\nScrubber System\tBi-weekly\r\nChlorine gas leak detection system\tMonthly\r\nPCS alarms - check position\tMonthly\r\nPVC valves, chlorine gas (vacuum)\tQuarterly\r\nPVC valves, chlorine solution\tQuarterly\r\nHoist - preventative maintenance\tSemi-Annually\r\nLiquid chlorine trap heaters - preventative maintenance\tSemi-Annually\r\nScales - preventative maintenance\tSemi-Annually\r\nVacuum regulators - preventative maintenance\tSemi-Annually\r\nExhaust fans -preventative maintenance\tSemi-Annually\r\nChlorinators - preventative maintenance\tQuarterly\r\nInjectors - preventative maintenance\tAnnually\r\nChlorine supply tubing (from vacuum regulator to ton container) - replace\tAnnually\r\n \r\n4.6 \tCOMPLIANCE AUDITS\r\n\r\nThe risk management program for WPS #1 will be reviewed periodically to ensure that personnel are implementing it properly.  An audit will be conducted to review each of the preventative program elements to ensure that each is up-to-date; that each is being implemented; identify any problem areas; and take corrective action where needed.\r\n\r\nPursuant to Program 2 requirements, a risk management program audit will be conducted at least every three years.  The audit team will certify that they have evaluated complian"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000043312,
      "SummaryText": "American Industrial Classification System codes.  \r\n\r\nA planned inspection of WPS #1 by MIOSHA staff on March 19, 2009, was not conducted as the enforcement staff determined that the station was not subject to the Process Safety Management requirements due to the lack of full time staffing at the station.  \r\n\r\nTherefore, by default, the operation of WPS#1 falls under Program 2 requirements that imposes streamlined prevention program requirements, as well as additional hazard assessment, management, and emergency response requirements.  \r\n\r\n\r\n2.0  MANAGEMENT SYSTEM [68.15]\r\n\r\nUnder Program 2 the management system requirements are:\r\n\r\n1)\tTo develop a management system to oversee  the implementation of the risk management program elements;\r\n2)\tTo designate a qualified person or position with the overall responsibility for the development, implementation, and integration of the risk management program elements; and\r\n3)\tTo document the names of people or positions and define the lines of authority through an organizational chart or other similar document, if you assign responsibility for implementing individual requirements of the risk management program to people or positions other than the person or position with overall responsibility for the risk management program.\r\n\r\nThe Public Services Managing Director has overall responsibility for overseeing and directing the department's activities and operations.  Various responsibilities are delegated down through the department's organization to the managers and supervisors reporting directly or indirectly to the managing director.  The Water Operation/Maintenance group has responsibility for the operation of the municipal water supply system.  This group is responsible for the day to day operation of all water  system by managing the production and distribution of drinking water across a multiple pressure district system consisting of pumping stations, storage tanks and booster/bleed stations.  This group also conducts the"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000043312,
      "SummaryText": "daily inspections of all operating water pumping stations, including WPS #1 (Central). This group, therefore, is responsible for assuring that the chlorine storage and feed system is being operated efficiently and safely and in compliance with the Risk Management Program requirements.\r\n\r\nThe Environmental Services Superintendent (ESS) manages the Environmental Services Division that has the responsibility of developing and maintaining many of the environmental and safety compliance programs that impact the department's operations.  The ESS has overall responsibility for the development, maintenance, and compliance monitoring of the risk management program elements.  In carrying out this responsibility, the Environmental Services Superintendent works directly with the Water Operation and Maintenance Supervisor and also with Operator/Maintainer personnel during the program implementation, maintenance and training of the RMP.  However, various other individuals within the Public Services Department are also involved in specific elements of the Risk Management Program as presented in table of assignment of risk management responsibilities.  \r\n \r\nThe individuals involved in this program meet periodically to review all aspects of the various program elements as they relate to the chlorine system at WPS #1.  Each member of the team should be allowed to report on any activities that pertain to their area of responsibility.   In terms of accountability each of the key positions having direct RMP responsibilities are directly reportable, as shown on the following department organizational chart, to the department's managing director.\r\n\r\n\r\n3.0  HAZARD ASSESSMENT [68.20 - 68.42]\r\n\r\n3.1\tOFFSITE CONSEQUENCE ANALYSES\r\nAs shown in Section 2.0 of  this RMP, the chlorine storage and feed system located at Central Pumping Station meets RMP Program 2 criteria.  As such, the RMP is required to identify, analyze and report one worst-case scenario to represent all of the toxic regulated"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000043312,
      "SummaryText": "substances (i.e., chlorine) held above threshold quantities (i.e., 2500 lbs) in Program 2 processes. \r\n\r\nIn addition, an alternative release scenario analysis is also required to identify the potential reach and effect of hypothetical accidental releases under more realistic circumstances.\r\n\r\nThe regulations require use of tables or models for atmospheric dispersion analysis that appropriately account for gas density.  The OCA was completed using EPA's software program, RMP*CompTM that performs calculations described in the USEPA's RMP Offsite Consequence Analysis Guidance. In order to complete the Offsite Consequence Analyses (OCA), Appendix F:  Supplemental Risk Management Program Guidance for Wastewater Treatment Plants was used since use of chlorine at Central is similar to how it is used at a WWTP.  This guidance provides additional information for wastewater treatment plants (or water pumping stations using chlorine).  The tables and charts from the above referenced guidance that were used to complete the OCA are included in Appendix A. \r\n\r\nAt this point it should be noted that all 1-ton chlorine cylinders are stored inside the pumping station building.  In addition, the active 1-ton cylinder that is feeding chlorine to the water distribution system is also located within an area that includes a caustic scrubber system that is designed to capture a release from an entire 1-ton cylinder and treat it without allowing a discharge of chlorine gas to the atmosphere.  In essence, if a chlorine leak were to occur in a ton cylinder that is connected to the vacuum feed system and the contents of the cylinder were released, the scrubber will respond and the release of chlorine gas to the atmosphere would be minimal.  These additional factors help to mitigate the worst-case release scenario.   Figure 3-1, taken from the above EPA guidance is included to illustrate the effect of releases from chlorine cylinders located inside a building and, potentially, occurring in"
    },
    {
      "ESSeqNum": 36,
      "FacilityID": 1000043312,
      "SummaryText": "ce with the prevention program requirements for the chlorination system.  The audit team will consist of the Water Operation and Maintenance Supervisor, Environmental Services Superintendent, and additional operator/maintainers.  A report of the findings will be developed that will determine and document the particular response to each of the audit findings.  Essentially, the correction of each deficiency found during the audit must be documented.\r\n\r\nThe audit will be conducted using the WPS #1 Chlorination System Compliance Audit Form that is included in Appendix L.  The checklist will be used as part of a walkthrough of the WPS#1 chlorination system.   Each audit finding will be compiled on an audit action register so that the deficiencies can be documented and tracked until each is resolved.\r\n\r\nThe auditor(s) must prepare a report that details the results of the review.  If any deficiencies are found, the report must determine and document an appropriate response.  The City must certify the results of the audit and retain the last two (2) audit reports.  It is suggested that the audit report contain a certification statement similar to the following:\r\n\r\nThis report is intended to satisfy the certification requirements of 29 CFR 1910.119 (o).  The undersigned person(s) have reviewed the provisions of the Process Safety Management regulations relative to the chlorination systems for WPS #1.  This report contains the results of that review.  Any deficiencies that were identified have been addressed in this report.\r\nCertified By:\r\nName & Title (Print or type):___________________\r\n             ___________________                                                                            \r\n\r\nSignature:_______________________________\r\n\r\n4.7 \tIncident Investigation\r\n\r\nIncidents can provide valuable information about site hazards and the steps needed to prevent accidental releases.  Each incident that resulted in, or could have resulted in, a catastrophic release of chlor"
    },
    {
      "ESSeqNum": 37,
      "FacilityID": 1000043312,
      "SummaryText": "ine gas must be investigated.  A catastrophic release is one that presents an imminent and substantial endangerment to public health and the environment.  If the incident meets the criteria for including in the five-year accident history section of your RMP, it warrants an incident investigation.  Minor accidents or near misses will also be investigated in order to help identify problems that could lead to more serious accidents.\r\n\r\nAny incidents that result, or could reasonably result, in the catastrophic release of chlorine are to be investigated as soon as possible but no later than 48 hours of occurrence.  Any incidents involving chlorine will be investigated by a team with at least one member knowledgeable in the chlorination process.  If a contract employee is involved, the contractor must also be included on the investigation team.  The investigations will be included in a report to identify the factors contributing to the incident.  The purpose of the report will be to assist management take corrective measures.  The incidents findings and recommendations will be addressed promptly.  An action register will be created that identifies the items needing corrective action with an assignment of responsibility and target dates to resolve the issues.  The results of the report will be shared with the water operator/maintainer staff.  The incident report will be retained on file for at least five years.\r\n\r\nIf the incident included an occupational injury or illness, the investigators are to use the following form titled Accident/Incident Investigation Report.  This form is to be used throughout the department for all incidents that result in personal injury or property damage.  &#61505; near miss is also to be investigated.  An example of a near miss is the dropping of a full one-ton container of chlorine from the hoist during transfer from the storage area to the container room.  Even though there may not have been a release due to this incident, a catastrophic rel"
    },
    {
      "ESSeqNum": 38,
      "FacilityID": 1000043312,
      "SummaryText": "ease could reasonably have resulted.  \r\n \r\n5.0\tEMERGENCY RESPONSE PROGRAM\r\n\r\nWater Pump Station #1 (Central) is a non-responding facility as defined in § 68.90(b).  Essentially, if a chlorine release occurs at Central the response procedures are purposed to ensure the safety of department personnel.  The water operator/maintainer personnel will not respond to a catastrophic release of chlorine from the facility.  If a release occurs from one of the two chlorine 1-ton cylinders in the Chlorine Room, the lease will be detected which will, in turn, activate the caustic scrubber system thus mitigating a catastrophic release.\r\n\r\n\r\nHowever, Public Services staff has developed the Kalamazoo Water Pumping & Distribution System Emergency Response Plan (ERP).  The ERP is a multi-disaster plan includes a chlorine gas release from Central as one of the scenarios.  For the chlorine gas release scenario, the ERP includes the threat evaluation and response procedures.  Excerpts from ERP pertaining to responses to a chlorine release (Part 2.5 and Part 4.1 of the Kalamazoo Water System ERP) are included in Appendix E of this written program.\r\n\r\nProcedures for notifying the local emergency response agencies about accidental releases.  The agencies that will respond are the City of Kalamazoo Department of Public Safety and Kalamazoo County Office of Emergency Management (OEM).  The Kalamazoo Department of Public Safety (KDPS), an integrated police and fire department will be responsible for notifying the public in the City of Kalamazoo.  The KDPS has mutual aid agreements with surrounding jurisdictions, including the City of Parchment and Kalamazoo Township.  \r\n\r\nThe KDPS will be the first responder to a chlorine gas release at Central.  If needed, KDPS will notify additional emergency response agencies depending on the severity of the release.  The Kalamazoo County OEM will respond to a large scale release.  The OEM has the authority to activate the County HazMat Team which is a coun"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043312,
      "SummaryText": "Kalamazoo Area Water System Overview\r\n\r\nThe City of Kalamazoo Public Water Supply System is designed, operated, and maintained by the Kalamazoo Public Services Department, Water Division. (KPSWD). The mission and the purpose of the System is to provide a safe, sufficient, reliable water supply and related services to the public within the Kalamazoo metropolitan area. Ground water provides 100 percent of the water served. The average daily flow rate is about 23 MGD.\r\n\r\nChlorine is used to disinfect the water prior to supply. Chlorine is delivered and used in one ton containers. The containers are stored in storage room.  The Water Supply System uses vacuum system that is inherently safe. These systems involve the use of water flowing through an eductor which creates vacuum. This vacuum allows for the feed of chlorine from the containers into the piping system. If a chlorine line downstream of the vacuum regulator is broken or develops a leak, the vacuum is interrupted and the vacuum regulator automatically closes, preventing discharge of chlorine.\r\n\r\nWater Pumping Station #1 Central Overview\r\n\r\nCentral Pumping Station #1 is located at 215 W. Stockbridge Ave. in the City of Kalamazoo.  It is bounded on the north and west side by W. Crosstown Parkway, on the east side by Stockbridge Ave., on the south side by a commercial business and Balch Street.\r\n\r\nThere are a total of six wells located on the property, which supply raw water to the pumping station.  The original pumping Station #1 was built in 1884 and has been abandoned.  The present facility was built in 1995.  The six wells provide a raw water capacity of 6,750 gallons per minute (gpm), or 9.73 million gallons per day (MGD).  There are two 200, one 150, and one 100 hp treated water pumps at this station.  Iron is removed from the raw water through air stripping towers and filters.  Central Pumping Station #1 is on of the two iron filtration plants on the system and is an unmanned facility.  The treated water is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043312,
      "SummaryText": "stored in a clear well.  The pumping station supplies the Low Pressure District.\r\n\r\nThe pumping station is a two-story building with multiple floor levels and a high rise section that encloses the air strippers.  It is a cast-in-place concrete structure with concrete columns, and concrete floors.  The walls are concrete block with a brick face on the exterior.  The high rise section is a steel framed structure with pre-cast wall sections.  The roof is made of pre-cast concrete planks, with elastomeric sheet roofing. \r\n \r\nThe ground floor contains the following rooms and/or areas:\r\n\r\n¿\tOffice\r\n¿\tEquipment Room\r\n¿\tChemical Storage\r\n¿\tChlorine Storage\r\n¿\tElectrical \r\n¿\tDetention Reservoir\r\n¿\tFilter Tanks\r\n¿\tClear well\r\n¿\tPiping Gallery\r\n\r\nThe second floor contains the following rooms and/or areas:\r\n\r\n¿\tFan Room\r\n¿\tAir Strippers\r\n¿\tPump Mezzanine\r\n¿\tFilter Tank Mezzanine\r\n¿\tBlower Room\r\n\r\nAll of the water division's chemicals, including one ton and 150 pound chlorine cylinders, and other chemicals, used in the treatment process by the Water Division, are delivered to and stored at Central Water Pumping Station.  The chlorine storage area was designed to store a maximum of eight one-ton cylinders, and forty 150-pound cylinders.  All other chemicals are stored in the Chemical Storage Area.  Chlorine and all other chemicals are delivered to other remote stations as needed. Chlorine and chemical feed rooms are provided, adjacent to the storage rooms, for treating the water.  There is a chlorine detector mounted in the storage area to detect chlorine leaks.  In the event of the major chlorine leak, an Emergency Chlorine Scrubber is provided to scrub chlorine from the air in the storage area.\r\n\r\nChlorination System Overview\r\nThe objective if chlorinating is to destroy pathogenic organisms in the untreated groundwater to insure safe drinking water.  A chlorine/water solution is injecte3d into the untreated water before the booster pump distributes the then treated water to the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043312,
      "SummaryText": "distribution system.  Chlorine oxidizes the pathogenic bacteria by rupturing their cell walls.  This is called lysis.\r\n\r\nChlorine is applied at a rate of 1 to 4 ppm to insure a free chlorine residual of at least 1.0 ppm throughout the distribution system.  The addition of chlorine is controlled automatically at Pumping Station #1.  Manual adjustments may be made at WPS #1 by changing the application rate on the automation equipment control units.  The operator shall take daily DPD readings from the finished water sample tap to insure adequate chlorination.  \r\n\r\nThe major chlorination system components are:\r\n¿\tChlorine Storage and Scales\r\n¿\tChlorine Vacuum Heads\r\n¿\tChlorine Proportioner Units\r\n¿\tChlorine Rate Adjustment Units\r\n¿\tDiffusers\r\n¿\tChlorine Residual Analyzers\r\n¿\tPVC Water Supply Line with Solenoid\r\n¿\tVacuum Regulators \r\n¿\tFlexible Vacuum Lines \r\n¿\tChlorine Injectors\r\n¿\tChlorine Leak Detectors\r\n¿\tChemical Room Exhaust Fans\r\n¿\tChlorine Excess Vents\r\n¿\tChlorine Gas Vapor Scrubber\r\n\r\n                    \r\n1.0 Applicability to 40 CFR Part 68\r\n\r\n1.1 General Applicability\r\nIf a tank, drum, container, pipe, or other process at a facility contains any of the extremely hazardous toxic and flammable substances listed in the Code of Federal Regulations (CFR) at 40 CFR 68.130 in an amount above the threshold quantity specified for that substance, the facility is required to develop and implement a risk management program under a rule issued by the USEPA.\r\n\r\nThe goal of part 68 and the risk management program it requires is to prevent accidental releases of substances that can cause serious harm to the public and the environment from short-term exposures and to mitigate the severity of releases that do occur.  Under the Clean Air Act (CAA), EPA was required to issue a rule specifying the types of actions to be taken by facilities (referred to in the law as stationary sources) to prevent accidental releases of such hazardous chemicals into the atmosphere and reduce t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043312,
      "SummaryText": "heir potential impact on the public and the environment.  Part 68 is that rule.\r\n\r\nPart 68 applies if:\r\n1.\tIf it is a stationary source (facility)\r\n2.\tIf the facility manages a regulated substance\r\n3.\tIf the facility manages a regulated substance in quantities exceeding regulated threshold quantities\r\n4.\tAnd it is defined as a process\r\n\r\nThe CAA defines stationary sources as, any buildings, structures, equipment, installations, or substance emitting stationary activities.  Central is a structure that stores both 1-ton and 150 lb chlorine gas cylinders.  Chlorine is fed to the drinking water system from the 1-ton cylinders utilizing a vacuum feed system.  Therefore, WPS #1 meets the definition of a facility.\r\n\r\nThe list of substances regulated under Part 68.130 is in Appendix A of the rule.  Chlorine gas is included on the list of regulated substances.  The maximum threshold quantity for chlorine gas is 2500 lbs.  \r\n\r\nThe chlorine used and stored at the WPS #1 is delivered in one-ton and 150# cylinders.  The 150# cylinders are delivered in storage racks of six cylinders attached to one rack with a maximum intended inventory of 16 racks resulting in a maximum intended storage volume in 150# cylinders of 14,400 lbs of chlorine. \r\n\r\nIn addition, Water Pumping Station #1 has provisions for storing a maximum intended inventory of eight one ton cylinders (including the ones in use).  Therefore the maximum intended inventory of chlorine stored/used in one ton cylinders is 16,000 lbs.  Therefore, the maximum intended inventory of chlorine in one ton and 150 lb cylinders is 30,400 lbs.  Therefore the quantity of chlorine managed in the facility exceeds the regulatory threshold quantity.\r\n\r\nProcess is defined in 40 CFR 68.3 as, Any activity involving a regulated substance, including any use, storage, manufacturing, handling, or on-site movement of such substances, or combination of these activities.  Any group of vessels that are interconnected, or separate vessels th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043312,
      "SummaryText": "at are located such that a regulated substance could be involved in a potential release, shall be considered a single process.  Since a cylinder is considered a vessel, the chlorine storage and feed system is considered a single process.\r\n\r\nTherefore, from the above discussion, the Central chlorine storage and feed system is subject to the CAA 40 CFR Part 68 risk management program regulations.\r\n\r\n1.2 Applicability of Program Levels\r\nOnce it was determined that the Central chlorine feed system is subject to the CAA risk management rule, it was necessary to determine what actions must be taken to comply with the rule.  The rule defines three Program levels based on processes' relative potential for public impacts and the level of effort needed to prevent accidents.  For each Program level, the rule defines requirements that reflect the level of risk and effort associated with the processes at that level.\r\n\r\nProgram 1:  Processes which would not affect the public in the case of a worst-case release and with no accidents with specific offsite consequences within the past five years.\r\n\r\nProgram 2:  Processes not eligible for Program 1 or subject to Program 3 are placed in Program 2, which imposes streamlined prevention program requirement, as well as additional hazard assessment, management, and emergency response requirements.\r\n\r\nProgram 3:  Processes not eligible for Program 1 and either subject to OSHA's PSM standard under federal or state OSHA programs or classified in one of ten specified North American Industrial Classification System (NAICS) codes.\r\n\r\nPursuant to the above criteria, WPS #1 falls under the Program 2 requirements because the operation is not eligible for Program 1 due to the location of the facility in proximity to residences, hospital, and commercial establishments; the process is not subject to MIOSHA PSM because there are no Public Services employees stationed at this location; and the process does not fall under any of the ten specified North"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000043312,
      "SummaryText": "hole (USEPA RMP Guidance for Wastewater Treatment \r\n5 lbs/per minute \r\nApply a building release-rate-multiplicative factor\tRelease rate reduced to 55% of above value:\r\nRelease Ratem = 5 lbs/min X 0.55 = 2.75 lbs/min\r\nDistance to endpoint \r\n(Exhibit F-4)\t0.1 miles\r\n\r\n\r\n3.3.2\tAlternative Offsite Consequence Analysis Results\r\n\r\nDistance to toxic endpoint:\t\t\t0.1 miles\r\n\r\n(Source:  USEPA RMP Guidance for Wastewater Treatment Plants, Exhibit F-4)\r\n\r\n3.3.3\tPublic Receptors Within the Distance\r\n\r\nA map of a portion of the Kalamazoo area that would be potentially affected by the alternative-case scenario is included in Appendix A.  The 0.1-mile distance to the toxic endpoint is indicated on the map.  The endpoint extends beyond the property boundaries of WPS #1.  However, the only residential area impacted is along Balch St.  The remainder of the property falling within the 0.1 mile radius includes WPS #1 property and the Crosstown Ponds area to the north.\r\n\r\nThe residential population within the 0.1 mile radius is estimated to be about 100 people.  \r\n\r\n3.3.4\tEnvironmental Receptors Within the Distance\r\n\r\nEnvironmental receptors are defined as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves or areas; and Federal wilderness areas that could be exposed at any time to toxic concentrations of chemicals as a result of an accidental release.\r\n\r\nThere are no such environmental receptors within the 0.1-mile radius from WPS #1 that has been determined to be in the area potentially affected by the alternative-case release.\r\n\r\n3.4\tFIVE YEAR ACCIDENT HISTORY\r\n\r\nThe five-year accident history involves an examination of the effects of any accidental releases of one or more of the regulated substances from a covered process in the five years prior to the submission of a RMP.  For WPS #1, the Five-Year Accident History will cover any accidental release associated with the chlorine storage and feed equipment.\r\n\r\nHowe"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000043312,
      "SummaryText": "ver, if a reportable accident occurs, it must be reported to EPA within 6 months of the occurrence as well as being included in the five-year accident history.  In addition, a revised RMP will also be submitted with in 6 months of the incident.\r\n\r\nThe five-year accident history covers only certain releases:\r\n\r\n1.\tThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\r\n2.\tThe release must have caused at least one the of the following:\r\na.\tOn-site deaths, injuries, or significant property damage (40CFR68.42(a)); or\r\nb.\tKnow offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (40CFR68.42(a)).\r\n\r\n3.4.1\tIncident Investigation \r\nThe following information is reported to EPA should a release, as described above, occur:\r\n\r\n¿\tDate the accidental release began\r\n¿\tDate the investigation began\r\n¿\tDate the investigation was completed\r\n¿\tExpected date of completion of changes due to results of accident investigation\r\n¿\tTime of the release\r\n¿\tDuration of the release\r\n¿\tRegulated substance released\r\no\ti.e., chlorine\r\n¿\tQuantity released\r\n¿\tRelease event description, \r\no\tgas release, \r\no\tliquid spill/evaporation,\r\no\tfire,\r\no\texplosion\r\n¿\tRelease source, \r\no\tstorage vessel, \r\no\tpiping, \r\no\tprocess equipment, \r\no\ttransfer hose, \r\no\tvalve, \r\no\tpump, \r\no\tjoint, \r\no\tother\r\n¿\tWeather conditions at time of event \r\no\twind speed and direction; \r\no\ttemperature; \r\no\tstability class; \r\no\tprecipitation present; \r\no\tor unknown\r\n¿\tOn-site impacts, \r\no\tdeaths; \r\no\tinjuries, and \r\no\tproperty damage\r\n¿\tKnown off-site impacts\r\n¿\tInitiating event, \r\no\tequipment failure; \r\no\thuman error; \r\no\tweather conditions; or \r\no\tunknown\r\n¿\tContributing factors, \r\no\tequipment failure; \r\no\thuman error; \r\no\timproper procedures; \r\no\tover pressurization; \r\no\tupset condition, \r\no\tbypass condition; \r\no\tmaintenance activity/inactivity; \r\no\tprocess design; \r\no\tunsuitable equipment; \r\no\tunusual weather con"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000043312,
      "SummaryText": "an area that can be treated with a scrubber system.  Despite those conditions, the worst-case release scenario will consider the entire contents released to the atmosphere under the conditions specified below outside the pumping station.\r\n\r\nWORST-CASE RELEASE SCENARIO\r\n\r\nThe USEPA requires that the City develop a worst-case release scenario from WPS #1 (Central) for planning purposes.  The USEPA has defined the worst-case scenario as the release of the largest quantity of a regulated substance (i.e., chlorine) from a single vessel or process line failure that results in the greatest distance to an endpoint.\r\n\r\nWPS #1 uses chlorine in 2000-pound (one-ton) containers.  Therefore the worst-case release scenario assumes that the entire 2000-pound quantity of chlorine gas is released completely over a 10-minute period.  It is also assumed that the release occurs outdoors such that mitigative effects of a building and the chlorine scrubber cannot be considered.  \r\n\r\n \r\n\r\n\r\n3.2.1.\tWorst-Case Analysis Parameters\r\n\r\nThe parameters required for this scenario are from the USEPA Guidance include:\r\n\r\nChemical name:\t\t\t\tChlorine\r\n\r\nPhysical state:\t\t\t\tGas liquefied by pressure\r\n\r\nModel used:\t\t\t\tUSEPA's RMP Guidance for Wastewater \r\n\t\t\t\t\tTreatment Plants Reference Tables\r\n\r\nScenario:\t\t\t\tLiquid spill and vaporization\r\n\r\nRelease quantity:\t\t\t2000 pounds (a single ton container)\r\n\r\nRelease rate:\t\t\t\t2000 pounds/10 minutes = 200 lbs. per minute\r\n\r\nRelease duration:\t\t\t10 minutes\r\n\r\nToxic endpoint for chlorine:\t\t0.0087 mg/L (3 ppm)\r\n\r\nWind speed:\t\t\t\t1.5 meters/second\r\n\r\nAtmospheric stability class:\t\tF\r\n\r\nSurface roughness:\t\t\tUrban topography\r\n\r\nAmbient Temperature:\t25 C (or highest daily maximum temperature in previous three years gathered at the source or at a local meteorological station)\r\n\r\nAmbient Humidity:\t50% (or average humidity gathered at the source or at a local meteorological station)\r\n\r\nHeight of release:\t0 feet (ground level\r\n\r\nTemperature:\tHighest daily maximum temperature in"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000043312,
      "SummaryText": "previous three years\r\n\r\n\r\n3.2.2\tWorst-Case Offsite Consequence Analysis Results\r\n\r\nDistance to toxic endpoint:                 1.3 Miles\r\n\r\n(Source:  USEPA RMP Supplemental Risk Management Program Guidance for Wastewater Treatment Plants, Exhibit F-3))\r\n\r\n3.2.3\tPublic Receptors within the Distance\r\n\r\nA map of a portion of the Kalamazoo area that would be potentially affected by the worst-case scenario is included in Appendix A.  The 1.3-mile distance to the toxic endpoint is indicated on the map.\r\n\r\nThe area of this circle is 5.3 square miles.  The area consists of a mix of residential, industrial, commercial, and open spaces.  Discussion with City staff indicates that the approximate mix of these various land uses is somewhat in proportion to the City of Kalamazoo as a whole.  Therefore, to estimate the potential population affected by a worst-case release scenario, the population density for the City of Kalamazoo will be used.\r\n\r\nThe population of the city was estimated using 2012 census data for the City of Kalamazoo, a compilation of data made available by the Census Bureau.  According to this data, the population of the City of Kalamazoo is 74,262 and the land area of the city is 24.6 square miles.  Therefore, the population density of the city is 3,018 persons per square mile.\r\n\r\nUsing this population density and the area that could potentially be affected by the worst-case release, the population that could potentially be impacted is determined to be approximately 15,995.\r\n\r\n3.2.4\tEnvironmental Receptors Within the Distance\r\n\r\nEnvironmental receptors are defined as natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves or areas; and Federal wilderness areas that could be exposed at any time to toxic concentration of chemicals as a result of an accidental release.\r\n\r\nThere are no such environmental receptors within the 1.3 mile radius from WPS #1 that has been determined to be in the area pot"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000043312,
      "SummaryText": "entially affected by the worst-case release.\r\n\r\n\r\n3.3\tALTERNATIVE RELEASE CONSEQUENCE ANALYSIS\r\n\r\nThe worst-case scenario assumes that a ton container of chlorine is ruptured and the contents discharged to the atmosphere equivalent to an outdoor release.  Experience at WPS #1 indicates that it is more probable that a release may occur in other ways.  Specifically, leaks from the connection at the ton container valve may occur if the lead washer is not installed properly.  \r\n\r\nThe procedure for a ton container change out specifies that the operator/maintainer making the connection verify that this connection does not leak by the use of ammonia vapor.  A white vapor cloud will indicate a chlorine release.  However, it is conceivable that the person making the connection may not check the connection and not detect the release by smell (an air purifying respirator is worn during the procedure).  Therefore, the alternative release scenario to be considered is described in the following.\r\n\r\n3.3.1\tAlternative Release Scenario\r\n\r\nA lead gasket is leaking chlorine vapor while a full ton container is in operation, i.e., connected to the supply system and the chlorine room is unattended.  It is assumed that the  of the leak is 3/16 inch in diameter and the release occurs inside the chlorine building with the doors and windows closed and the ventilation fan running.  Under this scenario, the release should be detected by the stationary, chlorine gas leak detector in the area.  The leak detector would alarm and system operators would be alerted.  It is assumed that mitigation stops the release in one hour.\r\n\r\nThe methodology used to calculate the alternative release concentration considers the mitigative effects of the building and interior chlorine room in which the ton containers are located.  The USEPA RMP Guidance for Wastewater Treatment Plants describes this approach.\r\n\r\nTable 3-1\r\nAlternative Release Methodology\r\n\r\nItem\tResult\r\nChlorine vapor release rate through a 3/16"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000043312,
      "SummaryText": "cedures; workers must be trained in these procedures and must use them every day.\r\n\r\nThere are seven elements in the Program 2 prevention program which is set forth in the Part 68 regulations at Subpart C.  Each element with its respective RMP section number and the Subpart C references are listed below. \r\n\r\n4.1\tSafety Information (68.48)\r\n4.2\tHazard Review (68.50)\r\n4.3\tOperating Procedures (68.52)\r\n4.4\tTraining (68.54)\r\n4.5\tMaintenance (68.56)\r\n4.6\tCompliance Audit (68.58)\r\n4.7\tIncident Investigation (68.6)\r\n\r\n\r\n4.1 \tSAFETY INFORMATION\r\nThis section provides the safety-related information pertaining to the hazards of using chlorine gas using the technology and feed equipment used in the chlorination process at WPS #1.  This section includes safe operating limits for the chlorine feed system and the accepted design and operation standards and codes.  Up-to-date safety information about the chlorination system is the foundation of an effective prevention program.\r\n\r\nThe essential elements that are included in safety information are:\r\n1.\t(Material) Safety Data Sheets\r\n2.\tMaximum intended inventory\r\n3.\tSafe upper and lower operating parameters\r\n4.\tEquipment specifications\r\n5.\tCodes & standards used to design, build and operate the process\r\n\r\n4.1.1  \tChlorine (Material) Safety Data Sheets\r\nThe MSDS for Chlorine is included in Appendix B.  Chlorine gas is primarily a respiratory irritant.  It is so irritating that low concentrations in air are readily detectable by the normal person.  The odor threshold of chlorine is about 0.1 PPM.  At low concentrations, chlorine gas has an odor similar to household bleach.  As the concentrations increase from the level of detection by smell so does symptomatology in the exposed individual.  The impact of exposure to chlorine is both concentration and time dependent.  At chlorine concentrations above 5 PPM, the gas is very irritating and it is unlikely that any person would remain in such an exposure for more than a very brief time unl"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000043312,
      "SummaryText": "ess trapped or unconscious. (Ref 4-1)\r\n\r\n4.1.1.1  Acute Toxicity\r\nIn concentrations near the threshold of smell, chlorine gas will, after several hours of exposure, cause mild irritation of the eyes and of the mucous membranes of the respiratory tract.  As concentrations increase, there is an increase in the irritating effect on the eyes, coughing mechanism and on the upper and lower respiratory tract with eventual difficulty in breathing.  As the duration of exposure and/or concentration increase, the affected individual may become apprehensive and restless with coughing accompanied by throat irritation, sneezing, and excess salivation.  At higher levels, there is vomiting associated with labored breathing.  In extreme cases, difficulty in breathing can progress to the point of death through suffocation.\r\n\r\nLow concentrations of chlorine gas in the air may have minor irritating effects or may produce slight symptoms after several hours of exposure, but careful examination of persons repeatedly exposed to such conditions reportedly has shown no permanent physiological effect.  The lowest lethal limit for chlorine is estimated to be 430 PPM over a 30 minute exposure time.  This value is related to respiratory exposure.  A few breaths of chlorine in concentrations over 1,000 PPM can be fatal. (Ref 4-2)\r\n\r\nGaseous chlorine combines with water (e.g. perspiration) to form weak hypochlorous acid.  This weak acid can create mild skin burns with symptoms such as discomfort or rash.  Such burns will become apparent most quickly in the sensitive areas of the body, such as around the genitals, between the buttocks, or under the arms.  Liquid chlorine in contact with the eyes or skin will cause local irritation and/or burns.  All symptoms and signs result directly or indirectly from its irritating action.  Liquid chlorine is a very cold liquid, boiling at -34°C (-9°F).  Contact with liquid chlorine will result in frost bite.\r\n\r\n4.1.1.2  Permissible Exposure Limits\r\nThe OSHA Per"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000043312,
      "SummaryText": "ditions; \r\no\tmanagement error\r\n¿\tWhether off-site responders were notified (e.g., Kalamazoo Public Safety and Kalamazoo County HazMat Team)\r\n¿\tChanges introduced as a result of the accident\r\no\tImproved or upgraded equipment\r\no\tRevised maintenance procedures\r\no\tRevised training\r\no\tRevised operating procedures\r\no\tNew process controls\r\no\tNew mitigation systems\r\no\tRevised emergency response plan\r\no\tChanged process\r\no\tReduced inventory\r\no\tOther or none\r\n\r\n3.4.2  \t\tCurrent Five-Year Accidental Release History for WPS #1.\r\nIn the past five years, there have been no accidental releases of chlorine at WPS #1 that have resulted in death, injuries, or significant damage on side, or known offsite deaths injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\n\r\n4.0\tPREVENTION PROGRAM\r\n\r\nAs documented in Section 1.2, WPS #1 falls under the Program 2 since it does not meet the criteria for either Program 1 or Program 3.  Therefore, by default, the operation of WPS#1 falls under Program 2 requirements that imposes streamlined prevention program requirements, as well as additional management system (Section 2.0), hazard assessment (Section 3.0), and emergency response (Section 5.0) requirements.  The KWPS #1 has developed the required prevention program elements to comply with those rules.  \r\n\r\nEPA developed the Program 2 prevention program by identifying the basic elements that are the foundation of sound prevention practices-safety information, hazard review, operating procedures, training, maintenance, compliance audits, and accident investigation.  Many of these Program 2 elements are already required by other state and federal regulatory programs.\r\n\r\nThe interrelationship of the requirements can be illustrated in this way.  The hazard review must be built on the safety information compiled for the regulated substance, chlorine; the results of the hazard review should be used to revise and update chlorine feed system operating and maintenance pro"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000043312,
      "SummaryText": "missible Exposure Limit (PEL) for chlorine is 1.0 PPM or 3.0 mg/m3.  At no time shall a worker be exposed to concentrations in excess of this concentration.\r\n\r\nThe ACGIH Threshold Limit Value-Time Weighted Average (TLV-TWA) for chlorine is 0.5 PPM or 1.5 mg/m3.  This is the concentration for a normal 8-hour workday and a 40-hour workweek, to which nearly all workers may be exposed, day after day, without adverse effect.\r\n\r\n \r\nThe ACGIH Threshold Limit Value-Short-Term Exposure Limit (TLV-STEL) is 1.0 PPM or 2.9 mg/m3.  This is the concentration to which workers can be exposed continuously for a short period without suffering acute effects provided that the TLV-TWA is not exceeded.  The TLV-STEL is defined as a 15-minute TWA exposure which should not be exceeded at any time during a workday even if the 8-hour TWA is within the TLV-TWA.  Exposures above the TLV-TWA up to the STEL should not be longer than 15 minutes and should not occur more than four times per day.\r\n\r\nThe National Institute of Occupational Safety and Health (NIOSH) IDLH value is 10 PPM.  The IDLH represents the maximum concentration from which, in the event of respirator failure, one could escape within 30 minutes without a respirator and without experiencing any escape-impairing (e.g. severe eye irritation) of irreversible health effects.\r\n\r\nThe American Industrial Hygiene Association has developed Emergency Response Planning Guideline (ERPG) values for chemicals (including chlorine) which are intended to provide estimates of concentration ranges where one reasonably might anticipate observing adverse effects.  \r\n\r\n¿\tThe ERPG-1 is the maximum concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing other than mild transient adverse health effects of perceiving a clearly defined, objectionable odor.  The ERPG-1 value for chlorine is 1 PPM.\r\n¿\tThe ERPG-2 is the maximum concentration below which it is believed that nearly all individu"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000043312,
      "SummaryText": "als could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individuals ability to take protective action.  The ERPG-2 value for chlorine is 3 PPM.\r\n¿\tThe ERPG-3 is the maximum concentration below which it is believed that nearly all exposed individuals could be exposed for up to one hour without experiencing or developing life-threatening health effects.  The ERPG-3 for chlorine is 20 PPM.\r\n\r\n4.1.1.3  Physical Data\r\n\r\nChemical Name:\t\t\t\tChlorine\r\nCommon Name:\t\t\t\tChlorine\r\nChemical Abstract Service (CAS) No.:\t7782-50-5\r\nChemical Formula:\t\t\t\tCl2\r\nMolecular Weight:\t\t\t\t70.91\r\n \r\nBoiling Point at 1 Atmosphere:\t\t-29&#61509;F (-34°C)\r\nFreezing Point at 1 Atmosphere:\t\t-150&#61509; F (-101°C)\r\nColor:\t\t\t\t\t\tGreenish Yellow (Gas)\r\nOdor:\t\t\t\t\t\tPungent, Characteristic\r\nSolubility:\tSlightly soluble in water; 1.46% at 0°C\r\nDensity:\tVapor density 2.5 (gas is heavier than air)\r\nSpecific Gravity:\t\t\t\t1.41 (liquid is heavier than water)\r\nDescription:\tAmber liquid or greenish-yellow gas with a pungent, suffocating, characteristic odor.\r\n\r\n4.1.1.4  Corrosivity Data\r\nDry chlorine (liquid or gas) is non-corrosive to carbon steel.  In the presence of moisture, however, highly corrosive conditions exist as a result of the formation of hydrochloric and hypochlorous acids.  Dry chlorine will react with titanium to cause corrosion or combustion.  Stainless steels may fail due to chloride-stress corrosion cracking in the presence of moist chlorine. (Ref 4-1)\r\n\r\n4.1.1.5  Stability Data\r\nChlorine is non-combustible in air but most combustible materials will burn in chlorine as they do in oxygen.  Flammable gases and vapors will form explosive mixtures with chlorine.  The volume of liquid chlorine increases considerably with increasing temperature.  Excessive temperatures will cause container failure or failure of container relief systems resulting in a chlorine release to atmosphere.\r\n\r\nIgnition limits depe"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000043312,
      "SummaryText": "nd on temperature, pressure, and concentration.  At 70-80°F, the ignition limits range from 3% to 93% by volume of hydrogen.\r\n\r\n4.1.1.6  Mixing With Other Materials\r\n \r\nChlorine reacts explosively or forms explosive compounds with many common chemicals, especially acetylene, turpentine, ether, ammonia gas, fuel gas, hydrocarbons, hydrogen and metal shavings or dust from mechanical processes. Contact with combustible substances (such as gasoline and petroleum products and others) and finely divided metals may cause fires and explosions. (Refs 4-1 & 4-2)\r\n\r\n4.1.2  \tMaximum Intended Chlorine Inventory\t\r\nThe chlorine used and stored at WPS #1 is delivered in one-ton and 150 lb cylinders.  Dimensions and weights of 150 lb. cylinders and one ton containers are shown below.  \r\n\r\nContainer Type\tNet Capacity, lbs.\tWeight Empty, lbs.\tOutside Diameter, inches\tOverall Height or Length, inches\r\nCylinder\t150\t85-140\t10 ¼ - 10 ¾ \t53-56\r\nTon\t2000\t1300-1650\t30\t79 ¾ - 82 ½ \r\n\r\nWPS #1 is used as a 'distribution center' for chlorine delivered to other water pumping stations located throughout the distribution system.  The 150 lb cylinders are delivered attached to storage racks of six cylinders per rack with a maximum intended inventory of 16 racks resulting in a maximum intended storage volume in 150# cylinders of 14,400 lbs of chlorine. \r\n\r\nIn addition, Water Pumping Station #1 has provisions for storing a maximum intended inventory of eight one ton cylinders (including the ones in use).  Therefore the maximum intended inventory of chlorine stored/used in one ton cylinders is 16,000 lbs.  Therefore, the maximum intended inventory of chlorine in one ton and 150 lb cylinders is 30,400 lbs.  This information is summarized in the following table.\r\n\r\n\r\nTable 4-1\r\nMaximum Intended Inventory\r\n\r\nContainer Type\tNet Capacity, lbs.\tWeight Empty, lbs.\tContainer Total located at WPS #1\tTotal Net Capacity, lbs\r\nCylinder\t150\t85-140\t16 x 6 = 96\t96 x 150 = 14,400\r\nTon\t2000\t1300-1650\t8\t8 x 2000 = 16,00"
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 1000043312,
      "SummaryText": "gh temperatures, chlorine reacts vigorously with most metals.  For instance, a chlorine reaction can cause stainless steel to catch fire or melt.\r\n\r\nChlorine leaks are usually confirmed using a standard ammonia test.  This test is safe because it uses ammonium hydroxide (ammonia dissolved in water or moist air) rather than pure ammonia.  Chlorine reacts readily with ammonium hydroxide to form ammonium chloride, a relatively harmless compound.  This reaction forms a white cloud, indicating a chlorine leak.  The continuous monitors now required indicate chlorine leaks automatically, but the ammonia test is still useful for pinpointing the exact location of a leak.\r\n\r\n4.2.2.4  Corrosion - Chlorine reacts with water or moisture in the air to form highly corrosive acids.  Every precaution must be taken to keep chlorine and chlorine equipment moisture-free.  Never use water on a chlorine leak.\r\n\r\n\r\n4.2.2\tHazard review methodology selection\r\nThe hazard review will help to determine whether WPS #1 is meeting applicable codes and standards; identify, evaluate and address the types of potential failures; and focus on emergency response planning efforts.  The previous section identified the hazards associated with a chlorine release, so the next step is to look for opportunities for equipment malfunction or human error that could cause a release.  In addition the review will consist of the identification of safeguards that can either control the hazard should a release occur or prevent the release from occurring.  The review will identify any shortcomings in the prevention program by using the results of the review to identify specific action items for completion.\r\n\r\nSince WPS #1 is regulated as a RMP Program 2, the department can use any checklist that will provide the applicable risk management items associated with a chlorination system similar to that at WPS #1.  A number of sources were researched including the Failure Mode and Effects Analysis (FMEA) technique used as th"
    },
    {
      "ESSeqNum": 39,
      "FacilityID": 1000043312,
      "SummaryText": "ty-wide emergency response unit that is equipped to mitigate a severe or catastrophic release of chlorine from the pumping station.  \r\n\r\nThe City of Kalamazoo has contracted with Life EMS to provide medical assistance in response to a chlorine emergency.  Life EMS is an ambulance and paramedic service that is trained to deal with chemical emergencies including chlorine.\r\n\r\nThe ERP includes a description of how to distinguish an incidental release from a release requiring an emergency response.  The water system operator/maintainer decides whether they can respond to a small release by using the ambient chlorine gas concentration using their hand held gas detectors and using the fixed mounted chlorine detectors at the station.\r\n\r\nThe ERP includes standard operating procedures and policies pertaining to management of both 150 lb and 1 ton chlorine cylinders and what actions should be taken when a chlorine release is detected.  These procedures are included in Appendix D.\r\n\r\nThe ERP has been submitted to the Local Emergency Planning Committee (LEPC) for incorporation into an area-wide emergency response plan.  The Kalamazoo County Emergency Hazmat Response Plan and the SARA Title III Tier 2 reports for Central are included in Appendix F & G, respectively.\r\n\r\nA list of emergency contacts is included in Appendix H.  Pursuant to the most current revision to the RMP Reporting regulations, in order to ensure that the emergency contact information is reasonable current any changes to the contact list will be made with 1 month of the change.\r\n\r\n\r\n6.0 REGISTRATION\r\n\r\nThe regulations require that various information about WPS #1 pertaining to accidental releases of chlorine be provided.  In compliance with EPA regulations the initial RMP was registered with the agency on June 18, 1999.  The RMP has been updated on June 16, 2004 and again on June 26, 2009.  The next required RMP registration update is June, 2014."
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000043312,
      "SummaryText": "0\r\nTotal Net Capacity of Chlorine:       \t30,400\r\nMaximum Intended Inventory Based on Chlorine Institute recommendation of filling container to a maximum of 95% capacity\t30,400 x 0.95 = 28,880\r\n\r\n\r\n4.1.3\tSafe Limits Concerning Chlorine Use\r\nTemperature and Pressure - The upper and lower limits for the following parameters must not be exceeded at any point in the chlorine storage or feed system.  (Ref 4-1)\r\n\r\nTable 4-2\r\nSafe Temperature & Pressure Limits\r\n\r\n\r\nPARAMETER\t\r\nUPPER LIMIT\t\r\nLOWER LIMIT\r\n\r\nTemperature\t158 oF \r\n(70 oC)*\t\r\n-149.76oF (-100.98oC)**\r\n\r\nPressure\t\r\n310 PSIG*\t\r\nNone\r\n\r\n* The fuse plugs in the one-ton containers are designed to melt at a temperature of 158°F thus releasing chlorine gas into the chlorine storage room; 310 PSIG is the vapor pressure of chlorine gas at a temperature of 158 oF.\r\n**The freezing point of chlorine is -149 oF.\r\n\r\nConsequences of Exceeding Safe Limits - If the temperature of a chlorine container is elevated to 158OF, the fusible plugs installed in the container will melt causing chlorine gas to be vented to the surrounding atmosphere.  If the temperature elevation was due to fire, the escaping chlorine gas would further accelerate the fire as chlorine is an oxidizer and is capable of supporting combustion of certain substances.\r\n\r\n \r\nPressure in the chlorine container is directly related to the temperature of the container.  As the temperature increases, so too does the pressure.  Excessive pressure would be relieved through the fusible plug system described above.  Deviation from the above limits may result in the release of chlorine form the containers or piping system.  The water operator/maintainers would be alerted by stationary chlorine leak detectors installed in the Chlorinator Room. In addition, exhaust fans are operated on a timer and are able to be manually overridden to remove any accumulated chlorine vapor to reduce exposure to personnel in the container and chlorinator rooms.\r\n4.1.4\tEquipment Specifications"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000043312,
      "SummaryText": "The principle components of the chlorination system for WPS #1 consist of the following:\r\n \r\na.\tChlorine one tone cylinders\r\nb.\tChlorine scale\r\nc.\tChlorinators\r\nd.\tChlorine Proportioner\r\ne.\tFree Chlorine Measurement System\r\nf.\tGas Detection & Alarm System\r\ng.\tCaustic Scrubber System\r\n\r\nEquipment specifications for each one of these components are contained in Appendix M 'Chlorination System Component Specifications and Operating Manuals' which is under separate cover.\r\n\r\n4.1.4.1  Process Description\r\nThis section will provide a general description of the chlorination system and the function of the principle components.  A block flow diagram of the chlorination process is indicated in Figure 4-1 along with the chlorine feed system safety controls for the pumping station.  Chlorine gas (under pressure) from the one ton cylinder is routed to the vacuum regulators.  These vacuum regulators are mounted on the ton containers with a yoke and valve vacuum regulator arrangement attached to a valve on the upper portion of the cylinder.  The vacuum regulator serves to reduce the supply pressure from the ton container to a regulated vacuum for safe transport of the chlorine gas.  A liquid chlorine trap is installed on each vacuum regulator. It consists of a drip leg pipe that is heated with an AC powered heating tab arrangement that is attached to the drip leg. These liquid chlorine traps are used to catch and evaporate any liquid chlorine or condensed gas vapors which might enter the piping system.\r\n\r\nFrom the vacuum regulators, chlorine gas is piped to the chlorine feed points on the water main or water supply line.  The chlorinators serve as flow regulators which control the amount of chlorine sent to the chlorine injectors, or ejectors.\r\n\r\n \r\nThe injectors are devices which create a vacuum by using a pressure difference created by the use of low pressure raw water coming from the wells and high pressure water coming from the booster pump flowing through a venturi.  This cre"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000043312,
      "SummaryText": "ates a sufficient vacuum to draw the chlorine gas from the vacuum regulators through the chlorinators and to the ejectors.  A minimum of 12 inches of water vacuum is required.  In the injectors, chlorine gas is mixed with supply line water creating a solution of chlorinated water.  The chlorine solution is routed to various contact points were it is mixed with treated or partially treated water.\r\n\r\nChlorine solution is added to the water for several purposes.  The total chlorine solution used at the pump stations is for disinfection of water prior to discharge to water distribution system. \r\n\r\n4.1.4.2  Process Chemistry\r\nWhen gaseous chlorine (Cl2) gas is added to water, two reactions take place: hydrolysis and ionization.(Reference 4-3)  The hydrolysis process is depicted in the following equation:\r\n\r\nCL2 + H20  &#61627; HOCL + H+ + CL-\r\n\r\nHOCL will further ionize as follows:\r\n\r\nHOCL  &#61627; H+ + OCL-\r\n\r\nThe relative distribution of HOCL and OCL- in the water varies with HOCL having a much more significant disinfecting affect (40-80 times greater) than OCL-.  The distribution is a function of water temperature and pH.\r\n\r\n4.1.4.3  Materials of Construction\r\nMaterials of construction for the chlorination system are as follows:\r\n\r\nTable 4-3\r\nMaterials of Construction\r\n\r\n\r\nEQUIPMENT\t\r\nMATERIALS\r\n\r\nTon container valves (standard Chlorine Institute design)\t\r\nGlobe valve constructed of bronze\r\n\r\n\r\nChlorine gas (pressure) fittings\t\r\nCarbon steel, forged seamless construction with threaded connections.\r\n\r\n\r\nChlorine gas (vacuum) tubing\t\r\nPolypropylene, flexible, &#61490;, 3/8 O.D.\r\n\r\n \r\n\r\n\r\n\r\nFigure 4-1\r\n \r\n4.1.4.4  Electrical Classification\r\n \r\nThe National Electric Code does not classify chlorine as a hazardous (explosive) compound.  Electrical equipment does not require explosion-proof ratings.  Due to the corrosive nature of chlorine, corrosion resistant equipment may be desirable.\r\n\r\n4.1.4.5  Safety Systems\r\nThe chlorine system has several safety systems that are in"
    },
    {
      "ESSeqNum": 28,
      "FacilityID": 1000043312,
      "SummaryText": "e primary method as part of past Process Hazard Analyses that were conducted at WPS#1.  Table 4-7 is the checklist that is used to conduct the the audit of the Safety Information and Hazard Review.\r\n\r\nA FMEA and WI analysis was conducted on December 16, 2010.  Since there has been no significant change made to the chlorination system since then, the findings and recommended actions will be used as a starting point for the 2014 Hazard Review.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n \r\nTABLE 4-7\r\n\r\nCity of Kalamazoo\r\nKalamazoo Public Services \r\nWater Division\r\nWater Pump Station #1\r\nAUDIT CHECKLIST FOR SAFETY INFORMATION AND HAZARD REVIEW\r\n\r\nElement\tYes/No/NA\tAction/Completion Data\r\nSafety Information\t\t\r\nSDSs up-to-date and available to workers\t\t\r\nMaximum intended inventory determined?\t\t\r\nDetermined\r\n¿\tSafe upper and lower temperature?\r\n¿\tSafe upper and lower pressures?\r\n¿\tSafe process flow rates?\r\n¿\tConcentrations?\t\t\r\nEquipment Specifications \r\n¿\tChlorine containers\r\n¿\tVacuum regulators\r\n¿\tChlorine gas valves (pressure)\r\n¿\tChlorine gas valves (vacuum)\r\n¿\tChlorinators\r\n¿\tFlexible tubing (chlorine gas- vacuum)\r\n¿\tPiping (chlorine gas- vacuum)\r\n¿\tChlorine gas leak detectors\r\n¿\tChlorine injectors\r\n¿\tExhaust fans\r\n¿\tScales\r\n¿\tHoist\t\t\r\nHazard Review\t\t\r\nHave hazards associated with the chlorination process been completely addressed; have hazards changed?\t\t\r\nHave opportunities for equipment malfunction or human error that could cause a release been identified?\t\t\r\nHave safeguards been provided that will control the hazards or prevent the malfunction or error.\t\t\r\nHave steps been taken to detect or monitor releases?\t\t\r\nHas equipment been inspected to determine if it is designed, manufactured, installed, and operated according to industry standards and codes?\t\t\r\nAre the results of the inspections documented?\t\t\r\nHave inspections been conducted after every major change?\t\t\r\n \r\n4.3 \tOPERATING PROCEDURES\r\nWritten operating procedures describe in detail what tasks a Water System Operator/Maintainer must"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000043312,
      "SummaryText": "tended to prevent the release of chlorine, to indicate to operating personnel when a particular parameter is outside normal operating limits, or to mitigate the consequences of chlorine exposure.  Several of these safety systems are described below.\r\n\r\nVacuum feed system - The chlorination system used at WPS #1 is a vacuum-type system.  If a chlorine line is broken anywhere downstream of the vacuum heads, the vacuum would be broken and the flow of chlorine would immediately cease.  This type of system is inherently safe as opposed to systems which involve the distribution of chlorine under pressure.\r\n\r\nChlorine gas leak detectors- A fixed chlorine leak sensor is installed near the floor in the chlorine room.  These sensors are connected to a two channel chlorine detector panel located in the pump room, near the scale readout.   The detector will alarm at chlorine in the air concentration of 3.0 PPM (low level alarm) and 5.0 PPM (high level alarm).  The alarms are annunciated locally at the detector panel.  The alarms are also wired into the computer system at Water Supply Operations to provide remote alarm indication.  An audible alarm is also provided locally and remotely.\r\n\r\nChlorine Gas Vapor Scrubber- A chlorine gas vapor scrubber is installed above the chlorine storage room at Pumping Station 1. The scrubber has the capacity to neutralize the contents of a single one ton chlorine container.\r\n\r\n\tEmergency shower/eyewash- An emergency shower/eyewash is located inside the  chemical storage room.\r\n\r\n4.1.4.6  Relief Features\r\nThe chlorine system employs several relief systems which are described as follows:\r\n\r\nTon Container Fusible Plugs - The one-ton chlorine containers in which the chlorine is delivered by the supplier, each have several (typically six) fusible plugs.  These plugs are intended to relieve pressure (and container contents) when the external temperature is in the range of 158-165oF (70-74oC). The fusible metal is designed to melt or yield to relieve"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000043312,
      "SummaryText": "pressure and prevent rupture of the container in the case of fire or other exposure to high temperature.\r\n\r\nVacuum Regulator - Pressurized chlorine gas from the one ton chlorine cylinders is sent directly from the cylinder valve into the vacuum regulator.  A vacuum condition, created in the feed line by the ejector which is in line of the water supply opens the inlet valve to admit chlorine gas into the regulator.  A diaphragm regulates the vacuum at this point to a closely controlled value.  The system is completely under vacuum from the ejector to the gas inlet valve at the vacuum regulator during operation.  If the water supply to the ejector is stopped, or the operating vacuum is lost for any reason, the spring-loaded gas inlet valve immediately closes to isolate the chlorine supply.  Any gas, under pressure, which might enter the regulator, is vented from the system through the built-in pressure relief valve through a chlorine vent line to the atmosphere outside the Chlorine Storage Room.  If the source of chlorine gas is exhausted, a gas port on the vacuum regulator closes to prevent excess vacuum levels from developing upstream of the vacuum regulator and also prevents any moisture from being drawn back into the operating components or the gas supply lines.\r\n\r\nAdditionally, the vacuum regulator features a liquid trap which will trap any liquid chlorine which might enter the regulator.  A liquid chlorine trap consists of a drip leg pipe that is heated with an AC powered heating tab arrangement that is attached to a drop leg. This set up vaporizes the liquid chlorine into chlorine gas.  If liquid chlorine were drawn into the chlorine vacuum lines, and the lines were subsequently isolated by shutting valves, the trapped liquid could cause excessive pressure in the lines due to its 3:1 expansion rate from liquid to gas which could result in a feed line rupture.\r\n\r\nInjector check valve - Each ejector is equipped with a check valve to protect the vacuum regulator f"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000043312,
      "SummaryText": "rom flooding.\r\n\r\n\r\n4.1.5\tDesign Codes and Standards\r\n \r\n\r\nThe chlorine storage, regulation, and feed systems are installed in accordance with generally accepted practices as described by the Chlorine Institute, Inc.  The ton containers in which the chlorine is shipped are constructed in accordance with Department of Transportation specifications.  The specific standards are listed in the following table:\r\n\r\nTable 4-4\r\nDesign Codes & Standards\r\n\r\nScope\tReference\r\nGeneral\tChlorine Institute, The Chlorine Manual, 5th Edition, 1986.\r\nPiping and Valves\tChlorine Institute, Pamphlet 6, Piping Systems for Dry Chlorine, 13th Edition, 1993.\r\nVentilation\tGreat Lakes-Upper Mississippi River Board of State Sanitary Engineers, Recommended Standards for Sewage Works, 1990 Edition.\r\n\r\nChlorine Institute, The Chlorine Manual, 5th Edition, 1986.\r\n\r\n\r\n\r\n4.1.5.1  Ventilation Systems \r\nThe chlorine container and chlorinator rooms are both ventilated using duct fans and electric duct heaters for supply air and wall mounted exhaust fans.  The outside air is tempered by the duct heaters before it is supplied to the rooms.  The exhaust fans are located on located on the \r\nwall (near the floor) to remove chlorine vapors that are heavier than air.\r\n\r\nThe evaluation and performance of the ventilation system falls under the jurisdiction of the Engineering Division. According to the Great Lakes- Upper Mississippi River Board of State Health and Environmental Managers (Ten States Standards) there must be at least 1 air change per minute (60 air changes per hour) be provided when the room is occupied.  The ventilation capacity and controls must meet the standard identified above and the 1991 Uniform Fire Code ventilation criteria for toxic and highly toxic compressed gas indoor storage rooms. \r\n\r\n4.1.5.2  Safety Systems - The chlorine system has several safety systems that are intended to prevent the release of chlorine or to indicate to operating personnel when a particular parameter is outside n"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000043312,
      "SummaryText": "ormal operating limits.  Several of these safety systems are indicated graphically in Figure 3-2 and are described below.\r\n\r\n4.1.5.3  Vacuum feed system- As described in Section 3.3.4.2, the chlorination system used at the KPSWD is a vacuum-type system.  If a chlorine line is broken anywhere downstream of the vacuum regulators, the vacuum would be broken and the flow of chlorine would immediately cease.  This type of system is inherently safe as opposed to systems which involve the distribution of chlorine under pressure.\r\n\r\n4.1.5.4  Chlorine gas leak detectors -  A fixed chlorine leak sensor is installed near the floor in the chlorine storage and application room.  This sensor is connected to a two channel chlorine detector/alarm panel located on the wall outside of the chlorine room. It is normally located in the booster pump area of the station.  The detector will alarm at a chlorine in air concentration of 10.0 PPM and 3.0 PPM will give a visual warning indication.  The alarms are annunciated locally at the detector panel.  The alarms are also sent to the computer at KPSWD water supply control room. This  provides  remote alarm indication at the control room in the KPSWD administration building.  An audible alarm is also provided locally and remotely. \r\n\r\n4.1.5.5  Emergency showers/eyewashes- The emergency shower/eye wash stations for use in removing chlorine from clothing, skin, or eyes will be available and readily accessible.. \r\n\r\n4.1.6 \t References\r\n4-1.\tThe Chlorine Manual, 5th edition, The Chlorine Institute, 1986.\r\n4-2.\tSax, N. Irving, Dangerous Properties of Industrial Materials, 5th Edition, New York: The \tVan Nostrand Reinhold Company, 1979.\r\n4-3.\tTchobanoglous, George and Burton, Frank L. (Metcalf and Eddy),  Wastewater \t\tEngineering, 3rd edition, New York: McGraw-Hill Inc., 1991\r\n4-4.\tGreat Lakes-Upper Mississippi River Board of State Sanitary Engineers, Recommended \tStandards for Sewage Works, 1990 Edition.\r\n\r\n\r\n \r\n4.2 \tHAZARD REVIEW\r\n4.2.1  \tHazard"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000043312,
      "SummaryText": "s Associated with Chlorine\r\n4.2.1.1 Health Hazards - Chlorine is corrosive.  It can burn moist body surfaces such as the eyes, nose, throat, lungs, and wet skin because it forms harmful acids when it reacts with moisture.  Long-term exposure to low concentrations of chlorine may cause a gradual decrease in lung efficiency.  A single exposure to a high concentration can cause the same effect.\r\n\r\nTable 4-5\r\nToxic Effects of Chlorine\r\n\r\nChlorine Concentration (ppm)\tEffect\r\n0.03-0.1ppm\tRanges of odor threshold\r\n1-3 ppm\tMay cause mild irritation of the eyes, nose, and throat\r\n3-5 ppm\tStinging or burning in eyes, nose, and throat; may cause headache, watering eyes, sneezing, coughing, breathing difficulty, bloody nose, and blood-tinged sputum\r\n5-15 ppm\tSevere irritation of the eyes, nose, and respiratory tract\r\n10 ppm\tImmediately Dangerous to Life or Health (IDLH)\r\n30-60 ppm\tImmediate breathing difficulty resulting in pulmonary edema (fluid buildup in lungs), possibly causing suffocation and death\r\n430 ppm\tLethal after 30 minutes\r\n1000 ppm or greater\tFatal after a few breaths\r\n\r\nNote:  Chlorine gas is not visible as a greenish-yellow cloud at concentrations below 1000 ppm.\r\n\r\nTable 4-6\r\nExposure Limits of Chlorine\r\n\r\nExposure level (ppm)\tExposure Limit\r\n0.5 ppm\tMaximum allowable concentration averaged over an eight-hour period\r\n1 ppm\tMaximum allowable short-term exposure (15 minutes)\r\n10 ppm or greater\tImmediately Dangerous to Life and Health (NIOSH)\r\n\r\nNote:  The Immediately Dangerous to Life and Health (IDLH) exposure level is the point at which a person without appropriate respiratory protection could be fatally injured or could suffer irreversible or incapacitating health effects.  NIOSH is the National Institute for Occupational Safety and Health.\r\n\r\n4.2.1.2  Fire - Chlorine will not burn by itself, but will support combustion.\r\n\r\n4.2.1.3 Chemical Action - Chlorine, in both gas and liquid forms, reacts with almost all chemicals, usually with a release of heat.  At hi"
    },
    {
      "ESSeqNum": 29,
      "FacilityID": 1000043312,
      "SummaryText": "perform, set safe process operating parameters that must be maintained, and set safety precautions for operations and maintenance activities.  These procedures are the guide for communicating to the water operator/maintainers how to work safely everyday, giving everyone a quick source of information that can prevent or mitigate the effects of an accident, and providing workers and management with a standard against which to assess performance.\r\n\r\nGeneral information pertaining to Water Pumping Station #1 and the associated written operating procedures have been prepared for the chlorination system and are included in Appendix D.   The operating procedures address the following elements:\r\n\r\n¿\tSteps for each operating phase.\r\n¿\tOperating limits.\r\n¿\tSafety and health considerations.\r\n¿\tSafety systems and their functions.\r\n\r\nThe following chlorination system operating procedures are included in Appendix D.  A brief explanation of what each procedure means is provided below.\r\n\r\nInitial Startup.  This procedure will cover all the steps to be taken before a process is started for the first time.\r\n\r\nNormal Operations.  This procedure should cover the basic chlorination system operation.  These are the core procedures that operators must follow on a daily basis to run the chlorination process safely.\r\n\r\nTemporary Operations.  These operations are short-term; they will usually occur either when the regular process is shut down or when additional capacity is needed for a limited period.  The procedures should cover the steps needed to ensure that the operations will function safely.\r\n\r\nEmergency Shutdown and Operations.  These procedures cover the steps taken if the process must be shutdown quickly.  For most Program 2 facilities, these procedures will be brief because shutting a process down will be little different in an emergency than in ordinary circumstances; the process is simply shut off the flow.\r\n\r\nNormal Shutdown.  These procedures need to provide all the steps need"
    },
    {
      "ESSeqNum": 31,
      "FacilityID": 1000043312,
      "SummaryText": "training must be provided at least every three years.  However, the management at the KPSWD will endeavor to provide annual refresher training.\r\n\r\nOPERATIONS TRAINING OUTLINE\r\n\r\nI.\tUnit Process Overview\r\nII.\tMajor Component Description\r\nIII.\tReview of Operating Procedures\r\nA.\tInitial Start-up\r\nB.\tNormal Operating Procedures (Routine Operator Duties)\r\nC.\tTemporary Operations\r\nD.\tNormal Shutdown\r\nE.\tEmergency Shutdown\r\nF.\tStart-up Following an Emergency Shutdown\r\nIV.\tOperating Limits\r\nV.\tSafety and Health Considerations\r\nVI.\tSafety Systems\r\n\r\nThe Operating Procedures included in Appendix D of this document will be used as training material for the initial and refresher sessions.\r\n\r\n \r\nAll water system operator/maintainer personnel including the supervisor will be required to participate in the training sessions.\r\n\r\nDocumentation\r\nAt the conclusion of the training sessions, a test will be administered by the trainer.  The test scores will be recorded as documentation that each employee received and understood the training.  At the conclusion of the test, the trainer will review the test questions and provide the correct answers to ensure that the employees understand all of the material.  The trainer must document the attendance of all employees and maintain this information with the test results.\r\n\r\n4.5 \tMAINTENANCE\r\nPreventative maintenance, inspection, and testing of the chlorination equipment is critical to safe operations.  The safety hazard review will have identified equipment that is critical to safe operations.  The critical elements of the chlorination system maintenance include:\r\n\r\n¿\tWritten Procedures\r\n¿\tTraining\r\n¿\tInspection & testing\r\n\r\n4.5.1\tWritten Procedures\r\nWritten procedures that are provided by the equipment manufacturer are used to develop routine and preventative maintenance schedules.  The water operator/maintainers are primarily responsible for maintaining the mechanical integrity of the chlorination system equipment. The process control group"
    },
    {
      "ESSeqNum": 30,
      "FacilityID": 1000043312,
      "SummaryText": "ed to stop a process safely.  The procedure should set out the time that should be taken and the checks that must be made before proceeding to the next steps.\r\n\r\nStartup following a nomal or emergency shutdown or a major change.  These procedures could be similar to those for an initial startup.  Startup after an emergency shutdown will generally require more checks to ensure that valves that were closed are open and that they and other equipment are still functioning properly. \r\n4.4 \tTRAINING\r\n\r\nThe water system operator/maintainers must be properly trained in the operation of the chlorination process and informed of safety hazards.  The benefits of  a good training program is trained workers have fewer accidents, damage less equipment, and improve operational efficiency.  The training program, including refresher training, is the key to ensuring that he rest of the prevention program is effective.\r\n\r\nFor a Program 2 process there is no requirement to provide a specific amount of training or type of training.  The training program for the Kalamazoo water operator/maintainers has been developed to suite this operation.  In addition to training all new operator/maintainers, refresher training will be provided at least every three years, or more frequently if the chlorination process is changed.\r\n\r\nPlanning and developing the chlorination system training will consider the following items:\r\na.\tEmployee's who require the training will be clearly identified.\r\nb.\tA training outline will be developed to indicate what's included in the training.\r\nc.\tSpecific training objectives will be developed.\r\nd.\tThe training will consist of a combination of class room and on-the-job training.\r\ne.\tEmployee competence will be measured using written tests and observations by the supervisor.\r\nf.\tAll training will be documented in the Environmental Services Training Database.\r\n\r\nAn outline for a training program that can be used for initial and refresher training is shown below.  Refresher"
    },
    {
      "ESSeqNum": 32,
      "FacilityID": 1000043312,
      "SummaryText": "also performs some related electrical and instrumentation-related tasks as part of the process equipment maintenance.  \r\n\r\n4.5.2\tMaintenance Training\r\nThe maintenance training is currently ongoing with all operator/maintainers.  All water supply personnel that are expected to perform maintenance on the chlorine system will receive annual training.  Specific emphasis will be placed on the hazards associated with chlorine.  In addition, the specific maintenance procedures will be reviewed.  A test will be administered to verify that the personnel understand the material that is covered in the training session. \r\n\r\nAn outline of the initial maintenance training program is as follows:\r\n\r\n1.\tOverview of Chlorination Process\r\n2.\tMajor Component Description\r\n3.\tSafety and Health Considerations\r\n4.\tSafety Systems\r\n5.\tMaintenance Procedures\r\ni.\tTon Container Change Out\r\nii.\tVacuum Regulator Preventive Maintenance\r\n6.\tDiscussion of Materials of Construction\r\n7.\tLocating a Minor Chlorine Leak\r\n\r\n4.5.3\t Inspection and Testing\r\nA computer-based system is used by the maintenance department to coordinate preventive maintenance (PM) activities at all locations.  All major equipment at various facilities, including the chlorination equipment, are assigned a unique identification number and are included in this program.  Relevant equipment data, including serial or model numbers, location, process application, etc., is entered into the computer data base.  Various PM tasks and frequencies are also entered into the data base allowing for the generation of PM work orders based on elapsed time since the last scheduled occurrence.  The computer-generated PM work orders are given to the maintenance or process control employees for completion.  When completed, the work order tasks are initialed and returned to the Operator who enters the completion date, materials used, labor expended, other maintenance performed, etc. into the data base.  An equipment PM history is developed to allow man"
    }
  ]
}