{
  "FacilityID": 1000020556,
  "FacilityName": "Jerritt Canyon Mine",
  "FacilityStr1": "HC31 Box 78",
  "FacilityStr2": "50 Mi N of Elko on State Route 225",
  "FacilityCity": "Elko",
  "FacilityState": "NV",
  "FacilityZipCode": "89801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32007",
  "LEPC": "Elko County LEPC",
  "FacilityLatDecDegs": "41.4105204",
  "FacilityLongDecDegs": "-115.903468",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.yukon-nevadagold.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 842340528,
  "ParentCompanyName": "Queenstake Resources USA, Inc.",
  "Company2Name": "Yukon-Nevada Gold Corp.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Queenstake Resources USA, Inc.",
  "OperatorStr1": "HC 31 Box 78",
  "OperatorStr2": null,
  "OperatorCity": "Elko",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89801",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. John Barta",
  "RMPTitle": "Environmental Manager",
  "FTE": 106,
  "OtherEPAFacilityID": "89801JRRTT50MIL",
  "EPAFacilityID": "100000213789",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "AP1041-0778.01",
  "SafetyInspectionDate": "2011-06-12 00:00:00",
  "SafetyInspectionBy": "MSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-09-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-09-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-09-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-09-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025707,
      "AltID": "Air Pollution Control",
      "FacilityID": 1000020556,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000028309,
          "ProcessID": 1000025707,
          "NAICSCode": "212221",
          "_desc": {
            "NAICS_CODE": "212221",
            "NAICS_DESCRIPTION": "Gold Ore Mining"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030588,
          "ProcessID": 1000025707,
          "ChemicalID": 62,
          "Quantity": 2500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000530588,
          "ProcessID": 1000025707,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000020556,
      "SummaryText": "Enviroscientists, Inc. (Enviroscientists) has prepared this Risk Management Plan (RMP) for the Jerritt Canyon Mine (Facility) to assist the Facility with compliance of the Chemical Accidental Prevention (CAP) regulations, at 40 Code of Federal Regulations (CFR) Part 68. The Facility is operated by Queenstake Resources, Inc. (QRI) and is comprised of mining and milling operations which are principally located in Section 33, Township 41 North, Range 54 East (T41N, R54E) in Elko County, Nevada (Figure 1). The Facility exceeds the threshold quantity of chlorine, as specified on the List of Regulated Substance under section 112(r) of the Clean Air Act (40 CFR 68.130). Chlorine is used onsite as part of the Facility's air pollution control emission technology. This RMP document is intended to summarize the procedures which are in place at the Facility to reduce the risks associated with chlorine and all other chemicals which are stored at the Facility.\n\nThe purpose of this RMP is to summarize the management actions taken by QRI to appropriately handle chlorine at the Facility, as required by the CAP regulations, in order to prevent accidental releases of chlorine which can cause serious harm to the public and the environment. The RMP is also intended to help mitigate the severity of any releases that might occur. The information contained in this RMP is included in order to assist the Facility coordinate emergency actions in the unlikely event of a release. This RMP document is not intended to be used in lieu of the Facility's comprehensive Emergency Response Plan (ERP), nor is it intended to be used in place of the Facility's policies and procedures. This RMP document is intended to be used in cooperation with the ERP to mitigate a release. This document summarizes some of the properties of chlorine and outlines some chlorine management procedures and associated training.\n\nSummary of the Training and Emergency Response Policies\n\nAs a part of QRI's commitment to protectin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000020556,
      "SummaryText": "g their employees and the environment, they provide a 'new hire' initial training to all personnel at the start of employment at the Facility. This training is completed to ensure that employees are able to respond appropriately in the event of an emergency situation. QRI reinforces this initial training with additional training, throughout the year, as a part of mandatory sessions based on various topics which include: medical/first aid, fire fighting, evacuations, and chemical management and release. \n\nEmergency procedures at the Facility vary depending upon the severity of the incident and the material involved. In the event of an emergency at the Facility, employees are required to notify the Incident Commander (shift supervisor) and to leave their work areas in as safe and orderly manner as possible without jeopardizing their safety or the safety of others. The Incident Commander assumes responsibility responsible for the management and mitigation of the incident. The ERP outlines four main types of emergency incidents that could involve hazardous materials at the Facility. These incidents include: fire, explosion, chemical spill, and personnel injuries. Response actions to these incidents are covered in the Facility's ERP.\n\nSummary of Chlorine Management Procedures\n\nGold bearing ore is processed at the Facility using a proprietary roasting technology in association with a conventional crushing, grinding, leaching, and refining system. As a part of gold recovery, QRI has installed new air pollution control system which uses chlorides of mercury formation to control releases of mercury emissions to the atmosphere. The Facility's roaster air pollution control system is designed to cool the roaster off gases and to capture and control mercury and particulate matter prior to stack exit. This is achieved with a wet scrubbing system which allows for quick and effective cooling of the roaster off-gas while at the same time providing particulate matter removal for subs"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000020556,
      "SummaryText": "equent gold recovery. To achieve this, chlorine gas is injected into the off-gas stream just prior to entry of the scrubbing solution to the mercury scrubber. The required amount of chlorine that is added is determined by an oxidation-reduction potential probe in the solution line. This probe measures of the available oxidizer present and calculates the amount of chlorine required for the mercury oxidation reaction to occur.\n\nChlorine at the Facility is housed in four 2,000 pound carbon steel vessels located at the east and west end of the roaster building (Figure 2). The flow of chlorine from the steel vessels is controlled electronically by a gas feed rate control valve that automatically regulates the feed rate of the chlorine based on a residual set point of 100 pounds per day. When the chlorine vessels are empty the metering tube ball located on the vessel will fall to the bottom and the red 'Loss of Chlorine' indicator will be visible.\n\nChlorine is delivered to the Facility in 2,000 pound carbon steel vessels which are escorted from the security gate by the Safety Director, or his designee. Facility management requires that chlorine gas not be transferred from a shipping tanker to on-site vessels via external hose. Vessels will be transferred directly from the delivery truck to the service cradles under the supervision of Facility personnel. Crews responsible for transferring vessels will consist of, at minimum, three personnel including an equipment operator, and two helpers whose responsibility it will be to guide and stabilize the vessels during the off-loading process.\n\nGeneral Accidental Release Prevention Program and Inspections\n\nAll personnel handling chlorine are trained specifically to ensure that chlorine will be handled in such a manner as to mitigate any potential for accidental release or environmental exposure. Prior to maintenance or vessels exchange, Facility personnel are required to wear a gas mask and also to ensure that a second Facility em"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000020556,
      "SummaryText": "ployee is able to observe the transfer from a safe location upwind of the storage area. It is the responsibility of this individual to watch for any chlorine fumes or release. It is the responsibility of this second individual to sound the alarm and initiate emergency response procedures if chlorine gas is released. This individual will not respond to the emergency or risk chlorine exposure, but will ensure that ERP procedures are followed appropriately.\n\nThe chlorine feed pressure is monitored from the digital control system display and during routine shift inspections of the chlorine cylinder. Inspections of the chlorine vessels and the chlorine feed pressure will be recorded at least once per shift on the shift logs. Shift logs are maintained in the control room and are reviewed by the shift supervisor for completeness, accuracy and as method for pre-determining any incidents. As required by the CAP regulations, QRI complies with the provisions of the Facility's safety manual and applicable state and federal laws, regulations, and standards to ensure that chlorine is properly maintained at the Facility. Employees whose job requires direct or indirect management of the chlorine system or chlorine vessels receive training in proper operational procedures including: changing out the vessels and appropriate scheduled maintenance."
    }
  ]
}