{
  "FacilityID": 1000057810,
  "FacilityName": "Pampa Water Treatment Plant",
  "FacilityStr1": "Kentucky St.-.8 Mi W. of",
  "FacilityStr2": null,
  "FacilityCity": "Pampa",
  "FacilityState": "TX",
  "FacilityZipCode": "79065",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48179",
  "LEPC": "Gray County LEPC",
  "FacilityLatDecDegs": "35.546944",
  "FacilityLongDecDegs": "-100.996389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": "dhooper@cityofpampa.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Pampa",
  "OperatorStr1": "P.O. Box 2499",
  "OperatorStr2": null,
  "OperatorCity": "Pampa",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79066",
  "OperatorZipCodeExt": "2499",
  "RMPContact": "Donny Hooper",
  "RMPTitle": "Director of Public Works",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000124723",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-12-08 00:00:00",
  "SafetyInspectionBy": "OMI Contract Operator",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-01-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-02-05 00:00:00",
  "DeRegistrationEffectiveDate": "2017-10-09 00:00:00",
  "AnniversaryDate": "2022-01-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.4457,
  "FRS_Long": -100.8616,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "6",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072241,
      "AltID": "Chlorine disinfection",
      "FacilityID": 1000057810,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000073421,
          "ProcessID": 1000072241,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089166,
          "ProcessID": 1000072241,
          "ChemicalID": 62,
          "Quantity": 8200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000589166,
          "ProcessID": 1000072241,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057810,
      "SummaryText": "General Facility Information\n\n\n\nThe Pampa Water Treatment Plant located at 2801 W Kentucky Street, in Gray County, is owned by the City of Pampa and operated by Operations Management International, Inc (OMI).  Capacity of the facility is 6.0 million gallons per day (MGD).  Presently on, the average the water treatment plant porcesses 2.2 MGD of potable water.  The plant operates 24 hours per day year round.  The plant is staffed 9 hours per day monday through Friday and on weekends 4 hours per day.  The plant is automated to operate continously without supervision.  It is equipped with devices that monitor chlorine residuals, Turbidity, and elevated tank levels.  If any parameter exceeds set values an alarm is sent to an auto-dailer and the plant can automatically shutdown.  Operations will not begin until an operator has corrected the problem.  A maximum of 4 tons of chlorine gas in one ton containers are stored onsite with a container being connected and online at any one time.  The plant is enclosed by a chain-linked security fence with all gates and doors being secured during unmanned hours.  \n\n\n\nOngoing safety training programs cover all phases of plant operation from maintenance and operations safety to safe handling of chlorine.  OMI also conducts formal training as well as onsite training during normal daily operations.  OMI also using outside vendors to conduct safety training relating to plant safety and chemical safety.  Due to this safety training, this plant has not had any significant chlorine release or accidents in the last five years.\n\n\n\nHazard Assessment Information\n\n\n\n40 CFR Part 68, Subpart B - Hazard Assessment, outlines a specific set of critieria to be used in the modeling of worst case and most probable cause release scenarios.  Worst case and most probable case scenario modeling was completed using Areal Locations of Hazardous Atmosphere (ALOHA) software.\n\n\n\nTo complete most probable case and worse case scenario plume models, the default lev"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057810,
      "SummaryText": "el of concern for chlorine was set at levels estabished in accordance with EPA and American Industrial Hygiene Association standards.  The resulting plume indicates a level where individuals would be able to take protective actions without suffering any serious health effects from a chemical exposure during a four hour or less time period.  Most probable case and worse case scenario plume analysis results are conservative estimates based on the ALOHA software, using RMP release and meteorological requirements.\n\n\n\nPrevention Program Information\n\n\n\nOMI has an on-going training plan that involves both classroom and on-the-job training.  All new employees who will be required to handle chlorine are trained in chlorine safety and undergo Right-to-Know training.\n\n\n\nSmall controlled leaks will be handled by plant personnel and all other leakes will be handled by the Pampa Fire Department.\n\n\n\nEmergency Response Informaion\n\n\n\nA controlled release of the chlorine product located at the water treatment plant, will be defined as the escape of gas to the atmosphere in small, non-reportable quantities, resulting from standard operating procedures of connenting or disconnecting chlorine containers and standard maintenance procedures on the plant's chlorine quipment.\n\n\n\nAn uncontrolled release of the chlorine gas, which will require the implementation of the emergency response procedures is defined as any release other than those examples defined as similar to controlled releases.  Emergency responses to the treatment plant will be made by the Pampa Fire Department, in accrdance with the facility emergency reponse plan and the Emergency Response Coordinator.  If uncontrolled release conditions warrent such actions, shelter-in-place, evacuation, and public warning will be implemented by the Pampa Emergency Reponse office of Emergency Management.  Any uncontrolled release of chlorine gas shall be subject to an after action incident investigation by the City of Pampa, OMI, and exclusi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057810,
      "SummaryText": "ve State and Federal regulatory agencies for review and oversight."
    }
  ]
}