{
  "FacilityID": 1000097765,
  "FacilityName": "LANXESS Corporation",
  "FacilityStr1": "214 W. Ruby Ave",
  "FacilityStr2": null,
  "FacilityCity": "Gastonia",
  "FacilityState": "NC",
  "FacilityZipCode": "28054",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37071",
  "LEPC": "Gaston County LEPC",
  "FacilityLatDecDegs": "35.243611",
  "FacilityLongDecDegs": "-081.187500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lanxess.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3164464,
  "ParentCompanyName": "LANXESS Deutschland GmbH",
  "Company2Name": null,
  "CompanyDUNS": 333335490,
  "Company2DUNS": null,
  "OperatorName": "LANXESS Corporation",
  "OperatorStr1": "111 RIDC Park West Drive",
  "OperatorStr2": null,
  "OperatorCity": "Pitsburgh",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "15275",
  "OperatorZipCodeExt": "1112",
  "FTE": 64,
  "OtherEPAFacilityID": "28054NRYLC214WE",
  "EPAFacilityID": "100000143392",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-10-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Gastonia Facility RMP Update & Name Change",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-11-23 12:19:32",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-11-23 12:19:32",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-11-23 12:19:32",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-11-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 35.243611,
  "FRS_Long": -81.1875,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000121072,
      "AltID": "Urethane Polymer Mfg.",
      "FacilityID": 1000097765,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000151515,
          "ProcessID": 1000121072,
          "ChemicalID": 44,
          "Quantity": 200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000151516,
          "ProcessID": 1000121072,
          "ChemicalID": 20,
          "Quantity": 22000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000151517,
          "ProcessID": 1000121072,
          "ChemicalID": 77,
          "Quantity": 61000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000122445,
          "ProcessID": 1000121072,
          "NAICSCode": "325211",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000097765,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-04-15 00:00:00",
    "ERTrainingDate": "2021-05-28 00:00:00",
    "CoordinatingAgencyName": "Gastonia Fire Dept - Hazmat Team",
    "CoordinatingAgencyPhone": "7048666807",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000097765,
      "SummaryText": "ers, employees, suppliers, shareholders and creditors, with authorities and with the public. We report our goals and progress transparently and clearly.\r\n\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe Gastonia plant has several programs and policies to deal directly with accidental release and \r\nemergency response.  Additionally, an Environmental Management Manual has been prepared as part\r\nof their RC 14001 Registration.  Included in that manual are several policies, which also address release prevention and emergency response.\r\n\r\nRelease Prevention\r\n\r\nThe storage and handling of TDI is covered in several significant environmental aspects (RC-14001 Gastonia \r\nPlant Site Aspects).  Preventive maintenance, daily inspection documentation, and internal reporting requirements\r\nare covered in WSP #23, and SOP #30.\r\n\r\nEmergency Response\r\n\r\nEmergency response to a release of TDI is also covered in three main procedures:\r\n\r\nWSP #33 - Spill Prevention, Control and Countermeasures Plan, which includes TDI along with all other \r\nhazardous materials stored on site including fuel oil.\r\n\r\nSOP #25 - Emergency Procedure for Hazardous Release, which includes training, hazardous awareness, necessary PPE, and periodic drills.\r\n\r\nWSP #28 - Emergency and Disaster Plan, which covers fires, explosions, natural disasters, civil disturbances, \r\nbomb threats and rescue & medical emergencies.\r\n\r\n\r\nWorst Case Release Scenario\r\n\r\nThe worst case release scenario modeled by LANXESS Corporation involves a release from our toluene di-isocyanate (TDI) storage tank equivalent to a 2-inch valve breaking.  The valve in this scenario would spill approximately 122,400 pounds of TDI into the secondary containment dike surrounding this tank.  The presence of this dike serves to limit the surface area of the spill, which extends the amount of time necessary for this material to completely evaporate.\r\n\r\nThe RMP submit Program Limits will not accept the actual modeling data.  \r\nAct"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000097765,
      "SummaryText": "ual modeling data is as follows\r\nTotal Quantity Released (Toxic Liquid Pool and Evaporation with Dike)  - 122,400 pounds\r\nEvaporation Rate - 0.02 pounds per minute\r\nRelease Duration - 6,120,000 minutes\r\n\r\nAs demonstrated by the above data, it would take many days for this material to completely evaporate due to the extremely low vapor pressure of this material at its storage temperature.  The toxic endpoint for TDI would occur within LANXESS Corporation's fence line.  LANXESS Corporation has emergency response and cleanup plans in place, and would clean up a release of TDI as quickly as possible to minimize impact to the environment and neighboring community.\r\n\r\nFive Year Accident History\r\n\r\nLANXESS Corporation has not had a release of TDI with an off-site impact during the past five years.\r\n\r\nPlanned Safety Related Changes\r\n\r\nLANXESS Corporation operates the Gastonia Plant with Safety as a high priority.  We work with our TDI supplier on periodic inspections to ensure we are safely handling TDI.  A level interlock device was installed on the TDI tank in response to one of these inspections."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000097765,
      "SummaryText": "m use our products safely and in an eco-friendly way and advise them of the risks associated with use. We also demand the same responsible behavior from our suppliers and service providers.\r\n¿\tWe are committed to protecting the climate and to limiting global warming to significantly less than 2 °C above pre-industrial levels. With regard to our own production and the supply of energy this requires, we have set ourselves science-based reduction targets and will make LANXESS climate neutral by 2040. By steadily improving energy efficiency, our aim is to break the link between organic growth and energy consumption.\r\n¿\tWe support the transformation of society into a sustainable, climate-neutral circular economy that conserves resources:\r\n¿\tWe consider and support the use of secondary (circular) or sustainable and renewable raw materials. We choose our logistics responsibly.\r\n¿\tWe reduce waste, promote waste recycling and avoid unwanted waste emissions.\r\n¿\tWe set great store on ensuring maximum safety when operating our plants. We use consistent, global standards for process and plant safety and regularly check to ensure that they are being observed and\r\nare effective.\r\n¿\tWe are committed to comprehensive environmental protection and improve our environmental performance on an ongoing basis. We research and develop environmentally friendly products and\r\nprocesses to avoid potential harmful effects on the environment.\r\n¿\tWe value long-term customer relationships. These are based on mutual trust and the ability to identify, understand and meet our customers' needs. We strive to identify expectations at an early stage, respond to needs quickly and thus maintain and improve customer satisfaction.\r\n¿\tWe see our suppliers and service providers as partners. When selecting suppliers, we require them to be competent, reliable and to observe our corporate principles.\r\n¿\tWe inspire confidence in the way we do business by engaging in open and respectful communication with our custom"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000097765,
      "SummaryText": "The LANXESS Corporation Gastonia Plant, a 12 acre site, is situated in a residential neighborhood, with homes directly adjacent to the east and west fence lines.  To the north of the plant, directly adjacent to the fence line, is Catawba Creek, a tributary of the Catawba River.  The Catawba River feeds Lake Wylie, a major recreational usage lake.  Municipalities downstream of Lake Wylie, on the Catawba River, utilize the river as their major drinking water supply.  All stormwater leaving the plant site flows directly into Catawba Creek.\r\n\r\nAccess to the facility is via a two-lane street, lined with homes, and several blocks from a major throroughfare.\r\n\r\nThe LANXESS Corporation Gastonia facility manufactures Castable Urethane Prepolymers utilizing Toluene Di-isocyanate as a reactant, in combination with high molecular weight polyethers and polyesters.\r\n\r\nLANXESS Corporation has a Corporate Policy for HSEQ that has been adopted by the Gastonia facility.  This policy contains the key elements of our on-going safety and environmental programs.  Numerous written Standard Practices and Standard Operating Procedures are in place, and their implementation is documented.\r\n\r\nLANXESS Corporation\r\nCorporate Policy\r\n\r\nAt LANXESS, we consider respect, ownership, trust, professionalism and personal integrity to be the cornerstones of our corporate culture. We follow the principles of responsible conduct (Responsible Care&reg;) and sustainable development for the benefit of our employees, business partners, shareholders, society and the environment. We support the United Nations' Sustainable Development Goals and are committed to upholding social and ethical standards and values that are recognized worldwide.\r\nThe positions described below are in line with our company strategy. They apply to all of our business activities, from purchasing to production and maintenance right up to research and new projects. They define our collaboration with partners such as contract manufacturers,"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000097765,
      "SummaryText": "service providers and in joint ventures. They are a basis for evaluation in the event of structural changes in the company, for example as a result of acquisitions (due diligence).\r\n¿\tWe expect the highest quality and safety from our products, services and actions.\r\n¿\tWe use a process-oriented, integrated management system in accordance with international quality and environmental management standards (ISO 9001 and ISO 14001) in order to achieve our goals worldwide efficiently and constantly improve our performance.\r\n¿\tWe create a working environment that empowers our employees to act independently and thus to make a difference. We believe the motivation and commitment of our employees is the key to success. We do our part to maintain the health of our employees. We foster and promote a value-based, performance-oriented culture. Our goal is to be an attractive employer and to develop our employees' potential throughout their careers.\r\n¿\tAt LANXESS, human rights and ethical principles apply unconditionally, even in countries where they are not laid down in legislation. We systematically minimize the risk of human rights abuses through our own activities and along our entire value chain. We demand that our business partners respect human rights and prevent human rights abuses that are directly linked to their activities, products or services.\r\n¿\tTo protect our employees and employees at partner companies, occupational health and safety take top priority. We expect and encourage compliance with the safety, health and environmental protection guidelines at our locations around the world. We foster a sense of responsibility among our employees for safety, health and the environment and encourage them to undergo training in these areas.\r\n¿\tWe believe our product responsibility is about continuously improving product safety for people and for the environment. We globally monitor the impact of our products on health and the environment. We support our customers to help the"
    }
  ]
}