{
  "FacilityID": 1000115721,
  "FacilityName": "AES Alamitos, LLC",
  "FacilityStr1": "690 North Studebaker Road",
  "FacilityStr2": null,
  "FacilityCity": "Long Beach",
  "FacilityState": "CA",
  "FacilityZipCode": "90803",
  "Facility4DigitZipExt": "2221",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.768889",
  "FacilityLongDecDegs": "-118.101111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.aes.com",
  "FacilityEmailAddress": "Charlene.He@aes.com",
  "FacilityDUNS": 43857812,
  "ParentCompanyName": "AES Southland, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "AES Alamitos, LLC",
  "OperatorStr1": "690 North Studebaker Road",
  "OperatorStr2": null,
  "OperatorCity": "Long Beach",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90803",
  "OperatorZipCodeExt": "2221",
  "FTE": 56,
  "OtherEPAFacilityID": "CAR000038265",
  "EPAFacilityID": "100000115083",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "115394",
  "SafetyInspectionDate": "2024-04-12 00:00:00",
  "SafetyInspectionBy": "Long Beach CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.768889,
  "FRS_Long": -118.101111,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000144335,
      "AltID": "2 NOx SCRs:Units 3&4, 5",
      "FacilityID": 1000115721,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000180380,
          "ProcessID": 1000144335,
          "ChemicalID": 57,
          "Quantity": 138750.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000145926,
          "ProcessID": 1000144335,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000087378,
              "Process_NAICS_ID": 1000145926,
              "SafetyReviewDate": "2024-06-26 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Caifornia Building, Fire and Seismic Codes",
              "FR_Comments": null,
              "HazardReviewDate": "2024-06-26 00:00:00",
              "ChangeCompletionDate": "2024-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Specific operational permissives and low flow shut off devices.",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-06-25 00:00:00",
              "TrainingReviewDate": "2023-11-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Team Meetings & Safety Meetings",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Iterative Discussion",
              "MaintenanceReviewDate": "2024-05-15 00:00:00",
              "EquipmentInspectionDate": "2024-05-15 00:00:00",
              "EquipmentTested": "Monthly, quarterly, semi-annual & annual (plus 2-year & 5-year) inspection & PM program of SCR system, piping, sensors and/or tanks",
              "ComplianceAuditDate": "2022-06-13 00:00:00",
              "AuditCompletionDate": "2024-12-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2008-10-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000088225,
                  "PreventionProgram2ID": 1000087378,
                  "ProcessChemicalID": 1000180380
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000115721,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-03-20 00:00:00",
    "ERTrainingDate": "2023-11-15 00:00:00",
    "CoordinatingAgencyName": "Long Beach CUPA",
    "CoordinatingAgencyPhone": "5625704285",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CalARP (19 CCR 2740 et seq), CA Hazardous Materials Business Emergency Plan & Inventory (19 CCR 2729 et seq)",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000115721,
      "SummaryText": "Executive Summary AES Alamitos, LLC Long Beach, California\n29.4% Aqueous Ammonia Selective Catalytic NOx Reduction (SCR) \nUnits 3 & 4; and Unit 5\n\n\nINTRODUCTION\n\nGENERAL RESUBMITTAL BACKGROUND\nThis June 2024 Risk Management Plan (RMP) is a 5-year resubmittal of the AES Alamitos, LLC's RMP (originally filed in June 1999 for the Units 5&6 SCR system, with an update prepared in October 2001 (with a revised version in November 2002) to reflect the two new SCR systems for Units 1 & 4), and updates/resubmittals in June 2004, June 2009 and June 2014. Since the last resubmittal in June 2019, the facility has permanently shut down generating units 1 & 2, and Unit 6. The aqueous ammonia tank and SCR system for Units 1 & 2 are no longer in service and no longer store ammonia (although the tank has yet to be purged of all residuals; this is planned to be complete before 12-2024, if possible). The remaining generating units (Units 3, 4 and 5) are now operated only for emergency use (under a contract with the California Department of Water Resources) for an estimated total of 14 days per year.\n\nThe RMP was prepared in compliance of both the U.S. Environmental Protection Agency (USEPA) and California Accidental Release Prevention (CalARP) Program requirements. This resubmittal includes an updated narrative description (in this Executive Summary) of the AES Alamitos aqueous ammonia accident prevention program, the data elements required by the latest USEPA RMP regulations, and represents a thorough review of operating and maintenance procedures, and a review of the process hazard analyses previously conducted.\n\nTwo physical changes to the system were made after the original 1999 submittal: 1) Prior to October 2001, the 7,500 gallon vertical day tank serving the demineralizer system was permanently placed out of service and completely isolated from the Units 5&6 SCR ammonia system (this change was reflected in the November 2002 RMP submittal), and 2) a small ammonia line now feeds a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000115721,
      "SummaryText": "small amount of ammonia (on manual demand) to the boiler feed water system at Units 1&2 and 3&4 replacing the use of 55-gallon drums of 29.4% aqueous ammonia (now only used for the Unit 3 & 4 system). As part of the 2004 RMP resubmittal effort, a Hazard and Operability (HazOp) Study was performed on the two system changes. There were no previously unidentified consequences or prevention program activities/recommendations resulting from the 2004 HazOp. A facility review of the HazOp for the pre-2024 resubmittals identified no significant changes or issues. A full HazOp was performed in May 2019, and for the 2024 resubmittal, an expert-facilitated summary AES team review of the HazOp began in June 2024 and is expected to be completed by July 3. The resubmittal will be updated if the final report from the new HazOp identifies any recommendations or other issues.\n\nAs documented in the Offsite Consequence Analysis prepared for the 2001/2002 RMP revision, these modifications at the facility did not result in an increase of the offsite consequence analysis (OCA) impact distance for ammonia, the hazardous substance of concern, from the original June 1999 RMP. The OCA has been reviewed and confirmed for the 2004, 2009, 2014, 2019 and this 2024 resubmittal. Therefore, in accordance with AES Alamitos\u0092 interpretation of USEPA regulations at Title 40 of the Code of Federal Regulations (CFR), Part 68, at 40 CFR 68.190(b)(4), an RMP update filing with the USEPA was not required in 2002 since the OCA impact distance did not change by more than a factor of two. The California Code of Regulations (CCR), Title 19, Division 2, Chapter 4.5, Section 2745.10 also did not, under that interpretation, require a filing of an updated RMP under the CalARP Program if the OCA impact distance does not change by more than a factor of two unless the process modification is considered \"significant.\"\n\nHowever, to maintain a fully accurate and up to date facility RMP, in November 2002 AES Alamitos fil"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000115721,
      "SummaryText": "ed a final revised version of the RMP with the City of Long Beach Department of Health and Human Services (Long Beach CUPA). The final 2002 RMP was only filed with CUPA, and not with the USEPA, since an update was determined not to be required under federal regulations.\n\nAs before, for this 2024 RMP resubmittal, AES Alamitos LLC is preparing and resubmitting the RMP as a single integrated program document which includes the two remaining SCR deNOx systems and is intended to reset the 5-year resubmittal period to run through the now expected December 2026 facility closure. This December 2026 date may be extended depending upon California power needs and direction from state power regulators. A new Combined Cycle Gas Turbine (CCGT) generation facility was constructed and is operating within what was a portion of the AES Alamitos property. This facility is a separate entity from AES Alamitos, LLC and has their own Risk Management Plan. \n\nThe 2024 RMP resubmittal process included the following and aside from the permanent shutdown of Units 1 &2 and Unit 6, no changes to the system have occurred since before the previous resubmittal:\n\n1.\tAs an inherent part of the June 2016, May 2019 and June 2022 Triennial RMP Compliance Audits, the SCR systems and programs were reviewed by an experienced multi-disciplinary team of AES Alamitos personnel (operations, environmental, engineering and maintenance), facilitated by a HazOp-experienced ESCI EnviroServices, Inc. licensed Professional Engineer (who completed the 2016 and 2019 Audits), and an RMP- experienced principal-level professional in 2022. It was verified that no changes (except in-kind replacements) to equipment and no changes to procedures (aside from minor administrative updates) had been made since the previous system and program review. Additionally, there were no additional hazards or consequences identified, no necessary or significant recommendations, and no change to any off-site consequence analysis (no change to"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000115721,
      "SummaryText": "worst case or alternative case release scenarios).\n2.\tA new Process Hazard Analysis (PHA) was conducted, using a facilitator-led Hazard and Operability Study (HazOp) in June 2024 (the final nodes will be completed by the first week in July 2024). The HazOp was led and documented by Kazarians and Associates, Glendale, CA. The SCR systems and programs were reviewed in detail by an experienced multi-disciplinary team of AES Alamitos personnel (operations, environmental, engineering and maintenance), facilitated by the HazOp-experienced Kazarians and Associates. It was verified in this that no changes (except in-kind replacements) to equipment and no changes to procedures had been made since the previous 2019 system and program review. Additionally, there were no additional hazards or consequences identified, and no change to any off-site consequence analysis (no change to worst case or alternative case release scenarios). Any recommendations identified will be implemented as appropriate and scheduled in consideration of the degree of risk/hazard. One of the recommendations to be implemented will be the full purging of the Unit 1 & 2 ammonia system and storage tank.\n3.\tA Seismic Hazard Analysis Revalidation was again conducted by Argos Engineers in April 2024, following the most recent CalARP Seismic Hazard Guidance. A prior recommendation from the 2014 seismic revalidation was determined to not be required. All but one of the recommendations from prior seismic revalidations have been implemented, and one (the addition of a lateral brace at the C-clamped pipe support next to the Units 3 & 4 metering skid) is being scheduled for implementation. The 2024 assessment identified cross-stabilization of a suspended pipe; this will be implemented. \n4.\tThe list of recommendations made in previous RMP submittals and Compliance Audits were verified to generally have been implemented, although additional RMP-specific training will be conducted before December 2024.\n5.\tThe current"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000115721,
      "SummaryText": "off-site consequence analysis (worst case and alternative case release scenarios) was evaluated in detail and found to be still valid and representative and no change in impact, distance, or receptors have been identified. All data, assumptions and calculations were verified as part of this 2024 Resubmittal.\n6.\tAES Alamitos has last reviewed the operational and maintenance procedures in preparation for and in conjunction with the Triennial Compliance Audits and the 2024 PHA. The primary source of procedures is the SCR system manufacturer documentation (the Mitsubishi operation and maintenance manuals for Units 1 - 4, and the Noell manuals for the Units 5&6 SCR system), along with certain other AES Alamitos-specific procedures (such as the ammonia loading and unloading & ordering procedure). The procedures were verified to be current and well understood. Ammonia off-loading procedures were updated as of June 2024.\n7.\tSCR and ammonia-related training and training status was reviewed and discussed in conjunction with the Triennial Compliance Audits and the 2024 PHA. General environmental and hazardous materials compliance (and emergency response) training is current. Detailed RMP-related training is currently due and will be conducted no later than December 2024 (after the training is verified to be updated).\n8.\tThe status of the identified corrective actions from the latest June 2022 RMP Triennial Compliance Audit was reviewed. As noted above, updated RMP-specific training will be completed by December 2024. The other two recommendations have been implemented.\n9.\tThe emergency response program and emergency procedures were reviewed, updated as of March 2024 and are maintained current.\n10.\tThe executive summary includes a summary discussion of the applicable RMP and CalARP program elements. Regarding Process Safety Information, all drawings, specifications and system details are maintained at the AES Alamitos facility and in the references system manuals; the equipment"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000115721,
      "SummaryText": "numbers are no longer listed in the submittal documents.\nThe latest EPA/CDX RMP eSubmit program was used to electronically submit the RMP to USEPA, with a modified hard copy (along with California-required CalARP data elements included) submitted to the Long Beach CUPA.\n\nRMP EXECUTIVE SUMMARY COMPONENT\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\nAES Alamitos has had an active hazardous materials management and accident prevention program for many years, and emphases safety and good management practices in all its activities - conducting all activities in accordance with a detailed, well established Accident Prevention Manual that includes active participation by management, line and contractor employees. The AES Alamitos facility has an exceptionally strong safety team and committee program, which are actively and visibly supported by facility management. The facility has in place long-established procedures and policies governing hazardous materials and waste handling, spill prevention, environmental compliance and inspections, as well as safety- related policies. AES Alamitos has a strong commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention (such as SCR system awareness and considering safety in the design, installation, operation and maintenance of the aqueous ammonia SCR systems). Specific to the SCR system, aboveground storage tanks, and the underground storage tank, a multitude of release prevention design, procedural and operational elements and controls are in place and effective. As an integral part of the external events analysis for the AES Alamitos Risk Management Program, the facility had conducted a series of Seismic Hazards Analyses that evaluated the stability and integrity of the SCR mechanical systems and related equipment relative to earthquake and related hazards. A detailed seismic hazard review was performed in 1999, and updated/revalidated in 2004, 2014, 2019 and 202"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000115721,
      "SummaryText": "4. The updated 2014 - 2024 Seismic Hazard Analyses were performed in accordance with the most recent LEPC Region 1 Seismic Hazard Assessment Guidance. The recommendations made in these seismic hazard analyses were evaluated and implemented as appropriate (the 2024 recommendations are in the process of being evaluated and implemented as necessary). As detailed in the Maintenance Section of the RMP, AES Alamitos has in place a multi-faceted inspection and maintenance program that includes daily visual inspections and annual maintenance overhauls.\n\nThe AES Alamitos policy is to implement reasonable and sustainable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, facility and ammonia vendor personnel (if applicable) will take immediate actions to stop a release, if such actions can be taken immediately and safely. If not, the facility will evacuate the affected area, contact outside response agencies for assistance, and provide whatever logistical and technical support as deemed necessary by those responding agencies.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\nThe Alamitos Generation Station, purchased from Southern California Edison (SCE) in 1998 by AES Corporation as part of California's deregulation program, has provided power to Southern California for over 25 years. The AES Alamitos, LLC facility is located 690 North Studebaker Road at the southeastern edge of Long Beach at the Seal Beach border in the City of Long Beach, California. SCE retained the electrical transmission facilities to the north of the current AES Alamitos property (e.g., the switchyards, power distribution lines).\n\n\nThe AES Alamitos power generating facility burns natural gas in boilers to produce steam. The steam is then used in turbine generators to produce electricity. Until December 2019, the station operated six boiler/steam turbine generating units, designated Units 1 through 6. Units I and 2 were rated at 175 MW each,"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000115721,
      "SummaryText": "Units 3 and 4 rated at 320 MW each, and Units 5 and 6 rated at 480 MW each. Due to the construction and operation of a new power plant/facility adjacent to the Alamitos facility, the AES Alamitos facility has shut down several operating units and drastically reduced the operating schedule for the remaining three units. Units 1,2 and 6 are not in use as of Dec 2019 and units 3,4, and 5 are in use for emergency purposes only. It is predicted that they will not be operated for more than appx. 14 days per year. This is under a new 2024 contract with the Dept. of Water Resources (DWR) for emergency power supply. Unless the California state power regulator orders otherwise the facility may be permanently shut down by December 2026.\n\nThe basic flow path of each boiler is as follows: (1) combustion air is supplied by fans to the air preheater where it is heated, (2) the heated air is mixed with fuel in burners to produce a flame and hot flue gases (combustion products), (3) the hot flue gases flow through the radiant and then convective passes of the boiler, (4) heat is removed from the flue gas as it flows over the outside of tubes in the boiler, (5) water flowing in the inside of the tubes is converted to steam as this heat is absorbed, (6) the flue gas flows through the air preheater where a final increment of heat is removed in preheating the incoming combustion air, and (7) the flue gas exits the boiler stack.\n\nAs part of any fossil fuel combustion process, a small amount of nitrogen oxides (NOx) is produced and exhausted to the atmosphere with the other flue gas constituents (mostly nitrogen, carbon dioxide, and water vapor). The amount of NOx that the station is allowed to emit is regulated by the South Coast Air Quality Management District (SCAQMD). In 1991 & 1992, revised SCAQMD rules required a reduction in allowed NOx emissions and specifically the facility install a NOx emission reduction system on the two largest boilers - Units 5&6. In 1993, a Selective Cataly"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000115721,
      "SummaryText": "tic Reduction (SCR) NOx Control System was installed on Units 5 &\n6. In April 2001, AES Alamitos completed installation of two additional SCR systems within the existing boilers of Units 1, 2, 3, and 4. The installation was part of a December 2000 agreement with SCAQMD.\n\nThe SCR process at Alamitos involves injecting aqueous ammonia into the boiler flue gas in the boiler's convective pass. The ammonia/flue gas mixture flows through a catalyst installed between the convective pass and the air preheater. In the presence of the catalyst, the ammonia and NOx react to form nitrogen and water vapor, which exits out the boiler stack. About 90% of the NOx is removed in this manner. The SCR system uses a 29.4% aqueous ammonia solution in the SCR system. The aqueous ammonia is stored in one 20,000-gallon double walled corrosion protected steel underground storage tank for Unit 5, and two aboveground 20,000-gallon double-walled aboveground and separately contained carbon steel aqueous ammonia storage tanks for Units 3 and 4. Since AES Alamitos utilizes aqueous ammonia in amounts over the federal 10,000-pound RMP threshold, the facility and the SCR process are covered under the federal and state Risk Management Prevention program.\n\nOFF-SITE CONSEQUENCE ANALYSIS & WORST CASE AND ALTERNATIVE RELEASE SCENARIOS\nSeveral potential release scenarios were evaluated as part of the RMP Offsite Consequence Analysis (OCA). The OCA was performed in accordance with USEPA and California CalARP OCA guidance. The results of this OCA, which included worst case and alternative release scenarios, were considered in the implementation of the prevention program and in facility emergency planning. The results of the facility's Process Hazard Review was used to determine the most likely (e.g. credible) alternative case release scenario based on operations and system design and maintenance. The specific details and results of the RMP are maintained by the facility and have been reviewed with local emer"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000115721,
      "SummaryText": "gency response and planning agencies (primarily the Long Beach CUPA). The administrative controls and mitigation measures to limit the distances for each scenario are summarized in this RMP submittal. Details are integrated within the various program implementation documents (such as operating and ammonia loading procedures) maintained at the facility. The 1999 and 2001 off-site consequence analysis submitted to Long Beach CUPA (worst case and alternative case release scenarios) were evaluated as part of the 2014 and 2019 resubmittals and this 2024 resubmittal and found to be still valid and representative and no change in impact, impacted population or sensitive receptors have been identified. All data, assumptions and calculations have been verified.\n\nFIVE YEAR ACCIDENT HISTORY\nAES Alamitos SCR systems have had an excellent record of accident prevention since installation. Over the last 5 years, no accidents meeting the definition of an RMP/CalARP accident have occurred at the facility (on-site deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place).  No accidents of any kind associated with the SCR systems have been recorded. Should an RMP-reportable accident occur in the future, AES Alamitos will revise the RMP to include information about the accident within six months of the accident's occurrence and revise the incident investigation information in the RMP. Specifically, AES Alamitos will revise (1) the date of investigation to reflect the date of the investigation of the accident being included in the five-year history; and (2) the expected date of completion of any changes due to that accident investigation, and submit a corrected RMP within six months of the date of the accident.\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\nAES Alamitos maintains a written emergency response program, which is in place to protect worker and public safety as well as the environ"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000115721,
      "SummaryText": "ment. AES Alamitos\u0092 long-standing RMP consultant is an active member of the LEPC Region 1 and is the former Emergency Planning Member. Employees who, in the course of their job duties, are involved in the operation, maintenance, sampling, engineering or supervision of hazardous material or waste storage facilities receive annual training in hazardous waste and materials management, as do all facility hazardous waste generators. This training includes the facility's Emergency Response/Contingency Plan which includes the required elements of a hazardous materials business emergency plan (required by Title 19 CCR) and a hazardous waste contingency plan (required by Title 22 CCR). In addition, the facility has procedures that address the maintenance, testing, and inspection of emergency response and ammonia release detection equipment (and outside contractor performs the regular inspection/testing of detection and alarm systems). The AES Alamitos Emergency Response/Contingency Plan is updated on an annual basis with the new revisions reviewed by the Long Beach CUPA and Long Beach Fire Department following submittal through the state\u0092s CERS electronic inventory and emergency plan portal. Emergency response and emergency planning issues are also reviewed with the CUPA and fire department on a periodic basis, including periodic on-site preplanning tours by the fire department and CUPA.\n\nThe AES Alamitos hazardous materials emergency response program supports and provides for the trained response by designated facility emergency response personnel to incidents involving a wide range of materials. The facility conducts training for such responses. Specifically, as it relates to the aqueous ammonia and SCR systems, AES Alamitos personnel are trained to only respond to an aqueous ammonia release if it can be done so safely and without possible risk to safety or health (e.g. minor, incidental spills of low volume). AES Alamitos will immediately contact and rely upon outside res"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000115721,
      "SummaryText": "ponse agencies, as well as a pre- contracted, qualified emergency response contractor for all other aqueous ammonia releases. Primary public response agencies are the Long Beach Fire Department and Los Angeles County Fire Department Hazardous Materials Unit (by automatic aid). RMP-specific emergency response-related employee training was last conducted in 2022 (a tabletop exercise). Copies of the SCR systems technical information is available for responding agency use.\n\nThe latest emergency plan revision, March 2024 includes the following elements:\n\n\u0095\tList of Emergency Coordinators and Alternates\n\u0095\tInternal and External Notifications and Reporting (including neighboring businesses)\n\u0095\tIncident Command System (Responsibilities)\n\u0095\tIncident/Hazard Evaluation\n\u0095\tEvacuation\n\u0095\tContainment and Removal of Hazardous Waste Release\n\u0095\tScene and Environmental Restoration and Incident Closure (including use, testing and maintenance of emergency response equipment).\n\u0095\tAccident / Incident Investigation\n\u0095\tCorrective and Preventive Actions\n\u0095\tPlan Revisions and Maintenance\n\u0095\tTraining\nThe plan also includes specific information relative to publicity and community or public release of information.\n\nThe AES Alamitos facility's hazardous materials emergency response program conforms to the Emergency Response Program requirements in 40 CFR 68.95 and 19 CCR 2545.8. However, due to the nature and hazard of the material, the significant personal protective equipment and specialized response techniques, and the rarity of any emergency involving the SCR system and storage tank, pursuant to 40 CFR 68.90(b), AES Alamitos is classifying itself as a `Non-Responding Facility' specifically as associated with emergency responses involving aqueous ammonia. In coordinating the AES Alamitos business emergency plan submittal with the Long Beach Fire Department, the facility has coordinated with local response agencies to help ensure that they will be prepared to respond to an emergency at the AES Alamitos f"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000115721,
      "SummaryText": "acility, including procedures to notify emergency responders when there is need for a response.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nBased on a detailed review of the previous and current Process Hazard Analyses for the SCR systems, currently only minor changes are recommended to improve safety \u0096 including installation of the recommended seismic bracing as noted in the April 2024 Argos Engineering Seismic Hazard Analysis, and the complete purging/cleaning of the Unit 1 & 2 ammonia tank. As noted above, updated RMP-specific training will also be conducted and will be incorporated into the annual environmental compliance training. The facility will continue to implement its accidental release prevention program and verify conformance to operational, loading, and maintenance procedures.\n\nIf and when the remaining portions of the facility (Units 3, 4 and 5) are shut down, the aqua ammonia in storage and in process for each system will be removed, including the safe purging of any residuals in the tank and system. All aqua ammonia and vaporized ammonia will be assured removed from the systems prior to any demolition activities.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\nThe following is a summary of the accident prevention program (relating to the aqueous ammonia SCR systems) in place at the AES Alamitos facility. This summary addresses each of the RMP/CalARP elements and describes the management system in place to implement the accident prevention plan.\n\nMANAGEMENT SYSTEM FOR RMP\nAES Alamitos has developed an overall management structure/system in order manage various facility operations, controls, and environmental and safety programs & including implementing various elements of the facility's Risk Management Program.  A full description\n of this management structure, including the list of position titles and their general responsibilities, is available for review at the facility.  In summary:\n\nThe AES Southland Operations Manager has the overall management responsib"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000115721,
      "SummaryText": "ility for implementing the RMP for aqueous ammonia facilities at AES Alamitos. In carrying out this responsibility, the Alamitos Station Manager utilizes the other positions listed below to develop, implement and integrate specific aspects of the Risk Management Program.\n\nTeam Leaders report to the Operations Manager. The Team Leaders have responsibility for all station operating and maintenance personnel. The Team Leaders are responsible for ensuring that all equipment is properly monitored and operated and maintained. The Team Leaders have overall responsibility for implementing the operational aspects of the Risk Management Program.\n\nControl Room Personnel report to their designated Team Leader. From their duty stations in the control rooms, Control Room Personnel continuously oversee the operation and monitoring of all station equipment, including providing detailed technical direction to the Plant Technicians for the immediate tasks at hand. They are responsible for operating and monitoring the Selective Catalytic Reduction system alarms and controls, which are remotely handled (from the control room), and for directing the Plant Technicians to those alarms and controls, which are handled locally.\n\nPlant Technicians report to their designated Team Leader and receive technical direction from on-duty Control Room Personnel. They perform local equipment operations at the direction of the respective Control Room Personnel. The Plant Technicians do a visual inspection of all station equipment twice a shift. Inspections include checking that all gage readings are normal, no unusual vibration or noise exists, lubrication levels are proper, and no leaks exist. They are responsible for immediately reporting any abnormalities detected to the Control Room and will monitor the startup of the Selective Catalytic Reduction system air blowers, pumps, piping and other equipment. During aqueous ammonia deliveries, Control Room Personnel will dispatch one or more Plant Technicia"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000115721,
      "SummaryText": "ns to the aqueous ammonia truck at the appropriate storage tank location. The Plant Technicians are equipped with the appropriate personal protective equipment and two-way communication. They verify the content of the delivery truck, the proper fill connections, valving, and monitor the area until delivery is complete. In the event of an aqueous ammonia release, the Plant Technician would contact the Control Room immediately.\n\nEnvironmental and safety personnel are responsible for facility safety and environmental issues, and for overall RMP regulatory compliance and administration. The environmental and safety staff ensure that all station safety and environmental procedures are followed, coordinate all station safety and environmental training, and maintain records relating to all station safety and environmental issues. The Environmental Manager is also designated as the Risk Management Program Coordinator.\n\nThe Engineer support staff has the responsibility of technical review of the various projects occurring at the station. This individual is responsible for determining the work scope of the proper installation of station modifications. The Engineering staff will work with other departments within the station and throughout AES to ensure proper operation of existing station systems. The Engineering staff is responsible for ensuring that the aqueous ammonia facility and equipment is designed, fabricated, and installed in accordance with applicable codes and regulations, that field construction meets all applicable codes and regulations, and for providing training and initial startup support to AES Alamitos facility personnel. Finally, the Engineering staff is responsible for providing the station with a system description, equipment manuals and data, prints, and procedures of sufficient detail to allow the station to assume responsibility for the operation and maintenance of the aqueous ammonia facility and equipment for its lifetime, commencing at the conclusio"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000115721,
      "SummaryText": "n of initial start-up activities.\n\nPROCESS SAFETY INFORMATION\nAES Alamitos facility keeps on file a variety of technical documents that are used to help design and maintain safe operation of the aqueous ammonia SCR system. These documents address chemical properties and associated hazards, limits for key process parameters, and equipment design basis/configuration information. Facility maintenance and engineering personnel within the facility are assigned responsibility for maintaining up-to-date process safety information. Chemical specific information, including exposure hazards and emergency response/exposure treatment considerations is provided in safety data sheets (SDSs). As part of the SCR system design documents, this information was supplemented by documents that specifically address known corrosion concerns. As part of the manufacturer's SCR system design documentation on file at the facility, documented safety-related limits for specific process parameters (e.g. pressure, flow rate, temperature, etc.) are maintained. The facility staff ensures that the process is maintained within these limits using process controls, and monitoring instruments, trained personnel, and manual and automated shutdown systems.\n\nThe AES Alamitos facility personnel maintain numerous technical documents that provide information about the design and construction of the SCR system (including ammonia storage). The information includes materials of construction, design pressure, temperature ratings, and electrical ratings of equipment. This information, in combination with written procedures and trained personnel, provides the basis for establishing inspection and maintenance activities, as well as evaluating proposed process and facility changes to ensure that safety features are not compromised.\nSummary System Descriptions General\nThe SCR system for Units 5 and 6 was designed by Noell, Inc. The ammonia storage system was designed by Southern California Edison. All equipment was ins"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000115721,
      "SummaryText": "talled by Powerplant Specialists, Inc., under contract to Noell, Inc. For Units 1 \u0096 4 (only the Unit 3 & 4 systems are now the only two of these four to be in operation), the SCR design and ammonia storage systems were designed by a consortium made up primarily of Mitsubishi Heavy Industries and The Industrial Company (TIC). The design of the SCR and ammonia storage systems is governed by the California Occupational, Safety and Health Administration (Cal/OSHA), American Society of Mechanical Engineers (ASME), American National Standards Institute (ANSI), Uniform Building Code (UBC), National Fire Protection Association (NFPA), and California codes. Installation was governed by the same codes. The underground piping and tank design and installation were permitted and approved by the City of Long Beach and the Long Beach Fire Department.\nAn ammonia vapor detector system is provided with four ammonia detectors installed above grade on the perimeter of each storage tank facility with additional detectors located around the metering pumps and unloading areas. The detectors are wired to a local ammonia monitor and alarm panel which will also annunciate to control room operators via the plant distributed control system (DCS). A safety shower is available in each tank area and at the metering pump skids.\n\nThe control system includes an electronic DCS with interlocks incorporated which shut off aqueous ammonia flow to the SCR system in case of low boiler load, low gas temperature in the boiler, low SCR fan flue gas flow, boiler fuel trip or aqueous ammonia tank pump failure. AES Alamitos ensures ongoing mechanical and process integrity of equipment by incorporating manufacturers' maintenance, inspection, and testing procedures in the applicable facility operational and maintenance procedures, as determined appropriate.\n\nThe piping system for aqueous ammonia is Schedule 80 Grade 316 stainless steel with welded fittings in all areas by the metering pump, liquid injector area,"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000115721,
      "SummaryText": "and ammonia storage area. The underground containment pipe is compression fitting 4\" PVC schedule 80. Power Piping Code ANSI B31.1 recommends piping hanger spans of 8 1/2 feet for 1 1/2\" diameter pipe (water service) at 1g-loads. The corresponding maximum weight stress level from Table\n121.5 of the ANSI B31.1 Code, 1989 edition, is 2300 psi. Since the seismic g-load for the subject area is .3g in any horizontal direction, the combined load is only .42g in the horizontal direction. Therefore, the allowable seismic span is estimated to be 200 feet (using (1.0g/0.42g) x 8.5 feet = 20 feet). The seismic span for the aqueous ammonia piping is less than 10 feet in every case. In addition, the pressure stress is negligible since the maximum aqueous ammonia pressure is only 90 psi. Consequently, the seismic design of the aqueous ammonia piping is well within ANSI B31.1 limits.\n\nThe ammonia storage tanks are filled via vendor tanker truck deliveries scheduled at regular intervals based upon ammonia consumption. Truck supply hoses are connected to a loading bulkhead. Transfer pumps, hose purge equipment, and loading controls are provided on the tanker truck itself. A two-inch fill line and a two-inch vapor return line are routed from the primary vessel through block valves to quick connect type couplings for truck unloading. The fill line allows the transfer of aqueous ammonia from the delivery truck to the tank, while the vapor return line allows the displaced ammonia vapors from the tank to be returned to the truck. The fill and vapor return piping are securely anchored at the truck unloading station. The unloading station is within the spill containment barrier that runs along the perimeter of the tank. The tank has a visual level gauge in the vicinity of the loading station to assist the unloading truck operator and to prevent overfilling. A ground cable is provided for connection to the unloading truck. Safety eyewash/shower combinations are provided at the storage tank"
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000115721,
      "SummaryText": "and adjacent to the metering pump skid for each unit. Upon completion of filling operations, all lines are purged with compressed air prior to being disconnected.\n\nUnits 3 & 4\nAES uses a 29.4 percent aqueous ammonia solution for the SCR systems serving Units 3 & 4. Aqueous ammonia is stored in two 20,000-gallon, double-walled, aboveground, and separately contained carbon steel ammonia storage tanks. The storage tanks are ASME- registered U-stamped pressure vessels designed for ammonia service. To minimize potential ammonia leakage, the tanks utilize a double-wall design. The inter-wall space is isolated from the main storage space and can be drained independent of the main storage area. The ammonia supply of the boiler SCR units is taken from these storage tanks.\n\nThe two tanks used for Units 3 & 4 are located south of Unit 3. The tanks are horizontal and each have a nominal capacity of 20,000 U.S. gallons. The tanks are capable of withstanding pressures of 25 pounds per square inch gage (psig), which is designed for the worst-case ambient temperature condition of 125 degrees Fahrenheit.\n\nEach storage tank is placed within a concrete berm. The berms have design capacities of 110 percent of the tank volume, which accounts for 6.5 inches (over 24 hours) of cumulative rainfall for a 25-year frequency storm.\n\nUnit 5\nThe storage facility for Unit 5 includes a single 20,000-gallon, double-walled underground tank system with three aqueous ammonia supply pumps, piping, valves, instrumentation, controls, and electrical. The aqueous ammonia storage tank system consists of a 50 psig primary horizontal pressure vessel (designed and manufactured in accordance with ASME Boiler and Pressure Vessel Code Section VIII) enclosed within a secondary containment tank (designed and manufactured in accordance with UL Standard 58) which is externally clad with fiberglass reinforced polyester resin (in accordance with UL Standard 1746). The fiberglass resin was tested after delivery to ensur"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000115721,
      "SummaryText": "e its integrity and corrosion inhibiting capability.\n\nThe primary vessel is equipped with a vacuum breaker with flame arrester, and a large capacity relief valve set at 50 psig and vented to the atmosphere 12 feet above grade. The flame arrester minimizes the potential for an open flame to be drawn into the main tank. The secondary containment tank is also vented to the atmosphere 12 feet above grade through a dryer canister in parallel with a conservation pressure vent. This arrangement prevents breathing in moisture while allowing a bypass path to prevent pressure build up in the secondary containment.\n\nThe tank is constructed and monitored in accordance with California Code of Regulations (CCR) Title 23 Sections 2631 and 2632. The tank annular space is monitored by two Pneumercator ES825-100CF sensors \u0096 each installed at the end of the tank\u0092s secondary containment. A liquid leak detection system is also provided for the supply pump columns (one element each), safety relief valve discharge (one element), and underground piping secondary containment (one element). The elements are wired to a local leak monitor and alarm panel which will also annunciate to control room operators via the plant distributed control system (DCS). Detection of liquid in the underground piping secondary containment will trip the supply pumps. Four Sierra ammonia vapor sensors are installed aboveground around the ammonia tank area, and additional vapor sensors are located around the overall facility.\n\n\nPROCESS HAZARD ANALYSIS (PHA)\nThe AES Alamitos RMP program includes a process to ensure that hazards associated with the aqueous ammonia SCR system are identified and controlled. Within this program, before any not-in-kind changes are implemented for the SCR system, the process change is systematically examined to identify hazards and ensure that adequate safeguards are in place to manage these hazards. This process was also used as part of the 2001 addition of the Units 1-4 SCR systems.\nThe"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000115721,
      "SummaryText": "AES Alamitos primarily uses the Hazard and Operability-guide word (HazOp) analysis technique to perform these evaluations. HazOp analysis in recognized as one of the most systematic and thorough hazard evaluation techniques. A team of people who have operating and maintenance experience as well as engineering expertise conducts the analyses. This team identifies and evaluates hazards of the process as well accident prevention and mitigation measures. The team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\n\nThe PHA team\u0092s findings, if any, are forwarded to facility management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. The ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options are tracked until they are completed. The final resolution of each finding is documented and retained.\n\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from original design safety features, AES Alamitos, as part of the five-year resubmittal process, reviews (and if necessary) updates and revalidates the hazard analysis results.  Documentation of all PHAs conducted is maintained for inspection at the facility.\n\nA new PHA was conducted, using a facilitator-led Hazard and Operability-guide word study (HazOP), in June 2024. The HazOp was led and documented by Kazarians and Associates, Glendale, CA. The SCR systems and programs were reviewed in detail by an experienced multi-disciplinary team of AES Alamitos personnel (operations, environmental, engineering and maintenance), facilitated by the HazOp-experienced Kazarians and Associates. It was verified in this that no changes (except in-kind replacements) to equipment and no changes to procedures had been made since the previous system"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000115721,
      "SummaryText": "and program review. Additionally, there were no additional hazards or consequences identified, and no change to any off-site consequence analysis (no change to worst case or alternative case release scenarios). Recommendations will be evaluated and scheduled for implantation, if deemed necessary in light of the planned December 2026 facility closure.\n\nOPERATING PROCEDURES\nThe AES Alamitos facility maintains written procedures that address various modes of SCR system (including storage tanks) operations.  These procedures generally include:\n\u0095\tUnit start up (boiler and flue gas blower) and operation;\n\u0095\tSCR system normal start-up, normal shut down and emergency shutdown;\n\u0095\tSCR system on-line operational procedures;\n\u0095\tAqueous ammonia ordering and truck unloading procedure.\n\nOther AES Alamitos procedures potentially impact the operation of the SCR system and storage tanks, but are not directly related to SCR system or tank operations. These include general safety and fire protection policies, procedures and practices. The SCR system\u0092s general operation and maintenance is governed by these policies and practices where they apply.\nThese operational procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed to assure they are current and accurate. The last informal review was conducted as part of the RMP Triennial Compliance Audit in May 2019 and the May 2019 PHA (the ammonia unloading procedure was revised June 2024). The procedures are kept current and accurate by annotating/revising them as necessary to reflect changes made through an informal management of change process. The facility maintains several master sets of operational and maintenance procedures including a set in the relevant control room, and truck unloading procedures located at each ammonia storage tank unloading area.\n\nTRAINING\nTo complement the written procedures for process operations, AES Alamit"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000115721,
      "SummaryText": "os has implemented a training program for all employees and contractors involved in operating or maintaining the SCR systems. As an integral part of the safety and hazardous materials training, training which includes the safe receiving, operation and maintenance of the SCR system and associated tanks is provided to all personnel who are or may be working with the SCR system and/or aqueous ammonia. This training is accomplished utilizing resources available inside and outside the station. In general, new employees receive basic training in plant operations if they not already familiar with such operations and all new workers working with the SCR system or associated tanks are trained in the SCR system operating procedures as well as the specific hazards of ammonia. After successfully completing this training, a new operator is paired with an experienced operator to learn process-specific duties and tasks. After operators demonstrate (e.g. through tests, skills demonstration, etc.) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. As noted, the most recent RMP training was conducted (generally a part of the annual environmental/hazardous materials training) in November 2023. An updated version of RMP-specific training is expected to be provided by end of 2024.\n\nThe specific individual training programs at AES Alamitos is supported by the facility's Injury and Illness Prevention Program (IIPP) and written safety procedures manual, which emphasizes communication of safety hazards and requirements on a continuous basis, as well as general safety and safe work practices training. As noted elsewhere in the RMP, hazardous materials emergency response training is also provided. Training documentation is maintained by the facility.\n\nThe SCR system and other safety training at AES Alamitos may be performed in various formats and environments including classroom, field-based, on-the-job, safety meeting, team m"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000115721,
      "SummaryText": "eeting and informal 'one-off' type interactions. In addition, the facility's current aqueous ammonia vendor implements its own training program for their employees (including drivers) and periodically assists in conducting refresher training at AES related to truck delivery and unloading procedures. At AES Alamitos, the ammonia vendor also has participated in the facility's on-site training related to ammonia handling. The Long Beach Fire Department has also participated in on-site ammonia training.\n\nInitial SCR system operational and maintenance training was conducted for all station operations, maintenance and engineering personnel at the time each SCR system was constructed/installed as an integral part of each system's initial system start up and performance evaluation. The training was conducted/supervised by the SCR system manufacturer/design company.   The training was both formal classroom-based and field-based. An initial RMP program training class was conducted in 1999 detailing the management and compliance requirements and responsibilities of the RMP/CalARP program. Annual multi-media environmental training includes a module for management and compliance requirements and responsibilities of the RMP/CalARP program.\n\nIn addition, all operators periodically receive refresher training on the operating procedures and hazards to ensure their skills and knowledge are maintained at an acceptable level. This refresher training is conducted as an integral part of the AES Alamitos ongoing safety training program but is assured met at least every 3 years. At AES Alamitos, periodic refresher training has included the hazards of ammonia, ammonia truck delivery, loading and emergency procedures, off site consequences, general emergency response, and SCR system maintenance. The SCR system and RMP compliance is a periodic element of the facility's safety meetings.\n\nAs an integral part of the Process Safety Information and Operating Procedures elements of the RMP, should"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000115721,
      "SummaryText": "the safety information or procedures be modified in any significant fashion, refresher training will be conducted.\n\nAs part of the RMP submission, pursuant to 40 CFR 68.54(a) and 19 CCR 2755.4(a), AES Alamitos is hereby certifying that AES employees have the required knowledge, skills, and abilities to safely carry out the duties and responsibilities as provided in the operating procedures.\n\nMAINTENANCE\nAES Alamitos has established practices and procedures to maintain facility systems and controls, including those associated with the aqueous ammonia SCR systems and storage tanks. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, and (4) correcting identified deficiencies. In combination, these activities form a process that maintains the mechanical integrity of the process. Equipment-specific maintenance requirements and specifications for the SCR systems and storage tanks are contained in the multi-volume set of SCR System Operating and Maintenance Manuals provided by the two SCR system designers, NOELL and Mitsubishi. Facility maintenance personnel use these manuals and the procedures contained therein as the primary references whenever performing SCR and storage tank inspection, maintenance, test and necessary repair/replacement. These maintenance/operational procedures are readily available to relevant personnel at the AES Alamitos facility.\n\nMaintenance personnel have received initial formal classroom training prior to initial SCR system startup as discussed in 'Training'. SCR system equipment was incorporated into the AES Alamitos existing Preventive Maintenance Program. The facility tracks and documents all manufacturer and regulatory-required maintenance and inspection activities, including a tickle file system for the Preventive Maintenance Program, on AES computerized maintenance tracking system. The maintenance procedures and requirements for the SCR systems were la"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000115721,
      "SummaryText": "st reviewed in detail as part of the May 2019 PHA and the May 2019  and June 2022 Triennial RMP Compliance Audits.\n\nEquipment routinely inspected includes pumps, lines, vents, detection systems, controls & settings, tank vessels, tank pressure relief valves (PRVs) and settings, system and piping markings, and other elements. During any related or adjacent maintenance activities (whether or not on the SCR system and tanks), any damage observed during these activities is repaired/replaced as appropriate.\n\nDesignated facility personnel perform daily housekeeping inspections, which specifically include the SCR system and tanks. As part of the facility's Clean Water Act/Hazardous Waste (RCRA) compliance program, all equipment is visually inspected by designated facility personnel a minimum of twice each shift, with the results documented at least weekly on the inspection report. Any damage or malfunction noted is reported and appropriately corrected. Safety equipment associated with the ammonia systems (eye wash/shower, respirator protection, etc.) is also routinely inspected as part of the facility's ongoing existing occupational safety programs.\n\nCOMPLIANCE AUDITS\nTo help ensure that the accident prevention program is functioning properly, AES Alamitos periodically conducts an audit to determine whether the procedures and practices required by the risk management and accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. This audit reviews each of the USEPA-required prevention program elements to ensure that they are up-to-date and are being implemented and will help identify problem areas and if necessary, take corrective actions. Compliance audits are conducted by a team lead by AES compliance personnel assisted by an outside RMP compliance auditing consultant. AES Alamitos operations, maintenance and engineering personnel also participate in the audit. An RMP compliance audit checklist is used during the audit. The"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000115721,
      "SummaryText": "last audit (which included the RMP) was performed in June 2022 with the audit report issued to facility management for development and implementation of any corrective action. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nINCIDENT INVESTIGATION\nA primary tool used by AES Alamitos to identify the contributing factor(s) responsible for accidents, incidents, occupational illnesses, or unusual hazardous events is a thorough and properly completed incident/accident investigation. The incident investigation will attempt to focus on root causes or contributing factors associated with an accident or incident. From these findings, corrective action will be initiated as necessary to reduce the potential for recurrence. The incident investigation procedures used are an existing, integral part of the AES Alamitos Safety and Injury and Illness Prevention Program. The goal of each investigation is to determine the facts, identify causal factors and root causes, and then develop corrective actions to prevent a recurrence of the incident or a similar incident.\n\nThe investigation team documents its findings, develops recommendations to prevent recurrence, and forwards these results to management for resolution. Corrective actions taken in response to the investigation team\u0092s findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so reports can be reviewed during future RMPs, PHAs and PHA revalidation.\nAlthough all industrial accidents or injuries are formally investigated as part of the facility's ongoing safety program, specific to the aqueous ammonia hand"
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 1000115721,
      "SummaryText": "led in the SCR systems and associated storage tanks, AES Alamitos will make additional investigative efforts when investigate incident which would meet, or could have resulted in, an accident   meeting    the\n`RMP reportable 5-year accident criteria' (on-site deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place). Should an RMP-reportable accident occur in the future, AES Alamitos will revise the RMP to include information about the accident within six months of the accident's occurrence and revise the incident investigation information in the RMP. Specifically, AES Alamitos will revise (1) the date of investigation to reflect the date of the investigation of the accident being included in the five-year history; and (2) the expected date of completion of any changes due to that accident investigation and submit a corrected RMP within six months of the date of the accident. As stated previously, there have been no accidents meeting this threshold since SCRs have been in use at AES Alamitos. There have been no re"
    }
  ]
}