{
  "FacilityID": 1000083522,
  "FacilityName": "The SYGMA Network - Columbus",
  "FacilityStr1": "2400 Harrison Road",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "OH",
  "FacilityZipCode": "43204",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39049",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "39.971550",
  "FacilityLongDecDegs": "-83.064647",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sysco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sysco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 51099661,
  "Company2DUNS": 0,
  "OperatorName": "The SYGMA Network - Columbus",
  "OperatorStr1": "2400 Harrison Road",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43204",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Vice President/General Manager",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168356",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-12-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-03-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.97004,
  "FRS_Long": -83.065,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000104369,
      "AltID": "NH3 Refrigeration System",
      "FacilityID": 1000083522,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000105702,
          "ProcessID": 1000104369,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000130711,
          "ProcessID": 1000104369,
          "ChemicalID": 56,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000630711,
          "ProcessID": 1000104369,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083522,
      "SummaryText": "The SYGMA Network\n\n240 Harrison Road, Columbus, Ohio 43204\n\nExecutive Summary\n\n\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nAt The SYGMA Network's Columbus, Ohio facility, we distribute perishable and non-perishable food items and merchandise to our customer's retail restaurant locations throughout Ohio and several surrounding states. To preserve our perishable products, we utilize an industrial refrigeration system to cool the product storage areas. The refrigeration system utilizes anhydrous (without water) ammonia as a refrigerant. Ammonia, a naturally occurring element, is part of the nitrogen cycle and is one of the oldest mechanical system refrigerants used. The properties that make ammonia one of the ideal industrial refrigerants for the food industry are the same ones the make it necessary to follow certain safety precautions. These precautions are designed to:\n\n\n\n    Protect our neighbors and the surrounding community.\n\n    Reduce the possibility of harm to the environment.\n\n    Prevent unnecessary human exposure.\n\n    To reduce the threat to our employee's personal health.\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled:\n\n\n\nAt The SYGMA Network's Columbus, Ohio facility, our primary purpose is to supply our customers with high quality merchandise. To maintain the quality of our perishable food items we utilize a multi-single stage refrigeration system containing a charge of Anhydrous Ammonia. The system was charged at the startup of the system during the last facility expansion. The system is a closed loop system that requires no additional ammonia unless the system is expanded or if a release occured.  Access to the refrigeration system areas and equipment is restricted to our trained and authorized system operation personnel, authorized maintenance personnel, authorized management personnel, and authorized approved contractors. We observe stringent safety and operating procedures and ensure that contractors follow these poli"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083522,
      "SummaryText": "cies. Our operators have successfully completed RETA Operator 1 and 2 training courses.\n\n\n\nThe regulated substance contained at this facility is Anhydrous Ammonia.\n\n\n\nOur refrigeration system charge is 16,125 pounds. The maximum inventory of Anhydrous Ammonia expected to be present at this facility, based on operational requirements, is >16,500 pounds.\n\n\n\n3.    The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps:\n\n\n\nThe facility complies with the US EPA's Risk Management Planning regulation, OSHA's Process Safety Management regulation and all other applicable Federal State and Local regulations. All qualified refrigeration system operators have been trained and have demonstrated competence in our safety and standard operating procedures. Non-qualified personnel are not permitted to access, operate or maintain the refrigeration equipment.\n\n\n\n4.    5-Year Accident History:\n\n\n\nThere have been no reportable accidental releases at this facility during the past 5 years.\n\n\n\n5.    Emergency Response Plan:\n\n\n\nThe SYGMA Network's Columbus, Ohio facility is included in the written community emergency response plan. The local agencies coordinating the facility emergency response plan are the Columbus Fire Dept. and the Chemical Emergency Preparedness Advisory Council of Franklin County (CEPAC).\n\n\n\nThe facility has its own emergency action plan which includes specific actions to be taken in response to accidental releases of regulated substances.  The emergency action plan includes procedures for informing the public and local response agencies in the event of a chemical release. The emergency action plan includes information on emergency health care.\n\n\n\nOur emergency response program was developed following the guidelines in the IIAR bulletin #106 Recommended Procedures in the Event of Ammonia Spills, applicable Federal State and Local Codes, and industry best practice methods. All employees are trained in our emergency response procedures. Respo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083522,
      "SummaryText": "nse to emergencies with ammonia concentrations of less than 299 Parts per million (PPMs) is to be handled by our facility's maintenance and supervision with backup from the Columbus Fire Department's HAZMAT team when necessary. Releases with concentrations above 300 PPM or of unknown concentration will be handled by the Columbus Fire Department's HAZMAT team. Only trained and authorized employees are permitted to actively participate in response to emergencies.\n\n\n\n6.    Planned Changes to Improve Safety:\n\n\n\nThe facility is currently in the process of replacing all single pressure relief valves with dual manifolded relief valve assemblies. We are also replacing a carbon steel oil pot with a new stainless steel vessel to eliminate corrosion issues typically seen with carbon steel vessels in this particular service. We will continue implementation of our comprehensive mechanical integrity and maintenance program. In accordance with our Mechanical Integrity Program and industry best practices, we are scheduled to complete our 5 year PHA revalidation, Non-destructive testing and 5-year Mechanical Integrity inspection this year.\n\n\n\nThe facility will continue our annual facility evacuation drills and planning/training site visits with the Columbus Fire Dept. in the future.\n\n\n\n\n\n"
    }
  ]
}