{
  "FacilityID": 1000083075,
  "FacilityName": "Miniat Foods LLC",
  "FacilityStr1": "62 Adamson Industrial Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Carrollton",
  "FacilityState": "GA",
  "FacilityZipCode": "30117",
  "Facility4DigitZipExt": "9370",
  "FacilityCountyFIPS": "13045",
  "LEPC": "West Georgia Regional LEPC",
  "FacilityLatDecDegs": "33.609988",
  "FacilityLongDecDegs": "-085.097341",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": "www.miniat.com",
  "FacilityEmailAddress": "kantonelli@miniat.com",
  "FacilityDUNS": 117409338,
  "ParentCompanyName": "Ed Miniat Foods LLC",
  "Company2Name": null,
  "CompanyDUNS": 25233107,
  "Company2DUNS": 0,
  "OperatorName": "Ed Miniat LLC",
  "OperatorStr1": "62 Adamson Industrial Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Carrollton",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30117",
  "OperatorZipCodeExt": "9370",
  "RMPContact": "Larry Earle",
  "RMPTitle": "Sr. Director of Operations",
  "FTE": 90,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050892",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-03-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Carrollton, GA 2008",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-01-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-10-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-10-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-10-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 33.61129,
  "FRS_Long": -85.09497,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103827,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000083075,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000105347,
          "ProcessID": 1000103827,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129993,
          "ProcessID": 1000103827,
          "ChemicalID": 56,
          "Quantity": 28000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629993,
          "ProcessID": 1000103827,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083075,
      "SummaryText": "This is an executive summary of the policies, procedures and activities for compliance with the EPA's Accidental Release Prevention Requirements - Risk Management Program pursuant to Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) for the Miniat Foods LLC Carrollton, Georgia facility (Miniat Foods LLC).\n\n\n\n<> The accidental release prevention and emergency response policies at the stationary source [40 CFR 68.155(a)]:\n\n\n\nThe accidental release prevention and emergency response policies are addressed in the individual RMP procedures which detail the RMP program requirements as well as how Miniat Foods LLC complies with the applicable requirements.  Miniat Foods LLC is a responding facility for releases of the RMP-listed chemicals, so the site utilizes an Emergency Response Plan (ERP).  \n\n\n\n<> The stationary source and regulated substances handled [40 CFR 68.155(b)]:\n\n\n\nStationary Source:\n\n\n\nThe Miniat Foods LLC, Georgia facility chills and stores a variety of food products in their cold storage warehouse. The refrigeration process, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage rooms. Changes in pressure are directly related to changes in temperature. Typical operating conditions range from vacuum (approximately 7\" Hg) on the low pressure side of the system to 150-160 psig on the high side.  \n\n\n\nRegulated Substances Handled & Covered Process:\n\n\n\nMiniat Foods LLC, Carrollton uses one chemical (anhydrous ammonia) that is subject to reporting under this filing to the U.S. Environmental Protection Agency (EPA).  \n\n\n\nThe Carrollton facility includes multiple pieces of equipment in the closed loop refrigeration process. The equipment with the single largest capacity is the low temperature receiver #2.  All equipment is administratively controlle"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083075,
      "SummaryText": "d to an 85% level limit and the system is equipped with an emergency shut down (King) valve. \n\n\n\n<> The general accidental release prevention program and chemical-specific prevention steps [40 CFR 68.155(c)]:\n\n\n\nMiniat Foods LLC has implemented the Program Level 3 prevention program requirements under the RMP regulations.  The required elements of the RMP prevention program are listed below:\n\n\n\n     Employee Participation\n\n     Process Safety Information\n\n     Process Hazard Analysis\n\n     Operating Procedures\n\n     Training\n\n     Contractors\n\n     Pre-startup Safety Review\n\n     Mechanical Integrity\n\n     Hot Work Permit\n\n     Management of Change\n\n     Incident Investigation\n\n     Compliance Audits\n\n\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following: IIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\"; IIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\"; and IIAR R1, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\".  \n\n\n\nIn addition, the facility meets the requirements of the RMP Emergency Planning and Response element for responding facilities, as detailed below. These items, their specific requirements, and how the Miniat Foods LLC, Carrollton site complies with the requirements are addressed in the individual procedural documents.\n\n\n\n<> The five-year accident history [40 CFR 68.155(d)]:\n\n\n\nThe Miniat Foods LLC, Carrollton site has had zero RMP reportable incidents in the previous five years.\n\n\n\n<> The emergency response program [40 CFR 68.155(e)]:\n\n\n\nThe Carrollton facility has developed a written ERP that includes activation of the local emergency notification system and calling 911 from a safe location [29 CFR 1910.38(c)(1)] and directing an evacuation, including exit route assignments [29 CFR 1910.38(c)(2)]. All employees are trained to assist other employees in a safe and order"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083075,
      "SummaryText": "ly evacuation [29 CFR 1910.38(c)(2)]. Should the scope of any incident exceed the capability of Miniat Foods staff, such as a large flammable gas release, fire, or explosion at the facility, the employee discovering emergency shall follow the protocol provided in the Emergency Response Plan to notify facility personnel, isolate the covered process if safe to do so, evacuate the facility and perform headcount at the designated muster point, and contact emergency responders. The on-site HazMat Team is trained to First Responder Operations Level only; the Carroll County Fire Department HazMat Team provides response for releases beyond the site level of training.\n\n\n\nEmergency exit routes and assembly areas are identified on the evacuation maps located in each work area. In addition, designated assembly areas are identified by signs in the field. Note that there are no facility processes that would require continued operation during an emergency. \n\n\n\nFire extinguishers are available at several locations within the plant site to assist with the response of small, incipient fires. Facility employees should only administer the fire extinguishers if the fire is within the capacity of the extinguisher and if the employee is trained to do so [29 CFR 1910.119(n)]. \n\n\n\nMiniat Foods is equipped with spill-cleanup materials for containment and cleanup of minor spills. \n\n\n\n<> Planned changes to improve safety [40 CFR 68.155(f)]:\n\nMiniat Foods LLC  is committed to improving our safety systems and continues to address recommendations identified in the most recent Process Hazard Analysis (PHA) for this covered process. Future changes will be reviewed under the Management of Change (MOC) element and will address potential changes to improve safety as part of the MOC process.\n\n"
    }
  ]
}