{
  "FacilityID": 1000093326,
  "FacilityName": "City of Arcata Wastewater Treatment Facility",
  "FacilityStr1": "601 South G Street",
  "FacilityStr2": null,
  "FacilityCity": "Arcata",
  "FacilityState": "CA",
  "FacilityZipCode": "95521",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06023",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "40.855129",
  "FacilityLongDecDegs": "-124.090232",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "WR",
  "FacilityURL": "www.cityofarcata.org",
  "FacilityEmailAddress": "eservices@cityofarcata.org",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Arcata",
  "Company2Name": null,
  "CompanyDUNS": 4940821,
  "Company2DUNS": 4940821,
  "OperatorName": "City of Arcata",
  "OperatorStr1": "736 F Street",
  "OperatorStr2": null,
  "OperatorCity": "Arcata",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95521",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": "CAL983601964",
  "EPAFacilityID": "100000133535",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-09-15 00:00:00",
  "SafetyInspectionBy": "Northern California Safety Consortium",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-04-26 12:49:13",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-04-26 12:49:13",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-04-26 12:49:13",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-04-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.855129,
  "FRS_Long": -124.090232,
  "FRS_Description": "WATER RELEASE PIPE",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115855,
      "AltID": "Wastewater Treatment",
      "FacilityID": 1000093326,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144800,
          "ProcessID": 1000115855,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000144801,
          "ProcessID": 1000115855,
          "ChemicalID": 49,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000117270,
          "ProcessID": 1000115855,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000099121,
              "Process_NAICS_ID": 1000117270,
              "SafetyReviewDate": "2021-04-14 00:00:00",
              "PHA_Date": "2021-06-30 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-04-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Tsunami",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "failsafe automatic vacuum shut-off system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "update warning signs and site maps for emergency responders",
              "OpProceduresReviewDate": "2021-04-15 00:00:00",
              "TrainingReviewDate": "2021-03-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-04-15 00:00:00",
              "EquipmentInspectionDate": "2021-04-15 00:00:00",
              "EquipmentTested": "containers and equipment inspected daily",
              "ChangeMgmtDate": "2012-03-28 00:00:00",
              "ChangeMgmtReviewDate": "2021-03-23 00:00:00",
              "PreStartupReviewDate": "2005-10-01 00:00:00",
              "ComplianceAuditDate": "2018-08-28 00:00:00",
              "AuditCompletionDate": "2018-12-31 00:00:00",
              "IncidentInvestigationDate": "2018-05-21 00:00:00",
              "InvestigationChangeDate": "2018-05-31 00:00:00",
              "ParticipationPlansReviewDate": "2021-03-16 00:00:00",
              "HotWorkPermitReviewDate": "2021-03-10 00:00:00",
              "ContractorSafetyReviewDate": "1996-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2021-03-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000124241,
                  "PreventionProgram3ID": 1000099121,
                  "ProcessChemicalID": 1000144800
                },
                {
                  "PrimaryKey": 1000124242,
                  "PreventionProgram3ID": 1000099121,
                  "ProcessChemicalID": 1000144801
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000093326,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-04-14 00:00:00",
    "ERTrainingDate": "2019-08-14 00:00:00",
    "CoordinatingAgencyName": "Arcata Fire Department",
    "CoordinatingAgencyPhone": "7078252000",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093326,
      "SummaryText": "s and Prevention Plan (IIPP) was adopted in May of 1996, in accordance with the California Code of Regulations and California Labor Code.  The IIPP established policies and procedures for, including, but not limited to Confined Space, Hazard Communication, Asbestos, Respiratory Protection, Hearing Conservation, Accident/Incident Reporting, Emergency Evacuation, Medial Emergencies, Code of Safe Practices, General Safety Rules, Tuberculosis Control Program and Bloodborne Pathogens, Contractor Safety Requirements and Inspections.  It the policy of the City to establish guidelines and procedures for the maintenance of an on-going IIPP.  To fulfill the goal of providing a safe working environment, the IIPP is administered by the City Manager who reviews federal and state statutes and/or regulations relating to safety and risk management, coordinates and implements a comprehensive Safety and Loss Prevention Program.  This is accomplished through safety and health inspections, accident investigations, employee training, and designated departmental safety representatives. \r\n\r\nSpecific to chlorine response, the City coordinates and participates in hazardous material release response training drills with the Arcata Fire Department and neighboring wastewater facilities.  Following training and review, operational  and response procedures are revised where necessary.  \r\n\r\nIn addition to the federal RMP, the City of Arcata  participates in the California Accidental Release Program, administered through the Humboldt County Department of Environmental Health (707) 445-6215."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093326,
      "SummaryText": "The Arcata Wastewater Treatment Facility, located on the north-eastern shore of Humboldt Bay, California, serves city of Arcata residents and portions of the unincorporated community of Fieldbrook.   The wastewater facility was designed to process an Average Dry Weather Flow of 2.3 MGD and a maximum hydraulic capacity through the primary system of 5.0 MGD.  Wastewater treatment is accomplished through solids removal, primary and secondary  treatment (oxidation ponds/treatment marshes/enhancement marshes).  Secondarily treated effluent is disinfected using chlorine and dechlorinated using sulfur dioxide prior to discharge to Outfall 001- Humboldt Bay and Outfall 002 - Arcata Marsh and Wildlife Sanctuary.\r\n\r\nThe Wastewater Treatment Facility has been handling chlorine for over 35 years and has never experienced a release.  On average, there are 15 (1 ton) chlorine containing cylinders on site.  Typically six (6) cylinders are on-line and nine (9) are in storage.  There are also six (6) sulfur dioxide containing cylinders, with two (2) cylinders on-line and five (5) in storage.  Following a chemical demand evaluation, staff determined that due to an annual average chlorine consumption of 1.5 - 2.0 tons per week,  chemical supplier location  (500 miles), delivery delays due to road conditions and effluent disinfection requirements (public health and off-shore commercial shellfish harvesting) the amount of on-site chemical is necessary.     \r\n\r\nDisinfection is accomplished through treated wastewater being inducted with chlorine gas and detained in the chlorine contact basin.  Following detention, sulfur dioxide is inducted into the chlorinated wastewater for dechlorination and the effluent is discharged to Outfall 001 (Humboldt Bay) and Outfall 002 (Arcata Marsh and Wildlife Sanctuary).\r\n\r\nThe vacuum operated induction units contain sensors that provide notification upon high vacuum, low vacuum and/or power failure status sensors and are connected to an alarm system loca"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093326,
      "SummaryText": "ted at the operator control panel located within the Plant Operations Building.  There are also chlorine/sulfur dioxide leak detector sensors that alarm at the operator control panel.   If these alarms are not acknowledged within six (6) minutes, the Arcata Police Dispatch is autodialed and notified,  Police Dispatch then call Operators on-duty for response.  The on-call operators are within 30 minute response time of the wastewater treatment plant.   As additional backup, there is on-site automatic audible and visual alarms that alerts employees within the Corporation Yard of a gas leak or release and a manually activated audible alarm to instruct employees and visitors to evacuate the premises. All alarms have uninterrupted power supplies installed.  Equipment inspections are regularly conducted and recorded by operational staff.\r\n\r\nThe City has identified three scenarios which may constitute a chlorine or sulfur dioxide emergency; (1) major leak/spill, (2) minor leak/spill, and (3) fire and transportation.  In the event of a major leak/spill or fire and transportation situation Arcata Fire Department and Humboldt Bay Fire Department Hazardous Materials Response Team will respond to the event.  In the event of a minor leak/spill which is not actively leaking and which does not require the use of a leak kit, trained employees may respond.  A minimum of four trained employees must be present prior to entering the area.  Two employees, wearing radios and personal protective equipment (including SCBAs) will respond to the leak and two employees will stand-by to conduct monitoring and external communications with other emergency responder personnel. \r\n\r\nA windsock and spotlight, visible from a two (2) miles radius, is located atop the primary digester to provide a visible indicator of wind direction and wind intensity.  The predominate wind direction flows out of the north west towards Humboldt Bay and agricultural lands.  The population center of town is located north"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093326,
      "SummaryText": "of the EPA's RMP*Comp program.  Use of this table indicates that a 10 minute release of a 1 ton chlorine containing cylinder in an enclosed space in direct contact with outside air, in an urban setting results in a 3 PPM endpoint in a 0.9 mile radius.  It should be noted that topography, atmospheric conditions and other site specific variables are not taken into consideration in the endpoint result.  Estimated affected population, based upon Arcata GIS data is 1,598 persons.\r\n\r\nAlthough limited by similar restrictions (topography, atmospheric conditions), the alternative release scenario results are based upon a 60 minute release from a vessel leak releasing 15 pounds chlorine per minute.  EPA's 'RMP*Comp' distance to endpoint result 0.1 miles.  There are no residential structures within the wastewater treatment plants' proximity for 0.5 miles.  Estimated affected population is 0.\r\n\r\nIn 1995 staff investigated and evaluated disinfection alternatives to chlorination/dechlorination.  Methods evaluated included ultraviolet (UV) disinfection, ozonation and sodium hypchlorite.  Due to wastewater effluent characteristics, NPDES permit requirements and financial costs for system design, modification and operations, disinfection utilizing chlorine was deemed the most viable.  \r\nIn a 2012 National Pollution Discharge Elimination System (NPDES) permit, the North Coast Regional Water Quality Control Board required the City to replace the gaseous disinfection system with an ultraviolet light disinfection system.  The requirement was initiated by the City's proposed plans to address safety and disinfection byproduct issues at the WWTP.  The City anticipates installation of a UV disinfection system by 2023 as part of a larger WWTP upgrade project.  Use of the chlorine/sulfur dioxide system will be phased out, first with a reduction of the amount of chemical stored and used on site, followed by complete elimination of the chemical disinfection system.  \r\n\r\nThe City's Injury Illnes"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093326,
      "SummaryText": "and upgradient of the wastewater treatment facility.  The Humboldt Bay region typically experiences moderate to cool, wet weather.\r\n\r\nThe EPA has defined the worst-case scenario as a 10 minute  release of the largest quantity of a regulated substance from a single vessel or process line failure that results in the greatest distance to an endpoint.  The distance to the endpoint is the distance a toxic vapor cloud will travel before dissipating to the point that serious injuries from short-term exposures will no longer occur.  Assuming a release takes place at ground level, the toxic endpoint for chlorine is defined as 3 parts per million.  This airborne concentration is the maximum airborne concentration below which it is believed that nearly all individuals may be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individuals ability to take protection action.\r\n        \r\nDue to its sharp odor characteristic, chlorine is noticeable even when the amount in the air is small.  It is usually possible for persons to leave an area before serious harm is suffered.  Inhalation of chlorine causes general restlessness, panic, severe irritation of the throat, and difficulty breathing.\r\n\r\n\r\n\r\n     Effect                                                                                 Parts Per Million (Chlorine)\r\nDetectable Odor                                                                                3   PPM\r\nNoxiousness                                                                                     5   PPM\r\nThroat Irritation                                                                                15   PPM \r\nCoughing                                                                                         30   PPM\r\nDeath after a few breaths                                                           1000  PPM   \r\n\r\nResults for the worst-case scenario are derived through the use"
    }
  ]
}