{
  "FacilityID": 1000092475,
  "FacilityName": "Star of the West Milling Co. New, York",
  "FacilityStr1": "35 Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Churchville",
  "FacilityState": "NY",
  "FacilityZipCode": "14428",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36055",
  "LEPC": "Monroe County LEPC",
  "FacilityLatDecDegs": "43.102305",
  "FacilityLongDecDegs": "-077.885883",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "OT",
  "FacilityURL": "www.starofthewest.com",
  "FacilityEmailAddress": "patrick.nellenbach@starofthewest.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Star of the West Milling Co.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Star of the West Milling New York",
  "OperatorStr1": "35 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Churchville",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14428",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199297",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-05-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-03-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.102949,
  "FRS_Long": -77.884833,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114814,
      "AltID": "Chlorine flour treatment",
      "FacilityID": 1000092475,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143455,
          "ProcessID": 1000114814,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000116207,
          "ProcessID": 1000114814,
          "NAICSCode": "311211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000098175,
              "Process_NAICS_ID": 1000116207,
              "SafetyReviewDate": "2021-02-25 00:00:00",
              "PHA_Date": "2017-10-26 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-12-16 00:00:00",
              "TrainingReviewDate": "2020-12-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Contractor Provided Training To Millers when Equipment installed",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-12-16 00:00:00",
              "EquipmentInspectionDate": "2020-12-16 00:00:00",
              "EquipmentTested": "Replacement Rotometers, Metering Cabinet, Flexible Lines",
              "ChangeMgmtDate": "2020-12-16 00:00:00",
              "ChangeMgmtReviewDate": "2020-12-16 00:00:00",
              "PreStartupReviewDate": "2020-12-16 00:00:00",
              "ComplianceAuditDate": "2021-02-25 00:00:00",
              "AuditCompletionDate": "2021-04-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-02-25 00:00:00",
              "HotWorkPermitReviewDate": "2021-02-25 00:00:00",
              "ContractorSafetyReviewDate": "2021-02-25 00:00:00",
              "ContractorSafetyEvalDate": "2021-02-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000122410,
                  "PreventionProgram3ID": 1000098175,
                  "ProcessChemicalID": 1000143455
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000092475,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-06-14 00:00:00",
    "ERTrainingDate": "2019-01-23 00:00:00",
    "CoordinatingAgencyName": "MONROE COUNTY - LEPC",
    "CoordinatingAgencyPhone": "5854730710",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000092475,
      "SummaryText": "fies the facility's requirement to register and provide the EPA a summary of their Risk Management Program for the chlorine system."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092475,
      "SummaryText": "residential population within the radius of influence was determined using Marplot.\r\n\r\nAlternative Release Scenario\r\nOne alternative release scenario was evaluated for the chlorine process per USEPA 40 CFR 68.165(a)(2).  The alternative release scenario considered is in accordance with the guidelines provided in 40 CFR 68.22 and 68.28.\r\n\r\nThe scenario for the alternative release follows:\r\n\r\nThe alternative release scenario is defined as the scenario that is most likely to occur in the event of a chlorine release.  For the facility's flour mill, this release would be a gas leak resulting from a hole in the process tubing.  Once free chlorine is identified by the Acutec sensors, chlorine from the storage tanks is immediately shut-off by the Halogen Valve Actuator system.  Due to security issues, the results of this analysis are not reported in the executive summary but may be found in section 3.0 of the RMP.  Results were derived using EPA modeling program RMP*Comp.  The residential population within the radius of influence was determined using Marplot.\r\n\r\n68.155(e) Five-year Accident History\r\nNo accidents, as described under 40 CFR 68.42(a), have occurred at this facility within the past 5 years.\r\n\r\n68.155(f) Emergency Response Program\r\nThe emergency response program established by the facility does not require personnel to act as the site incident commander.  In the case of an incident the Churchville Fire Department becomes the incident commander and assumes the role of directing response activities including any community emergency evacuation measures.  Fire department staff have the appropriate training for responding to an accidental release of chlorine.  The facility's emergency response procedures have been coordinated with the Local Emergency Planning Committee (LEPC) and the fire department.\r\n\r\n\r\n\r\nConclusion\r\n\r\nThe facility will continue to re-evaluated their system for handling chlorine and updated and modified elements as necessary.  The RMP*Submit satis"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092475,
      "SummaryText": "gation measures.\r\n \r\nThe toxic endpoint for chlorine has been defined by EPA to be 0.0087 mg/L (3 ppm).  This airborne concentration that is used as the toxic endpoint is the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects. \r\n\r\nThe distance to the toxic endpoint becomes a radius for a circle around the covered process.  Residential population within the circle is required to be determined based on available census information.  The population number is reported as part of the EPA submittal.  This method may over estimate the population potentially exposed to a single chlorine leak, because the chlorine plume would seek lowest elevations in the direction of the prominent winds.  Since wind direction cannot be anticipated for an accidental release, EPA mandated the circle estimation method. The area around the facility is urban.  The environmental receptors include schools, businesses, recreational areas, churches, and residential areas.  \r\n\r\nRelease scenarios and distances to toxic endpoints are discussed in more detail in the subsequent paragraphs.\r\n\r\nWorst-Case Release Scenario\r\nWorst-Case Release Scenario is determined in accordance with the requirements provided in 40 CFR 68.22 and 40 CFR 68.25(b,c). \r\n\r\nAs described in USEPA 40 CFR Part 68.25(b) the worst-case release shall be the greater of the following:\r\n\r\n1. The greatest amount held in a single vessel or\r\n2. The greatest amount in a pipe.  \r\n\r\nFor the chlorine process at the facility the worst-case release will occur if a one-ton cylinder (maximum amount held in a single vessel) of chlorine ruptures and its contents escape to the atmosphere in 10 minutes.  Due to security issues, the results of this analysis are not reported in the executive summary but may be found in section 2.0 of the RMP.  Results were derived using the EPA modeling program RMP*Comp.  The"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092475,
      "SummaryText": "mary must include a brief descripton of the facilty's Risk Management Program.  The following sections list each of the required executive summary data elements by rule citation.  \r\n\r\n68.155(a) Accidental Release and Emergency Response Policies\r\nThe facility has operated their chlorination system without incident since its initial operation. This successful operating record is due to the facility's commitment to training programs, operating procedures, and maintenance activities. The facility has consistently updated its policies and provided the necessary personnel training to enhance the safety of the operations at the plant.\r\n\r\n68.155(b) Stationary Source and the Substance Handled\r\nStar of the West Milling Co. operates a flour mill designed to mill soft red and white winter wheat for specialty baking flour used in cakes, cookies and pastries.  The plant is located in the City of Churchville, Monroe County, New York.  Chlorine, contained in 2000 lb. cylinders, is added to enhance the color and baking performance of flour.  The ton containers are stored in a ventilated, concrete block room within a concrete building that is secured to prevent unauthorized access.  Chlorine sensors, located in the storage room and at the chlorinator, activate an audible alarm and visible beacon and initiate automatic shutoff valves in the event of a leak.\r\n\r\n68.155(c) Offsite Consequence Analysis\r\nOne worst-case release scenario and one alternative release scenario was assessed for the chlorine process.  To ensure a common basis for comparisons EPA defined the worst-case scenario as the release of the largest quantity of a regulated substance from a single vessel or process line that results in the greatest distance to an endpoint.  The alternative release rate is a release that is considered more reasonable or more likely.  Active mitigation measures can be used in determining the alternative release scenario while the worst-case scenario only allows consideration of passive miti"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092475,
      "SummaryText": "Facility Name:  Star of the West Milling Co. New York\r\nFacility Location:  35 S Main St., Churchville, NY  14428\r\nParent Company:  Star of the West Milling Co.\r\nRMP Facility ID:  1000-0019-9297\r\n \r\nRMP Executive Summary below:\r\n \r\nIntroduction\r\n\r\nThe U.S. Environmental Protection Agency (EPA) Risk Management Program (RMP) regulations 40 CFR Part 68, require facilities that have a regulated substance above the listed threshold quantities to develop a formal Risk Management Program.  EPA also requires these facilities to register and submit a Risk Management Plan using RMP*Submit.  Starting in June of 2007 Star of the West Milling Co. will maintain quantities of chlorine at its flour mill above the RMP threshold quantity of 2,500 pounds and as such is subject to the requirements of 40 CFR Part 68.  An off-site consequence analysis was completed to determine the RMP program level applicable to the facility.  Based on the worst-case release as defined by EPA the facility is subject to RMP Program 3 requirements.  \r\n\r\nThe elements of the RMP are listed below:\r\n\r\nProcess Hazard Assessment- Assess the potential impacts of worst-case and alternative release scenarios and compile a 5-year accident history.\r\n\r\nPrevention Program - Implement a comprehensive management program that affects a wide variety of operation, training, and maintenance activities.\r\n\r\nEmergency Response - Implement an emergency action program for the covered processes.\r\n\r\nRisk Management Plan - Register and submit an RMP plan that includes an executive summary, RMP data elements, results of the hazard assessment, and summarizes how all other requirements are met.\r\n\r\nThe information presented in this section is intended to describe the elements of the facility's Risk Management Program.  The format of the section corresponds to the executive summary data elements as dictated in 40 CFR Part 68.155 Executive Summary Section.\r\n\r\n\r\nExecutive Summary Data Elements\r\n\r\nAccording to EPA guidance the executive sum"
    }
  ]
}