{
  "FacilityID": 1000048016,
  "FacilityName": "Moroni Plant",
  "FacilityStr1": "300 West 350 South",
  "FacilityStr2": null,
  "FacilityCity": "Moroni",
  "FacilityState": "UT",
  "FacilityZipCode": "84646",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49039",
  "LEPC": "Sanpete County LEPC",
  "FacilityLatDecDegs": "39.517917",
  "FacilityLongDecDegs": "-111.591278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Pitman Farms",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pitman Farms",
  "OperatorStr1": "PO Box 308",
  "OperatorStr2": null,
  "OperatorCity": "Moroni",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84646",
  "OperatorZipCodeExt": null,
  "RMPContact": "Larry Dyches",
  "RMPTitle": "Refrigeration Supervisor",
  "FTE": 370,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165466",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-12-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-09-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-01-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-01-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-01-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.51944,
  "FRS_Long": -111.59333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5.5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059973,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000048016,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061078,
          "ProcessID": 1000059973,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073390,
          "ProcessID": 1000059973,
          "ChemicalID": 56,
          "Quantity": 36700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000573390,
          "ProcessID": 1000059973,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048016,
      "SummaryText": "                                               MORONI FEED PROCESSING DIVISION\n                                                            PSM/RMP ROGRAM\n\nI.   ACCIDENTAL RELEASE PREVENTION AND EMERGENCY POLICIES\n\nMoroni Feed Processing Division recognizes management's responsibility in protecting it's employees, equipment, property, and the environment against the hazards of an unintentional ammonia release. The safety and health of all employees and the public is very important.  The control of accidents has been and will continue to be a basic responsibility of all personnel in the facility.\n\nThe Moroni Feed PSM/RMP program assigns and documents the specific responsibilities for developing, implementing and integrating the OSHA PSM and the EPA RMP standards into its safety program.  Moroni Feed believes that Employee participation is the key to a successful program.  Operating level employees, particularly the Maintenance and Refrigeration Manager and the Refrigeration System Operators, have been deeply involved in the PSM/RMP program development, implementation and integration and they assume the major responsibility for operating the Moroni, Utah facility safely.\n\nThe Moroni Feed Emergency Response Program has been developed with the complete cooperation and support of the Moroni Volunteer Fire Department.  All  Moroni Feed employees have received documented emergency response training.\n\n\nII.  STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nMoroni Feed Processing Division Manages a turkey processing operation.  The refrigeration system is required for the Processing, storage and distribution of Frozen Turkeys.  The refrigeration system contains no approximately 36,700 pounds of Anhydrous Ammonia.  Anhydrous Ammonia is the only Hazardous Material on site in quantities above the threshold quantity.\n\n\nIII.  SUMMARY OF WORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\nPlease refer to onsite data for Offsite Consequence Analysis data.\n\nIV.   DESCRIPTION OF THE MORON"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048016,
      "SummaryText": "I FEED ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nMoroni Feed conducts an annual training and response exercise with the Moroni Volunteer Fire Department to practice, train and update the Moroni Feed Emergency Response Program.\n\nMoroni Feed conducts a triennial PSM/RMP implementation progress audit of the entire PSM/RMP program to identify strengths and weaknesses and make improvements.  Moroni Feed considers the PSM/RMP manuals to be living documents that must be updated and revised regularly to maintain their viability.\n\nMoroni Feed emphasizes and insists on \"employee participation\" from the refrigeration system operators in all aspects of the development, implementation, and integration of their PSM/RMP program.\n\nMoroni Feed provides a comprehensive, computer based, user friendly training program with \"one-on-one\" teacher involvement in specific training modules for each ammonia refrigeration employee.\n\nMoroni Feed maintains a pro-active \"open-door\" policy toward neighbors and concerned community citizens.  Facility tours and risk management discussions are scheduled and conducted upon written request.\n\nV.  FIVE YEAR ACCIDENTAL RELEASE HISTORY\n\nThere have been no releases of ammonia that resulted in an injury, or that had an off-site impact, or that resulted in significant property damage either on-site or off-site in the past five years.\n\nVI. EMERGENCY RESPONSE PROGRAM\n\nFacility employees have been trained to respond to accidental ammonia releases.  The site emergency plan has been coordinated with the community emergency plan under the jurisdiction of the Local Emergency Planning Commission (LEPC) and the Moroni Volunteer Fire Department.\n\nVII.  PLANNED CHANGES TO IMPROVE SAFETY\n\nMoroni Feed recognizes that their PSM/RMP program will provide much needed improvement to their safety effort. The PSM/RMP program is considered to be a set of \"living\" documents and procedures that will require constant attention, development, and revision before \"Safety\" becomes second n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048016,
      "SummaryText": "ature.\n\nMoroni Feed expects to improve safety performance by emphasizing the following elements of their PSM/RMP Program\n\n1)   Employee Participation is the \"Key\" to a successful program.  Both the Maintenance and Refrigeration Manager and the Refrigeration System Operators will be deeply involved in verifying the P&ID's, the Standard Operating Procedures (SOPs), and performing the documented Preventive Maintenance Inspections.\n\n2)    The  Moroni Feed PSM/RMP Program will increasingly become a revised and re-written to be understood and used by the operating level employees.\n\n3)   All recommendations developed during the mechanical integrity audit, the PHA, and the PHA revalidation were designed to improve the safety performance of the Moroni Feed Ammonia Refrigeration Process.  Moroni Feed expects to evaluate each recommendation in a timely manner and implement, as soon as possible, those recommendations that will reduce the possibility of a release and/or mitigate the consequences of an unintentional release."
    }
  ]
}