{
  "FacilityID": 1000118297,
  "FacilityName": "River Valley Cooperative Camp Grove",
  "FacilityStr1": "835 State Route 40",
  "FacilityStr2": null,
  "FacilityCity": "Speer",
  "FacilityState": "IL",
  "FacilityZipCode": "61479",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17123",
  "LEPC": "Marshall County LEPC",
  "FacilityLatDecDegs": "41.045647",
  "FacilityLongDecDegs": "-89.631797",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "River Valley Cooperative",
  "OperatorStr1": "P.O. Box 256",
  "OperatorStr2": null,
  "OperatorCity": "Eldridge",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52748",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000242276",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-09-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-10-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-10-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-10-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000147627,
      "AltID": "Product Storage Only",
      "FacilityID": 1000118297,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000184525,
          "ProcessID": 1000147627,
          "ChemicalID": 56,
          "Quantity": 868694.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000149302,
          "ProcessID": 1000147627,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000089106,
              "Process_NAICS_ID": 1000149302,
              "SafetyReviewDate": "2024-03-29 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "Applicable building, electrical and plumbing codes. This facility complies with the Illinois Fertilizer Law.",
              "FR_Comments": "We utilize those portions of these codes which are deemed applicable by the jurisdictional authority",
              "HazardReviewDate": "2024-10-07 00:00:00",
              "ChangeCompletionDate": "2024-10-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "vandalism/theft; vehicular protection",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "breakaway couplers at the risers",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Regular equipment inspection/routine preventative maintenance and repairs",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Routine visual inspections.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-08-06 00:00:00",
              "TrainingReviewDate": "2024-03-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-08-06 00:00:00",
              "EquipmentInspectionDate": "2024-08-06 00:00:00",
              "EquipmentTested": "Pump, pump seals, pipes and plumbing, valves, nitrogen shut offs,electrical and safety equipment. The breakaway couplers, pressure relief valves and hoses are also inspected and replaced as necessary.",
              "ComplianceAuditDate": "2022-11-04 00:00:00",
              "AuditCompletionDate": "2022-11-04 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000089995,
                  "PreventionProgram2ID": 1000089106,
                  "ProcessChemicalID": 1000184525
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000118297,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Marshall County LEPC",
    "CoordinatingAgencyPhone": "3092462295",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Illinois Fertilizer Laws",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000118297,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE AT RIVER VALLEY COOPERATIVE, CAMP GROVE.\n\nThis facility complies with the most current ANSI Standard CGA-most current standard requirements for Anhydrous Ammonia storage and Handling.  It is our policy to adhere to the Rules and Regulations Relating to the Handling of Anhydrous Ammonia and Low Pressure Nitrogen Solutions, Equipment, Containers and Storage Facilities administered by the Illinois Department of Agriculture.  If an emergency were to occur, it is our policy to immediately notify the Wyoming Fire Department (via 911 call) and request that it respond to the emergency.  Incidental to the notification to the fire department, a call to the Marshall County LEPC and the Illinois Emergency Management Agency (IEMA) will be made.\n\nWhile we have planned for an emergency, it is acknowledged that a real emergency will be unexpected and may very well be much different and cannot be ensured to duplicate what may have been planned.  In reality, the situation that develops may not happen in the manner in which it has been planned.  In that event, what may have been planned will serve only as a guideline to follow.\n\nThe Emergency Action Plan for this facility describes certain procedures that are intended to minimize the hazards associated with human health and the environment from fires, explosions, the sudden and unexpected release of chemicals (i.e., Anhydrous Ammonia), tornadoes, bomb threats, or other accident or acts of God which might occur on our premises.\n\nThe primary emergency coordinator for the River Valley Cooperative is Justin Stabler, location manager.  Justin's work and 24-hour emergency response telephone numbers are provided in the Registration Section of this document.  In addition, the following individuals (with associated work and 24-hour emergency response telephone numbers) are to be contacted in order:\n\nJustin Stabler - Location Manager\n24-hour:  309-854-2050\n\nAllan Coppejans, Regional Manager\nWork:"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000118297,
      "SummaryText": "309-944-166\n24-hour:  309-945-2700\n\n\nDESCRIPTION OF THE ANHYDROUS AMMONIA STORAGE/DISTRIBUTION PLANT AND THE REGULATED SUBSTANCE HANDLED AT RIVER VALLEY COOPERATIVE, CAMP GROVE, ILLINOIS:\n\nThis facility is a bulk anhydrous ammonia storage and distribution plant. The anhydrous ammonia that is stored at this facility is distributed to agricultural crop producers in the surrounding area who utilize the anhydrous ammonia for crop nutrient purposes. \n\nThe system consists of two (2) storage tanks with associated piping, valves, liquid pump(s), and other miscellaneous equipment. Throughout the year numerous portable nurse tanks may also be present at this site.  The anhydrous ammonia plant is only operated on a seasonal basis (Spring and Fall). Full-time equivalent employee numbers were computed on that basis. At a maximum, the plant operates a total of three months (1/4 of the year). The FTEs for this company location is five (5).\n\nTHE WORST-CASE AND ALTERNATIVE RELEASE SCENARIOS:\n\nThe worst-case scenario is the failure of the largest storage tank when filled to the greatest amount allowed (85% of capacity), resulting in the release of the total volume in a gaseous (hazardous ammonia vapor cloud) form. According to EPA's RMP*Comp Program (Version 1.06), the distance to the endpoint is 6.9 miles.\n\nThe alternative release scenario involves the transport delivery vehicle pulling away from the intake lines into the storage plant without disconnecting the transfer hoses. The resulting release, according to EPA's RMP*Comp Program has a distance to endpoint of 0.3 miles.\n\nThe system is protected from major releases by internal excess flow valves, check valves, relief valves and manual shut-off valves. The facility also has a nitrogen shut off system installed. The loadout risers used in filling nurse tanks are protected by breakaway couplers designed to immediately stop the flow of ammonia if the line or a hose breaks. All of the main storage tank valves are locked when not"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000118297,
      "SummaryText": "in use.\n\nSince this facility is located in relatively close proximity to the Towns of Camp Grove and Speer provisions have been designed to notify all affected persons. An evacuation plan is in place.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nThis facility complies with EPA's accident prevention rule and all applicable State and local codes and regulations.  The anhydrous ammonia system is designed, installed and maintained in accordance with the most current ANSI/CGA Standard requirements and State laws.\n\nIn addition, the company has specific operating procedures in place intended to minimize the potential for an accidental (and potentially catastrophic) release of anhydrous ammonia.  Finally, River Valley Cooperative has extended to the Wyoming Fire Department and Marshall County LEPC the opportunity to visit this anhydrous ammonia plant, to participate in mock emergency simulation training and to avail themselves of specific anhydrous ammonia health hazard information and training provided by the company.\n\nFIVE -YEAR ACCIDENT HISTORY\n\nRiver Valley Cooperative Camp Grove  has never had an accident in which the general public was involved and where anhydrous ammonia that caused death, injuries, property or environmental damage, evacuations or shelterings in place.  \n\nTHE EMERGENCY RESPONSE PROGRAM:\n\nIn the event of an emergency involving our anhydrous ammonia system, it is the policy of River Valley Cooperative to immediately notify the Wyoming Fire Department, the Marshall County LEPC and the Illinois Emergency Management Agency (IEMA) to request that they respond to the emergency.  In the unlikely event that the Wyoming Fire Department is unable to adequately respond to an emergency at our location, the volunteer fire department with whom Wyoming has a reciprocal agreement will be summoned.  We have discussed this policy with the fire department and the Marshall County LEPC.  Members of the fire department and the LE"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000118297,
      "SummaryText": "PC have inspected our anhydrous ammonia plant.  In addition, copies of photographs taken of our plant have been provided (for reference) to both entities.\n\nThe plan is to minimize those hazards to human health and to the environment that are associated with accidental releases of anhydrous ammonia. Employees working at the bulk storage plant make routine observations prior to and during transfer operations of the anhydrous ammonia from the storage vessel to nurse tanks. In so doing, they are able to detect problems before they arise. This routine inspection identifies any external portion of the system which may be under stress or about to fail. Repairs can be made before they become problematic. Employees are annually trained to recognize hazards associated with storage and handling of anhydrous ammonia. In addition to annual training for employees who have been on the job for a number of years, the company conducts training for new hires. This training includes classroom instruction, on-site training at the plant, and follow-up observation to determine the comprehension and understanding of the new hire. Finally, the company routinely invites local fire department personnel to visit the site. In the event that the local fire department requests assistance in training its employees on anhydrous ammonia, the company cooperates fully in their endeavors."
    }
  ]
}