{
  "FacilityID": 1000074161,
  "FacilityName": "Trenton Agri Products LLC",
  "FacilityStr1": "36638 US Highway 34",
  "FacilityStr2": null,
  "FacilityCity": "Trenton",
  "FacilityState": "NE",
  "FacilityZipCode": "69044",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31087",
  "LEPC": "SWNE LEPC",
  "FacilityLatDecDegs": "40.192494",
  "FacilityLongDecDegs": "-100.974944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.berexco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 142989172,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Trenton Agri Products LLC",
  "OperatorStr1": "36638 US Highway 34",
  "OperatorStr2": null,
  "OperatorCity": "Trenton",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "69044",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ralph Scott",
  "RMPTitle": "Plant Manager",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185649",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-08 00:00:00",
  "SafetyInspectionBy": "FRA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Ammonia and Denaturant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-08-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-12-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-12-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-12-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.19333,
  "FRS_Long": -100.97417,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092442,
      "AltID": "Denaturant",
      "FacilityID": 1000074161,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093704,
          "ProcessID": 1000092442,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115688,
          "ProcessID": 1000092442,
          "ChemicalID": 155,
          "Quantity": 583800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000100827,
              "ProcessChemicalID": 1000115688,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000100828,
              "ProcessChemicalID": 1000115688,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000100829,
              "ProcessChemicalID": 1000115688,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000615688,
          "ProcessID": 1000092442,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000074161,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\nTrenton Agri Products LLC\n\n\n\nTrenton Agri Products LLC (TAP) no longer stores anhydrous ammonia onsite; therefore, is completing this resubmission to remove anhydrous ammonia from the RMP.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES:\n\nTAP has an ongoing commitment to the health and safety of onsite employees and the surrounding community.  This commitment is demonstrated in the resources invested in accident prevention, such as personnel training for the proper operation and maintenance of plant equipment and preventative maintenance programs.\n\n\n\nTAP has emergency response policies in place that are addressed in the facility's Health and Safety Plan; Industrial Storm Water Pollution Prevention Plan; Spill Prevention, Controls, and Countermeasures Plan; Facility Response Plan; and Emergency Action Plan. Most of the listed Plans require a minimum of annual training in order to keep employees educated on emergency response procedures in place at the facility. All new employees are required to undergo training on emergency response procedures prior to initiating responsibilities onsite. TAP also has a contract with a spill contractor to provide additional assistance if a spill occurs that the onsite response equipment cannot handle.\n\n\n\nTAP participated in a Full Scale Exercise with the Southwest Planning, Exercising, and Training Region on August 21, 2010, funded in part by the U.S. DHS, Hitchcock County, and TAP.  The purpose of the exercise was to bring together the hospitals, EMS, fire, law enforcement, public sector and emergency management agencies that would have responsibility in responding to a mass casualty event.  TAP has a final After Action Report detailing the exercise onsite for review by EPA during normal business hours.\n\n\n\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES:\n\nTAP ethanol plant is located in Trenton, Hitchcock County, Nebraska. The facility operates 24 hours per day, 7 days per week"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000074161,
      "SummaryText": " for the purpose of manufacturing fuel grade ethanol from grain. The regulated substance stored at the facility is a flammable mixture - natural gasoline (denaturant).\n\n\n\nWORST CASE AND ALTERNATIVE CASE SCENARIOS:\n\nWorst Case Scenario:\n\n\n\n1. Flammable Mixture (Denaturant): The flammable mixture stored onsite is natural gasoline, typically referred to as denaturant. Natural gasoline is used onsite to denature ethanol prior to shipment offsite. Denaturant is stored in an aboveground steel tank. The located is located in a diked containment structure that contains an impermeable liner with gravel overlay. A worst case MSDS was used to determine RMP applicability. The worst case scenario used is the release of the entire contents of the denaturant tank, causing a vapor cloud explosion. RMP Comp was used to determine the worst case distance to endpoint; the model results were 0.7 mile radius. Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals, etc.) was obtained using Google Earth.  Un-named tributaries to the Republican River and the Republican River are within the worst-case distance to endpoint for denaturant.\n\n\n\nAlternative Scenario:\n\n\n\n1. Flammable Mixture (Denaturant):  The alternate scenario used for the flammable mixture is the release due to a tanker truck loadout spill, causing a vapor cloud fire.   The endpoint used was an over pressurization of 1 PSI, a worst case option.  Denaturant deliveries at the facility typically occur during normal business hours with a facility staff member overseeing unloading operations - therefore a release at the unloading area could be ceased within minutes by manual overrides.  The unloading area also has a catchment basin with underground piping to secondary containment of the tank farm.   For this scenario passive and active mitigation was not considered, as the mitigation strategies currently in place would "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000074161,
      "SummaryText": "not contain a vapor cloud fire.  RMP Comp was used to determine the alternate distance to endpoint, the model results were <0.1 mile radius. Public receptor information was obtained using facility's knowledge of surrounding area.  No environmental receptors are affected by an alternate release of denaturant.  \n\n\n\nSince the facility qualifies as a Program 3 due to the close proximity of public receptors, Process Safety Management has been completed for this facility.\n\n\n\nGENERAL ACCIDENTIAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\nPlease review the first section of this Executive Summary for the general accidental release prevention program information.\n\n\n\nTAP's maintenance department performs regular preventative maintenance inspections, as required by the manufacturer's recommendations and/or State and Federal regulations. Monthly visual inspections are performed and quarterly leak detection monitoring is performed and reported per NDEQ requirements.\n\n\n\nFIVE YEAR ACCIDENT HISTORY:\n\nOn April 17, 2017, TAP experienced a denaturant (natural gasoline) spill due to a valve being left open on the blending skid. The denaturant seeped into the ground which was excavated and disposed of. The spill did not result in injuries to any person nor the environment; therefore, did not include in the 5-year accident history. It is noted here for informational purposes. \n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\nTAP has several safety programs in place at the facility that incorporate emergency response, including a Health and Safety Plan and Facility Response Plan. TAP has evacuation and response procedures for fires, explosions, spills, etc. outlined in the facility's Emergency Action Plan. The Plans listed as part of this Executive Summary have been prepared in accordance with the applicable regulations, as necessary.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nTAP provides safety training to its employees and contractors on an annual basis. Any changes to improve safet"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000074161,
      "SummaryText": "y will be implemented immediately upon discovery of needed changes.\n\n"
    }
  ]
}