{
  "FacilityID": 1000033263,
  "FacilityName": "BASF",
  "FacilityStr1": "1725 Dayton Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Ames",
  "FacilityState": "IA",
  "FacilityZipCode": "50010",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19169",
  "LEPC": "Story County LEPC",
  "FacilityLatDecDegs": "42.040204",
  "FacilityLongDecDegs": "-093.583221",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "ST",
  "FacilityURL": "www.basf.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 66186107,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BASF",
  "OperatorStr1": "1725 Dayton Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Ames",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50010",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lee Gudith",
  "RMPTitle": "Production Manager",
  "FTE": 46,
  "OtherEPAFacilityID": "1916900160",
  "EPAFacilityID": "100000203585",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-07-11 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-12-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-03-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-03-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-11-27 00:00:00",
  "DeRegistrationEffectiveDate": "2018-11-27 00:00:00",
  "AnniversaryDate": "2018-03-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040596,
      "AltID": "anhydrous Ammonia",
      "FacilityID": 1000033263,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000040998,
          "ProcessID": 1000040596,
          "NAICSCode": "32551",
          "_desc": {
            "NAICS_CODE": "32551",
            "NAICS_DESCRIPTION": "Paint and Coating Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048805,
          "ProcessID": 1000040596,
          "ChemicalID": 57,
          "Quantity": 70556.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000548805,
          "ProcessID": 1000040596,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033263,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\n\n\nColorbiotics recognizes that with ammonium hydroxide use there are necessary safety precautions in order to protect the safety of their employees and of the nearby community.  It is Colorbiotics' policy to design and operate a safe facility.  The system is overdesigned for the type of material, designed for more stringent anhydrous ammonia standards, making equipment failure less likely. In terms of operations, all personnel that interact with the ammonium hydroxide system are trained in the proper operation and maintenance procedures, including the ammonium hydroxide delivery drivers.\n\n\n\nThe emergency plan includes procedures for notification of local authorities to carry out an emergency response. Employees are trained to handle minor leaks and how to determine if the local fire department (911) needs to be called for emergency response. The local fire department personnel have been trained at the Colorbiotics facility on the dangers of ammonium hydroxide and the procedures to follow if there were an ammonium hydroxide release.\n\n\n\n\n\nSource and Regulated Substance\n\n\n\nAmmonium hydroxide is the only regulated chemical that is on-site above the risk management program thresholds. Ammonium hydroxide is an aqueous solution of ammonia and Colorbiotics uses a 29% solution. Colorbiotics uses ammonium hydroxide for the processing of liquid dyes through dispersion. Under normal temperature and pressure conditions, ammonium hydroxide is a pressurized liquid. The Colorbiotics handling system for the ammonium hydroxide includes a horizontal storage tank with appropriate fittings/valves, an ammonium hydroxide pump, and associated piping/valves to transfer ammonium hydroxide to the process.  \n\n\n\nMajor equipment in the ammonium hydroxide process includes a 9,400 gallon storage tank, pump, and distribution piping.  The maximum intended inventory of ammonium hydroxide is 9,400 gallons (approximately 70,500 pounds). \n\n\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033263,
      "SummaryText": "\n\n\nAdministrative Controls and Mitigation Measures\n\n\n\nColorbiotics has policies and procedures in place to decrease the likelihood an ammonium hydroxide release event and to minimize the consequences if there is a release. Some of the following controls and mitigation measures are in place:\n\n\n\n1. System is overdesigned for ammonium hydroxide, minimizing risk of equipment failure.\n\n2. Operators and contractors that need to interact with the ammonium hydroxide system are trained in the proper usage, maintenance, and handling.\n\n3. A containment area surrounds the storage tank, capable of holding all of the tank contents and minimizing offsite impacts.\n\n4. Locks are placed to ensure that valves stay in needed positions to keep the entire ammonium hydroxide system intact.\n\n\n\n\n\nGeneral Release Prevention Program and Prevention Steps\n\n\n\nThe prevention program for ammonium hydroxide fulfills EPA's Program Level 2 requirements. A brief description of each step in the prevention program follows.\n\n\n\n1.The safety information for ammonium hydroxide is considered throughout various aspects of the process, from design to operational procedures. The maximum intended inventory is 9,400 gallons and even though the system is designed to hold up to a maximum pressure of 250 psi, the safety relief valve is set at 25 psi.\n\n\n\n2.A structured hazard review process is used that incorporates the safety information and a multitude of potential scenarios that could result in injuries or environmental impacts. This structured process is conducted a minimum of every five years and any action items resulting from the hazard review are fully documented.\n\n\n\n3.Operating procedures also incorporate relevant safety information and are designed to minimize risk of potential injury or release when executed properly. Where possible, consequence of deviations and steps to avoid deviations are outlined in each procedure.\n\n\n\n4.Training is achieved through on-the-job training, training on specific procedures,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033263,
      "SummaryText": " in addition to external supplier training at least every three years for all employees that interact with the ammonium hydroxide system.\n\n\n\n5.Maintenance procedures follow recommendations from the equipment manufacturers. A site-specific inspection sheet was developed in consultation with the ammonium hydroxide supplier to ensure that all parts of the ammonium hydroxide system are properly inspected for integrity.\n\n\n\n6.Compliance audits are conducted every three years to minimize the risk of an ammonium hydroxide release by ensuring the prevention program follows the guidelines outlined by EPA. Action items resulting from the compliance audit are fully documented.\n\n\n\n7.There are no incidents associated with the ammonium hydroxide system at Colorbiotics, but a process is in place to ensure prompt investigation and follow-up in the event of an incident.\n\n\n\n\n\nFive Year Accident History\n\n\n\nColorbiotics has not experienced any releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\n\n\n\n\nEmergency Response Program\n\n\n\nThe emergency response plan for the Colorbiotics ammonium hydroxide storage tank utilizes the resources of company personnel in concert with the local emergency response coordinator and the local fire and police departments. The emergency action plan has been coordinated with the local emergency planning committee and mechanisms are in place to contact the local fire department in case of an emergency.\n\n\n\nIn the event of a release, trained plant personnel will be dispatched to the source to evaluate the situation and to request the desired emergency response personnel.  Once the initial review has been completed, mitigation activities will be taken to reduce the impact of the release and abatement activities will be commenced to prevent additional release.\n\n\n\nOccupied buildings in the immediate vici"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033263,
      "SummaryText": "nity have been identified and listed such that a coordinated evacuation effort can be conducted with the assurance that all known areas have been checked.\n\n\n\nThe local emergency response personnel will be available to initiate a controlled evacuation plan dictated by wind direction.  Based on the quantity of material that may be released, different areas of evacuation are anticipated.  A minor release may not require evacuations, while a complete release of the entire tank contents may require the evacuation of all facilities (based on wind direct) within 1.5 miles of the facility and affect potential population of 2,418 people.\n\n\n\nA stepped approach is as follows:\n\n\n\n1. Initiate response\n\n2. Evaluate the situation\n\n3. Summon response personnel\n\n4. Initiate initial mitigation\n\n5. Initiate initial abatement\n\n7. Continue mitigation and abatement as necessary to return area to safe conditions.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nColorbiotics has no planned changes for the ammonium hydroxide system.  \n\n"
    }
  ]
}