{
  "FacilityID": 1000003677,
  "FacilityName": "Port Isabel Water Treatment Plant",
  "FacilityStr1": "247 Woody Lane Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Port Isabel",
  "FacilityState": "TX",
  "FacilityZipCode": "78578",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48061",
  "LEPC": null,
  "FacilityLatDecDegs": "26.063290",
  "FacilityLongDecDegs": "-097.221077",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Laguna Madre Water District",
  "Company2Name": null,
  "CompanyDUNS": 47662788,
  "Company2DUNS": 0,
  "OperatorName": "Laguna Madre Water District",
  "OperatorStr1": "105 Port Road",
  "OperatorStr2": null,
  "OperatorCity": "Port Isabel",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78578",
  "OperatorZipCodeExt": null,
  "RMPContact": "Arturo Martinez",
  "RMPTitle": "Director of Operations",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000061256",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-12 00:00:00",
  "SafetyInspectionBy": "Internal Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 26.07167,
  "FRS_Long": -97.16472,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000004541,
      "AltID": "Chlorine Room",
      "FacilityID": 1000003677,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000004733,
          "ProcessID": 1000004541,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000005125,
          "ProcessID": 1000004541,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000505125,
          "ProcessID": 1000004541,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000003677,
      "SummaryText": "Port Isabel Water Treatment Plant\nGeneral Executive Summary \n\n1.    Accidental Release Prevention and Emergency Response Policies\nWe at Port Isabel Water Treatment Plant are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n2.    The Stationary Source and the Regulated Substances Handled\nOur facility's primary activities encompass surface water treatment.  We have one (1) regulated substance present at our facility.  These substance include Chlorine.  Chlorine is used for Disinfection.\n\nThe maximum inventory of Chlorine at our facility is 4,000.00 lb..\n\n3.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with TCEQ Chapter 290 - Rules and Regulations for Public Water Systems .  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\nProcess Safety Information\nPort Isabel Water Treatment Plant maintains a record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nOperating Procedures\nFor the purposes of safely conducting activities within our covered processes, Port Isabel Water Treatment Plant maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and s"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000003677,
      "SummaryText": "tartup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\nPort Isabel Water Treatment Plant has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  \n\nMaintenance\nPort Isabel Water Treatment Plant carries out documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; ton containers, piping systems, relief and vent systems, and controls.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nCompliance Audits\nPort Isabel Water Treatment Plant conducts audits to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was conducted on 06/19/2007.  Corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\nIncident Investigation\nPort Isabel Water Treatment Plant promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n4.    Five-year Accident History\nPort Isabel Water Treatment Plant has had an excellent record of preventing accidental releases over the last 5 years.  There has been no accidental release during this period.\n\n5.    Emergency Response Plan\nPort Isabel Water Treatment Plant employees will not respond to releases of regulated substances.  This facility is included in the community emergency response plan.  This facility carries"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000003677,
      "SummaryText": " a written emergency response action plan to minimize the duration and effects of an accidental release of hazardous materials.  The employees will take actions only on incidental responses such as small chlorine leaks.  \n                                                                                                                                                                                     Our employees are aware of the limits of an incidental response and have been trained on the proper steps to follow for emergency notification and employee evacuation procedures in case of a release of a regulated substance.  Appropriate procedures are in place to notify emergency responders such as the Local Fire Department who will then notify the Cameron County LEPC.  The Fire Department Emergency Response Plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.\n\n6.    Planned Changes to Improve Safety\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Further training on a more continuous basis will be provided to the plant operators."
    }
  ]
}