{
  "FacilityID": 1000099765,
  "FacilityName": "Fritz Products, Inc",
  "FacilityStr1": "255 Marion Street",
  "FacilityStr2": null,
  "FacilityCity": "River Rouge",
  "FacilityState": "MI",
  "FacilityZipCode": "48218",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26163",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "42.273650",
  "FacilityLongDecDegs": "-083.120890",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 161887930,
  "ParentCompanyName": "Fritz Enterprises, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Randy Fritz",
  "OperatorStr1": "1650 W. Jefferson",
  "OperatorStr2": null,
  "OperatorCity": "Trenton",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48183",
  "OperatorZipCodeExt": "5294",
  "RMPContact": "Jon Jarret",
  "RMPTitle": "Plant Manager",
  "FTE": 30,
  "OtherEPAFacilityID": "MI0000895078",
  "EPAFacilityID": "100000135953",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-12-13 00:00:00",
  "SafetyInspectionBy": "Ameritrust",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-02-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2022-02-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-02-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 42.27625,
  "FRS_Long": -83.12426,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000123378,
      "AltID": "Chlorine Tanks",
      "FacilityID": 1000099765,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000124771,
          "ProcessID": 1000123378,
          "NAICSCode": "331314",
          "_desc": {
            "NAICS_CODE": "331314",
            "NAICS_DESCRIPTION": "Secondary Smelting and Alloying of Aluminum"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000154202,
          "ProcessID": 1000123378,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000654202,
          "ProcessID": 1000123378,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000099765,
      "SummaryText": "1.0    EXECUTIVE SUMMARY\n\n1.1    APPLICABILITY\n\nAn owner or operator of a stationary source that has more than a threshold quantity of a regulated substance in a \"process\" shall prepare a U.S. Environmental Protection Agency (U.S. EPA) Risk Management Plan (RMP) in accordance with 40 CFR 68. The threshold quantities for chlorine under 40 CFR 68 is 2,500 pounds (lb.).  In accordance with RMP requirements a process means any activity involving a highly hazardous chemical including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  For purposes of this definition, any group of vessels which are interconnected and separate vessels which are located such that a highly hazardous chemical could be involved in a potential release, shall be considered a single process.  Since Fritz Products, Inc. (Fritz Products) River Rouge facility stores and uses chlorine in quantities exceeding the RMP and PSM thresholds they are required to meet RMP requirements.  The facility's storage and use areas are approximately 75 feet apart and are considered a single \"process\".\n\n\n\nBecause of similar elements between the RMP and OSHA's Process Safety Management (PSM) Plan, Fritz Products, Inc. has integrate their PSM and RMP into one plan. \n\n\n\n1.2    COMPANY POLICY\n\nFritz Products recognizes the intrinsic value for the well-being of the employees and customers of their River Rouge, Michigan aluminum facility, and considers that their safety is a primary objective.\n\n\n\nThe facility has a safety program committed to: developing safe work practices and procedures to maintain property and equipment in a safe condition; providing training to its employees to enable them to work without accident; and ensuring that all employees comply with all safety rules, regulations, practices and procedures. All aspects of the safety program will be administered with fairness and consistency.\n\n\n\nThe Plant Manager is accountable and responsible for, and "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000099765,
      "SummaryText": "actively supports and participates in the program, including communication of, understanding and compliance with, and monitoring of safety performance.\n\n\n\n1.3    STATIONARY SOURCE INFORMATION\n\nFritz Products River Rouge facility is a secondary aluminum foundry employing approximately 32 employees in River Rouge, Michigan. The facility uses chlorine for de-magging purposes and the Site stores a maximum of 16 pressurized storage cylinders, each with a capacity of one ton of chlorine.  The facility is located on the east side of River Rouge, with the Detroit River to the East, industrial areas to the North and South, and residential areas to the West.  \n\n\n\n1.4    SCENARIOS AND CONTROLS\n\nThe Risk Management Plan addresses the potential off-Site impacts from a catastrophic release of chlorine. Two scenarios are considered in this plan. The first scenario considered is a full release of the chlorine from one 2000-lb. vessel of chlorine over a 10-minute time period.  The release is assumed to occur outside the building during a chlorine delivery, maximizing the impact of the release.  The second scenario considered is the more likely release scenario of a leak resulting from the rupture of piping, resulting in an indoor release of 16 lb. over a 60-second time period.\n\n\n\n1.5    ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nFritz Products River Rouge facility has developed a Process Safety Management Plan and work procedures and controls to ensure that an accidental release of chlorine does not occur at the facility.  The employees have been trained to ensure familiarity with these processes and procedures, and written procedures can be referred to. Periodic and refresher training is also conducted to review these procedures and any new procedures that may be developed and implemented. These procedures are also reviewed with contractors working with the chlorine system.   Fritz Products only allows vendors with specialized chlorine system training and are familiar with the chlorine system a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000099765,
      "SummaryText": "nd health and safety procedures to perform work on the system.\n\n\n\n1.6    FIVE-YEAR ACCIDENT HISTORY\n\nFritz Products has not experienced a release of chlorine at the River Rouge facility in the 5 years preceding the preparation and submittal of this Risk Management Plan Fritz Products will respond appropriately as outlined in our Emergency Response Plan in the event of a chlorine release from the process.  In addition, the implementation of this Risk Management Plan/Process Safety Management Plan will help minimize the chance that a release of chlorine does not occur from this process.\n\n\n\n1.7    EMERGENCY RESPONSE PROGRAM\n\nFritz Products has prepared an Emergency Response Plan that is designed for timely, safe and efficient response actions to minimize hazards to human health and safety, the environment, and property in situations involving releases of chlorine from the covered processes at the facility.  This plan is reviewed periodically to ensure that the information is accurate.  Local response authorities have been provided with a copy of the plan in the event that they would be required to respond to an emergency at the facility.\n\n\n\n1.8    SAFETY IMPROVEMENTS \n\nThe PHA Conducted in 2012 identified the following two recommendations:\n\n\n\n?       Evaluate the installation of a chlorine monitor near the outdoor container storage area.\n\n?    Evaluate changing PRV discharge orientation from downward to upward. \n\n\n\nA chlorine monitor was installed near the outdoor full cylinder storage area in 2012.  Based on further evaluation, the PRV discharge orientation was not changed since it was determined that and upward discharge would not improve overall safety.\n\n\n\nNo additional safety improvements were identified during the PHA revalidation conducted August 16, 2016.\n\n\n\nThe PHA revalidation conducted on February 16, 2022 identified the following four recommendations:\n\n        Consider extending the evaporator pressure relief outlet line to at least 10 ft above ground and/or redirect th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000099765,
      "SummaryText": "e outlet to the side or upwards (away from a person \n\n        standing at that location) versus in a downward direction.\n\n        Generate an area electrical classification for the covered process areas.\n\n        Ensure the PHA is revalidated at least every 5 years from the date of the previous revalidation.\n\n        Ensure the compliance audit is completed within 3 years from the date of the previous audit.\n\n "
    }
  ]
}