{
  "FacilityID": 1000083002,
  "FacilityName": "JBS",
  "FacilityStr1": "15555 Meridian Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Riverside",
  "FacilityState": "CA",
  "FacilityZipCode": "92518",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.898495",
  "FacilityLongDecDegs": "-117.284943",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Phillip Munoz",
  "OperatorStr1": "15555 Meridian Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Riverside",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92518",
  "OperatorZipCodeExt": null,
  "RMPContact": "Phillip Munoz",
  "RMPTitle": "Safety Manager/EHS",
  "FTE": 260,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000202988",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-11-18 00:00:00",
  "SafetyInspectionBy": "Countyof Riverside Dept of Environmental Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-10-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-10-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-10-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-10-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103709,
      "AltID": null,
      "FacilityID": 1000083002,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000105022,
          "ProcessID": 1000103709,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 1000105023,
          "ProcessID": 1000103709,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000105024,
          "ProcessID": 1000103709,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129831,
          "ProcessID": 1000103709,
          "ChemicalID": 56,
          "Quantity": 16280.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629831,
          "ProcessID": 1000103709,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083002,
      "SummaryText": "This Executive Summary contains JBS's administrative and operational programs to prevent ammonia-related accidents and reduce potential risks.  The regulated substance of concern and focus of this document is anhydrous ammonia.  The following topics are addressed in this Executive Summary:\n\n\n\n- Accidental Release Prevention and Emergency Response Policies\n\n- Stationary Source and Regulated Substance\n\n- Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n- Emergency Response Plan\n\n- Five Year Accident History\n\n- Planned Changes to Improve Safety\n\n- Data Elements\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nJBS is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process solution equipment at the facility. \n\n\n\nJBS' senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. JBS's safety and environmental policies as they relate to the ammonia refrigeration system are administered by the EHS Manager, who conducts inspections of the facility to ensure compliance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe system at 15555 Meridian Parkway in Riverside, California was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Mechanical Code, the Uniform Building Code, the Electrical Code, the California Fire Code, and the Uniform Fire Code at the time of construction.  The facility was constructed in 2008.  \n\n\n\nThe ammonia refrigeration system is a closed system that cycles the refrigerant from liquid to gas and back again.  The system, consisting of vessels, piping, valves, and process equipment, cycles"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083002,
      "SummaryText": " 16,280 pounds of ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for dock operations, cooler and freezer storage.  The majority of the system is located in the engine room including vessels and compressors.  The condensers are mounted on the roof, and the evaporators are located in their respective cold areas.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe JBS ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Cal/OSHA's Process Safety Management regulation.  A refrigeration contractor performs all routine and preventative maintenance on the system.\n\n\n\nThe facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors in the engine room as well as sensors near the evaporators, and automatic shut down systems.  In addition, the majority of the ammonia is maintained inside the engine room and just outside of the engine room (condensers).  All pressure vessels are equipped with pressure relief valves that are commonly piped to the water diffusion tank.\n\n\n\nIn addition to the Uniform Mechanical Code, JBS has developed a preventive maintenance program to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.\n\n\n\nEMERGENCY RESPONSE PLAN\n\n\n\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \n\n\n\n?    save lives;\n\n?    minimize and avoid injuries;\n\n?    protect the env"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083002,
      "SummaryText": "ironment; and\n\n?    minimize property damage.\n\n\n\nThe Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM/RMP/CalARP regulations.  Facility personnel receive annual training regarding the emergency procedures.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe EPA's RMP Program defines \"accident\" as the following:\n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nBased on the above definition and an investigation into the facility's accident history, there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (October 2013 - October 2018). In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazards Analysis, including a Hazard and Operability (HAZOP) study and a Facility Inspection, provided mitigation measures to improve safety at the JBSy facility located at 15555 Meridian Parkway in Riverside, California.  The initial Process Hazard Analysis was performed on April 28, 2008, a PHA Addendum was conducted on February 19, 2009, to cover an expansion in 2009, and the PHA Revalidation was performed in October 2018.  An addendum was completed on 9/11/2015.  The JBS safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n\n\n1. C"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083002,
      "SummaryText": "ontinue to train all employees in the facility safety plan/programs.\n\n2. Continue to have employee involvement in safety plan development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n\n\nDATA ELEMENT NOTES\n\n\n\nItem numbers 7.11a, and 7.11b, and 7.15 have been intentionally left blank. These items (Incident Investigation, Contractor Safety, etc.) have been developed for JBS and will be implemented when required.  In addition, the Emergency Action Plan outlines notification procedures and reporting procedures in the event of an emergency, which could include fire, ammonia release, blackout, and earthquake. \n\n"
    }
  ]
}