{
  "FacilityID": 1000036704,
  "FacilityName": "SYSCO Ventura, Inc.",
  "FacilityStr1": "3100 Sturgis Road",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93030",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.199925",
  "FacilityLongDecDegs": "-119.132332",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sysco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "SYSCO Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "SYSCO Ventura, Inc",
  "OperatorStr1": "3100 Sturgis Road",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93030",
  "OperatorZipCodeExt": null,
  "FTE": 277,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185587",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-08-29 00:00:00",
  "SafetyInspectionBy": "Oxnard Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Ammonia Refrigeration System",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-10-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-10-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-10-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-10-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.20188,
  "FRS_Long": -119.13161,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044976,
      "AltID": null,
      "FacilityID": 1000036704,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054337,
          "ProcessID": 1000044976,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000045374,
          "ProcessID": 1000044976,
          "NAICSCode": "42441",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000039140,
              "Process_NAICS_ID": 1000045374,
              "SafetyReviewDate": "2013-08-22 00:00:00",
              "PHA_Date": "2009-01-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-10-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Enhance maintenance program for ammonia piping, vessel, and insulation",
              "OpProceduresReviewDate": "2013-08-22 00:00:00",
              "TrainingReviewDate": "2013-08-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Powerpoint",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-08-22 00:00:00",
              "EquipmentInspectionDate": "2013-10-08 00:00:00",
              "EquipmentTested": "Daily System Walkthrough",
              "ChangeMgmtDate": "2004-03-29 00:00:00",
              "ChangeMgmtReviewDate": "2013-08-22 00:00:00",
              "PreStartupReviewDate": "2004-03-29 00:00:00",
              "ComplianceAuditDate": "2013-08-22 00:00:00",
              "AuditCompletionDate": "2014-08-22 00:00:00",
              "IncidentInvestigationDate": "2010-02-20 00:00:00",
              "InvestigationChangeDate": "2010-03-30 00:00:00",
              "ParticipationPlansReviewDate": "2013-08-22 00:00:00",
              "HotWorkPermitReviewDate": "2013-08-22 00:00:00",
              "ContractorSafetyReviewDate": "2008-09-10 00:00:00",
              "ContractorSafetyEvalDate": "2013-08-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000046504,
                  "PreventionProgram3ID": 1000039140,
                  "ProcessChemicalID": 1000054337
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036704,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Oxnard Fire Department",
    "CoordinatingAgencyPhone": "8053857657",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036704,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nWe at Sysco Ventura, Inc. are strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process equipment at the facility.  \r\n\r\nSysco Ventura, Inc. senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. Sysco Ventura, Inc.'s safety and environmental policies as they relate to the ammonia refrigeration system are administered by the Risk Manager and Fleet & Facility Manager, who conduct periodic inspections of the facility to ensure compliance, and oversees the entire safety and environmental programs, including the California Accidental Release Prevention Program, OSHA Process Safety Management, and EPA Risk Management Program (CalARP/PSM/RMP).  It is our policy to implement appropriate control measures to prevent possible releases of regulated substances.  Unforeseeable, if such a release does occur; the facility will implement the Emergency Action Plan and contact appropriate authorities and highly trained refrigeration contractors and safely evacuate the facility.  The facility coordinates the emergency evacuation drill with the Oxnard Fire Department on an annual basis.\r\n\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe Sysco Ventura, Inc. facility is located at 3100 Sturgis Road in Oxnard, California, which is located approximately 1.3 miles east of Pacific Coast Highway and approximately 1.4 miles south of Highway 101.  The area immediately surrounding the facility is rural.  The entire facility was constructed and operated in 2003.  The area immediately surrounding the facility is mostly commercial and industrial.\r\n\r\nThe primary bu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036704,
      "SummaryText": "siness of the Sysco Ventura, Inc. facility is to provide refrigerated warehousing and storage for various food products.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 12,000 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration.  Typical operating conditions range from 0 - 2 psig on the low pressure side of the system to 160 - 185 psig on the high side of the system.  \r\n\r\nThe system at was constructed in accordance with all applicable federal, state, and local regulations including ANSI/IIAR 2 - 1999  American National Standard for Equipment, Design and Installation of Ammonia Mechanical Refrigeration Systems, ASHRAE 15 - 1992  Safety Standard for Mechanical Refrigeration, ANSI/NFPA 70-1993 National Electrical Code, 1997 Uniform Mechanical Code, 1997 Uniform Fire Code, 2001 ASME/ANSI B31.5 ASME Code for Pressure Piping,  ANSI/ASHRAE Standard 34 Designation and Safety Classification of Refrigerants, and ANSI/CGGS G2.1-1989 Safety Requirements for the Storage and Handling of Anhydrous Ammonia in place at the time of construction.  \r\n\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\r\n\r\n- OSHA's Process Safety Management (PSM);\r\n- EPA's Risk Management Program (RMP); and\r\n- California Accidental Release Prevention Program (CalARP).  \r\n\r\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on site workers.  The following summarizes the key compliance programs that have been implemented by Sysco Ventura, Inc. to prevent the accidental release"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036704,
      "SummaryText": "of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner and receive hazard communication training as well as emergency evacuation procedures.  It also ensures the contractor receives proper training to operate and maintain the refrigeration system.  Qualified personnel receive basic classroom training in process operations, followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided at least annually or more frequently as needed The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards. The system is visually inspected by trained and authorized in-house personnel on a daily basis.  All other system maintenance is conducted by the refrigeration contractor.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Hot Work Permit program ensures that Sysco Ventura, Inc.' employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.  The Compliance Audit program ensures that the facility is reviewing the written PSM/RMP/CalARP to determine how well the facility is implementing it.  These audits are conducted at least every three years and any corrective actions (recommendations/findings) are completed in a safe and timely manner.  As part of the Incident Investigation program the facility properly and promptly investigate"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036704,
      "SummaryText": "and document any ammonia releases or \"near miss\" incidents.  These investigations are conducted to identify the situation leading to the incident, as well as any corrective actions to prevent the incident from recurring.\r\n\r\nSysco Ventura, Inc. believes that process safety management and accident prevention require a team effort.  The facility and contractor employees are strongly urged to express their views concerning accident prevention issues and to recommend improvements.  In addition, the facility employees and contractors have access to all information resulting from the Process Hazard Analysis, Hazard Assessment, Seismic Assessment, Incident Investigation reports, Compliance Audit studies, to a name a few.\r\n\r\nIt is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  The facility has also installed ammonia sensors at strategic locations throughout the facility.  \r\n\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThe EPA's RMP Program defines \"accident\" as the following:\r\n\r\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\r\n\r\nThe release must have caused at least one of the following:\r\n\r\n- On-site deaths, injuries, or significant property damage (§68.42(a)); or\r\n- Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\"\r\n\r\nBased on the above definition, there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (October 2008 to October 2013"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036704,
      "SummaryText": "). In addition, there have been no injuries or property damage resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation.  The facility conducted an internal incident investigation on February 20, 2010.  An incident investigation report was written for a false alarm incident which was categorized by the facility as a \"near miss\".  There was no ammonia released.\r\n\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \r\n\r\n- save lives;\r\n- minimize and avoid injuries;\r\n- protect the environment; and\r\n- minimize property damage.\r\n\r\nSince facility personnel will not respond to an ammonia release at the facility that poses a health or safety threat, the Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM, RMP, and CalARP regulations.  Facility personnel receive annual training regarding the emergency procedures.  The facility coordinates the emergency evacuation with the local Oxnard Fire Department on an annual basis.\r\n\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Process Hazard Analysis Revalidation was conducted on January 5 & 6, 2009, included a What-if/Checklist study and a facility inspection to satisfy the five year update requirements.  \r\n\r\nThe Process Hazard Analysis Revalidation generated mitigation measures (recommendations to improve safety at the Sysco Ventura, Inc. facility located in Oxnard, California.  The Sysco Ventura, Inc. safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\r\n\r\n1. Continue to train all employees in the facility Safety Plan/Programs.\r\n\r\n2. Cont"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000036704,
      "SummaryText": "inue to have employee involvement in Safety Plan Development.\r\n\r\n3. Continue employee involvement through safety team participation.\r\n\r\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}