{
  "FacilityID": 1000050868,
  "FacilityName": "Foster Farms Porterville (8-15)",
  "FacilityStr1": "770 North Plano Street",
  "FacilityStr2": null,
  "FacilityCity": "Porterville",
  "FacilityState": "CA",
  "FacilityZipCode": "93257",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.0796",
  "FacilityLongDecDegs": "-119.0072",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Foster Farms",
  "Company2Name": null,
  "CompanyDUNS": 607802147,
  "Company2DUNS": 607802147,
  "OperatorName": "Foster Farms Porterville",
  "OperatorStr1": "770 North Plano Street",
  "OperatorStr2": null,
  "OperatorCity": "Porterville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93257",
  "OperatorZipCodeExt": null,
  "FTE": 413,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161406",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-10-19 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-07-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-07-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-07-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-07-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.0796,
  "FRS_Long": -119.00866,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064163,
      "AltID": "Ammonia refrigeration",
      "FacilityID": 1000050868,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000079367,
          "ProcessID": 1000064163,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000065284,
          "ProcessID": 1000064163,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000053255,
              "Process_NAICS_ID": 1000065284,
              "SafetyReviewDate": "2015-07-14 00:00:00",
              "PHA_Date": "2017-07-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-07-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Fire diffusion system, pressure relief header connected to water filled tanks and ammonia detection system connected to close king solenoid valve",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Fire diffusion system, pressure relief header connected to water filled tanks and ammonia detection system connected to close king solenoid valve",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Line #3 Sauce Chiller added",
              "OpProceduresReviewDate": "2015-03-31 00:00:00",
              "TrainingReviewDate": "2015-01-02 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-07-09 00:00:00",
              "EquipmentInspectionDate": "2015-07-30 00:00:00",
              "EquipmentTested": "Compressors",
              "ChangeMgmtDate": "2015-07-07 00:00:00",
              "ChangeMgmtReviewDate": "2015-01-02 00:00:00",
              "PreStartupReviewDate": "2015-04-03 00:00:00",
              "ComplianceAuditDate": "2013-03-19 00:00:00",
              "AuditCompletionDate": "2015-03-19 00:00:00",
              "IncidentInvestigationDate": "2015-06-02 00:00:00",
              "InvestigationChangeDate": "2015-06-03 00:00:00",
              "ParticipationPlansReviewDate": "2015-01-02 00:00:00",
              "HotWorkPermitReviewDate": "2015-01-02 00:00:00",
              "ContractorSafetyReviewDate": "2015-06-03 00:00:00",
              "ContractorSafetyEvalDate": "2015-01-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000065479,
                  "PreventionProgram3ID": 1000053255,
                  "ProcessChemicalID": 1000079367
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050868,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-01-02 00:00:00",
    "ERTrainingDate": "2015-04-16 00:00:00",
    "CoordinatingAgencyName": "Porterville Fire Department",
    "CoordinatingAgencyPhone": "5597827526",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050868,
      "SummaryText": "igeration system, which is designed as a closed system, contains approximately 40,000 pounds (lbs) of anhydrous ammonia. The system provides cooling for production areas, raw materials storage, product storage and chilled water (brine solutions). A central computer system monitors and controls the refrigeration system. The desired temperatures are maintained by controlling the flow of ammonia with manually and electrically operated valves, float switches, circulating pumps, and compressor controls. \r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe RMP/PSM regulations require a review of the accidental release prevention program and chemical specific prevention steps used by the facility. Foster Farms has incorporated many safety features in the ammonia refrigeration system to prevent system failures and to mitigate potential releases. \r\n\r\nThe predominant safety concern with closed-loop ammonia systems is an inadvertent buildup of pressure exceeding pressure ratings or capacities of equipment due to ammonia expansion. The Foster Farms ammonia system is continuously monitored by automated control systems that will shutdown components if deviations from normal operating conditions occur. The major pressure vessels in the system are connected to a diffusion panel. Ammonia from the vessels can be mixed with water (neutralized) in diffusion tanks and discharged to the sewer system to prevent over-pressurization of the vessels. Further, all pressure vessels in the system are equipped with pressure relief valves (also connected to the diffusion tanks).\r\n\r\nOther safety features at the facility include the following: \r\n¿\tEmergency shutdown systems\r\n¿\tComponent specific safety shutdowns\r\n¿\tSafeties are tested annually\r\n¿\tPressure relief valves on all vessels, compressors, and several other areas in the system where trapped ammonia could build pressure.\r\n¿\tPressure relief valves are vented to a common header connected to the water d"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050868,
      "SummaryText": "iffusion tank system, designed to mix vented ammonia with water for safe disposal to the municipal sewer. \r\n¿\tVessels are connected to a fire diffusion panel, which allows manual routing of ammonia vapor to the water diffusion tank system in the event of a fire.\r\n¿\tAmmonia pipes, valves and components are labeled.\r\n¿\tPressure relief valves are replaced at least every 5 years.\r\n¿\tA fire sprinkler and alarm system are installed in the plant.\r\n¿\tA central computer system monitors the refrigeration system and alarms when safety set-points are exceeded.\r\n¿\tAn ammonia leak detection system which provides early warning alarms for the process areas and can automatically shutdown the refrigeration system if engine room leaks are detected.\r\n¿\tOperators receive ongoing training in operations, maintenance and emergency response.\r\n\r\nIn addition to the physical features of the ammonia refrigeration system at the facility, Foster Farms has implemented extensive administrative controls to maintain safe operation of the system. Administrative controls include, but are not limited to formal training programs for system operators and mechanics, emergency response training, a hot work permit program, a lockout/tagout program, a contractor safety program, incident investigation program, mechanical integrity program, Management of Change (MOC) program, pre startup safety review program, and a RMP/PSM auditing and inspection program. Written standard operating procedures (SOPs) have been prepared for the ammonia system at the facility. The SOPs provide a basis for site specific operator training and a ready reference for operating and trouble-shooting the systems.\r\n\r\nFoster Farms is committed to maintaining the mechanical integrity of the ammonia refrigeration system. A preventive maintenance system has been developed to manage the maintenance of the refrigeration system. Preventive maintenance at the facility includes daily, weekly, and periodic inspection; calibration; testing; and over"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050868,
      "SummaryText": "FOSTER FARMS\r\n                                                      PORTERVILLE COOK PLANT\r\n                                                   RISK MANAGEMENT PROGRAM AND\r\n                                            PROCESS SAFETY MANAGEMENT PROGRAM\r\n\r\n                                          ANHYDROUS AMMONIA REFRIGERATION SYSTEM\r\n\r\n                                                         EXECUTIVE SUMMARY\r\n                                                        Revised August 2015\r\n\r\n\r\n\r\nFoster Poultry Farms (Foster Farms) Porterville Cook Plant (Porterville) revised this document, previously submitted in August 2010, due to an updated process hazard analysis (PHA) and regulatory requirements requiring re-submittal every 5 years. \r\n\r\nFoster Farms Porterville prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations. The state risk management regulations, also referred to as the California Accidental Release Prevention (CalARP) program, are codified in California Code of Regulations (CCR), Title 19, Section 2735.1, et. Seq. The Federal Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances. The federal regulations are codified in Title 40 of the Code of Federal Regulations (CFR), Part 68. Finally, both CalOSHA and Federal OSHA regulate facilities with certain acutely hazardous materials under the Process Safety Management regulations, as defined in CCR Title 8 Section 5189 and CFR Title 29 Part 1910 Section 119, respectively.\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nFoster Farms prepared the RMP/PSM to satisfy regulatory requirements and to demonstrate a commitment to evaluate and improve anhydrous ammonia handling systems and practices at the facility. Many state-of-the-art safety features have been incorporated into the ammonia refrigera"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050868,
      "SummaryText": "haul of ammonia system equipment. The preventive maintenance system is used to track equipment performance and to monitor the frequency of repairs and deviations from normal operating parameters.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\nThe RMP/PSM regulations require a discussion of accidents involving a release of a reportable quantity (RQ) of ammonia that have occurred at the facility within 5 years or that resulted in deaths, injuries, or significant property damage onsite or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage within 5 years of the request for submitting the RMP. Foster Farms knows of no reportable releases at the facility within the required reporting period.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\nFoster Farms has developed a written Emergency Response Plan (ERP) that identifies emergency personnel responsibilities, procedures, evacuation measures and reporting requirements. The Foster Farms ERP is based on an emergency operations organization in which the Incident Commander serves as the chief officer in emergency situations. The Incident Commander will take charge of the emergency response and response team and direct all operations when an emergency is declared and will remain in charge until the emergency is ended. The ERP addresses ammonia specific issues as required by the RMP/PSM standards, including a determination of incidents that constitute an emergency.\r\n\r\nFoster Farms has developed the ERP to assure compliance with RMP/PSM requirements. The Plant Manager will maintain the ERP. Additionally, a copy of the ERP will be kept with the RMP/PSM documentation and at other appropriate locations. Refer to the ERP, for further information regarding emergency planning and response.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nChanges to improve safety at the facility are ongoing and part of Foster Farms' commitment to continuous improvement. A PHA re-validation was recently conducted on the ammonia refrigeration"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000050868,
      "SummaryText": "system to identify further safety improvements. Mitigation measures suggested by the most recent PHA team have already been implemented. Foster Farms is committed to respond to all suggested mitigation measures promptly and is establishing schedules of proposed actions for the ongoing improvement of the system. Management responses and support will be consistent with Foster Farms' commitment to safe and environmentally responsible operations.\r\n\r\nFoster Farms recognizes that the RMP/PSM is a continuous process for evaluating, monitoring, and improving anhydrous ammonia handling operations at its facility. As such, this document and related attachments and program elements will evolve as Foster Farms continues their ongoing focus and dedication of risk minimization and safety improvement for their employees and surrounding community. Foster Farms will submit revised information if a change occurs that is considered significant and requires resubmission under the regulations. However, minor improvements/modifications to the RMP/PSM, related attachments, and program elements will be incorporated consistent with Foster Farms' internal review practices, and Foster Farms will maintain the most current versions onsite. Thus, the most current version RMP/PSM, related documents, and elements maintained onsite may vary slightly from the information in submittals made to EPA and other regulatory agencies."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050868,
      "SummaryText": "tion system at the facility as part of the original system construction and expansion projects. In the unlikely event that a chemical release does occur at the facility, Foster Farms personnel are trained in the appropriate response measures, relying on backup support services provided by the local fire department and/or hazardous materials response team. Foster Farms will continue to improve ammonia-handling safety through the implementation of the prevention program elements of the RMP/PSM regulations.\r\n\r\nSTATIONARY SOURCE AND REGULATED COMPOUNDS HANDLED\r\n\r\nFoster Farms Porterville is located at 770 Plano Street, Porterville, California, approximately 1.5 miles east of Highway 65. The surrounding area consists of residential development and industrial and commercial businesses. The site is bordered by Plano Street to the west, Henderson Avenue to the north, and other industrial businesses to the south and east. The facility is located on the eastern edge of Porterville, thus the area surrounding the facilities consists of a combination of industrial transitioning to rural and sparsely populated rural residential.\r\n\r\nThe facility was originally constructed as a manufacturing site for diapers and related products. Foster Farms purchased the facility in 1998 and converted the facility for processing poultry products. The poultry processing equipment that includes the ammonia refrigeration system was started up during the third quarter of 1999 and the system was expanded in 2005. Production equipment was installed after the storage and processing areas were cooled and prepared to handle the poultry meat/products. Operations at the facility consist of processing, packaging, storage, and shipment of poultry and deli meat products. \r\n\r\nThe facility is surrounded by chain-link fencing and has a secured entrance that is staffed by security personnel 24-hours-per-day, 365-days-per-year.\r\n\r\nAnhydrous ammonia is used in a refrigeration system at the facility. The ammonia refr"
    }
  ]
}