{
  "FacilityID": 1000000475,
  "FacilityName": "Westside Wastewater Treatment Plant",
  "FacilityStr1": "First Avenue and West Schuyler St.",
  "FacilityStr2": null,
  "FacilityCity": "Oswego",
  "FacilityState": "NY",
  "FacilityZipCode": "13126",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36075",
  "LEPC": "Oswego County LEPC",
  "FacilityLatDecDegs": "43.456111",
  "FacilityLongDecDegs": "-076.527778",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.oswegony.org",
  "FacilityEmailAddress": "ghallina@oswegony.org",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Oswego",
  "Company2Name": null,
  "CompanyDUNS": 77308765,
  "Company2DUNS": 77308765,
  "OperatorName": "Gary T Hallinan",
  "OperatorStr1": "2 First Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Oswego",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "13126",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000147469",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-07-01 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-11-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-04-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-04-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-05-12 00:00:00",
  "DeRegistrationEffectiveDate": "2012-08-31 00:00:00",
  "AnniversaryDate": "2014-04-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.323,
  "FRS_Long": -76.42248,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-NEAREST INTERSECTION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000598,
      "AltID": "Chlorine Injection System",
      "FacilityID": 1000000475,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000620,
          "ProcessID": 1000000598,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000000624,
          "ProcessID": 1000000598,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000376,
              "Process_NAICS_ID": 1000000624,
              "SafetyReviewDate": "2012-06-26 00:00:00",
              "PHA_Date": "2012-05-09 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-05-09 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Hourly rounds",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-05-09 00:00:00",
              "TrainingReviewDate": "2012-05-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-06-26 00:00:00",
              "EquipmentInspectionDate": "2012-06-26 00:00:00",
              "EquipmentTested": "alarm system",
              "ChangeMgmtDate": "2003-12-08 00:00:00",
              "ChangeMgmtReviewDate": "2012-06-26 00:00:00",
              "PreStartupReviewDate": "2003-12-08 00:00:00",
              "ComplianceAuditDate": "2012-06-26 00:00:00",
              "AuditCompletionDate": "2012-06-26 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-06-26 00:00:00",
              "HotWorkPermitReviewDate": "2012-06-26 00:00:00",
              "ContractorSafetyReviewDate": "2012-06-26 00:00:00",
              "ContractorSafetyEvalDate": "2012-06-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000000399,
                  "PreventionProgram3ID": 1000000376,
                  "ProcessChemicalID": 1000000620
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000475,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-08-11 00:00:00",
    "ERTrainingDate": "2009-02-19 00:00:00",
    "CoordinatingAgencyName": "Oswego Fire Department",
    "CoordinatingAgencyPhone": "9110000000",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000475,
      "SummaryText": "EXECUTIVE SUMMARY\n\nOn April 27, 2009 the City of Oswego performed the Environmental Protection Agency (EPA) required 5 year review of our Risk Management Program (RMP).  All necessary changes and updates have been completed.  In addition, all Safety and Training Programs have been reviewed.  The City of Oswego will electronically submit this updated Risk Management Plan to the EPA by April 28, 2009.\n\nIn 1999 Watts Engineers was subcontracted by Pratt and Huth Associates, LLP to provide the City of Oswego a Level 3 RMP and a Process Safety Management (PSM) Program in accordance with 40 CFR 68 Risk Management Programs for Chemical Accidental Release Prevention and 29 CFR 1910.119 Process Safety Management for its East Side Wastewater Treatment Plant (WWTP) located at 71 Mercer Street in the City of Oswego, New York.  This evaluation was performed to assure that the facilities chlorine injection system complies with applicable regulations.  Key elements of the Risk Management Plan that were originally provided by Watts Engineers included: a review of the accidental release prevention and emergency response policies; a review of the regulated substance handled; a worst-case and alternative release scenario; a review of the general accidental release program and chemical-specific prevention steps; a review of the five-year accident history; a review of the emergency response program; and participation in meetings and planning changes to improve the Process Safety Program.  \n\nThe Oswego West Side WWTP is located on the West side of the City of Oswego between the Niagara Mohawk Power Station and the old oil refinery.  It employs nine (9) full-time employees.  Activities at the facility include the treatment of sewage, removal of solid waste and the treatment of the water portion with the addition of chlorine gas before returning the water to Lake Ontario.\n\nChlorine is considered a regulated substance under the Risk Management and Process Safety Programs.  Characteristics o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000475,
      "SummaryText": "f this gas or liquid include a pungent suffocating odor.  It is irritating to the mucous membranes.  When chlorine reacts with water, it forms hydrochloric acid.  Hydrochloric acid gas is a toxic and corrosive fume.  The odor threshold for chlorine is about 0.5 ppm.  Long term exposures to small concentrations or short term exposures to high concentrations may result in adverse health effects.  Since chlorine gas is heavier than air, it can settle in low spots along the ground, therefore care should be exercised while working in confined spaces or low lying areas.\n\nThe City of Oswego and senior management at the West Side Wastewater Treatment Plant have a strong commitment to the overall safety of its employees, the public and the environment.  It is the policy of the West Side WWTP to train each employee and contractor about safety considerations and emergency procedures in the unlikely event of a discharge.  A maximum of six thousand (6,000) pounds of chlorine gas in three (3) tanks are either in use or stored at one time at the facility.  Each tank contains two thousand (2,000) pounds of chlorine gas.  The chlorine is composed of 99.5 percent chlorine and 0.5 percent inert ingredients.  The tanks are located on a storage pad behind the facility.  The storage pad is covered by a canopy constructed of sheets of corrugated steel used for a roof.  The storage are is otherwise open to air.  Chlorine is being delivered by truck and unloaded using a two ton crane onto a set of steel rails where the gas is stored until it is ready for use.  Each end of the rails are chocked to prevent the gas tanks from rolling.  Each gas tank has its own valve guard to prevent objects from coming in contact with the valves.\n\nWhen a chlorine tank is needed, a two ton crane lifts the cylinder and is moved along a crane rail through a set of double steel doors and into the tank scale room. The tank scale room is fully enclosed.  The room is labeled Â¿chlorine hazardÂ¿ and emergency instruc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000475,
      "SummaryText": "tions are posted at the door.  Material Safety Data Sheets (MSDS) are located in a common hallway by the operations station.  \n\nNext to the tank scale room is the chlorine injection room.  PVC tubing leads from the tanks, through the wall, and into the chlorine injection room.  Here, the chlorine is injected into the wastewater through a series of PVC tubes.\nThe chlorine tanks are stored on to a calibrated scale designed to hold the two, 2000 pound tanks on roller trunnions.  The chlorine containers have two valves in each head, with the tank in a horizontal position and the valves in a vertical line.  They deliver gas from the upper valve and liquid from the lower valve.  Five hundred (500) psig copper tubing fitted with a special adapter is used to connect the tank to the tubing system.  To connect the line to the container, a valve protection hood and the valve outlet cap are removed.  A wrench is used to connect the valving to the yoke.  A new gasket, which is supplied with the container, is used each time a connection is made.  As part of the Process Safety Management Program leaks are then checked using ammonia vapor.  The appearance of white vapor indicates a chlorine leak.  Gloves, and a self contained breathing apparatus (SCBA) is worn by the operator while changing tanks.   In the past five years, this facility has had no accidental releases of chlorine.\n\nThe City of Oswego West Side Wastewater Treatment Plant maintains a general accidental release prevention program and chemical specific prevention steps.  As a part of this program, a chlorine alarm system is in place at the facility.  The chlorine detector and alarm are located on the wall outside of the chlorine injection room.  The chlorine sensors are located  in the injection room and the tank scale room.  In the event of a chlorine leak, a visual and audio alarm will sound on the computer in SuperintendentÂ¿s office and in the operatorÂ¿s control room, which is staffed 8 hours per day, 5 days per we"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000475,
      "SummaryText": "ek.  The alarm is also connected to an autodialer which will call up to 14 different numbers/cell phones until someone is reached.  The monitor is maintained and calibrated by an outside contractor.  The calibration frequency is yearly as recommended by the manufacturer.  Literature and information on the alarm system is kept on file by the Superintendent of the facility.  All employees are trained yearly on the chlorine alarm system.  An operator receiving an alarm is to follow the Emergency Response Plan.\n\nThe chlorine injection system itself operates under a vacuum produced by the injector mechanism.  Gas leaves the tank through a vacuum regulating valve.  A diaphragm senses vacuum on one side and atmospheric pressure on the other.  A spring loaded stem off the seat is displaced by force on the diaphragm.  Gas moves toward the flow control components and proper vacuum is maintained.  While under vacuum, gas enters the rotameter where its flow is measured.  Gas flow rate is controlled by a v-notch orifice and either manual or automatic positioning of the v-grooved plug in its ring.  A differential regulating valve is located after the orifice, which maintains the proper vacuum across the v-notch.  A pressure relief valve vents to the atmosphere if a malfunction occurs and pressure builds.  Gas is then dissolved in the water stream at the injector.  Check valves are in place and designed to close on injector shutdown.  There are no lines carrying gas under pressure in this system.  Loss of vacuum for any reason causes the vacuum regulating valve to shut off the gas supply.\n\nThe facility also complies with the Occupational Safety and Health Process Safety Management rule.  Management believes that the training of its employees and its contractors is crucial to maintaining a safe environment and continuing its accident free record for the chlorine system.  Training of all employees consists of a general orientation of the chlorine system first.  They are then instruc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000475,
      "SummaryText": "ted on the hazards and proper and safe handling of the chlorine system.  The following courses are administered to all employees and refreshed yearly:\n\nGeneral Safety Training\nDEC Wastewater Operator Renewal Training\nHazardous Communication Training\nConfined Space Training\nRespiratory Protection Program Training\nLock-out/Tag-out\nChlorine Tank Handling and Connections\nHearing Protection Program\nPersonal Protective Equipment Program\n\nA record is kept of the training and placed in the training files.  The record contains the employee or contractor name, title of course, date the course was held, name of the trainer, and results of any written, oral, or hands-on exam.\n\nAccidents are also prevented by good administrative controls.  Standard Operating Procedures (SOPs) are kept on hand and are easily accessible to the workers.  Each operator is trained in the applicable aspects of their job functions.  Those operators whose work is involved with any aspect of the chlorine injection system are thoroughly trained in those specific SOPs.  Workers who need to be inside the chlorine tank scale room or the chlorine injection room are provided chlorine specific training.\n\nThe City of Oswego West Side Wastewater Treatment Plant maintains an Emergency Management Program.  In the event of a chlorine leak alarm, the operator will first notify the other employees and then determine the location and magnitude of the leak.  The magnitude is broken down to minor leaks; no yellowish gas is visibly present, and major leaks; yellowish gas is visibly present.  For a minor leak, two trained operators will don SCBAs and protective gear and using the ammonia and water vapor bottle, find where the leak is and rectify the situation.  In the event of a major leak, the operator will call the Oswego Fire Department immediately and then notify the other workers in the plant of the major chlorine leak.  The operator will designate one location that is upwind from the chlorine leak for all personnel t"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000000475,
      "SummaryText": "o assemble and remain until the fire department informs the operator otherwise.  The Superintendent will then be called and informed of the situation.  The Oswego Fire Department will be in charge of the scene until they depart.  The approximate response time is less than five minutes.\n\nEach member of the fire department is trained to at least Haz-Mat Level I.  Two members are trained to the Technician Level, and eleven members are trained to the Specialist Level.  The fire department has toured the plant to become familiar with what is on site, and develop different leak scenarios and practice emergency response measures.  In May of 2002, a Haz-Mat drill with the Oswego Fire Department Haz-Mat Team was conducted.  The Haz-Mat Team was activated.  The scenario staged was that a tank while being changed, started leaking.  A full decon was set up.  The entry personnel used the chlorine kit to stop the tank from leaking.  A full critique was conducted, and everyone at the scene reviewed the site.  \n\nIn the attached Risk Management Plan, toxic worst case and toxic alternative release scenarios were examined.  The scenarios were developed based on a two thousand pound tank filled with 99.5 percent chlorine.  The quantity released was the full two thousand pounds at a release rate of two hundred pounds per minute for ten minutes.  The meteorological factors were an atmospheric stability class of Â¿FÂ¿ and a wind speed of 1.5 meters per second.  The topography is urban.  The release is assumed to be at ground level.  The toxic endpoint is 0.0087 mg/L (3 ppm).  These airborne concentrations are the maximum airborne concentrations that most people can be exposed to for up to one hour without experiencing serious or irreversible effects or symptoms.  The calculated distance to endpoint is 1.3 miles.\n\nThe alternate release scenario for the chlorine injection system is one that is more likely to occur than the worst case scenario that reaches and endpoint off-site.  A chlorine"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000000475,
      "SummaryText": "leak caused by piping or valve failure is used in the alternative scenario.  A hole diameter of Â¼ inch on the piping or valve could theoretically occur.  The release rate for this scenario is 9 pounds per minute for 222.2 minutes.  The meteorological conditions were atmospheric stability class of Â¿DÂ¿ and a wind speed of 3.0 meters per second.  The topography is urban.  Again the toxic endpoint is 0.0087 mg/L (3 ppm).  The calculated distance to endpoint for the alternative scenario is 0.10 miles.  Methodology for determining distance to endpoints was done by referencing Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68).\n\n \tThe chemical of concern at the West Side Wastewater Treatment Plant is chlorine.  Chlorine can be toxic if not handled properly however, the City of Oswego has a reasonable program in place to minimize the potential risks to a chlorine gas release.  A training program combined with required record keeping, administrative controls, an effective emergency management program, a local Haz-Mat team, and an alarm system all address and meet the needs of the applicable regulations as defined under 40 CFR 68 and 29 CFR 1910.119.  The West Side Wastewater Treatment Plant is currently evaluating improvements to their Safety program. They are investigating expanding the area that the chlorine sensors monitor along with visual, as well as audio alarms.  The are also taking this opportunity to improve and expand their training programs, to make their employees further aware of the continued necessity for the safe use of chlorine."
    }
  ]
}