{
  "FacilityID": 1000114206,
  "FacilityName": "Hans Kissle Co., LLC",
  "FacilityStr1": "9 Creek Brook Drive",
  "FacilityStr2": null,
  "FacilityCity": "Haverhill",
  "FacilityState": "MA",
  "FacilityZipCode": "01832",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25009",
  "LEPC": "Northeast REPC",
  "FacilityLatDecDegs": "42.790560",
  "FacilityLongDecDegs": "-071.123890",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 121011126,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 121011126,
  "Company2DUNS": null,
  "OperatorName": "Hans Kissle Co., LLC",
  "OperatorStr1": "9 Creek Brook Drive",
  "OperatorStr2": null,
  "OperatorCity": "Haverhill",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01832",
  "OperatorZipCodeExt": null,
  "FTE": 400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185104",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-05-03 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.789082,
  "FRS_Long": -71.125719,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000142333,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000114206,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000178015,
          "ProcessID": 1000142333,
          "ChemicalID": 56,
          "Quantity": 14700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000143846,
          "ProcessID": 1000142333,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000121722,
              "Process_NAICS_ID": 1000143846,
              "SafetyReviewDate": "2024-02-20 00:00:00",
              "PHA_Date": "2022-09-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2025-09-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Auto Purger",
              "OpProceduresReviewDate": "2024-05-23 00:00:00",
              "TrainingReviewDate": "2022-06-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-12-22 00:00:00",
              "EquipmentInspectionDate": "2024-02-02 00:00:00",
              "EquipmentTested": "Refrigeration system daily rounds",
              "ChangeMgmtDate": "2024-02-01 00:00:00",
              "ChangeMgmtReviewDate": "2024-02-27 00:00:00",
              "PreStartupReviewDate": "2024-05-22 00:00:00",
              "ComplianceAuditDate": "2022-03-22 00:00:00",
              "AuditCompletionDate": "2023-12-01 00:00:00",
              "IncidentInvestigationDate": "2022-02-11 00:00:00",
              "InvestigationChangeDate": "2022-02-18 00:00:00",
              "ParticipationPlansReviewDate": "2024-02-27 00:00:00",
              "HotWorkPermitReviewDate": "2024-05-22 00:00:00",
              "ContractorSafetyReviewDate": "2024-02-27 00:00:00",
              "ContractorSafetyEvalDate": "2023-05-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000152761,
                  "PreventionProgram3ID": 1000121722,
                  "ProcessChemicalID": 1000178015
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000114206,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-06-01 00:00:00",
    "ERTrainingDate": "2024-04-08 00:00:00",
    "CoordinatingAgencyName": "Haverhill Fire Department",
    "CoordinatingAgencyPhone": "9783738460",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "MGL 527 CMR 1 c60"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000114206,
      "SummaryText": ", the Refrigeration Control System provides notification to the maintenance manager, contractor, and select Hans Kissle personnel. Supplemental to the automatic alarm notification, Hans Kissle personnel would notify the Haverhill Fire Department if any of the following conditions present:\n\n*Upon investigation of the incident, Hans Kissle personnel determine the uncontrolled release is severe enough to require response assistance from the Haverhill Fire Department\n*Reportable quantities of anhydrous ammonia are released\n*A potential fire exists\n*An over pressurization condition exists\n\nThe Haverhill Emergency Management Agency and the Northeast Regional Emergency Planning Committee can provide assistance in the event of an emergency, and will be notified of a reportable release from the process.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nCurrent changes to improve safety include increased employee training, regularly scheduled evacuation exercises, revision to the EAP.\nA mechanical integrity audit will be performed in 2025."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000114206,
      "SummaryText": "part of the facility's compliance with the RMP Rule including information resulting from the completion of Process Hazard Analysis Studies.\n\nCONTRACTORS\nHans Kissle maintains a contractor qualification program in place as an element of the RMP and PSM programs. The facility engages a third party refrigeration contractor (ARC Mechanical) to oversee monthly preventative maintenance procedures on the refrigeration system equipment. Hans Kissle also hires contractors to conduct specialized maintenance and construction activities as needed. Prior to selecting a contractor, a thorough evaluation of the safety performance of the contractor is undertaken. The facility also has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes. Contractors are informed of all applicable procedures for emergency response to an accidental release of a regulated substance.\n\nFIVE-YEAR ACCIDENT HISTORY\nHans Kissle has an excellent history of preventing accidental releases since the construction of the facility. Due to our release prevention policies there has been no accident history during this five year period.\n\nEMERGENCY RESPONSE PROGRAM\nA process release would be detected by ammonia sensors located in the process, the facility, and the perimeter locations. A process release would also be detected by the employees by the characteristic odor of anhydrous ammonia at 3-5 ppm. The ammonia sensors are tested semi-annually. An alarm signal is triggered and would sound throughout the facility and adjoining warehouse and office areas, as well as activate blue strobes if ammonia is detected. An alarm system and control panel also notify central station alarms, the Haverhill Fire Department, and specific Hans Kissle individuals if operating parameters are exceeded, or an alarm occurs. The Haverhill Fire Department is notified by direct tie in alarm at ammonia detection activation levels of 25 ppm.\n\nIn the event of a process release"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000114206,
      "SummaryText": "at multiple locations and tested semi-annually. Relief Valves are replaced on a 5 yr schedule according to best practices. Emergency Ventilation and Emergency shut-down controls exist and are tested at least annually. Any equipment deficiencies identified during maintenance inspections are corrected in a safe and timely manner.\n\nPROCESS SAFETY INFORMATION\nHans Kissle maintains a detailed record of written safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all of the processes.\n\nMANAGEMENT OF CHANGE\nWritten procedures are in place at Hans Kissle to manage changes in process chemicals, technology, equipment, and procedures. Process operators, maintenance personnel, and all other employees whose job tasks are affected by a change in process are promptly made aware of, and offered training to deal with the change.\n\nPRE-STARTUP SAFETY REVIEWS\nPre-startup safety reviews related to new processes and to modifications in the established processes are conducted as a regular practice at Hans Kissle. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCOMPLIANCE AUDITS\nHans Kissle conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented. These audits are completed at least every three years and any required corrective actions are undertaken promptly and safely. All reports are maintained with the PSM Program for the life of the system.  The latest compliance audit was conducted in December of 2022.\n\nEMPLOYEE PARTICIPATION\nHans Kissle Co., LLC believes that process safety management and accident prevention is a team effort. Hans Kissle employees are encouraged to share their views concerning accident prevention issues and recommended improvements. In addition, our employees have access to all process information collected as"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000114206,
      "SummaryText": "process. The Accidental Release Prevention Program applicability threshold for anhydrous ammonia is 10,000 pounds. The anhydrous ammonia refrigeration system is the only process at the facility.\n\nThe process is subject to Risk Management Program 3 because it is subject to OSHA Process Safety Management provisions, and it is not eligible for Program 1 or Program 2.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\nThe process is currently designed and maintained in compliance with ANSI/ASHRAE guidance, as well as the International Institute of Ammonia Refrigeration Standards. Process verification takes place through design audits by trained personnel and/or consultants and refrigeration contractors. The schedule of such verifications is at least once every three years.\n\nPROCESS HAZARD ANALYSIS\nAn off-site consequence analysis has been completed for a worst-case release scenario and an alternative release scenario to document the distance to toxic endpoint for each scenario, as well as the potential population, public and environmental receptors that fall within the radius of impact for each scenario.  The latest PHA was completed in September, 2022.\n\nMECHANICAL INTEGRITY PROGRAM\nPreventative maintenance (PM) is an active part of Hans Kissle's daily operations. The facility executes documented maintenance inspections on process equipment to ensure proper operation. Process equipment included within the MI Program includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shut down systems, system controls, and compressors. Maintenance procedures are carried out by qualified and certified refrigeration personnel and contractors with a background in maintenance practices. Training is provided to personnel as needed. PM is performed in accordance with OSHA-PSM and IIAR-6 equipment maintenance schedules. A monthly PM Program is administered by ARC Mechanical (Hans Kissle's third party refrigeration contractor), Ammonia detection sensors are present"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000114206,
      "SummaryText": "EXECUTIVE SUMMARY\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE\nIt is the policy of Hans Kissle Co., LLC to adhere to all applicable Federal, State, and Local laws and regulations. Hans Kissle is committed to employee, public, and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If an unpredictable release does occur, Hans Kissle contracts a trained refrigeration operator with 24 hour response capability, and coordinated with the Haverhill Fire Department to assist in mitigating any release.\n\nThe ammonia refrigeration process at Hans Kissle has been designed and operates in accordance with EPA's Accidental Release Prevention Rule, and applicable State and Local codes and regulations. Hans Kissle has qualified engineering, operations, and maintenance personnel knowledgeable in the process, and the safe operation of ammonia refrigeration systems in direct responsibility of the process. The process is also designed and operated in voluntary compliance with the Occupational Safety and Health Administration's Process Safety Management rule.\n\nThrough the Hans Kissle Emergency Action Plan as required under OSHA PSM, Hans Kissle has emergency action procedures in place that comply with the Accidental Release Prevention Program.\n\nDESCRIPTION OF FACILITY AND REGULATED SUBSTANCES HANDLED\nHans Kissle Co., LLC develops, manufactures, and sells a wide range of high-quality, wholesale delicatessen main and side dishes, desserts, and other prepared foods for supermarkets and grocery stores in the United States. The facility is situated on a 17 acre industrially zoned parcel, and is a 112,000 sq. ft facility utilizing 15,000 lbs of anhydrous ammonia within the"
    }
  ]
}