{
  "FacilityID": 1000040031,
  "FacilityName": "High Plains Gas Plant",
  "FacilityStr1": "13800 East County Road 230",
  "FacilityStr2": null,
  "FacilityCity": "Midland",
  "FacilityState": "TX",
  "FacilityZipCode": "79706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48329",
  "LEPC": "Midland County LEPC",
  "FacilityLatDecDegs": "31.853361",
  "FacilityLongDecDegs": "-101.789806",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Targa Resources",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Targa Gas Processing, LLC",
  "OperatorStr1": "811 Louisiana, Suite 2100",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000224884",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-03-15 17:56:08",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-04-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 31.853361,
  "FRS_Long": -101.789806,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049365,
      "AltID": "Gas Processing Plant",
      "FacilityID": 1000040031,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059896,
          "ProcessID": 1000049365,
          "ChemicalID": 98,
          "Quantity": 42300.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000059851,
          "ProcessID": 1000049365,
          "ChemicalID": 155,
          "Quantity": 827900.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000051958,
              "ProcessChemicalID": 1000059851,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000051959,
              "ProcessChemicalID": 1000059851,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000051960,
              "ProcessChemicalID": 1000059851,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000051961,
              "ProcessChemicalID": 1000059851,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000051962,
              "ProcessChemicalID": 1000059851,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000051963,
              "ProcessChemicalID": 1000059851,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000049827,
          "ProcessID": 1000049365,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000042598,
              "Process_NAICS_ID": 1000049827,
              "SafetyReviewDate": "2014-03-03 00:00:00",
              "PHA_Date": "2014-04-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-04-25 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-06-21 00:00:00",
              "TrainingReviewDate": "2014-04-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-01 00:00:00",
              "EquipmentInspectionDate": "2014-04-01 00:00:00",
              "EquipmentTested": "Check shutdowns and alarms in facility",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2013-09-25 00:00:00",
              "PreStartupReviewDate": "2013-09-25 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-09-25 00:00:00",
              "HotWorkPermitReviewDate": "2013-09-25 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2013-06-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000050865,
                  "PreventionProgram3ID": 1000042598,
                  "ProcessChemicalID": 1000059851
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000040031,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-11-25 00:00:00",
    "ERTrainingDate": "2013-04-01 00:00:00",
    "CoordinatingAgencyName": "Midland County Emergency Response",
    "CoordinatingAgencyPhone": "4324982141",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000040031,
      "SummaryText": "e Audits\r\nTo help ensure that the accident prevention program is functioning properly, the High Plains gas plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every three years. The audit team develops findings that are forwarded to plant management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n\r\nCHEMICAL-SPECIFIC PREVENTION STEPS\r\nThe High Plains gas plant has hazard potentials that must be managed to ensure continued safe operation. The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\nUniversal Prevention Activities\r\nThe accident prevention program summarized previously is applied to all RMP covered processes at the High Plains gas plant. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\nSpecialized Safety Features\r\nThe High Plains gas plant has safety features to help:\r\n(1) contain/control a release,\r\n(2) quickly detect a release, and\r\n(3) reduce the consequences of (mitigate) a release.\r\nThe following types of safety features are used in the covered processes:\r\nRelease Detection\r\n1. Hydrocarbon detectors with alarms\r\nRelease Containment / Control\r\n1. Process relief valves\r\n2. Valves to permit isolation of the process\r\n3. Automated shutdown systems for specific process parameters\r\n4. Curbing or diking to contain liquid releases\r\n5. Atmospheric relief devices\r\n6. Redundant equipment and instrumentation (e.g. uninterruptible power supply for control system, spare pump)\r\nRelease Mitigation\r\n1. Trained personnel\r\n2. Personal protective equipment\r\n3. Fire e"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000040031,
      "SummaryText": "dures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\nProcess Hazard Analysis (PHA)\r\nThe High Plains gas plant has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\nThe What If analysis technique is primarily used to perform these evaluations. The analyses are conducted\r\nusing a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process, as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\nThe PHA team findings are forwarded to local and corporate management for resolution. Implementation of mitigation options in response to PHA findings is guided by a relative risk ranking assigned by the PHA team. This helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options in response to PHA team findings are tracked until they are completed. The final resolution of each finding is documented and retained. To help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the plant periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every five years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained.\r\n\r\nOperating Procedures\r\nThe High P"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000040031,
      "SummaryText": "lains gas plant maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate. These procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process. The procedures are readily available in the process unit for operators and other personnel to use as necessary to safely perform their job tasks.\r\n\r\nTraining\r\nTo complement the written procedures for process operations, the High Plains gas plant has implemented a comprehensive training program for all employees involved in operating a process. New employees receive training in gas plant operations if they are not already familiar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. After operators demonstrate (e.g. through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every three years. This training is documented for each operator, including the means used to verify that the operator understood the training.\r\n\r\nContractors\r\nThe gas plant uses contractors to supplement its workforce during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the gas plant has procedure"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000040031,
      "SummaryText": "at adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\nManagement of Change\r\nThe High Plains gas plant has a comprehensive system to manage changes to all covered processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards, and (2) verify that existing controls have not been compromised by the change. Chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change.\r\n\r\nIncident Investigation\r\nThe High Plains gas plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire / explosion, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence or similar incident. The investigation team documents its findings, develops recommendations and provides these results to gas plant management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until completed. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all personnel who could be affected by the findings (including contractors) . Incident investigation reports are retained for at least five years so that the reports can be reviewed during future PHAs and PHA re-validations.\r\n\r\nComplianc"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000040031,
      "SummaryText": "xtinguishers\r\nFIVE-YEAR ACCIDENT HISTORY\r\nThere have been no accidents over the past five years\r\nEMERGENCY ACTION PLAN INFORMATION\r\nThe High Plains gas plant has a written emergency action plan that is in place to protect the safety of workers and the public, as well as the environment. There are no 112(r) threshold toxic substances on the plant site. For a non-incidental release of a flammable substance, including the possibility of fire, response actions have been coordinated with the local emergency agencies and notification mechanisms are in place. Employees receive training as necessary to perform their specific emergency actions. The emergency action plan is updated when needed and affected personnel informed and or training in the changes. The gas plant has around the clock communications capability with appropriate officials, emergency response agencies and emergency response organizations (e.g. fire department). This provides a means of notifying the public of an incident if necessary, as well as facilitating a quick response to an incident. The plant emergency plan is tailored to this facility and to the emergency services available in the community.\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nThe High Plains Gas Processing Plant has resolved all findings from PHAs. At the current time, no changes are planned over the foreseeable future."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000040031,
      "SummaryText": "s safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team. Employees have access to all information created as part of the gas plant accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the gas plant. In addition, the gas plant has initiatives under way which address process safety and employee safety issues.\r\n\r\nProcess Safety Information\r\nThe High Plains gas plant keeps a variety of technical documents that are used to help maintain safe operations. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis / configuration information. The reference documents and their location is readily available as part of the written employee participation program to help employees locate any necessary process safety information.\r\nChemical-specific information, including exposure hazards and emergency response / exposure treatment considerations, is provided in material safety data sheets (MSDS's). For specific process areas the plant has documented safety related limits for specific process related parameters (e.g. temperature, level, composition). The gas plant ensures that the process is maintained within acceptable limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\r\nTechnical documents are maintained at the plant that provide information about the design and construction of the process and equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written proce"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000040031,
      "SummaryText": ", (3) performing inspections and tests, (4)correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.\r\nWritten procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (i.e., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or the plant management will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\r\nAnother integral part of the mechanical integrity program is quality assurance. The High Plains gas plant incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\r\n\r\nSafe Work Practices\r\nThe High Plains gas plant has long-standing safe work practices in place to help ensure worker protection and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark producing activities (i.e., hot work), and (5) a permit and procedure to ensure th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000040031,
      "SummaryText": "s in place to ensure that contractors (1) perform their work in a safe manner,(2) have the appropriate knowledge and skills,(3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency,(5) understand and follow site safety rules, and (6) inform gas plant personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency plan requirements, and (4) safe work practices prior to their beginning work.\r\nIn addition, the High Plains gas plant evaluates contractor safety programs and performance during the selection of a contractor. Gas plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\r\n\r\nPre-Startup Safety Reviews (PSSRs)\r\nThe High Plains gas plant, conducts a PSSR for any new facility or process modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup before placing the equipment into service. This review provides an additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review team uses checklist(s) to verify all aspects of readiness. A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n\r\nMechanical Integrity\r\nThe High Plains gas plant has well-established practices and procedures to maintain pressure vessels, piping systems, relief valves, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include (1)conducting training, (2) developing written procedures"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000040031,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND RESPONSE PROGRAM\r\n\r\nThe High Plains gas plant is committed to worker protection and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of this facility. Our standing practice is to implement reasonable controls to prevent foreseeable releases of regulated flammable substances. However, if a release does occur, gas plant trained personnel will respond to control / mitigate the release. In the event a non-incidental release occurs, gas plant personnel are prepared to work with the local fire department, Local Emergency Planning Commission (LEPC) and other authorities to control and mitigate the effects of the release.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe High Plains gas plant, located near Midland, TX, recovers petroleum products(e.g., natural gas and natural gas liquids (NGL)) from field gas. NGL is a mixture of aliphatic and aromatic hydrocarbons, including the regulated flammables ethane, propane, butanes, and pentanes, and is shipped from the facility by pipeline. There is also refrigerant propane at the site. There are no threshold quantities of toxic substances at the facility.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nThe following is a summary of the accident prevention program in place at the High Plains gas plant. The processes at the gas plant regulated by the Environmental Protection Agency's(EPA's) risk management program (RMP) regulation are also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard, therefore this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program. \r\n\r\nEmployee Participation\r\nEmployees at the High Plains gas plant are encouraged to participate in all facets of proces"
    }
  ]
}