{
  "FacilityID": 1000031206,
  "FacilityName": "Hydrochlor LLC",
  "FacilityStr1": "2301 Brazosport Blvd.",
  "FacilityStr2": "B-300 West",
  "FacilityCity": "Freeport",
  "FacilityState": "TX",
  "FacilityZipCode": "77541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48039",
  "LEPC": "Brazoria County LEPC",
  "FacilityLatDecDegs": "28.994511",
  "FacilityLongDecDegs": "-95.391516",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "NW",
  "FacilityURL": "www.lindeus.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 966622628,
  "Company2DUNS": 3001070,
  "OperatorName": "Hydrochlor LLC",
  "OperatorStr1": "PO Box 2045",
  "OperatorStr2": null,
  "OperatorCity": "Freeport",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77542",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000219211",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "95078",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-11-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-11-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-11-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2024-03-22 00:00:00",
  "DeRegistrationEffectiveDate": "2022-04-01 00:00:00",
  "AnniversaryDate": "2017-11-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 28.981692,
  "FRS_Long": -95.376501,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000038099,
      "AltID": "Hydrogen Chloride Packagi",
      "FacilityID": 1000031206,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000045881,
          "ProcessID": 1000038099,
          "ChemicalID": 54,
          "Quantity": 22000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000038459,
          "ProcessID": 1000038099,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000033284,
              "Process_NAICS_ID": 1000038459,
              "SafetyReviewDate": "2012-07-31 00:00:00",
              "PHA_Date": "2012-09-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-02-28 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-06-08 00:00:00",
              "TrainingReviewDate": "2012-08-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-08-10 00:00:00",
              "EquipmentInspectionDate": "2012-08-29 00:00:00",
              "EquipmentTested": "Truck scales, pressure transducers, flow meters, temperature transducers, radiography on piping welds",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2012-03-01 00:00:00",
              "PreStartupReviewDate": "2012-07-31 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-04-30 00:00:00",
              "HotWorkPermitReviewDate": "2012-05-30 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2012-07-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000039449,
                  "PreventionProgram3ID": 1000033284,
                  "ProcessChemicalID": 1000045881
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000031206,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-07-22 00:00:00",
    "ERTrainingDate": "2012-08-10 00:00:00",
    "CoordinatingAgencyName": "Dow Emergency Services",
    "CoordinatingAgencyPhone": "9792382112",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000031206,
      "SummaryText": "venture (JV) between Linde Gas North America, LLC and Air Products and Chemicals, Inc. that was established for the purpose of filling tube trailers and Y-cylinders with Anhydrous Hydrogen Chloride manufactured by Dow.   The process is fed by liquid hydrogen chloride from the supplier's (Dow) existing pipeline. Dow operates and maintains a sub-cooler, sump and knock-out pot on the JV site for interface with the JV transfill equipment. \r\n\r\nA Milton Roy (MR) triplex pump transfers sub-cooled liquid to tube trailers and Y-cylinders. The MR pump is a positive displacement pump, therefore is fitted with a variable frequency drive (VFD) and a recycle loop, controlled by discharge pressure, tied back to the Dow subcooler sump. The purpose of the recycle loop is to maintain higher discharge pressure, particularly while filling Y-cylinders. \r\n\r\nThere are two tube trailer fill stanchions, each with a truck scale, and one dump stanchion. There is an additional truck scale on site for check weighing that is not associated with dump or fill stanchions. There are four Y-cylinder fill stanchions, each with cylinder scale, and one dump stanchion. There is an additional cylinder scale on site for check weighing that is not associated with dump or fill stanchions. \r\n\r\nTube trailers have connections at both the front (liquid) and back (gas) of the tubes. There is a single manifold to connect at the rear of the tube (gas connection), shared by the two tube trailer fill stanchions, that is used for analytical sampling and testing. The Y-cylinder fill stanchions do not have separate gas and liquid manifolds, in which case the Y-cylinder is rotated to spin the dip tube for either gas or liquid connection. \r\n\r\nIn certain cases, tube trailers and Y-cylinders will be returned on site with a small heel of liquid that must be removed before re-filling the container. This liquid heel will be dumped to Dow's anhydrous HCl header, via Dow's knock-out pot on the JV site. Several times a month, tub"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000031206,
      "SummaryText": "Hydrochlor LLC Executive Summary:\r\n\r\nThe site has Anhydrous Hydrogen Chloride stored in high pressure tubes in a quantity greater than the 112(R) list threshold quantity.\r\n\r\nIf a release or an accident would occur, there would be a significant impact on public receptors per modeling conducted by Linde for the worst case and alternative release scenarios. This modeling was performed in 2012.\r\n\r\nHydrochlor LLC is a new facility with construction and start-up completion in 2012.\r\n\r\nBased on the above information the process mentioned, the process is considered program level 3 processes.\r\n\r\nAccidental Release Prevention and Emergency Response Policies at the Hydrochlor Facility:\r\n\r\nSafety is the first consideration in the design and operation of this plant.  Nevertheless there is always the possibility of equipment failure, operator error or force of nature which could cause a serious environmental problem. Hydrochlor is committed to making protection of human heath, safety and the environment the first priority. We will operate on the premise that all accidents and incidents are preventable and work toward this goal. \r\n\r\nHydrochlor will fulfill this policy commitment through the application of a comprehensive Risk Management System which will provide all stakeholders with ongoing assurance that:\r\n\r\n- Adherence to safety, heath and environmental laws, regulations, and permit requirements\r\n- Identifiable safety, heath and environmental risks associated with Hydrochlor operation are assessed and successfully managed\r\n- Systems are in place to manage change\r\n- An environmental contingency plan is in place\r\n- Emergency Response Procedures are in place\r\n- An excellent safety performance is everyone's responsibility, and it is this site policy that all employees must adopt and are encourage safe work practices and conduct for all work related activities in an environmentally responsible manner.\r\n\r\nGeneral Information of the facility:\r\n\r\nThe Hydrochlor LLC facility is a joint"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000031206,
      "SummaryText": "es and cylinders will be taken out of service to have the primary vessel valve replaced. In these cases, HCl vapor that is not dumped to the anhydrous header (typically 50 psig) will be vented through an absorber on site. The absorber is essentially a liquid contactor to remove HCl vapor from a gas stream. The resulting aqueous HCl will be returned to Dow at a rate of approximately 5 gpm. The absorber will operate continuously; therefore the concentration of HCl in the aqueous return stream will vary between 0% and 38% acid. \r\n\r\nAfter connections are made to the Y-cylinder or tube trailer, high pressure Nitrogen (1000 psig) will be used to insure no leaks. This Nitrogen will be vented down to the absorber. In addition to leak check, low pressure He will be used to purge lines after making connections and before line breaking, to maintain purity and prevent operator exposure, respectively. This low pressure He, (aka cycle purge) will also be vented to the absorber.\r\n\r\nRegulated Substance Handled at the site:\r\n\r\nAnhydrous Hydrogen Chloride is used in the transfer pipeline from Dow, through the triplex pumps and filling manifold into tube trailers.   Anhydrous Hydrogen Chloride is also used transfer lines between residual tube trailers and the disposal system including the absorber line going to DOW and the on site absorber.\r\n\r\nThe Worst-case release scenario and the alternative release scenario for Anhydrous Hydrogen Chloride at the Hydrochlor Site: \r\nWORST CASE SCENARIO\r\n\r\nSELECTION CRITERIA & SCENARIO DESCRIPTION\r\nIntroduction: The Analysis was performed on a single 3,000 pound Hydrogen Chloride Storage tube. The location itself is surrounded by the DOW chemical facility.\r\n\r\nThe EPA's RMP*Comp Ver. 1.07 software was used for the analysis. This software product is widely used for air modeling applications. The scope of the analysis included modeling a worst case release scenario of a vessel rupture and an alternative release scenario of a release through temperature"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000031206,
      "SummaryText": "and pressure activated relief valves.\r\n\r\nThe Worst Case Scenario (WCS) for the Hydrochlor Facility is the release of total contents of one 3,000 lb tube on a tube trailer in 10 minutes.  \r\n\r\nAlthough there are numerous installed control measures that, in an actual event, would have mitigated the release, no credit for active mitigation measures was taken into account for this scenario.  The results for the WCS were generated from the EPA's RMP Offsite Consequence Analysis Guidelines, (RMP).  \r\nThe release results were determined assuming the following conditions for a WCS:\r\n\r\n¿\tNeutrally buoyant gas\r\n¿\tTen-minute release\r\n¿\tUrban/obstacles topography\r\n¿\tF stability class\r\n¿\tWind speed of 1.5 meters per second\r\n¿\tTemperature of 77 deg F\r\n\r\n\r\n\r\nRESULTS SUMMARY\r\n\r\nThe following table contains the results for the WCS:\r\n\r\nTable A-2:  HCl WCS Results\r\n\r\nRELEASE SCENARIO\tMATERIAL\tAMOUNT\tENDPOINT\tDISTANCE\r\nToxic\tHCl\t3,000 lbs.\t20 ppm (ERPG-2)\t3.4 miles/17,945 Ft.\r\n\r\nUsing census data from LandView 6, the estimated population within the worst case scenario circle is 24,758.\r\n \r\n\r\nALTERNATIVE RELEASE SCENARIO\r\n\r\nTo assist in emergency response planning, the Linde Hydrochlor Facility developed an Alternative Release Scenario (ARS) to represent a reasonable \"outer bound\" for our emergency response planning and for explaining potential hazards to the community.\r\n\r\nSELECTION CRITERIA & SCENARIO DESCRIPTIONS\r\n\r\nTo determine the most appropriate scenario for the ARS, the following steps were taken:\r\n\r\n¿\tUsing the HAZOP of the system,  a set of upset conditions was identified that could lead to a release of HCl\r\n¿\tA conservative set of release conditions, physical characteristics of the release site, and meteorological conditions at the time of the release were identified for each upset condition\r\n¿\tAn analysis of the distance to each endpoint was performed to determine which release scenario had the highest likelihood of resulting in the greatest offsite impact.\r\n\r\nBased on scenari"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000031206,
      "SummaryText": "os generated during the HCl PHA, it was determined that the potential exists for a  9/16\" rupture disk on a HCl tube to fail, releasing 3,000 lbs of HCl in 45 minutes.\r\n\r\nMitigation systems included the following:\r\n\r\n¿\tToxic gas monitors at trailer fill areas activate isolation of transfer valves\r\n¿\tAnti-tow away measures isolate transfer valve\r\n¿\tControls logic detects deviations between flow-meter and scale to shut off pump and isolate transfer lines \r\n¿\tRemote isolation of transfer pump suction valve upon indication of release\r\n¿\tFire water spray monitor nozzles directed at HCl trailer loading area\r\n\r\nThe results for the ACS were generated from the EPA's RMP Offsite Consequence Analysis Guidelines, (RMP).  The EPA's RMP*Comp Ver. 1.07 software was used for the analysis.\r\n\r\nThe release results were determined assuming the following conditions for an ACS:\r\n\r\n¿\tNeutrally buoyant gas;\r\n¿\tThree-minute release;\r\n¿\tUrban/obstacles topography\r\n¿\tD stability class;\r\n¿\tWind speed of 3 meters per second; and\r\n¿\tTemperature of 77 deg F\r\n\r\nRESULTS SUMMARY\r\n\r\nThe following table contains the results for the ARS:\r\n\r\nTable A-3\r\nAmmonia ARS Results\r\nRELEASE SCENARIO\tMATERIAL\tAMOUNT\tENDPOINT\tDISTANCE\r\nToxic\tHCl\t3,000 lbs. in 45 minutes\t20 ppm (ERPG-2)\r\n\t0.4 miles /1,968 ft.\r\n\r\nUsing census data from LandView 6, the estimated population within the alternative release scenario ERPG-2 circle is 0.\r\n\r\nGeneral Accidental Release Prevention Program and Chemical - Specific Prevention Steps:\r\n\r\nThe Hydrochlor plant process is designed and operated under strict parameters to reduce risk of accidents. The safety of Hydrochlor employees, the surrounding Dow employees and contractors and the citizens of the surrounding communities are of paramount importance. As a result of Hydrochlor's commitment to the safety of its employees, Its surrounding community, to fully comply with OSHA 'S standard 29 CFR 1910.119 (Process Safety Management of Highly Hazardous Chemicals) Hydrochlor has a Process Sa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000031206,
      "SummaryText": "fety Management Program (PSM) . This Program is intended to prevent or reduced the risk of any major industrial incident that might expose employees to the Hazard of Toxicity, Fire, or explosion cause by highly hazardous chemicals.\r\n\r\nThe elements of the program are:\r\n\r\n1. Employee Participation\r\n2. Process Safety Information\r\n3. Process Hazard Analysis\r\n4 Operating Procedure\r\n5. Training\r\n6. Contractor Safety\r\n7. Pre-Startup Safety Review\r\n8. Mechanical Integrity\r\n9. Hot Work Permit\r\n10. Management Of Change\r\n11. Incident Investigation\r\n12. Emergency Response Plan\r\n13. Compliance Audit\r\n14 Trade Secrets\r\n\r\nThe objective of these provisions is to develop a protective approach to the identification, evaluation, and prevention of chemical releases which result from lack of procedures, human error, or equipment failure. \r\n\r\nHydrochlor has also developed and implemented a Best Management Practice Plan prevents or minimize the potential for release of pollutants from ancillary activities, including material storage areas; plant site runoff; in-plant transfer and process areas.   The trailer filling areas have fire water monitors. Wind socks are also located within the site to determine wind direction. An emergency response plan is in place.\r\n\r\nThe Five Year Accident History:\r\n\r\nThe site has is a new facility as of 2012.\r\n\r\nThe Emergency Response Program:\r\n\r\nThe intent of the management at this site is to be pro-active, reduce risk, provide a safe, healthy work site and prevent accidents and emergencies from occurring as much as feasible. The Emergency Action Plan is developed to minimize threats to life, health and property when un-planed events happen. \r\n\r\nThe emergency Response Program was developed base on the following Assumptions:\r\n\r\n1. The control building is built as a shelter in place\r\n2. Operations in the plant may be isolated on short notice from other sections\r\n3. Personnel are trained operators who understand their section of the plant thoroughly and who have"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000031206,
      "SummaryText": "been trained on steps to be taken to assure safe operation in that section\r\n4. Hazardous releases from the surrounding Dow facility that could have an impact on Hydrochlor employees are monitored for and considered in the emergency response plan\r\n5.  Employees of Hydrochlor and Dow are alerted and trained to respond to the tiered Dow emergency alarm system protocol:  Dow level 0 alarm (release is contained), Level 1 (release contained within block), Level 2 (release contained within DOW site), Level 3 (release is outside of DOW site).  \r\n\r\nHydrochlor in the event of an incident would need to rely on assistance from the DOW Emergency Operation Center. The existence of an emergency will be reported immediately by any individual calling 979-238-6666 (Dow Emergency Number) and 1-800-232-4726 (Linde Emergency Number). In order that the security officer realizes the urgency of the call, the individual reporting will state \"emergency call\". Facts to be reported to the emergency contact official will include the following:\r\n\r\n- Name of the individual making the report\r\n- Where the call is being made from\r\n- Nature of occurrence\r\n- Weather there has been loss of life or injury to personnel\r\n\r\nIf the incident involves a release, the proper Emergency Release Notifications must also be made:\r\n\r\n-\tEPA (If Reportable Quantity is exceeded)\r\n-\tDow\r\n-\tLinde\r\n-\tAir Products\r\n\r\nFurther information that must be provided would include the following:\r\n\r\n- Name of chemical release\r\n- Estimated Quantity release\r\n- Time and duration of release\r\n- Release occurred in air, water or land\r\n- Known or anticipated acute or chronic health risks and where appropriate, advice concerning medical\r\nattention necessary for expose personnel\r\n- Proper precautions to take as result of release including evacuations:\r\n\r\nIn House Training of Personnel Includes:\r\n\r\n1) Linde On-Alert Training (Hazardous incident response training)\r\n2) CPR Training\r\n3) First Aid\r\n4) Proper Use of Fire extinguisher. Training vid"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000031206,
      "SummaryText": "eo.\r\n5) Yearly Site Review of Emergency Action Plan\r\n6) Yearly review of Environmental Plan\r\n7) Monthly Safety Meetings where the site go over corrective actions to take for a specific emergency\r\nSituation\r\n\r\nOther Elements included in the Emergency Action Plan:\r\n\r\n1) An emergency escape procedure and emergency escape assignment\r\n2) Emergency shut-down procedures that can be activated by all employees\r\n3) Procedures to account for all employees after an emergency evacuation has been completed\r\n4) Dow emergency services for injuries beyond first aid\r\n5) An Alarm system test schedule\r\n\r\nFire Prevention Elements include:\r\n\r\n1) Hot Work Permit\r\n2) House Keeping Policy"
    }
  ]
}