{
  "FacilityID": 1000104748,
  "FacilityName": "USS-UPI",
  "FacilityStr1": "900 Loveridge Road",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": "0471",
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.024972",
  "FacilityLongDecDegs": "-121.859250",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ussupi.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 150824647,
  "ParentCompanyName": "USX Corporation",
  "Company2Name": null,
  "CompanyDUNS": 2028801,
  "Company2DUNS": null,
  "OperatorName": "USS Posco Industries",
  "OperatorStr1": "900 Loveridge Road",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": "0471",
  "FTE": 500,
  "OtherEPAFacilityID": "94565SSPSCPOBOX",
  "EPAFacilityID": "100000144809",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "A2371",
  "SafetyInspectionDate": "2020-09-02 00:00:00",
  "SafetyInspectionBy": "Contra Costa Hazardous Material Program CalARP",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-03-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-03-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-03-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-03-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.027981,
  "FRS_Long": -121.872765,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000130594,
      "AltID": "Liquid Hydrogen Storage",
      "FacilityID": 1000104748,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000163757,
          "ProcessID": 1000130594,
          "ChemicalID": 149,
          "Quantity": 15930.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000132048,
          "ProcessID": 1000130594,
          "NAICSCode": "331221",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104748,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-01-16 00:00:00",
    "ERTrainingDate": "2023-03-07 00:00:00",
    "CoordinatingAgencyName": "Contra Costa County Health Services",
    "CoordinatingAgencyPhone": "9256553200",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Maritime Transportation Security Act of 2002: 33 CFR Part 105",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104748,
      "SummaryText": "USS-UPI, A United States Steel Company (UPI) has updated the RMP submitted to EPA on August 18, 2021.  As part of this 5-year update, UPI has included the following:\n- Following a significant incident at a source, the 5-year accident history information will be updated within six months to reflect the incident.\n- If the emergency contact at the source changes, the RMP will be updated within one month, to include the new emergency contact information.\n- The emergency contacts email address has been included in this RMP submittal.\n- The purpose for the RMP submissions has been included 5year re-evaluation and re-submittal to EPA.\n- Name, address, and phone number of the contractor used to complete the RMP submittal has been included and updated due to office change.\nNote1: On 2/29/2020, United States Steel acquires remaining 50% ownership interest in USS POSCO Industries from POSCO California Corporation. Therefore, the name changed from USS-POSCO Industries to USS-UPI.\nNote2: In January 2022, USS announced that they will shutdown operations at UPI, the Pittsburg facility.  The last day of production will be 12/31/23.\nNote3:  The reason for this RMP submittal is to remove Anhydrous Ammonia. The Anhydrous Ammonia was used for NOx   reduction on the Kawasaki Multi-Purpose Continuous Annealing Line (KMCAL).  The KMCAL was idled in July 2022. On March 7, 2023, the Anhydrous Ammonia Tank liquid & vapor was pumped out. The next RMP submittal will be in 2026 with a revised Worst-Case Scenario for Hydrogen.\n\n\nSite Description & Regulated Substances\nUPI is located at 900 Loveridge Road in the city of Pittsburg, California approximately\na 1/2 mile north of Highway 4. The UPI property occupies approximately 490 acres. It is bordered by the New York Slough of the San Joaquin/Sacramento River on the north and by open space and industrial facilities in all other directions. The nearest residences are located approximately 3/4 miles to the southwest of any facilities handling chemic"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104748,
      "SummaryText": "als regulated under the RMP Rule.\n\nThe plant employs 500 people. The operating divisions within the UPI facility include: the Rolling, Sheet, Tin, & Reliability Divisions. These 4 divisions are supported by the Technology, Environmental & Safety Group.\n\nLiquid hydrogen is the only federally and state regulated substances present at UPI. Our previously submitted RMP had Anhydrous Ammonia. See Note3.\n\nThe Hydrogen's largest vessel quantity is: 10,260lbs with a total of hydrogen on site to 15,930lbs (the sum of both vessels). A low-level alarm to alert both the Supervisor and Supplier that Hydrogen is needed is installed on the tank, and set to 3\u0094 W.C. \n\nEmergency Response \nUPI\u0092s Emergency Response team consists of First Responders, Emergency Response Team and Emergency Medical Technicians (EMTs).\n\nFirst Responders are trained to be first on the scene and assist in the event of an emergency. First Responders attend monthly training to keep their skills current.\n\nThe Emergency Response Team consists of First Responders who receive more specialized, in-depth training including confined space rescue, hazmat training and firefighting. This group works with the UPI Fire Prevention Technician and EMTs on all phases of emergency response.\n\nEmergency Medical Technicians are onsite 24 hours a day, 7 days a week. Our certified EMT\u0092s duties also include emergency dispatch, rescue, medical treatment, patient transport, security and onsite training.\n\nUPI conducts 4 emergency situational drills per month for emergency preparedness. (these drills were temporarily suspended for 16 months due to Social Distancing requirements of the COVID-19 pandemic).  Some of the drills conducted include the Contra Costa Fire department in a continual effort to keep our close relationship with the outside agencies. \n\n\nFive-Year Accident History \nA review of facility incident investigation reports has shown that there have been no incidents involving Hydrogen or other hazardous substances, for which t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104748,
      "SummaryText": "he onsite or offsite consequences exceeded the reporting requirements of RMP EPA, CFR Part 68.42.\nFollowing a significant incident of a covered RMP process (liquid hydrogen), UPI will update the accident history to reflect the incident. This is intended to help EPA and other agencies identify\nthe need for technical assistance, and a timely update to the accident history will provide information to prevent similar incidents in industry.  \n\nPlanned Changes to Improve Safety\nThe liquid hydrogen process worst-case scenario does not result in any residential population within the endpoint distance zone. No immediate plans have been submitted.\n\nUPI Vision/Mission Statement:\nTHE SAFETY OF ALL EMPLOYEES IS OUR FIRST PRIORITY\nWe will achieve the best safety record of the steel industry.  Through benchmarking, \u0093best practices\u0094 and root cause analysis; we will determine and provide the appropriate protective equipment, proper work environment and training to accomplish this goal.  We will audit activities and conduct drills to ensure compliance with UPI\u0092s safety program.  We expect all employees to take responsibility for their own safety, the safety of others, and be accountable for their own actions.\n\nUPI has a long-standing commitment to business principles which promote the safe, ethical operation of its steel manufacturing facilities in Pittsburg, California. These principles have resulted in clear UPI business strategies that call for continual improvement of safety, quality, customer satisfaction, protection and preservation of the environment, and community responsibility. Implementation of, and adherence to, these business strategies requires the full commitment of all UPI employees. UPI continues to plan to improve safety by taking any incident related to the ammonia process, analyze it, and incorporate it into the training schedule we currently have.\nOur Training programs continue to be improved and provided to all employees as a result of safe employees and providi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104748,
      "SummaryText": "ng a safe environment.\n\nWe continue to monitor any changes in the regulations to ensure that we are continually improving and implementing those applicable to our process.\n\nUPI\u0092s Continuous Improvement to the Environment (C.I.T.E) policy dictates that each division continuously identify methods to reduce the use of hazardous materials and to reduce the risk to the community and environment through implementation of inherently safer technology and procedures. \n\nUPI stresses safe and environmentally sound operations with communications to our employees.  UPI safety and Environmental programs are included in the monthly safety meetings for all employees.  A Joint Safety Committee comprised of both wage & management meets monthly to discuss all aspects of Environmental Health & Safety.  UPI supervisory and management personnel conduct periodic audits to ensure adherence of our safety policies and procedures including our strict housekeeping policy.  Employees are required to get seven safety contact per months, which include recent safety incidents, policy & procedures and observations.\n\nUPI utilizes a \u0093Plant Information Display Application\u0094 (PIDA) to communicate safety related items to our 500 employees.  The PIDA system is a close circuit system that displays safety information to 25 very large monitors installed in all areas of our facility."
    }
  ]
}