{
  "FacilityID": 1000044744,
  "FacilityName": "Southern California Ice Company",
  "FacilityStr1": "22921 Lockness Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Torrance",
  "FacilityState": "CA",
  "FacilityZipCode": "90501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.816770",
  "FacilityLongDecDegs": "-118.304980",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Southern California Ice Company",
  "OperatorStr1": "22921 Lockness Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Torrance",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90501",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ms. Sharon Corbin",
  "RMPTitle": "Owner",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197707",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-05-17 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055343,
      "AltID": "Refrigeration System",
      "FacilityID": 1000044744,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056215,
          "ProcessID": 1000055343,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067456,
          "ProcessID": 1000055343,
          "ChemicalID": 56,
          "Quantity": 14500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567456,
          "ProcessID": 1000055343,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044744,
      "SummaryText": "RISK MANAGEMENT PLAN A? Southern California Ice Company.\n\n\n\nEXECUTIVE SUMMARY\n\n\n\nSouthern California Ice Company has established a Risk Management Plan according to EPA's regulations (40 CFR Part 68) for the Refrigeration System at its Torrance facility to enhance its already existing safety programs.  Southern California Ice Company is extremely cautious in the handling of all chemicals and is very diligent about safety for its employees and its communities.  Southern California Ice Company staff is highly trained and utilizes modern equipment to provide safeguards.  The Refrigeration System, that contains the regulated substance anhydrous ammonia, is used for the icemakers and related processes.  \n\n\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nSouthern California Ice Company policy is to conduct all operations in a safe and conscientious manner to prevent accidental releases of any hazardous material, including substances regulated through the Federal Accidental Release Prevention Program and OSHA PSM.  Southern California Ice Company trains its employees to properly handle and store hazardous materials to minimize the possibility of adversely affecting its worker's health, the workplace, the public, and the environment.  Southern California Ice Company Accidental Release Prevention policy is implemented through the management system contained in its RMP.\n\n\n\nIn the event of an emergency, Southern California Ice Company will contact the Los Angeles Fire Department to respond.  A designated emergency contact for the plant initiates emergency notifications.  All employees are trained in the proper procedures and their appropriate role in an emergency.  \n\n\n\n\n\nStationary Source and Regulated Substance\n\n\n\nThe Refrigeration System at the Southern California Ice Company is comprised of compressors, evaporative condensers, cooling towers, high-pressure receivers, accumulators and icemakers.  The Refrigeration System at Southern California Ice Company"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044744,
      "SummaryText": " provides the cooling medium for six icemakers.  The Refrigeration System contains anhydrous ammonia that continuously circulates through the system.  Vaporization of ammonia at different points of the system provides the needed cooling effect.  \n\n\n\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nSouthern California Ice Company has implemented a Process Safety Management (PSM) program to manage the safety aspects of the Refrigeration System.  In addition, common industry standards, policies, and procedures are utilized to ensure safe practices are being performed.  The program includes strict requirements for written operating procedures, personnel training, contractor safety, equipment maintenance, incident investigation, process hazard analysis, management of change and periodic review or audit of program elements.  Management of change element addresses proper implementation of system updates to ensure that all changes are reviewed properly by knowledgeable persons, all engineering documents and operating procedures reflect the change, and personnel are trained on the change.   Process Safety Management also requires a pre-startup safety review to ensure that the system is properly reviewed before it is put back into service after a major change.\n\n\n\n\n\nFive-Year Accident History\n\n\n\nThe five-year accident history (June 2009 to June 2014) for the Southern California Ice Company facility reveals that there were no reportable accidents during this period.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nSeveral process and management system improvements are being considered and implemented as a result of the technical studies done in the course of the development of the PSM and RMP Programs."
    }
  ]
}