{
  "FacilityID": 1000093799,
  "FacilityName": "All American Pet Proteins",
  "FacilityStr1": "259 30th Street",
  "FacilityStr2": null,
  "FacilityCity": "Greeley",
  "FacilityState": "CO",
  "FacilityZipCode": "80631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08123",
  "LEPC": "Weld County LEPC",
  "FacilityLatDecDegs": "40.387807",
  "FacilityLongDecDegs": "-104.683751",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "259 30th Street",
  "FacilityEmailAddress": "lsmith@aapetpros.com",
  "FacilityDUNS": 79376490,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "John Landers and Craig Broughton",
  "OperatorStr1": "259 30th Street",
  "OperatorStr2": null,
  "OperatorCity": "GREELEY",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80631",
  "OperatorZipCodeExt": null,
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000234356",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-05-14 16:29:58",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-05-14 16:29:58",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-05-14 16:29:58",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-05-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "2.64",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116393,
      "AltID": "Refrigerant (NH3)",
      "FacilityID": 1000093799,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145542,
          "ProcessID": 1000116393,
          "ChemicalID": 56,
          "Quantity": 12700.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000117806,
          "ProcessID": 1000116393,
          "NAICSCode": "311111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000093799,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-04-29 00:00:00",
    "ERTrainingDate": "2021-05-03 00:00:00",
    "CoordinatingAgencyName": "Greeley Fire Department",
    "CoordinatingAgencyPhone": "9703509500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093799,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\r\n1.1 Accidental release prevention and emergency response policies \r\nWe at All American Pet Proteins are committed to employee, public and environmental safety.  In our facility, we handle anhydrous ammonia, which is considered hazardous by United States Environmental Protection Agency.  Ammonia is used as a refrigerant to freeze product, it is necessary to observe safety precautions in handling anhydrous ammonia to prevent unnecessary human exposure, to reduce the threat to our personal health as well as our coworkers.\r\nWe have a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement controls to prevent the possible release of regulated substances.  Our emergency response procedure includes notification of the local fire authority and any potentially effected neighbors in a worst case release scenario.  Our onsite Anhydrous Ammonia Response Team addresses any releases. Access to the site is restricted to authorized plant employees, management personnel and contractors.  Our ammonia system is enclosed within the facility. It is our policy to adhere to all applicable Federal, State and Local rules and regulations.  Safety depends upon the manner in which we handle the anhydrous ammonia, combined with safety devices inherent in the design of the system, safe handling procedures, and training of our personnel.\r\n1.2 The stationary source and regulated substances handled\r\n1.2.1 General\r\nOur facilities primary activities are processing materials to be used as pet food protein; processing includes the grinding and combining of materials to use as protein additives for pet food. A high percentage of the product made at the facility is frozen and stored for later use or frozen and directly shipped to customers. The only regulated substance handled at this facility is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093799,
      "SummaryText": "Anhydrous Ammonia.  Ammonia is used to freeze product in our rapid product freezing process as well as keeping product frozen in our storage freezers. Ammonia is received by truck and pumped into our refrigerant system, there is no ammonia loss since we have a closed system, so refilling/resupplying ammonia to the system is not a frequent occurrence.  \r\nThe refrigeration process, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage and rapid product freezing.  Changes in pressure are directly related to changes in temperature.  For example, lowering the ammonia pressure lowers its temperature.  Low pressure (cold) liquid ammonia provides refrigeration by removing ambient heat.  Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize.  Heat is later removed from the ammonia as it is condensed back into a liquid.  The ammonia is stored in a specifically designed room and piped throughout certain areas of the facility to the process locations.  Our maximum capacity is 12,700 pounds. \r\n1.2.2 Chemical Properties\r\nThe regulated substance of concern, and the focus of this analysis is ammonia.  Anhydrous ammonia is a colorless gas or liquid with a very strong, intensely irritating odor. It has a Department of Transportation classification as a non-flammable gas but it does have explosion potential when mixed with air and the appropriate initiator is present.  This flammability range is very narrow, 15-25%.  Explosions, when they occur, are usually in confined spaces and require a high-energy initiator such as an electric arc.  The chemical properties of ammonia are shown below in Table 1:\r\n\r\nMolecular Formula\tNH3\r\nCAS Number\t7664-41-7\r\nMolecular Weight\t17.04\r\nBoiling Temperature (1 atm)\t239.7 K\r\nLiquid Density\t682.8 kg/m3\r\nVapor Den"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093799,
      "SummaryText": "sity (279.7 K @ 1 atm)\t0.742 kg/m3\r\nHeat of Vaporization\t1.367 x 106 J/kg\r\nTable 1: Chemical Properties of Ammonia\r\n1.2.3 Typical Hazards\r\n\r\nAmmonia is not a poison.  It has no cumulative toxic effects.  However, it has a powerful corrosive action when in contact with tissue that causes eye, mucous membrane, and systemic irritation by inhalation.  Inhalation of concentrated ammonia vapor could cause edema of the respiratory tract, spasm of the glottis, and asphyxia.  Treatment must be prompt to prevent death if exposed to high concentrations.  During emergency conditions, a positive pressure-demand, full facepiece, self-contained breathing apparatus (SCBA) or pressure-demand supply air respirator with escape (SCBA) and a fully-encapsulated, chemical resistant suit is required for response. Table 2 summarizes some of the health effects associated with exposure to ammonia.  For additional information, the Process Safety Information section of the PSM notebook provides detailed information regarding the health effects associated with exposure to ammonia.\r\n\r\n\r\nHealth Effect\tPPM Ammonia in Air by Volume\r\nOdor Threshold (detection)\t5\r\nOdor Threshold (recognition)\t50\r\nThroat Irritation\t400\r\nCough\t1700\r\nLife Threatening\t> 2000\r\nTable 2: Health Effects of Ammonia\r\n\r\nEmergency Response Planning Guidelines (ERPG) were developed to provide estimates of concentration ranges within which one can observe adverse health effects.  Also, exposure guidelines have been developed to assist with evacuation decision-making and are intended to guide emergency response.  The ERPG concentration level 2, as required by the RMP regulation, is used for this analysis. This concentration value is published by the American Industrial Hygiene Association (AIHA) and defined as follows:\r\nERPG-2:  the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093799,
      "SummaryText": "or symptoms which could impair an individual's ability to take protective action.\r\n1.3 The general accidental release prevention program and the specific prevention steps\r\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The process at our facility is subject to the OSHA PSM standard under 29 CFR 1910.119, but does qualify as a Program 1 eligible facility as defined in EPA's Title 40 §68.10(g). The facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\r\na.\tIIAR Bulletin 107, Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\r\nb.\tIIAR Bulletin 109, Minimum Safety Criteria for a Safe Ammonia Refrigeration System\r\nc.\tIIAR, A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\r\n\r\nIn addition, AAPP has implemented a Process Safety Management program for compliance with the OSHA 1910.119 regulation.\r\nThe processes in this facility were designed and constructed in accordance with good engineering practices to provide a safe system for our employees as well as our neighbors and environment.  In addition to using contracted experts for certain required system maintenance, we use third party ammonia system professionals to periodically inspect our ammonia system and to make any necessary adjustments to either equipment or procedures to continue to ensure safe handling and system integrity. \r\n1.4 Five-Year History\r\nThere have been no reportable accidental releases, injuries, or environmental damage resulting from our anhydrous ammonia system in at least the past 5 years.\r\n1.5 The Emergency Action/Response Plan:\r\nAAPP has a written Emergency Action/Response Plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid, medical treatment, evacu"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093799,
      "SummaryText": "ations, notification of local emergency response agencies and the public. To ensure proper functioning, our emergency response equipment is regularly inspected and serviced accordingly. AAPP has an Emergency Response Team that is trained on an annual basis.  All Emergency Response Team members are fit tested and respiratory trained annually. The plan is promptly updated to reflect any changes taking place within our processes that would require a modified emergency response.\r\n1.6 Planned changes to improve safety:\r\nThe latest hazard review of the anhydrous ammonia system was conducted on 5/13/2021.  All recommendations are in the process of being corrected, expected completion dates are within 6 months of findings."
    }
  ]
}