{
  "FacilityID": 1000036737,
  "FacilityName": "Reddy Ice-Nashville (336)",
  "FacilityStr1": "7261 Centennial Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Nashville",
  "FacilityState": "TN",
  "FacilityZipCode": "37209",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47037",
  "LEPC": "Nashville/Davidson Cnty OEM",
  "FacilityLatDecDegs": "36.184372",
  "FacilityLongDecDegs": "-086.881111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": "www.reddyice.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Reddy Ice Corporation",
  "Company2Name": null,
  "CompanyDUNS": 364514133,
  "Company2DUNS": 364514133,
  "OperatorName": "Reddy Ice Corporation",
  "OperatorStr1": "8750 North Central Expressway",
  "OperatorStr2": "Suite 1800",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75231",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": "37209RDDYC7261C",
  "EPAFacilityID": "100000182152",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-08-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Nashville 5-yr Resubmittal (10/13/08)",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-10-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-10-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-02-13 00:00:00",
  "DeRegistrationEffectiveDate": "2015-01-15 00:00:00",
  "AnniversaryDate": "2018-10-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 36.18194,
  "FRS_Long": -86.87889,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045005,
      "AltID": "Ice Manufacturing",
      "FacilityID": 1000036737,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054373,
          "ProcessID": 1000045005,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000045407,
          "ProcessID": 1000045005,
          "NAICSCode": "312113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000039177,
              "Process_NAICS_ID": 1000045407,
              "SafetyReviewDate": "2012-11-27 00:00:00",
              "PHA_Date": "2012-11-27 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-11-27 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Ammonia detection systems",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": "Ventilation system and Pressure Relief Valve diffusion tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-11-27 00:00:00",
              "TrainingReviewDate": "2012-11-27 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Technical Trade Schools",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-11-27 00:00:00",
              "EquipmentInspectionDate": "2013-10-08 00:00:00",
              "EquipmentTested": "Operational inspection of all equipment is completed daily.",
              "ChangeMgmtDate": "2010-05-01 00:00:00",
              "ChangeMgmtReviewDate": "2012-11-27 00:00:00",
              "PreStartupReviewDate": "2010-05-01 00:00:00",
              "ComplianceAuditDate": "2011-10-18 00:00:00",
              "AuditCompletionDate": "2012-10-18 00:00:00",
              "IncidentInvestigationDate": "2013-08-31 00:00:00",
              "InvestigationChangeDate": "2013-09-30 00:00:00",
              "ParticipationPlansReviewDate": "2011-10-18 00:00:00",
              "HotWorkPermitReviewDate": "2011-10-18 00:00:00",
              "ContractorSafetyReviewDate": "2011-10-18 00:00:00",
              "ContractorSafetyEvalDate": "2011-10-18 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Reddy Ice-Nashville (336) facility, located in Nashville, Tennessee, has developed a combined Process Safety Management/Risk Management (?PSM/RMP?) Program to address the accident prevention program requirements of both the OSHA and EPA regulations.  The purpose of the PSM/RMP Program is to make safe operations and accident prevention systematic throughout the facility.  The PSM/RMP Program contains thirteen elements, tied together by a management system to ensure development, implementation, and integration of the program requirements.  These thirteen elements consist of the following:  Employee Participation, Process Safety Information, Process Hazard Analysis, Pre-Startup Safety Review Program, Standard Operating Procedures, Training, Management of Change, Mechanical Integrity, Hot Work Permits, Contractor Qualifications, Incident Investigation, Compliance Audits, and Trade Secrets.\n\n\n\nReddy Ice corporate management and Reddy Ice-Nashville management are committed to operating safe and compliant facilities for the protection of its employees, the public, and the environment.  The facility has multiple safeguards pertinent to the ammonia refrigeration process.  These include an ammonia detection and alarm system, exhaust purge fans, pressure relief valves that discharge to a water-filled diffusion tank, controls that shut down the compressors if operating limits are exceeded, and the capability of shutting down the entire system if required.\n\n \n\nThe company has also developed an Emergency Action Plan (?EAP?) that includes procedures for notification of emergency authorities/agencies and the public, evacuation of personnel, and limited first responder duties by trained facility refrigeration personnel.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000046545,
                  "PreventionProgram3ID": 1000039177,
                  "ProcessChemicalID": 1000054373
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036737,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Metro Nashville Fire Dept",
    "CoordinatingAgencyPhone": "6158628600",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036737,
      "SummaryText": "PROCESS SUMMARY\n\nThe Reddy Ice-Nashville (336) facility located at 7261 Centennial Blvd., Nashville, TN 37209, manufactures potable ice for wholesale/retail distribution.  The facility utilizes anhydrous ammonia as a refrigerant for ice making and cold storage.  Reddy Ice-Nashville is an ice manufacturing facility, originally constructed in 1985, enlarged in 1994, again in 2000, and renovated in 2010. \n\n\n\nThe facility refrigeration system is a standard closed loop design consisting of compressors, condensers, pressure vessels, heat exchangers, and evaporators.  The system has numerous protective controls including:  motor overload, high and low temperature and pressure, low oil pressure, high and low liquid level cutouts, and pressure relief valves on all equipment that vent into a 20,000-gallon diffusion tank located outside the facility.  Ammonia detectors and alarms are installed throughout the plant.  System operation is monitored by a centralized PLC controls system.\n\n\n\nAn outside supplier delivers anhydrous ammonia to replenish the ammonia in the system as required.  Anhydrous ammonia, when properly used, has proven to be a safe and reliable refrigerant.  The sharp odor of ammonia provides its own warning agent.  Practically all accidents involving anhydrous ammonia can be avoided through the facility's program of proper employee training, knowledge of the equipment and procedures, and the development, maintenance, and implementation of effective operating and maintenance procedures for all ammonia equipment.\n\n\n\nThe Reddy Ice-Nashville facility is committed to operating a safe and compliant ammonia refrigeration system for the protection of its employees, the general public and the environment.  The facility has multiple safeguards pertinent to the anhydrous ammonia process.  These include:  an ammonia detection and alarm system, emergency ventilation systems, controls which shut down the compressors if operating limits are exceeded, and the capability of remo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036737,
      "SummaryText": "tely shutting the entire system down if required.  The company has developed an emergency action plan that includes procedures for notification of emergency authorities/agencies and the public, evacuation of personnel, and first responder duties by trained refrigeration personnel in the event of a release.\n\n\n\nRISK MANAGEMENT PREVENTION PROGRAM 3\n\nBased on the Reddy Ice-Nashville facility ammonia inventory, location, and requirement to meet OSHA Process Safety Management (\"PSM\") regulations, the facility is subject to the Accident Prevention Program 3 requirements.  The Accident Prevention Program is a way to make safe operations and accident prevention systematic throughout the facility.  Reddy Ice Corporate Management and Reddy Ice-Nashville management are committed to operating a safe and compliant facility for the protection of its employees, the general public, and the environment.  A combined Process Safety Management/Risk Management (\"PSM/RMP\") Program has been developed to meet the accidental release prevention regulation requirements of EPA's Risk Management Program (\"RMP\") (40 CFR Part 68) and OSHA's PSM (29 CFR 1910.119).  The PSM/RMP Program contains thirteen elements, establishing requirements for employee participation, process safety information, process hazard analysis, pre-startup safety review, operating procedures, training, management of change, mechanical integrity, hot work permits, contractors, incident investigation, compliance audits, and trade secrets.  These elements are tied together by a management system to ensure development, implementation, and integration of the Program requirements.\n\n\n\nMANAGEMENT SYSTEM\n\nA management system has been developed to oversee the implementation of the PSM/RMP Program elements.  The Plant Manager has been identified as facility's PSM/RMP Coordinator, with overall responsibility for developing, implementing and integrating the Program requirements.  The Maintenance Lead has responsibility for portions of the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036737,
      "SummaryText": " program closely tied to the refrigeration equipment and operation.  An established safety committee meets each month to present a safety meeting and address any safety issues brought up by employees during the month.\n\n\n\nHAZARD ASSESSMENT\n\nAs required by the RMP regulations, the Reddy Ice-Nashville facility has conducted offsite consequence analyses (\"OCA\") relative to the potential accidental release of ammonia.  The OCA describe the potential offsite exposure to surrounding areas from an accidental release.  A worst-case release scenario and alternative release scenarios were developed and calculated using the EPA RMP*Comp modeling program, and the potentially affected offsite population and facilities were identified.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Reddy Ice-Nashville facility has not had any releases that would require reporting as part of a five-year accident history.\n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\nThe Reddy Ice-Nashville facility operates under an Emergency Action Plan (\"EAP\") that includes procedures for:  notifying the public and local emergency responders, emergency evacuation/response procedures, use of emergency alarms and equipment, employee training in evacuation and response procedures, first aid for ammonia exposure, and periodic review and updating of the emergency action plan.  The plan is reviewed regularly for verification of data, and revised and updated as necessary to reflect changes in facility operations and personnel.\n\n\n\nAs required, the facility has coordinated emergency response activities with the Davidson County LEPC and the Nashville Metro Fire Department and has appropriate mechanisms in place to notify emergency responders if needed.  The ammonia inventory is verified and reported annually to the state and local authorities, and the plant is incorporated into the community emergency response plan developed under 42 USC.\n\n\n\nPLANNED CHANGES\n\nNo significant changes are planned to the facility or operations.  Reddy Ice facilities"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036737,
      "SummaryText": " operate an ongoing program of preventive and predictive maintenance to identify and implement changes that may result in improved safety and operations.\n\n"
    }
  ]
}