{
  "FacilityID": 1000010249,
  "FacilityName": "Kettleman Compressor Station",
  "FacilityStr1": "34453 Plymouth Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Avenal",
  "FacilityState": "CA",
  "FacilityZipCode": "93204",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06031",
  "LEPC": "Kings County Fire Department",
  "FacilityLatDecDegs": "36.071236",
  "FacilityLongDecDegs": "-120.086780",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6912877,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 6912877,
  "Company2DUNS": 0,
  "OperatorName": "Pacific Gas and Electric Company",
  "OperatorStr1": "77 Beale St.",
  "OperatorStr2": "P.O. Box 770000",
  "OperatorCity": "San Francisco",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94177",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jess Borrego",
  "RMPTitle": "Gas Maintenance Supervisor",
  "FTE": 18,
  "OtherEPAFacilityID": "CAT080011604",
  "EPAFacilityID": "100000208893",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "C-904",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-08-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-08-12 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-08-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2015-09-29 00:00:00",
  "DeRegistrationEffectiveDate": "2014-12-18 00:00:00",
  "AnniversaryDate": "2014-08-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Threshold limit for ammonia is 20% concentration. Kettleman has only 19%.",
  "_processes": [
    {
      "ProcessID": 1000012103,
      "AltID": "SCR Unit",
      "FacilityID": 1000010249,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000012537,
          "ProcessID": 1000012103,
          "NAICSCode": "22121",
          "_desc": {
            "NAICS_CODE": "22121",
            "NAICS_DESCRIPTION": "Natural Gas Distribution"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000013982,
          "ProcessID": 1000012103,
          "ChemicalID": 57,
          "Quantity": 82300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000513982,
          "ProcessID": 1000012103,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000010249,
      "SummaryText": "Pacific Gas & Electric CompanyA?s (PG&E) Kettleman Compressor Station is one of a series of stations along PG&EA?s Line 300, which transports natural gas from the southeastern to the central and northern areas of California.  The station encompasses approximately 85 acres and is located adjacent to Interstate 5, approximately 5 miles northeast of Avenal, California.  The station has been in operation since 1929, and from 1952 to 2001 the station used 13 reciprocating engines to achieve a total throughput capacity of 1.4 billion cubic feet per day.  In 2001, the reciprocating engines were replaced with air-cooled turbines.\n\nIn August 1994, the San Joaquin Valley Air Pollution Control District (SJVAPCD) adopted Rule 4703 to comply with the requirements of the California Clean Air Act for Best Available Retrofit Control Technology (BARCT) to limit the emissions of oxides of nitrogen (NOx) from stationary gas turbines.  To meet the provisions and requirements of Rule 4703 and subsequent amendments thereto, PG&E proposes to retrofit the existing gas turbines by installing Selective Catalytic Reduction (SCR) technology to meet the NOx compliance limits.  The SCR process utilizes ammonia to decompose the NOx and meet the emissions compliance limits.  \n\nAqueous ammonia is listed by the U.S. Environmental Protection Agency (EPA) and the Occupational Safety and Health Administration (OSHA) as a toxic substance.  Because the ammonia will be present in quantities that exceed the regulatory threshold of 500 pounds, PG&E is required to prepare a risk management plan (RMP) in accordance with California Accidental Release Program (CalARP) and Kings County Department of Public Health (KCDPH) regulations and guidelines.  \n\nIn January 2009, an offsite consequence analysis (OCA) was performed to determine the RMP program level applicable to the SCR process, and the results were submitted to KCDPH.  Upon review of the OCA report, KCDPH concurred with the findings of the OCA that the SCR"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000010249,
      "SummaryText": " process at the Kettleman Station meets the eligibility requirements of Program 1, provided that: (1) the emergency response procedures are coordinated with the Kings County Fire Department, and (2) the covered process complies with the requirements of California Code of Regulations (CCR) Title 19, section 2735.4. \n\nThe CalARP regulations also require that a 5-year accident history for the covered process be complete as specified in section 2750.9 and submitted with the RMP under section 2745.5.  Since the SCR unit and associated ammonia storage tank is a new installation, there is no existing release or accident history associated with the covered process. \n\nThe Kettleman Compressor Station has a well defined and established emergency response program to address incidents that may occur at the facility.  Accidental release prevention and response procedures include administrative measures such as supervision during operation of above-ground storage tanks (e.g. fill and liquid transfer), regular visual inspection for leaks and assessment of equipment and pipe integrity, specialized training for spill prevention and control procedures and safe operation of equipment in spill prone areas, and documentation of training and inspection activities. \n\nEngineering controls such as secondary containment and automatic leak detectors will be installed at the aqueous ammonia storage tank and throughout the SCR process for early release detection and accident prevention.  All response procedures and preventative measures are detailed in the current Emergency Action Plan (EAP) and Hazardous Materials Business Plan (HMBP) for the facility.  In the event of an emergency, facility personnel are instructed to contact one of PG&EA?s emergency response contractors.  All response actions will be coordinated with designated local emergency planning and response agencies in Kings County as defined in this RMP and PG&EA?s Hazardous Materials Business Plan (updated July 2009).\n"
    }
  ]
}