{
  "FacilityID": 1000062184,
  "FacilityName": "Hugoton Station",
  "FacilityStr1": "1400 Cemetery Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Hugoton",
  "FacilityState": "KS",
  "FacilityZipCode": "67951",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20189",
  "LEPC": "Stevens County LEPC",
  "FacilityLatDecDegs": "37.166958",
  "FacilityLongDecDegs": "-101.326539",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Merit Energy Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Merit Energy Company",
  "OperatorStr1": "13727 Noel Rd",
  "OperatorStr2": "Suite 1200",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75240",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230617",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1890015",
  "SafetyInspectionDate": "2015-06-09 00:00:00",
  "SafetyInspectionBy": "Kansas Department of Health and Environment",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-02-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-02-13 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-02-13 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-02-13 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 37.16772,
  "FRS_Long": -101.32996,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077954,
      "AltID": "Natural Gas Processing",
      "FacilityID": 1000062184,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096942,
          "ProcessID": 1000077954,
          "ChemicalID": 155,
          "Quantity": 254100.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000085555,
              "ProcessChemicalID": 1000096942,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000085556,
              "ProcessChemicalID": 1000096942,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000085557,
              "ProcessChemicalID": 1000096942,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000085558,
              "ProcessChemicalID": 1000096942,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000085552,
              "ProcessChemicalID": 1000096942,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000085553,
              "ProcessChemicalID": 1000096942,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000085554,
              "ProcessChemicalID": 1000096942,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000079156,
          "ProcessID": 1000077954,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000065537,
              "Process_NAICS_ID": 1000079156,
              "SafetyReviewDate": "2015-08-25 00:00:00",
              "PHA_Date": "2015-08-25 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-11-02 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Lightning strikes",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Pressurized vessels are rated for anticipated pressures",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Pressurized vessels are rated for anticipated pressures",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Fire eyes in LSV and 165 engine room, gas monitoring in engine rooms, carbon monoxide detection in generator room, personal H2S monitors for employees",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-03-15 00:00:00",
              "TrainingReviewDate": "2016-03-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-09-24 00:00:00",
              "EquipmentInspectionDate": "2015-09-22 00:00:00",
              "EquipmentTested": "Stabilizer and storage tanks",
              "ChangeMgmtDate": "2015-08-25 00:00:00",
              "ChangeMgmtReviewDate": "2015-08-25 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2014-09-24 00:00:00",
              "AuditCompletionDate": "2014-10-13 00:00:00",
              "IncidentInvestigationDate": "2013-07-01 00:00:00",
              "InvestigationChangeDate": "2014-09-19 00:00:00",
              "ParticipationPlansReviewDate": "2016-11-01 00:00:00",
              "HotWorkPermitReviewDate": "2016-11-10 00:00:00",
              "ContractorSafetyReviewDate": "2016-11-01 00:00:00",
              "ContractorSafetyEvalDate": "2016-11-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000081076,
                  "PreventionProgram3ID": 1000065537,
                  "ProcessChemicalID": 1000096942
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000062184,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-11-01 00:00:00",
    "ERTrainingDate": "2016-11-01 00:00:00",
    "CoordinatingAgencyName": "Hugoton Fire Department",
    "CoordinatingAgencyPhone": "6205444396",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062184,
      "SummaryText": "on. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team. Employees have access to all information created as part of the station's accident prevention program. Specific ways that employees are involved in the accident prevention program are documented in an employee participation plan that is part of the PSM program. This program as well as the other documentation is maintained at office onsite. In addition, the PSM program requires that process and employee safety issues be addressed as part of normal operations. These include development of standardized operating procedures, incident investigation, participation in flow sheet reviews, management of change, and safe work practices.\r\n\r\nProcess Safety Information\r\n\r\nMerit Energy Company keeps a variety of technical documents that are used to help maintain safe operation of the process. These documents address chemical properties and associated hazards, limits for key process parameters, and equipment design basis/configuration information. The Operations department has been assigned responsibility for maintaining up-to-date process safety information. The location of these documents is readily available to help employees locate any necessary process safety information. Chemical-specific information, including exposure hazards and emergency response/exposure treatment consideration, is provided in Safety Data Sheets (SDSs). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals. Hugoton Station Natural Gas Compressor facility has documented safety related limits for specific process parameters in operating manuals. Hugoton Station Natural Gas Compressor facility ensures that the process is maintained within these limits using process controls and monitoring instruments, highl"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062184,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nAccidental Release Prevention and Response Policies\r\n\r\nMerit Energy Company has a long standing commitment to worker and public safety. Our commitment is supported by the resources invested in accident prevention, personnel training and the consideration of safety issues in the design, construction, operation, and maintenance of our facilities. Our policy is to implement reasonable controls to provide a safe operation and prevent foreseeable releases of regulated substances. However, if a release does occur, trained compressor station personnel will respond to control and contain the release. All pressures and flows at this facility are monitored 24 hrs. /day at our Integrated Operations Control site located in Liberal, KS.\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\n\r\nMerit Energy Company owns and operates the Hugoton Station Natural Gas Compressor facility located in half mile east of Hugoton on Highway 51. The Hugoton Station Natural Gas Compressor facility is regulated by the OSHA Process Safety Management program because of the total quantity of a highly hazardous substance (natural gas) which exceeds the 10,000 pound threshold, it is a manned facility and is in close proximity of a population center as specified by the Standard Code of Federal Regulation, Title 29, Part 1910.119. The facility is also subject to the EPA RMP Standard.\r\n\r\nThe operation of the Hugoton Station Natural Gas Compressor facility is to take natural gas from field compression in the surrounding fields and remove liquids present in the gas stream. Natural gas is then compressed and discharged into sales pipelines leaving the facility. Hugoton Station Natural Gas Compressor facility currently processes approximately 47 MMCF of natural gas daily.\r\n\r\nNGL liquids are transported to the Hugoton facility by truck and unloaded into product storage tank MBJ-1017.  The NGL product is pumped through a condensate stabilizer process creating a low vapor pres"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062184,
      "SummaryText": "sure product.  The low pressure stabilized condensate is routed to product storage tank MBJ-1018 where it is loaded by truck and removed from location.  The remaining NGL product from the stabilizer is routed to product storage tank MBJ-1019 and also removed from site via truck.\r\n\r\nHistory and Ownership\r\n\r\nThis Hugoton Station Natural Gas Compressor facility was built and put into service in 1945 by Panhandle Eastern Pipeline Company. Since then, the facility has periodically had engines and other equipment put into service as operations required with the last engine installed in 1973. Anadarko Petroleum Corporation purchased the facility in March of 1996, and Merit Energy Company purchased the property in 2016.\r\n\r\nOffsite Consequence Analysis Results\r\n\r\nThis narrative section has been deleted as directed by regulation; however, there are public receptors within the predicted worst case 1 psi over-pressure radius as calculated using the EPA RMP Comp: Analysis program, making this a Program Level 3 facility. As a Program Level 3 facility, the secondary calculation for a more likely release was determined using a failed load hose during loading operations from the storage tanks on site. The release was calculated to be a 5 minute flow from a 4\" load hose before the system could be shut in and isolated - resulting in a 0.08 mile ROE.\r\n\r\nAccidental Release Prevention Program\r\n\r\nThe following is a summary of the accident prevention program in place at the plant. The processes at the plant are regulated by the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) and Occupational Safety, and Health Administration's (OSHA's) Process Safety Management (PSM) standard. The following summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\nEmployee Participation\r\n\r\nMerit Energy Company requires employees to participate in all facets of process management and accident preventi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062184,
      "SummaryText": "y trained personnel, and protective instrument systems (e.g., automated shutdown systems) as well as remote monitoring of pressures and flows into and out of the facility.\r\n\r\nMerit Energy Company maintains technical documentation that provides information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information in combination with written procedures and trained personnel provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\nProcess Hazard Analysis (PHAs)\r\n\r\nMerit Energy Company has a comprehensive program to ensure that hazards associated with the various processes are identified and controlled. The station and its components are systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. Merit Energy Company uses the What If/Checklist or HAZOPS methods of performing process hazard analyses (PHAs) to evaluate the hazards associated with the process. These PHAs are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures. The team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. If necessary, the PHA team findings are forwarded to local and corporate management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk taking assigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention.\r\n\r\nTo help ensure that the process controls and/or process hazards d"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000062184,
      "SummaryText": "o not eventually deviate significantly from the original design safety features, the Hugoton Station Natural Gas Compressor facility periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained at the office onsite.\r\nOperating Procedures\r\n\r\nThe Hugoton Station Natural Gas Compressor facility maintains written procedures that address various modes of process operations, such as startup, normal operations, emergency shutdown and normal shutdown. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed to ensure they are current and accurate. The procedures are also kept current and accurate by revising them as necessary to reflect changes made through the management of change process.\r\n\r\nTraining\r\n\r\nTo complement the written process operating procedures, Hugoton Station Natural Gas Compressor facility has a comprehensive training program for all employees involved in operating a process. New employees receive basic training if they are not already familiar with such operations. After successfully completing training, a new operator is paired with a senior operator to learn process specific duties and tasks. After operators demonstrate the knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years. All training is documented for each operator, including the means used to verify the operators understanding of the training.\r\n\r\nContractors\r\n\r\nMerit Energy Company uses"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000062184,
      "SummaryText": "contractors to supplement its work force during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, Merit Energy Company has procedures in place to ensure that contractors:\r\n¿\tperform their work in a safe manner\r\n¿\thave the appropriate knowledge and skills\r\n¿\tare aware of the hazards in their workplace\r\n¿\tunderstand what they should do in the event of an emergency\r\n¿\tunderstand and follow site safety rules\r\n¿\tinform facility personnel of any hazards that they find during their work\r\n¿\tknow and use \"Stop Work\" authority if conditions or activities warrant\r\n¿\tThis is accomplished by providing contractors with:\r\no\tprocess overview\r\no\tinformation about safety and health hazards\r\no\temergency response plan requirements\r\no\tsafe work practices prior to their beginning work\r\no\tsafe and hot work permits as required\r\nIn addition, Merit Energy Company has a program in place that evaluates contractor safety programs and performance during the selection of a contractor. No contractor is allowed to perform work at the facility unless the requirements of this evaluation process have been met.\r\n\r\nPre-Startup Safety Reviews (PSSRs)\r\n\r\nThe Hugoton Station Natural Gas Compressor facility conducts a PSSR for any new equipment or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and that all systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves as a quality assurance mechanism by requiring verification that accident prevention requirements are properly implemented.\r\n\r\nMechanical Integ"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000062184,
      "SummaryText": "rity (Ml)\r\n\r\nMerit Energy Company has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps, heat exchangers, compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include:\r\n¿\tconducting training\r\n¿\tdeveloping written procedures\r\n¿\tperforming inspections and tests\r\n¿\tcorrecting identified deficiencies, and\r\n¿\tapplying quality assurance measures\r\nIn combination, these activities form a system that maintains the mechanical integrity of the process. These activities are tracked and documented using SAP PM.\r\nMaintenance personnel receive training on:\r\n¿\tan overview of the process\r\n¿\tsafety and health hazards\r\n¿\tapplicable maintenance procedures\r\n¿\temergency response plans\r\n¿\tapplicable safe work practices to help ensure that they can perform their jobs in a safe manner\r\nWritten procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to verify that equipment parameters are within acceptable limits. For a vessel, the parameter being monitored would typically be wall thickness. If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible) or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\r\n\r\nSafe Work Practices\r\n\r\nMerit Energy Company has long-standing safe work practices in place to help ensure worker and process safety. Examples of these include:\r\n¿\tcontrol of the entry/presence/exit of support personnel\r\n¿\ta lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance\r\n¿\tprocedures for safe removal of hazardous substances before process piping or equipment is opened\r\n¿\tHot Work permit to control spark producing activities\r\n¿\tpermit and procedure to ensu"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000062184,
      "SummaryText": "re that adequate precautions are in place before entry into a confined space\r\nThese procedures along with training of affected personnel form a system to help ensure that operations and maintenance activities are performed safely.\r\nManagement of Change (MOCs)\r\nMerit Energy Company has a comprehensive system to manage changes to all covered processes. This system requires that changes to items such as process equipment, chemicals, technology, procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to:\r\n¿\tensure that adequate controls are in place to manage any new hazards\r\n¿\tverify that existing controls have not been compromised by the change\r\n¿\tensure that changes do not introduce an unknown hazard to the process\r\nAffected chemical hazard information, process-operating limits, and equipment information, as well as procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are provided necessary training on the change.\r\n\r\nIncident Investigation\r\n\r\nMerit Energy Company promptly investigates all incidents that resulted in, or reasonably could have resulted in a fire/explosion, major property damage, or significant environmental loss or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence and forwards these results to management for resolution. The final resolution of each finding or recommendation is documented and the investigation results reviewed with all employees who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs.\r\n\r\nCompliance Audits\r\n\r\nTo guarantee that the accident prevention program is functioning properly, Merit Energy Company conducts au"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000062184,
      "SummaryText": "dits to determine that the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. Both hourly and staff personnel participate as audit team members. The audit team develops findings that are forwarded to management for resolution.\r\n\r\nChemical Specific Prevention Steps\r\n\r\nThe processes at the Hugoton Station Natural Gas Compressor facility have hazards that must be managed to ensure continued safe operation. The following sections describe existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\n\r\nUniversal Prevention Activities\r\n\r\nThe accident prevention program summarized previously is applied to all RMP covered processes at the Hugoton Station Natural Gas Compressor facility. Collectively these prevention program activities help prevent potential accident scenarios that could be caused by equipment failure and human errors.\r\n\r\nSpecialized Safety Features\r\n\r\nThe Hugoton Station Natural Gas Compressor facility has safety features to help 1) contain/control a release, 2) quickly detect a release, and 3) reduce the consequence of a release. The following types of safety features are used in the covered processes:\r\n¿\tRelease Detection - Hydrocarbon detectors with alarms\r\n¿\tRemote monitoring during periods when the facility is un-occupied, coupled with remote control capability to block the inlet and outlet of gas to and from the facility\r\n¿\tRelease Containment/Control - Process relief valves that discharge to a flare which will capture and incinerate episodic releases\r\n¿\tValves to permit isolation of portions or the entire process\r\n¿\tOn-site power generation to minimize the chances for a loss of power to critical systems\r\n¿\tAutomated shutdown systems for specific process parameters\r\n¿\tCurbing or diking to contain liquid releases\r\n¿\tRedundant equipment and instrumentation\r\n¿\tAtmospheric relief devices\r\n¿\tOverall plant and"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000062184,
      "SummaryText": "local are ESDs\r\n¿\tComputer controlled and interlocked processes\r\n¿\tRelease Mitigation - Manually operated fire-extinguishing systems\r\n¿\tTrained emergency response personnel\r\n¿\tPersonal Protective Equipment (PPE)\r\n\r\nFive-Year Accident History\r\n\r\nIn the last five years, there have not been any incidents that did or could have resulted in a catastrophic release as defined by the RMP or PSM standard.\r\n\r\nEmergency Response Program Information\r\n\r\nThe Hugoton Station Natural Gas Compressor facility maintains a written emergency response program, which is in place to protect worker and public safety and the environment. The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup. In addition, the facility has procedures that address maintenance, inspection and testing of emergency equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. The emergency response program is updated when necessary based on modifications made to the facility. The emergency response program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes.\r\n\r\nThe overall emergency response program of the Hugoton Station Natural Gas Compressor facility is coordinated with the Hugoton Fire Department and Stevens County Local Emergency Planning Committee (LEPC). This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives. The Hugoton Station Natu"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000062184,
      "SummaryText": "ral Gas Compressor facility has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations. This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to emergencies. Merit Energy Company conducts periodic emergency drills that involve the local emergency response organizations and employees.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nAll of the procedures in place at the facility undergo a complete review annually to assure that they are consistent with the safety design and operation of the process. Any changes made to the procedures are documented and all employees are retrained before allowing them to operate that portion of the process. All safety programs affecting the facility will be reviewed in 2015 to assure they meet the requirements of the regulations as well as provide the training to facility personnel to assure the facility staff have the knowledge to follow them. The facility also holds annual training on the emergency response plan. This training has included the local emergency response groups including, local ambulance services and local fire departments. These training sessions are audited by company safety personnel."
    }
  ]
}