{
  "FacilityID": 1000101234,
  "FacilityName": "Meeker Cryogenic Plant",
  "FacilityStr1": "27991 County Road 5",
  "FacilityStr2": null,
  "FacilityCity": "Rifle",
  "FacilityState": "CO",
  "FacilityZipCode": "81650",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08103",
  "LEPC": "Rio Blanco County LEPC",
  "FacilityLatDecDegs": "39.955083",
  "FacilityLongDecDegs": "-108.316944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www. enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Enterprise Gas Processing, LLC",
  "Company2Name": null,
  "CompanyDUNS": 45779977,
  "Company2DUNS": null,
  "OperatorName": "Enterprise Products Operating, LP",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199821",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-07-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "June 2007 Initial Filing",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-03-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-06-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-06-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-06-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 39.910727,
  "FRS_Long": -108.294316,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000125584,
      "AltID": "Natural Gas Processing",
      "FacilityID": 1000101234,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000156949,
          "ProcessID": 1000125584,
          "ChemicalID": 98,
          "Quantity": 36000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000156950,
          "ProcessID": 1000125584,
          "ChemicalID": 155,
          "Quantity": 110000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000138865,
              "ProcessChemicalID": 1000156950,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000138866,
              "ProcessChemicalID": 1000156950,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000138867,
              "ProcessChemicalID": 1000156950,
              "ChemicalID": 93
            }
          ]
        },
        {
          "ProcessChemicalID": 1000157011,
          "ProcessID": 1000125584,
          "ChemicalID": 155,
          "Quantity": 14000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000138874,
              "ProcessChemicalID": 1000157011,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000138875,
              "ProcessChemicalID": 1000157011,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000138876,
              "ProcessChemicalID": 1000157011,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000138877,
              "ProcessChemicalID": 1000157011,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000138878,
              "ProcessChemicalID": 1000157011,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000138879,
              "ProcessChemicalID": 1000157011,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000138880,
              "ProcessChemicalID": 1000157011,
              "ChemicalID": 118
            }
          ]
        },
        {
          "ProcessChemicalID": 1000157012,
          "ProcessID": 1000125584,
          "ChemicalID": 155,
          "Quantity": 640000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000138868,
              "ProcessChemicalID": 1000157012,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000138869,
              "ProcessChemicalID": 1000157012,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000138870,
              "ProcessChemicalID": 1000157012,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000138871,
              "ProcessChemicalID": 1000157012,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000138872,
              "ProcessChemicalID": 1000157012,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000138873,
              "ProcessChemicalID": 1000157012,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000126979,
          "ProcessID": 1000125584,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101234,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Rio Blanco County Sheriff's Office",
    "CoordinatingAgencyPhone": "9708789620",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000101234,
      "SummaryText": "udes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives.  The Meeker Cryogenic Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the Meeker Cryogenic Plant conducts periodic emergency drills that involve the LEPC and emergency response organizations, and also provides periodic refresher training to local emergency responders regarding the hazards of regulated substances in the plant.  \r\n\r\nPlanned Changes to Improve Safety\r\n\r\nThe Meeker Cryogenic Plant Terminal resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Meeker Cryogenic Plant Terminal.\r\n\r\n* No changes are planned."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000101234,
      "SummaryText": "Terminal video surveillance system\r\n\r\nRelease Containment and Control\r\n\r\n* Process relief valves that discharge to a flare to capture and incinerate episodic releases\r\n* Valves to permit isolation of the process (manual or automated).\r\n* Automatic shutdown systems for specific process parameters (e.g., high pressure).\r\n* Secondary containment to contain any release of liquid chemicals\r\n* Redundant equipment and instrumentation where advisable\r\n* Dual mechanical seals with seal failure alarms installed on hydrocarbon liquid pumps.\r\n* Storage tank internal emergency shut down and excess flow valves\r\n* Atmospheric relief devices \r\n\r\nRelease Mitigation\r\n\r\n* Hand-held fire extinguishers \r\n* Personnel trained in emergency response and procedures.\r\n* Personnel protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus, etc.)\r\n\r\nFive Year Accident History\r\n\r\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\r\n\r\nThis facility has not had an accidental release in the last five years which meets the criteria set forth in 40 CFR 68.10.\r\n\r\nEmergency Procedures Information\r\n\r\nThe Meeker Cryogenic Plant maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.  \r\n\r\nThe overall emergency procedure program for the Meeker Cryogenic Plant is coordinated with the Rio Blanco County Local Emergency Planning Committee (LEPC).  This coordination incl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101234,
      "SummaryText": "n the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\r\n\r\nGeneral Accidental Release Prevention Program\r\n\r\nThe following is a summary of the accidental release prevention program in place at Meeker Cryogenic Plant Terminal.  The process at the facility is regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1).  Release prevention is provided through the use of written operating procedures, employee training in written procedures, including normal operation and emergency release procedures, and in the design of safety and release prevention equipment installed at the terminal site.  In addition, a written safety program designed to comply with all applicable OSHA safety performance regulations is strictly enforced at all Enterprise facilities, including the Meeker Cryogenic Plant Terminal facility.  As part of the Enterprise safety program, the facility utilizes procedures that are included in the Enterprise program, but may not specifically be required at non-PSM and/or RMP Program 1 facilities (e.g. Safe work practice training; safe work permitting and hot work permitting).\r\n\r\nUniversal Prevention Activities\r\n\r\nThe accident prevention program summarized previously is applied to all RMP covered processes at Meeker Cryogenic Plant Terminal.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\nSpecialized Safety Features\r\n\r\nThe Meeker Cryogenic Plant Terminal has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\r\n\r\nRelease Detection\r\n\r\n* Hydrocarbon (hazardous gas) detectors and alarms\r\n* Flame detection equipment in the storage and loading areas\r\n*"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101234,
      "SummaryText": "and stabilized.  The gas from the slug catcher is primarily processed utilizing a turbo expander based cryogenic process to remove recoverable natural gas liquids.  Finished products are residual natural gas and extracted hydrocarbon liquids which are removed from the plant by pipeline systems.  A gas dew point control plant, utilizing propane refrigeration to remove a minimal amount of natural gas liquids, is available for use to process a portion of the inlet gas stream if desired.  \r\n\r\nThe Natural Gas Processing process is regulated by Federal OSHA 29 CFR 1910.119 and 40 CFR Part 68.  We have entered the facility as an RMP Program Level 1 facility.\r\n\r\nToxics\r\n\r\nThere are no toxic materials contained on site above the threshold limits.\r\n\r\nFlammables\r\n\r\nThe Meeker Cryogenic Plant was evaluated to determine if any regulated flammable exceeded the threshold quantity.  Enterprise identified the regulated substances and quantities kept on site based on process knowledge.\r\n\r\nListed flammable substances which are stored above the threshold quantities at the Meeker Cryogenic Plant are residue natural gas (primarily methane), ethane, propane, iso-butane, normal butane, iso-pentane and pentane.  These flammables are present in differing compositions in the inlet natural gas,  processed residue gas and recovered liquid hydrocarbon product. A pure propane stream is also present and is used as a refrigerant in the dew point control unit.  Hydrogen Sulfide may be present in the gas processing equipment, but the total quantity that may be on site is below the threshold quantity specified in the RMP Rule.\r\n\r\nField condensate liquids and stabilized field liquid condensate are also collected and stored at the facility prior to stabilization or shipment, but these liquids are exempt from coverage under the RMP regulation due to their naturally occurring nature or low vapor pressure.  \r\n\r\nOffsite Consequence Analysis Results\r\n\r\nThe offsite consequence analysis will not be reflected i"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101234,
      "SummaryText": "Meeker Cryogenic Plant\r\nEnterprise Products Operating LLC\r\nExecutive Summary\r\nRisk Management Plan\r\nEPA Identifier:  1000 0019 9821\r\n\r\nAccidental Release Prevention and Response\r\n\r\nAt Enterprise, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\r\n\r\n* A description of our facility and use of substances regulated by EPA's RMP regulation\r\n* An overview of our accidental release prevention programs\r\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\r\n* An overview of our emergency response program\r\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\n\r\nThe Meeker Cryogenic Plant located in Rio Blanco County, Colorado is owned by Enterprise Gas Processing L.L.C. and is operated by Enterprise Products Operating, LLC\r\n\r\nThe Meeker Cryogenic Plant is an integrated gas processing, hydrocarbon liquid recovery and residue gas delivery facility.  The plant is designed to utilize the cryogenic turbo expander process to recover natural gas liquids from the inlet gas, and is assembled from prefabricated, skid-mounted process components and some individual foundation mounted equipment.  Produced natural gas is delivered to the facility from a gas gathering system and inlet gas pipeline.  The gas passes through an inlet slug catching facility where liquids that condense in the gas gathering system are separated"
    }
  ]
}