{
  "FacilityID": 1000023076,
  "FacilityName": "Halley Plant",
  "FacilityStr1": "2256 CR 404",
  "FacilityStr2": null,
  "FacilityCity": "Kermit",
  "FacilityState": "TX",
  "FacilityZipCode": "79745",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48495",
  "LEPC": "Winkler County LEPC",
  "FacilityLatDecDegs": "31.7302",
  "FacilityLongDecDegs": "-102.9929",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8016495,
  "ParentCompanyName": "La Grange Acquisitions, LLC",
  "Company2Name": null,
  "CompanyDUNS": 8016495,
  "Company2DUNS": 0,
  "OperatorName": "La Grange Acquisitions, LLC",
  "OperatorStr1": "800 E. Sonterra Blvd",
  "OperatorStr2": "Suite 400",
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78258",
  "OperatorZipCodeExt": "3941",
  "RMPContact": "Tacho Minjarez",
  "RMPTitle": "Operations Manager",
  "FTE": 12,
  "OtherEPAFacilityID": "TXD980352686",
  "EPAFacilityID": "100000214699",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "SOP #03254",
  "SafetyInspectionDate": "2009-03-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-08-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-08-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-08-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000028184,
      "AltID": "Natural Gas Liquid Extrac",
      "FacilityID": 1000023076,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000028486,
          "ProcessID": 1000028184,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000033708,
          "ProcessID": 1000028184,
          "ChemicalID": 98,
          "Quantity": 109272.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000033709,
          "ProcessID": 1000028184,
          "ChemicalID": 155,
          "Quantity": 27548.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 106944,
              "ProcessChemicalID": 1000033709,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 106945,
              "ProcessChemicalID": 1000033709,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 106946,
              "ProcessChemicalID": 1000033709,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 106947,
              "ProcessChemicalID": 1000033709,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 106948,
              "ProcessChemicalID": 1000033709,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 106949,
              "ProcessChemicalID": 1000033709,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 106950,
              "ProcessChemicalID": 1000033709,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000533708,
          "ProcessID": 1000028184,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000533709,
          "ProcessID": 1000028184,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023076,
      "SummaryText": "Energy Transfer\n\nHalley Gas Plant\n\nExecutive Summary RMP\n\n\n\nEnergy Transfer is a publicly held company that has been in the gas processing business for more than 50 years.  Energy Transfer operates natural gas processing plants in Southeast New Mexico and West Texas.    The Halley gas plant has a commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, trained operating personnel will respond to control and contain the release.  \n\n\n\nThis facility receives gas from the MiVida Plant, which receives gas from surrounding oil and gas fields.  Gas is received at the Halley facility with the Carbon dioxide and water removed.  The natural gas liquids as well as the compressed natural gas are then transported from the facility through pipelines to third party customers. The only compound present at the facility that contains substances regulated under the Risk Management Program (RMP) in amounts greater than threshold quantity is de-methanized natural gas liquids (NGL) which is reported as a flammable mixture.  The RMP-regulated substances found in NGL are ethane, propane, butane, isobutane, and pentane.  \n\n\n\nBecause there are no public receptors within the distance of the endpoint of worst case scenario, there have been no release of a regulated substance within the last five years and emergency response activities are coordinated with local responders, the facility is classified as Program Level 1 under the regulation.  The purpose of this Risk Management Plan (RMPlan) is to provide information about our operations at the facility, our programs to prevent accidental chemical releases, our emergency response plans in case an accidental release should"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023076,
      "SummaryText": " occur, our 5 year accident history, and our planned changes to improve safety at the facility.\n\n\n\nThe Halley Plant is located southeast of Kermit in Winkler County, Texas, at coordinates of Latitude 31 43.834'N  Longitude 102 59.596'W.  \n\n\n\nAs specified by the U. S. Environmental Protection Agency (EPA) RMP Regulations, our worst case release would be the loss of all of the NGL in our largest vessel causing a vapor cloud explosion.  In the case of the Halley Gas Plant, this would include a 10,000-gallon storage vessel.  Such a scenario is highly unlikely; however, using the EPA RMP Comp. the distance that the resulting vapor cloud explosion could cause an overpressure of 1 psi would be approximately 0.4 miles (approximately 2200 feet).  An overpressure of 1 psi is EPA's threshold for measurable impacts.  \n\n\n\nPotential releases have been discussed with our employees and with local emergency response officials in Winkler County, thereby further reducing the possibility of any impact on the public.\n\n\n\nThe Halley Gas Plant operates under the guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program.  Our ongoing analysis of the potential hazards of our process, detailed training of our employees, and constant emphasis on safety has helped us avoid any serious accidents over the last 5 years.  Part of this program has also involved identifying and taking steps to avoid potential accidental chemical releases.  A few examples of the additional prevention features implemented at this facility include:\n\n\n\nInstallation of \"fire eyes\", that sense UV waves, in the engine room to automatically shut down the compressors in case of fire.\n\n    \n\nInstallation of pumps with dual seals and an alarm for primary seal failure.\n\n    \n\nInstallation of a continuous lit natural gas flare.\n\n    \n\nFire water monitors that will spray water onto equipment. \n\n    \n\nEmergency shutdown valves for removing the product from the system during emergency situati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023076,
      "SummaryText": "ons along with automatic pump shutdown.\n\n    \n\nThese safeguards as well as the vigilance of our trained employees have helped plant to operate safely.\n\n    \n\nNo incident having resulted in offsite or onsite impacts from a RMP regulated substance has occurred at the Halley Gas Plant within the last five years. Daily emphasis on prevention and safety programs should ensure this record continues.\n\n    \n\nAn Emergency Response Plan (ERP) specific to the facility is in place and has been coordinated with the Kermit Volunteer Fire Department and the Winkler County Sheriff.  The Plant Manager is responsible for coordinating all emergency actions.  The ERP in place deals with evacuation procedures, training, etc.  The ERP provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.\n\n    \n\nDiligent compliance with our RMP Prevention Program forms the framework on which we will continue to improve the level of safety at the Halley Gas Plant.  Some of the key components of the safety improvements we expect to achieve are as follows:\n\n    \n\nThe Management of Change provisions ensure that we consider the potential safety and health impacts of any change we make to process chemicals, technology, equipment or procedures.\n\n    \n\nThe Process Hazard Analysis (PHA) provisions serve as a tool to ensure continual evaluation of potential hazards, thereby leading to continual improvements in our safety standards.\n\n    \n\nThe Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of our safety program.\n\n    \n\nInternal and third party compliance audits will ensure we maintain and increase our level of safety protection.\n\n    \n\nAn ongoing dialogue with the Winkler County Emergency Management Director or his designate will ensure a constant state of readiness to respond to any potentia"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000023076,
      "SummaryText": "l emergencies, as well as a means to implement improvements as the need develops.  In this way, we shall bolster our strong commitment to the safety of our workers and the community.\n\n\n\nWe encourage all interested citizens or community organizations to contact the Winkler County Emergency Management Director for the latest information on emergency response for the county.  We plan to diligently integrate our response capabilities and personnel with those of the county on an ongoing basis.\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}