{
  "FacilityID": 1000058119,
  "FacilityName": "Sylva Terminal & Storage",
  "FacilityStr1": "2805 Skyland Drive",
  "FacilityStr2": null,
  "FacilityCity": "Sylva",
  "FacilityState": "NC",
  "FacilityZipCode": "28779",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37099",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "35.400195",
  "FacilityLongDecDegs": "-83.181281",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise Products Operating, LLC",
  "Company2Name": null,
  "CompanyDUNS": 62457304,
  "Company2DUNS": 62457304,
  "OperatorName": "Enterprise Products Operating L.P.",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "RMPContact": "Douglas J. D'Aquila",
  "RMPTitle": "Staff Engineer- Safety/PSM",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173876",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-09-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-06-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.39611,
  "FRS_Long": -83.18358,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072647,
      "AltID": "Sylva Terminal & Storage",
      "FacilityID": 1000058119,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000073840,
          "ProcessID": 1000072647,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        },
        {
          "Process_NAICS_ID": 1000073841,
          "ProcessID": 1000072647,
          "NAICSCode": "482111",
          "_desc": {
            "NAICS_CODE": "482111",
            "NAICS_DESCRIPTION": "Line-Haul Railroads"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089630,
          "ProcessID": 1000072647,
          "ChemicalID": 98,
          "Quantity": 3400000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000589630,
          "ProcessID": 1000072647,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000058119,
      "SummaryText": "Environmental Protection Agency Risk Management Plan\n\nEnterprise Sylva Terminal & Storage\n\nRMP Executive Summary\n\n\n\nEPA ID:  1000 0017 3876\n\n\n\nAt the Enterprise Sylva Terminal and Storage facility, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\n\n\n\nThe Enterprise Sylva Terminal and Storage facility is owned and operated by Enterprise Products Operating LLC.  The terminal is a Liquefied Petroleum Gas (LPG) storage facility and wholesale terminal.  The process is regulated by the OSHA Process Safety Management Standard for highly hazardous chemicals.\n\n\n\nWe use a combination of accidental release prevention programs and emergency response planning programs to help provide for the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n\n\n* A description of our facility and use of substances required by EPA's RMP regulation and the processes involved\n\n* A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n\n* Emergency Response Programs\n\n* General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n* A five-year accident history for accidental releases of chemicals at the Sylva Terminal that are regulated by EPA's RMP rule.  \n\n\n\nFacility Description\n\n\n\nThe Sylva Terminal is an LPG storage facility which stores propane for transport truck loading.  The process is regulated by Federal OSHA 29 CFR 1910.119 and 40 CFR Part 68.  We have entered the facility as an RMP Program Level 3 facility.\n\n\n\nThe facility receives, stores and d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000058119,
      "SummaryText": "istributes propane LPG.  There are eight tanks which receive propane from rail tank cars unloaded at the facility.  The propane is transferred to the terminal storage tanks for loading into delivery trucks. The tanks are administratively controlled to hold and not exceed 80% of their capacity.  Sylva Terminal has four rail car spots for unloading propane into the terminal storage tanks.\n\n\n\nIn our process we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\n\n\n\nToxics\n\n\n\nThere are no toxic materials contained on site above the threshold limits.\n\n\n\nFlammables\n\n\n\nPropane is the finished product which is received from rail tank cars into the eight storage tanks.  This material is routed from these tanks to the loading docks for wholesale distribution to propane retailers via tank trucks.\n\n\n\nKey Offsite Consequence Analysis Scenarios\n\n\n\nThe EPA's RMP rule requires that we provide information about the worst-case scenarios(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.\n\n\n\nWorst Case Release Scenario - Regulated Toxic Chemical\n\n\n\nNo toxic material above the threshold quantity on site.\n\n\n\nAlternate Release Scenario(s) - Regulated Toxic Chemical\n\n\n\nNo toxic material above the threshold quantity on site.\n\n\n\nWorse Case Scenario - Regulated Flammable Chemicals\n\n\n\nThis simulation involves the rupture or failure of a propane delivery railroad tank car resulting in a simulated vapor cloud explosion.  This scenario assumes there would be no mitigation.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation and the specifics of the simu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000058119,
      "SummaryText": "lation are available in the specified reporting of the Risk Management Plan\n\n\n\nAlternate Case Scenario A? Regulated Flammable Chemicals\n\n\n\nThe alternate release scenario is a simulated rupture of the supply hose at the loading docks resulting in a release of propane and simulated vapor cloud explosion.  Mitigation measures were taken into account when selecting the alternative release scenario.  These measures consisted of reviewing the use of relief valves, check valves, manual shutoff valves, automatic shutoffs, startup and operating procedures, grounding equipment, and excess flow devices.   This scenario assumed the pump continued to operate at the design flow rate following the hose rupture and the automatic high flow shutdown failed to activate . Activation of the Emergency Shutdown devices would isolate the source of the material and secure the facility after an estimated maximum release time of two minutes.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation is contained in the data elements.\n\n\n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address all reasonable contingency cases.\n\n\n\nEmergency Response Program\n\n\n\nEnterprise maintains an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning and reporting.  The program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, the plan is coordinated with the Jackson County Sheriff's Department Emergency Management District, which includes the local Sylva Police department, Jackson County Sheriff's Department, Sylva Fire Department, Jackson County Fire Department, and Emergency Medical Service.\n\n\n\nIn the event"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000058119,
      "SummaryText": " of an accidental release, local Enterprise personnel are trained to sound the alarm, shut off the source from a safe location, contact 9-1-1 and secure the area.  The 9-1-1 system is used to notify the local Police and Fire Departments.  \n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nEnterprise takes a systematic, protective approach to preventing accidental release of hazardous chemicals.  Our Process Safety Management systems address each of the key features of successful prevention program, including:\n\n\n\n* Process safety information\n\n* Process hazard analysis\n\n* Operating procedures\n\n* Training\n\n* Mechanical integrity\n\n* Management of change\n\n* Pre-Startup Safety Review - \"PSSR\"\n\n* Compliance audits\n\n* Incident investigation\n\n* Employee participation\n\n* Hot work permit\n\n* Contractors\n\n\n\nOperations personnel make regular inspections of the equipment and processes they operate.  If something out of the ordinary is found, it is reported to management in order to expediently resolve any problems.\n\n\n\nThe engineering and administrative controls in place have been established to reduce the risk of an accidental release of identified hazards.  Enterprise is committed to operations that are safe for employees and the surrounding community.\n\n\n\nAccident History\n\n\n\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\n\n\n\nBased on the criteria set forth in 40 CFR 68.10, this facility has not had an accidental release.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe following is a list of improvements that are planned for implementation at the facility to help prevent and/or better respond to accidental chemical releases:\n\n\n\n* The terminal is installing an alarm system and strobe light tied into the emergency shut down system (EDS)."
    }
  ]
}