{
  "FacilityID": 1000009214,
  "FacilityName": "Enterprise Janesville Terminal & Storage",
  "FacilityStr1": "6133 Highway 14 West",
  "FacilityStr2": null,
  "FacilityCity": "Janesville",
  "FacilityState": "WI",
  "FacilityZipCode": "53548",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55105",
  "LEPC": "Rock County LEPC",
  "FacilityLatDecDegs": "42.729100",
  "FacilityLongDecDegs": "-089.123310",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.epco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48210686,
  "ParentCompanyName": "Enterprise Terminal & Storage, L.L.C.",
  "Company2Name": "Mapletree, L.L.C.",
  "CompanyDUNS": 49563984,
  "Company2DUNS": 49563984,
  "OperatorName": "Enterprise Products Operating LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "RMPContact": "Alfred J. Wussler",
  "RMPTitle": "RMP Coordinator",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000191632",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-09-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-03-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010796,
      "AltID": "Propane Storage Tankage",
      "FacilityID": 1000009214,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011173,
          "ProcessID": 1000010796,
          "NAICSCode": "48699",
          "_desc": {
            "NAICS_CODE": "48699",
            "NAICS_DESCRIPTION": "All Other Pipeline Transportation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012298,
          "ProcessID": 1000010796,
          "ChemicalID": 98,
          "Quantity": 2900000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000013248,
          "ProcessID": 1000010796,
          "ChemicalID": 105,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 105,
            "ChemicalName": "Ethyl mercaptan [Ethanethiol]",
            "CASNumber": "75-08-1",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512298,
          "ProcessID": 1000010796,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000513248,
          "ProcessID": 1000010796,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009214,
      "SummaryText": "Environmental Protection Agency Risk Management Plan\nEnterprise Janesville Terminal & Storage\nRisk Management Plan (RMP)\nExecutive Summary\n\nAt the Enterprise Janesville Terminal and Storage, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\n\nThe Enterprise Janesville Terminal and Storage is owned by Enterprise Terminal & Storage, LLC, a wholly-owned subsidiary of Mapletree, LLC and operated by Enterprise Products Operating LLC (Enterprise).\n\nWe use a combination of accidental release prevention programs and emergency response planning programs to help provide for the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the risk management measures that we have designed and implemented, including:\n\n* A description of our facility and use of substances required by the Environmental      Protection Agency (EPA) RMP regulation and the processes involved\n* A summary of results from our assessment of the potential offsite consequences from accidental chemical releases\n* Emergency Response Programs\n* General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n* A five-year accident history for accidental releases of chemicals at the Janesville Terminal that are regulated by EPA's RMP rule.  \n\nFacility Description\n\nThe Janesville Terminal is a liquefied petroleum gas (LPG) pipeline and propane storage/loading facility.  The process is regulated by the Occupational Safety and Health Administration under 29 CFR 1910.119 and 40 CFR Part 68.  We have entered the facility as an RMP Program Level 3 facility.\n\nThe Janesville Terminal has a single Department of Transportation regulated pi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009214,
      "SummaryText": "peline that is routed into the facility.  This pipeline is a dedicated propane line.  The Janesville facility receives propane from the pipeline to any of nine propane storage tanks.  These tanks are used for distribution to the truck transport loading docks which also has capabilities to stench the propane for retail sales companies.  All of these tanks are administratively controlled to hold and not exceed 85% of their capacity.\n\nIn our process we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\n\nToxics\n\nNo toxic materials to report.\n\nFlammables\n\nPropane is delivered into nine storage tanks via the dedicated propane pipeline.  This material is routed from these tanks to the four truck transport loading docks for wholesale distribution to propane retailers.  Ethyl Mercaptan, the odorant used at the Janesville Terminal, is also present at the facility with a total working and bulk storage amount that can exceed the threshold quantity specified in the  RMP regulation.\n  \nKey Offsite Consequence Analysis Scenarios\n\nThe EPA's RMP rule requires that we provide information about the worst-case scenario(s) and alternative release scenario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.\n\nWorst Case Release Scenario Regulated Toxic Chemical\n\nThere are no regulated toxic chemicals to report for the Janesville Terminal.\n\nAlternate Release Scenario(s) Regulated Toxic Chemical\n\nThere are no regulated toxic chemicals to report for the Janesville Terminal.\n\nWorse Case Scenario Regulated Flammable Chemicals\n\nThis simulation involves the rupture or failure of one of the larger propane storage tanks resulting in a simulated vapor cloud explosion.  This scenario assumes there would be no mitigation.  All"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009214,
      "SummaryText": " emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation and the specifics of the simulation are available in the specified reporting of the Risk Management Plan\n\nAlternate Case Scenario Regulated Flammable Chemicals\n\nThe alternate release scenario is a simulated rupture of the supply pipe to the loading docks resulting in a ten minute release and simulated vapor cloud explosion.  This scenario assumed the pump continued to operate at the normal flow rate for 10 minutes after the line break.  Mitigation measures were taken into account when selecting the alternative release scenario.  These measures consisted of reviewing the use of relief valves, check valves, manual shutoff valves, automatic shutoffs, startup and operating procedures, grounding equipment, and excess flow devices.  Activation of the Emergency Shutdown Devices would isolate the source of the material and secure the facility.  All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation is contained in the data elements.\n\nWe are using this information to help us ensure that our emergency response plan and the community emergency response plan address a reasonable range of contingencies.\n\nEmergency Response Program\n\nEnterprise maintains an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning and reporting.  The program provides the essential planning and training for effectively protecting workers, the public, and the environment during emergency situations.  Furthermore, the plan is coordinated with the Rock County Emergency Management, Rock County Sheriff's Department, Fire Department, and Emergency Medical Service.\n\nIn the event of an accidental releas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009214,
      "SummaryText": "e, local Enterprise personnel are trained to sound the alarm, shut off the source from a safe location or activate the emergency shutdown system, contact 9-1-1 and secure the area.  The 9-1-1 system will be used to notify the Rock County Emergency Communications Center which will make notification to the local law enforcement and Fire Department(s).  Remote activation can also be accomplished from Enterprise's Houston Control which has termianl area video surveillance with dial-up access.  In addition, there are local gas detection systems that alarm locally and in Houston Control.  If these detectors annunciate, the facility can be shut down remotely from Houston Control or locally by operations personnel.  A third-party contractor, 3E Company is under contract to contact the necessary agencies if required.  \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nEnterprise takes a systematic, protective approach to preventing accidental release of hazardous chemicals.  Our Process Safety Management systems address each of the key features of successful prevention program, including:\n\n* Process safety information\n* Process hazard analysis\n* Operating procedures\n* Training\n* Mechanical integrity\n* Management of change\n* Pre-Startup Safety Review - \"PSSR\"\n* Compliance audits\n* Incident investigation\n* Employee participation\n* Hot work permit\n* Contractors\n\nAs a part of our prevention efforts, Enterprise employees participate in numerous safety and training programs.  A training program has been developed in which Operations and Maintenance personnel are specifically trained in the operation of the facility, the operating procedures, maintenance procedures, and specific other regulations and policies, as well as in all areas of emergency response.  Employees are trained on, use, and apply the guidelines of our PSM program, which include all of the above-listed areas.  All of these programs come under scheduled scrutiny and critique.\n\nTh"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000009214,
      "SummaryText": "ere is an on-going inspection program designed to search out and find deficiencies with the process equipment prior to any incident.\n\nOperations personnel make regular inspections of the equipment and processes they operate.  If something out of the ordinary is found, it is reported to management in order to expediently resolve any problems.\n\nThe engineering and administrative controls in place have been established to reduce the risk of an accidental release of identified hazards.  Enterprise is committed to operations that are safe for employees and the surrounding community.\n\nAccident History\n\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\n\nBased on the criteria set forth in 40 CFR 68.10, this facility has not had an accidental release.\n\nPlanned Changes to Improve Safety\n\nThe following is a list of improvements that are planned for implementation at the facility to help prevent and/or better respond to accidental chemical releases:\n\n* The PSM system is constantly being subjected to critical reviews with an objective of improving the programs.\n* Janesville Terminal has recently installed a maintenance flare system that limits the amount of hazardous material released as flammable hydrocarbon during maintenance operations that are not subject to combustible vapor recovery. \n"
    }
  ]
}