{
  "FacilityID": 1000113370,
  "FacilityName": "Ice Cube Cold Storage",
  "FacilityStr1": "615 Innovation Way",
  "FacilityStr2": null,
  "FacilityCity": "Fall River",
  "FacilityState": "MA",
  "FacilityZipCode": "02720",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25005",
  "LEPC": "Fall River LEPC",
  "FacilityLatDecDegs": "41.752355",
  "FacilityLongDecDegs": "-71.093495",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": "https://icecubecoldstorage.com/",
  "FacilityEmailAddress": "iwcustomerservice@icecubecoldstorage.com",
  "FacilityDUNS": 125368371,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ice Cube Cold Storage",
  "OperatorStr1": "615 Innovation Way",
  "OperatorStr2": null,
  "OperatorCity": "Fall River",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02771",
  "OperatorZipCodeExt": null,
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000254226",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-04-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-05-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-05-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-05-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000141168,
      "AltID": null,
      "FacilityID": 1000113370,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000176692,
          "ProcessID": 1000141168,
          "ChemicalID": 56,
          "Quantity": 13006.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000142696,
          "ProcessID": 1000141168,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000120945,
              "Process_NAICS_ID": 1000142696,
              "SafetyReviewDate": "2024-04-24 00:00:00",
              "PHA_Date": "2023-11-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-04-14 00:00:00",
              "TrainingReviewDate": "2024-04-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-04-02 00:00:00",
              "EquipmentInspectionDate": "2024-05-06 00:00:00",
              "EquipmentTested": "AMR Equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2023-12-21 00:00:00",
              "PreStartupReviewDate": "2024-04-16 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-12-21 00:00:00",
              "HotWorkPermitReviewDate": "2023-12-21 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2023-12-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000151970,
                  "PreventionProgram3ID": 1000120945,
                  "ProcessChemicalID": 1000176692
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000113370,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-04-24 00:00:00",
    "ERTrainingDate": "2024-04-24 00:00:00",
    "CoordinatingAgencyName": "Fall River Fire Department",
    "CoordinatingAgencyPhone": "5083242740",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "MGL 527 CMR 33 Hazardous Materials Processing Permit",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000113370,
      "SummaryText": "EXECUTIVE SUMMARY \nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE \nIt is the policy of Ice Cube Cold Storage to adhere to all applicable Federal, State, and Local laws and regulations. Ice Cube Cold Storage is committed to employee, public, and environmental safety. This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee  training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. If an unpredictable release does occur, Ice Cube Cold Storage employs a trained refrigeration engineer, and coordinates with the Fall River Fire Department to assist in mitigating any release. \nThe ammonia refrigeration process at Ice Cube Cold Storage has been designed and operates in accordance with EPA's Accidental Release Prevention Rule, and applicable State and Local codes and regulations. Ice Cube Cold Storage has qualified engineering, operations, and maintenance personnel knowledgeable in the process, and the safe operation of ammonia refrigeration systems in direct responsibility of the process. The process is also designed and operated in voluntary compliance with the Occupational Safety and Health Administration's Process Safety Management rule. \nThrough the Ice Cube Cold Storage Emergency Action Plan as required under OSHA PSM, lce Cube Cold Storage has emergency response procedures in place that comply with the Accidental Release Prevention Program. \nDESCRIPTION OF FACILITY AND REGULATED SUBSTANCES HANDLED \nIce Cube Cold Storage is a refrigerated warehouse and logistics facility primarily engaged in the refrigerated (cold storage) of seafood products. The facility is situated on an 26.2 acre industrially zoned parcel, and is a 200,000 sq. ft facility utilizing 13,006 lbs. of anhydrous ammonia within the process. The Accidental Release Prevent"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000113370,
      "SummaryText": "ion Program applicability threshold for anhydrous ammonia is 10,000 pounds. The anhydrous ammonia refrigeration system is the only process at the facility. The process is subject to Risk Management Program 3.\nACCIDENTAL RELEASE PREVENTION PROGRAM \nThe process is currently designed and maintained in compliance with ANSI/ASHRAE guidance, as well as the International Institute of Ammonia Refrigeration Standards. Process verification takes place through design audits by trained personnel and/or consultants and refrigeration contractors. The schedule of such verifications is at least once every three years. \nPROCESS HAZARD ANALYSIS \nAn off-site consequence analysis has been completed for a worst-case release scenario and an alternative release scenario to document the distance to toxic endpoint for each scenario, as well as the potential population, public and environmental receptors that fall within the radius of impact for each scenario. \nMECHANICAL INTEGRITY PROGRAM \nPreventative maintenance (PM) is an active part of Ice Cube Cold Storage's daily operations. Ice Cube Cold Storage executes documented maintenance inspections on process equipment to ensure proper operation. Process equipment included within the Ml Program includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shut down systems, system controls, and compressors. Maintenance procedures are carried out by qualified and certified refrigeration personnel with a background in maintenance practices. Training is provided to personnel as needed. PM is performed in accordance with OSHA-PSM and, in many cases; the process safety equipment PM Schedule prescribed by Ice Cube Cold Storage exceeds recommended equipment maintenance schedules. Ice Cube Cold Storage refers to IIAR 6 for ITPM.  A monthly PM Program is administered by ARC Mechanical (Ice Cube's third party refrigeration contractor), Ammonia detection sensors are present at multiple locations and tested semi-annually. Re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000113370,
      "SummaryText": "lief Valves are replaced on a 5 yr schedule according to best practices. Emergency Ventilation and Emergency shut-down controls. Any equipment deficiencies identified during maintenance inspections are corrected in a safe and timely manner. \nPROCESS SAFETY INFORMATION \nIce Cube Cold Storage maintains a detailed record of written safety information that describes the chemical hazards, operating parameters, and equipment designs associated with all of the processes. \nMANAGEMENT OF CHANGE \nWritten procedures are in place at Ice Cube Cold Storage to manage changes in process chemicals, technology, equipment, and procedures. Process operators, maintenance personnel, and all other employees whose job tasks are affected by a change in process are promptly made aware of, and offered training to deal with the change. \nPRE-STARTUP SAFETY REVIEWS \nPre-startup safety reviews related to new processes and to modifications in the established processes are conducted as a regular practice at Ice Cube Cold Storage. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation. \nCOMPLIANCE AUDITS \nIce Cube Cold Storage conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented. These audits are completed at least every three years and any required corrective actions are undertaken promptly and safely. All reports are maintained with the PSM Program for the life of the system. \nEMPLOYEE PARTICIPATION \nIce Cube Cold Storage believes that process safety management and accident prevention is a team effort. Ice Cube employees are encouraged to share their views concerning accident prevention issues and recommended improvements. In addition,  employees have access to all process information collected as part of the facility's compliance with the RMP Rule including information resulting from the completion of Process"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000113370,
      "SummaryText": "Hazard Analysis Studies. \nCONTRACTORS \nIce Cube Cold Storage has a contractor qualification program in place as an element of the RMP and PSM programs. Our company has third party refrigeration contractors overseeing monthly preventative maintenance procedures on the refrigeration system equipment. Ice Cube also hires contractors to conduct specialized maintenance and construction activities as needed. Prior to selecting a contractor, a thorough evaluation of the safety performance of the contractor is undertaken. Ice Cube Cold Storage also has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes. Contractors are informed of all applicable procedures for emergency response to an accidental release of a regulated substance. \nFIVE-YEAR ACCIDENT HISTORY \nIce Cube Cold Storage is a brand new facility, therefore,  no accident history exists.\nEMERGENCY RESPONSE PROGRAM \nA process release would be detected by ammonia sensors located in the process, the facility, and the perimeter locations. A process release would also be detected by the employees by the characteristic odor of anhydrous ammonia at 3-5 ppm. The ammonia sensors are tested semi­annually. An alarm signal is triggered and would sound throughout the facility and adjoining warehouse and office areas, as well as activate blue strobes if ammonia is detected. An alarm system and control panel also notify central station alarms, the Fall River Fire Department, and specific Ice Cube Cold Storage individuals if operating parameters are exceeded, or an alarm occurs.  \nIn the event of a process release, the Control System provides notification to the refrigeration engineer, and select Ice Cube Cold Storage personnel. Supplemental to the automatic alarm notification, Ice Cube Cold Storage personnel would notify the Fall River Fire Department if any of the following conditions present: \n*\tUpon investigation of the incident Ice Cube Cold Storage personne"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000113370,
      "SummaryText": "l determine the release is severe enough to require response assistance from the Fall River Fire Department\n*\tReportable quantities of anhydrous ammonia are released\n*\tA potential fire exists\n*\tAn over pressurization condition exists\nThe Fall River Emergency Management Agency and Local Emergency Planning Committee can provide assistance in the event of an emergency, and will be notified of a reportable release from the process. \nPLANNED CHANGES TO IMPROVE SAFETY \nCurrent changes to improve safety include increased employee training, and regularly scheduled evacuation exercises. \nA mechanical integrity audit will be performed in 2024 yrs. As this is a new facility, no previous\nmechanical integrity audit exists."
    }
  ]
}