{
  "FacilityID": 1000039849,
  "FacilityName": "Davidson Water, Inc., Water Plant",
  "FacilityStr1": "388 Koontz Road",
  "FacilityStr2": null,
  "FacilityCity": "Lexington",
  "FacilityState": "NC",
  "FacilityZipCode": "27295",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37057",
  "LEPC": "Davidson County LEPC",
  "FacilityLatDecDegs": "35.854167",
  "FacilityLongDecDegs": "-080.381667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Davidson Water, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Davidson Water, Inc.",
  "OperatorStr1": "P.O. Box 969",
  "OperatorStr2": null,
  "OperatorCity": "Welcome",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27347",
  "OperatorZipCodeExt": "0969",
  "RMPContact": "Tom Johnson",
  "RMPTitle": "Plant Superintendent",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000016662",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-04-30 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-03-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-03-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.85375,
  "FRS_Long": -80.38057,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049080,
      "AltID": "Chlorine Addition",
      "FacilityID": 1000039849,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000049522,
          "ProcessID": 1000049080,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059562,
          "ProcessID": 1000049080,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000559562,
          "ProcessID": 1000049080,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039849,
      "SummaryText": "Davidson Water, Inc.\n\nWelcome, NC\n\n\n\nExecutive Summary - 2014\n\n\n\n\n\nIntroduction and Policies\n\n\n\nDavidson Water, Inc. is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors, and the public while fully complying with applicable laws and regulations.  \n\nThe purpose of this Risk Management Plan is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency response plans in the event of an accidental release, the five-year accident history of the facility and planned changes to improve safety at the plant.\n\nKey updates in the site's updated PSM/RMP Program include:\n\n\n\n-Written site specific procedures for Employee Involvement, Management of Change, Incident Investigation, and Pre-Startup Reviews.\n\n-Review and update of Chlorine safety information as required by the regulations.\n\n-Employee and Contractor Training on the PSM/RMP and its key components including Emergency Action Plan, Management of Change, Mechanical Integrity and Incident Investigation.\n\n-Conducting  Process Hazards Analyses for the new chlorine process\n\n-Developing Standard Operating Procedures for the new Chlorine system\n\n-Review and update of the  Emergency Response Plan\n\n-Certification of the operating procedures.\n\n-Review and Update of Hot Work Procedures and implementation of forms for Hot Work, Incident Investigation, Management of Change and Pre-Startup Safety Review\n\n\n\nStationary Source and Regulated Substances\n\n\n\nThe Davidson Water Plant is a water treatment facility located in Lexington, NC.  The facility uses chlorine (CAS No. 7782-50-5) in the water treatment process.  The facility has approximately nine chlorine gas cylinders (1 ton each) onsite for the process.  Chlorine is a regulated substance under the Risk Management Program (RMP) and is used in amounts greater than the threshold amount of 2,500 pounds.  The facility is regulated under Progra"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039849,
      "SummaryText": "m 3 requirements under the applicability criteria of ?68.10.\n\n\n\nThe Davidson Water Plant has updated and implemented a comprehensive risk management program (RMP) and process safety management (PSM) program to safely manage chlorine at its water treatment plant located in Lexington, NC and to comply with EPA (40 CFR Part 68) and OSHA (29 CFR 1910.119) requirements.   \n\nThe plant has recently undergone an upgrade to its treatment facility. The RMP has been updated to incorporate recent changes..\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards striven for by Davidson Water.  These high standards include:\n\n\n\n-Operating in compliance with required environmental permits and regulations. \n\n-Operating and maintaining the assets in such a manner that unintentional releases are minimized.\n\n-Operating and maintaining assets in such a manner that the small releases associated with normal operation and maintenance will be minimized to the extent possible.\n\n-Correcting non-compliance found by  audits of the facility.\n\n\n\nPrevention Program\n\n\n\nThe Davidson Water facility is operating under the guidelines of the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program.    A few examples of the prevention features implemented at this facility include:\n\n\n\n-Preventative maintenance and testing of vessels to ensure that structural failures do not occur.\n\n-Training of employees and contractors\n\n\n\nFive-Year Accident History\n\n\n\nWithin the last five years, there have been no releases of RMP substances that resulted in onsite injuries, death or property damage or offsite impacts.\n\n        \n\nEmergency Response Program\n\n\n\nThe site Emergency Response Plans (ERP) has been reviewed and updated.  Training has been conducted to employees as well as contractors.  Chlorine Response Drills have been routinely conducted since 1997. Th"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039849,
      "SummaryText": "e last drill was conducted on June 10, 2013.  The drill was monitored by the local fire department who participated in the drill.\n\n\n\nDavidson Water has an active Safety Committee that further ensures that comprehensive safety programs are implemented at the plants.  A representative from the Davidson Water Plant participates in safety committee meetings, training, and inspections and helps to ensure that applicable programs are implemented at the plant. The committee meets monthly and its duties include reviewing new safety procedures, accident investigations, safety surveys and safety communications. The Risk Manager for the Davidson Water Plant also takes an active role in supporting the Utilities Safety Program. He uses support from the Davidson Water Plant insurance carrier and an outside consulting firm to implement a Davidson Water Plant wide safety program.    \n\n\n\nPlanned Changes to Improve Safety\n\n\n\nCompliance with the RMP Prevention Program forms the framework for continuous safety improvement.  Some of the key components of the safety program are:\n\n\n\n-The Management of Change provisions ensure that the potential safety and health impacts of any change made to process chemicals, technology, equipment or procedures are considered.\n\n-The Process Hazard Analysis (PHA) provisions serve as tools to ensure timely evaluation of potential hazards, thereby leading to continual improvements in safety standards.\n\n-The Mechanical Integrity provisions ensure that process equipment and instrumentation are designed, constructed, installed and maintained to minimize the risk of hazardous releases, thereby serving as an integral part of the safety program.\n\n\n\nSpecific actions that will be taken in the future to improve the level of safety at the facility include:\n\n\n\n-Internal and third party compliance audits will ensure that the level of safety protection at the facility is periodically evaluated for improvements.\n\n-Procedures will be reviewed and updated throughput the year "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039849,
      "SummaryText": "as necessary to maintain compliance with all aspects of the PSM and RMP regulations.\n\n-An ongoing dialogue with the Davidson County LEPC Director or his designate will ensure a constant state of readiness to respond to any potential emergencies, as well as a means to implement improvements as the need develops. \n\n\n\nAll interested citizens or community organizations are encouraged to contact the Davidson County Local Emergency Planning Commission or the local Fire Department for the latest information on emergency response for the county or city.  The facility coordinates its response capabilities and personnel with those of the county and city on an ongoing basis.\n\n"
    }
  ]
}