{
  "FacilityID": 1000057044,
  "FacilityName": "El Dorado Logistics LLC",
  "FacilityStr1": "1651 S. Haverhill Rd.",
  "FacilityStr2": null,
  "FacilityCity": "El Dorado",
  "FacilityState": "KS",
  "FacilityZipCode": "67042",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20015",
  "LEPC": "Butler County LEPC",
  "FacilityLatDecDegs": "37.799693",
  "FacilityLongDecDegs": "-96.881198",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.hollyenergy.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "El Dorado Logistics LLC",
  "OperatorStr1": "1651 S. Haverhill Rd.",
  "OperatorStr2": null,
  "OperatorCity": "El Dorado",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "67042",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mark Shemaria",
  "RMPTitle": "EHS Manager",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000232544",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0150004",
  "SafetyInspectionDate": "2014-11-17 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-04-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-04-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-04-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000071254,
      "AltID": "PROPANE TERMINAL",
      "FacilityID": 1000057044,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000072458,
          "ProcessID": 1000071254,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000088002,
          "ProcessID": 1000071254,
          "ChemicalID": 98,
          "Quantity": 2300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000588002,
          "ProcessID": 1000071254,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057044,
      "SummaryText": "Executive Summary\n\n\n\nThis document outlines a Risk Management Program (RMP), prepared in accordance with 40 CFR Part 68. This document has been prepared to consider the propane terminal process as a RMP Program Level 3 process.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nEl Dorado Logistics LLC has a dedicated commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, training personnel and considering safety in the design, installation, operation, and maintenance of our process. The goal is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, terminal personnel have been trained on the proper response to control and contain the release.\n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe El Dorado Logistics LLC is located at in 1651 S. Haverhill Rd, El Dorado, Kansas.  El Dorado Logistics LLC is owned and operated by Holly Energy Partners, L.P.  Propane is the only RMP regulated substance above its threshold quantity in the facility.\n\n\n\nGENERAL ACCIDENTAL RELEASE/CHEMICAL SPECIFIC PREVENTION PROGRAM STEPS\n\n\n\nThe propane terminal is subject to the EPA Risk Management Program (RMP) regulation and the OSHA Process Safety Management (PSM) standard. Therefore, there is a management system in place to address each element and to implement the accident prevention program. A brief discussion follows for each of these areas. Employee participation is encouraged in the development, review and application of procedures and information regarding the various PSM and RMP elements. Some of the more significant opportunities for active participation are Process Hazard Analysis studies, Management of Change, Pre-Startup Safety Reviews, Incident Investigation, Operating Procedures and Training.  Documentation is an important aspect in the operation of a propane terminal and Process Safety Information is main"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057044,
      "SummaryText": "tained for safety and operational reasons. The information regarding chemicals and equipment is extensive and is continuously being verified and updated.\n\n\n\nIdentifying potential hazards is a critical element of the safety process at the facility. Process Hazard Analysis study has been performed on the propane terminal and is revalidated on a 5 year schedule. Hazard analysis is also performed on changes through the Management of Change process. Recommendations resulting from the studies are addressed and actions taken to address the recommendations are documented.\n\n\n\nOperating Procedures have been developed to provide instructions for safely operating the facility. These procedures serve as a consistent basis for training new operators and for reference by experienced operators. The procedures are periodically reviewed, are considered in the management of change process and are annually certified as current and accurate. \n\n\n\nOperator Training is conducted in coordination with the operating procedures. New employees receive foundational and task specific training on terminal operation. All operators receive refresher training to ensure operating skills and knowledge are maintained and enhanced. Training requirements are also considered when changes are made to the individual units.\n\n\n\nThe terminal uses Contractors to supplement its workforce and because this work is often on or near process equipment, there are specific requirements for contractors. Contractor safety programs, performance and training are evaluated prior to allowing them to perform work in the terminal. The contractors are made aware of terminal safety rules and evacuation plans and are informed of potential hazards related to their work. Contractor activities are monitored while in the terminal to ensure they are fulfilling their safety obligations.\n\n\n\nThe terminal reviews changes to the facility through the Management of Change and Pre-Startup Safety Review process. The review and authorization pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057044,
      "SummaryText": "cess makes provisions for reviewing the change from several aspects, including the potential hazards, safety and health effects, procedural updates and training requirements. The pre-startup safety review provides a final safety review of the change prior to startup.\n\n\n\nMechanical Integrity programs are necessary to provide for the on-going integrity of process equipment and instrumentation. Experienced employees and qualified contractors perform maintenance work on the equipment and instrumentation. Inspection and tests are performed in accordance with facility and industry standards and quality assurance is incorporated in new construction and maintenance activities.\n\n\n\nIncident Investigations are valuable learning tools in determining facts regarding incidents and in developing corrective actions to prevent recurrence. The terminal has Personnel resources trained in incident investigation techniques and they are assigned as required to form teams, investigate incidents and report on the findings. The report and any recommendations are then acted on to improve the safety of the unit and the facility. \n\n \n\nSafe Work Practices at El Dorado are long-standing practices to help ensure operations and maintenance activities are performed safely. These are periodically reviewed and updated.\n\n\n\nCompliance Audits have been conducted at El Dorado every three years since 1993 and are viewed as a way of evaluating the various elements of the safety programs and making improvements as necessary.\n\n\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nIn addition to the accident prevention program activities, the propane terminal has safety features to help contain/control a release, quickly detect a release and reduce the consequences.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThe propane terminal has had no accidental releases that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmenta"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000057044,
      "SummaryText": "l damage in the past five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\n\n\nHEP employees are trained to address incidental incipient level fires that they would happen upon.  HEP employees are not emergency responders and are not trained as emergency responders.  They will support emergency response activities by providing emergency responders with site and product specific information.  \n\n\n\nIn the event of a fire HEP employees are to call 911 and / or 222 [(316) 321-8222] to notify emergency responders of the emergency, where the fire is and provide as much detail as possible about the nature of the fire including exposures and probable contents that are burning.\n\n\n\nIn the event of a leak or release HEP employees are to call 911 and / or 222 (316) 321-8222 to notify emergency responders of the emergency, where they should respond and share the details of the suspected product that is leaking or being released.  If it is known they will share details such as the size of the container, the size of the leak and rate of discharge.  HEP employees are trained to identify a leak and to report their findings by notifying emergency responders.\n\n\n\nFor a needed rescue HEP employees are to call 911 and / or 222 (316) 321-8222 to notify emergency responders of the emergency, where they should respond and share the details of the nature of the needed rescue.  HEP employees are not trained to deal with attempting a rescue and should not attempt to rescue others. \n\nFor a medical emergency or an injury or injuries to people on the premises, HEP employees are to call 911 to notify emergency responders of the details of the emergency, where to respond and if appropriate where to stage equipment.  The HEP employee should share as much detail as possible describing the onset of the incident and potential hazards that are either already addressed or that need to be addressed.\n\n\n\nThe role of all HEP employees during any emergency is to provide details and identify concerns and warn re"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000057044,
      "SummaryText": "sponders of actual and potential hazards and issues they need to know to safely manage the incident.\n\n\n\nThere is no emergency response equipment at the facility other than equipment to address incidental incipient level fires\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nEl Dorado Logistics LLC will continue to seek improvement in safety for the facility and surrounding community. Areas of focus include:\n\n- Performing audits and HAZOP revalidations, and addressing findings from these activities\n\n- Upgrading incident investigation, action item tracking and management of change software.\n\n\n\n\n\n\n\n \n\n\n\n\n\n"
    }
  ]
}