{
  "FacilityID": 1000119707,
  "FacilityName": "Sault Ste. Marie Water Treatment Facility",
  "FacilityStr1": "1634 W. 24th Street",
  "FacilityStr2": null,
  "FacilityCity": "Sault Ste. Marie",
  "FacilityState": "MI",
  "FacilityZipCode": "49783",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26033",
  "LEPC": "Chippewa County LEPC",
  "FacilityLatDecDegs": "46.487639",
  "FacilityLongDecDegs": "-084.417028",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 184663300,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Sault Ste. Marie",
  "OperatorStr1": "225 E. Portage Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Sault Ste. Marie",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49783",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000146488",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-06-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-02-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2025-02-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2025-02-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2030-02-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 46.487639,
  "FRS_Long": -84.417028,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000149373,
      "AltID": "Water Chlorination",
      "FacilityID": 1000119707,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000186698,
          "ProcessID": 1000149373,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000150968,
          "ProcessID": 1000149373,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000127679,
              "Process_NAICS_ID": 1000150968,
              "SafetyReviewDate": "2024-09-18 00:00:00",
              "PHA_Date": "2024-09-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Improved procedures to be implemented.",
              "OpProceduresReviewDate": "2023-08-17 00:00:00",
              "TrainingReviewDate": "2024-01-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-01-24 00:00:00",
              "EquipmentInspectionDate": "2025-01-15 00:00:00",
              "EquipmentTested": "Chlorination Equipment",
              "ChangeMgmtDate": "2021-03-30 00:00:00",
              "ChangeMgmtReviewDate": "2023-08-17 00:00:00",
              "PreStartupReviewDate": "2023-08-17 00:00:00",
              "ComplianceAuditDate": "2022-12-19 00:00:00",
              "AuditCompletionDate": "2023-02-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-08-17 00:00:00",
              "HotWorkPermitReviewDate": "2023-08-17 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2023-08-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000159918,
                  "PreventionProgram3ID": 1000127679,
                  "ProcessChemicalID": 1000186698
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000119707,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-08-17 00:00:00",
    "ERTrainingDate": "2024-01-24 00:00:00",
    "CoordinatingAgencyName": "Chippewa County Central Dispatch",
    "CoordinatingAgencyPhone": "9066323344",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "Yes",
    "LEPCCoordinationDate": "2025-01-08 00:00:00",
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "Yes",
    "LocalResponseAgencyCoordinationDate": "2025-01-08 00:00:00",
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 1000119707,
      "SummaryText": "is becoming more challenging for our area. Alternative methods are being investigated with 150 lbs chlorine gas cylinders being the next best option. There is no timeline to make a switch at this time. \n\nOur primary mission is to provide safe and plentiful drinking water to our fellow citizens and our current chlorination equipment is the most economical and effective way of meeting this goal.  Our approach to chlorine safety and our well trained and conscientious employees compensate for any inherent dangers present from the chlorine that is beneficial to the health of our water customers.\n\n\nKirk Tews\nWater Director\nCity of Sault Ste. Marie"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000119707,
      "SummaryText": "The City of Sault Ste. Marie\nWater Treatment Facility \nRisk Management Plan \nExecutive Summary\n\nThe following is the City of Sault Ste. Marie Water Treatment Facility's Executive Summary of our Risk Management Plan.  It is the #1 priority of the City of Sault Ste. Marie Water Treatment Plant to ensure that our citizens source of high quality and plentiful drinking water does not cause a chemical release to harm them, their families, or their property.\n\nThis Executive Summary is submitted in eight segments.  It was created to both satisfy the Section 112r requirements and to assure our citizens of the great care taken in their protection from a release of the chlorine that is beneficial to the disinfection of their drinking water.\n\nThis Executive Summary was written by the management of the Water Treatment Facility.  It summarized the overall safety programs that all Water Treatment staff created, maintain, update, and train for.  In no way is it intended to provide all the safety measures and programs at the Water Treatment Facility.  It is an overview to provide our customers with chlorine information and to satisfy the risk management plan requirements.\n\nThe staff of the Water Treatment Facility live in the City of Sault Ste. Marie.  The citizens of Sault Ste. Marie are our family, friends, and neighbors.  Their protection from an accidental release of chlorine has been, is, and shall remain to be of the utmost importance to us.\n\nI.  The Water Treatment Facility \n\nThe City of Sault Ste. Marie has approximately 13,300 residents who reside within its 15 square miles.  The City's boundaries are the St. Mary's River on the East, North, and West sides and 3 mile Road as its Southern border.\n \nThe citizens of Sault Ste. Marie have been served with municipally supplied drinking water for more than a century.   The City currently owns and operates a direct filtration treatment water plant that was commissioned in 1993.  It is capable of treating and delivering 6 million g"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000119707,
      "SummaryText": "allons of high quality drinking water per day.  The current facility replaced a water pumphouse that was commissioned in 1902.\n\nThe Water Treatment Facility continues to use gaseous chlorine for disinfection of its water supply.  The City of Sault Ste. Marie has used gaseous chlorine for water disinfection for over 100 years.  We are very knowledgeable in its use and extremely aware of the inherent dangers of its presence.\n\nThe Water Treatment Plant is located at 1634 W. 24th Street.  The plant is situated in a large, heavily wooded tract of land.  The raw water source is the St. Mary's River located to the North of the plant.  A 36\" intake pipeline is located 1600 feet offshore and 4 vertical turbine pumps deliver the raw (untreated) water to the plant.\n\nChlorine is added to the raw water to kill any pathogenic organisms that may be present.  The water then is coagulated, flocculated, filtered, fluoridated, stabilized, stored and then delivered to the citizens of Sault Ste. Marie.  Both in-house and outside laboratory analysis is performed on our water during all stages of treatment.  It should be noted that disinfection is by far the most important aspect of treating our water. Prior to the 1993 Water Treatment Facility, the water pumphouse only added chlorine and fluoride to the water. Directly pumped from the river, chlorine was the only defense against pathogens. \n\nThe chlorination equipment at the Water Treatment Facility went through an upgrade during the last RMP period. The original Wallace & Tiernan equipment was replaced with Hydro Instruments.  RS Technical Services of Lowell, Michigan continues to be the provider for chlorination equipment, parts, and service of our chlorine system.  The chlorine system has many redundant components as well as build in safe guards to ensure that chlorine is safely being used in the process. \n\nOur chlorine system is inherently safer than liquid chlorination systems because it transports gaseous chlorine throughout the ch"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000119707,
      "SummaryText": "lorination system by vacuum, instead of container pressure.  In the event of a chlorine line break, the vacuum suction would drop off, shutting off the gas flow from the ton container through an automatic vacuum regulator.\n\nOur chlorine system utilizes ton containers.  The ton containers are stored and used in the chlorine storage room.  The chlorine storage room was designed and is used specifically for ton containers.  It is kept at a temperature of 55 to 65 degrees year round.  The chlorine storage room is kept locked at all times and has a chlorine leak detection alarm system that activates in the event of the most minute chlorine leak.  The maximum inventory capability is eight ton containers, although typically one space is left open to facilitate movement of empty and full containers within the storage room. \n \nAttached to the active ton containers are vacuum regulator/check units.  Gaseous chlorine under pressure enters the vacuum regulator.  If vacuum is present in the upstream chlorine line from the injector, the check unit opens and vacuum draws the chlorine to the chlorinators.  In the event of a chlorine line breaking, vacuum will drop, thus closing the check unit portion.  This action will shut off the chlorine supply from the tank.  Under normal operating vacuum chlorine  flows from the online ton chlorinator to one of four Hydro Instrument Chlorinators.  The  chlorinator system meters, controls, and ejects the chlorine gas into the water supply.\n\nThe ejector portion of the chlorinator is the workhorse of the whole system. The ejector using the Bernoulli's Principal creates a vacuum that allows the chlorine gas to be used in the system. The ejector also is the point where the chlorine gas mixes with water to form a chlorine solution and then delivers the solution to the point of application in the water treatment process.  \n\nII.  Regulated Substances\n\nOur chlorine supply is the only substance that falls under the Section 112r regulations.  Our chlorin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000119707,
      "SummaryText": "e is also regulated under MiOSHA Process Safety Management of Highly Hazardous Chemicals, Part 91.\n\nChlorine is considered a toxic substance and has a characteristic, penetrating, and irritating odor.  The gas is greenish-yellow in color and the liquid is clear amber in color.  Gaseous chlorine is heavier than air and will sink to lower levels in a release.  It is non-flammable and alone it is stable, but it is a strong oxidizer and will and can react with a variety of hydrocarbons and metals.\n\nChlorine gas is primarily a respiratory irritant.  At chlorine concentrations above 5 parts per million, the gas is very irritating.  At concentrations near the threshold of smell (well below 1 part per million for most people) chlorine gas will, after several hours of exposure, cause mild irritation of the eyes and the respiratory tract.  In extreme cases of chlorine inhalation, difficulty in breathing can progress to the point of death through suffocation.\n\nLiquid chlorine in contact with eyes or skin will cause local irritation and/or burns.\n\nIII.  The Accidental Release Prevention and Emergency Policies at the Water Treatment Facility.\n\nThe Sault Ste. Marie Water Treatment Facility takes a many-faceted approach to the safe handling of our chlorine and chlorination equipment.  We follow MiOSHA Process Safety Management of Highly Hazardous Chemicals rule and The Chlorine Institute's Pamphlets and Guidelines to assist us in our use of chlorine.\n \nOur chlorine safety program begins with employee involvement.  All Water Treatment Facility employees have a hand in its formation, implementation, and application.  \n\nIt is a goal of the Water Treatment Facility management and the City of Sault Ste. Marie to have a well trained workforce who can safely, correctly, and quickly respond to any situation by relying on their previous training and common sense to overcome any hazardous situation that may confront them.  Training is the key to this goal, so all employees receive documente"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000119707,
      "SummaryText": "d training on all our operating procedures.  No employee can work a shift alone until they have become fully trained and pass an evaluation.\n\nOur operating procedures are annually reviewed by the staff to make sure they reflect any changes made to the operations or equipment.  Our operating procedures are also checked to see if they could be made safer or more efficient.\n\nWe have an extensive maintenance program at the Water Treatment Facility.  All chlorination equipment maintenance requirements are documented and scheduled.  Procedures, in accordance with the equipment manufacturer, were written for all maintenance activities, and qualified personnel only work on our chlorination equipment.  If an employee finds, or suspects a piece of equipment not to be performing up to specifications, it shall be removed from service and a work order made out to notify maintenance personnel of the problem.  RS Technical Services provides parts, support, and rebuilding of any part of the chlorination system. Typically, the chlorine vacuum regulators are sent to be rebuilt at RS Technical's shop in Lowell, MI. \n\nThe staff performed a Process Hazard Analysis on our chlorination system and all its components and procedures.  We used the What If/Checklist method and wrote numerous scenarios.  We answered the scenarios as a group and have implemented those ideas into the daily workings of the plant. The scenario solutions have been added into the RMP program.   \n\nIn short, Sault Ste. Marie Water Treatment Facility employees are trained in Process Safety Management, Process Hazard Analysis, operating procedures, maintenance procedures, standard safety practices, and safe work practices on a continuing basis to guard against the possibility of a chlorine release.  In the unlikely event of a chlorine release, the staff is trained to respond to an emergency if it arises and to call in outside help if necessary. \n\nIV.  Worst Case Chlorine Release Scenario\n \nOur worst case scenario for chl"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000119707,
      "SummaryText": "orine release is the complete release of a full ton container in 18 minutes, which represents a release rate of 110 lbs of chlorine per minute.\n\nThe model we used for our worst case is the EPA RMPComp. The conditions in the worst case are a class F atmospheric stability, 50% relative humidity at 25 degrees C with a wind speed of 1.5 meters per second.  The height of the release is at ground level.  Even though we have a relatively low population in the surrounding area of the Water Treatment Plant, we selected the urban topography as directed in the RMP Submit instructions because of the heavily wooded surroundings that represent obstructions.\n\nThe endpoint for our worst case is 2.2 miles.  Offsite consequences from the worst case include an effected population of 3000 people.  Within the 2.2 mile radius is residential housing, and a City-owned recreational area and park.  There is also a officially designated wildlife preserve.\n\nThe worst case scenario is highly unlikely due to our vacuum operated chlorination equipment and the fact that we feed chlorine in the gaseous form, not the liquid form.  To get the volume of release calculated in the worst case scenario, a ton container would have to vent chlorine through an opening in the thick, steel container wall, which is very unlikely, or by breaking off the lower valve or fusible plug below the liquid line of the container.  Due to the staff's extreme care and extensive training in the handling of the ton containers, this is also highly unlikely.\n\nV.  Alternate Chlorine Release Scenario\n\nOur Alternate release scenario is designed to represent the most likely type of chlorine release.  It estimates the loss of gaseous chlorine if a 1/4\" line was broken and it released gaseous chlorine at a rate of 9 lbs per minute for 10 minutes.  It also represents weather conditions that are more frequent at the Water Treatment Plant; a 3 meter per second wind speed with a class D atmospheric stability.  All other data is the same"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000119707,
      "SummaryText": "as in the worst case scenario.\n\nThe endpoint for our alternate release scenario is 0.1 miles.  A 0.1 mile radius contains an estimated population of 20 people.  The alternate release scenario model is from EPA RMPComp.\n\nThe chance of breakage on a 1/4\" chlorine line is very remote.  Strictly followed procedures, extensive training, and excellent preventive maintenance are just some of the tools our staff uses to prevent even the smallest of chlorine leaks from occurring. A break in a chlorine line would also stop the flow of chlorine. Only if the vacuum regulator fails to close would the alternate scenario be possible. The alternate scenario would also be able to be corrected very quickly by shutting the main shut of valve off. Only residual chlorine in the feed lines would be leaking at that point in time. \n\nVI.  5 Year Accident History\n \nThe City of Sault Ste. Marie Water Treatment Facility has never had a release of chlorine since the plant was commissioned in 1993.\n\nVII.  Emergency Response Plan\n\nOur emergency response to a chlorine leak can be broken down into two parts: small releases that can be stopped and repaired in-house and larger leaks, where it is beyond the capabilities of the Water Treatment Facility staff to deal with alone.\n\nSmall releases are those that chlorine does not leave the Water Treatment Plant's storage room. These type of releases are stopped and repaired by the Water Treatment Facility staff by shutting down the chlorination system and the treatment process.  The Water Treatment Facility staff has an intimate knowledge of all aspects of our chlorination system and receive training in leak repair.\n\nFor larger releases that endanger areas beyond the Water Treatment Plant's grounds, the staff shall immediately contact outside help to assist us in controlling the emergency situation.  The outside help is the City of Sault Ste. Marie Fire Department.  We shall invoke the Emergency Operations Plan for Chippewa County and notify and/or evacuat"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000119707,
      "SummaryText": "e the public and prevent the release from becoming larger.\n\nParticipants of the Chippewa County Emergency Operations Plan are:\n\n1.  Office of Emergency Services\n2.  City of Sault Ste. Marie Fire Department\n3.  City of Sault Ste. Marie Police Department\n4.  City of Sault Ste. Marie Department of Public Works\n5.  Chippewa County Sheriff's Department\n6.  Michigan State Police\n7.  MyMichigan Health - Sault Hospital\n8.  Sault Area Schools\n9.  United States Coast Guard\n10.  City of Sault Ste. Marie City Hall Personnel\n11.  Chippewa County Health Department\n12. US Border Patrol\n13. US Army Corps of Engineers - Detroit District\n\nThe Chippewa County Emergency Operations Plan states duties for each of the above participants in the event of a toxic release, with the Police and Fire Departments performing the notification and/or evacuation if necessary.\n \nThe Water Treatment Plant Facility's primary duties during a large chlorine release is to immediately notify the Chippewa County Central Dispatch by calling 911.  The Central Dispatch  Switchboard will activate Emergency Services and begin the process to contain the threat to the community.  The Water Treatment Facility staff shall provide all necessary information to prepare the responding agencies to take the proper actions.  \n\nThe Water Treatment Facility staff shall make every effort to safely contain and stop the release using the proper techniques, personal protective equipment, and our Chlorine Repair Kit B which has the capability to repair any type of release from a ton container.  The Water Treatment  Facility staff are regularly trained in the use of all emergency equipment.\n\nVIII.  The Future of the Water Treatment Plant's Chlorination & Operation of Chlorination Equipment.\n\nThe City of Sault Ste. Marie Water Treatment Facility has no current plans to change the disinfection process using chlorine gas by 1-ton containers.  However, suppliers of chlorine 1-ton containers and delivery of the 1-ton chlorine containers"
    }
  ]
}