{
  "FacilityID": 1000000353,
  "FacilityName": "City of Sioux City Water Plant",
  "FacilityStr1": "1101 Tri View Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sioux City",
  "FacilityState": "IA",
  "FacilityZipCode": "51103",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19193",
  "LEPC": "Woodbury County LEPC",
  "FacilityLatDecDegs": "42.493056",
  "FacilityLongDecDegs": "-096.086111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ricky J Mach",
  "OperatorStr1": "1101 Tri View Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Sioux City",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51103",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129041",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-04-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-04-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-04-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-04-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.492778,
  "FRS_Long": -96.419167,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000408,
      "AltID": "RMP for Chlorine Gas",
      "FacilityID": 1000000353,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000440,
          "ProcessID": 1000000408,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000000444,
          "ProcessID": 1000000408,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000000208,
              "Process_NAICS_ID": 1000000444,
              "SafetyReviewDate": "2004-11-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2009-01-01 00:00:00",
              "ChangeCompletionDate": "2009-01-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "SCADA SYSTEMS",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-01-01 00:00:00",
              "TrainingReviewDate": "2009-01-01 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-01-01 00:00:00",
              "EquipmentInspectionDate": "2009-04-16 00:00:00",
              "EquipmentTested": "Scrubber, Monitoring Equipment, Controls",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000000214,
                  "PreventionProgram2ID": 1000000208,
                  "ProcessChemicalID": 1000000440
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000353,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-01-01 00:00:00",
    "ERTrainingDate": "2008-01-01 00:00:00",
    "CoordinatingAgencyName": "Woodbury LEPC",
    "CoordinatingAgencyPhone": "7122796102",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000353,
      "SummaryText": "cident, date investigation began, a description of the incident, the factors that contributed to the incident, and any recommendations resulting from the investigation. All investigation findings and recommendations will be promptly addressed and resolved. The findings will be reviewed and all affected personnel whose job tasks are affected by the findings. Investigation summaries will be retained for five years.\n\nThe City of Sioux City Water Plant emergency response policy involves the preparation of response plans which are tailored to our local plant, and to the emergency response services available from our community, and is in conjunction with the EPA Emergency Response Program requirements. The Water Plant is NOT a first responder as there are too few workers to put together an appropriate program. The local fire department HAZMAT responds to accidental chlorine releases. However an emergency response plan is maintained at the stationary source for the purpose of protecting public health and the environment. This response plan contains procedures for informing public and local emergency response agencies about accidental releases in compliance with the local HAZMAT guidelines. The local fire department is a member of the Woodbury County Local Emergency Response Planning Committee (LEPC), and has been involved in developing a community emergency response plan. The Plant will evacuate and call 911 for HAZMAT in an emergency chlorine release.\n\nGENERAL iNFORMATION\n\nAll of these elements are in place at eh Water Plant in at least a rudimentary form. It is the intent of the City of Sioux City to again review these policies and make the necessary improvements within the next year.\nTOPOGRAPHY\n\nThe topography type selected for input into the scenario analysis was urban (terrain with many obstructions). A review of USGS 7.5-minute quadrangle maps of the area shows the water treatment plant is located in the Missouri River Valley. A line of bluffs rising 199 plus feet ab"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000353,
      "SummaryText": "ove the valley form a semicircle around the plant from the Northwest to the Northeast. A series of buildings lie immediately west of the treatment plant along with one building setting directly east of the Plant. The Missouri River is approximatelyl, 000 feet south of the treatment plant and 2000 feet South and Southeast of South Sioux City, Nebraska.\n\nMETEOROLOGICAL CONDITIONS FOR WORST-CASE SCENARIO\n\nThe meteorological conditions for the worst-case are specified in the RMP regulations as follows.\n\tWind Speed-\t1 .Smeters/second (3.4 miles/hour)\n\tStability Class-\tF (very stable conditions)\n\tAir Temperature-\t25 degrees C (77 degrees F)\n\nWORST-CASE RELEASE ANALYSIS\n\nThe regulations define the worst case release as a catastrophic release in which the total content of the single largest vessel onsite is released to the environment. All of the chlorine storage vessels at the Water Treatment facility are one ton cylinders. For this analysis, the cylinder was assumed to be outdoors when the release occurs.\n\nFor toxic substances that are normally gases at ambient pressure, the regulations stipulate the release time frame must be 10 minutes for the worst case scenario.\n\nThe toxic endpoint for chlorine is established by the regulation to be 0.0087 mg/L. The endpoint analysis was completed using RMP*Comp software developed by the National Oceanic and Atmospheric Administration (NOAA) and the Environmental Protection Agency (EPA). At a release rate of 200 lbs. Per minute for 10 minutes directly to the environment, the toxic endpoint for the worst case scenario is calculated to read a radius of approximately 2.1 kilometers (1.3 miles) around the water treatment plant.\n\nThe offsite receptors were determined as follows:\nResidential Population: Siouxland Interstate Metropolitan Planning Council (SIMPCO) using the US Census Bureau LAND VIEW III mapping Program. The estimated residential population within the worst case consequence zone is 550.\nPublic receptors: a review of the USGS"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000000353,
      "SummaryText": "7.5 minute quadrangle map for Sioux City indicates there are schools, hospitals, public recreation areas, major commercial and industrial areas located within the worst case consequence zone.\nThere are no Environmental receptors within the quadrangle of Sioux City.\nALTERNATE RELEASE ANALYSIS\n\nHazard Review: Chlorine is withdrawn at a valve near the top of the cylinder and it flows via plastic line to a gas regulator. Chlorine is withdrawn from the regulator via a vacuum and is routed to the chlorine injector through approximately 20 ft. of 5/8Â¿ plastic tubing. If a break occurs at any location within the plastic tubing, the vacuum is lost and all chlorine flow stops. If a break occurs before the regulator, chlorine will escape until mitigation measures can be applied by emergency responders. Based upon the hazard review conduced by facility personnel, the most likely release scenario resulting in offsite consequences would be a break in the cylinder valve.\n\nThe alternative release scenario assumes the release occurs within the chlorine storage building and that all doors are closed prior to and during a release. The release occurs from the valve located at the top of the cylinder; therefore, only chlorine in the gaseous phase is released. It is assumed the valve partially fails, creating a breach of up to 0.0276 square inches. The release rate for chlorine vapor can be calculated by the following equation provided in the EPA Offsite Consequence Guidance Manual:\n\nQR= (190) ah Where QR= release rate (pounds/minute) 190= chemical specific factor for chlorine at a tank. Pressure of 113 psi. Ah= hole area (square inches)\n\nSolving:\tQR= (190) (0.0276)= 5.244 pounds per minute.\n\nThe chlorine storage building is equipped with a chlorine alarm system which will alert plant workers within 30 seconds after a release occurs. Assume the fire department is called within 30 seconds of the worker being alerted and assume it takes five minutes for the fire department to arrive at th"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000000353,
      "SummaryText": "e water plant. Assume 20 minutes elapses before the fire department can successfully patch the leak. Total time frame for emergency actions to be completed is 26 minutes.\n\nThe toxic endpoint for chlorine is established by the regulation to be a concentration of 0.0087 mg/L of chlorine. The endpoint analysis was completed using the RMP*Comp software.\n\nAt a release rate of 5.244 pounds per minute, a 26 minute release would amount to a loss of 162.56 pounds of chlorine. Assuming the release is contained within the chlorine storage building, the toxic endpoint for this release is calculated to reach a radius of approximately 0.2 kilometers (0.1 mile) around the water treatment plant.\n\nThe offsite receptors were determined as follows:\nResidential population: based upon visual observation of the area included within the alternative release scenario consequence zone, there is no residential population affected. Public receptors: There is a commercial building located within the quadrangle that would be affected by a chlorine release, and no environmental receptors in the area.\nFIVE YEAR ACCIDENT HISTORY\n\nThere has been only one accidental release of chlorine in the past five years. This accident occurred on August 28~Â¿, 1995. The release was small and was completely contained in the chemical feed building of the water treatment plant. No one offsite was evacuated, but seven workers at the plant were evacuated from the treatment building. HAZMAT arrived in less than five minutes from the start of the leak. Once inside the building, HAZMAT closed the valve from the tank; however, the leak actually stopped less than one minute after it began. All notification of public receptors was the responsibility of the HAZMAT team.\n\nEMERGENCY RESPONSE PROGRAM\n\nThere are 12 full-time workers at the plant. Because there are so few workers, the water plant will always rely on the local fire department and its HazMat team to provide emergency response."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000353,
      "SummaryText": "endors. Each employee involved in maintaining the on-going mechanical integrity of the chlorination process has been trained. To ensure that the employee can perform the job tasks in a safe manner, each employee was trained in the hazards of the process, in how to avoid or correct unsafe conditions, and in the procedure applicable to the employeeÂ¿s job task.\n\nThe Water Plant does not commonly use outside maintenance contractors, but the City of Sioux City does verify that any such contractors are trained to perform the required maintenance procedures.\n\nThe City of Sioux City Water Treatment Plant performs inspections and tests on chlorination equipment. Inspection and testing procedures follow recognized and generally good engineering practices. The frequency of inspections and tests Of equipment is consistent with applicable manufacturerÂ¿s recommendations, industry standards or codes, good engineering practices, and prior operating experience.\nThe City of Sioux City Water Treatment Plant will certify every three years (or earlier) that compliance with Program 3 Prevention Program requirements have been evaluated to verify that the procedures and practices developed are adequate and are being followed. The compliance audit will be conducted by at least one person knowledgeable in the process. A report will be prepared of the audit findings. An appropriate response to each of the findings of the compliance audit will be promptly determined and documented listings of any deficiencies that have been corrected. The plant will retain the two most recent compliance audit reports within the prior five-year period.\n\nThe City of Sioux City Water Treatment Plant will investigate each incident which resulted in, or could reasonable have resulted n a catastrophic release. An incident investigation will be initiated as promptly as possible, but no later than 48 hours following the incident. A summary will be prepared at the conclusion of the investigation including; date of in"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000353,
      "SummaryText": "APPLICABILITY\n\nThe Sioux City Water Treatment Plant in Sioux City, IA uses chlorine for disinfection as part of its process to provide quality drinking water to its citizens. Chlorine is purchased in ton cylinders and stored in a special chemical feed building outside the main water treatment plant. At any time, there could be as many as 6 chlorine ton cylinders in the storage room. The building contains local and remote warnings and will automatically close all bests if there is a chlorine leak.\n\nACCIDENTAL RELAEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe City of Sioux City accidental release prevention policy involves a unified approach that integrates technologies, procedures, and management practices, and is in compliance with all applicable EPA Prevention Program requirements.\n\nChemical-specific prevention steps include awareness of the hazardous and toxic properties of chlorine, presence of chlorine detectors and chlorine room that will lockup if there is a chlorine leak. Also the Sioux City Fire Department HazMat team is available almost immediately.\n\nMaterial Safety Data Sheet (MSDS) for Chlorine is available in compliance with 29 CFR\n1910.1200. The current maximum intended inventory for chlorine is 8,000 lbs. Stored in\n4 one ton cylinders, and two one ton cylinders connected to the chlorination system.\n\nA review of the hazards associated with the chlorine facility process and procedures was performed. Documentation includes the hazards associated with chlorine and the chlorination process; the possibility of equipment malfunctions or human error, and the steps used or needed to detect or monitor releases.\n\nAll equipment was inspected during the hazard review; it was determined that the chlorination facility was designed, built and operated in accordance with applicable codes and industrial guidelines.\n\nThe results of the hazard review were documented. The hazard review will be updated at least- once every five years. The City of Sioux City Water Tre"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000353,
      "SummaryText": "atment Plant will also conduct reviews whenever a major change in the process occurs; all issues identified in the review will be resolved before startup of the changed process.\nThe City of Sioux City Water Treatment Plant has prepared written procedures that provide clear instructions or steps for safely conducting activities associated with the chlorination process. They are consistent with the applicable safety information.\n\nThe following procedures are in the City of Sioux City Water Treatment Plant General operation and maintenance manual for chlorination system: initial startup, normal operations, emergency shutdown and operations, normal shutdown, startup following a normal or emergency shutdown or a major change that requires a hazard review; consequences of deviations and steps required to correct or avoid deviations; and equipment inspections.\n\nThe City of Sioux City Water Treatment Plant will update these operating procedures if necessary, whenever a major change occurs and prior to startup to the changed process.\n\nThe City of Sioux City Water Treatment Plant ensures that each employee presently operating the chlorination process and each employee newly assigned to this process have been trained or tested competent in the operating procedures listed above that pertain to their duties. Refresher training is provided yearly to each employee operating the chlorination process to ensure that the employee understands and adheres to the current operating procedures in the process. This frequency of refresher training was determined by consultation with the employees operating the process. The City ensures that workers are trained in any updated or new procedures prior to startup of a process after a major change.\n\nThe City of Sioux City Water Treatment Plant has prepared and implemented procedures to maintain the on-going mechanical integrity of the chlorination process equipment. Some procedures or instructions were provided by chlorination process equipment v"
    }
  ]
}