{
  "FacilityID": 1000047529,
  "FacilityName": "D&D Foods, Inc",
  "FacilityStr1": "9425 N. 48th Street",
  "FacilityStr2": null,
  "FacilityCity": "Omaha",
  "FacilityState": "NE",
  "FacilityZipCode": "68152",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31055",
  "LEPC": "Douglas County LEPC",
  "FacilityLatDecDegs": "41.335000",
  "FacilityLongDecDegs": "-095.990000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 34833970,
  "ParentCompanyName": "Hy-vee, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6925671,
  "Company2DUNS": 0,
  "OperatorName": "Doug Wallace",
  "OperatorStr1": "9425 N. 48th Street",
  "OperatorStr2": null,
  "OperatorCity": "Omaha",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68152",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Waters",
  "RMPTitle": "Quality Assurance Manager",
  "FTE": 130,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000202773",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Food Processor",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-02-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-02-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-02-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-02-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059316,
      "AltID": "Food Processor",
      "FacilityID": 1000047529,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000060378,
          "ProcessID": 1000059316,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000072581,
          "ProcessID": 1000059316,
          "ChemicalID": 56,
          "Quantity": 17212.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000572581,
          "ProcessID": 1000059316,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047529,
      "SummaryText": "Last Revision: 1/20/12\n\n\n\nD&D Foods, Inc. - Omaha, NE\n\nRefrigeration System Risk Management Program\n\n\n\nExecutive Summary\n\n\n\nThis is to inform all interested persons, including employees that D&D Foods is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM Program), Title 40 CFR Part 68, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals, In this way we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosions, and other types of catastrophic accidents.   Overall, these programs prevent accidental fatalities, injuries and illnesses and avoid physical property damage.  Our safety programs are applied to any activity involving hazardous chemicals including any use, storage, manufacturing, handling, or the on-site movement of such chemicals, or combination of these activities.  Any group of vessels which are interconnected and separate vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.  \n\n\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\n\n\nD&D Foods is a food processing plant located in Omaha, Nebraska.  The facility operates an ammonia refrigeration system to provide cooling and freezing capabilities.  \n\n\n\nThe refrigeration system is divided into two separate systems. The North Engine room is operated as a two stage system.  On the low stage portion of the system, a low temperature"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047529,
      "SummaryText": " accumulator operates at -40?XF pumps liquid to supply a liquid header which feeds all the freezer evaporators on the system.  The low temperature recirculated liquid flows through the coils in the air units where it picks up heat from the room and product.  Air from the fans blows across the coils, changing the liquid to a vapor. The low temperature recirculated suction vapor is sent from the air units coils to the low temperature accumulator via a suction header.\n\nThere is currently no load on the high stage portion of the system, but the intercooler is set up for a future recirculator operation. \n\nVapor from the intercooler is fed to high stage compressors. During the compression phase in the high stage compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig.  The high-pressure ammonia vapor flows from the high stage compressors to the evaporative condensers where heat is removed, turning the vapor into a high pressure liquid.  The high-pressure liquid is collected in a high-pressure receiver.  The liquid collected in the high-pressure receiver provides liquid make-up for the intercooler. The intercooler provides make-up for the low temperature accumulator.\n\n\n\nVapor from the low temperature accumulator is fed to the booster compressors. During the compression phase in the booster compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 15-30 psig.  The booster discharge is fed to the intercooler.  Vapor from the intercooler is fed to high stage compressors. During the compression phase in the high stage compressors, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig. \n\nThe high-pressure ammonia vapor flows from the high stage compressors to the evaporative condensers where heat is removed, turning the vapor into a high pressure liquid.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047529,
      "SummaryText": "The high-pressure liquid is collected in a high-pressure receiver.  The liquid collected in the high-pressure receiver provides liquid make-up for the intercooler.\n\n\n\nThe South Engine room is operated as a single stage system with high side only.  Three accumulator and pumper drum packages supply +17?XF ammonia to the controlled pressure receiver.    The controlled pressure liquid from the receiver flows through the coils in the air units and chillers where it picks up heat from the room and product.  Air from the fans blows across the coils and plates, changing the liquid to a vapor. The recirculated suction vapor is sent from the air unit coils and chillers back to the accumulators via the suction headers.  \n\n\n\nVapor from the +17?XF accumulators are fed to the compressors. During the compression phase, the temperature of the ammonia vapor will rise as the pressure of the ammonia vapor is increased to approximately 150-180 psig.  \n\n\n\nThe high-pressure ammonia vapor flows from the high stage compressors to the evaporative condensers where heat is removed, turning the vapor into a high pressure liquid.  The high-pressure liquid is collected in a thermosiphon receiver and eventually the controlled pressure receiver.  The liquid collected in the controlled pressure receiver provides liquid make-up for the +17?XF accumulators.\n\n\n\nThe emergency action plan at D&D Foods requires all associates to be trained in safe evacuation and notification procedures in cases of actual or drill emergencies. Training shall include escape routes, notification of appropriate response agencies, instructions on activating a building fire alarm system and what should be done after evacuating a building. To aid in the training process evacuation drills are conducted at the facility.  In the case of an emergency, Kelley Black is the emergency response coordinator and has overall responsibility for the preparation and implementation of the emergency response plan. The alternate emergency respon"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000047529,
      "SummaryText": "se coordinator is Doug Wallace, president.  Arrangements have been made to coordinate D&D Foods' Emergency Action Plan and applicable emergency services with the following local agencies:\n\n\n\nDouglas- County LEPC \n\n402-444-5040\n\n\n\nOmaha Police Department\n\n402-444-5600\n\n\n\nOmaha Fire Department\n\n402-444-5700\n\n\n\nUpon discovering an emergency situation, all employees shall immediately notify their supervisor or the Maintenance Department using the phone, vocally or wireless phones. The supervisor of the affected area should immediately contact the Emergency Response Coordinator to determine if evacuation of the plant is the safest course of action.  If the emergency involves the release of ammonia and a decision is made to evacuate the plant, the Emergency Response Coordinator will sound an evacuation alarm, and then determine the assembly area.  The location of the assembly area will be based on the current wind direction and will be upwind of the release area and will be relayed to the Evacuation Coordinators.  If your immediate contact options cannot be reached, dial 911.  In the event of an evacuation, all employees should proceed to the designated assembly area and await further instructions from their evacuation supervisor. Facility map identifying exit doors, evacuation routes and assembly areas are posted at various locations throughout the facility.  Once everyone has evacuated the facility and arrived at their designated meeting area, a head count must be conducted by the evacuation coordinator to account for missing people, including visitors and/or contractors in his/her area. Ten minutes will be allowed for critical unit operators to shutdown their equipment and reach the designated meeting location before attendance will be reported.  \n\nIn the event of an emergency release of ammonia it will be necessary for some specifically assigned and properly trained employees to remain in work areas that are being evacuated long enough to perform critical operations. "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000047529,
      "SummaryText": "The critical operations shutdown procedures to be followed by those employees who have been assigned for essential building operations include:\n\n\n\nPlant Engineer: Shutdown the ammonia refrigeration system by using one of the Emergency Stop (E-stop) switches located just inside of the engine room doors.\n\n\n\nIn response to an ammonia release, D&D Foods will not respond to releases of hazardous chemicals in an offensive manner. The facility does not have any employees trained at the HAZMAT Technicians or First Responders Operations Level.  However, in the case of a minor ammonia release, designated maintenance personnel are allowed to isolate or maintain the release.\n\n\n\nD&D Foods has not had any accidental releases to report since the commissioning of the plant.\n\n\n\nThe worst case release scenario would be failure of the high pressure receiver in the south engine room releasing 11,578 lbs of ammonia (the entire charge) for duration of ten minutes. Under worst-case weather conditions, ammonia could travel 0.8 miles before dispersing enough to no longer pose a hazard to the public.  This scenario is unlikely for the following reasons:    \n\n?X    Worst case weather conditions are uncommon,\n\n?X    The vessel is enclosed in a building that would withstand and help to contain such a release\n\n?X    Industry standards for the manufacture and quality control of pressure vessels\n\n?X    Ammonia is not corrosive in this service\n\n?X    Pressure safety valves limit operating pressure in this vessel\n\n?X    The accident prevention program in place at the facility including the mechanical integrity program for regular maintenance, inspection and testing and replacement of equipment, if necessary\n\n?X    Installed ammonia sensors in the system to warn of leaks\n\n?X    Alarms and the auto-dialing system in place to warn operating personnel of process upsets\n\n?X    The emergency response plan and equipment in place at the facility\n\n"
    }
  ]
}