{
  "FacilityID": 1000066242,
  "FacilityName": "H. B. Fuller - Blue Ash Plant",
  "FacilityStr1": "4450 Malsbary Road",
  "FacilityStr2": null,
  "FacilityCity": "Blue Ash",
  "FacilityState": "OH",
  "FacilityZipCode": "45242",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39061",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "39.239444",
  "FacilityLongDecDegs": "-084.385833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.hbfuller.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4235149,
  "ParentCompanyName": "H. B. Fuller Company",
  "Company2Name": null,
  "CompanyDUNS": 6159776,
  "Company2DUNS": 0,
  "OperatorName": "H. B. Fuller Company",
  "OperatorStr1": "4450 Malsbary Road",
  "OperatorStr2": null,
  "OperatorCity": "Blue Ash",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45242",
  "OperatorZipCodeExt": null,
  "FTE": 39,
  "OtherEPAFacilityID": "45242hbfll4440",
  "EPAFacilityID": "100000043133",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-02-24 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-05-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-11-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 1,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-11-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-11-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 1,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.23954,
  "FRS_Long": -84.38577,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000082998,
      "AltID": "VAM Storage",
      "FacilityID": 1000066242,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000103310,
          "ProcessID": 1000082998,
          "ChemicalID": 29,
          "Quantity": 500000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000084200,
          "ProcessID": 1000082998,
          "NAICSCode": "32552",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000069955,
              "Process_NAICS_ID": 1000084200,
              "SafetyReviewDate": "2017-07-10 00:00:00",
              "PHA_Date": "2017-07-10 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-06-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Thermal oxidizer",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Foam suppression system on monomer tanks activated manually or by heat sensors",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": "Only two reactors trains were included in the PHA (six total in the previous PHA)",
              "OpProceduresReviewDate": "2019-12-31 00:00:00",
              "TrainingReviewDate": "2017-08-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-06-01 00:00:00",
              "EquipmentInspectionDate": "2017-03-17 00:00:00",
              "EquipmentTested": "VAM storage tanks, Monomer transfer piping to process, Monomer feed tanks, Specialty monomer feed tanks, Reactors, VCT (vapor containment tank), Reactor condensers, Transfer piping to R-5 and R-6",
              "ChangeMgmtDate": "2020-04-20 00:00:00",
              "ChangeMgmtReviewDate": "2020-02-28 00:00:00",
              "PreStartupReviewDate": "2020-03-19 00:00:00",
              "ComplianceAuditDate": "2019-08-13 00:00:00",
              "AuditCompletionDate": "2021-06-01 00:00:00",
              "IncidentInvestigationDate": "2020-04-27 00:00:00",
              "InvestigationChangeDate": "2020-07-31 00:00:00",
              "ParticipationPlansReviewDate": "2014-04-16 00:00:00",
              "HotWorkPermitReviewDate": "2020-04-20 00:00:00",
              "ContractorSafetyReviewDate": "2020-05-15 00:00:00",
              "ContractorSafetyEvalDate": "2020-05-08 00:00:00",
              "CBI_Flag": 0,
              "Description": "The HB Fuller Blue Ash plant has two polymer reactor lines R5 and R6 which are comprised of the same elements, but differ in size. Both processes include the interconnected units of the catalyst tanks, delayed water tank, cook tank, pre-emulsion tank, reactor, and cooling tank. The R5 system has two catalyst tanks while the R6 system has three. The two lines share and utilize a vapor containment tank, thermal oxidizer, and finished product tanks. The prevention plan includes alarms to warn of unusual process conditions as well as interlocks to shut down specific process steps in case of severe changes in process conditions. The following prevention plan covers the specific process units, but apply to both polymer reactor lines.\n\n\n\nCatalyst Tanks:\n\n? High Level Alarms\n\n\n\nDelayed Water Tanks:\n\n? High Level Alarm\n\n? Agitator Alarm\n\n\n\nCook Tank:\n\n? High Level Alarm\n\n? Agitator Alarm\n\n\n\nPre-Emulsion Tank:\n\n? High Temperature Alarm\n\n? High Level Alarm\n\n? Agitator Alarm\n\n? High High Level Interlock: Stops fill phases on pre-emulsion tank\n\n\n\nReactor:\n\n? High Temperature Alarm\n\n? Low Temperature Alarm\n\n? High High Temperature Alarm\n\n? Reflux High Temperature Alarm\n\n? Condenser Water High Temperature Alarm\n\n? High Level Alarm\n\n? High Pressure Alarm\n\n? Agitator Alarm\n\n? Vent Interlock: Do not allow transfer from PE tank or DW tank to reactor if condenser vent is closed for Reactor system\n\n? Agitator Interlock: Stop flow from PE tank, catalyst tanks, and DW tank if reactor agitator zero speed sensor registers loss of agitation\n\n? High-High Temperature Interlock (Absolute and Deviation): Stops fill phases on reactor\n\n? High-High Level Interlock: Stops fill phases on reactor\n\n? Reflux valves interlock: Stops pre-emulsion fill phase\n\n\n\nCooling Tank:\n\n? High Level Alarm\n\n? Agitator Alarm\n\n\n\nCommon:\n\n? PD Pumps High Pressure Alarms\n\n? PD Pumps Suction Low Pressure Alarms\n\n? Thermal Oxidizer High Temperature Alarm\n\n? Thermal Oxidizer Low Temperature Alarm\n\n? Metered Flow Alarm\n\n? Cooling Tower Water Supply High Temperature Alarm\n\n? Cooling Tower Water Return High Temperature Alarm\n\n? Cooling Tower Water Low Flow Alarm\n\n? PD Pumps High Pressure Interlock\n\n? PD Pumps Suction Low Pressure Interlock\n\n\n\nIn addition to the control system alarms and interlock, mechanical integrity testing is also utilized as a prevention program. Mechanical integrity testing ensures that the process vessels, piping and heat exchangers are in safe working condition according to American Petroleum Institute (API) standards. The last mechanical integrity testing was completed on 10/1/2012.\n\n\n\nExtensive operator training is also included in the prevention program. Operators are trained about the process equipment, operating conditions, control system, alarms, and chemical hazards.\n\nThe PHA for the R5 and R6 polymer system was completed on 7/23/2012.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000086458,
                  "PreventionProgram3ID": 1000069955,
                  "ProcessChemicalID": 1000103310
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000066242,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-09-17 00:00:00",
    "ERTrainingDate": "2016-10-05 00:00:00",
    "CoordinatingAgencyName": "Hamilton County LEPC",
    "CoordinatingAgencyPhone": "5138517080",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000066242,
      "SummaryText": "Executive Summary\n\n\n\n1.0 Introduction\n\n\n\nH. B. Fuller manufactures waterbase polymer emulsions at the Blue Ash facility. This process combines monomers along with other chemicals in a specified vessel to form the finished adhesive product.\n\n\n\n2.0 Regulated Substances\n\n\n\nVinyl acetate monomer (VAM) is the only chemical listed in the Clean Air Act 112 (r) and used above its threshold value at this site. VAM is transported to the site primarily through railcars and, occasionally, tanker trucks. Two dedicated tanks located within a secondary containment are used to store the VAM. This raw material is introduced into the process through piping, pumps, and intermediate vessels prior to being metered into the reactors where it is polymerized into the finished product.\n\n\n\n3.0 Accidental Release Prevention and Emergency Response Policies\n\n\n\nChemical releases are minimized through a variety of means including operator training, equipment design and installation, initial startup, operating procedures, and maintenance procedures. It is the policy of the Blue Ash facility to identify the potential for chemical releases and address their causes. In the unlikely event a release occurs the facility personnel are trained in operational parameters to minimize the effects without compromising their own safety.\n\n\n\n4.0 General Accidental Release Prevention Program and Chemical Specific Steps\n\n\n\nThis facility has taken the steps identified in 40 CFR 68 to reduce or minimize the effects of any accidental release. These processes which use VAM are also subject to the requirements of the Process Safety Management regulations found in 29 CFR 1910.119. The following paragraphs briefly describe the current release prevention program for the process which polymerizes VAM.\n\n\n\nProcess Safety Information\n\n\n\nThis information describes the chemical hazards, operating parameters, and equipment design for the associated processes.\n\nProcess Hazard Analysis\n\n\n\nThis is a systematic review of the process "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000066242,
      "SummaryText": "by a cross functional team used to ensure the hazards of the process are identified and controlled efficiently. The methodology used in these analyses is the HAZOP technique. The identified recommendations are reviewed, prioritized and implemented in a timely manner.\n\n\n\nOperating Procedures\n\n\n\nOperating procedures are used to safely produce products in an effective and repeatable manner. These procedures address the various stages of the operation including initial startup, normal operations, temporary operations, emergency operations, normal shutdown, emergency shutdown, process sequencing, and startup after a shutdown. The procedures are periodically reviewed and are readily accessible to the operators.\n\n\n\nMechanical Integrity\n\n\n\nMaintenance of the equipment requires a variety of methodology. Testing and studies are performed equipment such as vessels and piping to determine that it continues to meet its design capabilities; inspections are performed on devices such as rupture disks and vents to ensure they are operational; periodic maintenance is used on that equipment (pumps, controls, valves, etc.) which is used regularly. Qualified personnel are used to perform these maintenance operations. Should a deficiency be identified during any one of these processes, it is addressed in a timely and safe manner.\n\n\n\nManagement of Change\n\n\n\nChanges in the process are proposed, described, and reviewed with through written procedures. Changes can be a change in chemical, technology, equipment or procedure. Those affected by the change are notified and trained, if necessary.\n\n\n\nPre-startup Review\n\n\n\nPrior to a new process startup the installation, equipment, operating and maintenance procedures are reviewed to ensure they are suitable for safe operations.\n\n\n\nCompliance Audit\n\n\n\nAudits are used to identify any shortcomings in the existing program in comparison to the regulations and allow for continuous improvement. These occur at least every three years. Any corrective actio"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000066242,
      "SummaryText": "ns are undertaken in a safe and timely manner.\n\n\n\nIncident Investigation\n\n\n\nReportable incidents are investigated and reviewed promptly. The purpose of the investigation is to record the steps leading up to the incident, identify any abnormal or unusual conditions and develop effective corrective actions to prevent similar incidents from occurring. The reports are maintained for at least five years.\n\n\n\nEmployee Participation\n\n\n\nActive participation of operators, maintenance mechanics, facility management and corporate personnel is both required and encouraged. Additional forums such as employee involvement teams, safety meetings and business meetings are used in inform and interact with individuals.\n\n\n\nContractors\n\n\n\nSome projects or tasks require additional manpower or specialized skills more efficiently provided by contractors. These contractors are made aware of the potential hazards related to the contract work and operation.\n\n\n\n5.0 Five Year Accident History\n\n\n\nThere have been no reportable accidents or releases as define in 40 CFR 68.42 over the preceding 5-year period.\n\n\n\n6.0 Emergency Response Program\n\n\n\nThe Pre-Emergency Plan was written to address abnormal situations such as employee injury and chemical release. The text includes procedures to address emergency response, evacuation of employees, notification of governmental agencies, and medical responses. It is reviewed annually and updated to reflect any pertinent changes which occasionally occur at the facility. A secondary part of the program is the installation and operation of equipment which will stop an emergency event, minimize its effects or allow evacuation from a process area. The equipment includes a monitored sprinkler system, fire detecting devices and fire extinguishers. These systems are regularly inspected and serviced in order to maintain their reliability.\n\n\n\n7.0 Planned Safety Improvements\n\n\n\nSafety improvements are identified through a continuous process that utilizes preventative mai"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000066242,
      "SummaryText": "ntenance program, process hazard analyses and management of change procedures, audits as well as employee observations and operations review. Potential improvements are evaluated for corollary effects and implemented if practical, improved the process, and does not cause safety issues elsewhere."
    }
  ]
}