{
  "FacilityID": 1000098484,
  "FacilityName": "River Valley Cooperative - Galva Plaza",
  "FacilityStr1": "505 SE Industrial Ave",
  "FacilityStr2": null,
  "FacilityCity": "Galva",
  "FacilityState": "IL",
  "FacilityZipCode": "61434",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17073",
  "LEPC": "Henry County LEPC",
  "FacilityLatDecDegs": "41.161676",
  "FacilityLongDecDegs": "-090.022087",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "formerly Gateway Coop Plaza",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "River Valley Cooperative",
  "OperatorStr1": "P.O. Box 256",
  "OperatorStr2": null,
  "OperatorCity": "Eldridge",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52748",
  "OperatorZipCodeExt": null,
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000114672",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-07-19 00:00:00",
  "SafetyInspectionBy": "Illinois Dept of Ag",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "UPDATED JUNE 2 2004",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-12-28 08:40:53",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-12-28 08:40:53",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-12-28 08:40:53",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-12-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 41.161745,
  "FRS_Long": -90.022945,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000122001,
      "AltID": "Product Storage Only",
      "FacilityID": 1000098484,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000152663,
          "ProcessID": 1000122001,
          "ChemicalID": 56,
          "Quantity": 1333860.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000123354,
          "ProcessID": 1000122001,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000076695,
              "Process_NAICS_ID": 1000123354,
              "SafetyReviewDate": "2021-10-11 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2017-10-12 00:00:00",
              "ChangeCompletionDate": "2017-10-12 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Loss of containment",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "E-stops, process switches",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Area manned during transfers",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-10-11 00:00:00",
              "TrainingReviewDate": "2021-11-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-10-11 00:00:00",
              "EquipmentInspectionDate": "2021-10-11 00:00:00",
              "EquipmentTested": "Storage tanks, plumbing for storage tanks to load-outs, pumps, risers/load-outs, valves, hoses, applicator toolbars, nurse tanks, and emergency shut off system.",
              "ComplianceAuditDate": "2021-10-11 00:00:00",
              "AuditCompletionDate": "2021-10-11 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2021-10-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000077443,
                  "PreventionProgram2ID": 1000076695,
                  "ProcessChemicalID": 1000152663
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000098484,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Henry County LEPC",
    "CoordinatingAgencyPhone": "3098831287",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Illinois Department of Agriculture ammonia rules"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000098484,
      "SummaryText": "provided photographs of the system for reference.\r\n\r\nThe Emergency Response Program is intended to minimize the hazards to human health and the environment associated with anhydrous ammonia.  RVC-Galva employees working with the ammonia system make routine observations prior to and during transfer operations from the storage tanks to the nurse tanks.  These visual inspections allow potential problems to be detected before they arise.  The routine inspections identify any external portion of the system which may be under stress or about to fail.  Repairs can be made before they become problematic.  RVC-Galva employees are trained annually (and upon hire) to recognize hazards associated with the storing and handling of anhydrous ammonia.  Training includes classroom instruction, onsite training at the facility, and follow up observation to determine comprehension and understanding.  RVC-Galva routinely invites local fire department personnel to visit the facility to become more educated on the system in the event an emergency occurs.\r\n\r\nCONTINUOUS CHANGES TO IMPROVE SAFETY:\r\nRVC-Galva will continue to provide training programs to ensure the safety of the public, RVC-Galva employees, and contractors."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000098484,
      "SummaryText": "ent.  Anhydrous ammonia is distributed on a seasonal basis (spring and fall).  From time-to-time throughout the year numerous portable nurse tanks may also be present at this site.  The anhydrous ammonia plant is only operated on a seasonal basis (Spring and Fall). Full-time equivalent employee numbers were computed on that basis. At a maximum, the plant operates a total of three months (1/4 of the year). The FTEs for this company location is ten (10).\r\n\r\nWORST CASE AND ALTERNATE CASE SCENARIOS:\r\nThe worst-case scenario is the failure of the largest storage tank when filled to the greatest amount allowed (85% of capacity), resulting in the release of the total volume in a gaseous (hazardous ammonia vapor cloud) form. According to EPA's RMP*Comp Program, the distance to the endpoint is 6.9 miles. The ammonia tank sits over a gravel surface, passive mitigation was not considered as part of this scenario.  Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S Census data. Public receptor information (i.e. schools, hospitals, etc.) was obtained using Google Earth.\r\n\r\nThe alternative release scenario involves the transport delivery vehicle pulling away from the intake lines into the storage plant without disconnecting the transfer hoses. The resulting release, according to EPA's RMP*Comp Program has a distance to endpoint of 0.3 miles.Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S Census data. Public receptor information (i.e. schools, hospitals, etc.) was obtained using Google Earth.  \r\n\r\nThe system is protected from major releases by internal excess flow valves, check valves, relief valves, manual shut-off valves and nitrogen gas emergency shut-off valves. The loadout risers used in filling nurse tanks are protected by breakaway couplers designed to immediately stop the flow of ammonia if the line or a hose breaks. All of the main storage tank valves are locked when"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000098484,
      "SummaryText": "not in use.\r\n\r\n\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\r\nThe RVC-Galva facility complies with EPA's accident prevention rule and all applicable state and local codes and regulations.  The ammonia system is designed, installed, and maintained in accordance with most current applicable ANSI/CGA Standards and state laws.\r\n\r\nIn addition the facility has specific operating procedures in place intended to minimize the potential for an accidental release of ammonia.  RVC-Galva has extended to the Galva Volunteer Fire Department and the Henry County LEPC the opportunity to visit the facility and to participate in mock emergency simulation training.  Annual Tier II reports are submitted to these agencies, as well, to keep them informed of maximum quanitites of ammonia stored onsite for emergency preparedness purposes.\r\n\r\nThe first section of this Executive Summary provides more detail on the general accidental release prevention program in place at the RVC-Galva facility.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY:\r\nRVC-Galva has not had an accident in which the general public was involved and where ammonia was released causing death, injuries, property or environmental damage, evacuations, or shelterings in place.\r\n\r\nEMERGENCY RESPONSE PROGRAM:\r\nIn the event of an emergency involving anhydrous ammonia at the RVC-Galva location, it is company policy to immediately notify the Galva Volunteer Fire Department, the Henry County LEPC, and the IEMA to request that they respond to the emergency.  In the unlikely event that the Galva Volunteer Fire Department is unable to adequately respond to an emergency at the facility, a mutual aid fire department that the Galva Fire Department has an agreement with would be summoned.  This policy has been coordinated with the Galva Volunteer Fire Department and the Henry County LEPC.  Members of the fire department and the LEPC have inspected the anhydrous ammonia system; in addition, both entities have been"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000098484,
      "SummaryText": "RIVER VALLEY COOPERATIVE - GALVA PLAZA (RVC-Galva)\r\nGalva, Illinois\r\n\r\nACCIDENTIAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\r\nRVC-Galva has an ongoing commitment to worker and public safety.  This commitment is demonstrated in the resources invested in accident prevention, such as training personnel on the proper operation and maintenance of equipment and having preventative maintenance programs in place.  RVC-Galva has emergency response policies in place that are addressed in the facility's Health and Safety (H&S) and Emergency Action Plans.  Employee training occurs on an annual basis in order to keep employees educated on emergency response procedures in place at the facility.  New employees are required to read the H&S and Emergency Action Plans and undergo training prior to initiating responsibilities onsite.  RVC-Galva's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.\r\n\r\nThe RVC-Galva facility complies with the most current applicable ANSI/CGA Standard requirements for anhydrous ammonia storage and handling.  It is facility policy to adhere to the rules and regulations relating to the handling of anhydrous ammonia and low pressure nitrogen solutions, equipment, containers, and storage facilities administered by the Illinois Department of Agriculture.  If an emergency were to occur, it is RVC-Galva policy to immediately notify the Galva Volunteer Fire Department (via 911 call) and request that they respond to the emergency.  In addition to notifying the fire department, a call to the Henry County LEPC and the Illinois Emergency Management Agency (IEMA) will be made.  Since the facility is in close proximity to the City of Galva and Highway 34, provisions have been designed to notify all affected persons and the facility has an evacuation plan in place.\r\n\r\nWhile we have planned for an emergency, it is acknowledged that a real emergency will be unexpected and may very well be much different and cannot"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000098484,
      "SummaryText": "be ensured to duplicate what may have been planned,.  In reality, the situation that develops may not happen in the manner in which it has been planned.  In that event, what may have been planned will serve only as a guideline to follow.\r\n\r\nThe Emergency Action Plan for this facility describes certain procedures that are intended to minimize the hazards associated with human health and the environment from fires, explosions, the sudden and unexpected release of chemicals (i.e., Anhydrous Ammonia), tornadoes, bomb threats, or other accident or acts of God which might occur on our premises.\r\n\r\nThe primary emergency coordinator for the River Valley Cooperative is Shane Schmidt.  His work and 24-hour emergency response telephone numbers are provided in the Registration Section of this document.  In addition, the following individuals (with associated work and 24-hour emergency response telephone numbers) are to be contacted in order:\r\n\r\nShane Schmidt, Agronomy Lead\r\nWork:      309-932-2081\r\n24-hour:   309-883-0776\r\n      \r\nAllan Coppejans, Regional Manager\r\nWork:      309-944-5703\r\n24-hour:   309-945-2700\r\n\r\nJim Gruenhagen, V.P. of Operations\r\nWork:      563-285-1732\r\n24-hour:   563-320-3036\r\n\r\n\r\nDESCRIPTION OF THE ANHYDROUS AMMONIA STORAGE/DISTRIBUTION PLANT AND THE REGULATED SUBSTANCE HANDLED AT RIVER VALLEY COOPERATIVE, GALVA, ILLINOIS:\r\nThe RVC-Galva facility is a bulk anhydrous ammonia and propane storage and distribution plant.  The anhydrous ammonia that is stored at the facility is distributed to agricultural crop producers in the surrounding area who utilize it for crop nutrient purposes.  While propane is a regulated substance under 112(r), the process is exempt from RMP reporting at this time because RVC-Galva is considered a retail facility where more than half of the income from propane is from direct sales to end users. \r\n\r\nThe ammonia system consists of three (3) storage tanks with associated piping, valves, liquid pump(s), and other miscellaneous equipm"
    }
  ]
}