{
  "FacilityID": 1000029542,
  "FacilityName": "Vons Company, Inc., Jerseymaid Milk Products",
  "FacilityStr1": "3361 Boxford Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Commerce",
  "FacilityState": "CA",
  "FacilityZipCode": "90040",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.987150",
  "FacilityLongDecDegs": "-118.151180",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.safeway.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 161611827,
  "ParentCompanyName": "Safeway, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Safeway,Inc (Environmental Affairs)",
  "OperatorStr1": "5918 Stoneridge Mall Road",
  "OperatorStr2": null,
  "OperatorCity": "Pleasanton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94588",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jim Earhart",
  "RMPTitle": "Plant Facility Manager",
  "FTE": 142,
  "OtherEPAFacilityID": "010999001902",
  "EPAFacilityID": "100000106486",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-25 00:00:00",
  "SafetyInspectionBy": "CUPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.98774,
  "FRS_Long": -118.15037,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036042,
      "AltID": "Milk Manufacturing",
      "FacilityID": 1000029542,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036424,
          "ProcessID": 1000036042,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043631,
          "ProcessID": 1000036042,
          "ChemicalID": 56,
          "Quantity": 40000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543631,
          "ProcessID": 1000036042,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029542,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe facility uses ammonia as a refrigerant within a closed loop system.  Ammonia is a hazardous substance that must be handled properly in order to prevent accidental releases and injuries.  It is the policy of Safeway, Inc. - Los Angeles Milk Plant to conduct all operations (including the ammonia refrigeration system) in a safe manner.  This policy extends to all employees and contractors at the facility.  Safeway, Inc. - Los Angeles Milk Plant implements this policy toward chemical and general safety through ongoing employee participation, training, written operating procedures, maintenance, inspections, safety committee meetings, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  \n\n\n\nSafeway, Inc. - Los Angeles Milk Plant's senior management is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding communities.  The facility maintains a Safety Committee whose members are the designated emergency coordinators for the facility.  Safeway has an Emergency Response Plan (Plan) in effect, which is detailed in the Emergency Planning and Response section of the PSM document maintained at the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Safeway, Inc. - Los Angeles Milk Plant was designed and constructed in accordance with all applicable federal, state, and loca"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029542,
      "SummaryText": "l regulations.  The facility is located at 3361 South Boxford Avenue, Commerce, CA 90040.\n\n\n\nThe ammonia refrigeration system uses approximately 40,000 pounds of ammonia within a closed system for the purpose of manufacturing dairy products.  The system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for the production and storage of dairy products.\n\n\n\nThe area immediately surrounding the facility is urban with largely industrial complexes and the nearest residential areas to the north and southwest.  The facility is approximately ? mile southwest of Interstate 5 and ? mile east of Interstate 10.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\n?    IIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie ins\"\n\n?    IIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\"\n\n?    IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\n\n?    IIAR Publication R 1, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\"\n\n\n\nIn addition, Safeway, Inc. - Los Angeles Milk Plant prepared and implemented a PSM program in 1995.  This included conducting an initial PHA to examine potential release scenarios and identify measures to reduce the consequences and/or likelihood of such events.  The PHA was revalidated on June 2, 1999, April 27 & 28, 2004, June 4, 2009, and most recently on March 27-28, 2014. A Management of Change, including a PHA conducted on December 23, 2008, was also performed, and was considered to be part of the Revalidation Process Hazard Analysis Study for the Ju"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029542,
      "SummaryText": "ne 2009 Revalidation.  The PSM prevention programs included developing written operating and maintenance procedures as well as other policies and programs to manage the handling of ammonia at the facility (Management of Change, Incident Investigation, Employee Training, and Participation, etc.) \n\n\n\nEngineering Measures\n\nThe ammonia refrigeration system employed by the Safeway, Inc. - Los Angeles Milk Plant is equipped with a computer which monitors the system. The computer system is connected to controls and status indicators throughout the refrigeration system intended to minimize potential ammonia related accidents and to allow operators to monitor system operations. This monitoring system is comprised of liquid level controls, pressure and temperature controls and indicators, as well as other system safeguards and methods for allowing the computer (or facility operators) to effectively monitor and control refrigeration operations.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nEPA's RMP regulation defines \"accident\" as the following:\n\n\n\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process.\n\n\n\nThe release must have caused at least one of the following:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)).\"\n\n\n\nBased on the above definition and an investigation into the facility's accident history conducted at the time of the Process Hazard Analysis (March 27-28, 2014), there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds in the last five years (March 2009 - March 2014). In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe Safeway, Inc. - Los Angeles Milk Plant ha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029542,
      "SummaryText": "s an emergency response plan in effect.  The Emergency Response Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM document and in the Business Plan for the facility.  This Plan was designed to meet the following objectives:\n\n\n\n1.  To save lives.\n\n2.  To minimize and avoid injuries.\n\n3.  To protect the environment.\n\n4.  To minimize property damage.\n\n\n\nThe Plan provides the response organization and notification procedures, evacuation assembly areas, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  If a release of ammonia were to occur, the facility will determine the extent of the emergency.   Supervisors will contact employees in their department to shut off equipment and evacuate to the designated meeting areas.  The public address system and blow horns will be used in the event that individual contact cannot be made.  Plant management will call 911 in order to reach the Los Angeles County Fire Department HazMat team who will respond to the ammonia release.  All employees are trained annually in the emergency evacuation/response plan. This Plan is reviewed and updated at least once per year.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nRecommendations made during the Process Hazard Analyses on May 24, 1995, April 27 & 28, 2004, and June 4, 2009 provided mitigation measures to improve safety at the Safeway, Inc. - Los Angeles Milk Plant. Safeway, Inc. - Los Angeles Milk Plant has implemented these recommendations and has deemed them complete.  This was verified during the following Process Hazard Analysis Revalidation sessions.  Recommendations were also made during the PHA Revalidation conducted on March 27-28, 2014.    \n\n\n\nThe facility has worked to address safety issues as they arise in a continued effort to ensure a safe work environment.  The management at Safeway, Inc. - Los Angeles Milk Plant is planning to continue with this p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000029542,
      "SummaryText": "rogram as follows:\n\n\n\n1.    Continued maintenance program for ammonia refrigeration equipment to ensure ongoing integrity of the equipment.\n\n\n\n2.    Continue to train all employees in Process Safety Management.\n\n\n\n3.    Continue to have employee involvement in safety development.\n\n\n\n4.    Continue internal and external safety audits/inspections and implement changes as needed.\n\n\n\n"
    }
  ]
}