{
  "FacilityID": 1000106216,
  "FacilityName": "Sligo Gas Plant",
  "FacilityStr1": "630 Union Texas Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Haughton",
  "FacilityState": "LA",
  "FacilityZipCode": "71037",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22015",
  "LEPC": "Bossier-Caddo Parish LEPC",
  "FacilityLatDecDegs": "32.515833",
  "FacilityLongDecDegs": "-093.531110",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.energytransfer.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 610792264,
  "ParentCompanyName": "Energy Transfer LP",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Energy Transfer LP",
  "OperatorStr1": "8111 Westchester Dr Ste 600",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75225",
  "OperatorZipCodeExt": "6142",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000064191",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0400-00006-V6",
  "SafetyInspectionDate": "2018-10-09 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-07-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-07-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-07-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-07-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.515833,
  "FRS_Long": -93.53111,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132672,
      "AltID": "Sligo Gas Plant",
      "FacilityID": 1000106216,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000166175,
          "ProcessID": 1000132672,
          "ChemicalID": 155,
          "Quantity": 635328.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000149009,
              "ProcessChemicalID": 1000166175,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000149010,
              "ProcessChemicalID": 1000166175,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000149011,
              "ProcessChemicalID": 1000166175,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000149012,
              "ProcessChemicalID": 1000166175,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000149013,
              "ProcessChemicalID": 1000166175,
              "ChemicalID": 125
            }
          ]
        },
        {
          "ProcessChemicalID": 1000166176,
          "ProcessID": 1000132672,
          "ChemicalID": 155,
          "Quantity": 1550340.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000148922,
              "ProcessChemicalID": 1000166176,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000148923,
              "ProcessChemicalID": 1000166176,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000148924,
              "ProcessChemicalID": 1000166176,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000149005,
              "ProcessChemicalID": 1000166176,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000149006,
              "ProcessChemicalID": 1000166176,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000149007,
              "ProcessChemicalID": 1000166176,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000149008,
              "ProcessChemicalID": 1000166176,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000134124,
          "ProcessID": 1000132672,
          "NAICSCode": "21111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000114342,
              "Process_NAICS_ID": 1000134124,
              "SafetyReviewDate": "2022-11-10 00:00:00",
              "PHA_Date": "2024-11-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-09-13 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-11-30 00:00:00",
              "TrainingReviewDate": "2023-01-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-01-25 00:00:00",
              "EquipmentInspectionDate": "2023-07-13 00:00:00",
              "EquipmentTested": "Tank Inspection",
              "ChangeMgmtDate": "2023-01-24 00:00:00",
              "ChangeMgmtReviewDate": "2023-01-17 00:00:00",
              "PreStartupReviewDate": "2023-01-17 00:00:00",
              "ComplianceAuditDate": "2023-01-25 00:00:00",
              "AuditCompletionDate": "2023-10-31 00:00:00",
              "IncidentInvestigationDate": "2020-03-16 00:00:00",
              "InvestigationChangeDate": "2022-11-19 00:00:00",
              "ParticipationPlansReviewDate": "2023-01-17 00:00:00",
              "HotWorkPermitReviewDate": "2023-02-01 00:00:00",
              "ContractorSafetyReviewDate": "2023-01-25 00:00:00",
              "ContractorSafetyEvalDate": "2022-02-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000143404,
                  "PreventionProgram3ID": 1000114342,
                  "ProcessChemicalID": 1000166176
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106216,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-12-06 00:00:00",
    "ERTrainingDate": "2022-12-06 00:00:00",
    "CoordinatingAgencyName": "Haughton Fire Department",
    "CoordinatingAgencyPhone": "3189499500",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000106216,
      "SummaryText": "its and hazard reviews as required and make improvements to safety based on findings of the audits and reviews."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000106216,
      "SummaryText": "mage, environmental loss, or personal injury.  An incident investigation is initiated as promptly as possible to thoroughly investigate and analyze the incident.  This investigation is lead by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. \n\nEmergency Planning and Response\n\nThe plan for emergencies at the Sligo Plant is to contact local fire and emergency response coordinators.  The Sligo Plant has already coordinated with the Haughton Fire Department for such emergencies.  Sligo Plant personnel are not first responders.  The intent is to facilitate the prompt evacuation of employees when necessary and to account for all personnel.  \n\nCompliance Audits\n\nTo help ensure that the accident prevention program is properly functioning, the Sligo Plant periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  The audit team includes those knowledgeable in the process, operations personnel, and at least one person trained in audit techniques and practices.  The audit team develops findings and corrective actions are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nEnergy Transfer is committed to operating the Sligo Plant in a safe manner for workers, the public, and the environment.  Energy Transfer personnel have an opportunity to make suggestions that could improve the safety of this facility during monthly regional safety meetings.  Energy Transfer will also conduct compliance aud"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106216,
      "SummaryText": "and emergency procedures are in place, and that training of each employee involved in operating the process or equipment has been completed. A standard checklist is used to document compliance.\n\nMechanical Integrity\n\nThe Sligo Plant has established programs, procedures and practices that are required to ensure that equipment used to process, store, or handle highly hazardous chemicals and/or flammable gas or liquid is designed, constructed, installed, and maintained to minimize the risk of a release. Equipment examples include vessels, storage tanks, piping systems, and relief and vent systems with associated emergency shutdown systems and controls (i.e., monitoring devices, sensors, alarms, and interlocks).\n\nMaintenance personnel receive training on (1) an overview of the process, (2) a review of the process hazards, and (3) the procedures applicable to the employee's job tasks to ensure that the employees can perform the job tasks in a safe and satisfactory manner.  Process equipment inspection and testing follows recognized and generally accepted good engineering practices.  Equipment deficiencies that are outside of acceptable limits are corrected before further use or in a safe and timely manner when necessary means are taken to ensure safe operation.\n\nManagement of Change \n\nThe Sligo Plant has a comprehensive system to manage and document changes to all covered processes. A systematic approach is followed to control and manage facility changes in order to minimize the possibility that such changes will have an adverse impact on personnel safety, equipment, or the environment.  Employees involved in process operations and maintenance and contract employees whose job tasks might be affected by process changes are informed of and trained in the change prior to process start-up.\n\nIncident Investigation\n\nThe Sligo Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property da"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106216,
      "SummaryText": "ures are revised as necessary through the management of change process. \n\nTraining\n\nTo complement the written process operation procedures, the Sligo Plant has implemented a comprehensive training program for all employees. New employees receive job specific basic training in plant operations. Employee training includes emphasis on safety and health hazards, emergency shutdown operations, and safe work practices. Operators demonstrating adequate knowledge to safely perform duties and tasks are allowed to work independently.\n\nHot Work Permit\n\nThe Sligo Plant issues a hot work permit for all hot work operations conducted on or near a covered process.  The Sligo Plant provides Hot Work Permit training to all plant employees. Copies of issued work permits are maintained in Operations and Maintenance for a period of 1 year following completion of work.\n\nContractors\n\nThe Sligo Plant periodically uses contractors to perform maintenance or repair, turnaround, major renovations, or specialty work on or adjacent to a covered process.  Because some contractors work on or near process equipment, the plant has procedures in place to ensure that contractors (1) are trained in the work practices necessary to safely perform his/her job, (2) follow the safety rules of the location including the safe work practices, (3) advise the plant of any unique hazards presented by the contractor, and (4) notify the facility of all illnesses and injuries that occur in the process areas.  \n\nPre-Startup Safety Reviews (PSSRs)\n\nThe Sligo Plant conducts a PSSR for any facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides an additional check to make sure that construction and equipment are in accordance with design specification, that adequate safety, operating, maintenance,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106216,
      "SummaryText": "prehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\n\nThe Sligo Plant primarily uses the HAZOP and checklist methods to perform these evaluations. Combined, these techniques provide a highly structured approach where process parameters such as flow and temperature are examined for deviations from their intended design. Deviation effects are considered in order to determine resulting potential hazards while preliminary recommendations for improvement are proposed.\n\nThe PHA team findings are promptly and systematically addressed.  The Sligo Plant assures that the recommendations are documented and resolved in a timely manner. This documentation includes the actions to be taken and a written schedule of completion dates.   The plant also provides proof of communication with operating, maintenance, and other employees whose work assignments are in the process and who may be affected by the recommendations. \n\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original design safety features, the plant periodically updates and revalidates the hazard analysis results.  These periodic reviews will be conducted at least every five years by the PHA team.  \n\nOperating Procedures\n\nThe Sligo Plant maintains written procedures that address various modes of process operations, such as (1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) startup following a turnaround or after an emergency shutdown.  These procedures can be used as a reference by experienced operators and provide a consistent training basis for new operators. Operating procedures are periodically reviewed and certified annually as current.  When a process change occurs, operating proced"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106216,
      "SummaryText": "n\n\nEnable Midstream and the Sligo Plant actively encourage all levels of employees and contract employees to participate in creating a safe work environment.   This participation begins with well-established mechanisms of communication with all employees regarding covered process information.  Employees are involved in maintaining PSM rule compliance based on their knowledge, skill, job responsibilities, and experience.  \n\nProcess Safety Information \n\nThe Sligo Plant maintains written information intended to provide a foundation for identifying and understanding the process hazards.  This information addresses chemical properties, inventories, and associated hazards, as well as for key process parameter limits and equipment design basis/configuration information.  Specific departments within the plant are assigned responsibility for maintaining up-to-date process safety information.  \n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in each chemical Safety Data Sheets (SDS).  This information is supplemented, when required, by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  In addition, the plant has documented safety-related limits for specific process parameters and ensures limit maintenance by using highly trained personnel, process controls, and monitoring and protective instrument systems.\n\nThe plant also maintains documentation that provides information about the design and construction of process equipment.  Equipment information includes construction materials, design pressure, and temperature and electrical ratings.  This information  provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nProcess Hazard Analysis (PHA)\n\nThe Sligo Plant has a com"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106216,
      "SummaryText": "The Risk Management Plan for the Sligo Plant is being updated because of the 5 year anniversary update requirement.\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Sligo Plant has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of the facility processes.  The Energy Transfer policy is to implement reasonable controls to prevent foreseeable releases of substances.  \n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nEnergy Transfer operates the Sligo Plant located in Bossier Parish, Louisiana.  The Sligo Plant receives raw natural gas from well production.  The raw gas is dehydrated and contaminants removed.  Marketable natural gas is delivered via pipelines.  Natural gas liquids are extracted and stored on site.  The extracted natural gas liquids include ethane, propane, butane, and a pentane-natural gasoline mixture that are delivered to market via transportation vehicles.  There are no listed toxic substances which exceed their respective threshold quantities stored at this facility. \n\nFIVE YEAR ACCIDENT HISTORY\n\nThe Sligo Plant has not had any accidental releases during the past five years that meet the criteria for an accidental release as discussed in 40 CFR 68.42.\n\nLOCAL EMERGENCY RESPONSE COORDINATION\n\nThe Sligo Plant has coordinated its emergency response activities with the local emergency planning and response agencies as required in 40 CFR 68.12(b)(3).  \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the accident prevention program in place at the Sligo Plant.  Because plant processes are subject to EPA RMP regulations and to OSHA PSM standards, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\n\nEmployee Participatio"
    }
  ]
}