{
  "FacilityID": 1000012829,
  "FacilityName": "Sara Lee Corporation -  Forest Park",
  "FacilityStr1": "273 Central Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Forest Park",
  "FacilityState": "GA",
  "FacilityZipCode": "30297",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13063",
  "LEPC": "Clayton County",
  "FacilityLatDecDegs": "33.622315",
  "FacilityLongDecDegs": "-084.381868",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 47614110,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 7322340,
  "Company2DUNS": 7322340,
  "OperatorName": "Sara Lee Bakery Group",
  "OperatorStr1": "3500 Lacey Rd",
  "OperatorStr2": null,
  "OperatorCity": "Downers Grove",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60515",
  "OperatorZipCodeExt": null,
  "RMPContact": "Phil Schillinger",
  "RMPTitle": "Plant Manager",
  "FTE": 285,
  "OtherEPAFacilityID": "GAD 984269290",
  "EPAFacilityID": "100000161077",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-01-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-09-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-09-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-09-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-09-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.62281,
  "FRS_Long": -84.38109,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "150",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000015978,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000012829,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000016362,
          "ProcessID": 1000015978,
          "NAICSCode": "311822",
          "_desc": {
            "NAICS_CODE": "311822",
            "NAICS_DESCRIPTION": "Flour Mixes and Dough Manufacturing from Purchased Flour"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000018931,
          "ProcessID": 1000015978,
          "ChemicalID": 56,
          "Quantity": 13500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000518931,
          "ProcessID": 1000015978,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012829,
      "SummaryText": "Executive Summary\n\nAccidental Release Prevention and Emergency Response Policies\n\nSara Lee of Forest Park a wholly owned subsidiary of Sara Lee Corporation, owns and operates a commercial bakery facility in Forest Park, Georgia.  It is the policy of Sara Lee of Forest Park to comply with all applicable federal, state and local environmental and safety laws and regulations, and to conduct its business in an environmentally sound manner that avoids any unreasonable adverse impact on the environment or its neighboring community.\n\nIn keeping with this policy, Sara Lee of Forest Park has developed and implemented OSHA's Process Safety Management and EPA's Risk Management programs to ensure the safety of our employees and the surrounding community.  The Risk Management program includes procedures: (1) to identify potentially hazardous chemicals at the facility, (2) for maintaining a safe working environment and, thereby, help prevent the release of hazardous chemicals, and (3) for minimizing the consequences of a release should one occur.\n\nStationary Source and Regulated Substances Handled\n\nSara Lee of Forest Park??A?facility makes refrigerated bakery products for public consumption. The major processes at the Forest Park facility include flour handling and storage, ingredient mixing, dough proofing, baking and product packaging and distribution.  Raw materials are delivered to this facility by trucks.\n\nThe only RMP regulated chemical handled by Sara Lee of Forest Park facility is anhydrous ammonia.  Anhydrous ammonia is used at the facility in the refrigeration system for cooling the building, cooling and freezing products.  The anhydrous ammonia refrigeration system is a closed loop system.   Anhydrous ammonia is delivered to the facility by supplier tank trucks to initially charge the system and occasionally thereafter to top-off the system if needed, to replenish from periodic maintenance.  \n\nSara Lee of Forest Park has in place policies that limit the amount of ammon"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012829,
      "SummaryText": "ia at the facility.  In addition, this facility complies with the ANSI/ASHRAE Standard 15 for ammonia refrigeration.  \n\nWorst-Case and Alternate-Case Release Scenarios\n\nAs stipulated in EPA guidelines, 40 CFR Part 68.25, the worst-case and alternate case release scenarios were calculated for the covered process at the facility and the results are held on file at the Sara Lee of Forest Park facility. \n\nGeneral Accidental Release Prevention Program and Specific Prevention Steps\n\nThe Sara Lee of Forest Park facility is subject to both EPA??A?s Accidental Release Prevention program and OSHA??A?s Process Safety Management (PSM) program.  Under both of these programs, the facility has outlined specific procedures that it follows to prevent or minimize the release of anhydrous ammonia to the environment.  Specifically, the facility has performed a process hazard analysis (PHA) of the ammonia system and will repeat this process at least every 5 years.  The purpose of the PHA is to provide a systematic approach for identifying, evaluating, and controlling potential hazards associated with the ammonia system.  In addition, the facility performs regular training of its employees to ensure that the procedures developed for the safe use and handling of ammonia is adhered to all the time.  Finally, the facility has a regular inspection and maintenance program to ensure that the ammonia system is operated and maintained according to specific ammonia industry safety standards.  \nIt is Earthgrains policy and belief that safe operating and maintenance practices and accident prevention programs are the key to obtaining safe operation and achieving accident prevention.\n\nFive Year Accident History\n\nSara Lee of Forest Park facility has had no reportable releases of ammonia in the last five years.  \n\nEmergency Response Program\n\nSara Lee of Forest Park has devised a comprehensive emergency response program, designed to protect both employees and the community in the event of a release. The"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012829,
      "SummaryText": " Sara Lee of Forest Park Emergency Response Policy focuses on evacuation of the facility in the event of an ammonia emergency, with the assistance of local emergency response agencies performing rescue, firefighting, first-aid, medical treatment, and other response functions. The facility maintains a written Emergency Response Plan that documents specific procedures to be implemented in the event of various emergencies, including ammonia releases.  The Emergency Response Plan includes procedures for facility evacuation, as well as notification of the local emergency response agencies that are responsible for notifying the public. The plan is promptly updated to reflect any pertinent changes taking place within the facility that would require modified procedures.\n\nAdditionally Sara Lee of Forest Park has trained on-site personnel to respond to accidental ammonia releases. These personnel are trained in accordance with 29 CFR 1910.120, Hazardous Operations and Emergency Response regulations according to their duties and functions. These personnel also receive initial training and annual update of training thereafter.   \n\n\nPlanned Changes to Improve Safety\n\nNo changes to the Earthgrains ammonia refrigeration process is planned at this time.   However, the process will be subjected to regular process hazard analyses reviews for the purpose of identifying and implementing potential improvements. Facility personnel will also periodically review all potential opportunities to improve the safety of our personnel, the surrounding community, and the ammonia refrigeration process."
    }
  ]
}