{
  "FacilityID": 1000043530,
  "FacilityName": "Santa Clara Valley Gas Plant",
  "FacilityStr1": "3824 Guiberson Road",
  "FacilityStr2": null,
  "FacilityCity": "Piru",
  "FacilityState": "CA",
  "FacilityZipCode": "93060",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.387917",
  "FacilityLongDecDegs": "-118.796222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 137659471,
  "ParentCompanyName": "California Resources Production Corp.",
  "Company2Name": "Occidental Petroleum Corporation",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "California Resources Production Cor",
  "OperatorStr1": "3055 West Pacific Coast Highway",
  "OperatorStr2": null,
  "OperatorCity": "Ventura",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93001",
  "OperatorZipCodeExt": null,
  "RMPContact": "Charlie Plant",
  "RMPTitle": "Operations Manager",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000128934",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-10-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-10-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 34.38958,
  "FRS_Long": -118.79583,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054713,
      "AltID": "Natural Gas Extraction",
      "FacilityID": 1000043530,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055518,
          "ProcessID": 1000054713,
          "NAICSCode": "211111",
          "_desc": {
            "NAICS_CODE": "211111",
            "NAICS_DESCRIPTION": "Crude Petroleum and Natural Gas Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066585,
          "ProcessID": 1000054713,
          "ChemicalID": 125,
          "Quantity": 98000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000066586,
          "ProcessID": 1000054713,
          "ChemicalID": 155,
          "Quantity": 430000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000056252,
              "ProcessChemicalID": 1000066586,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000056253,
              "ProcessChemicalID": 1000066586,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000056254,
              "ProcessChemicalID": 1000066586,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000056255,
              "ProcessChemicalID": 1000066586,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000066595,
          "ProcessID": 1000054713,
          "ChemicalID": 98,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000566585,
          "ProcessID": 1000054713,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000566586,
          "ProcessID": 1000054713,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000566595,
          "ProcessID": 1000054713,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043530,
      "SummaryText": "1 EXECUTIVE SUMMARY\n\n\n\n1.1  Accidental Release Prevention and Emergency Response Policies\n\nVintage Production California LLC (VPC) is the owner of the Santa Clara Valley Gas Plant (SCVGP).  VPC adheres to written operating procedures to protect its employees, environment, property, and the general public from any off-site impacts that could occur as a result of operations at the plant.  VPC operates its facilities in compliance with applicable federal, state, and local safety, health, and environmental regulations, which serves to reinforce its long-standing commitment to worker and public safety at their facilities.  This commitment is demonstrated by the resources invested in accident prevention such as personnel training, building safety into the design, installation, operation, and maintenance of the facility.  The VPC philosophy is to implement engineering and administrative controls to eliminate preventable releases of regulated substances, as well as non-regulated substances.\n\n\n\nThe VPC SCVGP Emergency Action Plan relies on local emergency responders and emergency response agencies in case of an incident. Agencies in conjunction with plant personnel are expected to respond to the hazards of a chemical release and employ procedures to mitigate the release of such chemicals to the environment.  The highest priority in an emergency response is for the safety of responding emergency personnel as well as affected and non-affected personnel.  Emergency procedures are implemented according to what is appropriate based on a hazard assessment performed at the scene of the incident.  VPC will always attempt to have an Incident Command structure in place to assist emergency response personnel in the immediate control of any release.  Priorities for response are based on life, environment and property, in that order.\n\n\n\nManagement supports plant safety by means of periodic visits to the plant by management personnel, and by stationing a qualified operator on-site during "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043530,
      "SummaryText": "work hours. Employees are provided annual training in HAZWOPER 29 CFR 1910.120, Emergency Action Plans 29 CFR 1910.38, (including tabletop drills that may include local emergency response agencies depending on their availability), Fire Prevention Plans 29 CFR 1910.39 and training requirements of 20 CFR 1910.119 Process Safety Management.\n\n\n\n1.2  Facility Description\n\nThe Santa Clara Valley Gas Plant is located in Ventura County, approximately 25 miles inland from the Pacific Ocean and approximately 6 miles south of Piru, California.  Torrey Canyon Road dead-ends into Guiberson Road at the entrance to the facility.  The facility is relatively remote and bounded by private property on the south and southeast and citrus groves on the northeast.  A dry creek wash (Torrey Canyon Wash) is located along the northeast boundary of the facility. \n\n\n\nThe SCVG Plant consists of one Program 3 process, which utilizes several operations to produce natural gas and natural gas liquids product.  Two gas streams come into the plant from local oil production fields and enter separate gas scrubbers, then flow through three compressor skids where the gas is compressed to the Southern California Gas Company specifications.  The gas is cooled and sent through the turbo expander where gasoline, butane, and propane are separated out of the process stream and sent to a pressure vessel for storage before custody transfer.  The natural gas from the process is dry gas, which is sold to a public utility.\n\n\n\n1.3  Regulated Substances\n\nRegulated flammable mixtures containing methane, ethane, propane, butane, pentane and iso-pentane are present at the facility.  No regulated toxic substances are present at the facility in excess of the threshold quantities establish by this regulation.\n\n\n\n1.4  Summary of Accidental Release Prevention Program\n\nThe Santa Clara Valley Gas Plant is subject to RMP requirements as well as OSHA?s 29 CFR 1910.119 Process Safety Management of highly hazardous chemicals (PSM)"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043530,
      "SummaryText": ".  The Santa Clara Valley Gas Plant, by complying with the PSM and RMP standards, has im-plemented all of the requirements of the RMP Program 3 prevention program.\n\n\n\nCompliance with PSM?s comprehensive program ensures the operating integrity of the plant processes that handle flammable materials.  The objective of the company?s PSM program is to prevent unwanted releases of hazardous chemicals.  To control these types of hazards, VPC has proactively identified, evaluated and developed operating and main-tenance procedures to prevent, or at least mitigate, the release of chemicals due to fail-ures in the process or equipment.  VPC relies on its workforce expertise, experience, judgment and training to properly implement and maintain the PSM program.  An effective PSM program requires a systematic approach to evaluating the entire chemical process.  Using this approach the following components were considered in the evaluation: 1) the process chemicals; 2) process technology; 3) process equipment; 4) operations and maintenance activities and procedures; 7) training programs; and 8) other elements that affect the process.  The various lines of defense that have been incorporated into the de-sign and operation of the process to prevent or mitigate the release of hazardous chemi-cals have been evaluated and tested to assure their effectiveness at each level. \n\n\n\n1.5  Chemical Specific Prevention Steps\n\nIn addition to implementing the PSM elements, the Santa Clara Valley Gas Plant utilizes specific safety features for the prevention, detection and control or releases of regulated (and other) substances.  The Santa Clara Valley Gas Plant utilizes control and detection equipment located in and around the facility to minimize the risk of an accident involving hazardous materials.  This equipment includes:\n\n?    Relief and/or safety valves;\n\n?    Flare system\n\n?    High temperature alarms and/or shutdowns;\n\n?    Flame detectors;\n\n?    Combustible Gas Detectors;\n\n?    Fire Protection System;\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043530,
      "SummaryText": "?    Emergency Shutdown Systems (ESD)\n\n\n\n1.6  Five-Year Accident History\n\nThere have been no incidents with off-site impacts involving a regulated substance as defined in the regulation at the Santa Clara Gas Plant in the past five years.\n\n\n\n1.7  Emergency Action Plan Summary\n\nVPC has written emergency procedures to address hazards that may be encountered during response or follow-up of an emergency at the Santa Clara Valley Gas Plant.  These emergency procedures address the following issues: \n\n?    Injury requiring medical attention\n\n?    Bomb Threats/Civil Disorder\n\n?    Wild land or Adjacent Proper Fire\n\n?    Fire or Explosion\n\n?    Butane/Propane (B/P) Release\n\n?    Gasoline Release \n\n?    Earthquake\n\n?    Man Down Unconscious\n\n?    Personal Injuries\n\n?    Gas Leak in the Facility\n\n\n\nIn addition, the Santa Clara Valley Gas Plant follows procedures that address the maintenance, inspection, and testing of emergency response equipment and alarms on a routine basis.\n\n\n\nWritten emergency procedures are in compliance with OSHA Standard 29 CFR 1910.38 (Emergency Action Plans), and the element of PSM.  Training on the emergency action plan enhances the preparedness of employees to recognize and respond to any release of hazardous chemicals.  The emergency action plan procedures provide a comprehensive approach for managing emergencies including prevention, preparedness, and hazard assessment.\n\n\n\nIn addition to the above, VPC also complies with 29 CFR 1910.39, Fire Prevention Plan. The purpose of the fire prevention plan is to inform employees of the:  1.) major fire hazards in the process area; 2.) proper handling and storage procedures for hazardous materials; 3.) potential ignition sources and their control; and 4.) type of fire protection equipment necessary to control each major hazard within the process area and surroundings.  The fire prevention plan also includes procedures for regular maintenance of safeguards installed on heat-producing equipment to prevent the accidental ignition of flammable"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043530,
      "SummaryText": " materials in the process.\n\n\n\n1.8  Planned Changes to Improve Safety \n\nVPC adopts a philosophy of continuous improvement for safety. VPC completed a Process Hazard Analysis in August 2013. Recommendations from the study are being evaluated and implemented. Since the last RMP submittal, a flare system was installed for complete combustion of most fugitive gas releases from the plant due to compressor shut downs and vapors vented from vessels during process upsets."
    }
  ]
}