{
  "FacilityID": 1000033859,
  "FacilityName": "Americold - Carson 2110",
  "FacilityStr1": "1610 Sepulveda Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Carson",
  "FacilityState": "CA",
  "FacilityZipCode": "90745",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.807121",
  "FacilityLongDecDegs": "-118.242317",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.americold.com",
  "FacilityEmailAddress": "Jennifer.campbell@Americold.com",
  "FacilityDUNS": 58149378,
  "ParentCompanyName": "AmeriCold Logistics LLC",
  "Company2Name": null,
  "CompanyDUNS": 58149378,
  "Company2DUNS": 0,
  "OperatorName": "AmeriCold Logistics LLC",
  "OperatorStr1": "10 Glenlake Parkway, Suite 800",
  "OperatorStr2": "South Tower",
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30328",
  "OperatorZipCodeExt": null,
  "RMPContact": "Javier Cortes",
  "RMPTitle": "General Manager",
  "FTE": 90,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000202229",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-11-29 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Updated 8/27/07 from Anna's computer",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-04-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-04-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-04-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000041347,
      "AltID": "Nh3 System",
      "FacilityID": 1000033859,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000041770,
          "ProcessID": 1000041347,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049611,
          "ProcessID": 1000041347,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000549611,
          "ProcessID": 1000041347,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033859,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe facility uses ammonia as a refrigerant within a closed system.  Ammonia is a hazardous substance that must be handled properly in order to prevent accidental releases and injuries.  It is the policy of Americold to conduct all operations (including the ammonia refrigeration system) in a safe manner.  This policy extends to all employees and contractors at the facility.  Americold implements this policy towards chemical and general safety through on-going employee participation, training, written operating procedures, maintenance, inspections, safety committee meetings, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  \n\n\n\nAmericold - Carson has coordinated emergency response efforts with the local fire department in the event of an ammonia-related emergency.  However, additional contract resources may be utilized as well.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Americold - Carson facility is located at 1610 Sepulveda Blvd in Carson, California.  The facility is situated approximately 1 mile south of the 405 Freeway and 2 miles east of the 710 Freeway.  The entire facility, which consists of just one building, was constructed in 2002 with operations scheduled to begin in April of the same year.  The area immediately surrounding the facility is industrial with some residential areas farther away to the East and West.  Americold employs 40 people onsite, while Americold's tenant, Oppenheimer, has approximately 50 employees.  Total number of full time employees is 90.\n\n\n\nThe primary business of the Americold - Carson facility is to provide refrigerated warehousing and storage for various food products.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 12,000 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033859,
      "SummaryText": ", and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for the dock area, and warehouse freezer rooms.  Typical operating conditions range from approximately 8 psig on the low pressure side of the system to 125 psig on the high side. \n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nIn order to operate the ammonia refrigeration system, the facility complies with OSHA's PSM, EPA's RMP, and California's Accidental Release Prevention (CalARP) Program Level 3.  These regulations impose numerous requirements on the facility to ensure the safety of the public and on-site workers.  The following summarizes the key compliance programs that have been implemented by Americold to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre-Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Hot Work Permit program ensures that Americold's employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\n\n\n\nIt is important to note that the refrigeration system has been designed with several safety features to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033859,
      "SummaryText": " prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  The facility has also installed ammonia sensors at strategic locations throughout the facility which will send an alarm to an off-site monitoring company when an ammonia release is detected; and automatically shut down some or all of the equipment depending upon the extent of the release.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nAn investigation into the Americold facility's accident history during the Five-Year Revalidation revealed that there have been no releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds over the past five years (March 2008 to April 2013). In addition, there have been no injuries resulting from an ammonia release.  \n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nAmericold has an emergency action plan in effect at the facility.  The Emergency Action Plan (Plan) is detailed in the Emergency Response Program section of the PSM/RMP/CalARP document, which is maintained at the facility.  Emergency response activities are coordinated with the Los Angeles County Fire Department and the local fire houses.  For the Americold - Carson facility, all employees will be trained in ammonia awareness and the procedures involved should they detect a leak.  Additional emergency responders will be called as needed, including the LA County Hazardous Materials Response Team, local Fire Departments, and local Police Departments.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, the National Response Center will be called.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nPrior to the system being filled with ammonia, the refrigeration system was thoroughly exami"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033859,
      "SummaryText": "ned for safety hazards by way of a Process Hazard Analysis (PHA).  The PHA of the refrigeration system consisted of the following:\n\n\n\n(1)    Hazard and Operability (HAZOP) study;\n\n(2)    Facility Inspection;\n\n(3)    seismic assessment; and\n\n(4)    series of safety checklists.\n\n\n\nThe PHA study generated a list of recommendations for improving safety at the facility, all of which have been verified as complete.\n\n"
    }
  ]
}