{
  "FacilityID": 1000091663,
  "FacilityName": "George Chiala Farms, Inc",
  "FacilityStr1": "9351 Fairview Road",
  "FacilityStr2": null,
  "FacilityCity": "Hollister",
  "FacilityState": "CA",
  "FacilityZipCode": "95023",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06069",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.938985",
  "FacilityLongDecDegs": "-121.402508",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "gcfarmsinc.com",
  "FacilityEmailAddress": "customer.service@gcfarms.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "George Chiala Farms, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Tim Chiala",
  "OperatorStr1": "9351 Fairview Road",
  "OperatorStr2": null,
  "OperatorCity": "Hollister",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95023",
  "OperatorZipCodeExt": null,
  "RMPContact": "Nick Craft",
  "RMPTitle": "Environmental Manager",
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000231359",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-11-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-02-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-02-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-02-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-02-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000113910,
      "AltID": null,
      "FacilityID": 1000091663,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000115283,
          "ProcessID": 1000113910,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000142314,
          "ProcessID": 1000113910,
          "ChemicalID": 56,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000642314,
          "ProcessID": 1000113910,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091663,
      "SummaryText": "A. RMP EXECUTIVE SUMMARY COMPONENT\n\n[40 CFR 68.155/19 CCR 2745.3]\n\n\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nGeorge Chiala Farms conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required.\n\n\n\nOn-site personnel provide initial emergency response. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. Refrigeration contractors would also be on-call to provide emergency response.\n\n\n\nEmergency response training will be conducted yearly for current employees and as required for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\n\n\n\n\n\n2. Stationary Source and Regulated Substances Handled\n\n\n\nGeorge Chiala Farms uses anhydrous ammonia as a refrigerant in their operations. Drawings in RMP Binder Chapter 8 - Appendix 8.1 show the facility location map and site plan.\n\n\n\nGeorge Chiala Farms has over 10,000 lbs. of ammonia in any single refrigeration system. Anhydrous ammonia is used as a refrigerant in product storage, freezer storage, water chilling and produce freezing operations. The ammonia refrigeration system was built in 2015 as part of the newly constructed Chiala Farms facility. The refrigeration system was constructed as per 2013 CMC, 2013 CFC and industry standards. The facility has (4) re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091663,
      "SummaryText": "frigerated rooms (Raw Product, Processing, Freezer, and Dock Area). Process Room houses IQF tunnel freezers and a water chiller. The system's compressors and vessels are located in a dedicated Engine Room with refrigeration equipment both inside and immediately outside the room. The evaporative condensers are mounted above the Engine Room. Electrical services and controls are provided in the Engine and Electrical Rooms.\n\n\n\nThe refrigeration system is comprised of mechanical equipment including, but not limited to, evaporative condensers, screw compressors, pressure vessels, a water chiller, room cooling evaporator fan coils, tunnel freezers, refrigerant pumps, hand and control valves, ammonia detection and PLC controls systems, and a diffusion tank. \n\n\n\nThe total quantity of ammonia currently at the site is approximately 31,000 lb. Public receptors are located within the worst-case accidental release toxic endpoint area.\n\n\n\nThe compressors have safety cutouts that will shut down the compressors upon detection of unsafe operating conditions. All pressure vessels and the compressors are protected against high-pressure situations by safety relief valves. All low side vessels that are connected directly to the suction of compressor is installed with high level float switches that shuts down compressor upon detection of high liquid level in the vessel. All cold storage rooms and the refrigeration machinery room are installed with ammonia sensors that triggers an alarm upon detection of ammonia vapor in the vicinity of the sensor. Exhaust fans are activated in the engine room and refrigeration control system sends alarms to refrigeration manager in case of emergency situation or any high pressure, high temp or ammonia detection.\n\n\n\nRefrigeration drawings are located in RMP Binder Appendix 8.1-Refrigeration System Drawings. International Institute of Ammonia Refrigeration (IIAR) \"Ammonia Refrigeration Safety Inspection Checklists,\" located in RMP Binder Appendix 12, descri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000091663,
      "SummaryText": "be equipment details.\n\nThe refrigeration systems at this facility are a single-stage vapor compression cycle operating at two (2) suction pressures. In general, the process chemistry for each system is described in RMP Binder Chapter 8.3.\n\n\n\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See RMP Binder Appendix 8.4 for Safety Data Sheets (SDS) for anhydrous ammonia.\n\n\n\n3. General Accidental Release Prevention Program\n\n\n\nGeorge Chiala Farms maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release, see RMP Binder Chapter 16-Incident Investigation.\n\n\n\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. There are emergency shut-off switches outside the refrigeration machinery room for shutting down the system. Ammonia detectors are installed in processing room, engine room and diffusion tank. Personnel will automatically be notified if any detector exceeds its set point. Monitoring is done 24 hours per day. An emergency automatic crossover system and diffusion tank allow system pressure to be relieved automatically. All of the relief valves at the facility are tied into an am"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000091663,
      "SummaryText": "monia diffusion tank to prevent high-pressure releases to ambient.\n\n\n\n4. Five-Year Accident History\n\n\n\nGeorge Chiala Farms has one accident history within the past five years. Facility experienced a pinhole leak in IQF due to a welding process causing pinhole damage in IQF coil tube. Normally, IQF operates at vacuum pressure, therefore leak was not detected until coil went into defrost mode. This accident was modeled in alternative release scenario. \n\n\n\n5. Emergency Response Program\n\n\n\nIn the event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Safety Coordinator is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The Safety Coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required. A description of the emergency response plan is included in RMP Binder Chapter 20.\n\n\n\n6. Planned Changes to Improve Safety\n\n\n\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed on the tables located in RMP Binder Chapter 0.0. The table items are a result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, and a Safety Inspection performed by a qualified person. Some corrective items in the recommendation table originate from multiple codes but are listed only once. Based on the severity of the hazards identified, priority level and implementation deadlines are also recommended.\n\n\n\nAll refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation.\n\n"
    }
  ]
}