{
  "FacilityID": 1000068313,
  "FacilityName": "Kelton Gas Plant",
  "FacilityStr1": "Section 3",
  "FacilityStr2": "AB+M Block A2 Survey",
  "FacilityCity": "Wheeler",
  "FacilityState": "TX",
  "FacilityZipCode": "79096",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48483",
  "LEPC": "Wheeler County EMA",
  "FacilityLatDecDegs": "35.437778",
  "FacilityLongDecDegs": "-100.113889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Durango Midstream LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kelton Gas Services",
  "OperatorStr1": "7551 FM 592",
  "OperatorStr2": null,
  "OperatorCity": "Wheeler",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79096",
  "OperatorZipCodeExt": null,
  "RMPContact": "Darrin Kennard",
  "RMPTitle": "VP Environmental, Health & Safety",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000146246",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-12-12 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "Program 1",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-03-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-03-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-03-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-11-10 00:00:00",
  "DeRegistrationEffectiveDate": "2021-11-01 00:00:00",
  "AnniversaryDate": "2023-03-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.43778,
  "FRS_Long": -100.11389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085682,
      "AltID": "NGL Extraction",
      "FacilityID": 1000068313,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000086884,
          "ProcessID": 1000085682,
          "NAICSCode": "211112",
          "_desc": {
            "NAICS_CODE": "211112",
            "NAICS_DESCRIPTION": "Natural Gas Liquid Extraction"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106994,
          "ProcessID": 1000085682,
          "ChemicalID": 155,
          "Quantity": 352400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000093445,
              "ProcessChemicalID": 1000106994,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000093446,
              "ProcessChemicalID": 1000106994,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000093450,
              "ProcessChemicalID": 1000106994,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000093451,
              "ProcessChemicalID": 1000106994,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000106995,
          "ProcessID": 1000085682,
          "ChemicalID": 155,
          "Quantity": 134200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000093452,
              "ProcessChemicalID": 1000106995,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000093453,
              "ProcessChemicalID": 1000106995,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000093454,
              "ProcessChemicalID": 1000106995,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000093455,
              "ProcessChemicalID": 1000106995,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000106996,
          "ProcessID": 1000085682,
          "ChemicalID": 98,
          "Quantity": 104900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606994,
          "ProcessID": 1000085682,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606995,
          "ProcessID": 1000085682,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606996,
          "ProcessID": 1000085682,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068313,
      "SummaryText": "ACCIDENT RELEASE PREVENTION AND RESPONSE POLICIES\n\n\n\nDurango Midstream, LLC owns and operates a natural gas processing facility, the Kelton Gas Plant, in Wheeler County, Texas. The plant is designed to process natural gas and recover liquid product from natural gas by physical separation and cryogenic means. Petroleum condensates are recovered from the inlet pipeline gas in this process for off-site sales.\n\n\n\nDurango Midstream, LLC has a commitment to workers and public safety. This commitment is demonstrated by our efforts in accident prevention, such as training personnel, quality assurance, and considering safety in the design, installation, operation and maintenance of our process. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, trained facility personnel will evaluate the situation, take actions within the capabilities of the facility, and notify the necessary outside agencies.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Kelton Gas Plant is located near Wheeler, Texas and operates a variety of processes to produce the following petroleum products:\n\n\n\n1.    Stabilized Condensate\n\n2.    Regulated Flammable Products:\n\na.    Methane\n\nb.    Ethane\n\nc.    Propane\n\nd.    Butane\n\ne.    Isobutane\n\nf.    Pentane\n\ng.    Isopentane\n\n\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\n\n\nA. Employee Participation\n\nDurango Midstream, LLC encourages employees to participate in all facets of process safety management and accident prevention as follows:\n\n1.    Updating and compiling technical documents and chemical information\n\n2.    Performing necessary calculations for PSM and RMP\n\n3.    Maintaining good engineering practices\n\n4.    Participating as a member of a process hazard analysis (PHA) team\n\n\n\nEmployees have access to all information pertaining to the accident prevention program.\n\n\n\nB. Process Safety Information\n\nDurango Midstream, LLC keeps a variety of technical documents that are used to help mainta"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068313,
      "SummaryText": "in safe operation of the processes. These technical documents address the following:\n\n1.    Chemical properties and associated hazards\n\n2.    Necessary Block Flow Diagrams of the process\n\n3.    Maximum intended inventories\n\n4.    Upper and Lower operating limits of equipment\n\n5.    Equipment design basis and configuration information\n\n6.    Identification of all necessary Regulatory equipment design documents\n\n7.    Sufficient information to assure good engineering practices\n\n\n\n Chemical specific information, including hazard and emergency response/exposure considerations, is provided in Safety Data Sheets (SDSs). For specific process areas, the facility has documented safety-related limits for specific process parameters such as temperatures, level and composition in the operators' procedures manual. The facility maintains the process within these limits by using process controls and monitoring instruments, trained personnel and protective instrument systems such as automated shutdown systems.\n\n\n\nThe facility also maintains numerous technical documents that provide information about the design and construction of the process equipment. This information includes materials of construction, design pressures, temperature and electrical ratings. This information, in combination with procedures and equipment operating history, provides a basis for inspection and maintenance activities, as well as for evaluating proposed process and facility changes to safety features in the process are not compromised.\n\n\n\nC. Process Hazard Analysis (PHA)\n\nDurango Midstream, LLC has a comprehensive program to identify and control hazards associated with the RMP covered process. This program systematically examines for potential hazards and puts controls in place to manage hazards. Process Hazard Analysis Studies (PHAs) are conducted using the HAZOP methodology,  with a team of Durango Midstream, LLC's employees who have operating and maintenance experience as well as engineering expertise. The team identifies"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068313,
      "SummaryText": " and evaluates potential hazards, and makes recommendations to mitigate the risk.  The team's recommendations are provided to Durango Midstream, LLC's Management for resolution. The approved mitigation options in response to the PHA team's findings are tracked until they are completed. The final resolution of each finding is documented and retained.\n\n\n\nThe facility periodically updates and revalidates the process hazard analysis results. These periodic reviews are conducted at least every five years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained.\n\n\n\nD. Operating Procedures\n\nDurango Midstream, LLC maintains written Operating Procedures of the covered process that address primary operations mandated by OSHA, EPA, Good Engineering Practice and manufacturers. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. Procedures are periodically reviewed and annually certified as currently accurate by management.. Operating procedures are readily available to operators and for other personnel to use as necessary to safely perform their job. \n\n\n\nE. Training\n\nDurango Midstream, LLC has implemented a comprehensive training program for all employees involved in operating the covered process. New employees receive basic training in process operations if they are not already familiar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. A performance review is administered and must be successfully completed during this training period. After the operator demonstrates adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068313,
      "SummaryText": "nd knowledge are maintained at an acceptable level. This refresher training is conducted at least every three years, or more frequently if requested. All training is documented for each operator, including the means used to verify and demonstrate skills.\n\n\n\nF. Contractors\n\nDurango Midstream, LLC uses contractors to supplement its workforce during periods of increased maintenance or construction activities. Because some contractors work on or near Covered Process equipment, the facility has procedures in place to ensure that contractors:\n\n1.    Perform their work in a safe manner\n\n2.    Have the appropriate knowledge and skills\n\n3.    Are aware of the hazards in their workplace\n\n4.    Understand what they should do in the event of an emergency\n\n5.    Understand and follow site safety rules\n\n6.    Inform facility personnel of any hazard that they find during their work\n\n\n\nThis is accomplished by providing contractors with:\n\n1.    A process overview\n\n2.    Information about safety and health hazards\n\n3.    Emergency response plan requirements\n\n4.    Safe work practices before beginning work\n\n\n\nIn addition, Durango Midstream, LLC Management will evaluate the contractor safety program and performance during the selection of a contractor. Facility personnel periodically monitor contractor performance regarding their safety obligations.\n\n\n\nG. Pre-Startup Safety Review (PSSR)\n\nDurango Midstream, LLC conducts a PSSR for any new facility modification that requires a change in the process safety information. The purpose of the PSSR is to see that safety features, procedures, personnel and equipment are appropriately prepared for startup before placing the equipment into service. This review provides one additional check that construction is in accordance with the design specifications and that all supporting systems are operationally ready. A PSSR involves field verification of the construction and services as assurance that the accident prevention program requirements are properly implemented.\n\n\n\nH. Mecha"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000068313,
      "SummaryText": "nical Integrity\n\nDurango Midstream, LLC has established practices and procedures for the safe operation of fixed, rotating and emergency shutdown equipment. The basic aspects of the program include, but are not limited to, the following:\n\n1.    Conducting training\n\n2.    Developing written procedures (LOTO and Equipment OEM Manuals)\n\n3.    Performing inspections and tests\n\n4.    Correcting identified deficiencies\n\n5.    Applying quality assurance measures\n\n\n\nIn combination, these activities form a system to maintain the mechanical integrity of the process.\n\nMaintenance personnel receive training on:\n\n1.    Overview of the process\n\n2.    Safety and Health hazards\n\n3.    Applicable maintenance procedures\n\n4.    Emergency response plan\n\n5.    Applicable safe work practices to help ensure that they can perform their jobs in a safe manner.\n\n\n\nInspections and tests are performed to help verify that equipment functions as intended and that equipment is within acceptable limits. If a deficiency is identified and the situation presents an immediate safety concern, the deficiency is corrected before placing the equipment back into service. \n\n\n\nAn integral part of the mechanical integrity program is quality assurance. Durango Midstream, LLC incorporates quality assurance measures into equipment purchases and repairs. This helps to determine that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\n\n\nI. Safe Work Practices\n\nDurango Midstream, LLC has safe work practices as mandated by OSHA and theEPA to help provide employee, public and process safety.\n\n\n\nJ. Management of Change\n\nDurango Midstream, LLC has a comprehensive system to manage changes to all reported Covered Processes. This system requires that changes to items such as process equipment, chemicals, technology and procedures be properly reviewed and authorized before being implemented. Affected chemical hazard information, process operating limits, and equipment information and "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000068313,
      "SummaryText": "procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are trained on the changes.\n\n\n\nK. Incident Investigation\n\nDurango Midstream, LLC promptly investigates all incidents related to a covered process that resulted in, or reasonably could have resulted in a fire/explosion, property damage, environmental loss or personal injury. The goal of each investigation is to determine the root cause and develop corrective action(s) to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations, and provides an overview to facility management for resolution. Corrective actions are tracked to closure and investigation reports are retained for at least five years.\n\n\n\nL. Compliance Audits\n\nA Compliance Audit addressing all OSHA PSM and EPA RMP is conducted at least every three years.   The audit team documents findings, develops recommendations, and provides the overall results to facility management in a written report. All corrective actions are tracked until they are completed, and the two most recent audit reports are retained at the facility.\n\n\n\nChemical-Specific Prevention Steps\n\nThe following is a description of existing features applicable to prevention of accidental release of regulated substances in this facility.\n\nUniversal Prevention Activities\n\nDurango Midstream, LLC's accident release prevention and response policies are applied to all RMP-covered processes. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\n\n\nSpecialized Safety Features\n\nSite specific control equipment (safety features) is located throughout the plant to:\n\n1.    Contain/control a release, and\n\n2.    Reduce the consequences of an RMP-regulated substance release\n\n\n\nThe following type of safety features are used in the covered process:\n\n\n\nRelease Detection\n\n1.    Process relief valves\n\n2.    Auto"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000068313,
      "SummaryText": "mated and manual valves to permit isolation of the process\n\n3.    Automated plant shutdown system to shut down all engines, plant utilities and automatically operate all automatic valves to their fail-safe position.\n\n4.    Curbing or diking to contain liquids releases\n\n5.    Atmospheric relief devices\n\n\n\nRelease Mitigation\n\n1.    Fire Extinguishers\n\n2.    Trained emergency response personnel\n\n3.    Personal protective equipment\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nKelton Gas Plant has had no RMP-regulated substance releases during the past five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\n\n\nDurango Midstream, LLC's Kelton Gas Plant is a Non-Responding Facility as per 48 CFR 68.90(b). The plant maintains a written emergency action plan, which is in place to help protect employees and public safety as well as the environment. The plan identifies steps to be taken in case of an accidental release including:\n\n\n\n1.    Proper first aid and medical treatment for exposures, \n\n2.    Evacuation plans and accounting for personnel after an evacuation,\n\n3.    Notification of local emergency response agencies and the public if a release occurs.\n\n\n\nEmployees receive training in the procedures to be followed by employees who remain to operate critical plant operations before they evacuate. Durango Midstream, LLC has around-the-clock communications capability with appropriate emergency response organizations (Fire Department, Police and Sheriff's Office). This interface provides the means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition, Durango Midstream, LLC conducts periodic emergency drills and annual refresher training for plant personnel.\n\n"
    }
  ]
}