{
  "FacilityID": 1000011929,
  "FacilityName": "Willow Marsh Facility",
  "FacilityStr1": "10720 Old Sour Lake Road",
  "FacilityStr2": null,
  "FacilityCity": "Beaumont",
  "FacilityState": "TX",
  "FacilityZipCode": "77713",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48245",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "30.083172",
  "FacilityLongDecDegs": "-94.225686",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Samson Exploration, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Samson Exploration, LLC",
  "OperatorStr1": "Two West Second Street",
  "OperatorStr2": null,
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74103",
  "OperatorZipCodeExt": "3103",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209883",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-05-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-01-05 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-01-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2016-09-09 00:00:00",
  "DeRegistrationEffectiveDate": "2016-05-01 00:00:00",
  "AnniversaryDate": "2015-01-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.076365,
  "FRS_Long": -94.226425,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Sold facility effective date 5/1/16, change of operator 9/8/16.",
  "_processes": [
    {
      "ProcessID": 1000014558,
      "AltID": "Refrigeration Plant",
      "FacilityID": 1000011929,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016786,
          "ProcessID": 1000014558,
          "ChemicalID": 155,
          "Quantity": 176040.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 97421,
              "ProcessChemicalID": 1000016786,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 97422,
              "ProcessChemicalID": 1000016786,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 97423,
              "ProcessChemicalID": 1000016786,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 97424,
              "ProcessChemicalID": 1000016786,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 97425,
              "ProcessChemicalID": 1000016786,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 97426,
              "ProcessChemicalID": 1000016786,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 97427,
              "ProcessChemicalID": 1000016786,
              "ChemicalID": 115
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000014899,
          "ProcessID": 1000014558,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000010335,
              "Process_NAICS_ID": 1000014899,
              "SafetyReviewDate": "2010-01-04 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "API, NEMA",
              "FR_Comments": null,
              "HazardReviewDate": "2009-12-15 00:00:00",
              "ChangeCompletionDate": "2010-01-04 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "SCADA",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "SCADA",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-12-15 00:00:00",
              "TrainingReviewDate": "2010-01-04 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-01-04 00:00:00",
              "EquipmentInspectionDate": "2012-05-31 00:00:00",
              "EquipmentTested": "Flow Lines and Seperator",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000010619,
                  "PreventionProgram2ID": 1000010335,
                  "ProcessChemicalID": 1000016786
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011929,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-02-23 00:00:00",
    "ERTrainingDate": "2011-08-24 00:00:00",
    "CoordinatingAgencyName": "Bevil Oak VFD",
    "CoordinatingAgencyPhone": "4097533486",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011929,
      "SummaryText": "WILLOW MARSH FACILITY RISK MANAGEMENT PLAN: EXECUTIVE SUMMARY\r\n\r\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\n\r\nSamson Exploration, LLC, has a long-standing commitment to workers and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of the facilityA¿s processes. The Samson policy is to implement reasonable controls to prevent foreseeable releases of substances.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nSamson Exploration, LLC, operates the Willow Marsh Facility located at, 10720 Old Sour Lake Road, Beaumont, TX, 77713 (lat/long N 30.083172 W 94.225686) in Jefferson County, Texas. \r\n\r\n\r\nThe Willow Marsh Facility conditions the raw gas stream to make it suitable for sales. After bulk liquid separation, the stream is cooled and water is removed from the gas stream by means of glycol dehydration. Following glycol dehydration the gas stream is sent to a processing plant that recovers Natural Gas Liquids (NGLs) by mechanical refrigeration. Any liquids that are removed from the natural gas stream prior to processing are sent to a heater treater for vapor pressure control prior to being sent to atmospheric storage tanks. Liquids from the refrigeration plant are sent to stabilizer tower. Liquids from the stabilizer tower go to the NGLs storage tank and are later transported offsite via tanker trucks. Gas leaving the refrigeration unit goes to pipeline. Any gases generated by the stabilization of natural gas liquids at the facility are compressed and re-circulated to the inlet of the facility.  \r\n\r\nThe Willow Marsh Facility was evaluated to determine if any regulated flammable or toxic substances were present in the process and if they exceeded threshold quantity. All equipment and vessels are considered to be connected and/or co-located; consequently, all equipment and vessels can be consider"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000011929,
      "SummaryText": "maintained to minimize the risk of a release. Equipment examples include vessels, storage tanks, piping systems, and relief and vent systems with associated emergency shutdown systems and controls (i.e., monitoring devices,\r\nsensors, alarms, and interlocks).\r\n\r\nIncident Investigation\r\n\r\nSamson promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury. An incident investigation is initiated as promptly as possible to investigate and analyze the incident. This investigation is led by an incident investigation team consisting of those with appropriate knowledge and experience in the process. The findings and recommendations made by the incident investigation team are promptly addressed and resolved in a timely manner. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with employees (including contractors) who could be affected by the findings.\r\n\r\nEmergency Planning and Response\r\n\r\nSince this facility is a Program 2, a written emergency response program is required. Further, emergency response procedures have been developed and are contained in this RMP and these procedures will be implemented in the event of an accidental release or the threat of such a release. Employees will respond to accidental releases of regulated substances and, if safe to do so, attempt to stop the source of the leak. Emergency response activities are also coordinated with the local fire department as required in 40 CFR 68.12(b)(3).\r\n\r\nCompliance Audits\r\n\r\nTo ensure that the accident prevention program is functioning properly, Samson periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. The audit team includes those knowledgeable in the process, operations personnel, and at least one person trained in audit techniques and practi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000011929,
      "SummaryText": "ces. The audit team develops findings and corrective actions which are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nSamson is committed to operating the Willow Marsh Facility in a safe manner for workers, the public, and the environment. Samson personnel have an opportunity to make suggestions that could improve the safety of the facility during regional safety meetings. Samson will also conduct compliance audits and hazard reviews as required and make improvements to safety, based on findings of the audits and reviews."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011929,
      "SummaryText": "ed as part of a single process. The identification of even a single vessel exceeding threshold quantity of a regulated flammable or toxic substance would subject a process to threshold determination for offsite consequence analysis.\r\n\r\nSamson identified one flammable liquid mixture and zero regulated toxic substances. The identification of this exceedance indicated that the Willow Marsh Facility is a covered process with a regulated substance subject to offsite consequence analysis.\r\n\r\nThis facility is aware of the requirements in the areas of Safety Information, Hazard Reviews, written Operating Procedures, Training, Maintenance, Compliance Audits, and Incident Investigations. Concerning the emergency response policy at the facility, the owner has made the decision that employees will respond to accidental releases of regulated substances and, if safe to do so, attempt to stop the source of the leak. \r\n\r\nThis facility processes Natural Gas Liquids (NGLs) which are stored in two (2) 18,000 gallon pressurized bullet tanks. The facility is subject to RMP requirements since it is a natural gas processing plant producing NGLs and contains threshold quantities of regulated substances as indicated in the following table:\r\n\r\nNatural Gas\r\n           Regulated Quantity Percent\r\n                    Substance (lbs)          (>1%)\r\nEthane                10,000                2.87637\r\nPropane               10,000               24.0065\r\ni-Butane              10,000                9.8904\r\nn-Butane              10,000               17.4048\r\ni-Pentane             10,000                8.32944\r\nn-Pentane             10,000                7.87109\r\nMethane <1%\r\nOnsite lbs = (total gallons) x (lbs/gallons)\r\nNGL lbs = 36,000 x 4.89 = 176,040 lbs\r\n\r\nSince this facility is a Program 2, a documented prevention program is required. The prevention program discusses NGLs which are the specific chemicals contained in an amount above the threshold quantity. \r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011929,
      "SummaryText": "facility has not experienced any accidental releases that meet the criteria for an accidental release as discussed in 40 CFR 68.42 within the past five years.\r\n\r\n\r\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\r\n\r\nThe following is a summary of the accident prevention program in place at the Willow Marsh Facility.\r\n\r\nEmployee Participation\r\n\r\nSamson actively encourages all employees and contract employees to participate in creating a safe work environment. This participation begins with well-established mechanisms of communication with all employees regarding covered process information. Employees are involved in maintaining RMP rule compliance based on their knowledge, skill, job responsibilities, and experience.\r\n\r\nSafety Information\r\n\r\nSamson maintains written information intended to provide a foundation for identifying and understanding the process hazards. This information addresses chemical properties, inventories, and associated hazards, as well as key process parameter limits and equipment design basis/configuration information. \r\n\r\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in the material safety data sheets (MSDSs). In addition, the plant has documented safety-related limits for specific process parameters and ensures limit maintenance by using highly trained personnel, process controls, and monitoring and protective instrument systems.\r\n\r\nHazard Review and Analysis\r\n\r\nSamson has a comprehensive program to ensure that hazards associated with the process are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. \r\n\r\nSamson primarily uses the Design and Safety Review and What-If/Checklist methods to perform these evaluations. The information used in the hazard review was provided by persons knowledgeable about the process. Based on the answers to the quest"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011929,
      "SummaryText": "ions, consequences and preliminary recommendations can be determined. \r\n\r\nThe Review findings are promptly and systematically addressed. Samson assures that the recommendations are documented and resolved in a timely manner. This documentation includes the actions to be taken and a written schedule of completion dates. All Review findings are communicated with Samson employees and contractors that may be affected. \r\n\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate from the original designed safety features, the plant periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every five years by the Review team.\r\n\r\n\r\nOperating Procedures\r\n\r\nThe Willow Marsh Facility maintains written procedures that address various modes of process operations, such as (1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) emergency operations, (6) normal shutdown, and (7) startup following a turnaround or after an emergency shutdown. These procedures can be used as a reference by experienced operators and provide a consistent training basis for new operators. Operating procedures are periodically reviewed and certified as current. When a process change occurs, operating procedures are revised as necessary.\r\n\r\nTraining\r\n\r\nTo complement the written operating procedures, Samson has implemented a training program for all employees. New employees receive job specific training in plant operations. Employee training includes emphasis on safety and health hazards, emergency shutdown operations, and safe work practices. Operators demonstrate adequate knowledge to safely perform duties and tasks and are allowed to work independently.\r\n\r\nMechanical Integrity\r\n\r\nSamson has well-established programs, procedures and practices that are required to ensure that equipment used to process, store, or handle flammable material is designed, constructed, installed, and"
    }
  ]
}