{
  "FacilityID": 1000043352,
  "FacilityName": "PVS Technologies, Inc. (Detroit)",
  "FacilityStr1": "10825 Harper Ave",
  "FacilityStr2": null,
  "FacilityCity": "Detroit",
  "FacilityState": "MI",
  "FacilityZipCode": "48213",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26163",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "42.397333",
  "FacilityLongDecDegs": "-082.996944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "OT",
  "FacilityURL": "www.pvschemicals.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 151369303,
  "ParentCompanyName": "PVS Chemicals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6530273,
  "Company2DUNS": 0,
  "OperatorName": "PVS Technologies, Inc",
  "OperatorStr1": "10825 Harper Ave",
  "OperatorStr2": null,
  "OperatorCity": "Detroit",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48213",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Wasko",
  "RMPTitle": "Plant Manager",
  "FTE": 14,
  "OtherEPAFacilityID": "MID985621804",
  "EPAFacilityID": "100000055129",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-02-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.39525,
  "FRS_Long": -82.99615,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053472,
      "AltID": "Liquid Ferric Chloride",
      "FacilityID": 1000043352,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054913,
          "ProcessID": 1000053472,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064958,
          "ProcessID": 1000053472,
          "ChemicalID": 62,
          "Quantity": 180000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564958,
          "ProcessID": 1000053472,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043352,
      "SummaryText": "PVS Technologies, Inc. is a manufacturer and marketer of chemicals used in the treatment of industrial and municipal water.  In addition to the iron salts (ferrous chloride solution and ferric chloride solution in liquid forms), PVS Technologies also produces blends of ferric chloride and polymers for its customers.  Liquid ferric chloride is primarily used in water/wastewater treatment and phosphate removal.  Anhydrous ferric chloride, in which we only repackage, also a water treatment chemical, is utilized as a raw material for many industrial applications such as pharmaceutiacl, plastics, chemical milling, etc. PVS Technologies, Inc. operates a ferric manufacturing facility that is located on 10825 Harper Avenue, Detroit MI 48213.\n\n\n\nThe ferric chloride production process uses chlorine as a reagent.  Chlorine, the 17th element on the periodic table, is commonly used in the purification of potable water.  Other uses include hospital sanitation, swimming pool treatmetn, etc.  Chlorine is also a basic ingredient in the production of pharmaceutical and agricultural products as well as consumer products such as vinyl siding for houses, PVC pipes for plumbing, etc.  The same properties that make chlorine valuable as a commodity also necessitate the adoption of safety precautions in its handling.\n\n\n\nIn addition to our pledge for full compliance with all applicable federal, state and local rules and regulations, we have been actively engaged in developing and applying not only innovative and sound technology but also safe operating standards to our production processes.  Our chlorine unloading system is designed in accordance with the Chlorine Institute standards.  We conduct Hazard and Operability (HAZOP) studies on all chlorine related process designs and modifications.  Pre-startup safety reviews are also performed whenever necessary.  Ambient chlorine sensors (local and Perimeter) and automatic shut off valves are in place in order to detect and minimize any chlorine"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043352,
      "SummaryText": " releases to the atmosphere.  A two-stage scrubber system is installed for proper neutralization of any residual levels of chlorine from our production process.  Continuous camera surveillance from the plant control room is in place to visually detect any releases from the scrubber stack, the railcar unloading stations or the process areas.  A standby electric generator is provided for backup powerto critical systems such as the fume scrubbers, transfer pumps, etc.  A preventative maintenance program is in place for properly planning and documenting the repair and/or maintenance of our process equipment.  Routine safety audits by supervisors and managers are conducted.  The employee training program, including the annual PVS 32- hour training requirement, The OSHA 24-hour HAZWOPER training (initial and refresher) and others, are conducted in order to maintain and/or enhance process safety.  Our emergency response plan includes specific guidelines for getting the right people (both on-site and off-site) and equipment to the scene quickly.  In the event of an emergency involving a chlorine release, PVS Technologies personnel are trained in measure to control the release.  In addition, our emergency response plan has been provided to local response organizations for inclusion into the Community emergency response plan.\n\n\n\nThe regulated material, i.e., liquid chorine, is brought to the manufacturing facility by railcars that are unloaded directly into the process. Access to the site is restricted to authorized facility employees, management staff and approved contractors.  Only one railcar is hooked up to the production process at any time.\n\n\n\nThe worst-case scenario, as required by USEPA, invloves the failure of a 90-ton railcar, thus releasing 180,000 pounds of chlorine to the atmosphere.  It is assumed that the entire content is released within a ten-minute perios.  The release would have off-site consequences.  With regards to the alternative release scenarios, the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043352,
      "SummaryText": "Detorit facility has two covered processes i.e., liquid ferric chloride (LFC) and railcar storageas stationary source.  The three alternative release scenarios are as follows. For LFC process, the scenario involves an instantaneous release of 136 lbs of liquid chlorine from a ruptured chlorine hose.  Active mitigation involves an automatic isolation of the ruptured section from the chlorine source and the rest of the chlorine delivery system.  The liquid flashes immediatley to vapor and fine droplets and is carried downwind.  The 2nd scenario pertains to a 36-pound release of chlorine liquid that flashes to vapor and fine droplets from the failure of a pressure guage.  It is assumed that the angle valve on the railcar will automatically be closed by the railcar valve closure system within 15 seconds.  For the stationary source scenario involves a slow seepage from the railcar safety valve, thus releasing about 10 pounds of chlorine vapor.  An emergency capping kit will be used to stop the release.  All three scenarios would have off-site consequences.\n\n\n\nThrough the use of employee suggestions, periodic safety meetings, safety audits and formal process safety reviews, PVS Technologies continuously evaluates the safety of our processes and operating procedures and makes improvements as appropriate.  No major process changes are planned"
    }
  ]
}