{
  "FacilityID": 1000087407,
  "FacilityName": "Molson Coors USA LLC",
  "FacilityStr1": "7001 South Freeway",
  "FacilityStr2": null,
  "FacilityCity": "Fort Worth",
  "FacilityState": "TX",
  "FacilityZipCode": "76134",
  "Facility4DigitZipExt": "4098",
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.644444",
  "FacilityLongDecDegs": "-097.319167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Molson Coors USA LLC",
  "OperatorStr1": "7001 South Freeway",
  "OperatorStr2": null,
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76134",
  "OperatorZipCodeExt": "4098",
  "RMPContact": "Brad Greer",
  "RMPTitle": "Sr Mgr Technical Services",
  "FTE": 535,
  "OtherEPAFacilityID": "76134MLLRB7001",
  "EPAFacilityID": "100000022673",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O-00996",
  "SafetyInspectionDate": "2016-09-23 00:00:00",
  "SafetyInspectionBy": "DSHS Department of Safety Health Services",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-08-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-05-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-05-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-05-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.64462,
  "FRS_Long": -97.32018,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000109016,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000087407,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000110289,
          "ProcessID": 1000109016,
          "NAICSCode": "31212",
          "_desc": {
            "NAICS_CODE": "31212",
            "NAICS_DESCRIPTION": "Breweries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000136198,
          "ProcessID": 1000109016,
          "ChemicalID": 56,
          "Quantity": 115000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000636198,
          "ProcessID": 1000109016,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000087407,
      "SummaryText": "Molson Coors USA LLC is committed to promoting a safe working environment and has developed and implemented several programs to ensure chemical safety.  The facility operates an ammonia refrigeration process and has several methods for ensuring employee and public safety associated with this process.  The facility has developed procedures, plans and policies for the operation of the ammonia process and for dealing with unexpected accidental releases. Molson Coors USA LLC has implemented a process safety management program which enhances safety by regular maintenance and inspections, hazard analysis and other activities.  The Molson Coors USA LLC facility has an Emergency Response Team and a Utilities Hazmat Team complete with state-of-the-art emergency response equipment.  Both teams are trained to quickly and effectively respond to a release of hazardous materials.  The facility also has emergency response procedures and plans to promote chemical safety in the event of an emergency situation.  Molson Coors USA LLC frequently communicates with the local Fire Departments Hazmat team to discuss options for improving our processes. At this time the facility has no changes planned to improve safety.\n\n\n\nMolson Coors USA LLC is engaged in the beverage production business.  As part of the beverage manufacturing process an ammonia refrigeration system is utilized.  Due to the quantity of ammonia maintained on-site the facility is subject to the Risk Management Program regulations which are meant to promote safety at the facility and general public level.\n\n\n\nA worst-case release scenario was modeled to determine the greatest impact a release of ammonia from the facility could reasonably cause.  This scenario is based on a complete and total release of ammonia from the largest ammonia vessel located at the facility.  At the Molson Coors USA LLC facility, this scenario involves a vessel which has an administratively controlled capacity of 46,297 pounds of ammonia (company poli"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000087407,
      "SummaryText": "cy limits the filling of the vessel to 80% of its total capacity).  The worst-case release of ammonia from this vessel is a complete loss of all 46,297 pounds of ammonia in a ten minute period.  Computer modeling was used to reasonably evaluate impacts from such a release.  The modeling indicates that impacts from the worst case release would impact public receptors beyond the property boundaries.  The vessel is located outside and the building will not mitigate the release.\n\n\n\nAn Alternative release scenario was also modeled using the EPA lookup tables.  The alternative release scenario is based on a liquid release from a 0.25 diameter orifice at 128 psig for 60 minutes.\n\n\n\nThe alternative release scenario is a scenario which is more likely to occur that the worst-case scenario.  Based on the modeling it was determined that such a leak could result in impacts to the public receptors beyond the property boundaries.\n\n\n\nIn the previous five years, the Molson Coors USA LLC Facility has not had any accidental releases which resulted in any deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage from the ammonia process.\n\n\n\nThe Molson Coors USA LLC Facility is also subject to the process Safety Management regulations under the Occupational Safety and Health Administration (OSHA).  As a result of these regulations, the Molson Coors USA LLC facility has implemented a program to further enhance process safety which involves operation procedures, training, mechanical integrity (maintenance related issues), pre-start-up-review, management of change, compliance audits, incident investigation, employee participation, hot work (welding) permits, and contractor safety.\n\n\n\nThe facility's emergency response program consists of three major plans/procedures:  an Emergency Action Plan, an Emergency Response Plan and Standard Operating Procedures for Emergency Responders (SO"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000087407,
      "SummaryText": "PER) that is part of the Process Safety Management Plan.\n\n\n\nThe emergency response plans/procedures at the Molson Coors USA LLC facility contain information and procedures relative to initial response, informing the public, evacuation, fire responses, facility specific information (site maps/drawings, security, communication system, emergency organization), emergency/spill prevention, post emergency procedures, training summary and administrative management of change.  Additional information on initial response is included in Ammonia Refrigeration System Emergency Isolation Valve Maps.\n\n\n\nAs previously mentioned, the brewery maintains both and Emergency Response Team and a Utilities Hazmat Team.  Both teams receive extensive annual training to deal with accidental release at the facility.  Equipment used by the teams are routinely tested and maintained.\n\n\n\nThe emergency response plan for the facility has been submitted to and approved by the Tarrant County Local Emergency Planning Committee (LEPC). Annually the Fort Worth Fire Department conducts a Fire Safety Inspection of the brewery and participates in a brewery tour.\n\n"
    }
  ]
}