{
  "FacilityID": 1000078335,
  "FacilityName": "Encino Chlorination Station",
  "FacilityStr1": "4500 Encino Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Encino",
  "FacilityState": "CA",
  "FacilityZipCode": "91316",
  "Facility4DigitZipExt": "3833",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.150035",
  "FacilityLongDecDegs": "-118.513274",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ladwp.com",
  "FacilityEmailAddress": "water@ladwp.com",
  "FacilityDUNS": 956000736,
  "ParentCompanyName": "Los Angles Department of Water and Power",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Department of Water and Power",
  "OperatorStr1": "111 North Hope Street",
  "OperatorStr2": "Room 1449",
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": "2607",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000145906",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-12-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-03-18 16:36:47",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-11 11:13:46",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-11 11:13:46",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.150035,
  "FRS_Long": -118.513274,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097617,
      "AltID": "Chlorination",
      "FacilityID": 1000078335,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122202,
          "ProcessID": 1000097617,
          "ChemicalID": 62,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000098864,
          "ProcessID": 1000097617,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000082888,
              "Process_NAICS_ID": 1000098864,
              "SafetyReviewDate": "2019-03-08 00:00:00",
              "PHA_Date": "2021-09-08 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-03-08 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "A dry media chlorine mini-scrubber is also in use as a process control system.",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Halogen actuators on ton containers.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-03-12 00:00:00",
              "TrainingReviewDate": "2019-01-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-02-12 00:00:00",
              "EquipmentInspectionDate": "2019-01-30 00:00:00",
              "EquipmentTested": "Tested Chlorine Leak Sensors",
              "ChangeMgmtDate": "2016-07-20 00:00:00",
              "ChangeMgmtReviewDate": "2019-03-20 00:00:00",
              "PreStartupReviewDate": "2013-11-19 00:00:00",
              "ComplianceAuditDate": "2018-10-05 00:00:00",
              "AuditCompletionDate": "2020-04-05 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-03-14 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-14 00:00:00",
              "ContractorSafetyReviewDate": "2018-01-26 00:00:00",
              "ContractorSafetyEvalDate": "2019-03-14 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000102965,
                  "PreventionProgram3ID": 1000082888,
                  "ProcessChemicalID": 1000122202
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000078335,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-08-20 00:00:00",
    "ERTrainingDate": "2018-10-10 00:00:00",
    "CoordinatingAgencyName": "Los Angeles Fire Department",
    "CoordinatingAgencyPhone": "8187568683",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 12,
      "FacilityID": 1000078335,
      "SummaryText": "he training programs for all employees involved with the chlorination process, contractor training, and medical surveillance of LADWP personnel who respond to chlorine releases.\r\n¿\tDetails of emergency recognition and prevention at the LADWP.\r\n¿\tProcedures for informing the public and local emergency response agencies about accidental releases.\r\n¿\tDocumentation of proper first aid and emergency medical treatment necessary to treat accidental human exposures and the detailed information on emergency health care.\r\n¿\tProcedures and measures for emergency response after an accidental release.\r\n\r\n(b)\tProcedures for the use of emergency response equipment and for its inspection, testing, and maintenance. \r\n(c)\tTraining in relevant procedures for all employees involved with the chlorination process.\r\n(d)\tProcedures to review and update, as appropriate, the emergency response plan to reflect changes and ensure that employees are informed of changes.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nBased on the March 2014 PHA, a few recommendations were made for the chlorination station.  All the above recommendations have been evaluated by the LADWP.  Additionally, ten recommendations to further improve chlorine safety were identified in March 2019, when the PHA was again performed.\r\n\r\nBased on the 2014 seismic assessment, three additional recommendations were made for the ECS. All the above recommendations have been evaluated and implemented by the LADWP. Based on the 2019 seismic assessment, no additional recommendations were  made for the chlorination station.\r\n\r\nIt is expected that all the above 2019 recommendations will be evaluated and implemented by September 2021. The implementation of these recommendations will further improve the safety of the chlorination system."
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000078335,
      "SummaryText": "eck that the process and equipment are ready to go and that the recommendations of the PHA have been implemented or adequately addressed.  This will ensure that the design and construction of a new or modified process is safely executed and that the facility is prepared to operate it. \r\n\r\nMechanical integrity procedures for the plant ensure that written maintenance procedures are implemented and documented, including training of maintenance personnel.\r\n\r\nMaintenance \r\n\r\nThe LADWP operates a maintenance program, MAXIMO Program that generates a work order for performing the preventive maintenance routine, which occurs after a designated time past the closing of the previous work order for that particular maintenance process.  Description of the work to be performed is included with the printed work order.  The water treatment supervisors are responsible for the maintenance of the chlorination system.  \r\n\r\nIn addition, the written maintenance procedure is provided in the O&M Manual as follows: Preventive maintenance schedules are provided which summarize inspection, test, and maintenance schedules on a daily, weekly, bi-monthly, monthly, biannual, and annual, every 2 to 10 years, and on as-needed basis.  These procedures allow the operator to rapidly review what maintenance is necessary.  The schedules are supplemental to the log sheets onsite and provide a summary and quick reference to manufacturer's O&M manuals.  A maintenance log book is provided onsite for Operator quick reference.\r\n\r\nThe LADWP documents inspection, testing, and maintenance of chlorination equipment and assures the performance is performed in accordance with the recommendations of the manufacturer and industry groups (i.e., Chlorine Institute).\r\n\r\nHot Work Permits and Management of Change \r\n\r\nHot work refers to work involving electric or gas welding, cutting, brazing, or similar flame or spark producing operations.  The hot work procedures require the issuance of a hot work permit whenever it is c"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000078335,
      "SummaryText": "g safety systems.\r\n¿\tMaintenance Procedures.\r\n¿\tOperating Procedures for the chlorine system.\r\n¿\tRMP Program contents.\r\n¿\tEmergency Response Plan and Procedures.\r\n\r\nRefresher training is provided at least every three years to each employee operating the chlorination process to ensure that the employee understands and adheres to the current operating procedures.  In addition, the LADWP ensures that operators are trained in any updated or new procedures before startup of a process after major modifications. \r\n\r\nContractors\r\n\r\nThe LADWP contractors' procedures specify the information required to be provided to the contractors performing work on or near the chlorination process, the training requirements for contractor employees, and mechanism to obtain assurance from contractors that they have informed their employees of the appropriate safety rules.  The LADWP provides information and explanations concerning the hazards and processes. \r\n\r\nPre-Startup Safety Review and Mechanical Integrity Program\r\n\r\nThe LADWP has procedures in place to ensure that a pre-startup safety review is conducted prior to starting a new covered process or prior to making modifications to the chlorination systems that require a Management of Change (MOC) procedure implementation.  The required conditions prior to startup include the following:\r\n\r\n¿\tConstruction and/or equipment are in accordance with design specifications.\r\n¿\tSafety, operating, maintenance, and emergency procedures are in place and are adequate.\r\n¿\tA PHA has been performed for new facilities and recommendations have been resolved or implemented before startup.\r\n¿\tAt modified facilities, MOC requirements have been met.\r\n¿\tTraining of each operating and maintenance employee involved in the process is complete.\r\n\r\nThese procedures ensure that no new and/or significantly modified process will startup and no regulated substances will be introduced into such a process before the pre-startup safety review.  This constitutes a final ch"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000078335,
      "SummaryText": "am using qualified staff.\r\n\r\nChemical-specific prevention steps include the following: availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply; awareness of the hazardous and toxic properties of chlorine; presence of chlorine detectors with remote monitoring; use of Halogen actuators on the ton containers; a chlorine main scrubber; and a chlorine mini-scrubber.\r\n\r\nProcess and Chemical Safety Information\r\n\r\nComprehensive chemical data has been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine.  This information includes chlorine background information and Safety Data Sheets.\r\n\r\nEquipment safety information was compiled on the chlorine process. Specifications for the chlorine process are collected and provided in one place for easy reference. Details (such as maximum intended inventory; safe upper and lower temperatures; and safe upper and lower pressures for the chlorination facility) are on file at the facility.  The LADWP also has procedures in place that are triggered to update process safety information if there is a major change that makes existing information inaccurate.\r\n\r\nProcess Hazard Analysis\r\n\r\nIn 1996, a detailed hazard review/Process Hazard Analysis was conducted for the chlorination system equipment and procedures. The hazard review/PHA was revalidated in April 1999. In March 2004, a hazard review/PHA was again performed for the whole chlorination station. A hazard review/PHA for modifications to the facility was performed in May 2001 (based on design drawings) and in April 2006.  The April 2006 hazard review/PHA was further reviewed in October 2006.  The October 2006 hazard review/PHA was again reviewed in April 2011. The 2011 PHA was further reviewed and updated in March, 2014.  A PHA was again performed on March 8, 2019, and will be updated again within a five"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000078335,
      "SummaryText": "onducted on or near the chlorination process and other areas deemed appropriate as described in these procedures.  Fire prevention and protection systems are in place before a hot work permit is issued. The permit indicates the dates the work is authorized for, the location, and specific operational requirements, and it is kept on file in the administrative office. \r\n\r\nThe LADWP Management of Change procedures include steps required to be taken by plant personnel before implementing changes to chlorination equipment, procedures, raw materials, and processing conditions.  Training, process safety information, operating procedures, and maintenance procedures are updated according to the changes made.\r\n\r\nInternal Compliance Audits\r\n\r\nThe LADWP has been certifying every three years (or earlier) that compliance with Program 2 Prevention Program requirements is met and that procedures and practices developed are adequate and being followed. Starting June 2009, the LADWP certified compliance with Program 3 Prevention Program requirements. The two most recent audit reports and a list of the recommendations are retained in the LADWP's files.\r\n\r\nThe compliance audit consists of separating the RMP program elements or sections, and auditing each element to determine compliance and effectiveness.  For each internal audit, the audit team completes a Compliance Audit Certification Page and a Compliance Audit Checklist.  The Compliance Audit Certification Page provides process identification, the dates of the audit, team members, and certification by the audit leader.  The Compliance Audit Checklist details the requirements of each RMP element and contains questions that may assist with the auditing process. The audit checklist for each element consists of the following three sections:\r\n\r\n¿\tRecords Review: A review of the RMP written Prevention Program.\r\n¿\tOnsite Conditions: The audit team reviews the program elements based on observation of the plant conditions and safety practice"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078335,
      "SummaryText": "ns, chlorine ton containers are manifolded together in two banks to supply chlorine, while others are stored as spares.  On-line ton containers rest on load cell scales, which allow the operators to monitor the chlorine weight remaining in each ton container. All on-line ton containers are equipped with Halogen actuators on the ton container valves. The primary bank is connected to the chlorine liquid header and the secondary bank is connected to the chlorine gas header.  The liquid chlorine passes from the ton containers to the evaporator where it is vaporized in a water bath.  Gaseous chlorine from the secondary bank of ton containers bypasses the evaporators, serving as an automatic backup when the primary ton containers run dry, or when the evaporators shut down due to (1) a low water level, (2) temperature condition, or (3) power loss.  Space is allocated in the room for the storage of additional ton containers without any connection to the chlorination system.\r\n\r\nThe gas header line is equipped with automatic switchover vacuum regulating valves (a combination of evaporator actuated vacuum regulating valve with check-relief unit and standby vacuum regulating valve with check-relief vent), and pressure gauges.  The liquid header line is equipped with pressure gauges and an expansion chamber to protect against excessive pressure.  The primary (liquid) bank provides all the chlorine to the station through the evaporators until it is depleted.  The gaseous chlorine bank automatically starts supplying chlorine when the primary bank is depleted.  This automatic system is achieved by setting the automatic vacuum regulating valve leading from the secondary bank to standby.  Once the primary bank is depleted, the higher vacuum level acts on the diaphragm of the automatic switchover vacuum regulator in the secondary bank, thereby pulling that valve open to start feeding gas.\r\n\r\nThe gaseous chlorine from the evaporators or from the chlorine gas header proceeds to the chlo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078335,
      "SummaryText": "lable in the community, and is in compliance with the EPA and the CalARP Program Emergency Response Program Requirements.  The LADWP has prepared an Emergency Response Plan for the Encino Chlorination Station to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency.  The Emergency Response Plan has been coordinated with the local response agency (City of Los Angeles Fire Department). The Encino Chlorination Station has a good record in preventing accidents from occurring. \r\n\r\nGeneral Facility and Regulated Substance Information\r\n\r\nThe Encino Chlorination Station is located at 4500 Encino Avenue, Encino, California.  The station serves to disinfect drinking water by chlorinating water in the reservoir and at various locations in the on-site water piping system.  The treated water is then piped into the distribution network, which serves parts of the San Fernando Valley with potable water.  The station consists of a three building complex: the pump station, the chlorination station and the membrane filtration plant. The facility stores chlorine, a regulated toxic substance under the EPA and CalARP Program rules. Chlorine ton containers can be attached to the liquid chlorine header for discharging chlorine, as well as to the gas header which provides an automatic backup supply. The maximum quantity of chlorine present at the Encino Chlorination Station at any given time exceeds the listed threshold quantities in the EPA and CalARP regulations.  It also exceeds the listed threshold quantities in the federal and California Occupational Safety and Health Administration (CalOSHA) Process Safety Management (PSM) Standards.  However, the facility is normally unoccupied and water treatment operators visit the facility daily and respond to any trouble alarms that may occur.  Therefore, the LADWP Encino Chlorination Station is not subject to federal or California OSHA PSM regulations.\r\n\r\nDuring normal operatio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078335,
      "SummaryText": "l 2006, a few minor changes in the piping system were made.  An update to the April 2006 Risk Management Plan, reflecting these minor changes was prepared in December 2006.  The LADWP prepared Program Level 2 RMPs from 1999 through 2006 because Encino Chlorination Station is not subject to Process Safety Management (PSM) regulations. However, in the excess of caution, the LADWP prepared a Program Level 3 RMP in 2010 for the ECS and submitted it to the LAFD. In April 2014, the LADWP performed a PHA for the ECS, including the ventilation system provided for the chlorination system. The LADWP, therefore, updated the ECS RMP prepared and submitted in 2010. This 2019 update of the 2014 RMP for the Encino Chlorination Station also demonstrates compliance with the Program Level 3 requirements.  \r\n\r\nThe following information is specifically required in the RMP Executive Summary: \r\n\r\n¿\tAccidental release prevention and emergency response policies.\r\n¿\tGeneral facility and regulated substances information.\r\n¿\tSummary of the accidental release prevention program and chemical-specific prevention steps.\r\n¿\tFive-year accident history summary.\r\n¿\tEmergency response program summary.\r\n¿\tPlanned changes to improve safety.   \r\n\r\nThe above information for the Encino chlorination station is provided below.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe LADWP accidental release prevention policy involves a unified approach that integrates the use of proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable requirements of the State of California and the EPA's Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \r\nThe LADWP emergency response policy involves the preparation of emergency response plans for hazardous materials which are tailored to each facility and to the emergency response services avai"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078335,
      "SummaryText": "Chlorine is the most commonly used substance for disinfecting drinking water.  The addition of chlorine or chlorine compounds to water is called chlorination.  Chlorination is considered to be the most important process for preventing the spread of waterborne disease in drinking water.  The Los Angeles Department of Water and Power (LADWP) also uses chlorine for drinking water disinfection purposes at the Encino Chlorination Station to protect public health per state and federal water quality standards.  Storing and handling large quantities of chlorine can create hazardous situations.  The LADWP takes safety obligations in storing and using chlorine as seriously as it takes in providing safe drinking water.  The LADWP has been operating the Encino Chlorination Station (ECS) since 1956. The ECS is a chlorination facility that stores and uses anhydrous chlorine for disinfection purposes.  The LADWP made significant improvements to the chlorination facility to further enhance the safety of the chlorine handling process. The modified chlorination facility is in operation since 2006. The Encino Chlorination Station chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan, and also to the California Accidental Release Prevention (CalARP) Program regulations. The facilities subject to the EPA and CalARP regulations are required to prepare and update Risk Management Plans (RMPs). An update is required at least once every five years from the date of its initial submission.  The RMP is to include policies and procedures followed to safely operate the facility and the actions, which will be taken by the facility in an event of an emergency. \r\n\r\nA Risk Management Plan for the Encino Chlorination Station was prepared in June 1999 that was updated in June 2004.  The Risk Management Plan for the modified chlorination station was prepared in April 2006.  Subsequent to the preparation of the Risk Management Plan in Apri"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078335,
      "SummaryText": "rinators that regulate the flow of chlorine.  Chlorine gas from the vacuum regulating valve with check-relief units is pulled by vacuum to the chlorinators and then to the injectors located in an underground vault, cabinet, or within the membrane filtration building.  The injectors provide vacuum, which draws chlorine gas into mixing water to form a concentrated solution.  It is important to note that in case of loss of vacuum downstream of the vacuum regulating valve with check-relief unit, air would be drawn in rather than chlorine being released and the vacuum regulating valve with check-relief unit will shut down the chlorine supply to the chlorinator, operating as a shut-off valve. The concentrated water and chlorine solution is piped through diffusers into the reservoir and to various locations in the on-site water piping system. Process control is by a programmable controller, which determines the feed rate relative to the water flow rate.  There are flow meters transmitting flow signals to the controller.  Chlorine residual analyzers continuously monitor and record the treated water residuals.\r\n\r\nMultiple chlorine leak detectors have been installed inside the chlorine building, which alarm locally as well as at the LADWP Los Angeles Aqueduct Filtration Plant (LAAFP) Control Room at Sylmar.\r\nA dry media type chlorine gas scrubber system (main scrubber) is installed at the station.  The unit is actuated by chlorine detectors at a chlorine concentration of 3 ppm.  The scrubber is provided to neutralize an accidental release of chlorine gas from the chlorine storage or chlorinator rooms.  The scrubber draws suction from the chlorine storage and chlorinator rooms through a duct.  The station is equipped with uninterruptible power supply (UPS) in addition to a backup power generator.  Therefore, in case of the failure of regular power, the scrubber will be functional.\r\n\r\nA dry media chlorine mini-scrubber unit (MS) has also been installed at the Encino Chlorinat"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000078335,
      "SummaryText": "ion Station. The MS is an emergency chlorine scrubber intended to protect personnel working in the building or immediate area from a chlorine gas release from the pressure safety relief vent provided in the vacuum regulator check units. Mini-scrubber can neutralize up to 25 lbs of chlorine, and the media manufacturer specifies chlorine removal to less than 5 parts per billion. The mini-scrubber is activated automatically at a chlorine concentration of 1 ppm.\r\n\r\nIn the event power is lost at the chlorination facility, an alarm will alert the LAAFP control room.  Chlorine flow will continue unaffected, with no safety consequences.  An emergency generator will automatically start and supply power to the entire system.\r\n\r\nThe facility is normally unoccupied; water treatment operators visit the facility daily. A response team coordinated from LADWP Los Angeles Aqueduct Filtration Plant (LAAFP) responds to any trouble alarms, which may occur.  Access to the facility is through gates, which are kept locked all the time.\r\n\r\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nThe LADWP accidental release prevention program is based on the following key elements:\r\n\r\n¿\tDetailed management system and clear levels of responsibilities and team member roles.\r\n¿\tComprehensive process safety information that is readily available to staff, emergency responders, and contractors.\r\n¿\tComprehensive preventive maintenance program.\r\n¿\tPerformance of process hazard analysis review of equipment and procedures with operation and maintenance staff participation and review.\r\n¿\tState-of-the-art process and safety equipment.\r\n¿\tAccurate and effective operating procedures, written with the participation of the station operators.\r\n¿\tHigh level training for the operators and maintenance staff.\r\n¿\tA State of California Water Treatment Facility Staff Certification is required to operate the station.\r\n¿\tAn incident investigation, inspection, and auditing progr"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000078335,
      "SummaryText": "s.\r\n¿\tInterviews:  The program elements are evaluated by interviewing personnel from appropriate functions including operations, maintenance, management, and contractors.\r\n\r\nTeam members record RMP program deficiencies identified during the audit on the checklist.\r\n\r\nIncident Investigation\r\n\r\nThe LADWP incident investigation procedures describe incident reporting, investigation, and investigation reporting steps to be followed by plant personnel. The incident investigation is started promptly but no later than 48 hours after the event.  The LADWP promptly addresses and resolves all recommendations and implements the recommendations in a timely manner to prevent an incident recurrence.  All incident investigation reports are retained in the LADWP's file for at least a period of five years from the date the reports are completed.\r\n\r\nFive-year Accident History Summary\r\n\r\nNo chlorine releases that could have caused safety or health hazard (deaths, injuries, property or environmental damage evacuations, or sheltering in place) occurred at the Encino Chlorination Station during the last five years.\r\n\r\nEmergency Response Program Summary\r\n\r\nThe LADWP is a first responder, its employees respond to chlorine accidental releases.  In the event an accidental release that could result in offsite consequences occurs, external resources, such as the City of Los Angeles Fire Department will also be solicited to respond.  \r\n\r\nAs part of the emergency response program, the LADWP has developed and implemented an emergency response plan for the purpose of protecting public health and the environment. The following elements are included:\r\n\r\n(a)\tAn emergency response plan, maintained at the Encino Chlorination Station  and at the Los Angeles Aqueduct Filtration Plant (LAAFP) containing:\r\n\r\n¿\tOrganizational structure (chain-of-command) and responsibilities of various LADWP personnel.\r\n¿\tProcedures for planning and coordination with off-site emergency response organizations.\r\n¿\tDetails of t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000078335,
      "SummaryText": "-year period or whenever there will be a major change in the process. A list of recommended actions was developed in March 2019 to further improve the chlorine safety and staff is currently evaluating these recommendations.  The LADWP staff will document the completion of the recommended actions.\r\n\r\nA seismic assessment, including the walkthrough on February 20, 2019 was completed for the chlorination station in May 2019.  No additional recommendations were made based on this seismic assessment. The seismic assessment was performed following the Local Emergency Planning Committee (LEPC) Region 1 guidance document.\r\n\r\nOperating Procedures\r\n\r\nThe LADWP has prepared written operating procedures for Encino Chlorination Station that provide clear instructions or steps for safely conducting activities relating to chlorination process. They are consistent with the chlorine safety information. Written operating procedures included in the facility's Operation and Maintenance (O&M) Manual are as follows:\r\n\r\n¿\tDelivery of Chlorine.\r\n¿\tTon Container Connections.\r\n¿\tInitial Startup Procedure.\r\n¿\tNormal Operation.\r\n¿\tNormal Shutdown.\r\n¿\tTemporary Operations.\r\n¿\tEmergency Operations.\r\n¿\tEmergency Shutdown.\r\n¿\tStartup Following Emergency Shutdown.\r\n\r\nTraining \r\n\r\nThe LADWP ensures that each employee operating or maintaining the chlorination process, and each employee newly assigned to this process, is trained and tested for competency in the operating procedures listed above.  The LADWP employee training documentation files include training records for each employee assigned to operate or maintain the chlorination process. The training ensures that the employee has the required knowledge, skills, and abilities to safely perform the duties and responsibilities, including chlorine emergency response, as provided in the operating procedures.  Employee training includes, as a minimum, the following elements:\r\n\r\n¿\tSafety Information.\r\n¿\tProcess Technology and Process Equipment, includin"
    }
  ]
}