{
  "FacilityID": 1000093187,
  "FacilityName": "DHL Supply Chain",
  "FacilityStr1": "5522 Little Richmond Road",
  "FacilityStr2": null,
  "FacilityCity": "Dayton",
  "FacilityState": "OH",
  "FacilityZipCode": "45426",
  "Facility4DigitZipExt": "3218",
  "FacilityCountyFIPS": "39113",
  "LEPC": "Greene/Montgomery County LEPC",
  "FacilityLatDecDegs": "39.774722",
  "FacilityLongDecDegs": "-84.283612",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.dhl-usa.com/supplychain",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 69502821,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "DHL Supply Chain",
  "OperatorStr1": "5522 Little Richmond Road",
  "OperatorStr2": null,
  "OperatorCity": "Dayton",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45426",
  "OperatorZipCodeExt": "3218",
  "RMPContact": "Donald W. Trimble",
  "RMPTitle": "Refrigeration Manager",
  "FTE": 116,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000175936",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-11-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-04-13 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-04-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-04-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.77596,
  "FRS_Long": -84.28215,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115652,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000093187,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117085,
          "ProcessID": 1000115652,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144625,
          "ProcessID": 1000115652,
          "ChemicalID": 56,
          "Quantity": 27000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644625,
          "ProcessID": 1000115652,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093187,
      "SummaryText": "                  Executive Summary \n\n\n\nThe Distribution Center warehouse; located in Dayton, Ohio; is operated by DHL Supply Chain for Hormel Foods Corporation, the owner. The warehouse is a Refrigerated warehouse for storage of food product prior to distribution.  We have a strong commitment to operate our facility in a safe and responsible manner. \n\n\n\nThe ammonia is contained in a closed loop system; it is designed to remain inside the piping and vessels in our facility. Ammonia as contained in equipment in the facility is compressed, condensed and evaporated to remove heat from within the facility to maintain safe storage areas and remove heat from the products being handled.  We believe that ammonia provides the safest and most efficient cooling choice for our operation. \n\n\n\nAmmonia is classified by EPA as a toxic chemical and it is necessary to observe certain safety precautions in handling it to prevent unnecessary human exposure, to reduce the health threat to our own workers, and reduce the threat to nearby members of the community.  It is our policy to adhere to all Federal and State rules and regulations.  Safety depends upon the manner in which we handle ammonia, safety devices inherent in the design of this facility, safe handling procedures that we use and the training of our personnel.\n\n\n\n                  A. Accident Release Prevention and Emergency Policies \n\n\n\nAn accidental release prevention program has been in place since 2001 when the warehouse was constructed and placed in service. The facility was designed and constructed in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines, and is in compliance with State codes.  This food processing facility complies with EPA's Accidental Release Prevention Rule and with all applicable State codes and regulations.\n\n\n\nWe take many precautions to prevent or minimize accidental releases of ammonia from the refrigeration system. These precautions include safety controls (alar"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093187,
      "SummaryText": "ms and automatic shutdown devices) which are designed to identify and prevent potentially unsafe conditions like pressure increases that could cause a system failure. We also have a preventive maintenance program designed to maintain the on-going integrity of the systems, a training program designed to ensure that the systems are operated by qualified personnel and emergency response procedures that enable trained personnel to respond quickly to system upsets. \n\n\n\nThe Refrigeration Manager is responsible for the management of these ammonia safety programs. \n\n\n\n                 B. Stationary Source and Regulated Substances Handled \n\n\n\nAmmonia is the only substance covered by the Accidental Release Prevention Regulations handled at this facility. \n\n\n\n                 C. Description of the Accidental Release Prevention Program \n\n\n\nThe facility has an accident release prevention program that complies with Occupational Safety and Health Act's Process Safety Management Standard and EPA's Risk Management Program Rule. The prevention program consists of the following elements: \n\n\n\n- Employee Participation Program: \n\n  The Plant has an overall safety program that includes employee awareness and training to minimize the potential for an accident or incident involving the ammonia refrigeration\n\n  equipment.   \n\n- Process Safety Information: \n\n  Ammonia refrigeration equipment manuals and plant design technical specifications including piping diagrams are on file.  \n\n- Process Hazard Analysis: \n\n  A process hazard analysis (PHA) re-validation was conducted in March 2021 and another PHA re-validation is schedule for March 2026.   A team with expertise in engineering, operations, maintenance, and safety evaluated the existing refrigeration system in depth and developed recommendations to improve the safety and operability of the system.  The\n\n  PHA addressed:  (1) process hazards; (2) previous incidents; (3) engineering and administrative controls applicable to the hazards; (4) t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093187,
      "SummaryText": "he consequence of control failure; (5) facility siting; (6) human factors; and (7) a qualitative evaluation of possible safety and health effects of control system failures.  \n\n- Operating Procedures: \n\n  Written Standard Operating Procedures (SOPs) were prepared to provide the basis for proper and safe operation of the ammonia refrigeration system.  The SOPs include procedures for normal operations, startup, shutdown, emergency operations, and emergency shutdown.  \n\n- Training Program: \n\n  An operator training program is designed to ensure that the systems are operated by qualified personnel.  \n\n- Contractor Safety Program: \n\n  Contractors that are used to work on or adjacent to the refrigeration system are \"pre-qualified\" based upon their knowledge of ammonia refrigeration, understanding of applicable codes and standards, and their demonstrated ability to work safely.  Each of these contractors is evaluated from a safety perspective.  \n\n- Pre-Startup Safety Review Procedures: \n\n  See comments under Management of Change  \n\n- Mechanical Integrity Program: \n\n  The Plant has a program for replacement of all Safety Relief Valves on a 5 year interval as recommended by IIAR.  We also have a preventive maintenance program designed to  \n\n  maintain the on-going integrity of the system.  \n\n- Hot Work Permit Procedures: \n\n  The plant has implemented a Hot Work permit program including training.  \n\n- Management of Change Procedures: \n\n  For projects, a management of change procedure and a pre-startup safety review are in place to ensure that system changes or expansions are safe and that the changes are\n\n  consistent with the engineering design and in condition to be operated prior to startup.  \n\n- Incident Investigation Procedures: \n\n  An incident investigation program is in place at the plant to review incidents and implement any identified improvement(s) to reduce future potential for new incidents to occur.  \n\n- Compliance Audit Procedures: \n\n  At least every three years "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093187,
      "SummaryText": "a full program audit is conducted.  \n\n\n\n                 D. Five-Year Accident History \n\n\n\nThere have been no accidents as defined by EPA Risk Management in the past 5 years that have resulted in a death, injury, or significant property damage on site or off-site death, injury, evacuation, sheltering in place, property damage, or environmental damage.  \n\n \n\n                 E. Description of the Emergency Response Program \n\n\n\nAn emergency response program has been implemented at the facility. This program contains procedures describing how the facility will respond to ammonia spills and other emergencies, including evacuation procedures. The program has been coordinated with local fire department officials. \n\n\n\nThe emergency response program is based upon federal guidelines as they apply to this facility.  The emergency response plan includes procedures for notification of the local fire authority, local emergency response agencies, and notification of any potentially affected neighbors. The facility emergency response plan is based on all known applicable regulations and requirements.  The emergency response plan has been discussed with the Dayton and Trotwood Fire Departments and other agencies involved with response.  Representatives of the Dayton and Trotwood Fire Department visit this plant on an annual basis.  \n\n\n\nThe facility has an Emergency Action Plan and will evacuate or shelter in place if a significant release occurs.\n\n\n\n                 F. Planned Changes to Improve Safety \n\n\n\nIdentification of opportunities and changes to improve safety is part of the culture of this plant.  In addition to the plant programs mentioned above, the following changes are planned. \n\n\n\nThe Dayton DC has demonstrated and plans several changes to improve employee\n\nand environmental safety, including but not limited to:\n\n- Writing additional SOP's\n\n- Addressing all findings of the 2020 Mechanical Integrity Program Audit by November 30, 2021.\n\n- The pressure relief discharge pi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093187,
      "SummaryText": "ping was modified in 2016 to comply with recent changes to the IIAR. We will be installing discharge relief piping NH3 detectors tied to the PLC/System Computer to alert us when a relief has lifted with plans to switch to Hansen Pop-Eye relief valves at our relief valve change out next year to identify the particular relief valve that lifted.\n\n- Isolating defrost relief gauges on the roof to prevent leakage in the event of a gauge failure.\n\n"
    }
  ]
}