{
  "FacilityID": 1000008902,
  "FacilityName": "ChemTreat, Inc., Eldridge, IA",
  "FacilityStr1": "200 East Trails Road",
  "FacilityStr2": null,
  "FacilityCity": "Eldridge",
  "FacilityState": "IA",
  "FacilityZipCode": "52748",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19163",
  "LEPC": "Scott County LEPC",
  "FacilityLatDecDegs": "41.621889",
  "FacilityLongDecDegs": "-090.574806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "SW",
  "FacilityURL": "www.chemtreat.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 65386906,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "ChemTreat, Inc.",
  "OperatorStr1": "4461 Cox Road",
  "OperatorStr2": null,
  "OperatorCity": "Glenn Allen",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23060",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": "IAR000004242",
  "EPAFacilityID": "100000095942",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-07-29 00:00:00",
  "SafetyInspectionBy": "Danaher Corp.",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.621889,
  "FRS_Long": -90.574806,
  "FRS_Description": "SW CORNER OF LAND PARCEL",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010382,
      "AltID": null,
      "FacilityID": 1000008902,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011847,
          "ProcessID": 1000010382,
          "ChemicalID": 31,
          "Quantity": 58000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000010730,
          "ProcessID": 1000010382,
          "NAICSCode": "325998",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000007846,
              "Process_NAICS_ID": 1000010730,
              "SafetyReviewDate": "2008-07-24 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "UL, API, NFPA 30",
              "FR_Comments": "UL for tank construction, API for emissions calculation, and NFPA 30 for storage tank installation",
              "HazardReviewDate": "2008-07-25 00:00:00",
              "ChangeCompletionDate": "2008-07-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Nitrogen blanket",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Operator in attendance, Nitrogen blanket",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-07-25 00:00:00",
              "TrainingReviewDate": "2009-01-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Powerpoint slideshow, round table discussions",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2001-02-02 00:00:00",
              "EquipmentInspectionDate": "2009-06-01 00:00:00",
              "EquipmentTested": "Pump, storage tank, combo vent, site level gauge, ultrasonic level gauge, sump pump, nitrogen blanket system, piping, valves, process equipment",
              "ComplianceAuditDate": "2008-07-25 00:00:00",
              "AuditCompletionDate": "2009-02-20 00:00:00",
              "IncidentInvestigationDate": "2008-09-19 00:00:00",
              "InvestigationChangeDate": "2008-09-23 00:00:00",
              "MostRecentChangeDate": "2008-09-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000008063,
                  "PreventionProgram2ID": 1000007846,
                  "ProcessChemicalID": 1000011847
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000008902,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-05-29 00:00:00",
    "ERTrainingDate": "2008-10-21 00:00:00",
    "CoordinatingAgencyName": "Scott Co. Emergency Management Agen",
    "CoordinatingAgencyPhone": "5633444054",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008902,
      "SummaryText": "Executive Summary - Program 2\nBackground\nChemTreatÂ¿s Risk Management Plan (RMP) is but one of many programs that have been developed to assure\nwe carefully manage all potential hazards associated with the hazardous chemicals we use in our business\nwith maximum concern for the safety and health of all employees, the community and the environment. All\nplant configuration, operations and emergency response practices are managed using company standard\noperating procedures which are a part of the Company Management Systems described below.\nQuality System (QS)\nStandard operating procedures for all production and related services are managed using an ISO 9000\ncertified Quality System. The Quality System has been certified since 1994 and adopted at the Eldridge facility\nin 1998. In October 2002 the certification was upgraded to the ISO-9001-2000 Standard. The ISO 9000\nRegistrar is ITS Intertek.\nEnvironmental Management System (EMS)\nAll environmental program procedures are included in an Environmental Management System that achieved\ncertification under to the ISO 14001 Standard in April 2004. The ISO 14000 Registrar is also ITS Intertek. The\nRMP is a program procedure under the EMS. Emergency response plans are also resident here.\nHealth and Safety Management System (HSMS)\nAll Health and Safety written programs are already installed and controlled in the Management Systems\nprocess used by the ISO 9001 and ISO 14001 programs. The existing Safety Incentive Plan implements\nsystematic methods for monitoring and improvement of health and safety requirements and issues. The\nstructure is modeled on of the ANZI-Z10 program, and certification will be sought should this credential\nreceive wide acceptance.\nPolicy\nChemTreat is well aware that our business requires the management of certain hazardous chemicals, which if\nnot properly controlled, introduce increased potential for harm to employees, the community and the\nenvironment. Accordingly, we have established systematic procedures t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008902,
      "SummaryText": "o evaluate potential risks, establish\nprocedures to manage those risks on a priority basis, and review and update our programs as conditions or\ncapabilities change. ChemTreat is committed to compliance with all regulatory and other requirements and\nuses a formal review process including internal and external auditing and inspection to assure the continuing\nsuitability, adequacy and effectiveness of all compliance programs.\nFacility And Regulated Substances\nChemTreat, Inc.Â¿s plant in Eldridge, Iowa is a small blending facility of industrial water treatment chemicals\nfor use in boilers, cooling systems, and wastewater systems. Hazardous and nonhazardous chemicals that are\nused in the blending process are stored in specifically designed and engineered storage and processing\nequipment. Chemicals are blended in a batch process into ChemTreat products which are distributed directly\nto using customers. The only regulated substance under the RMP rule used at the facility is cyclohexylamine.\nThe substitution of other less hazardous materials have been evaluated and some substitution has been\nachieved; however the use of cyclohexylamine cannot yet be completely eliminated. The on-site inventory of\ncyclohexylamine never exceeds 8,000 gallons.\nCovered Process\nThe scope of the RMP covered process is limited to transfer and storage of cyclohexylamine in the 8,000 gallon storage tank. No other processes occur where as threshold quantity of cyclohexylamine is managed.\nPrevention Program\nChemTreat, Inc. takes a systematic approach to preventing accidental releases of hazardous chemicals. Our\nmanagement systems address each of the key features of an accidental release prevention program including\nsafety information, hazard review, operating procedures, training, preventive maintenance, compliance\naudits, and incident investigation. These individual elements of our operating procedures work together to\nprevent accidental chemical releases. ChemTreat, Inc. and our employees integrate"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008902,
      "SummaryText": "these management\nsystems into the way we do business and establish specific accountability for accident prevention into our\nprocess.\nSafety Information\nRisk identification begins early in the product stewardship process when every new raw material proposed\nfor addition to process use is evaluated to determine the potential hazards of the material, compatibility with\nexisting process components and all applicable regulatory constraints. It is very unlikely that any new RMP\nrule regulated substances would ever be authorized for addition to our operations. The requirements to\nmanage the risks associated with any new hazardous materials are determined and all necessary\nconfiguration changes, program procedure updates and employee training are completed prior to\nintroduction of the new material into the process. Safety information may be in the form of the chemical\nMSDS sheet and label or may require specific procedures to be drafted under the appropriate management\nsystems program.\nHazard Review\nIn accordance with Section 68.50 of the RMP rule, we use hazard reviews to systematically identify, evaluate,\nand control process hazards. The most important products of our reviews are recommendations for reducing\nthe most significant risks of accidental chemical releases. We conduct systematic hazard reviews of the\ncyclohexylamine transfer and storage process at our facility at least every five years (or more often if necessary because of process changes or incidents). \nOperating Procedures\nIn accordance with Section 68.52 of the RMP rule, we use operating procedures to define how process related\njob tasks assigned to our personnel should be performed. Procedures are maintained under the\nvarious management systems programs. The facility maintains documentation which show operator and\nmechanic qualifications for those responsible for the cyclohexylamine system.\nTraining\nIn accordance with Section 68.54 of the RMP rule, we train our employees to safely perform their assigned\ntas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008902,
      "SummaryText": "ks. Our training program includes initial training as well as refresher training every three years, or more\noften if major process or equipment changes are made. As part of our training, we include provisions for\nensuring that employees understand the training (field demonstrations, observation, etc.).\nMaintenance\nIn accordance with Section 68.56 of the RMP rule, we maintain our process equipment using an inspection\nand testing program and we ensure that our equipment is designed and installed correctly so that it operates\nproperly. An automated maintenance program is produced by the corporate computer system which governs\nthe scheduling and record of completion of periodic maintenance on covered systems.\nCompliance Audits\nIn accordance with Section 68.58 of the RMP rule, we conduct compliance audits to ensure that the facility is\nin compliance with the RMP rule. Audits are conducted in conjunction with the Semiannual Safety and\nEnvironmental Incentive Program Audits. At the completion of each audit, a report is generated which\ndocuments any noncompliance. Audit findings are addressed through the corrective action process.\nIncident Investigations\nIn accordance with Section 68.60 of the RMP rule, we perform incident investigations to help ensure that all\nincidents are thoroughly investigated, root causes are identified and corrected, and relevant findings are\ncommunicated throughout our organization to help prevent a recurrence. All incidents which caused or could\nhave caused a release of cyclohexylamine shall be investigated no later than 48 hours of the incident. At the\nconclusion of the investigation, a report shall be prepared reviewed by a specially appointed investigation\nteam. The report shall include at a minimum: the date of the incident, the date the investigation began, a\ndescription of the incident, the factors that contributed to the incident, and any recommendations resulting\nfrom the incident.\nFive-year Accident History\nThere have been no releases or i"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000008902,
      "SummaryText": "ncidents involving cyclohexylamine from the covered process\nthat have resulted in deaths, injuries, or significant property damage on site, or known offsite deaths,\ninjuries, evacuations, sheltering in place, property damage, or environmental damage within the last five years.\nEmergency Response Program\nChemTreat is included in the Scott County Emergency Management AgencyÂ¿s emergency response plan.\nChemTreat coordinates any chemical release response actions with the Eldridge Fire Department and The\nScott County Emergency Management Agency has the appropriate mechanisms in place to notify emergency\nresponders when there is a need for a response. The facility has its own Emergency Response Plan, however\nresponse to releases of cyclohexylamine by plant personnel are limited to those actions that would be\nconsidered as similar to routine operations.\nPlanned Changes To Improve Safety\nThe existing configuration and operations of the cyclohexylamine system are of proven reliability. The\nprimary improvement planned in this area is to replace cyclohexylamine with a less hazardous technology\nthat will function as well or better in target systems. This will reduce inventory requirements or perhaps\nultimately eliminate the need to participate in this program."
    }
  ]
}