{
  "FacilityID": 1000053419,
  "FacilityName": "Superior Fertilizer Company Inc.",
  "FacilityStr1": "401 2nd Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Crook",
  "FacilityState": "CO",
  "FacilityZipCode": "80726",
  "Facility4DigitZipExt": "0187",
  "FacilityCountyFIPS": "08075",
  "LEPC": "Logan County LEPC",
  "FacilityLatDecDegs": "40.435306",
  "FacilityLongDecDegs": "-103.581889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 98280894,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Robert J Kircher",
  "OperatorStr1": "401 2nd Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Crook",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80726",
  "OperatorZipCodeExt": "0187",
  "RMPContact": "Shannon Korrey",
  "RMPTitle": "Safety Director",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000129746",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-02-25 00:00:00",
  "SafetyInspectionBy": "Colo Dept of Ag Division of Inspection & Consumer",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-11-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-11-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-11-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-10-09 00:00:00",
  "DeRegistrationEffectiveDate": "2017-08-31 00:00:00",
  "AnniversaryDate": "2020-11-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.85779,
  "FRS_Long": -102.80083,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "1",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000067107,
      "AltID": "updating RMP",
      "FacilityID": 1000053419,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000068269,
          "ProcessID": 1000067107,
          "NAICSCode": "111998",
          "_desc": {
            "NAICS_CODE": "111998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Crop Farming"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000082894,
          "ProcessID": 1000067107,
          "ChemicalID": 56,
          "Quantity": 93600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000582894,
          "ProcessID": 1000067107,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000053419,
      "SummaryText": "Superior Fertilizer Company is a small independently owned company in NE Colorado.  Superior has been in business serving our area Farmers and Ranchers for the past 42 years. Anhydrous ammonia is one of the Agriculture fertilizers that we sell to our Agriculture customers ONLY.  With the increase of Fertilizer prices we have seen our Anhydrous Ammonia sales stay constant compared to 5 years ago we saw a drop in our sales. SAFETY is still our #1 issue with our employees and our community.  Superior is updating our Risk Management Plan as described in EPA's Chemical Accident Prevention regulations at 40 CFR Part 68.  Superior keeps at its location at 401 2nd Avenue, Crook, CO a 18,000 Gallon liquid cylinder tank for Anhydrous Ammonia.  The tank has a light reflective coating of paint.  The tank has the words \"Anhydrous Ammonia\" on both sides of the tank in lettering 4 inches high.  Also on the sides of the tank are \"Inhalation Hazard\" in 2 inch lettering.  All of the valves to this tank are fenced off and are also locked up at all times, unless it is in use.  Also there are signs on the fence that say \"Keep Out, Authorized Personnel Only\" and \"Dangerous, Eye Protection Must Be worn In The Area\".  Our Safety relief valve is covered at all times to protect it from the elements.  Superior installed Emergency Shut-Off valves on June 1, 2002.  The emergency Shut-Off valves are in compliance with the American National \"Standards Institute (ANSI), K61.1-1999, Safety Requirements for the Storage and Handling of Anhydrous Ammonia, Sections 5.10.8.1 and 5.10.8.2.  By installing the Emergency Shut-Off valve this addresses our biggest potential for human error or equipment malfunction that could cause an accidental release.  We are able to shut off the flow of Anhydrous from a remote location if we are unloading a rail car or loading a nurse tank.  Another safety precaution that Superior has is to not overfill nurse tanks.  We try to put an average of 85% per tank.  The State of "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000053419,
      "SummaryText": "Colorado Department of Agriculture makes us register our Big Storage tank holding 18,000 gallons and our 30 Nurse tanks every year.  Each Nurse tank has a Registration Sticker with the current year that has to appear on the tank.  This Registration sticker has to be on the tank or the tank cannot be filled.  Our last Colorado State inspection was on Feb 3, 2010.  At this time the Colorado Department of Agriculture \"Division of Inspection and Consumer Services\" comes to our facility and the inspector checks the following: (1) Storage tank free of leaks (2) Bulk tank supports in good condition (no cracked or crumbled concrete) (3) Tank is painted white or light reflective paint and paint coating is in good condition (4) All valves and fittings are secure, free from leaks and in good conditions (5) Protective guards are in place and in good condition (6) Safety relief valves are free of debris with rain caps installed (7) All gauges-pressure and liquid level operative (8) Plant piping is the proper type (9) All pipe joints free of leaks (10) All piping is properly supported and guards in place where necessary (11) All pipes free of physical damage and rust and properly painted (12) All hoses (vapor-liquid) of ammonia type and free of damage or deterioration (13) Hoses suitable racked to prevent kinking (14) Hoses properly stored out of weather and sunlight in off-season (15) Yard free of weeds, trash and other unsafe conditions (16) Unused equipment stored out of the way (17) Facility protected against tampering (18) A minimum of 50 gal clean, fresh water or an emergency shower available (19) At least 2 sided of the storage tank has works \"Anhydrous Ammonia in 4\" letters (20) The bulk plant facility is equipped with the following emergency rescue and safety equipment (a) One pair of protective gloves (b) one pair of protective boots &copy; One full face mask with Anhydrous cartridge (d) one protective slicker and or protective pants and jacket (e) easily accessible sho"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000053419,
      "SummaryText": "wer and or at least 50 Gal of clean water in an open top container (f) tight fitting goggles or a full face shield (21) Vapor valves properly painted or labeled (a) vapor valves painted yellow (b) liquid valves painted red.  In addition to the labeling and first aid water requirements, tanks that we use for transportation (1,000 Gallon Nurse Tanks) and application of Anhydrous Ammonia are equipped with the following: (1) An adequate hitch pin and safety chains that meet the requirements of the American Society of Agricultural Engineers. (2) A pressure relief valve with the current date.  Pressure relief valves are not used after the replacement date as specified by the manufacturer. (3) Are pressure relief valves are covered with a rain cap which will allow the free discharge of vapor and prevent the entrance of water. (4) We make sure the tanks pressure gauge is approved for use with anhydrous ammonia. (5) We make sure our liquid level gauge is no more than 85% full. (6)An adequate means of securing both ends of the supply hose during transportation.  At any time you can get a hard copy of an Anhydrous Ammonia MSDS at our office from our most current supplier.  Also on file at the office is a detail procedure of unloading an Anhydrous Ammonia rail car and the loading of nurse tanks.  With safety our number 1 issue we keep these copies only in the office.  If at any times an employee or a First Responder needs the detail instructions they have to come to the office where they sign in to take a copy from our office and they are required to return the copy and sigh off.  Superior employees are not required to respond to an emergency.  They have been trained to call 911 immediately, notify the Emergency Coordinator go to the rendezvous point that Superior has assigned.  Crook's First Responder would be our local Volunteer Fire Department.  Our Crook Fire Department is a block away from our Anhydrous Ammonia Bulk Plant.  Many of our Volunteer Fireman are also our custom"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000053419,
      "SummaryText": "ers and have been to our facility many times and are very familiar with Anhydrous Ammonia and know the correct procedure with handling Anhydrous.  Respond time most likely would be less than 5 minutes.  The closest fire hydrant is 700 ft from our Anhydrous plant.  Superior Fertilizer holds annual rehearsals of our Emergency Action Plan to keep employees up on changes in our facility, policies and procedures.  We have one employee that is also on our Local Emergency Planning Commission.  Superior takes the Risk Management plan very seriously.  On our yearly hazard review that the General Manager does we have a Safety Meeting and we go over the Hazard review check list which involves but is not limited to the following: (1) The Anhydrous compressor (2) Housekeeping around the plant (3) Security locks and fence repairs if needed (4) Dates on the Anhydrous hoses (5) Hydrostatic (liquid) relief valve (6) Compressor safety (vapor) relief valve (7) Safety equipment (a) Anhydrous gloves (b) Anhydrous goggles &copy; Water Hydrant and shower in working order (d) Full face mask with Anhydrous cartridges (e) Protective boots (f) Protective slicker and protective pants and jacket.  With 30 Nurse Tanks they are on site at the Crook location during our off season.  When the Nurse Tanks leave our premises they are individually weighed at the Main office which at that time a scale ticket is made out with the Tank Number on the ticket, the date, time it is weighed out and the customers name that the tank is being taken to.  The exact location that the tank should be is found on our phone log that is kept when the customer calls in for a delivery.  A copy of the scale ticket goes with our driver with a Emergency Response Card that lists (1) Potential Hazards (2) Emergency Action (3) First aid (4) a 24-Hour emergency response number.  The hard copy of the tickets (which are in triplicate) never leaves the office.  Superior also does monthly inventories of our Anhydrous Large storage an"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000053419,
      "SummaryText": "d of the 30 Nurse Tanks that are accounted for.  As a foot note when filling out our Risk Management Plan we went to the website to find Crook, CO latitude and longitude.  The Website is as follows: (http://mac.usgs.gov/maplists/indeshtml).  At that point we request Colorado and then Crook the following came up.  40 45' 00\" latitude 102 45' 00\" longitude.  The map type was topographic.  My report would not allow this it kept telling us it was outside the valid bounding box for Logan County, CO."
    }
  ]
}