{
  "FacilityID": 1000035058,
  "FacilityName": "Darnel Inc",
  "FacilityStr1": "1809 Airport Road",
  "FacilityStr2": null,
  "FacilityCity": "Monroe",
  "FacilityState": "NC",
  "FacilityZipCode": "28110",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37179",
  "LEPC": "Union County LEPC",
  "FacilityLatDecDegs": "35.028889",
  "FacilityLongDecDegs": "-080.622222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Darnel Holdings",
  "Company2Name": "Ajover SA",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Darnel Inc",
  "OperatorStr1": "1809 Airport Road",
  "OperatorStr2": null,
  "OperatorCity": "Monroe",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28110",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Guy",
  "RMPTitle": "RMP Coordinator",
  "FTE": 95,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199858",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "09709R00",
  "SafetyInspectionDate": "2012-09-28 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-07-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-07-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-07-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-07-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000042886,
      "AltID": "Iso Butane Storage",
      "FacilityID": 1000035058,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000043268,
          "ProcessID": 1000042886,
          "NAICSCode": "32614",
          "_desc": {
            "NAICS_CODE": "32614",
            "NAICS_DESCRIPTION": "Polystyrene Foam Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000051570,
          "ProcessID": 1000042886,
          "ChemicalID": 107,
          "Quantity": 136000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 107,
            "ChemicalName": "Isobutane  [Propane, 2-methyl]",
            "CASNumber": "75-28-5",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000551570,
          "ProcessID": 1000042886,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000035058,
      "SummaryText": "EXECUTIVE SUMMARY:\n\n\n\nDarnel Inc. has a goal of 100% compliance with the requirements of the EPA Risk Management Requirements for a flammable material stored in excess of 10,000 pounds. It is the policy of Darnel Inc. that each employee has a safe and healthful workplace. It is also the policy of Darnel Inc. that each employee follows all safety rules and safe work practices. Darnel has worked closely with the local fire department to develop an emergency response plan for the site that has been integrated into the local community response plan\n\n\n\nFACILITY DESCRIPTION:\n\n\n\nThe Darnel Facility at 1809 Airport Road, Monroe manufactures polystyrene foam packaging. Polystyrene pellets are melted in an extruder, mixed with liquid iso butane under pressure and extruded through a die to atmospheric pressure producing foam. The iso butane is stored under pressure on site at a maximum inventory of 136,000 pounds. The process is covered by the Occupational Health and Safety Act (OSHA) for Process Safety Management (PSM) of hazardous chemicals, 29CFR1910.119\n\n\n\nSUMMARY OF HAZARDS:\n\n\n\nIso butane has a boiling point of 11?F and a flash point of -116?F making this material extremely flammable. The flammable range is 1.4% - 8.3% in air and iso butane vapor is almost twice the density of air. It will pool on the ground as a result of a storage leak and will evaporate. The vapors will stay close to the ground and collect in low places as it dissipates. Liquid iso butane contact with the skin may cause frost bite because of evaporative cooling.\n\n\n\n\n\nPREVENTION PROGRAM:\n\n\n\nEMPLOYEE PARTICIPATION:\n\n\n\nDarnel has developed policies and procedures for Employee Participation and has initiated implementation. Operations people will be involved in upcoming PHA reviews as well as operating procedure updates, Management of Change activities and Pre Start Up Safety Reviews.\n\n\n\nTRAINING:\n\n\n\nAll employees have been trained through on the job training as well as OSHA classes. Procedures are in plac"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000035058,
      "SummaryText": "e for the training and orientation of new employees as well as retraining of employees at least every three years. Training will take place over the next twelve months in the areas of MOC, PSSR, Mechanical Integrity and PHA as required by job description. A confirmation form for acknowledgement and understanding of training has been initiated.\n\n\n\nMANAGEMENT SYSTEM:\n\n\n\nA written management system for the implementation and sustainability for RMP has been developed and implemented. A PSM/RMP coordinator has been assigned and ownership of specific parts of RMP has been established. A schedule for the review of procedures, retraining of personnel, PHA review and completion of compliance audits has been established.\n\n\n\nOPERATING PROCEDURES:\n\n\n\nOperating Procedures have been written for normal start up, running, shutdown, emergency shutdown and start up after emergency shutdown. Operating limits and consequences of deviation have been included in the procedures.\n\n\n\nPROCESS SAFETY INFORMATION:\n\n\n\nAll Process Safety Information has been collected including MSDS, P& IDs, Operating limits; interlocks and process safety relief sizing calculations have been collected and filed in a central location for access by all employees.\n\n\n\nMECHANICAL INTEGRITY:\n\n\n\nA mechanical integrity program has been developed and is in place. The plant was started up in April 2007 and all equipment was inspected to ensure that it was installed and set up according to design requirements. Mechanical inspection programs have been set up to meet code requirements and critical instrumentation will be tested every six months according to vendor instructions. All semi annualinspections of the iso butane storage tank have been completed.\n\n\n\nINCIDENT INVESTIGATION:\n\n\n\nA procedure for incident and accident investigation has been developed including reporting requirements to regulatory agencies. \n\n\n\nEMERGENCY RESPONSE:\n\n\n\nEmergency Procedures have been developed for minor and major releases of iso butane that "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000035058,
      "SummaryText": "include shutdown procedures and on and off site notifications. Assembly areas have been identified. The plan has been reviewed with the City Of Monroe fire department and incorporated in to the Local Community Emergency Response Plan. A procedure for emergency response exercises has been established in collaboration with the City Of Monroe fire department.\n\n\n\nPROCESS HAZARD ANALYSIS\n\n\n\nA PHA review of the process was completed 4/21/11. P&ID?s are up to date. HAZOP methodology was used for the review."
    }
  ]
}