{
  "FacilityID": 1000022893,
  "FacilityName": "CS-11",
  "FacilityStr1": "18743 470th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Estelline",
  "FacilityState": "SD",
  "FacilityZipCode": "57234",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46039",
  "LEPC": "Deuel County LEPC",
  "FacilityLatDecDegs": "44.594459",
  "FacilityLongDecDegs": "-096.784736",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ormat.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "OREG1",
  "Company2Name": "Ormat Nevada Inc.",
  "CompanyDUNS": null,
  "Company2DUNS": 929315661,
  "OperatorName": "OREG1",
  "OperatorStr1": "6225 Neil Road",
  "OperatorStr2": null,
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89511",
  "OperatorZipCodeExt": "1136",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000195754",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-06-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-06-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-06-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 44.594459,
  "FRS_Long": -96.784736,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000027958,
      "AltID": null,
      "FacilityID": 1000022893,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000033416,
          "ProcessID": 1000027958,
          "ChemicalID": 125,
          "Quantity": 61728.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000028256,
          "ProcessID": 1000027958,
          "NAICSCode": "221119",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000024084,
              "Process_NAICS_ID": 1000028256,
              "SafetyReviewDate": "2010-11-16 00:00:00",
              "PHA_Date": "2009-08-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-12-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "FM 200 Suppression System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-06-16 00:00:00",
              "TrainingReviewDate": "2011-06-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-06-16 00:00:00",
              "EquipmentInspectionDate": "2011-04-29 00:00:00",
              "EquipmentTested": "semi-annual and annual maintenance - Vaporizer level, pressure transmitters.  Condenser leve and pressure transmitters.  Feed pump flow, temperature and pressure transmitters.",
              "ChangeMgmtDate": "2011-03-01 00:00:00",
              "ChangeMgmtReviewDate": "2008-12-01 00:00:00",
              "PreStartupReviewDate": "2010-12-12 00:00:00",
              "ComplianceAuditDate": "2010-11-16 00:00:00",
              "AuditCompletionDate": "2011-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2011-02-18 00:00:00",
              "HotWorkPermitReviewDate": "2011-02-21 00:00:00",
              "ContractorSafetyReviewDate": "2011-02-21 00:00:00",
              "ContractorSafetyEvalDate": "2011-02-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000028577,
                  "PreventionProgram3ID": 1000024084,
                  "ProcessChemicalID": 1000033416
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000022893,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-02-01 00:00:00",
    "ERTrainingDate": "2008-11-01 00:00:00",
    "CoordinatingAgencyName": "Deuel County Sheriff",
    "CoordinatingAgencyPhone": "6058748211",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000022893,
      "SummaryText": "ure process equipment, pentane unloading system, vapor recovery system, evacuation system and non-condensable removal system. Each section is protected by pressure relief systems that may include pressure safety valves, pressure control valves, control system shutdown and intervention logic and administrative practices. \n\nQuantities Handled or Stored \n\nThe pentane is normally found in both the operating and static portions of the process.  When in operation, the majority of the pentane is found in the working binary process.  There is some additional pentane present in the connected storage tank.  For the purpose of defining registration quantities, a fully-charged operating system is assumed plus a storage tank that contains the residual amount of pentane.  For the purpose of calculating a registration quantity, the 28,000 metric tons (61,728 lbs) shipped to the site for the initial fill is used.\n\nWorst Case Scenario \n\nWorst case scenario is based on a vapor cloud explosion. Although safeguards are in place to make a worst case scenario extremely unlikely, it was assumed the explosion originates at a full pentane storage tank, which represents the largest single container onsite.  The tank is assumed to be filled to 80% of water capacity. \n______________________________________________\n\nEnd Point Distance: 0.3 miles\nConsequence Analysis: Calculated by RMP*Comp\n\nResults of Consequence Analysis\nChemical: Pentane\nCAS #: 109-66-0\nCategory: Flammable Liquid\nScenario: Worst-case\nQuantity Released: 45,352 lbs\nRelease Type: Vapor Cloud Explosion\nEstimated Distance to 1 psi Overpressure: 0.3 miles (0.5 kilometers)\n\n --------Assumptions About This Scenario-------- \nWind speed: 1.5 meters/second (3.4 miles/hour)\nStability Class: F\nAir Temperature: 77 degrees F (25 degrees C)\n______________________________________________\n\nThe RMP comp model is a conservative screening tool and may overestimate distances to endpoint. By RMP rules, the model does not accommodate mitigative meas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000022893,
      "SummaryText": "ures that may prevent propagation of any accident.\n \n&#8195;\nOREG1 CS-11 is located in a relatively isolated area surrounded by farmland. The facility is approximately 33 km southeast of Watertown, SD.  Examination of topographic maps and visual observation of the potentially affected area in a worst case scenario did not identify any residential structures, parks or other public places.  However, this facility is adjacent to the compressor station that provides the heat source and this station is within the affected area.  The compressor station staff is not employed by Ormat, nor does Ormat control their access to the compressor station.  Given this proximity to public receptors, this facility cannot qualify for an RMP program level 1.  In the initial RMP submittal, compressor station employees were not considered public receptors; hence, a program level 1 was designated.  Although program level 1 was initially designated, the OREG always had a program level 3 prevention program in place.\n\nAlternate Case Scenario Description\n\nThe alternate case scenario is based on a pool fire.  The pool is formed upon a hose rupture that occurs during tanker truck offloading to the pentane storage tank.  It is very conservatively assumed that it takes approximately 10 minutes to stop the flow.\nEnd Point Distance: 0.1 miles\nConsequence Analysis: Calculated by RMP*Comp\n______________________________________________\n\nResults of Consequence Analysis\nChemical: Pentane\nCAS #: 109-66-0\nCategory: Flammable Liquid\nScenario: Alternate Case\nQuantity Released: 1,020 lbs/minute over 10 minutes\nRelease Type: Pool Fire\nEstimated Distance to heat radiation of 5 kw/sq. meters: 0.1 miles (0.2 kilometers)\n\n --------Assumptions About This Scenario-------- \nWind speed: 3.0 meters/second (6.7 miles/hour)\nStability Class: D\nAir Temperature: 77 degrees F (25 degrees C)\n______________________________________________\n\nPrevention Program Description \n\nSafety information: \n\nMaintenance Procedures: OREG1 has"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000022893,
      "SummaryText": "is detected the monitoring staff shall notify local emergency personnel including fire and police departments. \n\nNotification of Northern Pipeline Personnel: Any Northern Border Personnel which may \nbe at the site during the alarm condition must also be notified through Northern Border procedures. Northern Border Personnel should not attempt to respond to the alarm conditions unless they have been trained and certified to do so. The principal methods of accident prevention include equipment design safeguards, written procedures and operator/employee training. Safety systems are present in the facilities and have various methods of operation. Pressure safety systems typically have three levels of degree. The initial degree is an alarm that is presented audibly and visually to the control Room operator. The \nnext more severe degree is a shutdown of process equipment likely to be causing or exacerbating the condition and an alarm that is presented audibly and visually to the control Room operator. The third and most severe degree of pressure safety system are Pressure safety valves which relieve to atmosphere or to larger low pressure systems. Some of these PSV's also have control Room Alarms. A combustible gas detection system is present in each of the plants.  Sensors are strategically located in each plant control Room audio and visual alarms annunciate concentrations in excess of 40% of LEL. \n\nProcess Hazard Analysis \nOREG1 utilized a professional safety consultant experienced in organic Rankine power cycles to perform a hazard analysis appropriate to the complexity of the process for identifying, evaluating, and controlling hazards involved in the process and shall determine and document the priority order for conducting process hazard analyses based on the extent of process hazards, number of potentially affected employees, age of the process and process operating history. A HAZOP analysis was selected and utilized.  \n\nThe original process hazard analysis was re"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000022893,
      "SummaryText": "validated in August, 2009.\n\nAccident History \nOREG1 CS-11 has not had any reportable accidents. \n\nEmergency Response Plan \nOREG's Emergency Response is based on recognition and observation of potential emergency conditions, and immediate repair, or notification of the primary response agency. The policy for emergency response at OREG1 is to mitigate any accident by implementing emergency procedures that have been developed for all known contingencies. Small fires will be contained and mitigated with fire extinguishing equipment and automatic suppression systems. Emergency notification is required for \nany release or threatened release of a hazardous material which poses a significant present or potential health, safety or environmental hazard. The O&M manager is designated incident command when present. The senior operator is designated incident command when management is not present. Incident command is transferred to emergency responders upon arrival."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000022893,
      "SummaryText": "Risk Management Plan Executive Summary\nOrmat Recovered Energy Generator: OREG1 CS-11\n\nDescription of Corporate Prevention and Emergency Response Approach\n\nThis facility complies with numerous standards for pressure vessel design and testing as well as all Federal and South Dakota process safety management requirements. It is our policy to adhere to all applicable federal, state, and local laws. Copies of emergency response, process hazard analyses and process safety management plans and all technical drawing (P&IDS) for process equipment are maintained onsite for reference. Regular inspection and testing of the pentane and thermal oil systems are performed to ensure equipment integrity is maintained. The facility is equipped with a network of leak detection equipment, automatic shutdown logic controls, insulation, safety relief valves, fire detection monitors. OREG1 provides high levels of training in operating procedures, safety and emergency response. If an emergency were to occur, it is our policy to implement the emergency response procedures to mitigate damages, and to notify the nearest fire department and request their assistance. \n\nDescription of Stationary Source \n\nThe OREG1 power units are fueled by waste heat from a compressor turbine exhaust that is transformed from thermal energy into mechanical energy. This is accomplished by utilizing the organic Rankine cycle (ORC) technology. The hot gases of the turbine exhaust flow through a waste Heat Oil Heater (WHOH), where the heat from the gases is transferred to a thermal oil heat transfer fluid. The thermal oil is then circulated to the shell and tube vaporizer of an Ormat Energy Converter (OEC). The motive fluid on the shell side is vaporized and these vapors drive a special organic fluid turbine. This turbine, which rotates at 1800 rpm drives a generator which produces grid compatible power. The motive fluid then passes through a heat exchanger and enters the cycle again as a liquid. After exiting the var"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000022893,
      "SummaryText": "ious heat exchangers, the thermal oil passes through the thermal oil surge tanks and the thermal oil feed pumps, which discharge it into the WHOH. The power from this project is sold to Basin Electric Power cooperative based in Bismarck, ND. \n\nThe basic Rankine cycle model consists of four components: \n1.\tPump - Work Input\n2.\tBoiler - Heat Input\n3.\tTurbine\t - Work output\n4.\tCondenser - Heat Rejection\n\nThe Rankine cycle consists of pressurizing a liquid (pentane), vaporizing the high pressure liquid, expanding the high pressure vapor and condensing the low pressure vapor for reuse. The energy necessary for the vaporization is provided by thermal oil at a maximum temperature of 572Â°F. The thermal energy is transferred to the pentane working fluid via tube and counter-current shell heat exchangers. The OREG1 facility uses a commercial pentane with a dry cooling heat rejection system. \n\nPrimary Activities \n\nWaste thermal energy is converted to electric power. The facility is rated at 6.3MW average. The net power output to the electrical grid is rated at 5.4 MW average.  Power output is reduced in warm weather due to limitations of the air cooled heat exchangers. \n\n&#8195;\nUse of regulated substance \n\nPentane, a flammable vapor/liquid is used as a binary working fluid.  Liquid pentane is pumped from a condenser to shell and tube heat exchangers. Thermal energy provided by thermal oil is transferred to the pentane. The thermal oil heat input causes the pentane to change physical states from liquid to high pressure superheated vapor that is passed through a turbine to produce electric power. The vapor is condensed and recycled back to a pressurized liquid recuperator vessel to complete the Rankine cycle. A pentane storage tank is available for makeup. The facility design is segregated into multiple sections, each having its own design specifications dictated by the pentane conditions in that section. The sections include: the low pressure process equipment, the high press"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000022893,
      "SummaryText": "installed and operates a computerized maintenance Management software (CMMS) program. This CMMS contains information on all equipment in the facility requiring maintenance, inspections, testing, certification, calibration, etc. NFPA, OSHA, manufacturer's recommendations and operations experience have been utilized to produce a comprehensive maintenance work order system that produces maintenance requests at appropriate frequencies. Employees report any equipment deficiencies to the operation and maintenance manager who generates work orders for the repair or assessment of the problem. Routine comprehensive inspections are performed using checklists. \n\nEmergency Response Plan: The emergency response plan is intended to identify and coordinate personnel in the event there is an emergency. \n\nTraining: Some equipment in the OREG1 facilities poses potential fire, explosion, and electrical hazards that could cause serious personal injuries and costly property damage if safety procedures are not followed correctly. Safety training, conducted monthly and required of all employees, identifies the different hazards to be found on the sites. These subjects include electrical safety, fire prevention and protection, lock out and tag out procedures, hazard communication, gas detectors, fire panels, personal protective equipment, and the safe use of tools and equipment. Safety training is supplemented by the use of the Industrial Hygiene and Standard Safety Procedures manuals. \n\nCall out Procedure: If any of the following Alarm conditions are indicated by the OREG1 monitoring system, this call-out procedure must be followed: OEC failure, OEC low output, security/fire alarm trip. If any of these events should occur the monitoring staff will immediately contact the operation and maintenance manager. If the operation and maintenance manager is not reached in a timely manner the parent company, Ormat Nevada Inc. will be notified on the 24 hour phone number (775)-852-1912. If a fire"
    }
  ]
}