{
  "FacilityID": 1000028478,
  "FacilityName": "Micron Technology, Inc.",
  "FacilityStr1": "8000 S. Federal Way",
  "FacilityStr2": null,
  "FacilityCity": "Boise",
  "FacilityState": "ID",
  "FacilityZipCode": "83716",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16001",
  "LEPC": "Ada County LEPC",
  "FacilityLatDecDegs": "43.528550",
  "FacilityLongDecDegs": "-116.147505",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.micron.com",
  "FacilityEmailAddress": "mediarelations@micron.com",
  "FacilityDUNS": 93120871,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Micron Technology, Inc.",
  "OperatorStr1": "8000 S. Federal Way",
  "OperatorStr2": "P.O. Box 6",
  "OperatorCity": "Boise",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83707",
  "OperatorZipCodeExt": "0006",
  "FTE": 6082,
  "OtherEPAFacilityID": "83706MCRNT2805E",
  "EPAFacilityID": "100000217758",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-04-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-06-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-06-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-06-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-10-18 00:00:00",
  "DeRegistrationEffectiveDate": "2013-05-15 00:00:00",
  "AnniversaryDate": "2017-06-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 43.5268,
  "FRS_Long": -116.1449,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000035347,
      "AltID": "Micron Bulk Ammonia",
      "FacilityID": 1000028478,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000042831,
          "ProcessID": 1000035347,
          "ChemicalID": 56,
          "Quantity": 52000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000035713,
          "ProcessID": 1000035347,
          "NAICSCode": "334413",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000030919,
              "Process_NAICS_ID": 1000035713,
              "SafetyReviewDate": "2011-11-17 00:00:00",
              "PHA_Date": "2012-04-10 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-06-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Ambient temperature extremes, snow loads on scales, electrocution",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water mist system, collection sump",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Handheld monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-06-22 00:00:00",
              "TrainingReviewDate": "2012-04-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-06-22 00:00:00",
              "EquipmentInspectionDate": "2012-06-22 00:00:00",
              "EquipmentTested": "ISO containers; temperature and flow systems; scales; piping; controllers; pumps; scrubbers; fans; purge system, exhaust system; monitoring and emergency shutdown systems; water mist and sprinklers.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2012-06-22 00:00:00",
              "PreStartupReviewDate": "2012-06-22 00:00:00",
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-06-22 00:00:00",
              "HotWorkPermitReviewDate": "2012-04-26 00:00:00",
              "ContractorSafetyReviewDate": "2012-06-22 00:00:00",
              "ContractorSafetyEvalDate": "2012-06-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000036903,
                  "PreventionProgram3ID": 1000030919,
                  "ProcessChemicalID": 1000042831
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000028478,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-06-11 00:00:00",
    "ERTrainingDate": "2012-05-17 00:00:00",
    "CoordinatingAgencyName": "Ada City-County Emergency Managment",
    "CoordinatingAgencyPhone": "2085774750",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028478,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE FACILITY: \r\nMicron is committed to maintaining environmental quality and protecting employee health, safety, and security.  Micron works vigorously to continuously improve in support of these commitments.\r\n\r\nMicron is committed to maintaining a safe, healthy, and secure workplace by working to prevent occupational illnesses, injuries, and property losses. Micron also strives to minimize the impact of our operations on the environment by working to identify opportunities to reduce air, water, land and energy impacts at the earliest stages of planning and production.\r\n\r\nMicron holds managers and supervisors responsible for leading, implementing and maintaining safe, secure, and compliant work areas. Management, employees, and contractors are expected to help identify, eliminate, and control environmental, health, safety, and security (EHSS) hazards and risks. All employees and contractors will follow relevant EHSS procedures and applicable legal requirements, including those contained in Micron's Code of Business Conduct and Ethics (found at www.micron.com).\r\n\r\nTHE FACILITY AND THE REGULATED SUBSTANCE HANDLED: \r\nThe covered process is a bulk chemical distribution system that supplies high purity White grade gaseous anhydrous ammonia through distribution piping to manufacturing and R&D equipment for metal organic chemical vapor deposition which is a basic step in LED manufacturing.\r\n\r\nContainers:\r\nThe system uses two 20 foot long ammonia International Organization for Standardization (ISO) containers (ISO container) that are owned, filled and maintained by Air Products and Chemicals, Inc (Air Products). The ISO containers are connected to the fixed distribution piping at the specially designed pad with a flexible pigtail.  Each ISO container has approximately 26,000 lbs of liquid anhydrous ammonia when completely full.  Although both ISO containers are connected to the piping system, only one supplies"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028478,
      "SummaryText": "anhydrous ammonia to the piping at any one time.  When the container reaches its low level, it is disconnected from the piping system and returned to Air Products in Hometown, Pennsylvania to be serviced and filled after being replaced with a full ISO container.\r\n\r\nThe ISO containers come equipped with electric heaters on the bottom of the ISO containers that are plugged in as part of an ISO container change to keep the anhydrous ammonia at a specified temperature to support delivery pressure.\r\n\r\nBulk Ammonia Pad:\r\nThe bulk ammonia pad is a specially designed structure that includes ISO container scales, flexible connections to distribution piping, electrical connections, purge gases, flow controllers, ventilation, safety shower and other safety and support equipment.  The structure at the pad provides safe worker access to the connections at the top of the ISO container and environmental cover for the ISO containers.\r\n\r\nDistribution System:\r\nGaseous ammonia is delivered from the ISO container through a 1 inch heat traced stainless steel pipe along a utility trestle to the building housing process tools. Once inside the building, the pipe goes through a manual distribution box and then a valve manifold box where it is split into eight ½ inch pipes for distribution to the equipment after going through a purifier box.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\r\nMicron utilizes the required PSM/RMP for the anhydrous ammonia regulated process to prevent and minimize the consequences of catastrophic release of anhydrous ammonia. The goal of the PSM is to protect on-site employees and the RMP protects the health and safety of the environment and the community. Components of the PSM/RMP document include:\r\n\r\nProcess Safety Information:\r\nInformation pertaining to the hazards of ammonia (toxicity information, permissible exposure limits, physical, reactivity, corrosivity, thermal and chemical stability data, and hazardous effects"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028478,
      "SummaryText": "of inadvertent mixing of different materials that could forseeably occur) can be found in the Air Products ammonia Material Safety Data Sheet (MSDS). Detailed information concerning the technology and equipment of the process are included in the PSM/RMP documents.\r\n\r\nProcess Hazard Analysis:\r\nThe process hazard analysis has been conducted using a hazard and operability (HAZOP) methodology. At least every five years the analysis will be updated and revalidated by a team with representation from appropriate groups. A preventative maintenance (PM) work order has been entered in Micron's asset management software (Maximo) to trigger this event.  The work order will dispatch to the safety team who will initiate this effort. All future findings will be promptly addressed with corrective action and completion dates recorded in the analysis.  All process hazard analyses, updates, revalidations, and corrective actions and resolutions will be kept for the life of the process.\r\n\r\nOperating Procedures:\r\nWritten operating procedures for the process equipment have been developed, implemented, and are maintained in Micron's document management (MDM) system.  The procedures for ammonia delivery include the following:\r\n\r\n* Steps for each operating phase;\r\n* Operating limits;\r\n* Safety and health considerations; and\r\n* Safety systems and their functions.\r\n\r\nThe operating procedures are available to those that operate and/or maintain the equipment electronically. The operating procedures will be reviewed to ensure they reflect the current practice, including any changes that may have occurred. The existing Periodic Document Review process with Facilities will be used to initiate this review. Each manager that controls PSM/RMP procedures will certify annually that procedures are current and accurate.\r\n\r\nTraining:\r\nTeam members involved in operating and maintaining the bulk ammonia distribution system and associated equipment will receive training to ensure procedures are performed pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028478,
      "SummaryText": "perly and safely.  In many cases, maintenance of support equipment associated with the process is performed by skilled trades that are performing work directly within their profession. In this case, supervisors will evaluate the workers ability to perform the task and certify they are competent to perform the task outlined in the procedure.  For example, a standard maintenance practice for motors and pumps is to have journeyman electricians perform electrical measurements. \r\n\r\nAll training will include a method to verify comprehension such as a written assessment or evaluation by a direct supervisor.  Records of training will be maintained in Micron's Train system.  All training will require a 3 year recertification which will be obtained through classroom training, computer based assessment or direct supervisor evaluation depending on the complexity of the task. \r\n\r\nMechanical Integrity:\r\nInspection and testing schemes are established for all equipment in the process to ensure on-going integrity and that equipment is installed properly and maintained within design specifications.  The testing and inspections align with manufacturers recommendations and are tracked in Maximo as PM events performed by trained employees. The Maximo record will capture the date, person performing the inspection/test, the serial number or other identifier of the equipment, a description of the inspection/test performed, and the results. Equipment deficiencies that are outside acceptable limits will require additional controls to run the equipment safely (or not run the equipment) until corrections can be made. Appropriate checks and inspections have been performed to assure that equipment is installed properly and consistent with design specifications and the manufacturer's instructions.\r\n\r\nManagement of Change:\r\nChanges to the system or the process will be reviewed and approved before they occur. The review process for each change will involve team members from Safety, Environmental, F"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000028478,
      "SummaryText": "acilities Engineering and applicable Operations and Maintenance Teams. A management of change (MOC) checklist will be completed for each change to assure that it is appropriately reviewed and applicable PSM/RMP program elements are updated prior to being implemented.  Completed checklists will be stored in Micron's document management system (MDM) with a key word of MOC and a link added to the Maximo work order or engineering change notice (ECN). As outlined on the MOC checklist, the MOC review process will take into account the:\r\n\r\n* Technical basis for the change;\r\n* Impact of the change on safety and health;\r\n* Changes to procedures;\r\n* Necessary time period for the change; and\r\n* Required training for the change.\r\n\r\nAuthorization for the change will only be granted with permissible conditions on the MOC checklist. \r\n\r\nPre-Startup Safety Review:\r\nA pre-start up safety review has been completed in conjunction with Air Products for the installation of the bulk ammonia distribution system. The safety review included the completion of the Air Products Operational Readiness Inspection (ORI) checklist which includes confirmation that:\r\n\r\n* Safety, operating, maintenance, and emergency procedures are in place and adequate;\r\n* Process hazard analysis has been performed and recommendations are resolved; and\r\n* Training is in place for each employee involved in operating the bulk ammonia at the pad.\r\n\r\nIn addition, reviews of construction and equipment by Micron Trade Leads and Equipment Owners, and City officials to ensure equipment is in conformance to design specifications. \r\n\r\nCompliance Audits:\r\nMicron will evaluate and certify compliance with the PSM/RMP standard at least every three years.  The audit will be coordinated by Safety with representatives from Environmental, Engineering, Gas Services and Operations and Maintenance on the audit team.  At least one member of the audit team will be knowledgeable with the process.\r\n\r\nA PM in Maximo has been established to tr"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000028478,
      "SummaryText": "igger the audit. The work order will dispatch to the Safety team which will be responsible to coordinate the audit.  An audit report of the findings, as well as appropriate response or corrective action for each finding, will be documented in MDM and linked in the closed work order.\r\n  \r\nMicron will maintain the two most recent compliance audit reports.\r\n\r\nIncident investigation:\r\nAny incident or near miss that could have caused a catastrophic release of ammonia will be called into Security Control.  Any incident in a PSM area or associated with PSM equipment will be called into Security Control will be investigated by a team, lead by Safety.  The investigation will begin as soon as possible, but not later than 48 hours after the incident (time will be tracked from the time the incident is called into Security Control.) The investigation team will include at least one person who is knowledgeable of the process.  \r\n\r\nIncidents involving contractors will be investigated in the same manner and will include a person from the contractor's company on the investigation team. Investigations will follow Micron's Event Investigation Procedure. \r\n\r\nA written report of the investigation will be prepared and will include at a minimum:\r\n\r\n* Date of incident;\r\n* Date investigation began;\r\n* Factors that contributed to the incident; and\r\n* Recommendations resulting from the investigation, along with resolutions and corrective action completion.\r\n\r\nThe investigation report will be reviewed with all team members and contractors whose job tasks are relevant to the investigation findings. Incident investigation reports will be retained in MDM and attached to a Micron event tracking (METS) report which will be generated for each event.\r\n\r\nEmployee Participation:\r\nTeam member participation is imperative in obtaining accurate information on current practices and concerns, and in successfully implementing procedures. PSM/RMP written plans can be accessed by team members by going to the PSM"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000028478,
      "SummaryText": "sharepoint site (alias PSM). Team members are encouraged to submit questions, concerns or improvement opportunities through a link on this SharePoint page.\r\n\r\nTeam members involved in the ammonia receiving and hook-up have been represented on the design team, the team conducting the process hazard analysis, as well as representation concerning the writing of the operational and maintenance procedures.  Gas Services and Operation and Maintenance team members are encouraged to actively evaluate operational procedures and job plans for accuracy and submit an ECN where procedures are inaccurate or could be improved. \r\n\r\nDuring an incident investigation, representation on the investigation team will include a team member or contractor, as appropriate, to provide procedural expertise.\r\n\r\nHot Work Permit:\r\nMicron has an established \"Hotwork Permit Program\" for all operations on site that have the potential to produce sparks and flames.  The permit requires specific safety controls (i.e. fire watch, removal of combustibles, security notification, etc.) to reduce the risk of fire typically associated with cutting and welding operations.  \r\n\r\nContractors:\r\nContractors that perform work inside the fence of the bulk ammonia area or on or near ammonia distribution piping will be part of the PSM/RMP program.  Prior to beginning work, contracting companies will need to be approved.  Names of approved companies will be maintained on the PSM Approved Contractor spreadsheet by Safety.\r\n\r\nThe following requirements apply to contract partners involved in the program prior to work being performed on or near the covered PSM/RMP process:\r\n\r\n* Micron evaluates safety performance of the company through the use of the Micron's Independent Contractor EHSS Questionnaire.  Completed forms are stored in MDM after evaluation by Safety;\r\n* Micron informs contractors of the hazards related to the contractors work and the process and the emergency action plan though training on the PSM Training Che"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000028478,
      "SummaryText": "cklist. This training is conducted during the weekly Facilities contractor training session.  Hosts or other PSM/RMP trained team members may conduct this training if contractor is unable to attend the general orientation prior to beginning work.  Records of the training are maintained in Micron's Train system;\r\n* Micron periodically audits contractor's performance through Micron's existing EHSS auditing processes.  A minimum of one PSM/RMP contractor audit will be performed per year; and\r\n* Contractor injury and illnesses associated with work on or near the covered PSM process will be maintained in a log.  All injuries and illnesses records are maintained in the company SAP database.  For investigation tracking purposes a SharePoint site has been established (alias ICAT - restricted access) to track investigation closure and causal factors.  Events associated with the PSM/RMP covered process will be indicated by the Safety investigator as such, creating a sortable log to distinguish between those related to the covered process. \r\n\r\nMicron's contract partners are expected to do the following:\r\n\r\n* Assure contractor employees are trained in applicable work practices;\r\n* Assure contractor is instructed in the hazards related to their job and the process;\r\n* Document that training was delivered and understood;\r\n* Ensure contractors follow the safety rules of the facility; and\r\n* Advise Micron of any unique hazards presented by contract employer's work.\r\n\r\nMicron has communicated expectations in writing to those contracting companies advising them of their responsibilities associated with potential work on or around the covered process as part of the contractor evaluation process.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY:\r\nThe system is new as of the initial filing of the PSM/RMP documents.  There is no accident history associated with this PSM/RMP covered process.\r\n\r\nIn the event that an accidental release from the covered process occurs resulting in deaths, injuries, or signific"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000028478,
      "SummaryText": "ant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage, Micron will record and report the following within 6-months of the event: \r\n\r\n* Date, time, and approximate duration of the release; \r\n* Chemical released; \r\n* Estimated quantity released in pounds; \r\n* NAICS code; \r\n* The type of release event and its source; \r\n* Weather conditions (if known); \r\n* On-site impacts; \r\n* Known off-site impacts; \r\n* Initiating event and contributing factors (if known); \r\n* Whether off-site responders were notified (if known); and \r\n* Operational or process changes that resulted from investigation of the release and that have been made by the time this information is submitted in accordance with Part 68.168. \r\n\r\nEMERGENCY RESPONSE PROGRAM:\r\nMicron has emergency response procedures at the Boise site that include emergency notification, evacuation procedures and emergency response to compressed gas leaks. Micron personnel will respond to accidental releases of ammonia. The Boise Micron site is included and participates with Ada City-County Emergency Management, the local emergency planning committee (LEPC). In addition to Micron's existing emergency response team (ERT) system, Micron has completed the following activities applicable to the bulk ammonia distribution system:\r\n\r\n* Received training from the supplier (Air Products) around ERT response methods, hazards and conditions to avoid associated with potential leaks at the ammonia ISO container pad (Air Products ERT Training);\r\n* Conducted training and orientation with the local Fire Department;\r\n* Developed specific response procedures for response to a potential release from the bulk ammonia distribution system; and\r\n* Trained ERT technician level employees on specific response procedures associated with emergency shutdown and containment, evacuation and PPE.\r\n\r\nAll incidents or near misses that occur in the PSM area will be called into Security"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000028478,
      "SummaryText": "Control.  The caller or responding team members will identify an incident in the ammonia pad area as occurring in a \"PSM Area\".  Responses to gas releases may also be initiated by readings on the toxic gas monitoring system.\r\n\r\nSecurity Control will make the proper pages and phone calls to begin the response and investigation. Local agencies responding to an accidental release receive information through the initial dispatch as well as ongoing information to the Incident Commander via the Incident Command System.  Information is passed between Micron and local responding agencies through this command system.  Information to the public is provided through a PIO (Public Information Officer).  This may be a Micron representative or a representative of the responding agency.\r\n\r\nIn the event of a catastrophic release, the ERT captain will assure that employees involved in an evacuation exit the building away from the ammonia pad.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY:\r\nThe covered process is new as of the initial filing of the PSM/RMP documents. As a result, Micron has initiated a new PSM/RMP program associated with this covered process. Micron is committed to maintaining environmental quality and protecting employee health, safety, and security. Micron works vigorously to continuously improve in support of these commitments."
    }
  ]
}