{
  "FacilityID": 1000069704,
  "FacilityName": "Grande Cheese",
  "FacilityStr1": "N2607 County S",
  "FacilityStr2": null,
  "FacilityCity": "Juda",
  "FacilityState": "WI",
  "FacilityZipCode": "53550",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55045",
  "LEPC": "Green LEPC",
  "FacilityLatDecDegs": "42.601205",
  "FacilityLongDecDegs": "-89.505535",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Charlie Rubio",
  "OperatorStr1": "N2607 County S",
  "OperatorStr2": null,
  "OperatorCity": "Juda",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53550",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chalie Rubio",
  "RMPTitle": "Plant Manager",
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000231803",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-08-29 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-07-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-07-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-07-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-07-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000087304,
      "AltID": "Ammonia refrigeration Sys",
      "FacilityID": 1000069704,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000088507,
          "ProcessID": 1000087304,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108852,
          "ProcessID": 1000087304,
          "ChemicalID": 56,
          "Quantity": 21955.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000608852,
          "ProcessID": 1000087304,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069704,
      "SummaryText": "GRANDE CHEESE\n\n\n\nJUDA, WI   53550\n\n\n\n\n\n\n\nExecutive Summary\n\n\n\n\n\n\n\nRisk Management Program\n\n\n\n\n\n\n\nWorst Case Release\n\n\n\nAlternate Case Release\n\n\n\n\n\n \n\nThe Grande Cheese Company, located in, Juda, WI, is a production facility offering a range of cheese products. Grande Cheese uses Anhydrous Ammonia as a refrigerant at this facility to provide cooling for the production and storage areas. The Grande Cheese refrigeration system is a closed loop system with normal operating pressures that range between a low side of 6hgvac to a high side of 185 psi. The systems maximum intended inventory is 21,955 pounds.\n\n\n\nWorst-case Release Scenario for a Toxic Release\n\nThe Grande Cheese worst-case release is the catastrophic failure of the High Pressure Receiver in the ammonia system. The maximum capacity of the High Pressure Receiver is 21,757 pounds at 100% full. The normal operating level in the HPR is 6,587 pounds, so the worst-case release scenario takes in account the possibility the vessel would be 80% full holding 17,405 pounds. Using the RMP Comp program downloaded from the EPA Home Page the calculated toxic endpoint was 2.2 miles down wind. Based on the census data provided the population within the radius of the toxic endpoint is 621, with 246 residential housing, in the area. There are no hospitals located within the area.\n\n\n\nThe worst-case release is the catastrophic failure of the High Pressure Receiver in the ammonia system. The vessel capacity of the High Pressure Receiver is described above. Although the worst case scenario is a requirement by the RMP ruling it is not a likely scenario to take place. Grande Cheese Company follows the industrial standards to assure proper material is used in the ammonia refrigeration system. By following the industrial standards and the EPA / OSHA standards the shell failure unlikely.\n\n\n\nANSI/IIAR-2 Standard for Equipment, Design, and Installation of Ammonia Mechanical Refrigeration Systems.\n\n\n\nANSI/ASHRAE 15-1992 Safety Code for Mech"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069704,
      "SummaryText": "anical Refrigeration.\n\n\n\nASME/ANSI B31.5 Refrigeration Piping Code.\n\n\n\nASME Boiler and Pressure Vessel Code.\n\n\n\nInternational Institute of Ammonia Refrigeration (IIAR) Bulletin 110 - Startup, Inspection and Maintenance of Ammonia Mechanical Refrigeration System.\n\n\n\nInternational Institute of Ammonia Refrigeration (IIAR) Bulletin 116 - Guidelines for: Avoiding Component Failure in Industrial Refrigeration Systems Caused by Abnormal Pressure or Shock.\n\n\n\n \n\nAlternative Release Scenario for a Toxic Release\n\nThe alternative toxic release scenario was also determined by using the EPA's RMP Guidance. The alternative release was a pressure relief valve function or failure was the most likely cause of an ammonia release. Using the tables provided a pressure relief valve release of 10 minutes releasing 67lbs/mn from the High Pressure Receiver. The toxic endpoint for the release would be .20 miles down wind. The estimated population within the distance would be 12 people. There is no school, 4 residential housing. There are no hospitals in the area.\n\n\n\nAccidental Release and Emergency response Policies:\n\nThe Grande Cheese Company has established steps to include initial training under the OSHA standard 29 CFR 1910.120 HAZWOPER. The facility has also established annual retraining for all personnel that are on the HAZMAT Team as well as periodic spill drills and plant wide evacuation drills to assure all employees are prepared in the event of an ammonia release. Grande Cheese Company has also coordinated efforts with the Volunteer Fire Department to establish a joint response program. The Grande Cheese established plans and procedures are periodically reviewed and at least annually to assure that they are current and up to date.\n\n\n\nEmergency Response Program:\n\nGrande Cheese Company has trained personnel that are the refrigeration operators to assure they can perform their responsibilities and procedures safely. The refrigeration operators receive training on the ammonia system "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069704,
      "SummaryText": "when there is a change in the system and at minimum of every three years. Grande Cheese has also trained personnel in the Hazardous Waste Operation and Emergency Response Program, OSHA 29 CFR 1910. 120 HAZWAOPER. The trained personnel have been trained at the level of the Operation Level Responder and also the Incident Commander on scene. The trained personnel will assess each release situation and determine by the risk assessment the appropriate emergency response to initiate. This could be by simply tightening a packing nut or a flange bolt or initiating a system shut down. Grande Cheese has established a written operating procedure for the ammonia system and has included in the procedure the Emergency Shutdown and Isolation in the event of a release. Grande Cheese has also purchased Air Purifying Respirators and the other appropriate equipment to support the HAZMAT Team. The in-house HAZMAT Team will coordinate their efforts with the outside Emergency Services to assure safety for all personnel.\n\n\n\n \n\nFive Year Accident History:\n\nThere have been no accidental releases in the past five years.\n\n\n\nGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps:\n\nOSHA Process Safety Management\n\nEPA Risk Management Program\n\nOSHA HAZWOPER Program\n\nASME Boiler & Pressure Valve Codes\n\nANSI B31.3 Piping Code\n\nIIAR Industry guideline for safety and good engineering practices\n\nNFPA guidelines for fire protection equipment\n\n\n\nGrande Cheese through regular audits, training, maintenance, testing and inspections programs has established a history of safe operation and that the community emergency action plans are current and in place. Also that training with community services has been done and is on going. This is to ensure that in the event of an accidental release the Grande Cheese trained personnel and the community emergency services can minimize the release and stop it with no impact to the employees or the community.\n\n"
    }
  ]
}