{
  "FacilityID": 1000077577,
  "FacilityName": "Center West Water Plant",
  "FacilityStr1": "3208 Center Street",
  "FacilityStr2": null,
  "FacilityCity": "Lake Charles",
  "FacilityState": "LA",
  "FacilityZipCode": "70601",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22019",
  "LEPC": "Calcasieu Parish LEPC",
  "FacilityLatDecDegs": "30.199215",
  "FacilityLongDecDegs": "-093.212317",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cityoflakecharles.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 49598741,
  "ParentCompanyName": "City of Lake Charles",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Lake Charles",
  "OperatorStr1": "PO Box 1727",
  "OperatorStr2": null,
  "OperatorCity": "Lake Charles",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70602",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000054674",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-01-25 00:00:00",
  "SafetyInspectionBy": "Southland Environmental, LLC",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.19898,
  "FRS_Long": -93.21205,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096594,
      "AltID": null,
      "FacilityID": 1000077577,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120944,
          "ProcessID": 1000096594,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000097838,
          "ProcessID": 1000096594,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000060455,
              "Process_NAICS_ID": 1000097838,
              "SafetyReviewDate": "2018-12-28 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "AWWA standards, NEMA standards, OSHA standards",
              "FR_Comments": null,
              "HazardReviewDate": "2016-09-26 00:00:00",
              "ChangeCompletionDate": "2017-01-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "We are presently investigating the addition of process area detestors tied into the existing SCADA system as well as the addition of perimeter cameras to increase security",
              "OpProceduresReviewDate": "2018-12-28 00:00:00",
              "TrainingReviewDate": "2018-12-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "monitoring employee performance and work in the field",
              "MaintenanceReviewDate": "2018-12-28 00:00:00",
              "EquipmentInspectionDate": "2019-04-04 00:00:00",
              "EquipmentTested": "Chlorine feed system scales, chlorinators, ejectors, feed lines, etc.",
              "ComplianceAuditDate": "2019-01-09 00:00:00",
              "AuditCompletionDate": "2019-01-09 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000061103,
                  "PreventionProgram2ID": 1000060455,
                  "ProcessChemicalID": 1000120944
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000077577,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lake Charles Fire Department",
    "CoordinatingAgencyPhone": "3374911360",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077577,
      "SummaryText": "1.  GENERAL EXECUTIVE SUMMARY\n\n\n\nCenter West Water Plant\n\nLDEQ Facility  ID Number - 27749\n\nEPA ID: 1000 0005 4674\n\n  \n\na)  Accidental Release Prevention and Emergency Response Policies\n\nThe City of Lake Charles Water Division is strongly committed to employee, public, and environmental safety.  We are aware that the use of some of our treatment chemicals could pose a risk to the public under certain circumstances.  We therefore are committed to development of a comprehensive risk management program for the Center West Water plant.  The program will address areas such as design, installation, operating procedures, maintenance, and employee training  associated with the chlorine processes at our facilities.  Safety depends upon the manner in which we handle and operate the regulated process.  The use of chlorine has been standard in the water treatment industry for many years and the safety of its use has improved greatly throughout that time.  The inherent safety of the vacuum operated chlorination system, combined with safe handling procedures make the use of chlorine a reliable process.  In-depth and ongoing training programs for our personnel will make the use of chlorine even safer for our employees and the members of the surrounding community.   It is our policy to implement appropriate controls to prevent possible releases of any regulated substance.  \n\n\n\nIf such a release does occur, we have met with and coordinated our release planning with the City of Lake Charles Fire Department,  which provides highly trained emergency response personnel to control and mitigate the effects of a release.  The procedures developed under this plan have also been included in the local community response plan as required under the rule.  Plant personnel have been trained on how and when to notify emergency responders if the need arises.\n\n\n\nb)  The Stationary Source and the Regulated Substance Handled\n\nThe Center West Water Plant is a municipal water treatment facility.  The fa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077577,
      "SummaryText": "cility's primary purpose is the treatment and disinfection of potable water for drinking and other uses.  We have one regulated substance at the facility.  The plant is unmanned and is monitored and operated via a SCADA system by the operator on duty 24 hours at the GH West Plant.  Chlorine gas is used in the treatment process as an oxidizer of dissolved iron in the water and as the primary disinfectant to inhibit microbial growth.  Chlorine ton containers are delivered to the facility on regular basis and off loaded and stored for use.  There are normally two ton containers connected to chlorinators for use as needed.  Only one chlorinator and cylinder is in use at the same time.  The maximum amount of chlorine stored at this plant is 4,000 pounds or two ton containers.  Only authorized and trained personnel perform maintenance on or operate the regulated process.\n\n\n\nc)  The Worst Case Scenario and the Alternative Release Scenario\n\n\n\nTo perform the required offsite consequence analysis for the Center West Plant we used the modeling plan furnished by the EPA, RMP Comp. version 1.07.  The following paragraphs provide details of the chosen scenarios.\n\n\n\nThe worst case scenario involves a catastrophic release of chlorine gas from the Center West facility.  The entire contents of a ton container (2000 pounds) is released in gaseous form over a period of 10 minutes.  This scenario assumes an atmosperic stability Class F, and a wind speed of 1.5 meters/second (3.4 miles/hour).  A maximum distance with a radius of 1.3 miles is obtained, corresponding to a toxic endpoint of .0087 mg/L.\n\n\n\nAn alternate case scenario was developed using the same model as above.  The alternative release scenario was based on a release which occurs from the failure of the 5/16 inch valve opening located on the top of the ton container.  400 pounds of gaseous chlorine escapes over a period of forty minutes.  The alternative release scenario assumes an Atmospheric Stability Class D, wind speed of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077577,
      "SummaryText": " 3.0 meters/second (6.7 miles/hour), relative humidity of 50%, and a temperature of 77 degrees F.  Under these conditions, a maximum distance with a 0.1 mile radius is obtained, corresponding to a toxic endpoint of .0087 mg/L.\n\n\n\n\n\nc) The General Accidental Release Prevention Program and the Chemical Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  The facility was designed and built in 1956 in accordance with all applicable standards in place at that time.  The facility is regulated under the Comprehensive Emergency Response, Compensation, and Liability Act (CERCLA) section 103(a).  The facility is also subject to the reporting requirements of the Emergency Planning and Community Right-to-Know Act (EPCRA)  Section 302. We file Tier Two forms for chlorine as well as other treatment chemicals.  The following sections briefly describe the elements of the release prevention program that is in place at the stationary source.\n\n\n\nProcess Safety Information - The City of Lake Charles Water Division maintains a detailed record of safety information that describes the chemical and physical hazards of chlorine.  We also compiled and developed operating parameters and equipment design information associated with all aspects of the process.  \n\n\n\nProcess Hazard Review - Our facility conducts studies to ensure that the hazards associated with our chlorine process are identified and any deficiencies corrected.  We use a checklist developed for our chlorine system designed to be site specific.  The hazard reviews are performed by qualified personnel knowledgeable in design and safety practices.  The review of hazards are designed to be updated every five years or upon changes to the process.  Deficiencies in the initial hazard determination were expected to be addressed in a timely manner.  Additional hazard reviews will be performed and deficiencies foun"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077577,
      "SummaryText": "d corrected. \n\n\n\nOperating Procedures - For the purpose of safely conducting activities within our covered processes, The City of Lake Charles Water Division develops and maintains operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, and normal shutdown.  Procedures are in place and are being implemented for the above.  Initial training was given to all personnel on these procedures.  The procedures will be reviewed and updated on an ongoing basis.\n\n\n\nTraining - The City of Lake Charles Water Division plans to implement a comprehensive training program for our employees to ensure that those persons who are operating the chlorine process are competent .  We have developed training information that cover items such as unloading of ton containers, storage of ton containers, installing the chlorinators on a container, general parts used in the chlorination system, general operation of the chlorination system, troubleshooting of chlorine feed problems, maintenance of chlorine system,  hazards associated with the chlorine process, and reporting requirements in case of a release.  We have certified that our personnel are competent to operate the chlorine processes.  The full range of training was initially completed by January 1, 2000.  Refresher training will be given at a minimum of every three years, but we hope to provide various types of additional training more frequently.  \n\n\n\nMechanical Integrity (maintenance) - The City of Lake Charles Water Division has developed  equipment and process lists to document and give suggested repair and replacement information on its chlorination equipment.  These steps are taken to improve process reliability and safety.  We plan to perform indepth nspections of the chlorine feed systems on a yearly basis to determine if any changes need to be made to our maintenance procedures and information.  Bi monthl"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000077577,
      "SummaryText": "y inspections of all chemical feed systems are also made to check for leaks, unsafe items, or other hazards.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  These personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.  Manufacturers' manuals on all equipment are kept on file for review as needed.\n\n\n\nCompliance Audits - The City of Lake Charles Water Division performed a compliance audit during the initial phase of the RMP program.  The initial audit determined deficiencies we had in the program and set out time frames for completion of deficient items.  These were addressed as needed.  Future audits will be performed at a minimum of every three years to document and confirm whether the provisions set out under the RMP rule are being implemented on a continuing basis.\n\n\n\nIncident Investigations - The City of Lake Charles Water Division will promptly investigate any known incident that has resulted in, or could reasonably result in a release of a regulated substance.  These investigations will be undertaken to determine the situation that led to the incident, as well as any corrective actions to prevent the release from reoccurring.  All reports will be retained for a minimum of five years.\n\n\n\nEmployee Participation - The City of Lake Charles strongly believes that process safety and accident prevention is a team effort.  Company employees are encouraged to express their views concerning accident prevention issues and to recommend improvements.  Our employees have access to all information created as part of this facility's  implementation of the RMP rule.\n\n\n\nContractors - Contractors on occasion perform specialized maintenance or construction on regulated processes and/or equipment.  We ensure that they will follow all procedures regarding repairs to the process equipment.  All contractors are give"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000077577,
      "SummaryText": "n information pertaining to the known hazards of chlorine and how to recognize our labeling and information systems.\n\n\n\nd) The Five Year Accident History\n\nThe Center West Water plant has had an excellent record of preventing accidental releases of chlorine over the last five years.  Due to safety and release prevention policies, there has been no accidental release during this period.\n\n\n\ne) Emergency Response Program\n\nSince The City of Lake Charles Fire Department will be the first responders to any regulated release of chlorine,  we have coordinated our emergency response program through their office.  We have met with officials from the Fire Department to provide complete information on locations and inventories of chlorine at the Center West Water Plant and all other facilities.  Fire Dept. personnel are highly trained in emergency response and mitigating the effects of a release.  We have provided training for their personnel at our facilities to give them hands on training in the use of the ton container repair kits.  We have also supplied them with a ton repair kit for their storage and use.  We will determine appropriate procedures for notification of affected areas in case of a release as well as proper notification of state and local agencies as required.  The stationary source will be included in the community emergency response plan as required.  We will provide all information developed for emergency response to the Calcasieu Parish Emergency Planning Committee.  Our personnel will be trained to assist the Fire Department personnel as needed and requested.\n\n\n\nf) Planned Changes to Improve Safety\n\nWe plan to continue with our training programs which provide information for our operators and maintenance personnel on the risks, hazards, and use of the chlorine process at our water treatment plants.  After any training,  some form of  competency testing or interviews will be used to document and confirm that personnel have gained sufficient knowledge to oper"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000077577,
      "SummaryText": "ate the process in a safe and efficient manner.  We would also like to plan some sort of tabletop exercise or even an emergency drill,  which could provide information on emergency response items.   We plan to improve the safety of the chlorine sites by providing additional chlorine leak detection systems tied into our SCADA system at the GH West Water Plant which is manned continuously.  We also plan to install perimeter monitoring cameras to increase security at the site.  Additional operational procedures concerning the use of chlorine at the remote plants will be initiated in the future.  With the events of 9/11/2001 there has also been a heightened sense of security for all our water treatment facilities.  Acts of terrorism could threaten our covered process, and lead to a release.  Security measures are being reviewed, and improvements are planned for implementation.  These and other changes should improve the reliability and safety of the chlorine systems."
    }
  ]
}