{
  "FacilityID": 1000105624,
  "FacilityName": "NuGen Energy, LLC",
  "FacilityStr1": "27283 447th Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Marion",
  "FacilityState": "SD",
  "FacilityZipCode": "57043",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46125",
  "LEPC": "Turner County LEPC",
  "FacilityLatDecDegs": "43.434757",
  "FacilityLongDecDegs": "-097.272278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 930739987,
  "ParentCompanyName": "NuGen Energy, LLC",
  "Company2Name": "Rex American Resources, Inc.",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Robert Bauerle",
  "OperatorStr1": "27283 447th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Marion",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57043",
  "OperatorZipCodeExt": null,
  "FTE": 56,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000201453",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "28.0502-61",
  "SafetyInspectionDate": "2023-04-05 00:00:00",
  "SafetyInspectionBy": "ERI - Insurance Broker",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-08-22 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-08-22 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-08-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 43.434634,
  "FRS_Long": -97.273198,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000131894,
      "AltID": "Denaturant Storage",
      "FacilityID": 1000105624,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000165300,
          "ProcessID": 1000131894,
          "ChemicalID": 155,
          "Quantity": 1200000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000147710,
              "ProcessChemicalID": 1000165300,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000147711,
              "ProcessChemicalID": 1000165300,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000147712,
              "ProcessChemicalID": 1000165300,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000147713,
              "ProcessChemicalID": 1000165300,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000133326,
          "ProcessID": 1000131894,
          "NAICSCode": "325193",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000113639,
              "Process_NAICS_ID": 1000133326,
              "SafetyReviewDate": "2023-03-30 00:00:00",
              "PHA_Date": "2023-02-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-02-21 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-03-30 00:00:00",
              "TrainingReviewDate": "2023-03-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-03-30 00:00:00",
              "EquipmentInspectionDate": "2023-06-09 00:00:00",
              "EquipmentTested": "Ethanol system",
              "ChangeMgmtDate": "2023-06-05 00:00:00",
              "ChangeMgmtReviewDate": "2023-06-05 00:00:00",
              "PreStartupReviewDate": "2023-06-06 00:00:00",
              "ComplianceAuditDate": "2023-06-05 00:00:00",
              "AuditCompletionDate": "2023-06-14 00:00:00",
              "IncidentInvestigationDate": "2023-05-07 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-03-30 00:00:00",
              "HotWorkPermitReviewDate": "2023-03-30 00:00:00",
              "ContractorSafetyReviewDate": "2023-05-01 00:00:00",
              "ContractorSafetyEvalDate": "2023-03-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000142605,
                  "PreventionProgram3ID": 1000113639,
                  "ProcessChemicalID": 1000165300
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000105624,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-03-27 00:00:00",
    "ERTrainingDate": "2022-11-01 00:00:00",
    "CoordinatingAgencyName": "Marion Fire Department",
    "CoordinatingAgencyPhone": "6056482937",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000105624,
      "SummaryText": "espond to small spills onsite\n\n4.\t  Accident History\n\nThe facility has not had any RMP-reportable accidents within the past five years.\n\n5.\tEmergency Response Program\n\nAs discussed, NuGen maintains a written ICP and ERAP at the facility. The purpose of these documents is to protect workers and public safety, and the environment. These documents address aspects of emergency response, step-by-step emergency assessments, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident requirements. In addition, NuGen has procedures that address the maintenance, inspection, and testing of emergency response equipment and instructions that address the use of emergency response equipment. Employees receive training in these procedures according to their role at the site so they are prepared and capable of responding to incipient-level fires or spill incidents. NuGen works with the local fire department and emergency responders to ensure the proper execution of the site plans. The emergency response program will be updated when necessary based on modifications made to facility processes.\n\n6.\tPlanned Changes to Improve Safety\n\nNuGen has been designed and constructed to meet existing construction and process safety requirements. NuGen reviews safety practices and equipment, and maintenance programs are monitored on an ongoing basis."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000105624,
      "SummaryText": "nt a similar release in the future. Corrective actions are tracked until they are completed. Incident investigation reports are retained for at least five years.\n\nCompliance Audits\n\nNuGen regularly conducts audits of the provisions of RMP and PSM to verify that procedures and practices developed under the standard are adequate and are being followed. A compliance audit of each program is conducted every three years. The audits include but are not limited to a review of documentation and process safety information, an inspection of the physical facilities, and interviews with all levels of plant personnel. The audit team develops findings that are included in an audit report and forwarded to facility management for resolution. Findings and corrective actions taken in response to each finding are tracked until completion.\n\nChemical-Specific Prevention Steps\n\nThe processes at NuGen include hazards that must be managed to ensure continued safe operation. The RMP Program elements that were previously summarized apply to the denaturant processes. Collectively, these program activities help prevent potential accident scenarios that equipment failures and human errors could cause. In addition to RMP, the facility has instrumentation and equipment to detect, contain, and reduce the consequences of a release, including:\n\nRelease Detection \n\n-\tMonitoring equipment to detect flow and tank liquid level changes\n-\tVideo cameras are used to monitor the facility, including the storage tank area\n-\tFacility personnel conduct routine rounds through storage tank areas\n\n Release Containment/Control \n\n-\tAtmospheric relief devices\n-\tCheck valves to prevent the backflow of liquid\n-\tSafety interlocks\n-\tGrounding equipment to prevent electric discharges through the tank\n\n Release Mitigation \n\n-\tSecondary containment to contain liquid releases\n-\tFire suppression and extinguishing systems\n-\tTrained emergency response personnel\n-\tEmergency response equipment located onsite\n-\tFacility personnel r"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000105624,
      "SummaryText": "by requiring verification that accident prevention measures are properly implemented.\n\nSafe Work Practices\n\nNuGen has safe work practices in place to ensure worker and process safety. These safety standards control entry into work areas and confined spaces, specify procedures for isolating energy sources by lockout/tag-out, and describe the permitting process for completing work at NuGen. Safety standards and work procedures are reviewed annually. \n\nHot Work Permit\n\nNuGen has a hot work permit program that details areas that require a permit and those areas for which a permit is not required. A hot work permit is required in process areas for cutting, welding, spark-producing equipment, etc., except in designated areas. The procedure includes accountability and responsibility for authorizing and issuing the hot work permit, display of the permit at the site of the hot work until the work is completed, site inspection, designation of appropriate precautions to be taken with the hot work, and assignment of a fire watch where appropriate.\n\nManagement of Change\n\nNuGen's MOC program reviews proposed changes to process chemicals, technology, equipment, procedures, materials, and design conditions before implementation of the change. An interdisciplinary team reviews changes to ensure adequate controls are in place to manage new hazards and verify that a process change has not compromised existing controls. \n\nIncident Investigation\n\nNuGen has procedures to promptly investigate any incident that has resulted in or could reasonably result in, a release of a regulated substance, fire/explosion, major property damage, environmental damage, or personal injury. The procedure establishes the minimum guidelines and activities of the incident investigation program to reduce the likelihood of repetitive events that could reasonably lead to catastrophic releases. A team will undertake investigations to identify the situation leading to the incident and any corrective actions to preve"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000105624,
      "SummaryText": "rocess Safety Information\n\nNuGen utilizes the Hazard and Operability Study (HAZOP) PHA methodology. The PHA identified the following potential major hazards: fire, explosion, contamination, and tornados. NuGen utilizes process controls such as relief valves, check valves, interlocks, and grounding equipment to prevent or limit releases. NuGen also utilizes dike containment around the site’s storage tanks, including the denaturant storage tank, to contain and mitigate liquid releases.\nNuGen keeps various technical documents onsite to help maintain the safe operation of the production process and provide information about the design and construction of process equipment. This information includes materials of construction, design pressure, and temperature ratings, electrical rating of equipment, and piping & instrument drawings.\n\nOperating Procedures and Training\n\nNuGen is responsible for developing and implementing written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the RMP. The operating procedures were developed as a guide for those involved with an initial start-up, normal operation, normal shutdown, and emergency shutdown of the process. NuGen developed and implemented a comprehensive training program for employees involved in facility operations. \n\nPre-Startup Safety Reviews\n\nAs part of the management of change (MOC) process, whenever a modification to the existing process is planned, either temporary or permanent, NuGen requires a Pre-Startup Safety Review (PSSR). The PSSR confirms that, before putting into service, the construction and equipment being used are in accordance with design specifications. The PSSR also confirms that the safety, operating, maintenance, and emergency procedures are in place and that adequate training for each involved employee has been completed. A PSSR includes field verification of the construction and serves as a quality assurance function"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000105624,
      "SummaryText": "ocal emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements. In addition, NuGen has procedures that address the maintenance, inspection, and testing of emergency response equipment and instructions on using emergency response equipment. Employees receive training on performing their specific emergency response duties. When necessary, the emergency response program is updated based on modifications made to NuGen processes or emergency response procedures.\n\n2.\tFacility Description and Regulated Substances Handled\n\nNuGen is a corn-based denatured ethanol fuel production plant that operates 24 hours a day, seven days a week. Ethanol is produced by converting corn starch to sugars and then converting the sugars to ethanol (i.e., grain alcohol) through a batch fermentation and continuous distillation process.\n\nThe RMP-regulated material stored at NuGen is natural gasoline which is used as a denaturant in the ethanol fuel product.\n\n3.\tAccidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nNuGen has programs in place to address accidental release prevention measures required by EPA, Process Safety Management (PSM) requirements from the Occupational Safety and Health Administration (OSHA), and notification requirements of EPA's Emergency Response and Community Right-to-Know (EPCRA) regulations. NuGen complies with the RMP for managing regulated substances on site, such as denaturant (natural gasoline).\n\nEmployee Participation\n\nNuGen encourages employees to participate in safety management and accident prevention. NuGen has developed an employee participation program as part of the RMP program. Process safety information, process hazard analysis (PHA) results, recommendations, action items, incident investigations, compliance audits, operating procedures, emergency response plans, and records of change management are available to the operational personnel.\n\nProcess Hazard Analysis and P"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000105624,
      "SummaryText": "RMP Executive Summary\n \nThis Executive Summary briefly reviews the major elements of the Risk Management Plan (RMP) for the NuGen Energy, LLC (NuGen) ethanol production facility located near Marion, Turner County, South Dakota, which began operation in 2008. This summary is presented in response to the requirements of the United States Environmental Protection Agency (EPA) under Title 40 of the Code of Federal Regulations, Part 68 (40 CFR 68) and Section 112(r) of the Clean Air Act. NuGen is subject to the RMP rule due to the onsite storage of natural gasoline (denaturant), a regulated flammable mixture, above the threshold quantity. \n\n1.\tAccidental Release Prevention and Emergency Response Policies \n\nNuGen is committed to protecting the environment and operating the facility in a manner that promotes the safety of employees and the general public. Management has adopted and implemented policies that adhere to applicable federal and state rules and regulations. As such, the design and construction of NuGen have incorporated physical and operational safeguards to prevent accidental releases. Through the proper design, installation, operation, and maintenance of the equipment and personnel training, NuGen has minimized the hazard to human health and the environment from fires, explosions, or any unplanned sudden or non-sudden release of hazardous materials.\n\nIn the event of a release, NuGen's emergency response is described in its Emergency Response Action Plan (ERAP) and Integrated Contingency Plan (ICP), which consists of a Facility Response Plan (FRP) and Spill Prevention Control and Countermeasures (SPCC) Plan. The ICP and ERAP consist of procedures for responding to releases, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address emergency response (including proper first-aid and medical treatment for exposures), evacuation plans and accounting for personnel after an evacuation, notification of l"
    }
  ]
}