{
  "FacilityID": 1000003418,
  "FacilityName": "Wastewater Treatment Plant",
  "FacilityStr1": "1425 S. Alturas St",
  "FacilityStr2": null,
  "FacilityCity": "Fallbrook",
  "FacilityState": "CA",
  "FacilityZipCode": "92028",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "No County Fire Protection Dist",
  "FacilityLatDecDegs": "33.220200",
  "FacilityLongDecDegs": "-117.153700",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fpud.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Fallbrook Public Utility District",
  "Company2Name": null,
  "CompanyDUNS": 73384828,
  "Company2DUNS": null,
  "OperatorName": "Fallbrook Public Utility District",
  "OperatorStr1": "990 E. Mission Road",
  "OperatorStr2": "PO Box 2290",
  "OperatorCity": "Fallbrook",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92088",
  "OperatorZipCodeExt": "2290",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000123323",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-04-22 00:00:00",
  "SafetyInspectionBy": "CUPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.234,
  "FRS_Long": -117.1116,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000004223,
      "AltID": null,
      "FacilityID": 1000003418,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000004667,
          "ProcessID": 1000004223,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000004389,
          "ProcessID": 1000004223,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000002922,
              "Process_NAICS_ID": 1000004389,
              "SafetyReviewDate": "2009-05-26 00:00:00",
              "PHA_Date": "2009-05-28 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2009-05-26 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-05-26 00:00:00",
              "TrainingReviewDate": "2009-05-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Hands on emergency response drill",
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-05-26 00:00:00",
              "EquipmentInspectionDate": "2009-05-26 00:00:00",
              "EquipmentTested": "one ton chlorine cylinder connections",
              "ChangeMgmtDate": "2004-06-09 00:00:00",
              "ChangeMgmtReviewDate": "2009-05-26 00:00:00",
              "PreStartupReviewDate": "2004-06-09 00:00:00",
              "ComplianceAuditDate": "2009-05-26 00:00:00",
              "AuditCompletionDate": "2009-05-28 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-05-26 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-26 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-26 00:00:00",
              "ContractorSafetyEvalDate": "2009-05-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000003425,
                  "PreventionProgram3ID": 1000002922,
                  "ProcessChemicalID": 1000004667
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000003418,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-05-26 00:00:00",
    "ERTrainingDate": "2009-05-13 00:00:00",
    "CoordinatingAgencyName": "No County Fire Protection District",
    "CoordinatingAgencyPhone": "7607232005",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "California Code of Regulations"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000003418,
      "SummaryText": "This risk management plan addresses the risk management program for Fallbrook Public Utility District Wastewater Treatment Plant 1 Station. This plan applies to the process conducted to store chlorine gas cylinders and to chlorinate recycled water from sewage treatment within the district. Section 112(r) of the Clean Air Act and 1990 Amendments requires a risk management plan and program be developed for regulated substances used above certain thresholds within a process that could lead to an accidental release. The U. S. Environmental Protection Agency (EPA) implements the Federal Clean Air Act by Title 40, Code of Federal Regulations (CFR), Part 68. In turn Title 19 of the California Code of Regulations on Public Safety implements the Federal requirements with certain additions specific to the state. The EPA has delegated its authority to the state and local regulatory agencies. As such, the State of California has established threshold levels that are lower (morestringent) than the Federal thresholds. Fallbrook Public Utility District's Wastewater Treatment Plant 1 Station inventory of chlorine gas [Chemical Abstracts Service (CAS) number 7782-50-5] cylinders is above the Federal and State regulatory threshold. \n\nThis plan is prepared in compliance with the San Diego County Department of Environmental Health, Hazardous Materials Division, California Accidental Release Prevention Program (CalARP) Guidelines (revised March 22, 2004). This plan shall be reviewed annually and updated at least every 5 years. This plan is intended to describe the responsibilities and activities necessary to respond to an accidental release of chlorine gas to personnel, the public, and the environment. This plan is made available to the public and the local emergency responders (e. g.. North County Fire Protection District, and California Division of Forestry). The Standard Industrial Classification (SIC) Code for this district is 4941 (water supply), and the North American Industrial"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000003418,
      "SummaryText": "Classification System (NAICS) Code is 221310 (water and wastewater treatment). \n\nFallbrook Public Utility District has established a chlorine-handling procedure, emergency plan, and training program that ensures the safety of personnel, the public, and the environment. This plan addresses emergency response and accident prevention. The chlorine handling procedure covers the safety aspects of changing chlorine cylinders and storage. The hazardous material training programs consist of hazard identification, proper handling of chlorine cylinders, safety precautions, use of Material Safety Data Sheets (MSDS), daily visual inspections, work orders, and corrective maintenance services. The program also provides for training as first responders and hazardous material (HAZMAT) technician-level mitigation specialists. The program implements the elements of the California Occupational Safety and Health Administration (OSHA) Process Safety Management standards. A process hazard evaluation has been performed and will be updated at least once every five years or whenever there is a new hazard 01 risk created by changes at the Wastewater Treatment Plant 1 Station. \n\nThe Fallbrook Public Utility District was established as a political subdivision of the State of California in 1922 and operates under the provisions of the Public Utility District Act, Division 7, of the Public Utility Code as adopted in 1953. The public utility district was needed for the prime purpose of supplying water to the town of Fallbrook and the surrounding residential and agricultural areas. \n\nThe Fallbrook Public Utility District encompasses approximately 27,963 acres (43.7 square miles) that includes district-owned watershed lands. Wastewater Treatment Plant 1 is located near Fallbrook Creek and has an estimated population of 30,000 residents. The District serves approximately 9,066 water connections on a regular basis. In November 1994, the citizens of the Fallbrook Sanitary District voted to dissolve t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000003418,
      "SummaryText": "d temporarily at the site and picked up by the offsite chemical supplier in exchange for new full cylinders. Personnel mark the used-cylinders empty or partial in the storage area in order to distinguish them from the full or new cylinders that are used on-line. Administrative controls are in place to ensure safe storage and handling. No more than eight (8) full one-ton cylinders are stored onsite at the Wastewater Treatment Plant 1 Station. The chlorine gas cylinders are stored on a concrete pad that is enclosed by a concrete-block building. Usage rates vary from one month to several months, up to one year for each station. An emergency chlorine wet scrubbing system is installed that minimizes the release of chlorine gas to the environment. The system consists of an ejector-venturi scrubber, caustic storage tank, and mist eliminator pad that effectively remove chlorine gas and odors through absorption and chemical reaction between the gas and scrubbing liquid.\n\n An offsite-consequence analysis, using the worst-case scenario for an accidental release of chlorine gas is provided in Section 4 of this plan. The worst-case scenario consists of failure of a full one-ton chlorine gas cylinder, releasing chlorine gas at ground level over a ten (10) minute period. The distance to the toxic endpoint of 0.0087 milligrams per liter is 3 miles for the one-ton cylinder. This release is based on worst-case weather conditions, outdoor operations, and is the distance at which chlorine gas no longer poses a hazard to the public. The worst-case release scenario is modeled using the methodology identified in the U. S. Environmental Protection Agency (EPA), Risk Management Program Guidance For Wastewater Treatment Plants, EPA 550-B-98-010. The chlorine gas cylinders are designed to withstand a 45 miles per hour (mph) impact. The worst-case release scenario does not account for the mitigation measures that are in place. The chlorine injection system is an enclosed vacuum system th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000003418,
      "SummaryText": "at is pressurized with automatic shutdown should a release occur. An emergency scrubber system that is 99% efficient in removing an accidental release of chlorine is installed. The toxic endpoint distance is reduced from 3 miles to an endpoint that is located onsite. An alternate scenario that is more likely to occur than the worst-case release scenario is provided in this section. The alternate scenario that more likely could occur based on operations and literature search, loading and off-loading procedures, and process knowledge is a small leak through a valve located in the center of one end of a chlorine cylinder. The highest risk operation at the facility is the changing of chlorine cylinders. This operation is done during daytime hours. The cylinder contains 1 ton of chlorine when it begins to leak. The toxic endpoint is reduced by the mitigation measures in place, as described above. The alternate release scenario is modeled using the EPA area! location and air dispersion models ALOHA and T-SCREENÂ® (Version 3.0, Britter- McQuaid model, 1992). The distance to the toxic endpoint is 3 miles for the one-ton cylinder without mitigation measures in place. With the mitigation measures, such as the emergency scrubber system and automatic shutdown system, the toxic endpoint is. reduced to onsite. For the ALOHA model, the date and time of the accident scenario are assumed to be the day and time the model was run. Local, typical meteorological conditions were obtained from the National Weather Service Office in San Diego. The toxic endpoint is the highest concentration downwind of 10 parts per million, which is the value that is immediately dangerous to public health. The toxic endpoint for the model run is approximately 1,000 yards (<1 mile). The prevailing wind direction is generally north-northeast. Under the worst-case scenario, there are numerous schools, day-care facilities, and health care facilities located within a 3-mile radius of the station. However, all o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000003418,
      "SummaryText": "hat district and have Fallbrook Public Utility District become the provider of sewer services in Fallbrook. Therefore, the District provides both water and sewer services. The District serves approximately 3,538 sewer connections. \n\nThe District's boundaries are adjoined by the Rainbow Municipal Water District, the Camp Pendleton Military Reservation, Riverside County, and the U. S. Naval Weapons Station at Fallbrook. Live Oak County Park is approximately 1 mile from the District's boundary. The area is unique in many ways due to its varying elevations and high rate of irrigation. Average rainfall per year is approximately twenty (20) inches. \n\nThe District is governed by a five (5) member board of directors. Regular meetings of the board of directors are held monthly. Registered voters of the District elect the directors to office for a term of four (4) years. The District utilizes outside consultants on a continuous, as needed basis for operational and environmental concerns. \n\nThe District headquarters is located on 990 East Mission Road. The District has one chlorine injection site. Full one-ton (2,000 pound capacity) chlorine gas cylinders are routinely delivered to the chlorine injection site by an offsite chemical supplier. The chlorine injection site is located at the Wastewater Treatment Plant 1 at 1425 S. Alturas Road, Fallbrook, CA  92028, and has one-ton chlorine gas cylinders that exceed the EPA threshold quantity. The Wastewater Treatment Plant 1 has four (4) one-ton cylinders on-line and four (4) one-ton cylinders stored on-site. This is the Risk Management Plan prepared to address this site, as agreed upon by the San Diego County Department of Environmental Health, Hazardous Materials Division.  The Wastewater Treatment Plant 1 Station layout is located in the Emergency Response Plan Section. \n\nWhen the cylinders are empty. District personnel pick up the cylinders and replace the empty ones with full ones stored on-site. The empty cylinders are store"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000003418,
      "SummaryText": "f these facilities are located upwind of the site and normally would not be impacted by a chlorine release. The only facility that is located downwind is Fallbrook Union High School. It is located approximately 2.5 miles from the Plant 1 station. The ALOHA model run indicates that the high school is beyond the dose concentration of concern (10 ppm). Therefore, if a release did occur, the high school would not be significantly impacted. \n\nAdministrative controls and procedures are in place to quickly identify problems associated with leaking cylinders. Leaking cylinders are repaired in a timely manner in order to minimize releases. Proper chlorine gas handling procedures are in place to ensure safe handling, loading and off-loading by operations personnel. A chlorine emergency repair kit is used to contain any valve leaks detected during normal operations. Visual and audible chlorine alarm/detection systems are installed at the site and are connected to a telemetry system for standby personnel. Employee training and HAZMAT personal protective equipment are available and are used to safely repair this kind of problem. Work orders are prepared by personnel to ensure that safety equipment maintenance and repair are properly completed in a timely manner. An offsite contractor conducts annual inspections and repair services of the Fallbrook Public Utility District facilities. An effective training program for employees and participation in simulated exercises or drills ensures management's commitment to general release prevention. \n\nThere have been no accidents or anyone offsite injured as a result of a chlorine gas release within the past five (5) years of operation. No hot work involving electric or gas welding, cutting, brazing, or similar flame/spark-producing operation is performed on the chlorine gas cylinders. Hot work permit procedures are in place for contract work that involved welding, cutting, and brazing in the vicinity of the chlorine cylinders. Additional"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000003418,
      "SummaryText": "training on the Fallbrook Public Utility District's risk management program is planned to improve the safety awareness of personnel. Future efforts will be made to communicate the process, and the risks associated with the process, to appropriate public sectors. Additional safety features (e. g., emergency scrubber system, detection and alarm system, and personnel protection) were installed prior to the process hazard analysis performed on June 2, 1999. No additional safety measures will be added to the process. However, safety posts are scheduled to be installed in 2009 near certain exterior process lines to prevent vehicle collision. Procedures for quality assurance regarding chlorine handling at the Wastewater Treatment Plant 1 Station and specific training on process safety management have been established."
    }
  ]
}