{
  "FacilityID": 1000083304,
  "FacilityName": "Western New York Energy, LLC",
  "FacilityStr1": "4141 Bates Road",
  "FacilityStr2": null,
  "FacilityCity": "Medina",
  "FacilityState": "NY",
  "FacilityZipCode": "14103",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36073",
  "LEPC": "Orleans County LEPC",
  "FacilityLatDecDegs": "43.210491",
  "FacilityLongDecDegs": "-78.365416",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.wnyenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 624683475,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Western New York Energy, LLC",
  "OperatorStr1": "4141 Bates Road",
  "OperatorStr2": null,
  "OperatorCity": "Medina",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "14103",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jon Winters",
  "RMPTitle": "Health & Safety Manager",
  "FTE": 43,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200926",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-28 00:00:00",
  "SafetyInspectionBy": "ERI Solutions, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-11-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-11-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-11-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-11-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000104133,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000083304,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000105467,
          "ProcessID": 1000104133,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000130403,
          "ProcessID": 1000104133,
          "ChemicalID": 56,
          "Quantity": 97000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000630403,
          "ProcessID": 1000104133,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083304,
      "SummaryText": "RMP Executive Summary\n\nWestern New York Energy, LLC\n\n\n\nThis RMP resubmission is being submitted to satisfy the 5-year update (40 CFR 68.190(b)(1)).\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nWestern New York Energy, LLC (WNYE) has an ongoing commitment to the health and safety of the onsite employees and the surrounding community.  This commitment is demonstrated in the resources invested in accident prevention, such as personnel training for the proper operation and maintenance of plant equipment and preventative maintenance programs.\n\n\n\nWNYE has emergency response policies in place that are addressed in the facility's Health and Safety Plan; Industrial Storm Water Pollution Prevention Plan; Spill Prevention, Controls, and Countermeasures Plan; Facility Response Plan; and Emergency Action Plan. Most of the listed Plans require a minimum of annual training in order to keep employees educated on emergency response procedures in place at the facility. All new employees are required to undergo training on emergency response procedures prior to initiating responsibilities onsite.\n\n\n\nWNYE's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, plant personnel will respond to contain the release as necessary.\n\n\n\nDESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nWNYE is located in Medina, Orleans County, New York.  The facility operates 24 hours per day, seven (7) days per week for the purpose of manufacturing fuel grade ethanol from the natural fermentation of corn.  The regulated substance stored at the facility is anhydrous ammonia.\n\n\n\nWORST CASE AND ALTERNATE CASE SCENARIOS\n\nWorst Case Scenario:\n\nAnhydrous Ammonia:  Anhydrous ammonia is stored as a gas liquefied by pressure in an above-ground steel tank.  The worst case scenario used is a release of the entire contents of the storage vessel, creating a toxic vapor cloud.  A determination spreadsheet "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083304,
      "SummaryText": "is included as part of RMP documentation file at the facility, detailing the conversion from gallons to pounds of ammonia.  RMP Comp was used to determine the worst case distance to endpoint, the model results are also provided as part of the RMP documentation file located at the facility.  The ammonia tank sits on a concrete pad, passive mitigation was not included as part of this scenario.  The facility can elect to place a fence around the ammonia tank for security purposes; the typical chain link fence used to enclose the ammonia tank would not prevent migration of a release.  Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals, etc.) was obtained using Google Earth.  The Iroquois National Wildlife Refuge, Oak Orchard Creek, Glenwood Lake, Erie Canal, Jeddo Creek, and Fish Creek are within the worst case distance to endpoint for ammonia.  \n\n\n\nAlternate Scenario:\n\nAnhydrous Ammonia:  The alternate scenario used for anhydrous ammonia is a release due to a rupture disk/relief valve failure from the ammonia piping system.  This scenario is considered the most likely cause of an ammonia release onsite.  The alternate release duration assumed is 30 minutes with an atmospheric stability of D and wind speed of 3.0m/sec.  The facility control room is manned 24 hours/day and would be alerted of the relief valve failure at the ammonia tank within minutes.  The emergency shutdown system installed at the facility has been considered in this scenario as active mitigation.  RMP Comp was used to determine the alternate distance to endpoint, the model results are provided as part of RMP documentation file at the facility.  Population data was obtained using Circular Area Profiling Software (CAPS) which incorporates 2010 U.S. Census Data. Public receptor information (i.e. schools, hospitals, etc.) was obtained using Google Earth.  No environmental receptors are af"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083304,
      "SummaryText": "fected by an alternate release of anhydrous ammonia.  \n\n\n\nAnhydrous ammonia qualifies as a Program 3 substance.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nGeneral accidental release prevention programs in place at the WNYE facility are described in earlier portions of this Executive Summary and in the Industrial SWPPP, and SPCC/FRP plans onsite. WNYE's Maintenance Department performs regular preventative maintenance inspections, as required by the manufactures recommendations and/or State and Federal regulations. Written weekly and monthly visual inspections are performed and the reports are on file in the Training Center. Quarterly LDAR monitoring is performed by the Plant Engineer and reports filed per State regulations.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nWork-related injuries have occurred at WNYE since plant start-up; none of the injuries reported required OSHA or other agency notification and were not associated with the RMP-covered processes. \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nWNYE has several safety programs in place at the facility that incorporate emergency response, including the Health and Safety Plan and Facility Response Plan.  WNYE also has an Emergency Action Plan that details evacuation and response procedures for spills and releases, fire, etc.  The Plans listed in this section have been prepared in accordance with applicable regulations, as necessary.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nWNYE provides safety training to its employees and contractors on an annual basis.  Any changes to improve safety will be implemented immediately upon discovery of needed changes.\n\n"
    }
  ]
}