{
  "FacilityID": 1000095168,
  "FacilityName": "Pinnacle Polymers, LLC",
  "FacilityStr1": "One Pinnacle Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Garyville",
  "FacilityState": "LA",
  "FacilityZipCode": "70051",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22095",
  "LEPC": "St. John The Baptist Parish LE",
  "FacilityLatDecDegs": "30.070278",
  "FacilityLongDecDegs": "-090.607778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.pinnaclepolymers.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 16048048,
  "ParentCompanyName": "Polychim USA",
  "Company2Name": "CAMI Trust",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Pinnacle Polymers, LLC",
  "OperatorStr1": "Two Pinnacle Ave",
  "OperatorStr2": null,
  "OperatorCity": "Garyville",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70051",
  "OperatorZipCodeExt": null,
  "FTE": 140,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000078202",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "2580-00030-06",
  "SafetyInspectionDate": "2016-09-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-09-07 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-09-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-09-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.0614,
  "FRS_Long": -90.6125,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000118118,
      "AltID": null,
      "FacilityID": 1000095168,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000147703,
          "ProcessID": 1000118118,
          "ChemicalID": 129,
          "Quantity": 5700000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000119447,
          "ProcessID": 1000118118,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000101183,
              "Process_NAICS_ID": 1000119447,
              "SafetyReviewDate": "2019-08-06 00:00:00",
              "PHA_Date": "2019-08-06 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-08-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Automatic Shutdown Systems",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Gas Detectors and Fire Detectors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-01-11 00:00:00",
              "TrainingReviewDate": "2019-04-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer based",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-07-31 00:00:00",
              "EquipmentInspectionDate": "2021-07-23 00:00:00",
              "EquipmentTested": "API 510 Vessel External/On-Stream Inspection on ND-6213 (LIQUID ADDITIVE TANK ? PEROXIDE)",
              "ChangeMgmtDate": "2021-06-09 00:00:00",
              "ChangeMgmtReviewDate": "2021-07-01 00:00:00",
              "PreStartupReviewDate": "2021-07-21 00:00:00",
              "ComplianceAuditDate": "2021-05-06 00:00:00",
              "AuditCompletionDate": "2021-05-07 00:00:00",
              "IncidentInvestigationDate": "2021-07-21 00:00:00",
              "InvestigationChangeDate": "2021-08-21 00:00:00",
              "ParticipationPlansReviewDate": "2019-08-06 00:00:00",
              "HotWorkPermitReviewDate": "2021-02-23 00:00:00",
              "ContractorSafetyReviewDate": "2021-02-16 00:00:00",
              "ContractorSafetyEvalDate": "2021-07-20 00:00:00",
              "CBI_Flag": 0,
              "Description": "Pinnacle Polymers, LLC",
              "_chemicals": [
                {
                  "PrimaryKey": 1000127082,
                  "PreventionProgram3ID": 1000101183,
                  "ProcessChemicalID": 1000147703
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000095168,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2021-06-14 00:00:00",
    "ERTrainingDate": "2021-06-03 00:00:00",
    "CoordinatingAgencyName": "St. John the Baptist LEPC",
    "CoordinatingAgencyPhone": "9856522222",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000095168,
      "SummaryText": "LDEQ Facility ID 30922\n\nEXECUTIVE SUMMARY\n\n\n\nPinnacle Polymers, LLC (PP) is committed to operating in a manner that is safe for PP workers, the public, and the environment. It is PP's policy that in the conduct of its activities it will strive to protect and promote the health and safety of its employees, customers, and others who may be affected by these activities, and to limit adverse effects on the physical environment in which its activities are carried out. As part of this policy, PP has established systems to help ensure safe operation of the processes at this facility. One part of these systems is a risk management program (RMP) that helps manage the risks at PP and complies with the requirements of the Environmental Protection Agency's (EPA's) rule 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule), and the Louisiana Department of Environmental Quality regulation (LAC 33:lll, Chapter 59). One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at PP. This document is intended to satisfy the RMP Plan executive summary requirement of the RMP rule and to provide the public with a description of the risk management program at PP.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nPP is committed to the safety of the general public and PP employees and to the preservation of the environment.  One primary portion of this commitment is the prevention of accidental releases hazardous substances in and around the facility. PP utilizes engineering controls, inspection programs, and detailed procedures as a means to prevent accidental releases. In the event of a release, the facility has an emergency response team trained to contain, mitigate, monitor and stop the release.   Additionally, the emergency response team is fully staffed and trained for fire fighting, and other emergency situations such as natural disasters and bomb threats. In addition"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000095168,
      "SummaryText": " to handling the emergency, the facility has also established a wide variety of communication systems to alert the community in the event of a significant release. In conjunction with the local emergency planning committee (LEPC), the facility has ability to notify the local community through cable override systems, radio broadcasts, and other methods available to the LEPC.\n\nThe PP President has overall responsibility for the development and implementation of the risk management program. However, the specific responsibilities for certain aspects of that program have been delegated to other personnel who report to the President either directly or through other management personnel. Those relationships are depicted on the plant organization chart. Specific responsibility for the implementation of the process safety management (PSM) and accident prevention program has been delegated to the Regulatory Affairs and Human Resources Manager. The plant's emergency response program, including compliance with the RMP aspects of that effort, is also the responsibility of the Regulatory Affairs and Human Resources Manager.\n\n\n\nPP REGULATED SUBSTANCES\n\nPP is a manufacturer of polypropylene and is located in Garyville, Louisiana. The PP process contains propylene which is a flammable substance that EPA has specifically listed in the RMP rule and is present in the process above the EPA threshold quantity of 10,000 pounds. Toxic substances used or stored at PP do not meet or exceed the listed threshold quantities.\n\n\n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\nThe following is a summary of the of the accident prevention program in place at the PP. Because the processes at the facility that are regulated by the EPA's RMP regulation are also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard, and because the OSHA PSM requirements are very similar to the EPA RMP requirements, this summary addresses each of the OSHA PSM eleme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000095168,
      "SummaryText": "nts. The PSM program at this facility has been extended by PP, where necessary, to satisfy EPA's Program Level 3 accident prevention program requirements.\n\nEMPLOYEE PARTICIPATION\n\nPP encourages employees to participate in all facets of process safety management and accident prevention. PP consults with employees on the conduct and development of Process Hazard Analyses (PHAs) and the development of the elements of OSHAA?s Process Safety management (PSM) standard. Employees have access to all information created as part of PP's PSM and accident prevention programs.\n\n\n\nPROCESS SAFETY INFORMATION\n\nPP completes a compilation of written Process Safety Information before conducting any PHA required by the OSHA PSM standard. The compilation of written process safety information is to enable PP and the employees involved in operating the process to identify and understand the hazards posed by those processes involving highly hazardous chemicals. This Process Safety Information includes information pertaining to the hazards of the highly hazardous chemicals used or produced by the process, to the technology of the process, and to the equipment in the process.\n\nInformation pertaining to the hazards of the highly hazardous chemicals in the process consists of the following:\n\na.    Toxicity information;\n\nb.    Permissible exposure limits;\n\nc.    Physical data;\n\nd.    Reactivity data;\n\ne.    Corrosivity data;\n\nf.    Thermal and chemical stability data; and,\n\ng.    Hazardous effects of inadvertent mixing of different materials that could foresee ably occur.\n\nThe above chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is normally provided in material safety data sheets (MSDSs).\n\nInformation pertaining to the technology of the process includes the following:\n\na.    Process chemistry;\n\nb.    Maximum intended inventory;\n\nc.    Safety upper and lower limits for such items as temperatures, pressure, flows or compositions; and,\n\nd.    An evaluation of th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000095168,
      "SummaryText": "e consequences of deviation, including those affecting the safety and health of employees.\n\nInformation pertaining to the equipment in the process includes:\n\na.    Material of Construction;\n\nb.    Piping and Instrument Diagrams (P&IDs);\n\nc.    Electrical Classification;\n\nd.    Relief System design and design basis;\n\ne.    Ventilation System design;\n\nf.    Design Codes and Standards employed;\n\ng.    Material and Energy Balances; and,\n\nh.    Safety systems (e.g. interlocks, detection or suppression system).\n\n\n\nPROCESS HAZARD ANALYSIS (PHA)\n\nPP has a comprehensive PHA program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, the process is systematically examined to identify, evaluate, and control the hazards involved.\n\nPP uses one or more of the appropriate analysis techniques to perform the PHA evaluations. The PHA evaluations are performed by a team with expertise in engineering and process operations, and the team includes at least one employee who has experience and knowledge specific to the process being evaluated. Also, one member of the team must be knowledgeable in the specific PHA methodology being used. The PHA evaluations address:\n\na.    The hazards of the process;\n\nb.    The identification of any previous incident which had a likely potential for catastrophic consequences in the workplace;\n\nc.    Engineering and administrative controls applicable to the hazards and their interrelationships; such as\n\nappropriate application of detection methodologies to provide early warning of releases. Acceptable detection\n\nmethods might include process monitoring and control instrumentation with alarms and detection hardware\n\nsuch as hydrocarbon sensors;\n\nd.    Consequences of failure of Engineering and administrative controls;\n\ne.    Facility siting;\n\nf.    Human factors; and,\n\ng.    A qualitative evaluation of a range of the possible safety and health effects of failure of controls on employees in the workplace.\n\nPP has established a system to pr"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000095168,
      "SummaryText": "omptly address the team findings and recommendations; assure that the recommendations are resolved in a timely manner and that the resolution is documented; document what actions are to be taken; complete actions as soon as possible; develop a written schedule of when these actions are to be completed; and communicate the actions to operating maintenance and other entities whose work assignments are in the process and who may be affected by the recommendations or actions. PP retains PHA and updates or revalidations, as well as the documented resolution of recommendations for the life of the process.\n\n\n\nOPERATING PROCEDURES\n\nPP maintains written Standard Operating Procedures (SOPs) that provide clear instructions for safety conducting activities involved in the process operations, such as: (1) initial startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) emergency operations; (6) normal shutdown, and (7) startup following a scheduled shutdown or after an emergency shutdown. The SOPs address operating limits, safety and health considerations, and safety systems and their functions.\n\nSOPs are readily accessible to employees who work in or maintain a process.\n\nThe SOPs are reviewed as often as necessary to assure that they reflect current operating practice, including changes that result from changes in process chemicals, technology and equipment, and changes to facilities. PP certifies annually that these SOPs are current and accurate.\n\nAdditionally, PP has developed safe work practices to provide for the control of hazards during operations such as lockout-tagout, confined space entry, opening process equipment or piping, and control over entrance into a facility by maintenance, contractor, laboratory, or other support personnel. These safe work practices apply to employees and contractors. \n\n\n\nTRAINING\n\nBefore operating a new or presently assigned process, each employee is trained in an overview of the process and in the SOPs as discus"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000095168,
      "SummaryText": "sed earlier. The training includes emphasis on the specific safety and health hazards, emergency operations including shutdown, and safe work practices applicable to the employee job tasks.\n\nRefresher training is provided at least every three years to each employee involved in operating a process to assure that the employee understands and adheres to the current SOPs of the process. PP, in consolation with the employees involved in operating the process, determines the appropriate frequency of refresher training.\n\nPP ascertains that each employee involved in operating a process has received and understands the required training. PP maintains records that contain the identity of the employee, the date of training, and the means used to verify that the employee understood the training.\n\n\n\nMECHANICAL INTEGRITY\n\nPP has written procedures to maintain the on-going integrity of process equipment, including:\n\na.    Pressure vessels and storage tanks;\n\nb.    Piping systems (including piping components such as valves);\n\nc.    Relief and Vent System and devices;\n\nd.    Emergency Shutdown Systems;\n\ne.    Controls including monitoring devices and sensors, alarms, and interlocks; and, pumps and compressors.\n\n\n\nPP trains each employee involved in maintaining the on-going integrity of process equipment in an overview of that process and its hazards. To assure that the employee can perform the job tasks in a safe manner, PP further trains employees in the procedures applicable to the employee's job tasks. Inspections and tests are preformed on process equipment. Inspection and testing procedures follow recognized and generally accepted good engineering practices. The frequency of inspections and tests of process equipment is consistent with applicable manufacturer's recommendations and good engineering practices. Inspections and tests are conducted more frequently if determined to be necessary by prior operating experience. PP documents each inspection and test that has been performed on process e"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000095168,
      "SummaryText": "quipment and corrects deficiencies that are outside acceptable limits.\n\nIn the construction of new plants and equipment, PP assures that equipment as it is fabricated and suitable for the process application for which they are used. Appropriate checks and inspections are performed to assure that equipment is installed properly and consistent with design specifications and manufacturer's instructions.\n\n\n\nMANAGEMENT OF CHANGE\n\nPP has written procedures to manage changes (except for replacements in kind) to process chemicals, technology, equipment, procedures, and changes to facilities that affect a covered process. The procedures are designed to assure that the following considerations are addressed prior to any change:\n\na.    The technical basis for the proposed change;\n\nb.    Impact of change on safety and health;\n\nc.    Modifications to SOPs;\n\nd.    Necessary time period for the change; and,\n\ne.    Authorization requirements for the proposed change.\n\n\n\nEmployees involved in operating and maintaining a process and contractors whose job tasks will be affected by a change in the process are informed of, and trained in, the change prior to startup of the process or affected part of the process.\n\n\n\nIf a change covered by this paragraph results in a change in the Process Safety Information, such as information updated accordingly. If a change in the SOPs or practices, such procedures or practices are updated accordingly.\n\n\n\nPRE-STARTUP SAFETY REVIEW (PSSR)\n\nPP performs a PSSR on new facilities and modified facilities when the modification is significant enough to require a change in the process safety information. The PSSR shall confirm that prior to the introduction of highly hazardous chemicals to a process:\n\na.    Construction and equipment is in accordance with design specifications;\n\nb.    Safety, operating, maintenance, and emergency procedures are in place and are adequate;\n\nc.    For new facilities, PHA has been performed and recommendations have been resolved or implemented before star"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000095168,
      "SummaryText": "tup, and modified facilities meet the requirements contained in management of change; and,\n\nd.    Training each employee involved in operating a process has been completed.\n\n\n\nINCIDENT INVESTIGATION\n\nPP investigates each incident, which resulted in, or could reasonably have resulted in a catastrophic release of highly hazardous chemical in the workplace. An incident investigation team shall be established and consist of at least one person knowledgeable in the process involved, including a contractor if the incident involved the work of the contractor, and other persons with appropriate knowledge and experience thoroughly investigate and analyze the incident. Findings of the incident are documented in a report. PP promptly addresses and resolves the incident report findings and recommendations.   Resolutions and corrective actions are documented. The report is reviewed with all affected personnel whose job tasks are relevant to the incident findings including contract employees where applicable. Incident Investigation reports are retained for five years.\n\n\n\nHOT WORK PERMITS\n\nPP uses a Hot Work Permit System for hot work operations conducted on or near a covered process. The permit is designed to document that the fire prevention and protection requirements in 29 CFR 1910.252(a) have been implemented prior to beginning the hot work operations. The permit is kept on file for one year.\n\n\n\nCONTRACTORS\n\nPP uses contractors to supplement its work force during periods of increased maintenance or construction activities. PP has procedures in place to ensure that contractors (1) perform their work in a safe manner; (2) have the appropriate knowledge and skills; (3) are aware of the hazards in their workplace; (4) understand what they should do in the event of an emergency; (5) understand and follow site safety rules; and, (6) inform PP personnel of any hazards that they find during their work.\n\nWhen selecting a contractor, PP obtains and evaluates information regarding the cont"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000095168,
      "SummaryText": "ract employerA?s safety performance and programs. PP informs contract employers of the known potential fire, explosion, or toxic release hazards related to the contractor's work and the process and explains to contractor employers the applicable provisions of the emergency action plan. PP has developed safe work to control the entrance, presence and exit of contract employees in a covered process areas.\n\nPP periodically evaluates the performance of contract employers and maintains a contract employee injury and illness log related to the contractors work in process area.\n\nIt is PP's policy that the contract employer assures that each contract employee is trained in the work practices necessary to safely perform his/her job. The contract employer shall assure that each contract employee is instructed in the known potential fire, explosion, or toxic release hazards related to his/her job and the process and the applicable provisions of the emergency action plan. The contract employer shall assure that each contract employee follows the safety rules of the facility. The contract employer shall advise PP of any unique hazards presented by the contract employer's work or of any hazards found by the contract employer's work.\n\n\n\nCOMPLIANCE AUDITS\n\nTo help ensure that the accident prevention program is functioning properly, PP will periodically conduct audits to confirm the procedures and practices required by the accident prevention program are being implemented. Compliance audits will be conducted at least every 3 years. The compliance audit will be conducted by at least one person knowledgeable in the process, and a report of the findings of the audit will be developed   PP will promptly determine and document an appropriate response to each of the findings of the compliance audit, and document that deficiencies have been corrected. PP will retain the two (2) most recent compliance audit reports.\n\n\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\nThe processes at PP have hazards tha"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000095168,
      "SummaryText": "t must be managed to ensure continued safe operation. The accident prevention program summarized previously is applied to all EPA RMP covered processes at PP. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nIn addition to the accident prevention program activities, PP has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in the covered processes:\n\n\n\nRelease Detection\n\na.    Hydrocarbon detectors with alarms\n\n\n\nRelease Containment/Control\n\na.    Automatic Emergency Feed Shutdowns;\n\nb.    Automatic and manual sprinkler systems;\n\nc.    Centralized alarm system;\n\nd.    Fully trained emergency response team;\n\ne.    Communications systems (e.g. radio, emergency phones, PA system, emergency call procedures);\n\nf.    Fire water system (e.g. hydrants, monitors, hose stations, backup firewater systems); and,\n\ng.    Diking and burn pits for pyrophoric liquids.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nNo releases of regulated substances have occurred in the last five years that have resulted in deaths, injuries, or significant property damage on site, or known deaths, injuries, evacuations, sheltering-in-place, property damage, or environmental damage off site.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nPP maintains a written Emergency Response Plan (ERP), which aims to protect employees, public health, and the environment. The purpose of the ERP is to minimize the impact on the facility and surrounding areas in the event of an emergency situation.   The plan consists of procedures for responding to emergencies such as fires or flammable vapor releases, medical emergencies, hurricanes, tornadoes, power outages, radiological emergencies, and bomb threats. The plan addresses all aspects of emergency response including responsibilities of the Emergency Respons"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000095168,
      "SummaryText": "e Team (ERT), coordination of clean-up activities with mutual aid organizations fire department, sheriff's office, hospital), timely notification of authorities, maintenance of proper documentation, guidelines for compliance with applicable government regulations. Furthermore, PP has procedures that address proper use, maintenance, inspection, and testing of emergency response equipment. All employees receive annual safety training to instruct them in proper emergency response procedures. The ERT participates in additional training sessions so they can safely handle potential emergency situations. The ERP for PP was submitted to the St. John the Baptist Parish Local Emergency Planning Committee (LEPC).\n\nIn order to keep the plan up to date, the emergency response procedures are reviewed annually. A Review Committee consisting of the Executive Vice President, Environmental, Health & Safety Manager, Operations Manager, Maintenance Manager, Human Resources manager, and the appointed Fire Chief and Assistant Fire Chief will review all proposed modifications. Any changes implemented are updated in the ERP.   Affected personnel are trained with regards to the changes in the ERP.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThere are no planned changes to improve safety to report.\n\n\n\nRMP VALIDATION ERRORS/WARNINGS A? No Data to Report\n\n"
    }
  ]
}