{
  "FacilityID": 1000021760,
  "FacilityName": "Link Petroleum Tacoma",
  "FacilityStr1": "1440 Port of Tacoma Rd",
  "FacilityStr2": null,
  "FacilityCity": "Tacoma",
  "FacilityState": "WA",
  "FacilityZipCode": "98421",
  "Facility4DigitZipExt": "3704",
  "FacilityCountyFIPS": "53053",
  "LEPC": "Pierce/Tacoma County LEPC",
  "FacilityLatDecDegs": "47.264822",
  "FacilityLongDecDegs": "-122.401959",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": "www.canwestpropane.com",
  "FacilityEmailAddress": "info@canwestpropane.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Gibson Energy ULC",
  "Company2Name": null,
  "CompanyDUNS": 200760288,
  "Company2DUNS": null,
  "OperatorName": "Link Petroleum Inc",
  "OperatorStr1": "PO Box 11343",
  "OperatorStr2": null,
  "OperatorCity": "Tacoma",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98411",
  "OperatorZipCodeExt": "0343",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000214528",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-03-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-04-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-04-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-04-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 47.264444,
  "FRS_Long": -122.403215,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000026464,
      "AltID": "Bulk Storage Terminal",
      "FacilityID": 1000021760,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000031475,
          "ProcessID": 1000026464,
          "ChemicalID": 98,
          "Quantity": 430000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000026814,
          "ProcessID": 1000026464,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000022736,
              "Process_NAICS_ID": 1000026814,
              "SafetyReviewDate": "2011-04-20 00:00:00",
              "PHA_Date": "2011-05-31 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-03-24 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-02-22 00:00:00",
              "TrainingReviewDate": "2011-03-16 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-04-30 00:00:00",
              "EquipmentInspectionDate": "2011-03-24 00:00:00",
              "EquipmentTested": "Storage tanks, piping, valves, hoses, couplers, gauges, pumps, compressor, emergency shutdown system",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2011-03-24 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2011-04-15 00:00:00",
              "AuditCompletionDate": "2011-05-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2011-03-24 00:00:00",
              "HotWorkPermitReviewDate": "2011-04-15 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2011-03-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000026900,
                  "PreventionProgram3ID": 1000022736,
                  "ProcessChemicalID": 1000031475
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000021760,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-03-16 00:00:00",
    "ERTrainingDate": "2009-09-04 00:00:00",
    "CoordinatingAgencyName": "Pierce County Emergency Management",
    "CoordinatingAgencyPhone": "2537982209",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021760,
      "SummaryText": "Executive Summary\n\nAccidental release prevention and emergency response policies:\n\nLink Petroleum is committed to operating its Tacoma facility in a manner to protect our employees, the general public, and businesses in the surrounding area to the fullest extent possible. Our policy is to establish, maintain, and implement emergency response procedures with the prime objective of protecting all persons from harm, minimize property damage and mitigate impacts to the environment. The safety of our employees, emergency response personnel and persons in affected areas are the highest priority in the initial stages of an emergency. Our accidental release and emergency response procedure is an integrated approach, involving employee participation, management practices, written procedures, and training. Link Petroleum has developed a comprehensive accident prevention program considering all aspects of process operations at this facility. The Tacoma facility maintains a written Emergency Action Plan specific to this location. If an emergency were to occur, it is our policy to immediately shut down operations, notify the Tacoma Fire Department to request their assistance and initiate evacuation of the affected area if needed. Link Petroleum maintains a Health, Safety and Environmental manual to guide employees and contractors in daily operations at our facility.  \n\n\nStationary Source and Regulated substances:\n\nLiquid Propane is the only regulated chemical at our Tacoma facility. The facility is a bulk storage terminal that receives propane by railroad tank cars and truck transports. The facility has two railroad tank car unloading stations. Propane is distributed from this facility using truck transports and propane dealer delivery trucks. This facility consists of four 30,000-gallon ASME aboveground bulk storage tanks. Each tank contains approximately 107,000 pounds of liquid propane when filled to maximum capacity.\n\n \nAccidental Release Prevention Program:\n\nLink Petroleum"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021760,
      "SummaryText": "has developed and implemented the following general accidental release and prevention program elements in accordance with EPA's Risk Management Plan rule.\n\nProcess Safety Information: Link Petroleum has compiled written process safety information for the covered process at this facility. The information includes the hazards of the process chemical, process technology information, and process equipment data. The process safety information is updated whenever process changes are made. Accurate process safety information enables employees involved in operating and maintaining the facility to identify and understand the hazards of the process. Process safety information is used to conduct a process hazard analysis on the existing process or a proposed modification to the process.\n\nProcess Hazard Analysis: Link Petroleum performs periodic detailed hazard analysis of our process to identify, evaluate, and control hazards in the process. Checklists and what-if scenario methodologies are utilized to perform the PHA. PHA's are conducted using a team of people experienced in operations, safety and maintenance procedures applicable to this facility. The PHA identifies potential deficiencies in the process as well as accident prevention and mitigation measures, and makes suggestions for additional measures and/or improvements to our current system. PHA findings, recommendations and their resolution are documented. All PHA findings and recommendations are addressed and resolved in a timely manner. A Process Hazard Analysis is performed on the Tacoma facility every 5 years as required by the RMP regulation.\n\nOperating Procedures: Written operating procedures have been developed for the tasks that terminal operators and loading personnel must perform, the safe process operating parameters that must be maintained, and safety precautions for operations and maintenance activities. The Tacoma facility written procedures address various modes of process operations, including: 1) equipm"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000021760,
      "SummaryText": "at any unintentional or uncontrolled release of propane be investigated as soon as possible. The Tacoma facility has established a system to promptly address and resolve incident investigation findings and recommendations. \n\nCompliance Audits: Link Petroleum conducts periodic audits to ensure the facility is in compliance with all applicable elements of the EPA Risk Management Plan, the OSHA Process Safety Management standard, and the requirements for handling, storage and transfer of propane as outlined in NFPA-58.\n\n\nFive-year Accident History: \n\nNo release of a regulated substance has occurred at the Tacoma facility in the last 5 years. \n\n\nEmergency Response Program Information:\n\nLink Petroleum has developed written emergency procedures to address response and follow-up to an emergency at the facility. Our emergency response procedures are based on the requirements of the various regulations of OSHA, EPA, DOT as they apply to this facility. Specific emergency response procedures for each type of emergency that could affect this terminal are addressed in the facility's Emergency Action Plan, which is a separate document from the Risk Management Plan. The Tacoma facility does not maintain an emergency response team on-site. The facility depends upon local response authorities to conduct an appropriate response to the emergencies that could potentially occur at this location. Link Petroleum personnel will take quick defensive measures to mitigate any emergency to the extent that these actions can be taken without risking the safety of our personnel. The facility Emergency Action Plan is site-specific. It includes required actions by plant employees as well as required notification and coordination with local emergency responders. Employees are trained in the execution of the Emergency Action Plan and drills are conducted annually. The Tacoma facility complies with NFPA 58 requirements for LP-Gas Storage and Handling, including emergency shutdown capabilities. In the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000021760,
      "SummaryText": "event of an emergency involving our propane system, a plant-wide emergency shutdown system can be activated to close all primary tank and emergency shutoff valves and turn off electrical power to all transfer equipment. Link Petroleum's policy is to immediately notify the Tacoma Fire Department in the event of an emergency and request that they respond. We also have trained employees in incipient stage fire-fighting measures. The Tacoma Fire Department and other emergency response agencies are provided the opportunity to visit our facility and inspect our equipment and emergency response capabilities. Our Emergency Action Plan is reviewed annually and updated when systems are modified.\n\n\nPlanned Changes to Improve Safety:\n\nThere are no changes to equipment or procedures planned at this time."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021760,
      "SummaryText": "ent inspection and maintenance, 2) process startup, 3) off-loading railcars and truck transports, 4) loading truck transports and delivery trucks, 5) process shutdown, and 6) emergency shutdown and response procedures. \n\nContractors: A program is in place to ensure that contractors used at the Tacoma facility are qualified to perform their work safely and are informed of the potential hazards they might encounter.\n\nPre-startup Safety Reviews: Link Petroleum requires a pre-startup safety review to be performed and documented for any additions or modifications in the covered process at this location. \n\nMechanical Integrity: Link Petroleum has developed and implemented procedures to maintain the mechanical integrity of process equipment in accordance with NFPA 58 and industry recognized good engineering practices. Inspections and tests are documented and identified deficiencies are corrected in a timely manner. Defective equipment is placed out-of-service until replacement or repairs can be completed. \n\nSafe Work Practices and Procedures: Link Petroleum has developed and implemented safe work practices that include lockout/ tagout procedures to ensure isolation of energy sources for equipment undergoing maintenance and hot work procedures and permits for work with the potential for generating ignition sources in the presence of flammable or combustible materials.\n\nTraining: A comprehensive training program for all employees and contractors involved in operating or maintaining a process, unloading railroad tanks cars or loading/unloading truck cargo tanks is in place at this facility. Training programs include classroom and practical training. Employees are tested to demonstrate their understanding and competency of the process.\n\nManagement of Change: Link Petroleum requires a management of change review be performed for any modification to equipment, procedures, products and process parameters of the covered process. \n\nIncident Investigation: Link Petroleum requires th"
    }
  ]
}