{
  "FacilityID": 1000001422,
  "FacilityName": "Little Knife Gas Plant",
  "FacilityStr1": "813-123rd Avenue, SW",
  "FacilityStr2": null,
  "FacilityCity": "Killdeer",
  "FacilityState": "ND",
  "FacilityZipCode": "58640",
  "Facility4DigitZipExt": "9001",
  "FacilityCountyFIPS": "38007",
  "LEPC": "Billings County Emergency Mgmt",
  "FacilityLatDecDegs": "47.296944",
  "FacilityLongDecDegs": "-103.098000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.petrohunt.com",
  "FacilityEmailAddress": "dclark@petrohunt.com",
  "FacilityDUNS": 49057375,
  "ParentCompanyName": "PetroHunt, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Petro-Hunt, L.L.C.",
  "OperatorStr1": "813-123rd Avenue, SW",
  "OperatorStr2": null,
  "OperatorCity": "Killdeer",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58640",
  "OperatorZipCodeExt": "9001",
  "FTE": 21,
  "OtherEPAFacilityID": "NDD095282646",
  "EPAFacilityID": "100000102756",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T5-081013",
  "SafetyInspectionDate": "2008-06-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 47.29722,
  "FRS_Long": -103.11528,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "17",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001850,
      "AltID": "Gas Plant",
      "FacilityID": 1000001422,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001997,
          "ProcessID": 1000001850,
          "ChemicalID": 98,
          "Quantity": 767000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000001998,
          "ProcessID": 1000001850,
          "ChemicalID": 155,
          "Quantity": 171470.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 88200,
              "ProcessChemicalID": 1000001998,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 88201,
              "ProcessChemicalID": 1000001998,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 88202,
              "ProcessChemicalID": 1000001998,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 88203,
              "ProcessChemicalID": 1000001998,
              "ChemicalID": 118
            }
          ]
        },
        {
          "ProcessChemicalID": 1000001999,
          "ProcessID": 1000001850,
          "ChemicalID": 118,
          "Quantity": 509000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000001939,
          "ProcessID": 1000001850,
          "NAICSCode": "324199",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000001422,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-07-10 00:00:00",
    "ERTrainingDate": "2008-07-17 00:00:00",
    "CoordinatingAgencyName": "Billing County Emergency Management",
    "CoordinatingAgencyPhone": "7016234870",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "ND State Health Department, ND State Industrial Commission, OSHA Regulation 29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001422,
      "SummaryText": "PetroHunt LLC (PetroHunt) has a long-standing commitment to worker and public safety and safeguarding the environment. To achieve these goals, PetroHunt strives to integrate safety features in the design, installation, operation, and maintenance of its facilities. PetroHunt policy is to implement practical controls and management systems to prevent foreseeable potential releases of hazardous substances.  However, if a release does occur, the Little Knife Gas Plant has a well-defined emergency action plan and trained personnel to control and contain the release.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nPetroHunt operates the Little Knife Gas Plant, located in Billings county, North Dakota, to produce natural gas and sulfur from sour gas.  The facility consists of a gas processing facility, with unit operations designed to  separate various hydrocarbon components and sulfur from the incoming sour gas stream.  The facility is designed for operation during extreme winter weather conditions, typically encountered in North Dakota.  A control room, located within the facility, houses the process control instrumentation, with continuous coverage provided by process operations technicians. \n\nThe facility operation consists of a closed-loop continuous process, beginning with inlet sour gas, with various hydrocarbon products and sulfur for sale.  A portion of the fuel gas is consumed in the process to provided the needed energy for the facility operations.  Key process components include gas separators, patented amine treatment process for the removal of hydrogen sulfide, various hydrocarbon separation units, sulfur plant, incinerator, and all utilities necessary for the plant operation.  Mixed hydrocarbons, Y-Grade are received by transport trucks for fractionation.  In addition, liquid propane and butane produced are collected in a battery of storage tanks, and eventually shipped by tank trailer.\n\nThe Little Knife Gas Plant has an excellent safety and e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001422,
      "SummaryText": "nvironmental record, with a high level of employee involvement and commitment to operational excellence.  PetroHunt  has been operating the gas plant since 1992, with numerous process improvements. The Little Knife Gas Plant has operated over twenty years (successfully started up in July, 1978) without any reportable release of hazardous substances. \n\nThe Little Knife Gas plant has three flammable substances listed in the EPA's Risk Management Program (RMP) rule above the threshold quantity of 10,000 lbs each. These are:\n    \n    A?    flammable mixture (ethane, methane, propane, butane mixture)\n    A?    propane (propane storage tanks)\n    A?    butane (butane storage tanks).\n    \nThe Little Knife Gas Plant process also contains hydrogen sulfide, a listed toxic substance in the EPA's Risk Management Program rule.  However, the total inventory of hydrogen sulfide in the gas plant equipment and piping within the plant boundaries is significantly less than the threshold quantity of 10,000 lbs and thus is not considered a regulated substance for the RMP submission.  The Little Knife Gas Plant process operations are considered Program Level 1 for the RMP rule, based on:\n\n    A?    no reportable release of any listed substance in the past five years, and\n    A?    no public or environmental receptors within the maximum distance to the endpoint for the worst-case scenarios for all listed substances above the threshold quantities, specified in the EPA's RMP rule. \n\nThe Little Knife Gas Plant process operations are covered by OSHA's process safety management (PSM) standard in addition to the RMP rule.   The following sections describe the results of offsite consequence analysis results for each regulated substance, briefly discuss the prevention program and engineered safeguards implemented by PetroHunt to help prevent releases of hazardous substances, give a five-year accidental release history, and an overview of the emergency response plan implemented at the site.\nOFFSITE CONSEQUENCES ANALYSIS RESULTS\n\nIn "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001422,
      "SummaryText": "order to continuously improve safety and environmental operations of its facilities, PetroHunt initiated a hazard analysis (HA) of the Little Knife Gas Plant process.  The purpose of the HA was to develop strategies for emergency response and actions for the site.  It must be noted an extensive emergency response plan has been implemented at the site to comply with local and State regulations and coordinate with the local responders.\n\nTo perform the hazard analysis, PetroHunt assembled a team of experts who are familiar with the design, operation, and maintenance of the Little Knife Gas Plant operations.  The HA team used the RMP Offsite Consequence Analysis Guidance, U. S. Environmental Protection Agency (EPA), revised April, 1999, and other EPA guidance documents, as necessary.  The HA team used RMPComp ( v 1.06) software, developed by EPA and the CAMEO team of Chemical Emergency Preparedness and Prevention Office (CEPPO).  The analysis results were plotted using Mapping Application for Response, Planning, and Local Operational Tasks (MARPLOT).  The results of the offsite consequence analysis of each regulated flammable substance above the threshold quantity is provided below.\n\nFlammable Mixture Offsite Consequence Analysis Results\n\nThe worst-case scenario (WCS) associated with the flammable mixture is a catastrophic failure of the Y-Grade storage tank, releasing the entire contents of the vessel, containing 171,470 lbs of flammable mixture containing ethane, methane, propane, and butane over a 10-minute period.  A vapor cloud is formed containing the total quantity of the flammable mixture and 10% of the vapor is assumed to detonate with a vapor cloud explosion (VCE).  The maximum distance to the endpoint of 1-psi for this WCS is 0.40 miles from the field gas discharge scrubber.  Although PetroHunt has numerous controls to prevent such a release and to manage  consequences of such a release, no credit for any safeguards (e.g., passive mitigation measures) was tak"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000001422,
      "SummaryText": "en into account in evaluating this WCS.  \n\nPropane Offsite Consequence Analysis Results\n\nThe worst-case scenario (WCS) associated with the flammable mixture is a catastrophic failure of one or more of the seven propane storage tanks, releasing the entire contents of the vessel, approximately 110,000 lbs of liquified propane (by pressure), over a 10-minute period.  For this WCS, the tank is assumed to be at its maximum quantity (90% of the maximum tank volume).  A vapor cloud is formed containing the total quantity of propane and 10% of the vapor is assumed to detonate with a vapor cloud explosion (VCE).  The maximum distance to the endpoint of 1-psi for this WCS is 0.40 miles from the propane storage tank area.  Although PetroHunt has numerous controls to prevent such a release and to manage  consequences of such a release, no credit for any safeguards (e.g., passive mitigation measures) was taken into account in evaluating this WCS. \n\nButane Offsite Consequence Analysis Results\n\nThe worst-case scenario (WCS) associated with the flammable mixture is a catastrophic failure of one or more of four butane storage tanks, releasing the entire contents of the vessel, approximately 127,000 lbs of liquid butane, over a 10-minute period.  A vapor cloud is formed containing the total quantity of butane and 10% of the vapor is assumed to detonate with a vapor cloud explosion (VCE).  The maximum distance to the endpoint of 1-psi for this WCS is 0.40 miles from the butane storage tanks.  Although PetroHunt has numerous controls to prevent such a release and to manage  consequences of such a release, no credit for any safeguards (e.g., passive mitigation measures) was taken into account in evaluating this WCS. (Please see Figure 6 for results of hazard assessment for the WCS.)\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nBecause the Little Knife Gas Plant process is subject to Program Level 1 of the Environmental Protection Agency's (EPA's) risk management program (RMP) rule, a forma"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000001422,
      "SummaryText": "l accidental release prevention program is not required.  In addition, the gas plant process is covered by the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard.  The accidental release prevention program described in this section covers some of the important management systems in place at the Little Knife Gas Plant and additional safeguards specifically provided to reduce the likelihood of any release of regulated substances and/or mitigate the severity of consequences if such were to occur.\n\nEmployee Involvement and Training\n\nThe Little Knife Gas Plant conducts its business using a teamwork approach.  A small plant environment and teamwork approach provide an active forum for employee participation in all facets of process operations.  Examples of employee involvement range from participation in the initial process hazard analysis in 1992  to implementation of the PHA team's findings.  Employees have access to all information created as a part of the process safety management standard. In addition, specific employee participation activities include operations teams and periodic safety meetings to discuss specific safety-related topics.  Meeting attendance sheets are maintained as primary documentation. \n\nEmployee participation is key to the training of new employees and retraining of experienced employees.  The Little Knife Gas Plant has implemented a comprehensive training program for all employees involved in process operations. All plant personnel (operators, maintenance personnel) receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  New employees receive safety orientation in Little Knife Gas Plant operations.  After successfully completing this basic orientation, a new operator is paired with a senior operator "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000001422,
      "SummaryText": "to learn process-specific duties and tasks. Operators demonstrate (e.g., through skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner and can then work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every three years. \n\nThe average PetroHunt employee has 10-plus years of experience in the process operations. Such an experienced work force provides highly trained and motivated employees, with significant process knowledge, cross-training, and leadership.  PetroHunt maintains open communications with all employees, assuring a high-level of participation and interactive training.\n\nHazard Assessment and Risk Management\n\nThe Little Knife Gas Plant develops and updates a variety of technical documents that are used to help maintain safe operations of the process.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis and configuration information.  \n\nChemical-specific information, including exposure hazards and emergency response exposure treatment considerations, is provided in material safety data sheets (MSDSs). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals. The Little Knife Gas Plant has established safety-related limits for specific process parameters (e.g., level, temperatures, pressures) in process documentation. The Little Knife Gas Plant ensures that the process is maintained within these limits using process controls and monitoring instruments, highly-trained personnel, and protective instrument systems (e.g., automated shutdown).\n\nThe Little Knife Gas Plant also maintains numerous technical documents "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000001422,
      "SummaryText": "that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical ratings of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\nThe PetroHunt Little Knife Gas Plant has a comprehensive program to help ensure that hazards associated with the process are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards by conducting process hazard analyses (PHAs) as needed.  The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  The PHA team findings are evaluated by local and corporate management for resolution. Using risk-based ranking methods to help assure that potential accident scenarios are assigned the highest risk ranking, PetroHunt  Little Knife Gas Plant staff tracks the PHA teams' findings until they are completed.\n\n\nMechanical Integrity\n\nThe PetroHunt Little Knife Gas Plant has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: (1) ensuring that equipment is designed to meet appropriate codes and standards, (2) developing written procedures for testing and inspecting equipment, piping, and instrumentation systems (3) performing inspections and tests on a timely basis, and (4) correcting identified deficiencies, if necessary. \n\nAnother integral part of the mechanical integrity program is quality assurance, especi"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000001422,
      "SummaryText": "ally for new and replacement equipment. The PetroHunt Little Knife Gas Plant incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.   In combination, these activities form a system that maintains the mechanical integrity of the process .\n\nSafe Work Practices\n\nThe Little Knife Gas Plant has long-standing safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit to the plant site,  (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\nManagement Practices\n\nThe Little Knife Gas Plant has a comprehensive system to manage changes to the covered process. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change.\n\nThe Litt"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000001422,
      "SummaryText": "le Knife Gas Plant promptly investigates all incidents that result in, or reasonably could result in, a fire or explosion, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to Little Knife Gas Plant management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are resolved. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.\n\nThe Little Knife Gas Plant conducts a pre-startup safety review (PSSR) for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\nEngineered Safeguards\n\nThe Little Knife Gas Plant process has hazards that must be managed to ensure continued safe operation. The Little Knife Gas Plant has safety features to help (1) prevent occurrence of a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following is a description of existing process-specific"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000001422,
      "SummaryText": " safety features applicable to prevention of accidental releases of regulated substances in the facility. These safeguards, combined with the general prevention program described in the previous sections, collectively help prevent potential accident scenarios that could be caused by equipment failure and/or human error.\n\nRelease Detection / Prevention\n\nA?    An elaborate automatic shutdown (ESD) system is provided to quickly isolate all propane, butane, and Y-Grade storage tanks if (1) the transfer line pressure difference exceeds a preset value, or (2) in case of loss of tank trailer bonding to the storage tanks and loading rack structure.\n\nA?    The field gas discharge scrubber is designed for 500 psig (at 125F) maximum allowable working pressure (MAWP) and is currently operated at 385 psig. A substantial difference between the MAWP and the actual operating pressure allows an additional margin of safety.  A similar safety margin is also available for the butane, propane, and Y-Grade storage tanks.  These tanks are designed for 223 - 250 psi maximum allowable working pressure (MAWP). The butane storage tank maximum operating pressure is ~ 100 psig and propane storage tank maximum operating pressure is ~ 205 psig (during summer months), providing an additional margin of safety.\n\nA?    All process vessels are routinely inspected for mechanical integrity (e.g., wall thickness, weld inspections).  The propane and butane storage tanks were last inspected in January, 2002.\n\nA?    Administrative practice is implemented to ensure that the plant is attended at all times.\n\nA?    A visual inspection of the process equipment is carried out on a regular basis.\n\nA?    Plant area has numerous hydrogen sulfide detectors in strategic locations to detect any minute leak.  \n\nA?    Automatic (and manual) switches placed at strategic locations throughout the plant are part of an emergency shutdown (ESD) system for the gas plant that shuts down the process, isolates key equipment items, and diverts sour gas"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000001422,
      "SummaryText": " to flare to a fail-safe mode of operation;\n\nA?    Manual ESD system for the tank trailer loading facility (propane and butane) shuts down loading pumps and isolates product loading lines to minimize accidental release of propane / butane during transfer.\n\nA?    Automatic ESD system for the trailer loading system shuts down pumps and closes automatic valves, activated by the security and/or tank trailer loading system.\n\nA?    Redundant equipment and instrumentation (e.g., uninteruptable power supply for process control system and electric generator for key utility systems).\n\nRelease/Fire Containment / Control\n\nA?    Dual isolation valves are provided for all gas flow systems to isolate the pipeline contents and prevent further release.  The automatic shutdown system is located in the main control room with operator authorized to trigger a full shutdown if necessary.  A manual block valve is provided downstream of the automatic valve.  The tank inlet valve is normally open during process operations. \n\nA?    Perimeter security fence provides facility access control and prevents access by unauthorized personnel.  This includes tank trailer access.\n\nA?    Personnel protective equipment (e.g., self-contained breathing apparatus)\n\nA?    Trained emergency response personnel with a detailed emergency response plan that includes credible emergency scenarios with detailed contingency action plan to control the roadways and evacuate area residents, if necessary.\n\nA?    Redundant emergency communications equipment (telephones, radios, and cell phones) and procedures that allow effective use of the equipment.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe PetroHunt Little Knife Gas Plant has an excellent record of accident prevention over the past five years. There has not been a reportable release or accident involving any regulated substances at the Little Knife Gas Plant in the past five years. Every incident (including any near-miss) is thoroughly investigated to determine ways to prevent similar incidents from"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000001422,
      "SummaryText": " recurring, and this information is applied to all relevant processes and operations.\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe PetroHunt Little Knife Gas Plant maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment. This program meets the requirements of the North Dakota Health Department. The program consists of procedures for responding to a release of  regulated substances, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements. In addition, the plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. The emergency action program is updated when necessary based on modifications made to Little Knife Gas Plant processes or other PetroHunt facilities. The emergency action program changes are administered through the change management system, which includes informing and/or training affected personnel in the changes.\n\nThe overall emergency response program for the PetroHunt Little Knife Gas Plant is coordinated with the Billings County, North Dakota, Emergency Management Department, which serves as the local emergency planning commission (LEPC) and local Fire Department. This coordination includes periodic meetings of the LEPC, Fire Department, with local emergency response officials, local government officials, and industry representatives. The local emergency management organization"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000001422,
      "SummaryText": "s have appropriate information related to the plant (e.g., chemicals on site, quantities, major sour gas pipeline systems) to help provide support during an emergency.  The PetroHunt Little Knife Gas Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., Fire Department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident. In addition to coordination with emergency response organizations, the PetroHunt Little Knife Gas Plant conducts periodic emergency drills that involve the appropriate emergency response organizations."
    }
  ]
}