{
  "FacilityID": 1000039361,
  "FacilityName": "Bayonne Plant Holding L.L.C.",
  "FacilityStr1": "10 Hook Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Bayonne",
  "FacilityState": "NJ",
  "FacilityZipCode": "07002",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34017",
  "LEPC": "Bayonne City OEM",
  "FacilityLatDecDegs": "40.650833",
  "FacilityLongDecDegs": "-074.111667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 943307728,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Bayonne Plant Holding L.L.C.",
  "OperatorStr1": "10 Hook Rd.",
  "OperatorStr2": null,
  "OperatorCity": "Bayonne",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07002",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": "NJD986567675",
  "EPAFacilityID": "100000064397",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "12174",
  "SafetyInspectionDate": "2014-06-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-09-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-03-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-12-01 00:00:00",
  "DeRegistrationEffectiveDate": "2018-07-31 00:00:00",
  "AnniversaryDate": "2019-03-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.6553,
  "FRS_Long": -74.1124,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048311,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 1000039361,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000058715,
          "ProcessID": 1000048311,
          "ChemicalID": 56,
          "Quantity": 64000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000048759,
          "ProcessID": 1000048311,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000041922,
              "Process_NAICS_ID": 1000048759,
              "SafetyReviewDate": "2014-12-01 00:00:00",
              "PHA_Date": "2013-12-03 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-11-20 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Lightning",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Daily and Monthly Inspections by operating staff.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-02-25 00:00:00",
              "TrainingReviewDate": "2014-02-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-08-08 00:00:00",
              "EquipmentInspectionDate": "2014-12-05 00:00:00",
              "EquipmentTested": "Ammonia Tank Vapor/Hydraulic Relief Valves",
              "ChangeMgmtDate": "2014-09-26 00:00:00",
              "ChangeMgmtReviewDate": "2014-06-25 00:00:00",
              "PreStartupReviewDate": "2014-11-07 00:00:00",
              "ComplianceAuditDate": "2015-02-25 00:00:00",
              "AuditCompletionDate": "2015-02-25 00:00:00",
              "IncidentInvestigationDate": "2000-09-20 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-09-29 00:00:00",
              "HotWorkPermitReviewDate": "2014-08-01 00:00:00",
              "ContractorSafetyReviewDate": "2014-11-07 00:00:00",
              "ContractorSafetyEvalDate": "2014-06-25 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000049986,
                  "PreventionProgram3ID": 1000041922,
                  "ProcessChemicalID": 1000058715
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039361,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-08-18 00:00:00",
    "ERTrainingDate": "2014-10-09 00:00:00",
    "CoordinatingAgencyName": "Bayonne Fire Department",
    "CoordinatingAgencyPhone": "2018586005",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "NJ TCPA (NJAC 7:31), NJ DPCC (NJAC 7:1E), and OSHA (29 CFR 1910.119)",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039361,
      "SummaryText": "EXECUTIVE SUMMARY||Bayonne Plant Holding L.L.C.\r\n\r\nProgram 3 Executive Summary\r\n\r\nSystem Description\r\n\r\nBayonne Plant Holding, L.L.C. owns a 165 megawatt (MW) cogeneration (Cogen) plant in Bayonne, Hudson County, New Jersey. The facility is located wholly within the boundaries of the IMTT bulk storage terminal. The land use immediately surrounding the facility is industrial. \r\nThe facility combusts natural gas in three GE Frame 6 combustion turbines (the stationary source) to generate electricity. Each combustion turbine is equipped with a heat recovery steam generator(HRSG)that utilizes waste heat from the exhaust to convert water to steam. The steam from each HRSG is combined to drive a steam turbine. Electricity is generated at each gas turbine and at the steam turbine. Steam is also generated from 4 auxiliary boilers and piped to IMTT's petroleum storage facility for use in providing heat to IMTT's storage tanks. A selective catalytic reduction (SCR) system is located within each HRSG to reduce nitrogen oxide (NOx) emissions from the combustion turbine exhaust gases. Each SCR consists of a catalyst and injection grid within the HRSG. Anhydrous ammonia is vaporized and injected through the grid upstream of the catalyst. The ammonia mixes with the exhaust gas and as the exhaust/ammonia mixture passes through the catalyst, NOx emissions are converted to elemental nitrogen and water. The storage and handling of anhydrous ammonia is the covered process and is stored in a 30,000 gallon above ground storage Tank built to API 510 standards. It is kept pressurized by ambient radiant heat and/or electric vaporizers. A maximum of 64,000 pounds of ammonia is stored on site at any time. The ammonia flows to the ammonia skids located adjacent to each HRSG where it is mixed with air through a blower system to the injection grids within the HRSGs.\r\n\r\nExisting Risk Management Activities\r\n\r\nThe ammonia system has been regulated under New Jersey's Toxic Catastrophe Prevention Act"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039361,
      "SummaryText": "(TCPA) - (NJAC 7:31), New Jersey's Discharges of Petroleum and Other Hazardous Substances regulations (NJAC 7:1E), and OSHA's Process Safety Management (PSM) regulations (29 CFR 1910.119). These regulations required the development of risk management programs and procedures similar to the EPA's risk management requirements. The elements of these programs include safety information compilation, development of standard operating procedures, training, preventative maintenance procedures, emergency response plans, incident investigation, development of health and safety procedures, compliance and safety reviews and reporting, employee participation, management of change, contractor safety, hazard reviews and hazard assessments.\r\nThe Bayonne facility has also implemented environmental programs and procedures to ensure compliance with applicable environmental regulations. These programs and procedures, maintained in manuals at the plant, are kept up to date and available to plant personnel.\r\n\r\nRisk Management Program Summary\r\n\r\nSafety reviews are required for new construction or modifications to the existing ammonia system. These reviews are conducted prior to construction or operation of new or modified systems. Safety information is also maintained at the facility. \r\nOperating procedures have been implemented at the facility and address the normal, abnormal and emergency operating conditions of the ammonia system. A preventative maintenance program is in place and consists of procedures, testing and inspection schedules as well as a work order system that initiates and tracks work and inspections performed on the ammonia system. Hot works procedures, along with other health and safety procedures, e.g., lockout/tagout, etc., exist at the plant and are applicable to all plant work. Contractors working on the ammonia system or any plant equipment/system are required to comply with the facility's contractor safety program. Facility personnel must complete initial and refres"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039361,
      "SummaryText": "her training on procedures applicable to their position.\r\nOperators and maintenance personnel undergo a qualification process which addresses ammonia system operating procedures and/or maintenance procedures along with emergency response training. Compliance audits are conducted on an annual basis. These audits consist of a risk management program (RMP) audit plus a safety review of the ammonia system. The program audit consists of reviewing the risk management program, procedures and documentation to ensure the program is being implemented.\r\nThe ammonia system safety review consists of an audit of the ammonia system, equipment and operating procedures to ensure that the ammonia system is designed and operated in accordance with the appropriate safety protocols.\r\nIncident investigation procedures are in place at the facility to investigate events related to the ammonia system plus other events, as necessary. Matters that are investigated are properly documented. Recommendations are promptly addressed. Management of change procedures are maintained at the facility and are implemented when there are changes to the ammonia system. Change procedures do not apply to replacement in kind, but do apply to temporary procedures, e.g., emptying the NH3 storage tank for an internal inspection.\r\nEmployee participation is implemented at the facility. Employees are included in hazard reviews and incident investigations. In addition, employees hold weekly safety meetings, conduct annual drills and participate in safety committees.\r\nHazard reviews have been conducted at this facility. Hazard reviews identify the hazards associated with the process, opportunities for equipment malfunctions or human errors that could cause an accidental release, safeguards used or needed to control the hazards or prevent equipment malfunctions or human error, and steps used or needed to detect or monitor releases.\r\nOnce the hazard review is complete, a list of recommendations is developed and reviewed"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000039361,
      "SummaryText": "by plant personnel and management. The recommendations are then implemented at the site to further reduce the\r\nrisk associated with the ammonia system. In addition, an \"inherently safer technology\" (IST)review is performed to determine if an alternative system could feasibly mitigate the risks associated with the covered process.\r\n\r\nProcess Hazard Assessment\r\n\r\nA Process Hazard Assessment\" (PHA) is conducted every 5 years.\r\nThe Risk Assessment (RA) is also conducted every 5 years and consists of analyzing the effects of a worst case release scenario and an alternate release scenario. \r\nThe ammonia storage tank undergoes \"in service\" and \"out of service\" inspections in accordance with API 510 standards, monthly safety inspections, and daily inspections. In addition, the ammonia tank is protected by concrete barriers to prevent exposure to traffic in the plant. Ammonia truck deliveries are escorted by plant personnel and the plant is enclosed within a security fence with monitored access. The plant also coordinates annual emergency drills with the local fire department and provides information and equipment access to the fire department to support site emergency activities.\r\n\r\nEmergency Response\r\n\r\nAn emergency response program has been implemented at the facility since the plant's construction. The emergency response program includes an emergency response plan and coordination of emergency information and activities with both the IMTT site's emergency response team plus the Bayonne Fire Department. The emergency response plan contains the information and procedures necessary to respond to a release of any hazardous material at the site. Emergency information includes a list of emergency response personnel, notification requirements, evacuation procedures, and health/first aid data. The facility has confirmed with the Bayonne Fire Department that personnel and equipment necessary to respond to a release of a hazardous substance at the site will be provided. Coordinat"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000039361,
      "SummaryText": "ion with the fire department has included providing a copy of the emergency response plan, drawings, and other plant operating data. The emergency information has been placed in a computer program that is used as a reference at an emergency site by the department's hazmat unit. The fire department has participated in annual plant emergency response drills and drill critiques for the last six years. In addition to emergency drills, the fire department tours the facility to familiarize their personnel with plant operations and the locations of potential hazards."
    }
  ]
}