{
  "FacilityID": 1000080530,
  "FacilityName": "Ashland Specialty Ingredients G.P.",
  "FacilityStr1": "One Mill Street",
  "FacilityStr2": null,
  "FacilityCity": "Kenedy",
  "FacilityState": "TX",
  "FacilityZipCode": "78119",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48255",
  "LEPC": "Karnes County LEPC",
  "FacilityLatDecDegs": "28.817222",
  "FacilityLongDecDegs": "-097.844722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": "www.ashland.com",
  "FacilityEmailAddress": "glrhodes@ashland.com",
  "FacilityDUNS": 966549990,
  "ParentCompanyName": "Ashland. Inc.",
  "Company2Name": "N/A",
  "CompanyDUNS": 5003264,
  "Company2DUNS": 0,
  "OperatorName": "Hercules, LLC",
  "OperatorStr1": "One Mill Street",
  "OperatorStr2": null,
  "OperatorCity": "Kenedy",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78119",
  "OperatorZipCodeExt": null,
  "FTE": 62,
  "OtherEPAFacilityID": "TXD008110710",
  "EPAFacilityID": "100000017091",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-10-01 00:00:00",
  "SafetyInspectionBy": "Responsible Care",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 28.81722,
  "FRS_Long": -97.84444,
  "FRS_Description": "SE CORNER OF LAND PARCEL",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100592,
      "AltID": null,
      "FacilityID": 1000080530,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125972,
          "ProcessID": 1000100592,
          "ChemicalID": 12,
          "Quantity": 120000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101832,
          "ProcessID": 1000100592,
          "NAICSCode": "325998",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084940,
              "Process_NAICS_ID": 1000101832,
              "SafetyReviewDate": "2019-06-10 00:00:00",
              "PHA_Date": "2019-02-04 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-10-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-04-30 00:00:00",
              "TrainingReviewDate": "2019-06-03 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-09-12 00:00:00",
              "EquipmentInspectionDate": "2019-02-04 00:00:00",
              "EquipmentTested": "Propylene Oxide Weight Tank - external inspection and thickness testing",
              "ChangeMgmtDate": "2019-04-26 00:00:00",
              "ChangeMgmtReviewDate": "2019-04-26 00:00:00",
              "PreStartupReviewDate": "2019-04-30 00:00:00",
              "ComplianceAuditDate": "2018-04-02 00:00:00",
              "AuditCompletionDate": "2018-12-03 00:00:00",
              "IncidentInvestigationDate": "2019-05-22 00:00:00",
              "InvestigationChangeDate": "2019-07-31 00:00:00",
              "ParticipationPlansReviewDate": "2018-08-30 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-15 00:00:00",
              "ContractorSafetyReviewDate": "2018-08-30 00:00:00",
              "ContractorSafetyEvalDate": "2018-11-27 00:00:00",
              "CBI_Flag": 0,
              "Description": "Propylene oxide is handled in the bulk chemical storage and unloading area.  Typically, propylene oxide is delivered to the plant biweekly in tanker trucks with carry approximately 44,000 pounds each.  The truck is parked in the unloading area using procedures that assure the chemical holding portion of the truck is within the protected area.  The protected area has a trench around the perimeter, which is intended to catch any releases of propylene oxide.  The trench drains to a concrete lined neutralization pit where it can be pumped to another container or otherwise controlled.\n\nThe process equipment is designed and constructed in accordance with strict engineering standards.  The system has automatic shut off valves and propylene oxide sensors.\n\nThe unloading hoses are not pressurized, other than to equalize pressure between the tank and the truck during the unloading process.  Hoses are checked for leaks prior to unloading by visual inspection and pressure testing.  Certified operators are trained to use emergency shut off systems associated with dedicated propylene oxide trucks which would stop the discharge.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000105823,
                  "PreventionProgram3ID": 1000084940,
                  "ProcessChemicalID": 1000125972
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080530,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2018-06-08 00:00:00",
    "ERTrainingDate": "2018-12-01 00:00:00",
    "CoordinatingAgencyName": "Karnes county LEPC",
    "CoordinatingAgencyPhone": "8307803461",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080530,
      "SummaryText": "1.0    EXECUTIVE SUMMARY\n\nAshland Specialty Ingredients, GP (ASI) currently owns and operates a guar manufacturing plant located at One Mill Street, Kenedy, Karnes County, Texas.  Plant processes include bulk storage of guar splits, alteration by chemical addition, and grinding.  This facility is an agricultural-based processing plant approximately 26.94 acres in area and began operation in October 1953.  Guar flour and its derivatives are produced at the plant.  Operations are scheduled 7 days a week, 24 hours a day.  Normal operations require approximately 65 employees, including office and production workers. \n\n\n\nPropylene oxide is delivered to the plant biweekly in tanker trucks and stored in a bulk storage tank. It is a listed regulated substance used in the P80 process. ASI uses Propylene Oxide above the threshold quantity and is subject to Program 3 requirements.  Risk Management Plan (RMP) regulations define a Program 3 process to be one that has the potential for offsite impacts from a release and is subject to OSHA's Process Safety Management (PSM) program or is classified in one of nine Standard Industrial Classification (SIC) codes.\n\nBecause Propylene Oxide is regulated for risk of accidental release, the Environmental Protection Agency (EPA) requires that an RMP be utilized for the prevention and mitigation of accidental releases. This Risk Management Plan has been developed in accordance with \"Chemical Accident Prevention Provisions\" under 40 CFR part 68 to provide guidance on how to prevent, prepare for and respond to a chemical emergency involving propylene oxide.\n\nThe Offsite Consequences Analysis\n\n\n\nThe population estimates are very conservative (the numbers are likely higher than in the year 2010 - U.S. Census).  MARPLOT is used to calculate the population within the area plotted by ALOHA.  The 2010 Census data shows population for the City of Kenedy is 3296.  The 2019 RMP update uses the ALOHA program to calculate distance to the Toxic End Point for"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080530,
      "SummaryText": " the worst case and alternative case scenarios.  The 2019 uses urban/forest to allow for the buildings located in the City of Kenedy located just to the north west of the plant. \n\n  \n\nThe Accidental Release and Prevention and Emergency Response Policies\n\nASI is dedicated to providing a safe and healthful environment for employees, customers, and communities and remains an OSHA VPP Star site.  This facility complies with all applicable federal, state, and local laws.  All management practices associated with Responsible Care Program compliance are reviewed frequently to assure all provisions are in place and operational.  Detailed emergency plans are in place at the plant.  HAZMAT recertification is conducted annually, and annual drills are held to involve the entire plant.  \n\n\n\nThe Stationary Source and Regulated Substance Handled\n\nPropylene oxide is handled in the bulk chemical storage and unloading area.  Typically, propylene oxide is delivered to the plant biweekly in tanker trucks which carry approximately 44,000 pounds each.  The truck is parked in the unloading area using procedures that assure the chemical holding portion of the truck is within the protected area.  The protected area has a trench around the perimeter, which is intended to catch any releases of propylene oxide.  The trench drains to a concrete lined neutralization pit where it can be pumped to another container or otherwise controlled.\n\nThe truck is hooked up to the unloading system using dry disconnect, 2-inch, stainless steel wire wrapped, flex hoses.  Dry disconnect fittings prevent release of chemical as the hoses are connected and disconnected.  Propylene oxide is pumped from the truck to the holding tank through stainless steel pipe.  All vapor associated with the unloading procedure is vented back to the truck with no release to the atmosphere.  A pressure relieving system is in place to release pressure in unloading lines to a scrubber.   The tank sits within a concrete containment dik"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080530,
      "SummaryText": "e which is inspected annually.  Sensors are located within the unloading and storage areas that will activate automatic shutoff valves at the tank and shut down unloading and distribution pumps in case of leaks.  These sensors as well as other equipment are calibrated on a regular basis.\n\nThe General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe propylene oxide system complies with EPA's Accidental Release Prevention Rule and all applicable state codes and regulations.  The process equipment is designed and constructed in accordance with strict engineering standards. The unloading hoses are not pressurized, other than to equalize pressure between the tank and the truck during the unloading process.  Hoses are checked for leaks prior to unloading by visual inspection and pressure testing.  Certified operators are trained to familiarize themselves with the emergency shut off system associated with the dedicated propylene oxide trucks which would stop a discharge, should something occur.  \n\nUnloading procedures for the propylene oxide are in place to assure all emergency equipment is functional prior to unloading and that the pumps and systems are leak-free.  Carriers have dedicated propylene oxide trailers that have manual shut off valves, excess flow valves, and other emergency shutoff devices that can be activated on the way out of the area to stop the flow.  \n\nAll operators are certified in the unloading operation and are required to stay within 25 feet of the truck while unloading is taking place.\n\n\n\nThe Five-year Accident History\n\nThere have been no accidental release events over the past five years involving propylene oxide that have had onsite or offsite impacts.\n\n\n\nThe Emergency Response Program\n\nASI communicates regularly with the community responders and plant employees participate in the Local Emergency Planning Committee.  In the event of an emergency involving the propylene oxide system, it is their policy to notify the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080530,
      "SummaryText": " Sheriff's Office through which emergency responders can be activated.  Preplanning has been completed.  Emergency drills are performed regularly. \n\nPlanned Changes to Improve Safety\n\n\n\nThis facility is in compliance with the local, state, and federal standards.  This facility continues to look for ways to improve and update Safety Programs.\n\nPlans to improve safety include continual improvement in Total Preventable Recordable Rate (TPRR), reduce ergonomic-related TPRR, conduct and post required Root Cause Analysis within 21 days, percent Audit & SAM Findings Closed on Time within 80 percent, 75 percent of Ergonomic Kaizen events findings fixed within 90 days, and Industrial Hygiene monitoring target more than 90 percent below Action Level.\n\nEnvironmental 2020 goals include up to 10 percent reduction of energy, greenhouse gas, and hazardous waste, up to 50 percent reduction in Walk the Line incidents for the Environmental Incident Classification, approved carrier usage up to 97 percent and recovered freight claims up to 90 percent.\n\n"
    }
  ]
}