{
  "FacilityID": 1000033569,
  "FacilityName": "GreenGate Fresh Salinas",
  "FacilityStr1": "1222 Merrill Street",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93912",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.645848",
  "FacilityLongDecDegs": "-121.634468",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "GreenGate Fresh, LLLP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "GreenGate Fresh, LLLP",
  "OperatorStr1": "1222 Merrill Street",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93912",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000221459",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-03-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-03-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-03-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-03-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040969,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000033569,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049192,
          "ProcessID": 1000040969,
          "ChemicalID": 56,
          "Quantity": 16500.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000041413,
          "ProcessID": 1000040969,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000035779,
              "Process_NAICS_ID": 1000041413,
              "SafetyReviewDate": "2013-03-15 00:00:00",
              "PHA_Date": "2013-01-28 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "equipment anchors",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-03-15 00:00:00",
              "TrainingReviewDate": "2013-03-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-03-15 00:00:00",
              "EquipmentInspectionDate": "2013-03-19 00:00:00",
              "EquipmentTested": "refrigeration pressure test: piping, condensers, fan coils, all fixed equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2013-03-15 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-03-15 00:00:00",
              "HotWorkPermitReviewDate": "2013-03-15 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "This Risk Management Plan (RMP) with Process Safety Management (PSM) has been prepared to meet the requirements of the Federal Environmental Protection Agency (EPA) 40 CFR Part 68 - Accidental Release Prevention Requirements, and federal OSHA Standards ? 29 CFR Process Safety Management of Highly Hazardous Chemicals- 1910.119. Facilities that use 10,000 pounds or more of anhydrous ammonia must comply with the Process Safety Management (PSM) Standard, Title 8 California Code of Regulations (T8CCR), Section 5189.\n\nThe State of California adopted Accidental Release Prevention requirements under Senate Bill 1889, with certain modifications. The State version of the RMP program is known as the California Accidental Release Prevention program (CALARP) pursuant to sections 25531-25534.4 of the Health and Safety Code. The RMP program elements are mandated in Title 19, Division 2, Chapter 4, and Subchapter 2 of the Health and Safety Code.\n\nMonterey County Division of Environmental Health enforces these regulations. Under the authority of CALARP, facilities that produce, handle, process, distribute, or store certain chemicals are required to develop a Risk Management Program and prepare a Risk Management Plan (RMP). As a Program Level 3 facility, GreenGate Fresh must also submit this RMP to the EPA. \n\nThis RMP is for a new facility located at 1222 Merrill Street, Salinas, California, for GreenGate Fresh, LLLP. The GreenGate Fresh facility handles Anhydrous Ammonia in quantities greater than the State Threshold Quantities. Ammonia, CAS 7664-41-7, is listed as a State Regulated Substance and is included in the Consolidated List of Chemicals Subject to the Emergency Planning and Community Right-to-Know Act and Section 112(r) of the Clean Air Act, in quantities above the Threshold Quantities. The purpose of this RMP is to prevent unwanted releases of hazardous chemicals, especially into locations that could expose employees and others to serious hazards, to identify hazards associated with the use of Anhydrous Ammonia, and to provide procedures to minimize the risks involved with handling this material.\n\n1.    Other applicable Standards\n\nGreenGate Fresh must comply with the following T8CCR Sections including, but not limited to; 3248, Mechanical Refrigeration, 5144, Respiratory Protection; 5192, Hazardous Waste Operations & Emergency Response; 5194, Hazard Communication; 3203, Injury and Illness Prevention Program; and 3220, Emergency Action Plan. \n\nThe process safety management standard targets highly hazardous chemicals that have the potential to cause a catastrophic incident. This standard as a whole is to aid employers in their efforts to prevent or mitigate episodic chemical releases that could lead to a catastrophe in the workplace and possibly to the surrounding community. To control these types of hazards, employers need to develop the necessary expertise, experiences, judgment and proactive initiative within their workforce to properly implement and maintain an effective process safety management program as envisioned in the OSHA standard. Employers, who merge the two sets of requirements into their process safety management program, will better assure full compliance with each as well as enhancing their relationship with the local community. \n\nGreenGate Fresh is required to comply with Program 3 requirements because it exceeds the State threshold limit of 500 lbs. and sensitive public receptors are located within the worst-case accidental release toxic end-point area. It is also required to submit the RMP to the EPA because it exceeds the Federal Threshold limit of 10,000 lbs. The operating charge of the largest system is 16,500 lbs. This total amount is distributed throughout a system consisting of a mechanical equipment area, storage receivers, cold storage rooms, forced-air pre-coolers, vacuum tube pre-coolers, and ice-making equipment.\n\nThe general requirements for the Program 3 RMP include the following. See specific sections for further information on these requirements.\n\nManagement System - The owner or operator shall develop a management system to oversee the implementation of the RMP elements. A qualified person shall be designated the overall responsibility for the implementation and integration of the RMP elements. \n\nExecutive Summary - A summary shall be provided that includes a brief description of accidental release prevention and emergency response, source and substance handled, worst case and alternative release scenarios, five year accident history, and planned changes to improve system safety.\n\nOffsite Consequence Analysis - An off-site consequence analysis must be performed to determine off-site impacts to human and environmental receptors. The evaluation includes both a worst-case and alternative release scenario. \n\nFive-year Accident History - A summary of all accidental releases, their consequences, damages and injuries, initiating events, and weather conditions for all significant release that have occurred in the last five years. \n\nProcess Safety Information - Process Safety Information is to be gathered in written form before conducting a Hazard Analysis. The information is to be used to prevent or minimize the consequences of a catastrophic release of toxic, reactive, flammable, or explosive chemicals. The information to be gathered pertains to hazardous chemicals used or produced by the process, information pertaining to the process, and information pertaining to the equipment in the process.\n\nProcess Hazard Analysis - Process Hazard Analysis requires the employer to perform an initial analysis of the process covered by this standard. The analysis correctly identifies the complexity of the process and identifies, evaluates and controls hazards involved in the process. Employers are required to determine and document the priorities for conducting a process hazard analysis based on a rationale, which includes considerations as to extent of the process hazards, number of potentially affected employees, age of the process and operating history of the process.\n\nOperating Procedures - The employer shall develop and implement written operating procedures that provide clear instructions for safely operating the equipment in the process. \n\nTraining - Any employee operating a process or about to be involved in operating a process must be trained in an overview of the process as well as in safe operating procedures. The training must include specific safety and health hazards, emergency shutdown, and safe work practices applicable to the employee?s job tasks. Employers are required to provide refresher training and documentation at a minimum of three-year intervals.\n\nMechanical Integrity - The employer shall establish and implement written procedures to maintain the ongoing integrity of process equipment and training. Training in process maintenance activities shall be an ongoing process and be applicable to an employee?s job tasks. Equipment such as pressure vessels, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps shall be subject to the guidelines of this section. Inspection and testing of the above-mentioned systems shall be conducted correctly, frequently, and documented. \n\nManagement of Change - The employer must establish and implement written procedures to manage changes (except for replacements in kind) to process chemicals, technology, equipment, and procedures, as well as changes to procedures that affect a covered process.\n\nPre-startup Safety Review - A pre-startup safety review is required for new facilities and modified facilities when modification is significant enough to require a change in process safety information. The review must be performed before the introduction of hazardous materials.\n\nCompliance Audit - The employer shall certify that they have evaluated the RMP for compliance with the previsions of the regulation at least every three years. The compliance audit is conducted to verify that the procedures and practices developed under the regulations are adequate and are being followed.\n\nIncident Investigation - The employer shall investigate each incident, which resulted in, or could have resulted in a catastrophic release of highly hazardous chemicals in the workplace. The investigation must take place within 48 hours following the incident by an established and knowledgeable team able to analyze the incident. A report shall be prepared that describes the problem. The employer will promptly address the incident and take corrective action. All personnel whose job tasks are relevant to the incident findings shall review the report. The report shall be retained for 5 years.\n\nEmployee Participation - Employers shall develop a written plan of action regarding the implementation of the employee participation. Employers shall consult with employees and their representatives on the conduct and development of process hazards analyses. Employees shall be given access to information.\n\nHot Work Permits - A hot work permit shall be issued prior to hot work operations (welding) on or near a covered process. The hot work permit must document that fire protection and prevention measures are in place prior to beginning hot work. The permit shall be kept on file until completion of hot work operations. \n\nContractors - Contractors performing maintenance, repair, turnaround, major renovation, or specialty work on or adjacent to a covered process shall be evaluated for safety performance. The employer shall inform the contract employees of known potential fire explosion or toxic release hazards as well as an emergency action plan.\n\nEmergency Response - The employer shall establish and implement an emergency action plan for the entire plant in accordance with the provisions of CAL ARP Article 7, and 29 CFR 1910.38(a). In addition, the emergency action plan shall include procedures for handling small releases. Employers covered under this standard may also be subject to the hazardous waste and emergency response provisions contained in 29 CFR 1910.120 (a), (p), and (q)\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000042302,
                  "PreventionProgram3ID": 1000035779,
                  "ProcessChemicalID": 1000049192
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000033569,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2013-03-15 00:00:00",
    "ERTrainingDate": "2013-03-21 00:00:00",
    "CoordinatingAgencyName": "Monterey County HD, EHD",
    "CoordinatingAgencyPhone": "8317554505",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033569,
      "SummaryText": "A.    EXECUTIVE SUMMARY\n\n[40 CFR 68.155; CALARP 2745.3]\n\nThe Risk Management Program at GreenGate Fresh is designed to prevent the occurrence and minimize the consequences of releases of anhydrous ammonia from the refrigeration process. Following is a summary of the programs, policies, and procedures in place to reduce the risk of a hazardous materials release.\n\nThe purpose of this RMP is threefold: 1.) to prevent unwanted releases of hazardous chemicals, especially into locations that could expose employees and others to serious hazards, 2.) to identify hazards associated with the use of Anhydrous Ammonia, and 3.) to provide procedures to minimize the risks involved with handling this material. \n\nGreenGate Fresh has implemented the Risk Management Plan (RMP) at the Salinas, California facility in order to comply with the regulations, and to fulfill this facility's responsibility to protecting its employees, equipment, property, the surrounding community, and the environment from accidental releases of anhydrous ammonia.\n\n1.    Release Prevention and Emergency Response Policy\n\nGreenGate Fresh LLLP operates a fresh salad processing and shipping facility in Salinas, California. Risk prevention and emergency response procedures are in place at this facility, as documented here. GreenGate Fresh hires outside contractors to maintain the ammonia refrigeration equipment to prevent accidents. The Emergency Response Plan in Appendix K lists the responsible personnel and the policies for responding to an accident involving the regulated substance.\n\nThere are both portable and fixed refrigeration systems onsite and all have safeties to detect unsafe operating conditions. Fixed and portable equipment support the cold storage rooms, processing facility, and vacuum pre-cooling equipment. The portable equipment located outdoors has no detection system; however, there is an ammonia sensor located at the diffusion tank that is tied into the detection alarm system.  Fixed equipment is loca"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033569,
      "SummaryText": "ted within the facility and includes the fan coil units and piping. Operators monitor the system when it is operational. \n\nGreenGate Fresh utilizes inspection procedures to review refrigeration equipment prior to startup and during operations.  These procedures identify potential sources of release and equipment corrections required to prevent these releases.  Onsite personnel and certified refrigeration contractors review the equipment as required.\n\nOnsite personnel will provide limited initial emergency response. Onsite personnel will make a preliminary assessment in the event of a release and will provide any necessary first response within the limits of operators' training and capabilities. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down, to prevent or reduce an off-site release. \n\nNo emergency operations will be performed that are beyond the capabilities of the operators or other onsite personnel. \n\nLocal fire and police departments with mutual aide response will provide emergency response for a major release event.  The refrigeration contractor is also on-call to provide emergency response. Emergency contact information is included in Section V of this document.\n\nEmergency response training will be conducted yearly for current employees and as required for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years. Master templates for documenting training are in Appendix G. These may be reproduced as needed. \n\n2.    Description of Stationary Source and Substance Handled\n\nThe GreenGate Fresh facility is located at 1222 Merrill Street in Salinas, California. The new facility was constructed under applicable codes and industry standards.\n\nThis facility utilizes anhydrous ammonia as a refrigerant in their process operations. Ammonia is the only listed material used at this facility. The plant operates with a total charge of approximately 16,500 lbs. of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033569,
      "SummaryText": " ammonia distributed throughout the facility. The ammonia refrigeration systems are used for vacuum cooling, produce cooling and cold storage prior to shipment. \n\nThe ammonia refrigeration-system equipment at the facility consists of both fixed and portable equipment. The refrigeration system configuration includes two compressor skids, three water chiller skids, a high-pressure receiver/condenser skid, fan coils, and safety equipment. The refrigeration system is a single-stage vapor compression cycle. In general, the process chemistry is as follows:\n\n1.    Low pressure vapor is compressed to high pressure gas by refrigeration compressors.\n\n2.    High pressure vapor is condensed to high pressure liquid by the evaporative condenser.  Condensation occurs because of heat rejection to ambient resulting from the evaporation of water sprayed on the condenser coil.\n\n3.    High pressure liquid gravity feeds from the condenser to the high pressure receiver where it is stored until needed.\n\n4.    High pressure ammonia is fed from the high pressure receiver to the low pressure vessels.  This is made possible by the pressure differential between the two types of vessels.  Pressure is dropped when the liquid passes through an expansion device located between the high and low pressure vessels.\n\n5.    The evaporators are recirculation types where low pressure liquid is pumped from low pressure receiver. The evaporators are room coils for maintaining cold room or freezer storage temperatures.\n\n6.    Evaporation of the low pressure liquid occurs due to warmer air coming in contact with the evaporators. The evaporation produces the cooling effect.  \n\nA mixture of liquid and vapor is returned to the low pressure vessel. Low pressure vapor is drawn off by the compressors and the liquid is circulated back through the room coils. \n\nThe refrigeration systems consist of the following equipment:\n\n?    Compressors,\n\n?    Low pressure receivers,\n\n?    A high pressure receiver,\n\n?    Evaporative cooling condensers,\n\n?    Air "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033569,
      "SummaryText": "cooling evaporators,\n\n?    An ammonia diffuser tank,\n\n?    Ammonia pumps,\n\n?    Water pumps,\n\n?    Water chillers,\n\n?    Oil separators,\n\n?    Oil coolers,\n\n?    Electric controls,\n\n?    A refrigeration control panel, and\n\n?    An emergency electric shut-off switch.\n\nThe Ammonia Refrigeration Safety Inspection (IIAR) Checklists, located in Appendix A, describe equipment details. A complete set of system drawings is in the RMP Binder. \n\nThe substance handled at GreenGate Fresh, anhydrous ammonia (NH3), is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue.  The gas is pungent and may cause suffocation, as shortness of breath and labored breathing can develop if inhaled.  Prolonged inhalation of high concentrations may cause bronchitis and/or pneumonia, with some residual reduction in pulmonary functions.  Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain, and serious skin burn.  A Material Safety Data sheet (MSDS) for ammonia is included in the RMP binder.  Written in both Spanish and English, the MSDS details the chemical properties and health hazards of anhydrous ammonia.\n\n3.    Accidental Release Prevention Program\n\nGreenGate Fresh maintains an accidental release prevention program designed to eliminate or minimize ammonia releases.  The program includes equipment monitoring, regular inspections and maintenance, and log keeping of operating conditions, scheduled maintenance, emergency response, and operator training.\n\nThe program also consists of pre-startup inspection, emergency response, and regular training. A Process Hazards Analysis (PHA), was performed in January 2013. Prior to start up, an engineering walk-through was performed that included a thorough review of the refrigeration equipment and safety systems. In addition to visual inspections, pre-startup and code compliance reviews were performed. These reports are included in Appendix P and J, in the RMP binder located at the facility."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000033569,
      "SummaryText": " Recommendations for follow-up were made on the basis of criticality to the safe and efficient operation of the system. \n\nThe ammonia refrigeration-operation system has specific safety controls in place to prevent accidental release. Green Gate contracts with Hasler Refrigeration for operations and maintenance. They are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency evacuation and response procedures in the event of an ammonia release. \n\nAn alarm and detection system monitors the facility for unsafe ammonia concentration levels and for operating conditions outside of safety set points.  Relief valves are installed to protect both the high and low sides from an overpressure situation.  Relief valves are piped to a diffusion tank, which provides a system-wide mitigation measure.  Compressors have control panels, which will automatically shut down the compressors if pressure and temperature set points are exceeded.  An emergency control box allows system pressures to be relieved without releasing to the ambient.  Additional information about the ammonia detection system may be found in Appendix O in the RMP binder.\n\n4.    Process Hazard Analysis\n\nA thorough review of the system including a \"What If\" Process Hazard Analysis (PHA) was performed for this facility and is included in the RMP Binder. \n\n5.    Training\n\nSafety and equipment operational training is conducted on a yearly basis and includes equipment operational procedures, emergency response procedures, review of Risk Management Plan Procedures, Hazardous Materials Business Plan Procedures, and evacuation procedures. Additional items requiring further review, correction, and/or updating are identified and presented at tailgate meetings. Sample training forms are included in Appendix G in the RMP binder. \n\nEmergency response training will be conducted yearly for current employees and as required for new employees. Records will be kept of all training performed"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000033569,
      "SummaryText": " at the site for a minimum of five (5) years. \n\n6.    Updates\n\nUpdates to the RMP are required and discussed in Section VI in the RMP binder. In general, refrigeration equipment will be inspected and reviewed regularly and as new equipment becomes operational onsite.  When a significant change occurs, the RMP shall be updated to reflect the change. Any management changes must also be updated. The RMP, which includes accident prevention procedures for the ammonia refrigeration system, is maintained onsite., and is also submitted electronically to the EPA Central Data Exchange (CDX.) A copy of the initial registration is included in Appendix P in the RMP binder.\n\n7.    Five-Year Accident History\n\nThis is a new facility. Releases of ammonia, should they occur, will be responded to in accordance with company policy and the procedures outlined in this RMP.\n\n8.    Emergency Response Program\n\nGreenGate Fresh has implemented the State and County mandated emergency response plan (Business Response Plan.) This plan outlines procedures for emergency ammonia release response, as well as general response. Section V in the RMP binder outlines emergency response procedures at this facility.\n\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The emergency coordinator is responsible for contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if offsite evacuations are required.\n\nThe emergency response program consists of the following elements:\n\n?    Contact phone numbers for emergency coordinator and emergency contacts\n\n?    Notification procedures\n\n?    Hazardous material incident response to ammonia releases and other incidents\n\n?    Coordinator and personnel responsibilities\n\n?    Releases to be reported\n\n?    Evacuation p"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000033569,
      "SummaryText": "lans\n\n?    Emergency response checklist\n\n?    Emergency shutdown procedures\n\n?    Emergency response training\n\nSee Section V and Appendix K in the RMP binder for additional information about the program.\n\n9.    Planned Changes to Improve System Safety\n\nThe safety program is in place to prevent accidents at the Green Gate Fresh facility. This program includes equipment monitoring, regular inspections and maintenance, and log keeping of (1) operating conditions, (2) scheduled maintenance, (3) emergency response, and (4) operator training. There are also regularly scheduled safety training sessions for all employees. Annual training sessions include equipment operational procedures, emergency response procedures, review of general Risk Management Plan procedures, review of Emergency Response Plan procedures, and evacuation procedures. These elements of the accidental release program are central to plant safety. \n\nThis is a new facility; however, GreenGate is bringing equipment onsite from a previous site. Safety improvements to the equipment were identified at the previous facility. These improvements were implemented prior to the closing of the facility. Additional safety improvements may be identified during the upcoming system review.\n\nGreen Gate Fresh welcomes employee comments for improvements to safety and will implement changes when they are indicated in order to assure the health and well-being of the employees and nearby residents.\n\n"
    }
  ]
}