{
  "FacilityID": 1000012012,
  "FacilityName": "Mid-Georgia Cogen",
  "FacilityStr1": "200 Oaky Woods Road",
  "FacilityStr2": "PO Box 160",
  "FacilityCity": "Kathleen",
  "FacilityState": "GA",
  "FacilityZipCode": "31047",
  "Facility4DigitZipExt": "1047",
  "FacilityCountyFIPS": "13153",
  "LEPC": "Georgia Title III LEPC",
  "FacilityLatDecDegs": "32.485160",
  "FacilityLongDecDegs": "-083.604120",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "kcharles@camsops.com",
  "FacilityDUNS": 160051249,
  "ParentCompanyName": "Mid-Georgia Cogen Limited Partnership",
  "Company2Name": null,
  "CompanyDUNS": 160051249,
  "Company2DUNS": 0,
  "OperatorName": "Mid-Georgia Cogen Limited Partnersh",
  "OperatorStr1": "200 Oaky Woods Road",
  "OperatorStr2": "PO Box 160",
  "OperatorCity": "Kathleen",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31047",
  "OperatorZipCodeExt": "1047",
  "FTE": 12,
  "OtherEPAFacilityID": "110000359969",
  "EPAFacilityID": "100000041171",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "49311530042V04",
  "SafetyInspectionDate": "2004-11-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-12-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-12-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-12-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.48578,
  "FRS_Long": -83.60303,
  "FRS_Description": null,
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014729,
      "AltID": null,
      "FacilityID": 1000012012,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000017092,
          "ProcessID": 1000014729,
          "ChemicalID": 57,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000015071,
          "ProcessID": 1000014729,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000012012,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2004-03-01 00:00:00",
    "ERTrainingDate": "2004-04-01 00:00:00",
    "CoordinatingAgencyName": "Houston County Fire Department",
    "CoordinatingAgencyPhone": "4785422040",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "CAAA TRI Chemicals"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012012,
      "SummaryText": "1. INTRODUCTION\n\nMid-Georgia Cogen (MGC) is owned by Mid-Georgia Cogen Limited Partnership.  The facility is managed and operated by CAMS.  MGC is a cogeneration facility located in Kathleen, Georgia that is subject to U.S. EPA regulations governing Accidental Release Prevention (ARP) Requirements: Risk Management Programs under Section 112(r) of the Clean Air Act (40 CFR Part 68).  This Risk Management Plan (RMP) has been developed in accordance with the requirements specified under 40 CFR Part 68, Subpart G. This RMP certifies that MGC has instituted a Risk Management Program at the facility that is in compliance with U.S. EPA ARP requirements. \n\nThe RMP includes an Executive Summary and Data Elements following the format published by U.S. EPA.  In addition to identifying the applicable corporate policies and risk management systems, this RMP document identifies the worst case release scenario and the facility's five year accidental release history.\n\n\n\n 2. ACCIDENTAL RELEASE PREVENTION POLICIES\n\n2.1. RISK MANAGEMENT POLICIES\n\nIt is the policy of MGC management to implement the requirements of the Risk Management Program (RMP) in accordance with the USEPA regulations under 40 CFR Part 68.  The objective of this program is to minimize the risk of a release of a hazardous material and, if a release were to occur, to minimize the potential impact to MGC employees, the public and the environment.  \n\nThis objective will be accomplished by utilizing good operating procedures, providing appropriate training to all employees, and coordinating response activities, as necessary, with the local emergency response providers.  MGC's management is committed to providing the resources necessary to implement this policy.  Further, the MGC management recognizes that it has a duty to protect its employees and neighbors from the effects of all dangerous chemicals.\n\n2.2. RISK MANAGEMENT SYSTEM\n\nThe MGC facility has developed a management system to implement and maintain compliance wit"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012012,
      "SummaryText": "h the ARP Program and related chemical safety and emergency response programs.  At the MGC facility, the Plant Manager has primary responsibility for implementing and ensuring compliance with the ARP Program. Other individual employees will assist the Plant Manager with various aspects of the program as required.\n\n\n\n 3. PROCESSES AND SUBSTANCES SUBJECT TO 40 CFR 68\n\n3.1. FACILITY OVERVIEW\n\nThe MGC facility is a combined-cycle cogeneration facility which produces electric power for sale primarily to Georgia Power Corporation and process steam to a neighboring industrial host. The facility consists of two combustion turbines rated at 106.5 megawatts (MW) each of electric output. Waste heat from the turbine exhaust gases is passed through a heat recovery steam generator to generate steam. Natural gas is the facility's primary fuel, with No. 2 distillate oil used as a backup fuel. \n\nThe combustion turbine design includes Best Available Control Technology (BACT) for the control of nitrogen oxide emissions. The BACT control technologies for the control of nitrogen oxides include Dry Low NOx (DLN) combustors and Selective Catalytic Reduction (SCR). SCR is a process which involves the post-combustion removal of nitrogen oxides from the combustion flue gas with a catalytic reactor. In the SCR process, aqueous ammonia, which is injected into the turbine exhaust gas stream, reacts with the nitrogen oxides and oxygen in the exhaust gas stream to form nitrogen and water.\n\nIt is this aqueous ammonia (CAS No. 7664-41-7) which is a regulated substance under 40 CFR 68 and present at the site in amounts greater than the threshold quantity.\n\n3.2. AQUEOUS AMMONIA PROCESS DESCRIPTION\n\nAmmonia is present at the facility in the form of an aqueous solution in concentrations ranging up to 30 percent. The aqueous ammonia is delivered to the site via tank truck and stored in an above ground tank with a maximum capacity of 16,085 gallons (36,240 pounds at the maximum concentration of 30%). The"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012012,
      "SummaryText": " tank is surrounded by a dike of sufficient volume to completely contain any spill from the storage tank. A piping system (both above and below ground) is used to deliver the ammonia to the combustion turbines. Prior to injection into the combustion turbine exhaust gas stream, the aqueous ammonia is vaporized and injected as a gas. \n\n3.3. PROGRAM LEVEL IDENTIFICATION\n\nThe EPA Risk Management Regulation identifies three levels of requirements defined as \"programs\". EPA recognizes that some regulated processes would not pose an off-site hazard in the event of an accidental release.  Such processes are classified as Program 1. Program 1 is applicable to any process for which it can be demonstrated that the public would not be adversely affected by a release. Thus, to qualify for Program 1, a facility with a regulated toxic chemical needs to meet two criteria.  \n\n-  no release over the most recent 5-year period has resulted in off-site injury or environmental damage; and \n\n-  dispersion modeling demonstrates that a worst-case release (as defined by the regulation) will not result in concentrations at public receptors that exceed the toxic endpoint.\n\nThe facility has determined that the aqueous ammonia process meets the criteria for Program 1. \n\nThe Risk Management Plan requirements for Program 1 processes are as follows:\n\n-  Registration\n\n-  Accident history\n\n-  Hazard assessment for the worst-case release\n\n-  Coordinate emergency response procedures with local emergency planning and response organizations\n\n\n\n 4. HAZARD ASSESSMENT\n\nThe Hazard Assessment under the ARP Program consists of two parts; 1) a review of the five-year accident history involving regulated substances in the covered process and 2) a modeling evaluation of the impact associated with an accidental release.  Because there have been no accidental releases during the most recent five-year period that had an off-site impact, and modeling of a worst-case release shows that off-site concentrations of aqueo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012012,
      "SummaryText": "us ammonia at the nearest public receptor would not exceed the endpoint concentration, the MGC facility is subject to Program 1 ARP Program requirements.\n\n4.1. FIVE-YEAR ACCIDENT HISTORY\n\nDuring the past 5 years there has been no accident involving aqueous ammonia or reporting under 40 CFR Part 68.  This means that no accident has resulted in reportable on-site injury, off-site injury, off-site evacuation or sheltering in place, or off-site damage to property or the environment.  Thus, the MGC facility meets the Program 1 accident history criteria.\n\n4.2. WORST-CASE\n\nThe worst-case release scenario, as defined by 40 CFR Part 68, is a sudden release of the maximum amount of a stored regulated substance from the largest single vessel. The EPA's Risk Management Program Guidance for Wastewater Treatment Plants (EPA 1998) was utilized to determine distance to the toxic endpoint for the worst-case release. In accordance with changes to the Risk Management Plan requirements promulgated in April 2004, specific information about the off-site consequence assessment is provided only in the data elements of the Risk Management Plan. Because there are no public receptors within the modeled endpoint distance for the worst-case release this process meets the worst-case modeling criteria for Program 1.  \n\n4.3. PROGRAM 1 APPLICABILITY\n\nSince the modeled endpoint distance predicted for the \"worst-case\" toxic release does not affect public receptors and no accidental release involving the ammonia system has occurred over the past 5 years that has impacted off-site public or environmental receptors, the aqueous ammonia process at the MGC facility is subject to Program 1 Accidental Release Prevention Requirements under CFR Part 68.\n\n\n\n 5. ACCIDENT PREVENTION PROGRAM\n\nBecause the aqueous ammonia process is subject to Program 1, no accident prevention program is required under 40 CFR Part 68. While a formal prevention program is not required by regulation, the facility does maintain safety"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000012012,
      "SummaryText": " information and has in-place operating and maintenance procedures, a training program, and an incident investigation policy which are all elements of a formal Program 2 Prevention Program.\n\n\n\n 6. EMERGENCY RESPONSE PROGRAM\n\nA formal emergency response program is not required under Program 1 provisions of 40 CFR Part 68. Consistent with Program 1 requirements, the MGC facility coordinates emergency response with the local emergency planning and response agencies. \n\nThe MGC facility has in-place procedures to ensure that the Houston County Fire Department is prepared to respond to an emergency at the facility. An emergency action plan is in place to ensure that the Fire Department is notified promptly in the event of an emergency and to ensure the safety of the employees. Facility personnel are not expected to A?respondA? to an emergency as defined by the OSHA HAZWPOPER Standard. Facility personnel are expected to perform incidental response activities to minimize incidental or minor releases.\n\n\n\n 7. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nAt the MGC facility, management recognizes that process safety is not only critical to facility operations but also for the safety of the employees and the community. The management system, which has been implemented at the facility, is designed to ensure that process safety is implemented on an ongoing, daily basis."
    }
  ]
}