{
  "FacilityID": 1000057877,
  "FacilityName": "Ocean State Power",
  "FacilityStr1": "1575 Sherman Farm Road",
  "FacilityStr2": null,
  "FacilityCity": "Harrisville",
  "FacilityState": "RI",
  "FacilityZipCode": "02830",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "44007",
  "LEPC": "District 1 LEPC",
  "FacilityLatDecDegs": "42.00989",
  "FacilityLongDecDegs": "-71.66879",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "16150 Main Circle Drive, Suite 310",
  "FacilityEmailAddress": "sweis@lspower.com",
  "FacilityDUNS": 931391239,
  "ParentCompanyName": "Ocean State Power, LLC",
  "Company2Name": null,
  "CompanyDUNS": 249609447,
  "Company2DUNS": null,
  "OperatorName": "Ocean State Power",
  "OperatorStr1": "1575 Sherman Farm Road",
  "OperatorStr2": null,
  "OperatorCity": "Harrisville",
  "OperatorStateFIPS": "RI",
  "OperatorZipCode": "02830",
  "OperatorZipCodeExt": null,
  "FTE": 33,
  "OtherEPAFacilityID": "RID987479003",
  "EPAFacilityID": "100000121637",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "RI-15-12",
  "SafetyInspectionDate": "2019-03-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-09-23 14:02:12",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-06-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.01,
  "FRS_Long": -71.669444,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072327,
      "AltID": "Aqueous Ammonia Handling",
      "FacilityID": 1000057877,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089255,
          "ProcessID": 1000072327,
          "ChemicalID": 57,
          "Quantity": 897600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000073508,
          "ProcessID": 1000072327,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000045464,
              "Process_NAICS_ID": 1000073508,
              "SafetyReviewDate": "2019-03-12 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "API 620",
              "FR_Comments": "Equipment was designed per applicable standards and is operated in accordance with such standards",
              "HazardReviewDate": "2016-05-30 00:00:00",
              "ChangeCompletionDate": "2016-12-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Bermed area",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-05-30 00:00:00",
              "TrainingReviewDate": "2016-05-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-05-30 00:00:00",
              "EquipmentInspectionDate": "2016-05-02 00:00:00",
              "EquipmentTested": "Annual inspection of ammonia system pump, quarterly calibration of flow transmitters and ammonia detectors",
              "ComplianceAuditDate": "2019-01-21 00:00:00",
              "AuditCompletionDate": "2019-10-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000046250,
                  "PreventionProgram2ID": 1000045464,
                  "ProcessChemicalID": 1000089255
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000057877,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-12-23 00:00:00",
    "ERTrainingDate": "2016-05-19 00:00:00",
    "CoordinatingAgencyName": "Harrisville Fire Department",
    "CoordinatingAgencyPhone": "4015685110",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Clean Air Act Regulations (and subsequent state-issued regulations)",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057877,
      "SummaryText": "1.0  EXECUTIVE SUMMARY\r\n\r\nThis document has been prepared to demonstrate how Ocean State Power's (OSP's), Harrisville, Rhode Island facility complies with the requirements set forth under EPA's Chemical Accidental Prevention Provisions (40 CFR 68).  This plan has been developed specifically to address the requirements applicable to the storage and use of aqueous ammonia at the OSP facility.  Each of the following sections provides a general overview of the requirements and defines OSP's design attributes, documentation, and actions that are established to comply with those requirements.  This document does not replicate that information, but rather provides cross- references to the appropriate existing documentation.  In those instances where information was developed specifically to comply with the Part 68 requirements, that information is contained in this document.\r\n\r\nCorporate Commitment to Safety\r\n\r\nOSP is committed in providing to all employees a work environment that is free from recognized health and safety hazards.  Accordingly, OSP's goal is achieving and sustaining zero accident tolerance through communication, information, and training.  To this end, OSP is dedicated to the concept that all employees receive the proper orientation and are provided with the means necessary to ensure the environment remains as safe and healthful as possible.\r\n\r\nIt is the policy of OSP to:\r\n\r\n¿\tProvide safe working conditions, proper tools, and personal protective equipment\r\n¿\tComply with all federal, state, and local occupational health and safety laws and regulations\r\n¿\tProvide and sustain a high level of commitment to insuring that all employees have a safe and healthful work environment in which to work\r\n¿\tEnsure, through training and when necessary disciplinary action, that all employees work in a safe manner\r\n¿\tEducate and/or train all employees in safe work practices, and ensure that each employee fully understands his or her job and the tools, techniques, and method"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057877,
      "SummaryText": "s to reduce the risk to himself or herself and their co-workers\r\n¿\tEncourage all employees to \"Think Safety,\" so that safety habits developed and practiced at work carry through to non-work related activities\r\n\r\nThe facility aims to produce electricity as efficiently as possible while minimizing the use of toxic materials wherever and whenever prudent.  Where toxics cannot be eliminated, such as in the case of aqueous ammonia, necessary for controlling air emissions, improving controls to handle these substances will be explored and implemented wherever possible.  \r\n\r\nOcean State Power has an active emergency prevention and response program specifically tailored for the facility.  In addition, a Facility Response Plan/Emergency Response Action Plan incorporates applicable safety and environmental regulations.  It is the responsibility of plant management to carry out these programs.\r\n\r\nThe first duty of OSP employees is to exercise care in the performance of work tasks to prevent an accident to self, co-workers, the public, or equipment.  Safety-consciousness must take precedence over expedience, and is required as a condition of continued employment of all employees at all levels of the organization.\r\n\r\nFacility Description\r\n\r\nOSP is a 560 megawatt (MW) combined cycle turbine electric generating facility.  Figure 1 provides an orthographic photo for the site and Figure 2 provides an equipment layout.  The area surrounding the plant is gated and public access is restricted.  Natural gas, the primary fuel, is delivered by either Tenneco or Algonquin pipelines to metering stations located at the northeast property boundary.  In 2015, OSP brought back dual-fuel capability and now stores up to 2,000,000 gallons of ultra-low sulfur diesel onsite in two steel 1,000,000 gallon tanks.  \r\n\r\nThe power plant consists of two identical phases.  Each phase includes two GE Frame 7EA combustion turbine generators, two heat recovery steam generators (HRSG)/boilers with supplemental"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057877,
      "SummaryText": "firing using duct burners, and one steam turbine generator.  Auxiliary equipment includes an electrical switchyard, wet mechanical cooling towers, and a zero discharge water treatment system.  Other facility components include selective catalytic reduction (SCR) systems; two 150-foot concrete stacks equipped with continuous emissions monitoring systems; two emergency diesel generators; and oil and chemical storage.  The plant is operated from the control room.  Operators have access to plant operating data from the computerized distributed control system (DCS) and a central data acquisition and handling system (DAHS).\r\n\r\nAqueous ammonia (29%) is the only regulated substance used in a process that is above the RMP threshold quantity.  Ammonia is used as a reducing agent for the SCR NOx emissions control system for the combustion turbines.  Aqueous ammonia is evaporated in hot air and injected into the flue gases upstream of a catalyst located in the heat recovery boilers to convert NOx emissions into nitrogen and water.  The amount of ammonia injected and the NOx/NH3 emissions in the exhaust stack gases are continuously measured and recorded.  The SCR system is comprised of subsystems - aqueous ammonia unloading area, a storage tank to provide four weeks capacity (e.g. 60,000 gallons), two ammonia transfer pumps (one back-up) to transfer solution to the four ammonia flow control/evaporator units, and four ammonia injection systems (one per HRSG).  The unloading area includes an unloading pump rated for eighty gallons per minute (gpm) with vapor recovery, and concrete berm to collect an accidental spill from truck delivery.  The ammonia storage tanks, of which one is active and one is backup, is located within the bermed area adjacent to the Water Treatment tank farm.  There are several interlock functions within the ammonia supply line that could activate an emergency shutoff valve.  Isolation valves and a bypass valve are provided as a contingency, should the ammoni"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000057877,
      "SummaryText": "a flow control valve have to be taken out of service.  Ammonia leak detection devices are also provided. \r\n\r\nAll other substances utilized at the facility are below 112(r) reporting thresholds and are addressed in other reporting statutes such as SARA Title III (EPCRA Tier II reporting), OSHA, etc.\r\n\r\nWorst Case and Alternative Release Scenarios\r\n\r\nOSP used EPA's Risk Management Program Offsite Consequence Analysis Guidance document, MARPLOT, and EPA's RMPComp Program to determine the distance to toxic endpoint for both the worst-case and alternative release scenarios.  The release scenario analyses accounted for EPA's recent determination that the outer wall of the ammonia tank may not be considered passive mitigation.  \r\n\r\nThe worst-case release scenario assumes failure of the aqueous ammonia storage tank that results in the total 60,000 gallons of aqueous ammonia being released in a 10-minute period.  The alternative release scenario assumes damage to the 300-gal ammonia surge tank within the unloading area berm, causing a release of its full contents to the area.  The estimated distance to the toxic endpoints are:\r\n\r\n¿\t4.5 miles for worst-case release scenario\r\n¿\t0.1 miles for alternative release scenario\r\n\t\r\nThe residential population within the worst-case scenario radius is 22,390 per the MARPLOT US Census data.  There are several potential receptors within this radius:  ten school, one hospital, three nursing homes, four recreation areas, and three sensitive environmental receptors.  The alternate release scenario is contained within the site; there are no residents or sensitive receptors within this 0.1 mile radius.  Potential receptor impacts are discussed in more detail in Section 3.0 of the document.\r\n\r\nEmergency Response Program\r\nOSP maintains an active emergency prevention and response program in accordance with applicable regulations.  The Facility Response Plan (FRP) and an Emergency Response Action Plan (ERAP) present site-specific equipment, trainin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000057877,
      "SummaryText": "g, procedures, contact information, checklists, etc. to be used in emergency response.  OSP is prepared to respond to emergencies quickly and effectively.  The primary goal is to protect the health and safety of plant personnel and the public, then to minimize damage to the environment, and then to minimize damage to plant equipment in the unlikely event of an accident.  An Incident Commander/Qualified Individual (IC/QI) is responsible for implementing and overseeing emergency response activities onsite.  If the primary IC is not available, alternate IC have received adequate training and have been delegated authority.  All managers, senior control room operators, and compliance personnel onsite have received training to serve as IC/QI if necessary.  The facility's FRP/ERAP provides actions for proper notifications within OSP's emergency response organization to activate necessary resources.  \r\n\r\nOSP has an ongoing employee health and safety training program conducted by qualified instructors.  Specific training includes Hazardous Waste Operations and Emergency Response, hazardous material handling, and ammonia-specific training.  Facility personnel are trained in functional areas that correspond to their emergency response duties and responsibilities.  Drills are conducted annually to test the procedures in the plans, verify the contact numbers, and practice deployment of spill response equipment and donning/doffing of personal protective equipment.  The goal is to exercise procedures and maintain readiness.  Integrated drills are conducted in conjunction with the Local Emergency Planning Committee, Harrisville and Uxbridge Fire Departments, state/federal regulators, and other stakeholders to coordinate offsite emergency response procedures.\r\n\r\nThe OSP facility is equipped with locally-annunciating alarms and a facility-wide public address system to alert personnel in the event of an emergency.  OSP maintains six different spill response sheds throughout the plant"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000057877,
      "SummaryText": "and a rescue trailer that contains specific confined space and hazardous waste response personal protective equipment.  These sheds and the trailer are inspected on a monthly basis and equipment is used in simulated responses during annual drills and annual HAZWOPER training.   Specific procedures that all employees must follow in the event of release can be found in the emergency site specific instructions, specifically ESSI-2 and ESSI-4 attached to this plan and in the ERAP.  These procedures include immediate notification to authorities, establishing an Incident Command Post, evacuation of personnel, and actions to be taken to stop or mitigate the emergency if it is safe to do so.\r\n\r\nProcess Hazard Analysis\r\n\r\nSite processes to store and handle ammonia have been reviewed in the preparation of this RMP.  Several areas for improvement have been identified and are being implemented.  Ammonia handling at the plant falls within several processes:  ammonia unloading, ammonia heating, and ammonia injection.  In response to these processes and deficiencies noted within our previous plan, there have been several programs added at OSP to address hazards in conjunction with processes previously in place.  These hazard analyses will be reviewed as a group to include management, compliance, operations, and maintenance every three years during ammonia-specific training; additional hazards or strategies to avoid hazardous identified will be included in the compliance audit and addressed in a timely manner. \r\n\r\nPersonnel have been trained in all ammonia system procedures, including the unloading procedure and the ammonia injection system work instructions.  The SDS for ammonia is reviewed as part of hazardous materials training.  Personnel are also trained in responding to hazardous material released, both in physical response via spill materials and appropriate PPE and in the notification procedures and ICS structure.  \r\n\r\nDuring unloading procedures, the most likely scenario f"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000057877,
      "SummaryText": "or an ammonia release, an operator is present at the truck during all activities.  There is a checklist to be completed during each delivery.  The area is cordoned off to traffic.  Personnel are outfitted in Level C PPE with full-face respirators and carry personal ammonia meters.  There is a mounted ammonia meter in the area with alarms.  Truck drivers are trained via video watched annually, with a test, on site-specific safety procedures.  Operators are outfitted with radios for contact with the Control Room in case of emergency.  The operator overseeing the unloading communicates with the Control Room prior to unloading to determine the ending liquid height in the tank and the existing level is verified.  There is an overfill alarm on the tank to the Control Room, and the relief valve on the tank is inspected annually and alarms to the Control Room if opened. \r\n\r\nCalibrations on the mounted ammonia meters, levels and level alarms, and flow transmitters will be conducted on a quarterly basis.  The tanks are inspected by on-site personnel daily, with more detailed inspections occurring quarterly.  API653 inspections will be conducted every ten years.  Exposed ammonia piping and machinery is inspected annually; every two years, the piping is non-destructively tested where needed based on observations and insulation damage, with insulation replaced on this same schedule.  \r\n\r\nDuring ammonia heating and injection, mounted ammonia sensors detect elevated concentrations in the breathable space and are equipped with visual and audible alarms.  Personnel are trained to only enter spaces where the alarm is flashing/sounding with respirators; the areas are equipped with signs.  These units alarm locally and not to the Control Room, but operators inspect the buildings at least twice per 12-hour shift.  The alarm can be heard within a wide radius of the building and response is expected to occur within that six-hour period.  In addition, the tank relief valve alarms to the Co"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000057877,
      "SummaryText": "ntrol Room, as well as the ammonia heater cooling alarm (would indicate a leak at the heater) and the emissions monitors (would indicate a loss of injection)."
    }
  ]
}