{
  "FacilityID": 1000086604,
  "FacilityName": "Alliance Midstream- Benson Terminal",
  "FacilityStr1": "300 Highway 12 NW",
  "FacilityStr2": null,
  "FacilityCity": "Benson",
  "FacilityState": "MN",
  "FacilityZipCode": "56215",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27151",
  "LEPC": "Swift County LEPC",
  "FacilityLatDecDegs": "45.311944",
  "FacilityLongDecDegs": "-095.643056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Alliance Midstream LLC",
  "Company2Name": null,
  "CompanyDUNS": 79491605,
  "Company2DUNS": 0,
  "OperatorName": "Alliance Midstream LLC",
  "OperatorStr1": "3101 3rd Avenue SW",
  "OperatorStr2": null,
  "OperatorCity": "Willmar",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56201",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000066171",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had a safety inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-04-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-04-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-04-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-04-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 45.3027,
  "FRS_Long": -95.5498,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "CENSUS-OTHER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000108031,
      "AltID": "Propane Storage & Distrib",
      "FacilityID": 1000086604,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000135074,
          "ProcessID": 1000108031,
          "ChemicalID": 98,
          "Quantity": 6500000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000109344,
          "ProcessID": 1000108031,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000091657,
              "Process_NAICS_ID": 1000109344,
              "SafetyReviewDate": "2020-03-12 00:00:00",
              "PHA_Date": "2020-03-12 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-09-12 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 1,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "IR Fire and L.E.L. Gas Detection",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-02-21 00:00:00",
              "TrainingReviewDate": "2020-02-21 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Document reviews",
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-06-27 00:00:00",
              "EquipmentInspectionDate": "2019-12-04 00:00:00",
              "EquipmentTested": "IR Fire Detection, L.E.L. Gas Detection and Manual ESD Push Buttons",
              "ChangeMgmtDate": "2013-04-10 00:00:00",
              "ChangeMgmtReviewDate": "2020-02-21 00:00:00",
              "PreStartupReviewDate": "2014-11-11 00:00:00",
              "ComplianceAuditDate": "2020-02-12 00:00:00",
              "AuditCompletionDate": "2020-08-12 00:00:00",
              "IncidentInvestigationDate": "2011-03-09 00:00:00",
              "InvestigationChangeDate": "2011-03-09 00:00:00",
              "ParticipationPlansReviewDate": "2020-02-21 00:00:00",
              "HotWorkPermitReviewDate": "2020-02-21 00:00:00",
              "ContractorSafetyReviewDate": "2016-04-12 00:00:00",
              "ContractorSafetyEvalDate": "2020-02-21 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000113916,
                  "PreventionProgram3ID": 1000091657,
                  "ProcessChemicalID": 1000135074
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000086604,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-02-06 00:00:00",
    "ERTrainingDate": "2020-02-06 00:00:00",
    "CoordinatingAgencyName": "Swift County LEPC",
    "CoordinatingAgencyPhone": "3208433133",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000086604,
      "SummaryText": "Executive Summary\n\n\n\nThe Alliance Midstream Benson Terminal has been safely handling propane at this location since 1979. Alliance Midstream, LLC is committed to maintaining the high levels of safety and operational performance of the terminal. Alliance Midstream LLC is a local company with strong ties in the community. The terminal continues to operate with the attention to detail necessary to maintain the terminal safety systems, operator activity and safety performance.\n\n\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\n\n\nThe Benson Terminal receives propane from rail tank cars at a tank car unloading facility located to the north of the terminal. The terminal is currently served by the BNSF Railway for delivery of tank cars. The tank cars are switched by terminal operators and unloaded into the terminal fixed tanks. The propane is stored on site in fixed propane storage tanks. The terminal is a fully automated terminal and is available for 24 hour truck loading by trained and qualified drivers. The terminal is equipped with multiple security systems so that only qualified and authorized drivers can gain access to the terminal and loading operations. In this process, the terminal stores the following chemicals that the EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release.\n\n\n\nToxics:\n\nThere are no listed toxic substances above EPA threshold quantitates\n\n\n\nFlammables:\n\nPropane, CAS-74-98-6\n\n\n\nThe accidental release prevention programs and contingency planning efforts help the terminal effectively manage the potential hazards posed by this product to the terminal employees, the community and the environmental by our handling of this substance.\n\n\n\n\n\nGeneral Accidental Release Prevention Program\n\n\n\nThe following is a summary of the accidental release prevention programs in place for the covered process at the facility. The process at the facility are regulated by the Envi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000086604,
      "SummaryText": "ronmental Protection Agency's (EPA's) Risk Management plan (RMP) regulations and classed as a Program Level 3. The facility is also regulated by the Occupational Safety and Health Administration (OSHA) Process Safety Management of Highly Hazardous Chemicals (PSM). This summary addresses each of the OSHA PSM\n\nelements and describes the management system in place to implement the accident prevention program.\n\n\n\n\n\nEmployee Participation\n\n\n\nAlliance Midstream has a strong culture of employee involvement in safety programs and accident prevention. The Benson terminal encourages its employees to participate in all elements of the safety management and accident prevention programs. Examples of employee participation include the daily safety briefings, safety specialist training and scheduled safety training and meetings. Management oversight provides the opportunity for any employee to raise concerns or offer suggestions for the terminal safety program and operations.\n\n\n\n\n\nProcess Safety Information\n\n\n\nThe Benson terminal has been in operation since 1979. During this time a considerable library of process safety information (PSI) has been developed for the equipment used in the process. This process does not involve any chemistry or reactive operations. The previous owners of the facility have provided documentation of previous PSM related activity and analysis. The new rail unloading facility has PSI including the site plans and primary equipment specifications and operating manuals. The propane is delivered to the site by rail tank car, storage in fixed tanks and loaded into highway cargo tanks for local delivery. The Safety Data Sheet (SDS) for the covered chemical, propane is available in the terminal office.\n\n\n\nFor the process the facility has documented safety related limits for specific process parameters (e.g. temperature, product inventory levels, pressure) in key process parameter documents. The facility ensures that the process is maintained within a safe operat"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000086604,
      "SummaryText": "ing envelope using process controls and monitoring instrument, trained operating personnel and a protective instrument system (e.g.,automated shutdown systems).\n\n\n\nThe facility maintains numerous technical documents that provide information about the design and construction of process equipment. This information includes materials of constructions, design basis, pressure and temperature ratings, and electrical classification and ratings of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspections and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not weakened.\n\n\n\n\n\nProcess Hazard Analysis\n\n\n\nThe Benson terminal has a comprehensive program to ensure that hazards associated with the process are identified and controlled. Within this program each process is systematically examined to identify hazards and to ensure that adequate engineering and administrative controls are in place to manage the hazard.\n\n\n\nThe Benson terminal completed a revalidation study of the previous process hazard analysis performed for this process on February 12, 2020. As part of the Alliance Midstream and Antea Group review of the facility, this revalidation study was closely reviewed to gain a clear understanding of past PHA efforts and to confirm that the recommendations from this study were implemented in the facility. There were no open recommendations remaining from the study. Alliance Midstream and Antea Group feel that the revalidation study is in compliance with both EPA and OSHA regulations and guidance.\n\n\n\nMoving forward, future PHA's for this facility will be conducted following the OSHA PSM guidance and following industry Best Management Practices for PHA's as recommended by the Center for Chemical Process Safety (CCPS). Future PHA's will be conducted by a team of people with operating and maintenance experience as w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000086604,
      "SummaryText": "ell as engineering expertise on this process. The team will identify and evaluate hazards of the process as well as evaluating the effectiveness of the engineering and administrative controls applied to the hazards. The team will make recommendations for improvements to the system to Alliance Midstream management.\n\n\n\nTo help ensure that the process controls and/or process hazards do not deviate from intended and design functions, the terminal will update and revalidate the hazard analysis results. These periodic reviews are conducted at least every 5 years and will be conducted on this frequency for the life of the process. The results and findings of these studies are documented and retained for the life of the process. Results of any PHA study will be provided to Alliance Midstream management for consideration and final resolution of the finding will be documented in the PHA files.\n\n\n\n\n\nOperating Procedures\n\n\n\nThe Benson terminal maintains written procedures that address the normal operations of the rail unloading process, the management of product inventory and movement within the facility, truck rack operations and facility maintenance activity. These procedures include instructions to operators for initial startup, normal operations, temporary operations, emergency shutdown and normal shutdown. The procedures are a basis for operator training and are available to operators for reference. The procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process.\n\n\n\nThe operating procedures also include key process parameters that provide guidance on how to respond to operating system parameter excursions for specific process or equipment operations. This information , along with written operating procedures being readily available to operators in the process unit and for other personnel to uses as necessary to"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000086604,
      "SummaryText": " safety perform their job tasks.\n\n\n\n\n\nTraining\n\n\n\nManagement and employees operating the Benson terminal have completed a comprehensive training program including hazard recognition, safe work practices, the process specific operating procedures and emergency response plan actions. The training is offered in a multi-mode presentation with demonstration, classroom and hands on instruction. All training is documented and includes written and operational observation testing methods. Training will be maintained by any employee operating the unloading, fixed storage or truck loading operations. Training for the inspection and maintenance of covered processes is also provided ad documented for the applicable employee.\n\n\n\n\n\nContractors\n\n\n\nThe Benson terminal uses contactors to supplement its workforce during periods of increased maintenance or construction activities. Contractors who work on or near process covered equipment are reviewed to ensure their competency to perform the work, the necessary experience and skill for the work and any required training and certification needed for the covered work. The terminal manager will ensure that the contractor perform their work in a safe manner. The terminal manager has the authority to halt any unsafe activity. Alliance Midstream will evaluate the contactor safety program and performance as a part of the selection process. Facility personnel will periodically monitor contractor performance to ensure that contractors are fulfilling the safety obligations.\n\n\n\n\n\nPre Startup Safety Review\n\n\n\nSavage Services conducted a Pre Startup Safety Review (PSSR) for the entire facility as part their new operating role at the terminal. The PSSR ensured that the safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing equipment into service. Since the fixed storage and truck loading rack have been in service for some time, the PSSR will focused upon the new rail tank car unloading facility. "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000086604,
      "SummaryText": "The PSSR documentation from the existing facility has been reviewed and confirmed as part of the Alliance Midstream and Savage Services operations. The PSSR will be documented and maintained in the terminal files.\n\n\n\n\n\nMechanical Integrity\n\n\n\nThe Benson terminal has well-established practices and procedures to maintain pressure vessels, piping system and relief and vent systems, control, pumps and compressors and emergency shutdown systems, in a safe operating condition. The basic aspects of this program include: conducting training, developing written procedures, preforming inspections and tests, correcting identified deficiencies and applying quality assurance measures. The previous inspection and test schedule long used for the facility has continued by Alliance Midstream and currently use both operator and contractor resources to accomplish necessary tasks.\n\n\n\n\n\nSafe Work Practices\n\n\n\nThe Benson terminal has numerous effective procedures for ensuring safe work practices within the terminal by contractors, employees and truck drivers. These include access control measures, a lockout/tag out procedures to ensure isolation of energy sources for equipment undergoing maintenance or testing, a process for moving hazardous chemicals from process equipment and piping prior to opening any line or equipment that could cause and employee exposure or product release, a permit system for any spark producing activity and a confined space entry permit procedure. These procedures combined with employee training form a system to help ensure that operations and maintenance activities are performed safely.\n\n\n\n\n\nManagement of Change\n\n\n\nThe Benson terminal has a management of change program to manage changes to the covered process. A review of the existing MOC procedures show a robust and mature system that is effective in managing changes. Alliance Midstream will make necessary changes to these procedures to ensure that the levels of process safety are maintained. Use of the MOC pr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000086604,
      "SummaryText": "ocedure will help ensure that demonstrated and design levels for safety are not eroded or compromised as a result of a proposed change to the process equipment or procedures.\n\n\n\n\n\nIncident Investigation\n\n\n\nAlliance Midstream has a strong incident investigation procedure designed to develop fact based reporting of injuries, releases or accidents and near miss events related to this covered process. The investigation procedure includes involvement of local management, employees and other involved parties to develop a clear understanding of the incident and to identify the root cause with contributing factors. The investigation process includes documentation of the event and corrective and preventative measures. The results of investigations are shared with both management and other affected stakeholders.\n\n\n\n\n\nCompliance Audits\n\n\n\nTo help ensure that the accident prevention program is functioning as designed, the Benson terminal will periodically conduct an internal audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. All operating staff of the terminal participate in the audits and may include outside recourses to ensure compliance with both the regulatory requirements of the RMP and PSM programs and corporate HS&E requirements.\n\n\n\nThe results of the internal audits will be documented and shared with the terminal personnel and Alliance Midstream management.\n\n\n\n\n\nChemical Specific Prevention Steps\n\n\n\nThe processes at the Benson Terminal have hazards that must be managed to ensure continued safe operations. The following is a description the key safety features applicable to prevention of accidental release of regulated substances in this facility. This listing is not exhaustive of all prevention activity for the terminal. The terminal has specific safety features on units to help contain and control the release, quickly detect a release and to r"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000086604,
      "SummaryText": "educe the consequences of the release.\n\n\n\nRelease Detection- the facility has hydrocarbon detections with alarms and control interface to other systems.\n\n\n\nRelease containment and control systems include process relief valves on fixed tanks to control potential overpressures, isolation valves on individual rail car spots, the loading racks and for each tank. Additional containment and control measures include automatic shutdown systems and redundant instrumentation and equipment.\n\n\n\nTo mitigate a product release the terminal has developed an emergency response plan and coordinated with local emergency responders to safety handle a product release event at the terminal.\n\n\n\n\n\nFive Year Accident History\n\n\n\nA review of terminal documentation show no accidents meeting the definition of a release within the past 5 year.\n\n\n\n\n\nEmergency Response Program\n\n\n\nThe terminal has developed a comprehensive Emergency Action Plan to protect terminal staff, the community and the environment. The EAP includes incident alarm, notification and protective actions to be taken by the terminal personnel. The plan includes likely scenarios including weather related events, product release, fire and personal injury. The EAP is reviewed by all operating personnel and is shared with local emergency responders.\n\n\n\nThe overall emergency response program for the Benson terminal is coordinated with the Benson Fire Department and the Swift County Local Emergence Planning Committee (LEPC). This coordination includes periodic meetings of the committee. The facility will conduct periodic terminal reviews and orientation with local responders.\n\n\n\nRMP Record:\n\nInitial Alliance Midstream submittal: 04/07/2020"
    }
  ]
}