{
  "FacilityID": 1000014847,
  "FacilityName": "Addis Plant A",
  "FacilityStr1": "9750 LA-1 South",
  "FacilityStr2": null,
  "FacilityCity": "Addis",
  "FacilityState": "LA",
  "FacilityZipCode": "70710",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22121",
  "LEPC": "West Baton Rouge Parish LEPC",
  "FacilityLatDecDegs": "30.325970",
  "FacilityLongDecDegs": "-91.260613",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "C-K Tech, Inc.",
  "Company2Name": "Shintech Louisiana, LLC",
  "CompanyDUNS": null,
  "Company2DUNS": 65095390,
  "OperatorName": "Shintech Louisiana, LLC",
  "OperatorStr1": "P.O. Box 358",
  "OperatorStr2": null,
  "OperatorCity": "Addis",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70710",
  "OperatorZipCodeExt": null,
  "FTE": 55,
  "OtherEPAFacilityID": "LAR000056416",
  "EPAFacilityID": "100000173509",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "2639-V5",
  "SafetyInspectionDate": "2006-06-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-10-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-10-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-10-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-10-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 30.325882,
  "FRS_Long": -91.261732,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018647,
      "AltID": "PVC Plant",
      "FacilityID": 1000014847,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000022111,
          "ProcessID": 1000018647,
          "ChemicalID": 101,
          "Quantity": 33500000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000022112,
          "ProcessID": 1000018647,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000018987,
          "ProcessID": 1000018647,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000015337,
              "Process_NAICS_ID": 1000018987,
              "SafetyReviewDate": "2010-01-17 00:00:00",
              "PHA_Date": "2006-01-05 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Level controls, automatic pressure & temperature controls",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Fire monitors",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-01-21 00:00:00",
              "TrainingReviewDate": "2010-01-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-07-01 00:00:00",
              "EquipmentInspectionDate": "2010-06-27 00:00:00",
              "EquipmentTested": "Gas Holder PHL 302 mechanical integrity inspection",
              "ChangeMgmtDate": "2006-12-29 00:00:00",
              "ChangeMgmtReviewDate": "2010-04-19 00:00:00",
              "PreStartupReviewDate": "2009-12-29 00:00:00",
              "ComplianceAuditDate": "2010-06-24 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-01-05 00:00:00",
              "HotWorkPermitReviewDate": "2010-01-07 00:00:00",
              "ContractorSafetyReviewDate": "2010-01-03 00:00:00",
              "ContractorSafetyEvalDate": "2010-01-07 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000018362,
                  "PreventionProgram3ID": 1000015337,
                  "ProcessChemicalID": 1000022111
                },
                {
                  "PrimaryKey": 1000018363,
                  "PreventionProgram3ID": 1000015337,
                  "ProcessChemicalID": 1000022112
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014847,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2010-01-03 00:00:00",
    "ERTrainingDate": "2010-02-10 00:00:00",
    "CoordinatingAgencyName": "West Baton Rouge Parish LEPC",
    "CoordinatingAgencyPhone": "2253561577",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014847,
      "SummaryText": "SHINTECH LOUISIANA, LLC\nADDIS PLANT A\n\nRisk Management Plan\n\nLDEQ Facility ID No. 330\n\n1.0\tEXECUTIVE SUMMARY\n\nShintech Louisiana, LLC (Shintech) operates a Polyvinyl Chloride (PVC) Manufacturing Facility (Addis Plant A facility) located near Addis, Louisiana. This facility has been designed in a manner that minimizes the potential for accidental releases. Shintech is committed to operating this facility in a manner that is safe for the plant workers, the public, and the environment. Shintech has many years of experience and an excellent environmental and safety track record in the production of polyvinyl chloride. Shintech strives to protect and promote the health and safety of its employees, its neighbors, and others who may be affected by activities at the facility, and to limit adverse effects on the physical environment in which its activities are carried out. Shintech has established systems to help ensure safe operation of the processes at this facility. One part of these systems is a risk management program (RMP) that helps manage the risks at the Addis Plant A facility and that complies with the requirements of the Environmental Protection Agency's (EPA's) rule 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule), and the Louisiana Department of Environmental Quality regulation (LAC 33:III.Chapter.59). One of the requirements of the RMP rule is to submit a risk management plan (RMPlan) describing the risk management program at the Addis Plant A facility. An initial RMPlan for the Addis Plant A facility (formerly referred to as the Shintech Facility) was submitted to EPA in November 2000.  In accordance with 40 CFR 68.190, the facility's RMPlan has been revised and updated as necessary.  To satisfy the requirements of 40 CFR 68.165, an offsite consequence analysis for chlorine and vinyl chloride is being submitted in the RMP information.  This document is intended to satisfy the RMPlan executive summary require"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014847,
      "SummaryText": "ment of the RMP rule and to provide the public with a description of the risk management program at the Addis Plant A facility.\n\n1.1 \tAccidental Release Prevention and Emergency Response Policies\n\nShintech is committed to minimizing potential risks to the general public, to the facility employees and to the environment. A fundamental part of this commitment is the prevention of accidental releases of hazardous substances in and around the facility. The Addis Plant A facility utilizes engineering controls, inspection programs, and detailed procedures as a means to prevent accidental releases. In the event of a release, the facility has well trained emergency response teams to contain, mitigate, monitor, and stop the release. The facility has fully staffed and trained emergency response teams for fire fighting and emergency rescue. In addition to handling the release, the facility is also participating in established communication systems to alert the community in the event of a significant release. Through the coordination with the local emergency planning committee (LEPC), the facility has the ability to provide emergency notification to the local community through cable override systems, radio broadcasts, siren system, and/or through an automated telephone notification system.\n\nThe Shintech Environmental Supervisor has responsibility for the development and implementation of the risk management program for the facility.  The Safety Supervisor is responsible for the implementation of the facility process safety management (PSM) and accident prevention program. However, the specific responsibilities for certain aspects of that program will be delegated to other personnel who will report either directly or through other management personnel to the Environmental and/or Safety Supervisor. Similarly, responsibility for the RMP hazard assessment and emergency response plan has been delegated to the Environmental Supervisor. Furthermore, it is the facility's policy that sa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014847,
      "SummaryText": "fe operation is part of everyone's job; therefore, many other site personnel will also be involved in RMP activities on an ongoing basis.\n\n      1.2 \tFacility Regulated Substances\n      \nThe Addis Plant A facility is a polyvinyl chloride manufacturing site located near Addis, Louisiana. The facility uses vinyl chloride monomer as raw material. This substance (vinyl chloride) is flammable substance that EPA has specifically listed in the RMP rule and will be present in the facility's process above the EPA established threshold quantity of 10,000 pounds.\n\nThe Addis Plant A facility also handles one toxic substance regulated by the RMP rule in a sufficient quantity to be handled by the RMP rule:\n\t\t\nChlorine is used in the chlorination of cooling tower water and sanitary water.  \n\n      1.3 \tAccidental Release Prevention Program\n\nBecause the facility is also subject to the Occupational Safety and Health Administration (OSHA) process safety management (PSM) standard, and because the OSHA PSM requirements are very similar to the EPA RMP requirements, this summary addresses each of the OSHA PSM elements. The PSM program at this facility has been extended by the facility, where necessary, to satisfy EPA's Program Level 3 accident prevention program requirements.\n\n      Employee Participation\n\nShintech will encourage employees to participate in all facets of process safety management and accident prevention. Specific ways that employees can be involved in the accident prevention program will be documented in an employee participation plan that will be maintained at the facility and will address each accident prevention program element.\n\n      Process Safety Information\n\nThe Addis Plant A facility will keep a variety of technical documents used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration informa"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000014847,
      "SummaryText": "s, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process equipment.\n    \nShintech maintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their job in a safe manner. Written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits. If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\n\nAnother integral part of the mechanical integrity program is quality assurance. The Addis Plant A facility incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\n      Safe Work Practices\n\nThe Addis Plant A facility has safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, (4)"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000014847,
      "SummaryText": "ty and surrounding areas in the event of an emergency situation. The plan consists of procedures for responding to such emergencies as fires, explosions, hazardous gas or liquid releases, natural disasters, and threats. The plan addresses all aspects of emergency response including coordination of clean-up activities with mutual aid organizations, timely notification of authorities, maintenance of proper documentation, and guidelines for compliance with applicable government regulations. Furthermore, the Addis Plant A facility has procedures that address proper use, maintenance, inspection, and testing of emergency response equipment. All employees receive safety and process control training to instruct them in proper emergency response procedures. The overall ERP for the Addis Plant A facility is coordinated with the West Baton Rouge Parish LEPC and the Iberville Parish LEPC.\n\nIn order to keep the plan up to date, the emergency response procedures are reviewed annually. Necessary revisions are made and distributed to the plan holders by the Environmental department. Affected personnel are trained in regards to the changes in the ERP.\n\n      1.6 \tPlanned Changes to Improve Safety\n\nThe Addis Plant A facility constantly strives to improve the safety of its operations through periodic safety reviews, the incident investigation program, and a program soliciting safety suggestions from the workers."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014847,
      "SummaryText": "tion. Specific departments within the facility are assigned responsibility for maintaining up-to-date process safety information.\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs). This information is supplemented by documents that specifically address known concerns and hazards associated. In addition, the facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in the operation manuals. Shintech will ensure that the process is maintained within these limits by using process controls and monitoring instruments, operating procedures, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\n\nShintech will also maintain numerous technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, etc. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n      Process Hazard Analysis\n\nThe Addis Plant A facility has a comprehensive PHA program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, the covered process is systematically examined to identify hazards ensuring that adequate controls are in place to manage those hazards.\n\nThe facility primarily uses the What If and HAZOP analysis technique to perform these evaluations. These analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise. This team identifies and evaluates hazards of the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014847,
      "SummaryText": "process as well as recommends accident prevention and/or mitigation measures when the team believes such measures are necessary.\n\nTo help ensure that the process controls and/or process hazards do not deviate significantly from the original design safety features, the facility will periodically update and revalidate its process hazard analyses. These periodic reviews are conducted at least every five years and will be conducted at this frequency until the process is no longer operating. The results and recommendations from these updates are documented and retained.\n\n      Operating Procedures\n\nThe Addis Plant A facility maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. Procedures are maintained current by revising them as necessary to reflect changes made to the process. In addition, the facility's operating procedures provide guidance on how to respond to events that result in exceeding safe operating limits for specific process or equipment parameters. The written operating procedures are readily available to operators and for other personnel to use as necessary to safely perform their job tasks.\n\n      Training\n\nTo complement the written procedures for process operations, the Addis Plant A facility has implemented a training program for all employees involved in operating a process. All operations employees receive basic training in the facility operations. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted every 3 years. Operators are given the opportunity to take part in more frequent"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000014847,
      "SummaryText": "refresher training if desired. This training is documented for each operator, including the means used to verify that the operator understood the training.\n\n      Contractors\n\nThe Addis Plant A facility uses contractors to supplement its work force throughout the year as needed. Because some contractors work on or near process equipment, the facility has procedures in place to ensure that contractors perform their work in a safe manner, possess the appropriate knowledge and skills needed, are trained of the hazards in the workplace, and are aware of the procedures to take in the event of an emergency. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, (4) safe work practices, and (5) a work permit process prior to their beginning work. In addition, Shintech evaluates contractor safety programs and performance during the selection of a contractor. Shintech management personnel periodically monitor contractor performance to insure that contractors are fulfilling their safety obligations.\n\n      Pre-startup Safety Reviews\n\nShintech personnel conducts a pre-startup safety review for any new facility or facility modification that requires a change in the process safety information (not required for replacement in kind). The purpose of the review is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. A review involves field verification of the construction and serves a quality assurance function.\n\n      Mechanical Integrity\n\nShintech personnel has well-establish practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressor"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000014847,
      "SummaryText": "a permit and procedure to control welding and other spark-producing activities, and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\n      Management of Change\n\nThe Addis Plant A facility has a comprehensive system to manage changes to processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process technology information, and equipment information, as well as procedures are updated to incorporate these changes. In addition, operating and maintenance personnel are provided with any necessary training on the change.\n\n      Incident Investigation\n\nShintech personnel promptly investigates all incidents that result in, or reasonably could result in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.\n\n      Compliance Audits\n\nTo help ensure that the accident prevention program is functioning properly, the Addis Plant A facility periodically conducts audits to confirm the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 y"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000014847,
      "SummaryText": "ears. The final resolution of each finding is documented, and recent audit reports are retained.\n\n      Chemical-Specific Prevention Steps\n\nThe process at the Addis Plant A facility has hazards that must be managed to ensure continued safe operation. The accident prevention program summarized previously is applied to the facility. Collectively, these prevention program activities help prevent potential accident scenarios of both the release of chlorine and the release of VCM caused by equipment failures or human errors.\n\nIn addition to the accident prevention program activities, the Addis Plant A facility has many safety features to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of a release. The following types of safety features are used in various processes:\n\n    Release Detection\n\n* Area ambient air monitoring system \n    \n    Release Containment/Control\n    \n* Process relief valves to prevent overpressure damage to equipment;\n* Scrubbers to neutralize chemical releases;\n* Manual and automatic valves to permit isolation of vessels;\n* Automated shutdown systems for specific process parameters (e.g., high level, high temperature);\n* Dikes to contain liquid releases;\n* Release mitigation systems (water spray systems);\n* Fire suppression and extinguishing systems;\n* Trained emergency response personnel;\n\n      1.4 \tFive-year Accident History\n    \nThe Addis Plant A facility did not have any accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage within the previous five years.\n\n      1.5 \tEmergency Response Program Information\n\nThe Addis Plant A facility maintains a written Emergency Response Plan (ERP), which aims to protect employees, public health, and the environment. The purpose of the ERP is to minimize potential adverse impacts on the facili"
    }
  ]
}