{
  "FacilityID": 1000092203,
  "FacilityName": "Cooperative Producers, Inc.",
  "FacilityStr1": "1062 Highway 4",
  "FacilityStr2": null,
  "FacilityCity": "Bladen",
  "FacilityState": "NE",
  "FacilityZipCode": "68928",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31181",
  "LEPC": "Webster",
  "FacilityLatDecDegs": "40.173385",
  "FacilityLongDecDegs": "-98.324838",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "G7",
  "LatLongDescription": "SW",
  "FacilityURL": "265 North Showboat Blvd",
  "FacilityEmailAddress": "markh@cpicoop.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cooperative Producers, Inc.",
  "OperatorStr1": "P.O. Box 1008",
  "OperatorStr2": "265 N. Showboat Blvd",
  "OperatorCity": "Hastings",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68901",
  "OperatorZipCodeExt": "1008",
  "RMPContact": "Mark Hueftle",
  "RMPTitle": "Safety Director",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000245754",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-01-13 00:00:00",
  "SafetyInspectionBy": "Nebraska Fire Marshal",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-02-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-02-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-02-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-02-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114516,
      "AltID": "Product storage",
      "FacilityID": 1000092203,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000115910,
          "ProcessID": 1000114516,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143084,
          "ProcessID": 1000114516,
          "ChemicalID": 56,
          "Quantity": 1293388.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000643084,
          "ProcessID": 1000114516,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092203,
      "SummaryText": "Company: Cooperative Producers, Inc. Facility Name: Blue Hill\n\nMail to: P.O. Box 1008, Hastings, NE 68902\n\nRisk Management Plan - Executive Summary\n\nFacility Policy:\n\nThe management and employees operating each of our facilities are committed to the prevention of\n\nany accidental release of hazardous material transported or stored on our locations. In the event an\n\naccidental release should occur, we are prepared to work with our Local Fire Department(s),\n\nEmergency Response Personnel, and other appropriate authorities deemed applicable depending\n\non the specific incident, to best mitigate any release and to minimize the impact of the release to\n\npeople and the environment.\n\nFacility Information:\n\nThe primary activity of our company is NAICS code 424510, \"Grain and Field Bean Merchant\n\nWholesalers\", however we are also engaged in providing \"agricultural inputs\" that include the\n\nreceiving, storage, and reloading of Anhydrous Ammonia for delivery to farmers in our area. The\n\nNAICS code we feel most applicable for this activity is NAICS code \"424910 Farm Supplies\n\nMerchant Wholesalers\". Anhydrous Ammonia is the only product at this facility subject to EPA Risk\n\nManagement Planning, at this time.\n\nAnhydrous Ammonia is received, stored, and distributed for direct application to farm fields during\n\nthe spring and fall months. During the balance of the year little if any product transfer occurs. The\n\nmaximum quantity handled at a given time would be the off loading of a semi-trailer vehicle tank.\n\nThe facility is operated on an \"as needed\" basis with staff present only during the receiving and\n\nreloading of product for delivery. Total annual hours for these needs do not meet the 2,080 hour\n\nrequirement to qualify as a \"full time employee\" on site therefore item number 1.11 is Zero. Our\n\nfacilities have adequate lighting, and are inspected at various times of day and night throughout the\n\nyear. Time expended for these inspections is not included in our staffing calculation."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092203,
      "SummaryText": "\n\nWorst-case release scenario:\n\nThe \"worst-case release scenario\" is considered to be the release of the total contents of our largest\n\nAnhydrous Ammonia tank. The maximum quantity released based on 85 % tank capacity as limited\n\nby design standards, the distance to the endpoint (point of dispersion to 200 ppm) miles based on\n\nEPA's RMP -Comp Program (Online Version), as well as possible public and environmental\n\nreceptors within the area have been provided to the County LEPC (Local Emergency Planning\n\nCommittee) to assist them in their planning.\n\nAlternative release scenario:\n\nThere has not been an actual release of Anhydrous Ammonia during the last 5-years at the site. We\n\nbelieve the most likely release would be caused by damage to the liquid valve on a nurse tank due\n\nto a transportation incident. This could lead to the total loss of contents of the tank. The distance to\n\nthe endpoint (point of dispersion to 200 ppm) is determined per instructions by EPA guidance.\n\nAccidental Release Program:\n\nOur Anhydrous Ammonia accidental release program is based on guidelines found in the American\n\nNational Standards Institute, Inc. (ANSI) standard K61.1-1999 \"Safety Requirements for the Storage\n\nand Handling of Anhydrous Ammonia; and the U.S. Occupational Safety and Health Administration\n\n(OSHA) standard 29CFR 1910.111 \"Storage and Handling of Anhydrous Ammonia\". We conduct\n\nannual employee training on the safe handling, transportation and distribution of Anhydrous\n\nAmmonia, and have installed safety equipment including, but not limited to: Excess flow valves,\n\nBreakaway couplers at risers, Emergency shut-off valves, Barriers to avoid damage by trucks or\n\nother vehicles, and Lock outs to prevent tampering when the site is unattended. We also maintain\n\nroutine contact with our local fire department and emergency response personnel; and have\n\nprovided and/or participated in safety training exercises on Anhydrous Ammonia.\n\nWe have developed an Emergency Action Plan for employ"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092203,
      "SummaryText": "ees, customers, and visitor protection in\n\nevent of fire, explosion, tornado, and other acts of god that require evacuation, emergency medical\n\ncare, contacts for assistance, etc. for all areas of our company including the Anhydrous Ammonia\n\nfacility included in this plan. The primary emergency coordinator is listed in the Registration Section\n\nof this document. Any of the following additional individuals may be contacted in the event the\n\nprimary emergency coordinator cannot be reached:\n\nName Work Phone 24-Hr. Phone\n\nTyler Ostrander 402.756-8291 402.984.6894\n\nDoran Burmood 402.463.5148 402.469.6452Five - Year Accident History:\n\nThere has not been a release of anhydrous ammonia within the past five years that has caused any\n\ndeath, injuries, or significant property damage at the facility or to our knowledge has resulted in\n\noffsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\n\nEmergency Response Program:\n\nThis facility is included in the written Community Emergency Response Plan as prepared by the\n\nLocal Emergency Planning Committee (LEPC), and the Nebraska Emergency Management Agency\n\n(NEMA) (former Nebraska State Civil Defense Agency). We also include these materials in our own\n\nEmergency Action Plan in accordance with OSHA Standard 29CFR 1910.38. We have provided\n\nState and Local authorities all Community Right-to-Know information requested as well as that\n\nrequired under SARA Title III (EPCRA). Our written employee safety programs include preemergency\n\nplanning and employee training in accordance with OSHA standards, and are offered for\n\nreview at any time by our Local Emergency Planning Committee (LEPC) to ensure they conform to\n\nthe community plan(s). We actively encourage participation in our Anhydrous Ammonia and\n\nPropane training programs by the local fire department(s), local emergency response team,\n\ncommunity planners, etc. that may be expected to respond to an incident at our site.\n\nPlanned changes to imp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092203,
      "SummaryText": "rove safety:\n\nSafety improvement is an on-going process at all of our facilities. Periodic evaluations are\n\nperformed to assess the maintenance of safe conditions. There are no additional specific\n\nrecommendations for implementation at this time.\n\nAdditional Information:\n\nFor additional information, response to questions, or comments, contact: Doran Burmood, V.P.\n\nHealth and Safety\n\n"
    }
  ]
}