{
  "FacilityID": 1000009430,
  "FacilityName": "State Line Compressor Station",
  "FacilityStr1": "655 Wood Springs Road",
  "FacilityStr2": null,
  "FacilityCity": "Logansport",
  "FacilityState": "LA",
  "FacilityZipCode": "71049",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22031",
  "LEPC": "Desoto Parish LEPC",
  "FacilityLatDecDegs": "32.068611",
  "FacilityLongDecDegs": "-93.939444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.m2midstream.com",
  "FacilityEmailAddress": "j.roberts@m2midstream.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "M2 Louisiana Gas Service, LLC",
  "Company2Name": "M2 Midstream LLC",
  "CompanyDUNS": 828223862,
  "Company2DUNS": 828223862,
  "OperatorName": "M2 Louisiana Gas Service, LLC",
  "OperatorStr1": "1099 Main Avenue, Suite 210",
  "OperatorStr2": null,
  "OperatorCity": "Durango",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "81301",
  "OperatorZipCodeExt": null,
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208205",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-05-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2014-09-22 00:00:00",
  "DeRegistrationEffectiveDate": "2014-09-12 00:00:00",
  "AnniversaryDate": "2014-07-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000011088,
      "AltID": "Gas & Liquid Processing",
      "FacilityID": 1000009430,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012616,
          "ProcessID": 1000011088,
          "ChemicalID": 155,
          "Quantity": 171701.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 93913,
              "ProcessChemicalID": 1000012616,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 93914,
              "ProcessChemicalID": 1000012616,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 93915,
              "ProcessChemicalID": 1000012616,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 93916,
              "ProcessChemicalID": 1000012616,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 93917,
              "ProcessChemicalID": 1000012616,
              "ChemicalID": 94
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000011484,
          "ProcessID": 1000011088,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000009430,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-03-20 00:00:00",
    "ERTrainingDate": "2009-03-20 00:00:00",
    "CoordinatingAgencyName": "De Soto Parish LEPC",
    "CoordinatingAgencyPhone": "3188724244",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009430,
      "SummaryText": "M2 Louisiana Gas Service, LLC\nState Line Processing Plant\nExecutive Summary for RMP\n\nACCIDENT RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe State Line Processing Plant has Management commitment to worker and public safety.  The commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of our processes.  Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, trained personnel will respond to control and contain the release.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe primary purpose of the State Line Processing Plant is to compress, dehydrate and remove natural gas liquids from wet natural gas that is gathered from gas producers in the area.  The Plant consists of refrigeration and treating processes and compressors driven by internal combustion engines.  Once at the Plant, the incoming natural gas is sent through processes consisting of separation, dehydration, refrigeration, and compression.  The treated gas is compressed to pipeline pressure and dehydrated through a Triethylene Glycol dehydration process.  The residue gas leaves the facility via pipeline either unprocessed or processed.  Natural gas liquids (NGL's) are stored in pressurized storage tanks.  Natural gas condensate that is separated out in the various separators and scrubbers is stored in atmospheric tanks.  Vapors from both the NGL tank and condensate tanks are routed to a flare in order to meet emission limits.  The NGL and condensate leaves the plant via tank trucks.  As a result of these operations, several EPA regulated flammable substances are processed, recovered, and stored at the facility.  The flammable substance inventory quantity provided in Section 1.17 of the RMP is a conservative estimate of the amount of regulated flammable substance that is present in the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009430,
      "SummaryText": "Station at any one time.  This station is un-manned.  However, it is visited on a daily basis. \n\nGENERAL ACCIDENT RELEASE PREVENTION PROGRAM\n\nAn accidental release prevention program is in place at the State Line Processing Plant.  The State Line Processing Plant has been classified as a Program 1 because no public receptors have been identified within a calculated radius of exposure.  The location is visited daily by Operation Personnel who receive extensive Environmental, Health & Safety Training.  Over pressure and high level alarms are in place with shutdown controls for abnormal conditions.  System volumes and pressures are monitored through a Supervisory Control and Data Acquisition System (SCADA)\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe State Line Processing Plant has experienced NO known reportable process accidents in the past 5 years. \n\nEMERGENCY RESPONSE PROGRAM\n\nM2 Louisiana Gas Service, LLC maintains a written emergency response plan that includes the State Line Processing Plant, which is in place to protect worker and public safety as well as the environment.  The plan consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements.  \n\nIn addition, the Plant has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.\n\nThe emergency response plan is updated when necessary based on modifications "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009430,
      "SummaryText": "made to Plant processes or other Plant facilities.  \n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nBecause M2 Louisiana Gas Service, LLC recently built the State Line Processing Plant and recently made modifications, there are numerous plans in place to implement and improve safety and environmental programs.  An environmental, health, and safety (EH&S) training plan has been established.  Emergency table top drills are conducted to improve personnel awareness and response.\n"
    }
  ]
}