{
  "FacilityID": 1000040123,
  "FacilityName": "Chemtrade Performance ChemicalsUS LLC Kalama Plant",
  "FacilityStr1": "404 Hendrickson Drive",
  "FacilityStr2": null,
  "FacilityCity": "Kalama",
  "FacilityState": "WA",
  "FacilityZipCode": "98625",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53015",
  "LEPC": "Cowlitz County LEPC",
  "FacilityLatDecDegs": "45.993560",
  "FacilityLongDecDegs": "-122.840750",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.chemtradelogistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 556736721,
  "ParentCompanyName": "Chemtrade Logistics (US) Inc.",
  "Company2Name": null,
  "CompanyDUNS": 201126559,
  "Company2DUNS": 0,
  "OperatorName": "Chemtrade Performance Chemicals LLC",
  "OperatorStr1": "404 Hendrickson Drive",
  "OperatorStr2": null,
  "OperatorCity": "Kalama",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98625",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": "98625hchst404he",
  "EPAFacilityID": "100000031468",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-12-06 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-03-18 00:00:00",
  "DeRegistrationEffectiveDate": "2016-02-24 00:00:00",
  "AnniversaryDate": "2019-05-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 45.99389,
  "FRS_Long": -122.83944,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049489,
      "AltID": "Sodium Hydrosulfite Mfg.",
      "FacilityID": 1000040123,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059992,
          "ProcessID": 1000049489,
          "ChemicalID": 49,
          "Quantity": 827000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000053706,
          "ProcessID": 1000049489,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000044558,
              "Process_NAICS_ID": 1000053706,
              "SafetyReviewDate": "2013-12-01 00:00:00",
              "PHA_Date": "2010-10-08 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-05-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Tank rupture",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Emergency Response",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Camera surveillance",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 1,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-04-09 00:00:00",
              "TrainingReviewDate": "2013-07-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "computer based training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-03-03 00:00:00",
              "EquipmentInspectionDate": "2014-01-30 00:00:00",
              "EquipmentTested": "SO2 Sensors",
              "ChangeMgmtDate": "2014-03-31 00:00:00",
              "ChangeMgmtReviewDate": "2013-05-13 00:00:00",
              "PreStartupReviewDate": "2014-03-31 00:00:00",
              "ComplianceAuditDate": "2013-08-31 00:00:00",
              "AuditCompletionDate": "2014-01-31 00:00:00",
              "IncidentInvestigationDate": "2013-07-17 00:00:00",
              "InvestigationChangeDate": "2013-08-14 00:00:00",
              "ParticipationPlansReviewDate": "2014-04-20 00:00:00",
              "HotWorkPermitReviewDate": "2014-04-09 00:00:00",
              "ContractorSafetyReviewDate": "2014-03-27 00:00:00",
              "ContractorSafetyEvalDate": "2014-05-12 00:00:00",
              "CBI_Flag": 0,
              "Description": "Sulfur dioxide offloading, storage, and sodium hydrosulfite production processes. ",
              "_chemicals": [
                {
                  "PrimaryKey": 1000053616,
                  "PreventionProgram3ID": 1000044558,
                  "ProcessChemicalID": 1000059992
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000040123,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-04-03 00:00:00",
    "ERTrainingDate": "2013-12-23 00:00:00",
    "CoordinatingAgencyName": "Cowlitz Fire Dept. - Dist. 5",
    "CoordinatingAgencyPhone": "3606732222",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000040123,
      "SummaryText": "This is the executive summary for the Kalama plant RMP:\n\n\n\nFacility Description and Introduction\n\nThe Chemtrade Kalama Plant has been operating at 404 Hendrickson Drive, Kalama, Washington since 1969. Our facility uses sulfur dioxide in the production of Sodium Hydrosulfite (SHS) solution and Zinc Oxide powder. SHS is used extensively as a bleaching agent in the pulp and paper, clay, and textile industries. Zinc Oxide is used in a variety of industries.  The EPA has identified sulfur dioxide as having the potential to cause adverse offsite consequences in the event of a substantial accidental release.  The site sulfur dioxide storage tank has a maximum intended inventory of 287,000 pounds. The sulfur dioxide is received to the plant by rail car.\n\nAt the Chemtrade Logistics Kalama Plant, we continue to be committed to operating and maintaining our process in a safe and responsible manner.  Our plant proactively manages operations in a manner that minimizes environmental, health, safety, and security risks. We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  The site is independently certified as an RC14001:2008 and ISO 14001:2008 facility, and has been since 20011. We attribute our operational success to sound business practices that put safety, health, the environment, and security aspects at the forefront of all business decisions. This commitment is found in the Chemtrade Responsible Care Policy and in the Chemtrade Environmental Health and Safety Policy.\n\nChemtrade Responsible Care Policy\n\n\n\nCHEMTRADE is committed to Responsible Care&reg; as the key to our business success. Responsible Care is our commitment to do and be seen as doing the \"right thing\". The Responsible Care principles form the basis of our business philosophy towards societal, economic, and environmental sustainability. Chemtrade applies these pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000040123,
      "SummaryText": "inciples to strive for continual improvement of our performance in the areas of Environmental Management, Safety and Health Protection, Safe Transportation, Process Safety Management, and Security of our processes, products, services and activities. Chemtrade applies the following principles in its implementation of the Responsible Care ethic: \n\n\n\n1. Promoting awareness of Responsible Care and inspiring our employees and others to adhere to these principles to instill a Responsible Care culture throughout our organization. \n\n\n\n2. Respecting our employees and all other stakeholders and encouraging them to work together towards continuous improvement of our business processes to ensure that our products are manufactured safely and our products and raw materials are transported, used, and disposed or recycled safely during their life cycles in order to protect the safety, health, and security of our employees and stakeholders. \n\n\n\n3. Designing, developing, maintaining and operating business processes focused on: safer products and processes; improved safety, security and health of individuals; and reducing our impact on the environment by responsible methods of resource conservation, pollution prevention and energy efficiency. \n\n\n\n4. Being proactive in taking preventative actions to identify, reduce and manage our risks and to protect the safety, health, and security of our employees and all other stakeholders. \n\n\n\n5. Communicating our Responsible Care performance to the public and holding ourselves accountable to our stakeholders, who have the right to understand the risks and benefits of what we do and to have their input heard regarding our products, services, activities and operations. \n\n\n\n6. Supporting education and research on environmental, safety and health effects and security of our products and processes that may improve people's lives and striving to meet or exceed expectations for social responsibility and community involvement; and \n\n\n\n7. Cooperatively pa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000040123,
      "SummaryText": "rticipating in the public policy process for effective laws and standards that safeguard the community, workplace and environment and meeting or exceeding them in letter and spirit. \n\n\n\nChemtrade Environmental, Safety, and Health Policy\n\n\n\nCHEMTRADE will demonstrate our commitment to our employees, customers, supply chain partners, the public, and other stakeholders by working on continual improvement in the areas of Environmental Management, Safety and Health Protection, Safe Transportation, Process Safety Management, and Security of our processes, products, services and activities by: \n\n1. Maintaining a management system that drives the continual improvement of our performance in these areas. \n\n2. Meeting and striving to exceed applicable laws, regulations or other requirements. \n\n3. Developing appropriate site procedures and employee training programs to promote a safe, healthy, and secure workplace and the protection of the environment. \n\n4. Providing information, guidance and training to our employees, customers, supply chain partners, the public, and other stakeholders in the safe and responsible use, handling and disposal of our products. \n\n5. Maintaining appropriate internal emergency response capabilities and coordinating with external emergency responders to effectively respond to situations that involve our products or that may impact our employees and other stakeholders. \n\n6. Undertaking periodic reviews of our assets, operations and activities to measure the organization's performance and compliance with this policy, applicable laws, and other requirements. \n\n7. Setting objectives and targets intended to improve the organization's performance and to drive continuous improvement. \n\n8. Applying appropriate process safety and risk management principles to all manufacturing processes. \n\n9. Adhering to basic security measures to protect our employees and other stakeholders including protection of products and other assets; and \n\n10. Maintaining procedures th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000040123,
      "SummaryText": "at promote the safe storage and transportation of our raw materials and products. \n\nWorst Case and Alternative Release Scenarios\n\n\n\nAs specified under ?68.25, the facility has considered the worst case scenario to be a catastrophic failure of the site's 287,000 lb sulfur dioxide storage tank. Such a scenario is highly unlikely to occur; however, using the EPA Offsite Consequence Analysis method, RMP Comp, the distance to concentration levels of <0.01 mg/L would be 19 miles. The Kalama Plant has numerous engineering, operational, and administrative controls to prevent such a release and manage the off-site consequences. The alternative case scenario which the site considered would be a leak in the transfer connection train to the SO2 railcar. It is assumed 20% (90 lb/min) of the flow will leak from the hose connection. It is expected that the SO2 area gas monitors would detect the release and at 20 ppm, automatically shutdown the unloading process within 5 minutes. The Kalama site has not experienced any releases of this magnitude during the life of the site. This event would cause an offsite consequence at a distance of 0.2 miles. These distances were calculated by the EPA RMP*Comp Program.  The Kalama site has numerous mitigation measures in place to prevent such a release and minimize the consequences of a release, in the unlikely event of such an occurrence.  \n\n\n\n\n\nPrevention Program\n\n\n\nThe Kalama facility has been operating under the principles of Process Safety Management for the RMP Covered Process since principles were developed by OSHA and EPA. In addition, the Kalama facility has incorporated the principles of Process Safety Management into its operation of all, non-covered processes. The facility is regulated under the OSHA PSM Standard, furthermore our commitment to \"Do the Right Thing\" means that we apply appropriate process safety and risk management principles to all manufacturing processes, and use various resources to evaluate and follow the chemical"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000040123,
      "SummaryText": " manufacturing industries' best practices. \n\n\n\nThe Sodium Hydrosulfite Manufacturing process is continuously monitored during production operations, by operators who have been trained and certified in accordance with the RMP rule.  The site has installed redundant engineering controls, including interlocks and fail-safe technology where feasible to reduce risk.  The site records levels, flows, and pressures within the process. Administrative controls such as audible and visual alarms are used to identify recorded values which fall outside of acceptable operational control parameters, so that problems with the operation of the system can be quickly identified and mitigated.  Site operators take visual readings throughout the production area in order to monitor conditions within the plant and record operational data. Operational controls such as safe work practices, safe work permitting, and operational procedures assist the site in keeping operations safe for employees and stakeholders. \n\n\n\nFive Year Accident History\n\n\n\nThis site has experienced no Reportable releases since the plant began operation in 1969. This site has experienced no recordable injuries within the last 9 years.  This site has experienced two minor, contained, releases from the SO2 process which did not result in any injury or illness. These minor incidents were fully investigated to determine the cause, prevent reoccurrence, and make process improvements. All near miss or hazard recognition situations are also investigated fully.\n\n\n\nEmergency Response Program\n\n\n\nThis site conducts emergency response in accordance with a written Emergency Response Plan (ERP).  The site's ERP directs the site's on-site response activities under the direction of an Incident Commander. All site employees are fully trained in the site's Emergency Response Plan, as First Responders that perform limited actions from safe locations in an emergency.  A representative from the Chemtrade Kalama site participates in community"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000040123,
      "SummaryText": " emergency planning events and Local Community Emergency Awareness and Response Committee meetings with the Cowlitz County LEPC and Port of Kalama.  We maintain an ongoing dialogue with Cowlitz County Emergency Management services, and Cowlitz County Fire District #5.  Coordinated drills are conducted at the facility regularly with local emergency responders. Several plant operators serve on the local volunteer fire department.\n\n\n\nRecent Changes to Improve Safety\n\n\n\nThis site is continuously working to improve site safety conditions. The site is currently undergoing the following improvement projects:\n\n\n\n1.    This site has upgraded the type of flanges used for the transfer of SO2 from a 4 bolt flange system, to a knock on union Teflon sealed flanges for rail car unloading. This is a recognized good engineering practice improvement.\n\n2.    The site installed automatic emergency shutdown valves that are programmed to close when SO2 perimeter monitors detect levels of 20 ppm.\n\n3.    The site upgraded the entire SO2 monitoring system. The new system has strobed alarm lighting. An additional SO2 monitor was installed in the Compressor building. \n\n4.    The site is recently identified one flexible SO2 transfer line that had not been upgraded to Smart Hose technology. This line was upgraded.\n\n5.    The site has implemented a more comprehensive mechanical integrity and maintenance work order program which will assist the site in identifying critical health, safety, and environmental consequence equipment in order to prioritize maintenance activities within the plant.  \n\n6.    A complete fall protection cage was installed on the SO2 rail car unloading rack to better protect workers from falls while unloading SO2.\n\n7.    The site internal PSM/RMP compliance audit program is extensive and thorough. A team of four auditors from Chemtrade Corporate were on-site for 4 days. Numerous recommendations for improvement were identified and completed.\n\n\n\n                 \n\nIn summary, Chemtrade is committe"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000040123,
      "SummaryText": "d to the safe operation of our facility, and we take all actions necessary to ensure the safety of our employees, members of the community, and the environment.\n\n"
    }
  ]
}