{
  "FacilityID": 1000042301,
  "FacilityName": "Little Cedar Bayou Wastewater Treatment Facility",
  "FacilityStr1": "1301 S 4th Street",
  "FacilityStr2": null,
  "FacilityCity": "La Porte",
  "FacilityState": "TX",
  "FacilityZipCode": "77571",
  "Facility4DigitZipExt": "1115",
  "FacilityCountyFIPS": "48201",
  "LEPC": "La Porte",
  "FacilityLatDecDegs": "29.649538",
  "FacilityLongDecDegs": "-095.022941",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of La Porte",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of La Porte",
  "OperatorStr1": "2963 N. 23RD St.",
  "OperatorStr2": null,
  "OperatorCity": "La Porte",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77571",
  "OperatorZipCodeExt": "1115",
  "RMPContact": "Curtis Herrod",
  "RMPTitle": "Superintendent of Utilities",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000136319",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.64886,
  "FRS_Long": -95.02289,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052139,
      "AltID": "Chlorine",
      "FacilityID": 1000042301,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000052766,
          "ProcessID": 1000052139,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000063212,
          "ProcessID": 1000052139,
          "ChemicalID": 62,
          "Quantity": 9050.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000563212,
          "ProcessID": 1000052139,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042301,
      "SummaryText": "The City of La Porte operates the Little Cedar Bayou Wastewater Treatment Plant located at 1301 S. 4th Street in La Porte. In the processes of this plant, only one(1) regulated substance/chemical is utiltized in quantities above the threshold limit. This substance, chlorine liquidfied under pressure, is used as a disinfectant to treat plant effluent prior to discharge to Little Cedar Bayou and then to Galveston Bay. This process assures the safety and water quality of the receiving stream and the general public. Chlorine is contained in one ton containers, of which two (2) can be fed in tanduem through a chlorinator system and delivered in the plant's effluent. One container is on line to continously feed and a second container is in reserve inventory to ensure adequate availibility of chlorine as required by State and Federal regulations. Also stored at this facility are, seven ( 7 ) 150 pound chlorine cylinders. These cylinders are inventoried at the Wastewater Treatment facility due to the centralized location to the Water Production facilities. Total maximum amount of chlorine on hand at any given time is 7,050 pounds. \n\n\n\nFor purposes of this plan, a Worst case scenario was examined where the total content of one container of chlorine released into the atmosphere by catastrophic failure of the container. This release was over a duration of 10 minutes with a total chemical release of 2000 pounds. This type of release would effect an area in a  1.3 miles radius of the plant with approximately 2,600 citizens being affected.\n\n\n\nA more realistic scenario was reviewed where a line leak occurred of 630 pound of chlorine was released over a 60 minute duration. This type of leak would affect an area approximately 0.1 mile radius of the plant. There are no permanent residents within this area. No citizens would be affected by this of release.\n\n\n\nWithin the past five( 5 ) years there has been no release of chlorine gas beyond the chlorine building or beyond the perimeter "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042301,
      "SummaryText": "of the treatment facility.\n\n\n\nAll plant personnel are trained, both classroom and on-the-job, in the proper methods of handling chlorine both as a liquid and a gas.  The equipment is regularly inspected for operation within the required tolerances and is regularly changed to as it nears the minimum operating levels. There are written operations and maintenance manuals describing the step-by-step procedure on maintenance and replacement of chlorine containers. Emergency auto shut off valves have been installed and gas detectors are working and calibrated annually.  A hazard  review has been performed attempting to determine the consequences of both man-made and natural condition that could cause a release of chlorine into the atmosphere and determining the proper response for each source.\n\n\n\nPlant personnel have written guidelines and procedures of required actions should a leak occur. These include notification of the La Porte Fire Department's Emergency Response Team along with requesting assistance of our local chlorine vendor.  The public would be notified, if required, through the activation of the City of  La Porte's Whelan System and the First Call systems. These sytems  can broadcast and call telephones within an affected area of the release. In addition, there is an AM 830 radio station which broadcast information to the public  in emergency situations and paging system to notify all City employees and all School District employees of an emergency. Plant personnel perform annual drills conducted through the office La Porte Emergency Operation Coordinator. These drills measure the adequacy and the knowledge of the response procedures.  Any deficiences found to exist from the drills are addressed and necessary changes are made.\n\n\n\nThis facility has been at this site for over thirty-five years without any major releases of chlorine occurring. The City of La Porte is dedicated to the continued safe and proper operation of the plant to ensure the safety of the en"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042301,
      "SummaryText": "tire general public."
    }
  ]
}