{
  "FacilityID": 1000021077,
  "FacilityName": "Brenntag Mid-South, Inc.",
  "FacilityStr1": "126 Chouteau Avenue",
  "FacilityStr2": null,
  "FacilityCity": "St. Louis",
  "FacilityState": "MO",
  "FacilityZipCode": "63102",
  "Facility4DigitZipExt": "2454",
  "FacilityCountyFIPS": "29510",
  "LEPC": "St. Louis City LEPC",
  "FacilityLatDecDegs": "38.615472",
  "FacilityLongDecDegs": "-090.190000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": "http://www.brenntagmid-south.com",
  "FacilityEmailAddress": "aclements@brenntag.com",
  "FacilityDUNS": 41167107,
  "ParentCompanyName": "Brenntag North America",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Brenntag Mid-South, Inc.",
  "OperatorStr1": "1405 Hwy. 136 West",
  "OperatorStr2": null,
  "OperatorCity": "Henderson",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42420",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bryant Buescher",
  "RMPTitle": "Director of Operations",
  "FTE": 45,
  "OtherEPAFacilityID": "63102GSRBN126CH",
  "EPAFacilityID": "100000129185",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-10-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-06-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-03-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-03-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-03-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.61579,
  "FRS_Long": -90.18977,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025635,
      "AltID": "Outside chemical storage",
      "FacilityID": 1000021077,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000025976,
          "ProcessID": 1000025635,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030494,
          "ProcessID": 1000025635,
          "ChemicalID": 56,
          "Quantity": 42000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000030495,
          "ProcessID": 1000025635,
          "ChemicalID": 57,
          "Quantity": 240000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000530494,
          "ProcessID": 1000025635,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000530495,
          "ProcessID": 1000025635,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000025636,
      "AltID": "Inside warehouse storage",
      "FacilityID": 1000021077,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000025977,
          "ProcessID": 1000025636,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030496,
          "ProcessID": 1000025636,
          "ChemicalID": 57,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000530496,
          "ProcessID": 1000025636,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021077,
      "SummaryText": "Brenntag Mid-South, Inc. (formerly G.S. Robins)\n\n1. ACCIDENTIAL RELEASE PREVENTION & EMERGENCY RESPONSE POLICIES: We at Brenntag Mid-South, Inc.\nare strongly committed to employee, public and environmental safety and protection. This commitment is\ninherent to a comprehensive accidental release prevention program that covers areas such as design,\ninstallation, operating procedures, maintenance and employee training associated with the processes at this\nfacility. It is our goal and objective to implement appropriate controls to prevent possible releases of\nregulated substances. If an accidental release were to occur, Brenntag has coordinated emergency response\nactivities with the St. Louis Local Emergency Planning Committee and the St. Louis Fire Department.\n\n2. THE STATIONARY SOURCE & THE REGULATED SUBSTANCES HANDLED: Our facility's primary activities\nencompass Distribution of chemical products. Currently, there are two regulated substances present at this\nfacility that exceed the Threshold Quantity (TQ) as defined within 40 CFR 68.130. These substances include\nanhydrous ammonia and aqua ammonia. Anhydrous ammonia is received in bulk and is blended with water to produce aqua ammonia which is stored in an on-site tank and subsequently packaged in drums and totes and also transported in bulk tanker trailers for delivery to our customers.  \n\n3. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM: Our facility has taken necessary steps to\ncomply with the accidental release prevention requirements as set forth under 40 CFR Part 68. The\ntwo RMP regulated substances are also listed under OSHA's Process Safety Management Appendix A as set\nforth under 29 CFR 1910.119.  Of these two substances, only the anhydrous ammonia is a PSM covered substance.   The following sections briefly describe the elements of our release prevention program that are currently in place at this facility.\n\na). Process Safety Information: Brenntag maintains a detailed record of written safety information"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021077,
      "SummaryText": " that\ndescribes the chemical hazards, operating parameters and equipment designs associated with all regulated\nprocesses.\n\nb). Process Hazard Analysis (PHA's): This facility conducts comprehensive PHA's to ensure that hazards\nassociated with each regulated process are identified and controlled efficiently. The HAZOP Analysis \nmethodology is utilized for completion of PHA's. The PHA's are completed by a team of\nqualified personnel with expertise in engineering and process operations. PHA's are reviewed prior to the\nimplementation of any process change that involves the regulated substance; immediately following an\naccidental release or if an incident has occurred that could have resulted in an accidental release. At a\nminimum, PHA's are revalidation every five years. Any findings related to the hazard analysis are addressed\nin a timely manner.\n\nc). Operating Procedures: For the purpose of safely conducting activities within our covered processes,\nBrenntag maintains written operating procedures. These procedures address various modes of operation\nsuch as initial startup, normal operations, temporary operations, emergency shutdowns, emergency\noperations, normal shutdown and startup following a turnaround. Operating procedures are regularly\nevaluated and are accessible to all applicable employees involved within each regulated process.\n\nd). Training: Brenntag has a comprehensive training program to ensure that employees are competent in\nthe operating and safety procedures associated with the each regulated process. New employees receive\nbasic training in process operations and safety procedures, followed by on-the-job supervision until they are\ndeemed competent to work independently. Refresher training is provided whenever there has been a\nchange in the process or at a minimum once every 3 years.\n\ne). Mechanical Integrity: Brenntag conducts inspections and maintenance on process equipment to ensure\non-going equipment integrity. Qualified personnel receive specialized tr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021077,
      "SummaryText": "aining to ensure that process\nequipment is properly inspected and maintained. Any equipment deficiencies are corrected in a safe and\ntimely manner.\n\nf). Management of Change: Written procedures are in place at Brenntag to manage change in process\nchemicals, technology, equipment and procedures. Applicable Brenntag personnel whose job task are\naffected by a modification in process conditions are promptly informed and trained of such changes to\nensure safe and efficient implementation.\n\ng). Pre-Startup Reviews: Brenntag conducts, when applicable, pre-startup safety reviews for new processes\nand modifications to existing processes. These reviews are conducted to verify that construction, equipment,\noperating and maintenance procedures are suitable for safe startup of the process.\n\nh). Compliance Audits: Brenntag conducts compliance audits to determine whether the provisions, as set\nforth under the RMP regulation, are being adhered to at this facility. These audits are conducted at least\nevery three years as required per this regulation. Corrective action, resulting from the audit, will be\nimplemented in a safe and prompt manner.\n\ni). Incident Investigation: Brenntag will investigate any incident that has resulted in, or could reasonably\nhave resulted in a catastrophic release of a regulated substance. These investigations are undertaken to\nidentify the mitigating circumstances surrounding the incident, as well as, to identify any corrective actions\nthat need implemented to prevent such incident from reoccurring. All incident investigations are retained for\na minimum of five years as required per this regulation.\n\nj). Employee Participation: Brenntag truly believes that process safety management and accident prevention\nis a team effort. Company employees are strongly encouraged to express their views concerning accident\nprevention issues and to recommend improvements. In addition, our employees have access to all\ninformation created as part of the facility implementatio"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000021077,
      "SummaryText": "n efforts to this standard.\n\nk). Contractors: On occasion, this facility hires contractors to conduct specialized maintenance and\nconstruction activities. Prior to selecting a contractor, an evaluation of the contractor safety performance\nwill be conducted. Brenntag has a strict policy of informing the contractors of known potential hazards that\nis related to the contractors work area within the facility. Contractors are also informed of all applicable\nprocedures for emergency response and facility evacuation in the event of an accidental release.\n\n4. Five-Year Accident History: Brenntag has an excellent record of preventing accidental releases over the\nlast five years. Due to our stringent release prevention policies and employee training, there have been no\naccidental releases during this period.\n\n5. Emergency Response Plan: Brenntag has developed a written emergency response plan to address the\npotential for accidental releases of hazardous materials. The plan includes all aspects of emergency response\nincluding spill response and cleanup, first aid and medical treatment, evacuations, notification of local\nemergency response agencies and the public. This plan is promptly updated to reflect any pertinent changes\nthat have taken place within our facility. Our emergency response plan has been coordinated and verified\nwith the St. Louis Local Emergency Planning Committee (LEPC).\n\n6. Planned Changes To Improve Safety: At this time, no changes are required at this facility.\n\n"
    }
  ]
}