{
  "FacilityID": 1000016556,
  "FacilityName": "John Morrell & Co.",
  "FacilityStr1": "1400 N Weber Ave",
  "FacilityStr2": null,
  "FacilityCity": "Sioux Falls",
  "FacilityState": "SD",
  "FacilityZipCode": "57103",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "46099",
  "LEPC": "Minnehaha County LEPC",
  "FacilityLatDecDegs": "43.563889",
  "FacilityLongDecDegs": "-096.718889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5213772,
  "ParentCompanyName": "Smithfield Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": 43205053,
  "Company2DUNS": 0,
  "OperatorName": "John Morrell & Co.",
  "OperatorStr1": "1400 N Weber Ave",
  "OperatorStr2": null,
  "OperatorCity": "Sioux Falls",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57103",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kenneth J. Baptist",
  "RMPTitle": "VP/General Manager",
  "FTE": 3000,
  "OtherEPAFacilityID": "57117JHNMR1400N",
  "EPAFacilityID": "100000004336",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "28.0201-01",
  "SafetyInspectionDate": "2010-04-28 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-09-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-09-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-09-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-09-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.565,
  "FRS_Long": -96.72,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "GPS - UNSPECIFIED",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000020624,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000016556,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000020993,
          "ProcessID": 1000020624,
          "NAICSCode": "311612",
          "_desc": {
            "NAICS_CODE": "311612",
            "NAICS_DESCRIPTION": "Meat Processed from Carcasses"
          }
        },
        {
          "Process_NAICS_ID": 1000020995,
          "ProcessID": 1000020624,
          "NAICSCode": "311611",
          "_desc": {
            "NAICS_CODE": "311611",
            "NAICS_DESCRIPTION": "Animal (except Poultry) Slaughtering"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000024428,
          "ProcessID": 1000020624,
          "ChemicalID": 56,
          "Quantity": 336993.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000524428,
          "ProcessID": 1000020624,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000016556,
      "SummaryText": "EPA FACILITY ID: 100000004336 John Morrell & Co. (Sioux Falls) Resubmission, September 23rd, 2010\n\n14:18:25 \nExecutive Summary \n\nThis submittal informs all interested parties that John Morrell & Company is participating in the OSHA Process \nSafety Management (PSM) program defined in 29 CFR 1910.119 and the EPA Risk Management Program \n(RMP) defined in 40 CFR Part 68. These programs provide for the implementation of detailed prevention and response procedures when storing and handling hazardous chemicals. The program objectives are to ensure worker and public safety and provide environmental protection. \n\nThis RMP submittal is a voluntary update to the RMP. A complete 5-year update for the John Morrell facility was submitted on June 15, 2009. This voluntary update will combine the DC plant (1000000015208) which holds 36,993 pounds of ammonia and the Main plant (100000004336) which holds 300,000 pounds of ammonia under the common ID of 100000004336 for a total of 336,993 pounds of ammonia on site. \n\nThe facility has also changed its wastewater treatment facilities chemical use of chlorine from gas to that of sodium hypochlorite and would also like to at this time remove that chemical from the RMP program also know as process ID # 100000009316.\n\n It is the policy of the company to conduct all of its operations in a manner, which is consistent with protecting human health and the environment. It is our policy to comply with all laws and regulations applicable to our operations, including, but not limited to all permitting, recordkeeping, and reporting requirements. It is our policy that employees and contractors are properly trained and that they have access to information. It is our policy to audit compliance with applicable laws and regulations and to promptly remedy any noncompliance. \n\nBecause there is absolutely no envisioned gain worth injury or loss of life, the company is committed to safety. This commitment is demonstrated through our routine safety training se"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000016556,
      "SummaryText": "ssions for employees. In addition, employees working directly with applicable hazardous chemicals receive annual hazardous materials refresher training. \n\nEach year, the written emergency action plan is reviewed and/or updated for the facility. Each year, the company reports the location and quantity of hazardous chemicals stored at their facility to the local fire department, the local emergency planning committee and the state emergency planning committee. Each year, the company reports the amount of hazardous chemicals used and/or released to the environment to state and/or federal regulatory agencies. \n\nThe facility complies with the EPA's accident prevention rule and all applicable state and local codes and regulations. In addition, the facility complies with the Occupational Safety and Health Administration's (OSHA) Process Safety Management regulation. John Morrell & Co.'s prevention program includes written operating and mechanical integrity procedures, safe work practices, a contractor safety program, management of change, and pre-startup safety reviews. In addition, the facility has implemented a training program to ensure that employees are knowledgeable in the hazards of the process and in their specific job functions. If an incident does occur, it is thoroughly investigated and the findings of the investigation are communicated to all affected employees. John Morrell & Co. believes the prevention program is the key to minimizing the risk to employees, the public, and the environment. \n\nOur Facility and Regulated Substances Handled \n\nThis facility is a meatpacking plant located in Sioux Falls, South Dakota. The facility kills, cuts and packages fresh pork. \nThe facility utilizes various conveyors and manual and automated processing and packaging equipment. \nVarious sanitation chemicals are stored and used for cleaning the facility in strict accordance with USDA food safety regulations. \nAnhydrous ammonia is the only substance at the facility that is regu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000016556,
      "SummaryText": "lated under the PSM and RMP programs. \nThis is the same type of ammonia commonly sprayed on fields by farmers to fertilize crops. \n\nAnhydrous ammonia is used as a refrigerant throughout the plant to maintain desired meat temperatures in coolers, freezers and working areas. Expelling heat caused from altering the ammonia between a liquid and a gas state creates refrigeration in the facility. The refrigeration system consists of a series of compressors, condensers, evaporators, vessels, piping and valves. There is currently 336,993 pounds of ammonia in the refrigeration system throughout the plant. \n\nOur Five Year Accident History \n\nIn the past five years, the facility has not had an accident involving ammonia that resulted in any on-site deaths, injuries, or significant property damage or that resulted in any deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place. \n\nOur Emergency Response Program \n\nThe facility implements an integrated contingency plan to address all emergency response scenarios. These scenarios include response procedures for various types of chemical releases, fires, floods and other system failures and natural disasters. This plan is reviewed annually and made available to the local fire department and the local emergency planning committee. Each year, the local fire department visits the facility for refresher orientation and emergency preparedness.\n \n\n\nOur Planned Changes to Improve Safety \n\nNo substantial projects are currently planned. Our procedures are established to promote continuous improvement in our operations through inspection, training and auditing. \n"
    }
  ]
}