{
  "FacilityID": 1000061803,
  "FacilityName": "Star Roses",
  "FacilityStr1": "41700 Road 100",
  "FacilityStr2": null,
  "FacilityCity": "Dinuba",
  "FacilityState": "CA",
  "FacilityZipCode": "93618",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.545583",
  "FacilityLongDecDegs": "-119.349472",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Conard-Pyle Company",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Star Roses",
  "OperatorStr1": "P.O. Box 217",
  "OperatorStr2": null,
  "OperatorCity": "Dinuba",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93618",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000072413",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-12-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-01-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-01-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.54558,
  "FRS_Long": -119.34947,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077435,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000061803,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096237,
          "ProcessID": 1000077435,
          "ChemicalID": 56,
          "Quantity": 17000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000078621,
          "ProcessID": 1000077435,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000065127,
              "Process_NAICS_ID": 1000078621,
              "SafetyReviewDate": "2016-10-31 00:00:00",
              "PHA_Date": "2016-10-24 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-03-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-08-08 00:00:00",
              "TrainingReviewDate": "2015-04-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-04-22 00:00:00",
              "EquipmentInspectionDate": "2016-12-13 00:00:00",
              "EquipmentTested": "Ammonia Detection",
              "ChangeMgmtDate": "2015-05-19 00:00:00",
              "ChangeMgmtReviewDate": "2015-04-22 00:00:00",
              "PreStartupReviewDate": "2016-05-19 00:00:00",
              "ComplianceAuditDate": "2015-02-16 00:00:00",
              "AuditCompletionDate": "2015-02-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-04-22 00:00:00",
              "HotWorkPermitReviewDate": "2015-04-22 00:00:00",
              "ContractorSafetyReviewDate": "2015-04-22 00:00:00",
              "ContractorSafetyEvalDate": "2016-12-19 00:00:00",
              "CBI_Flag": 0,
              "Description": "Our Risk Management Plan is complete.  Our company has established and improved upon policies and procedures to promote overall plant, worker and public safety.\n\n\n\nOur company has an outstanding safety record, one that we are quite proud of.  Many policies and procedures have been implemented to promote overall plant, worker and public safety.  Nevertheless, Star Roses  continually strives to improve in all areas, including safety.  Preparation of this Risk & Process Safety Management Program has been the primary recent improvement, and implementation of the program is our plan for improved safety in the near future.\n\n\n\nThe Risk & Process Safety Management Program has been written so that program elements are aligned with Star Roses  business practices rather than the order presented in the law.  Thus, Safe Operating Procedures are grouped together for the benefit of our system operator.  Safe Operating Policies are grouped together so that appropriate office staff may administer them.  The Emergency Action Plan is now separated out and distributed widely through the plant for easy reference.\n\n\n\nThe Risk & Process Safety Management Program documentation forms and company policy forms pertaining to employee, contractor, and community safety have been carefully reviewed so as to prevent unnecessary complexity and redundancy.  Our operator assisted in the writing of Standard Operating Procedures, and they are presented in a format which is easy to use.\n\n\n\nFor the future, Star Roses, now thinks of the Risk & Process Safety Management Program as a \"living document\".  It is an interactive framework that guides safe action for Star Roses employees, but allows for feedback and continual improvement.  Through the Risk & Process Safety Management Program Star Roses will continue to profit while maintaining overall plant, worker and public safety.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000080347,
                  "PreventionProgram3ID": 1000065127,
                  "ProcessChemicalID": 1000096237
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000061803,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Tulare County Environmental Health",
    "CoordinatingAgencyPhone": "5596247400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061803,
      "SummaryText": "1. Executive Summary\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n- California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Star Roses has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 Star Roses, Risk and Process Safety Management Program\n\n\n\nThis is to inform all interested persons, including employees, that Star Roses has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following process which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nProcess Name               | Process Chemical              | Process Quantity(lbs.)\n\nAmmonia Refrigeration        Anhydrous Ammonia               17,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\n\n\n\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1. Prepared a unified program based on the PSM regulation to meet CalARP and RMP obligat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061803,
      "SummaryText": "ions as well\n\n2. Organized the program so that it meshes closely with general business practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Description\n\n\n\nStar Roses operates a commercial cold storage for bare root roses in Dinuba, CA. The facility has an ammonia refrigeration system that provides refrigeration capacity to the following: (7) Rooms (1) Wet Room (1) Loading Dock. The refrigerated spaces are equipped with air-cooling evaporators and accumulators as required for flooded operation.Most control valve groups are located on the roof to provide easy access. The refrigeration machinery is contained within or directly above the machinery room. \n\n\n\nThe flooded system operates as follows: high pressure liquid from the high pressure receiver is piped to each cold room, where it passes through an expansion valve into low temperature and pressure accumulator mounted behind the bunker wall. From the accumulators, low pressure liquid is circulated through evaporator coils. As heat is absorbed, the liquid ammonia evaporates to form low temperature and pressure gas which is returned to the accumulator vessels. The suction gas is returned from the accumulators through a suction return line to each main suction accumulator.  From each main suction accumulator, ammonia is piped to the suction inlet on the compressors. The high pressure discharge from the compressors is sent to water-cooled evaporative condensers where the high pressure gas ammonia is cooled, liquefied and returned to the high pressure receivers.\n\n\n\nThe system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and pressure relief valves which vent to the atmosphere if the pressur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061803,
      "SummaryText": "e in the system exceeds their set point. \n\n\n\nThere are two ammonia detectors installed inside the refrigeration machinery room. Both sensors are set at the California OSHA permissible exposure limit of 25 ppm (one detector is for backup), which will activate the mechanical ventilation system at a normal rate of 20 air changes per hour and activate an audible alarm and strobe. Also, a sampling system is installed in each refrigerated area that provides two-minute interval monitoring. The sampling system is set at the California OSHA permissible exposure limit of 25 ppm, which will activate an audible alarm and strobe.\n\n\n\nAn emergency control box is installed on the east exterior wall of the refrigeration machinery room, which contains three valves. The high and low side of the system each have a valve that would discharge to atmosphere. The connecting pipe between the high and low side has one equalizer valve that would equalize the system.\n\n\n\nThe ammonia refrigeration system at Star Roses consists of vessels, equipment, and valves which are interconnected by piping.  As such, the refrigeration system at Star Roses is treated as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nStar Roses has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 Anhydrous Ammonia\n\n\n\nThe ammonia refrigeration process at the Star Roses facility is an integral part of the overall business and operates most of the year"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061803,
      "SummaryText": ". It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep active records of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n\n\n1.4 Five Year Accident History\n\n\n\nStar Roses has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\n\n\nStar Roses' emergency action and response program has been developed to satisfy the following requirements:\n\n- Cal/OSHA's Emergency Action Plan - Title 8 CCR ?3220\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Emergency Action Plans - Title 29 CFR ?1910.38\n\n- Cal/OSHA's Process Safety Management [Emergency Response Program Requirements] - Title 8 CCR ?5189(n)\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Process Safety Management [Emergency Planning and Response Requirements]- Title 29 CFR ?1910.119(n)\n\n- California Accidental Release Prevention (CalARP) Program [Emergency Response Program Requirements] - Title 19 CCR, Division 2, Chapter 4.5 ?2765.1-2765.2\n\n- USEPA Risk Management Program [Emergency Response Program Requirements] - Title 40 CFR ?68.95\n\n- California Hazardous Materials Business Plan (HMBP) [Emergency Response Plans and Procedures] - Title 19 CCR, Division 2, Chapter 4 ?2731\n\n- California \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) - Title 8 CCR Title 8 ?5192(q)\n\n- Federal \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) - Title 29 CFR ?1910.120(q)\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000061803,
      "SummaryText": "ersonnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\n\n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nStar Roses has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Star Roses continually strives to improve in all areas, including safety.\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Star Roses' ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Star Roses' management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nStar Roses has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Star Roses has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\nFor the future, Star Roses now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Star Roses employees, but allows for feedback and continual improvement. Through the RMP-PSM program Star Roses will continue to maintain overall plant worker and public safety."
    }
  ]
}