{
  "FacilityID": 1000109163,
  "FacilityName": "The LYCRA Company LLC, Waynesboro",
  "FacilityStr1": "400 Dupont Blvd.",
  "FacilityStr2": "N/A",
  "FacilityCity": "Waynesboro",
  "FacilityState": "VA",
  "FacilityZipCode": "22980",
  "Facility4DigitZipExt": "9998",
  "FacilityCountyFIPS": "51015",
  "LEPC": "Augusta Joint LEPC",
  "FacilityLatDecDegs": "38.061111",
  "FacilityLongDecDegs": "-078.883333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 10063600,
  "ParentCompanyName": "The LYCRA Company LLC",
  "Company2Name": null,
  "CompanyDUNS": 80976539,
  "Company2DUNS": null,
  "OperatorName": "The LYCRA Company LLC",
  "OperatorStr1": "400 Dupont Blvd.",
  "OperatorStr2": "N/A",
  "OperatorCity": "Waynesboro",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "22980",
  "OperatorZipCodeExt": "9998",
  "FTE": 399,
  "OtherEPAFacilityID": "22980DPNTWDUPON",
  "EPAFacilityID": "100000051604",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "VR080517",
  "SafetyInspectionDate": "2023-05-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-12-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-12-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-12-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-12-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 38.061111,
  "FRS_Long": -78.883333,
  "FRS_Description": "AIR RELEASE STACK",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000136250,
      "AltID": "EDA",
      "FacilityID": 1000109163,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000170892,
          "ProcessID": 1000136250,
          "ChemicalID": 26,
          "Quantity": 87000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000137743,
          "ProcessID": 1000136250,
          "NAICSCode": "32522",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000109163,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-04-05 00:00:00",
    "ERTrainingDate": "2023-03-29 00:00:00",
    "CoordinatingAgencyName": "Waynesboro Fire Department",
    "CoordinatingAgencyPhone": "5409426730",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000109163,
      "SummaryText": "tdown systems at the loading\nareas.\n? Reducing the risk of overfilling by having level alarms and/or indicators on storage tanks and bullets.\n? Implementing procedures for loading/unloading operations that help prevent a truck driver from driving away before the loading arm is properly disconnected.\n\nFive-Year Accident History\n\nWithin the last five years, there have been no releases of RMP substances that resulted in onsite injuries, death, property damage, or offsite impacts.\n\nEmergency Response Program\n\nThe facility will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Waynesboro facility with the Augusta LEPC and local emergency response. A specific Emergency Response Action Plan for the facility is in place, and that plan has been coordinated with local officials. The Emergency Response Program provides the essential planning for effectively protecting workers, the public, and the environment during emergency situations.\n\nPlanned Changes to Improve Safety\n\nInternal table-top and physical drills will ensure that the level of safety protection at the facility is periodically evaluated for improvements. An ongoing dialogue with the Augusta County LEPC Director or their designate, Waynesboro Emergency Services and local emergency response (Waynesboro Fire Department, Police, and Dooms Fire Department) will ensure a constant state of readiness to respond to any potential emergencies as well as a means to implement improvements as the need develops."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000109163,
      "SummaryText": "-listed chemical, EDA, so the site utilizes an Emergency Response Plan.\n\nStationary Source and Regulated Substances\n\nThe Waynesboro facility is operated by LYCRA to produce LYCRA® and HyFit® brand spandex. The\nbranded spandex is made in Classic facility, which was put into service in the early 1960s. The Classic facility is located near the center of the plant. The Classic production facility consist of three basic areas: polymer processing, spinning, and recovery. The site also has the Benger R&D facility and a Chemistry lab. Both of these facilities have the primary responsibility of support for spandex operations.  \n\nEthylenediamine (EDA) is the only toxic substance regulated under the Risk Management Program (RMP) that is present at the Waynesboro facility in amounts above threshold quantity. This chemical is used as an additive in the spandex polymer process. The facility is regulated under the Program Level 1 requirements.\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe Waynesboro facility is not required to implement the Program Level 3 prevention program requirements under the RMP regulations because they are eligible for RMP Program Level 1. However, ongoing analysis of the potential hazards of the process, detailed training of employees, and emphasis on safety has helped avoid any serious chemical release accidents over the last five (5) years. Part of their program has also involved identifying and taking steps to avoid potential accidental chemical releases. A few examples of the prevention features implemented at this facility include: \n\n? A tank and delivery containment system that will easily accommodate a complete release of EDA from\nboth tanks if they were at full capacity.\n? Preventive maintenance and testing of vessels through the Mechanical Integrity program helps to ensure that structural failures do not occur in process equipment.\n? Minimizing the possibility of a release of EDA by having emergency shu"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000109163,
      "SummaryText": "The LYCRA Company, LLC, Waynesboro\nWaynesboro, VA\n\nEXECUTIVE SUMMARY\nFOR \nTHE RISK MANAGEMENT PLAN (RMPlan)\n\nIntroduction and Policies\n\nThis is an executive summary of the policies, procedures and activities for compliance with the EPA's Accidental Release Prevention Requirements - Risk Management Program pursuant to Title 40 Part 68 of the Code of Federal Regulations (40 CFR 68) for The LYCRA Company, LLC facility located in Waynesboro, Virginia (LYCRA).\n\nLYCRA is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors, and the public while fully complying with applicable laws and regulations. LYCRA\u0092s management philosophy goals are achieved through the implementation of its Environmental Health and Safety Management Systems, by the personal commitments of employees and contractors and by open communication with employees, customers, neighbors, and regulators.\n\nThe purpose of this Risk Management Plan is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency response plans in the event of an accidental release, the five-year accident history of the facility and planned changes to improve safety at the plant.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe accidental release prevention and emergency response programs in place at the facility are part of the high standards striven for by LYCRA. These high standards include:\n? Operating in compliance with required environmental permits and regulations.\n? Operating and maintaining the assets in such a manner that unintentional releases are minimized.\n? Operating and maintaining assets in such a manner that the small releases associated with normal\noperation and maintenance will be minimized to the extent possible.\n? Correcting non-compliance found by regular audits of the facility.\n\nThe Waynesboro facility is a responding facility for releases of the RMP"
    }
  ]
}