{
  "FacilityID": 1000060184,
  "FacilityName": "OWB Packers, LLC",
  "FacilityStr1": "57 East Shank Road",
  "FacilityStr2": null,
  "FacilityCity": "Brawley",
  "FacilityState": "CA",
  "FacilityZipCode": "92227",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Imperial County CUPA",
  "FacilityLatDecDegs": "32.995890",
  "FacilityLongDecDegs": "-115.520000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "EBrandt@oneworldbeef.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Eric Brandt",
  "OperatorStr1": "6363 Knott Avenue",
  "OperatorStr2": null,
  "OperatorCity": " Buena Park",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90620",
  "OperatorZipCodeExt": null,
  "RMPContact": "Eduardo Beltran",
  "RMPTitle": "Refrigeration Manager",
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000195353",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-09-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-09-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "50",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075157,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000060184,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000076339,
          "ProcessID": 1000075157,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092925,
          "ProcessID": 1000075157,
          "ChemicalID": 56,
          "Quantity": 70000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000592925,
          "ProcessID": 1000075157,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060184,
      "SummaryText": "OWB PACKERS CALIFORNIA, LP - BRAWLEY, CALIFORNIA (previously owned and operated by NATIONAL BEEF CALIFORNIA, LP) \n\n\n\n1. EXECUTIVE SUMMARY\n\n\n\nOWB Packers, LLC (\"OWBP\") has acquired a currently idle beef processing facility located at 57 East Shank Road, Brawley, California 92227 (\"Facility\"), previously owned and operated by National Beef California, LP. OWBP will utilize the existing ammonia refrigeration system which will contain anhydrous ammonia (CAS Number 7664-41-7), a regulated hazardous substance, for the refrigeration of meat at the Facility. The maximum intended inventory of anhydrous ammonia on site is expected to be approximately 70,000 pounds, which is above the threshold quantity listed in 40 Code of Federal Regulations (CFR) part 68.130. The previous owner, National Beef, shut down the refrigeration system and removed all of the ammonia when it ceased operating the Facility in 2014. The system will be recharged to its normal inventory as part of the Facility restart.\n\n\n\nAnhydrous ammonia is a regulated substance under Federal EPA's Code of Federal Regulations, Title 40, Part 68, Accidental Release Prevention Requirements, and under the California Code of Regulations, Title 19 (Public Safety), Division 2 (Office of Emergency Services), Chapter 4.5, California Accidental Release Prevention (\"CalARP\") Program.\n\n\n\nThe previous Facility owner developed a Risk Management Plan (\"RMP\") to address the CalARP Program requirements (California Health and Safety Code, Title 19, Division 2, Chapter 4.5, Sections 2735-2785). The RMP includes three major elements: (1) hazard assessment; (2) prevention program; and (3)emergency response program. CalARP requires that the RMPs be updated at least every five years. Since five years have passed since the last RMP resubmittal (2011), this document represents the five-year resubmittal of the Facility RMP. \n\n\n\n1.1 Accidental Release Prevention and Emergency Response Policies\n\n\n\nOWBP is committed to the protection of the safet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060184,
      "SummaryText": "y, health, and environment in our routine operations and emergency responses. Our prevention and emergency response practices are developed to protect the public as well as our own employees. It is our policy to comply with all applicable laws, and to support and work with local emergency response agencies. To implement this policy, the following plans are maintained and implemented at the Facility:\n\n\n\n* Emergency Response Plan\n\n* Process Safety Management (PSM) Program\n\n* Risk Management Program\n\n\n\nThese programs and procedures provide comprehensive planning for accidental and emergency situations.\n\n\n\n1.2 Description of OWBP and the Regulated Substance Handled\n\n\n\nThe OWBP Facility in Brawley is a beef processing facility. Live cattle are received and slaughtered, and fresh meat is cut and packaged. The ammonia refrigeration system provides the necessary refrigeration for the beef products. In addition, the ammonia refrigeration system is utilized to provide some cooling for the plant itself. There will be approximately 70,000 pounds of anhydrous ammonia located within the closed-loop ammonia refrigeration system.\n\n\n\n1.3 The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nOWBP has specific process controls in place to minimize the risks of spills. OWBP is subject to OSHA's Process Safety Management Program (\"PSM\"). OWBP has a preventative maintenance program in place to maintain all vital parts of the ammonia refrigeration system. All inspection and testing procedures are addressed within this program. In addition, there are many safety controls installed within the system. These include an interlock system, relief and check valves, manual and automatic shutoffs and alarms located within the ammonia refrigeration system.\n\n\n\n1.4 Five year Accident History\n\n\n\nOWBP acquired the Facility on June 15, 2016. There were no accidents meeting the reporting requirements of this Section in the last three of the five years prior to OWBP's "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060184,
      "SummaryText": "acquisition.\n\n\n\n1.5 The Emergency Response Program\n\n\n\nOWBP's emergency response policies summarize the actions to be taken in response to a chemical spill. In the event of a spill, OWBP will react with the proper actions as listed in the Emergency Response Plan in cooperation with the local emergency response agencies. Local emergency responders are familiar with the Facility and the hazards of a release event.\n\n\n\n1.6 Planned Changes to Improve Safety\n\nSafety is the first priority of OWBP's daily operations. OWBP seeks to provide safe working conditions for all of its employees and to protect the environment. OWBP is fully committed to continuously improving the Facility's safety by implementing best practices through employee training and by promoting a culture of care and responsibility. \n\n"
    }
  ]
}