{
  "FacilityID": 1000089222,
  "FacilityName": "Michigan Turkey Producers",
  "FacilityStr1": "1100 Hall St",
  "FacilityStr2": null,
  "FacilityCity": "Grand Rapids",
  "FacilityState": "MI",
  "FacilityZipCode": "49503",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26081",
  "LEPC": "Grand Rapids LEPC",
  "FacilityLatDecDegs": "42.941389",
  "FacilityLongDecDegs": "-085.695278",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A3",
  "LatLongDescription": "UN",
  "FacilityURL": "www.miturkey.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 114790210,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Brian Boerigter",
  "OperatorStr1": "1100 Hall St SW",
  "OperatorStr2": null,
  "OperatorCity": "Grand Rapids",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49503",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000194247",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-03-01 00:00:00",
  "SafetyInspectionBy": "Affinity Captive",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-08-07 07:51:54",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-08-07 07:51:54",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-08-07 07:51:54",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-08-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 42.94188,
  "FRS_Long": -85.69456,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "300",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110989,
      "AltID": "Turkey Processing",
      "FacilityID": 1000089222,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000138671,
          "ProcessID": 1000110989,
          "ChemicalID": 56,
          "Quantity": 23000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000112282,
          "ProcessID": 1000110989,
          "NAICSCode": "311615",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000094577,
              "Process_NAICS_ID": 1000112282,
              "SafetyReviewDate": "2016-03-31 00:00:00",
              "PHA_Date": "2016-03-31 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-01-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Human Factor",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Burst Sensors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-07-27 00:00:00",
              "TrainingReviewDate": "2020-07-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-07-23 00:00:00",
              "EquipmentInspectionDate": "2020-01-30 00:00:00",
              "EquipmentTested": "Entire Facility",
              "ChangeMgmtDate": "2015-11-13 00:00:00",
              "ChangeMgmtReviewDate": "2015-11-13 00:00:00",
              "PreStartupReviewDate": "2016-07-11 00:00:00",
              "ComplianceAuditDate": "2020-07-01 00:00:00",
              "AuditCompletionDate": "2020-09-30 00:00:00",
              "IncidentInvestigationDate": "2015-06-15 00:00:00",
              "InvestigationChangeDate": "2015-06-16 00:00:00",
              "ParticipationPlansReviewDate": "2020-07-01 00:00:00",
              "HotWorkPermitReviewDate": "2019-12-04 00:00:00",
              "ContractorSafetyReviewDate": "2020-07-15 00:00:00",
              "ContractorSafetyEvalDate": "2020-07-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000118116,
                  "PreventionProgram3ID": 1000094577,
                  "ProcessChemicalID": 1000138671
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000089222,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-06-12 00:00:00",
    "ERTrainingDate": "2020-06-10 00:00:00",
    "CoordinatingAgencyName": "Wyoming Fire Department",
    "CoordinatingAgencyPhone": "6165307300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "29 CFR 1910.119"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089222,
      "SummaryText": "es and immediately with new associates.\r\n\r\nAll contractors that work in the area of anhydrous ammonia are given safety awareness training before the job begins. They are made aware of the hazards of anhydrous ammonia and they are made aware of all exit routes and in-house shelter areas. We also review the work related injuries and illness for our refrigeration contractor and contractors that work close to ammonia annually. We discuss the injury/illness with our PSM group to evaluate the contractor. We also perform monthly audits on the contractor while they are on site to make sure safety regulations are being followed and understood.\r\n\r\nOur local fire department has a HAZMAT program. We work with our local LEPC for coordination and emergency response. A few MTP maintenance associates have been FIT tested and trained how to use the full-face respirator.\r\n\r\nTo help improve our safety we meet every month to discuss any issues, corrections and upcoming projects or concerns regarding refrigeration. \r\n\r\nOverall Michigan Turkey Producers feels we are taking the right steps to help our facility be a safe and well maintained facility for our associates and neighbors. We are a proactive facility and we want to do what's best for our community."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089222,
      "SummaryText": "because it is an event that is more likely to occur than the worst case scenario listed above. The alternate case radius was determined by using the EPAs RMP Guidance for Ammonia Refrigeration\r\n\r\nOur ammonia vessels are located inside the facility and the valve stations are located on the roof. There are two ammonia sensors in the engine room set at 25 ppm and 50 ppm. Also each refrigerated make-up air unit has an ammonia sensor in it. To date we have not had a qualified accidental release.\r\n\r\nThere are nine points of alarm monitoring in the engine room and there are six ammonia sensors in the facility. When an alarm is activated it will send an alarm to Security 24/7. Security will call management to determine the type of alarm. All alarms are handled with immediate response and investigation followed by necessary repair if needed. Alarm points consist of High Level Float on each system, High discharge pressure, Low Suction alarms - Compressor Shutdown on each system, High Suction Alarm on each system and Low level alarms on each system. \r\n\r\nWe have an extensive Preventative Maintenance program. Listed are a few examples. We perform weekly inspections of our valve stations. We listen for excessive force while opening and closing. We inspect our defrost relief lines for frost. We turn all valves annually. We inspect our vessels monthly, quarterly and semi-annually and we test our float columns. We inspect the inside of our condensers annually. We calibrate our ammonia sensors semi-annually and we replace our ammonia sensors every two years. We also replace our safety relief valves every five years.\r\n\r\nIn regards to mechanical repairs and maintenance, MTP will only make small/trained repairs. Our contractor will complete any major repairs or projects. MTP is very proactive with changes and repairs to help the system run more efficiently and successfully. With any welding, burning or other hot work to be performed on or near the refrigeration system MTP requires a H"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089222,
      "SummaryText": "Michigan Turkey Producers (MTP) at 1100 Hall St SW is a further processing facility. We cater to the food service and deli services making a variety of finished products. We specialize in turkey with some pork and chicken. We average 35 million pounds of finished goods. At MTP we use anhydrous ammonia as a refrigerant for our facility. We have 23,000 lbs. on site.\r\n\r\nAt MTP we have a two-temperature/pressure ammonia refrigeration system. The system is a single stage temperature that makes up two temperatures.\r\n\r\nMTP follows the OSHA 1910 Standards, RETA (Refrigeration Engineers and Technical Association) and IIAR (International Institute of Ammonia Refrigeration) guidelines.\r\n\r\nThe worst case release scenario submitted for the Program 2 toxic substance as a class involves an unmitigated catastrophic release of ammonia used as a refrigerant. The scenario involves the release of 15,127 lbs of ammonia in a gas release for 10 minutes. At Class F atmospheric stability and 1.5 M/s wind speed, the maximum distance of 3.14 miles radius is obtained. Based on the 2010 US Census Bureau potentially 2,009 people could be affected by a release of this magnitude. The 15,127 lbs of ammonia was selected as the worst case release scenario because the is the quantity of ammonia that the largest vessel in the system (HPR) will contain when filled to 80%. The worst case radius was determined by using the EPAs RMP Guidance for Ammonia Refrigeration.\r\n\r\nOne alternative release scenario has been submitted for the toxic substance present in the Program 3 process. The alternative release scenario for ammonia involves a safety relief valve venting to atmosphere. The scenario involves the release of 816 lbs of ammonia in a gaseous form for 10 minutes, under atmospheric stability class D, wind speed of 3 m/s, 0.1 distance to endpoint. Based on the 2010 US census bureau Marplot, there are no residences within the release radius, no offsite population will be affected. This scenario was selected"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089222,
      "SummaryText": "ot Work Permit. Proper use of this form requires that the person authorizing the permit exercise sound judgment when evaluating the hot work to be performed. His/her evaluation must consider the presence of combustible materials in the affected area, protective equipment used by workers on site, atmospheric conditions of the work area, and types of materials to be used in the hot work process, and general sources of combustion.  We also have a program and procedure for Line Breaks. The purpose of this procedure is to ensure that MTP associates, contractors and company property are properly protected while engaged in: Breaking, disconnecting, or opening a line or hose that contains or has contained ammonia, performing service or maintenance on any refrigeration equipment that requires the isolation and opening the equipment, when a line is opened to change a seal or flange and performing tie-ins for modifications and/or additions to the system. A copy of the completed line break is kept on file for the life of the system.\r\n\r\nWe have Standard Operating Procedures written by a local third party refrigeration contractor. We review the SOPs annually and do refresher training every 3 years with our maintenance associates through our outside refrigeration contractor. Training includes a test.\r\n\r\nWe do semi-annual awareness training and annual classroom training at our facility. These training sessions have focused on basic refrigeration, entry level training as suggested by our refrigeration contractor and SOP training. We also perform annual Mechanical Integrity inspection and a five-year in depth Mechanical Integrity inspection by a third party contractor.\r\n\r\nAll associates are given brief awareness training during orientation, letting all associates know that we have ammonia on-site. Those associate who work in an area that use anhydrous ammonia receives further training and safety awareness training for that job. Training is reviewed semi-annually with current associat"
    }
  ]
}