{
  "FacilityID": 1000049399,
  "FacilityName": "West Chicago Rgnl Wastewater Treatment Facility",
  "FacilityStr1": "725 Dayton Ave.",
  "FacilityStr2": null,
  "FacilityCity": "West Chicago",
  "FacilityState": "IL",
  "FacilityZipCode": "60185",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "17043",
  "LEPC": "Dupage County LEPC",
  "FacilityLatDecDegs": "41.864100",
  "FacilityLongDecDegs": "-88.192101",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The City of West Chicago",
  "OperatorStr1": "475 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "West Chicago",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60185",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kendall S Coleman",
  "RMPTitle": "Project Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208198",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-04-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-04-10 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-04-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-08-16 00:00:00",
  "DeRegistrationEffectiveDate": "2018-05-01 00:00:00",
  "AnniversaryDate": "2020-04-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061947,
      "AltID": "Chlorine Disinfection",
      "FacilityID": 1000049399,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000063108,
          "ProcessID": 1000061947,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000076210,
          "ProcessID": 1000061947,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000576210,
          "ProcessID": 1000061947,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000049399,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nFederal Regulation 40 CFR 468 requires that a Risk Management Plan (RMP) be developed for listed substances that are store in quantities above certain threshold limits. The only substance at the City of West ChicagoA?s Wastewater Treatment Plant (WWTP) to meet the specified criteria is the chlorine gas used for disinfection of the final effluent. The WWTP is subject to the RMP Program 2, however in order to meet the requirements of OSHAA?s Process Safety Management program, the RMP Program 3 requirements for the chlorine system were incorporated.\n\n\n\nManagement Policy\n\n\n\nThe goal of the West Chicago Wastewater Treatment Plant Risk Management Program (RMP) is to reduce the risk to employees and the public of injury or death from the accidental release of chemicals.  The management of the West Chicago Wastewater Treatment Plant is committed to achieving this goal.\n\n\n\nManagement systems are in place to ensure that everyone who plays a part in the RMP understands their roles and responsibilities and that responsibilities are assigned for all program elements.  The West Chicago Wastewater Treatment Plant Project Manager will have overall responsibility for development, implementation and integration of the RMP.  A designated Lead will have overall responsibility for the RMP in the absence of the Project Manager. \n\n\n\nThe Project Safety Team assists the Project Manager in the implementation of the safety program. Employee commitment and participation is a key element in the safety program. Employees generally enjoy participation and provided significant input in the following program components.  \n\n\n\n\n\nProcess Safety Information-Each facility must maintain toxicity information, permissible exposure levels (PELs), physical data, reactivity data, corrosivity data, thermal and chemical stability data, synergistic effects from mixing process flow, process chemistry, safe upper and lower operating limits, maximum intended inventory, consequences of process d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000049399,
      "SummaryText": "eviation, and detailed process design (piping, instrumentation, mass balance, electrical, safety, ventilation , etc.) information.\n\n\n\nProcess Hazard Analysis-A Process Hazard Analysis (PHA) must be performed in accordance with generally accepted methodologies (i.e. What If/Checklist Analysis, Failure Mode and Effect Analysis, Hazard and Operability Studies, etc.).  This PHA must be revalidated and updated once every 5 years, and the two most recent analyses must be retained on active file.  The PHA is one of the most important components of the RMP.\n\n\n\nOperating Procedures-Detailed process operating procedures must be developed, implemented, and maintained for each hazardous process, including steps for each operating phase (including startup, shutdown, etc.), safety procedures, and safety and health considerations.  These must be more site-specific than the generic equipment O&M manuals that are usually available.\n\n\n\nTraining  (Initial, Refresher, and Supplementary)-All employees involved with working with these processes must be thoroughly trained in process and safety (including emergency) procedures.  The West Chicago Wastewater Treatment Plant must document that each employee has received the required training.  Training and operating procedures are the most frequently cited elements in OSHA PSM inspections.\n\n\n\nContractors-The West Chicago Wastewater Treatment Plant must ensure that contractors working near these processes are informed of all hazards related to the work and the emergency action plan.  Employers must evaluate safety performance before contractor selection, log contractor injury and illness, and periodically evaluate performance.  Well designed programs can reduce incidents and loss-related cost.\n\n\n\nPre-startup Safety Reviews-A pre-startup safety review must be performed on new or modified processes to ensure that equipment and construction meet design specifications, that procedures and training have been implemented, and that hazard analysis re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000049399,
      "SummaryText": "commendations have been resolved.  These reviews also result in more trouble free startup.\n\n\n\nMechanical Integrity-The mechanical integrity of process equipment will be documented and maintained through inspection and testing programs and through detailed maintenance documentation.  Written procedures, training, and quality assurance programs are also necessary.  This program can improve equipment reliability and reduce unplanned shutdowns.\n\n\n\nHot Work Permit-An authorization and permit program for welding and brazing activities near or around the regulated processes shall be implemented and maintained at the West Chicago Wastewater Treatment Plant.  More importantly, for the chlorine system, it may include  instituting other safe work practices, such as a line-breaking procedure.\n\n\n\nManagement of Change-A program must be implemented to prevent incidents caused by changes in process chemicals, technology, equipment, or procedures.  This is a difficult element to implement because a strong management structure is required to ensure that production-enhancing changes are reviewed prior to implementation.\n\n\n\nIncident Investigation-Incident investigation, reporting, and documentation procedures must be prepared and implemented for any incident that did or could have resulted in an emergency situation.\n\n\n\nCompliance Audits-In-house compliance audits must be performed at least once every 3 years to verify that the program elements are in place and that they have been implemented effectively.\n\n\n\nFacility Description\n\n\n\nThe City of West Chicago Wastewater Treatment Plant treats an average of 7.64 million gallons per day with wet weather peak flows up to 20.3 million gallons per day. Treated effluent is discharged to the West Branch of the Dupage River. The treated effluent is disinfected prior with chlorine gas, then dechlorinated prior to discharge to the river.\n\n\n\nThe amount of chlorine on hand is determined by the seasonal disinfection requirements. At all times of year, "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000049399,
      "SummaryText": "high flow bypasses to the Excess Flow Outfall A01, must receive chlorination. During the months of May through November, the normal plant effluent must receive chlorination as well. There have been no accidental releases of chlorine in the past 5 years.\n\n\n\nEmergency Response Program\n\n\n\nThe City of West Chicago Wastewater Treatment Plant has developed an emergency response plan that addresses the following elements:\n\n\n\n-    Natural events \n\n-    Operational and mechanical failures\n\n-    Civil disturbances\n\n-    Chemical releases\n\n\n\nFor the listed chemical chlorine gas, the City of West Chicago Fire Department will be the responder in the event of a chlorine gas emergency. Plant personnel receive routine training with regards to the chemical hazards, safe work procedures and emergency response procedures.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe City of West Chicago Wastewater Treatment Plant is coordinating efforts with the Fire department to conduct a chlorine emergency response exercise at the facility involving local and county emergency response teams. Plan to complete this training exercise in the Summer of 2015.\n\n"
    }
  ]
}