{
  "FacilityID": 1000040439,
  "FacilityName": "Upham Office",
  "FacilityStr1": "999 Energy Ave",
  "FacilityStr2": null,
  "FacilityCity": "Mineral Wells",
  "FacilityState": "TX",
  "FacilityZipCode": "76067",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48363",
  "LEPC": "Palo Pinto  LEPC",
  "FacilityLatDecDegs": "32.814167",
  "FacilityLongDecDegs": "-098.068889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "LF",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Upham Oil & Gas Company, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Upham Oil & Gas Company",
  "OperatorStr1": "P.O. Box 940",
  "OperatorStr2": null,
  "OperatorCity": "Mineral Wells",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76068",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000008065",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-08-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.81417,
  "FRS_Long": -98.06889,
  "FRS_Description": "LOADING FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000049872,
      "AltID": "Propane Storage",
      "FacilityID": 1000040439,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000060403,
          "ProcessID": 1000049872,
          "ChemicalID": 98,
          "Quantity": 62000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000050335,
          "ProcessID": 1000049872,
          "NAICSCode": "213112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000032843,
              "Process_NAICS_ID": 1000050335,
              "SafetyReviewDate": "2014-04-10 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Railroad Commision of Texas",
              "FR_Comments": null,
              "HazardReviewDate": "2014-04-10 00:00:00",
              "ChangeCompletionDate": "2014-04-10 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-04-10 00:00:00",
              "TrainingReviewDate": "2014-04-10 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Office Meeting",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Video / Oral Instruction",
              "MaintenanceReviewDate": "2014-04-10 00:00:00",
              "EquipmentInspectionDate": "2012-11-15 00:00:00",
              "EquipmentTested": "Snappy Joe valves, hose inspection, bulkhead inspection, dike inspection, tank inspection,",
              "ComplianceAuditDate": "2012-08-15 00:00:00",
              "AuditCompletionDate": "2012-12-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000033309,
                  "PreventionProgram2ID": 1000032843,
                  "ProcessChemicalID": 1000060403
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000040439,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-04-10 00:00:00",
    "ERTrainingDate": "2013-08-08 00:00:00",
    "CoordinatingAgencyName": "Mineral Wells Fire Dept",
    "CoordinatingAgencyPhone": "9403250350",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000040439,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThis facility complies with NFPA-58 requirements for LP-Gas storage and it is our policy to adhere to all applicable federal, state, and local laws. If an emergency were to occur, it is our policy to notify the Mineral Wells City Fire Department and local law enforcement agencies. The proper authorities will then activate our emergency response plan including evacuation and isolation if necessary.\n\nOur worst-case scenario is failure of the 18,000-gallon storage tank when filled to the greatest amount allowed (88% at 60F), resulting in a vapor cloud explosion. According to EPAA?s look-up tables, the distance to the one-psi overpressure endpoint is .3 miles. There are an estimated 74 private homes, 2 office buildings, 1 motel and golf course within portions of the blast radius. The total population within the blast radius is estimated to be 273 persons.\n\nThis facility is a refueling station for Upham Oil & Gas Company vehicles that utilize Propane as a motor fuel. Equipment on site includes an 18,000 gallon pressurized storage tank, transfer pumps, associated piping and refueling island.\n\nThis facility complies with EPAA?s accident prevention rule and all applicable state and local regulations. The propane system was installed in 1979 under the supervision and inspection of the Railroad Commission of Texas. The equipment has been upgraded, repaired or replaced as necessary to comply with state and local regulations.  Most recently in June of 2004, a new bulkhead and emergency shutdown valves have been installed to comply with the Railroad Commission of Texas.  The emergency shutdown valves can be activated 50 feet from the fueling island.  The valves limit product escape to the fueling hoses in case of a drive-away and/or severed  hose.\n\nWe have never had an accident involving propane that caused deaths, injuries, property or environmental damage, evacuations, or sheltering in place.\n\nOur emergency response plan had been discussed and is on file wit"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000040439,
      "SummaryText": "h the Mineral Wells Fire Department who will be called in the event of an emergency. Upham employees will react only in a defensive manner to a major release.\n\nRELEASE SCENARIOS\n\nWorst Case Scenario. Total failure of the 18,000-gallon propane storage tank when filled to the maximum amount allowed could result in a vapor cloud explosion. According to EPA look-up tables, the distance to the 1-psi overpressure endpoint is .3 miles. See Executive Summary for details.\n\nAlternate Release Scenario. A more likely event would be a A?Pull Away ExplosionA? resulting from the driver failing to remove the transfer hose prior to moving the vehicle. In this scenario, the failure involves a 25 ft. length of 3-inch diameter unloading hose. The active mitigation devices (excess flow valve) and check valve are assumed to work as designed, limiting the release to the contents of the hose. The release leads to a vapor cloud explosion (end point 1 psi). The quantity released is 39 pounds. The distance to the end point is .027 miles or 145 feet.\n\nSAFETY INFORMATION\n\nPropane is a gas at normal temperatures and pressures. It is liquefied by storing it in a closed container at pressures higher than its equilibrium vapor pressure. There is a direct relationship between ambient temperature and the pressure inside the storage container. As the ambient temperature increases, the pressure of the container increases proportionately. According to NFPA 58, 1998 edition, Table B-1.2.1, commercial propane when heated to a temperature of 105 F will produce a pressure of 210 pounds per square inch, gauge (psig). NFPA 58 Edition, Table 2-2.2.2 sets the current minimum design pressure for an ASME tank at 250 pounds per square inch, absolute (psia). This design allows for a maximum vapor pressure of 215 psia at 100 F. The discharge piping for pumps and compressors is currently designed to 350 psi and vapor piping is designed for 250 psi according to NFPA 58, 1998 Edition, 3-2.10.2. The minimum temperatures"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000040439,
      "SummaryText": " are determined by the steel used in the design of the storage tank and the piping. Liquid Propane (if released at atmospheric pressure) can refrigerate steel pipes and tanks down to temperatures of 44 F.\n\nThis 18,000-gallon storage tank was manufactured by Riley-Beaird Inc. September 1979. Specifications are as follows: Serial Number 54298\n\nShell thickness:0.672\nHead thickness:0.384\nOutside diameter:109.344A?\nOverall length:54.391A?\nMax volume:18,253 gallons\nWeight:29,677 pounds\nSurface area:1186 Square Ft.\nThis tank is equipped with two 2A? diameter 250-psi relief valves. Both valves are vented through 2A? diameter risers equipped with rain caps. Liquid levels are taken with the Roto-Gauge with dial and dip tube for a 108A? inside diameter tank. A temperature probe is installed in the opposite end. The tank is painted reflective white in order to minimize heat accumulation from the sun\n\nOver-pressuring of the delivery system is avoided by the use of bypass valves. If the delivery hose is closed while the pump is activated, propane is bypassed back to the pump inlet until downstream pressure is relieved by opening the hose delivery valve.\n\nThe propane storage tank and refueling island were installed in accordance with guidelines obtained from the Railroad Commission of Texas and the equipment manufacturer. The utilization of explosion proof fittings, switches and remote control panel insures compliance with local electrical codes. Loading and unloading lines are equipped with A?Snappy JoeA? and A?Pull-AwayA? valves which, in conjunction with remotely operated spring-loaded manual valves, protect this system from drive away releases. Should a release occur, the lack of public receptors in the immediate area of the storage tank limit the exposure to the public. It is likely that any propane released will be dissipated by the prevailing north-south winds before leaving Upham property.\n\nHAZARD REVIEW\n\n1. Overfilling-if this tank is overfilled, it is possible that, due "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000040439,
      "SummaryText": "to expansion, venting may occur through the pressure relief valves. Any release is subject to fire or explosion and should be avoided. Overfilling is avoided by and through inventory control. Prior to ordering the delivery of propane, the exact amount on hand is confirmed by use of the rotary gauge. Office personnel determine that the amount ordered will not exceed storage available. Prior to unloading the transport, quantity on hand is again checked with Upham personnel and the transport driver present. Temperature and amounts to be delivered as well as inventory on hand are recorded. After delivery, levels and temperature are again checked and recorded. \n\n2. Vandalism-Tampering with the propane delivery system could result in injury of personnel or property. Tampering is controlled by locking valves and hoses used for propane transfer. The electrical system is disconnected after normal work hours by a time clock disconnect. Additional protection is provided by security lighting which is on from dusk to dawn.  Finally, A?NO TRESPASSINGA? signs have been installed.\n\n3. Pull-A-Way Hose Failure-It is possible for persons delivering or loading propane to drive away without disconnecting delivery hoses. The installation of a pull-a-way valve assembly in the loading hose will limit the amount lost to the liquid inside of the valve assembly. In addition, a pneumatic system will close the A?Snappy JoeA? valve at the bulkhead. Transport delivery is protected by the use of a block valve and one way check valve located at the bulkhead as well as a spring-loaded remote valve with manual actuator located near the storage tank. Once detected, the flow of propane can immediately be curtailed or eliminated. The bulkhead system is designed to fail above the cutoff valve and one-way check valve, which will remain intact.\n\n4. Equipment failure- All hoses are protected by at least two cutoff valves. The piping is constructed of quality materials, which exceed the pressure rating requi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000040439,
      "SummaryText": "red. Hoses are utilized daily by persons trained to recognize defects which might result in a release. Any items requiring maintenance or replacement are reported to the Upham Office.\n\n5. Acts of God- The geographical location of this facility has no history of earthquake, flood or other natural occurring disaster. The system is well grounded, sealed and therefore protected from lightning strikes. No roads are near the storage tank or bulkhead delivery system. Damage due to loss of control of a vehicle is unlikely.  Grass and weeds are controlled and not allowed to grow near the propane system thereby reducing the possibility of fire.\n\n6. Leak Detection- If a release or leak should occur, propane utilized in this facility is odorized. This will enable the detection of a very small leak. Corrective action can be taken to control the event.\n\nOPERATING PROCEDURES\n\nInventory.   Monthly inventory readings are taken and recorded in the Upham Office. Daily usage readings are crosschecked with monthly inventory. Records are available for review at the production clerkA?s desk. Prior to ordering the delivery of propane, the exact amount on hand is confirmed by use of the rotary gauge. Office personnel determine that the amount ordered will not exceed storage available. Prior to unloading the transport, quantity on hand is again checked with Upham personnel and the transport driver present. Temperature and amounts to be delivered as well as inventory on hand are recorded. After delivery, levels and temperature are again checked and recorded. \n\nDelivery.  Upham personnel are to be with the transport driver until connections are made and pumping initiated. Upham agent should unlock the equipment and insure that the following steps are taken. The transport should be grounded prior to connecting hoses. Both the delivery hose and vapor return hose should then be connected. (Note: Bleed off pressure on delivery connection prior to opening brass cap.) Open the remotely operated (cab"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000040439,
      "SummaryText": "le operated) vapor return and delivery valves at the storage tank, then open the 3A?  block valve on the delivery line and the 2A? Snappy Joe on the vapor return line. Upon confirmation that both the delivery line and vapor return are open, transfer of propane may commence. Upham personnel may leave the area at this time and return when the transfer is complete. Both Upham and the driver will again take quantity and temperature readings and confirm all valves opened are again shut and hoses disconnected. The necessary paperwork is retained and given to the production clerk for filing. The transport driver is free to depart at that time.\n\nRefueling Vehicles.  Unlock the fuel island cage and ground vehicle. Connect filler hose to vehicle tank. Open filler valve and Snappy Joe valve if shut. Engage the electric pump and monitor filling until vehicle reaches a maximum of eighty (80) percent maximum capacity. Disengage the electric pump, close the hose valve and disconnect from the vehicle tank. Disconnect the grounding clamp, replace the hose and secure the equipment inside the cage and lock the facility. Date, quantity transferred, vehicle number and mileage should be recorded on the proper form.\n\nInspection.  Each user of the propane refueling station is responsible for reporting any item that appears unsafe, worn, damaged or unserviceable that could lead to a release of product or contribute to an accident. Reportable items should be immediately reported to the safety coordinator or production clerk. \n\nTRAINING \n\nIt is the responsibility of each Area Supervisor to insure that newly hired employees are instructed in the use of the propane refueling system. Each new employee shall demonstrate to his or her supervisor a clear understanding of how to utilize the fuel system. MSDS sheet information will be discussed with each new employee detailing how the MSDS information is pertinent to the safety of the employee, his co-workers, the public and the environment. The Area"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000040439,
      "SummaryText": " Coordinator or the Safety Coordinator may conduct this training. The Safety Coordinator will conduct refresher training at periods not exceeding three (3) years. \n\nMAINTENANCE \n\nThis facility is considered a maintenance free facility insofar as daily, weekly or monthly maintenance. Deficiencies are reported daily by users of the system and repaired immediately. The valves, pump and piping require no periodic service. If pump seals or valves indicate a leak of product, they are changed. From time to time, regulatory agencies or manufacturers upgrade or alter equipment to improve safety or service. Our facility is upgraded accordingly.\n\nCOMPLIANCE AUDITS \n\nAt least every three years, at least one person who is knowledgeable about the process,  record keeping and training methods, will conduct an audit of the facility to determine that this facility is in compliance with Risk Management Plan requirements. The Safety Coordinator will retain record of the audit, discrepancies noted and curative actions taken for a period of five (5) years.\n\n\nINCIDENT INVESTIGATION\n\nEach incident that resulted in, or could have resulted in a catastrophic release of propane must be investigated no later than 48 hours after the incident. A written report will be made that contains the date of the incident, date investigation started, description of the incident, factors that contributed to the incident and any recommendations resulting from the investigation. All finding will be shared with employees affected. This report will be retained for a period of not less than five (5) years."
    }
  ]
}