{
  "FacilityID": 1000063680,
  "FacilityName": "Crum Compressor Station",
  "FacilityStr1": "52934 Township Highway 192",
  "FacilityStr2": null,
  "FacilityCity": "Senecaville",
  "FacilityState": "OH",
  "FacilityZipCode": "43780",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39121",
  "LEPC": null,
  "FacilityLatDecDegs": "39.897086",
  "FacilityLongDecDegs": "-81.353353",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "EnLink Midstream",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "EnLink Midstream Operating LP",
  "OperatorStr1": "2501 Cedar Spring Road, Suite 100",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75201",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000235621",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-06-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-06-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-06-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-03-26 00:00:00",
  "DeRegistrationEffectiveDate": "2020-03-02 00:00:00",
  "AnniversaryDate": "2022-06-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079896,
      "AltID": "Crude Stabilization",
      "FacilityID": 1000063680,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000099626,
          "ProcessID": 1000079896,
          "ChemicalID": 107,
          "Quantity": 11925.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000081116,
          "ProcessID": 1000079896,
          "NAICSCode": "32419",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000063680,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-05-01 00:00:00",
    "ERTrainingDate": "2017-03-06 00:00:00",
    "CoordinatingAgencyName": "Summerfield Fire Dept",
    "CoordinatingAgencyPhone": "7408382001",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "1910.119",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063680,
      "SummaryText": "The Crum Compressor Station (\"Crum\" or \"Facility\"), located near the town of Senecaville Ohio utilizes more than the threshold quantity of a \"regulated flammable substance\" (10,000 pounds) in the processing of natural gas. Therefore, this Facility is subject to the Risk Management Plan (RMP) requirements codified in Title 40 of the Code of Federal Regulations Part 68 (40 CFR 68) administered by the United States Environmental Protection Agency (US EPA). Crum is also subject to Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) standard (29 CFR 1910.119); however, based on the worst case analysis, there are no public receptors within the worst-case release scenario for the plant. Therefore, Crum is subject to Program 1 requirements as stated in 40 CFR 68.10. OSHA's PSM standard closely parallels requirements outlined in US EPA's RMP Rule. All elements required by US EPA's 40 CFR 68 - Program 1 Prevention Program are also required by OSHA's PSM.\r\n\r\n\r\na) The accidental release prevention and emergency response policies at the stationary\r\nsource\r\nCrum employs one (1) full-time employee on-site who will ensure the proper operation and maintenance of the Facility.\r\nCrum maintains a policy of safe condensate handling operations, reducing to the greatest extent possible hazards associated with the extraction processes, and reducing subsequent risk to the surrounding community, employees, and the environment.\r\nCrum has procedures in place, including both on-site activities and coordination with off-site responders that are to be followed in the event of a flammable material release. This Facility is submitting its first RMP to the US EPA. The Facility is non responsive.\r\n\r\n\r\nb) The stationary source and regulated substances handled\r\nBased on worst-case analysis, the distance to the endpoint does not encompass any public receptors. The closest public receptor (residential home) is approximately 0.37 miles from the Facility according to EP"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063680,
      "SummaryText": "A MARPLOT, whereas the furthest distance for worst case scenarios was 0.2 miles. In addition, Crum is subject to OSHA PSM. Therefore, Crum is classified as a Program 1 Facility. The processes at the plant are interconnected by piping and fit the EPA's definition of a stationary source in 40 CFR part 68.\r\nThe plant boundaries of the stationary source begin at pig receiver PR-100 at the plant gas inlet and at pig receiver PR-200 at the plant liquid inlet, and end at the pig launcher plant discharge just after the 12\" block valve tied to ESD-3300. This plant is designed to receive natural gas from a pipeline. The gas process begins with inlet separation to remove any pipeline liquids. These \"Y-Grade\" liquids are combined with the other inlet liquids then stabilized as a condensate to remove any materials that are not atmospheric stable liquids. The condensate is sent to storage and can then be trucked off site. The remaining gas is then compressed to pipeline pressures and goes through a dehydration process to ensure most of the water is removed from the gas before being exported offsite. The Crum Compressor Station was evaluated to determine if any regulated flammable or toxic substances exceeded a defined threshold quantity. The listed flammable substances that are stored above threshold quantities at Crum are natural gas, unstabilized condensate, stabilized condensate, and natural gas liquids. The flammable components of these substances include methane, ethane, propane, butanes, pentanes, hexanes, and heavier alkanes. This Facility is subject to the Risk Management Plan (RMP) requirements codified in Title 40 of the Code of Federal Regulations Part 68 (40 CFR 68) administered by the US EPA.\r\n\r\n\r\nc) The general accidental release prevention program and chemical-specific prevention\r\nsteps\r\nCrum employs one (1) full-time employee on-site who will ensure the proper operation and maintenance of the Facility. This Facility is submitting its first RMP to the US EPA. Crum"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063680,
      "SummaryText": "maintains a consistent accidental release prevention program to eliminate or minimize releases of NGL, condensate, and other RMP-regulated flammables. As previously indicated, the Prevention Program required under 40 CFR 68 is identical to the Prevention Program required under OSHA's PSM. As required under 40 CFR 68 Subpart A, Crum's Prevention Program 1 is required to analyze worst case release scenarios for covered processes and illustrate that the nearest public receptor is beyond the furthest endpoint, complete the 5 year accident history, ensure response actions are coordinated with local emergency planning and response agencies, and certify the following in writing:\r\n\r\n\"Based on the criteria in 40 CFR 68.10, the distance to the specified endpoint for the worst-case accidental release scenario for the following process(es) is less than the distance to the nearest public receptor: [list process(es)]. Within the past five years, the process(es) has (have) had no accidental release that caused offsite impacts provided in the risk management program rule (40 CFR 68.10(b)(1)). No additional measures are necessary to prevent offsite impacts from accidental releases. In the event of fire, explosion, or a release of a regulated substance from the process(es), entry within the distance to the specified endpoints may pose a danger to public emergency responders. Therefore, public emergency responders should not enter this area except as arranged with the emergency contact indicated in the RMP. The undersigned certifies that, to the best of my knowledge, information, and belief, formed after reasonable inquiry, the information submitted is true, accurate, and complete. [Signature, title, date signed].\"\r\n\r\n\r\nd) The five-year accident history\r\nThe Crum Compressor Station has not had an accidental release of a regulated substance where exposure to the substance, its reaction products, overpressure generated by an explosion involving the substance, or radiant heat generated b"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000063680,
      "SummaryText": "y a fire involving the substance led to any off-site death, injury, or response or restoration activities for an exposure of an environmental receptor within the last five (5) years.\r\n\r\n\r\ne) The emergency response program\r\nThe Emergency Response Program requirements for Program 1 Facilities are very similar to those required under the PSM rule. The Emergency Response Program required under the RMP and PSM Rules must be site-specific and comprehensive, including the following elements:\r\n\r\n¿Public and emergency response agency notification procedures;\r\n¿Proper first aid and emergency medical treatment;\r\n¿Emergency response measures;\r\n¿Procedures for inspecting, testing, and maintaining emergency response equipment;\r\n¿Employee training; and\r\n¿Program review procedures.\r\n\r\nEnLink maintains a corporate Emergency Preparedness and Response Plan (EPRP) that provides guidance for emergencies expected at all EnLink facilities, including Crum, as well as additional safety information. Crum also maintains a site-specific Emergency Action Plan. In addition, operating procedures and equipment design codes and standards associated with the operations at the Facility are maintained. Furthermore, the Facility has coordinated the emergency response with the local fire department. For these reasons, Crum meets the exceptions listed in 40 CFR 68.90(b), and therefore the Facility is not required to have the Emergency Response Program as described in 40 CFR 68.95. As such, the Facility is non responsive.\r\n\r\n\r\nf) Planned changes to improve safety\r\nThe Facility last completed a Process Hazard Analysis (PHA) during design of the Facility in\r\n2014 to assess potential areas to improve safety at the Facility. The final action item from the\r\nPHA was completed before startup. Pre-startup safety reviews (PSSRs) are conducted on a\r\nregular basis whenever changes are made to the process. The Facility will update and revalidate\r\nthe PHA every 5 years as per OSHA PSM and EPA RMP regulations."
    }
  ]
}