{
  "FacilityID": 1000009023,
  "FacilityName": "CF Industries, Inc. Tampa Terminal",
  "FacilityStr1": "3222 Maritime Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Tampa",
  "FacilityState": "FL",
  "FacilityZipCode": "33605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12057",
  "LEPC": "District 8 LEPC",
  "FacilityLatDecDegs": "27.917222",
  "FacilityLongDecDegs": "-082.439167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.cfindustries.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 10519445,
  "ParentCompanyName": "CF Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 8966632,
  "Company2DUNS": 8966632,
  "OperatorName": "CF Industries, Inc.",
  "OperatorStr1": "3222 Maritime Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Tampa",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "33605",
  "OperatorZipCodeExt": null,
  "FTE": 38,
  "OtherEPAFacilityID": "FLD980730329",
  "EPAFacilityID": "100000094391",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-07-01 00:00:00",
  "SafetyInspectionBy": "United States Coast Guard",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-07-13 14:55:11",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 27.918586,
  "FRS_Long": -82.438069,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010548,
      "AltID": "Refrigerated Storage",
      "FacilityID": 1000009023,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012013,
          "ProcessID": 1000010548,
          "ChemicalID": 56,
          "Quantity": 77792000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000010929,
          "ProcessID": 1000010548,
          "NAICSCode": "48831",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000008642,
              "Process_NAICS_ID": 1000010929,
              "SafetyReviewDate": "2008-01-31 00:00:00",
              "PHA_Date": "2007-02-22 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-07-23 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "Yes",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Portable & Stationary Vapor Suppression Equipment, Emergency Shutdown systems with isolation valves",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Personnel on-site 24 hours/day and remotely controlled camera system",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-12-04 00:00:00",
              "TrainingReviewDate": "2007-10-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-01-08 00:00:00",
              "EquipmentInspectionDate": "2009-06-09 00:00:00",
              "EquipmentTested": "Compressor Package",
              "ChangeMgmtDate": "2009-01-13 00:00:00",
              "ChangeMgmtReviewDate": "2009-01-02 00:00:00",
              "PreStartupReviewDate": "2009-05-20 00:00:00",
              "ComplianceAuditDate": "2006-12-13 00:00:00",
              "AuditCompletionDate": "2007-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2007-02-27 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-16 00:00:00",
              "ContractorSafetyReviewDate": "2009-06-14 00:00:00",
              "ContractorSafetyEvalDate": "2009-01-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000010009,
                  "PreventionProgram3ID": 1000008642,
                  "ProcessChemicalID": 1000012013
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000009023,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-08-29 00:00:00",
    "ERTrainingDate": "2009-04-22 00:00:00",
    "CoordinatingAgencyName": "Tampa Fire Department",
    "CoordinatingAgencyPhone": "8132425384",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "U.S. Coast Guard 33 CFR 127, DOT 49 CFR, OSHA 29 CFR 1910.111",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009023,
      "SummaryText": "About CF Industries, Inc.\nCF Industries, a subsidiary of CF Industries Holdings, Inc., is a major producer and distributor of nitrogen and phosphate fertilizer porducts. CF Industries operates world-scale nitrogen fertilizer plants in Donaldsonville, Louisiana and Medicine Hat, Alberta Canada, conducts phosphate mining and manufacturing operations in Central Florida and distributes fertilizer products through a system of terminal, warehouses, and associated transportation equipment located primarily in the midwestern United States.\n\nIt is the policy of CF Industries to conduct its business and operate its facilities in a manner designed to protect the environment, and the health and safety of its employees. This protection extends to neighbors of the Terminal. Additionally, we are committed to complying with all applicable environmental laws, rules and regulations. The company promotes environmental concern and eduction among our employees and with communities in which we operate. The company will not hesitate to go beyond legal requirements if, in its prudent judgment, a higher level of performance is in order. The commitment to excellence regarding environmental, health & saftey issues is supported in total by senior management of CF Industries. \n\nStationary Source and Regulated Substance:\n\nThe Tampa Terminal, located at the Port of Tampa, was purchased by CF in 1992 and serves as a vital link in supplying ammonia to its own manufacturing facilities and other customers. The Tampa Terminal receives anhydrous ammonia from ships at the Tampa Port Authority's unloading dock. Ammonia is pumped from the ship to an atmospheric storage tank where it is refrigerated to -28 degrees F. Truck and rail loading facilities are on site to load ammonia from the storage tank for transfer to CF manufacturing facilities and other customers. The Tampa Terminal also transfers ammonia to a privately owned pipeline for delivery to other customers. The only substance regulated under EPA's"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009023,
      "SummaryText": "RMP requirements at this facility is ammonia. \n\nAccidental Release Prevention and Emergency Response Polices:\n\nThe Tampa Terminal has an extensive safety program that assures compliance with all applicable local, state and federal rules and regulations. The facility operates under a Corporate Environmental Health and Safety Policy that endorses going beyond regulatory requirements when necessary to protect the health and safety of its employees and the public. The design, maintenance and operation of this facility are carried out in conformance with this policy to provide a safe operation and to prevent exposures of our employees and nearby neighbors to ammonia.\n\nIt is the philosophy of CF Industries to conduct its business and operate its facilities in a manner designed to protect the environment and the health and safety of its employees.\n\nCF Industries is committed to complying with all applicable environmental laws, rules, and regulations and will promote environmental concern and education among its employees and with the communities in which it operates.  CF Industries is equally committed to protecting the safety and health of its employees, and will take all practical steps to eliminate or reduce the exposure of employees to conditions adversely affecting their safety or health while on the job, and encourages off-the-job employee safety and health awareness as well.  \n\nManagement at each facility is directly responsible for the development and implementation of programs and procedures to ensure conformance with this philosophy.  The programs and procedures are continually reviewed and updated, and the facility is periodically audited to assure compliance. \n\nThe people of CF Industries are dedicated to and trained in the safe operation of the Company's production, storage, and distribution facilities.  However, CF Industries' personnel are also trained in key aspects of emergency response. \n\nThe facility's Emergency Response Plan is based on OSHA's emergenc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009023,
      "SummaryText": "y response standard, 29 CFR 1910.120(q). The plan includes procedures for the notification of local fire and emergency response authoriities and notification of any potentially affected neighbors. The facility in linked to an alarm and telephone notification ring down system that provides emergency notification to nearby neighbors.  In addition, emergency preparedness is assured by: Hazardous Materials (HAZMAT) trained operators and supervisory personnel; emergency response drills with local emergency responders; ammonia sensors located at critical locations in the process area and along the facility perimeter; continous computer monitoring of ammonia sensor readings and weather conditions; and water spray systems for ammonia vapor suppression.\n\nAccidental Release Prevention Program and Specific Prevention Steps:\n\nThe CF Tampa Ammonia Terminal is subject to OSHA's Process Safety Management (PSM) standard, 29 CFR 1910.119. As recognized by EPA, the PSM standard forms the basis for the agency's RMP prevention program component. The primary purpose of this facility's PSM program is to safeguard our employees and nearby neighbors from exposure to ammonia by providing assistance in evaluating and updating the facility's process and mechanical safety procedures and programs.\n\nThe objectives of the PSM program are:\n\n1) To periodically review and update the facility' process/mechanical safety procedures and programs;\n2) To provide for regular and periodic review of the faciity's procedures to maintain compliance with OSHA's PSM regulations;\n3) To perform Process Hazard Analyses on new and existing processes; and\n4) To assure follow up on the action items generated by the Process Hazard Analyses \n\nKey mechanisms are:\n\n1) A comprehensive tank inspection program requires the storage tank to be emptied and inspected;\n2) The Terminal has automated emergency shutdown systems with isolation valves to minimize a potential release;\n3) Continuous monitoring and surveillance are condu"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009023,
      "SummaryText": "cted by operating personnel via computer and remote cameras\n4) System design incorporates multiple layers of protection including: flare system, emergency power sources, break away protection for trucks and railcars, pressure relief valves, and leak detectors;\n5) Plant personnel receive Process Safety Management training;\n6) Traffic is strictly controlled throughout the facility; and\n7) Site access is controlled and monitored\n\nFive Year Accident History:\n\nThere has never been a catastrophic failure of the refrigerated storage tank. In the past five years there have been no ammonia releases that would be classified as an accitental release per the RMP regulations.\n\nEmergency Response Program:\n\nHAZMAT training is performed in accordance with OSHA regulation 29 CFR 1910.120(q) and pre-emergency planning and drills are conducted with local emergency responders. The emergency response program complies with the OSHA PSM Program as outlined in 29 CFR 1910.119. The HAZMAT team conducts joint training and drills with the local fire department. Facility personnel conduct meetings informing the public of the facility's Emergency Response Program. The facility uses the Incident Command System that was developed by the National Fire Academy. \n\nPlanned Changes to Improve Safety:\n\nCF will continue to provide support to and work with the Local Emergency Planning Committee and emergency responders to plan for the appropriate emergency response and to prepare for responding to an emergency through practice and drills. In addition, as part of the company's community giving program, CF Industries provided funds used to send members of the Tampa Fire Department to special ammonia suppression training in Holden, Louisiana, conducted by CF Industries and the Louisiana State Police. This training provides fire fighters the opportunity to learn how to protect the public in the unlikely event of an accidental ammonia release."
    }
  ]
}