{
  "FacilityID": 1000110319,
  "FacilityName": "Hilcorp Energy- Carter Creek Gas Plant",
  "FacilityStr1": "20 MI NNE EVANSTON",
  "FacilityStr2": "Bear River Divide Road",
  "FacilityCity": "Evanston",
  "FacilityState": "WY",
  "FacilityZipCode": "82930",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "56041",
  "LEPC": "Uinta County LEPC",
  "FacilityLatDecDegs": "41.573389",
  "FacilityLongDecDegs": "-110.913111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "hilcorp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Hilcorp Energy Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Hilcorp Energy",
  "OperatorStr1": "P.O. Box 1610",
  "OperatorStr2": null,
  "OperatorCity": "Evanston",
  "OperatorStateFIPS": "WY",
  "OperatorZipCode": "82930",
  "OperatorZipCodeExt": null,
  "FTE": 28,
  "OtherEPAFacilityID": "WYD000712851",
  "EPAFacilityID": "100000115519",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "P0034172",
  "SafetyInspectionDate": "2012-10-15 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-04-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-04-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-04-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-04-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 41.5734,
  "FRS_Long": -110.912,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000137606,
      "AltID": "Well Stream Sep",
      "FacilityID": 1000110319,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000172369,
          "ProcessID": 1000137606,
          "ChemicalID": 155,
          "Quantity": 590000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000153649,
              "ProcessChemicalID": 1000172369,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000153648,
              "ProcessChemicalID": 1000172369,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000153647,
              "ProcessChemicalID": 1000172369,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000153646,
              "ProcessChemicalID": 1000172369,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000153645,
              "ProcessChemicalID": 1000172369,
              "ChemicalID": 94
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000139059,
          "ProcessID": 1000137606,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000137607,
      "AltID": "NGL extraction",
      "FacilityID": 1000110319,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000172370,
          "ProcessID": 1000137607,
          "ChemicalID": 155,
          "Quantity": 132000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000153654,
              "ProcessChemicalID": 1000172370,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000153653,
              "ProcessChemicalID": 1000172370,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000153652,
              "ProcessChemicalID": 1000172370,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000153651,
              "ProcessChemicalID": 1000172370,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000153650,
              "ProcessChemicalID": 1000172370,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000139060,
          "ProcessID": 1000137607,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000137608,
      "AltID": "Sulfur removal",
      "FacilityID": 1000110319,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000172431,
          "ProcessID": 1000137608,
          "ChemicalID": 63,
          "Quantity": 15000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000139061,
          "ProcessID": 1000137608,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000110319,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-01-24 00:00:00",
    "ERTrainingDate": "2023-05-02 00:00:00",
    "CoordinatingAgencyName": "Uinta County Emergency Management",
    "CoordinatingAgencyPhone": "3077830327",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000110319,
      "SummaryText": "ency Response Team is a voluntary organization made of Hilcorp Employees who work full time at the facility.\n\nThe team will respond to emergencies or upset that they are called upon. Their response will not exceed the available resources and will not exceed their training levels."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000110319,
      "SummaryText": "enance and the regularly scheduled comprehensive internal equipment inspection and repair.\n\nTHE FIVE YEAR ACCIDENT HISTORY\nIn the past 5 years, there have been no accidental releases from covered processes with regulated substances held above threshold quantities that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage that may have resulted from any activities or incidents at the Carter Creek Gas Plant.\n\nEMERGENCY RESPONSE PROGRAM\nThe Carter Creek Gas Plant maintains a written Emergency Response Plan, which is in place to protect public safety and worker safety (both employees and contractors), as well as the environment, and to minimize effects in the unlikely event of an emergency. The plan consists of detailed procedures for responding to accidental releases of toxic and flammable substances.  \nThese response procedures address the following aspects of emergency response, and more: \n* First aid;\n* Evacuation plans which include provisions for accounting for all personnel (employees, contractors, and visitors) after an evacuation.\n* Notification to appropriate emergency response agencies; and\n* Post-incident cleanup and decontamination.\n\nFacility personnel actively coordinate with local emergency responders and participate on the Uinta County LEPC to plan and practice for emergency response issues in the area. \n\nThe CCGP Emergency Response Organization consists of approximately 5-10 trained individuals. These individuals are trained to respond to emergencies at the facility.\n\nThe training these individuals receive is in Incident Command, Emergency Response, Confined Space Response, Basic Emergency Care, P.P.E., and basic Rescue Techniques. They have training that ensures they know how to respond to areas and processes of the facility and know how to deal with the hazards associated with those areas and processes.\n\nThe Carter Creek Emerg"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000110319,
      "SummaryText": "sed at the rate of 750 lbs per minute over a period of ten minutes.  The facility has numerous controls in place to prevent such a release and to manage their consequences.  The calculated maximum distance to the toxic endpoint (0.042 mg/L or 30ppm; Basis ERPG-2) for the WCS of Process 3 is beyond the facility boundary, but there are no public receptors within that calculated radius due to the remote location of the facility.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\nHilcorp encourages employees to participate in all aspects of Process Safety Management and accident prevention.  As such, facility employees have access to the information created as part of the facility Process Safety Management and accident prevention programs. \n\nThe processes are controlled and monitored using instruments trained personnel and protective systems (e.g. distributive control systems, automated detection, emergency shutdown systems, closed blowdown systems, pressure relief valves, pressure control valves, remotely located flare systems, etc.).\n\nCCGP has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and that adequate controls are in place to manage these hazards.\n\nCCGP maintains written procedures that address various modes of process operations such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, and (5) normal shutdown. \n\nTo complement the written procedures for process operations, Hilcorp has implemented a comprehensive training program for all employees involved in operating CCGP\n\nCCGP uses Management of change processes to control and track Facility changes \n\nMechanical Integrity programs including on-line equipment testing (e.g. ultrasonic thickness testing, radiographic inspection, corrosion coupons, etc.), chemical inhibition to control corrosion, equipment preventative maint"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000110319,
      "SummaryText": "ned processes with threshold quantities of regulated substances at CCGP including:\n\nProcess 1:\n\nInlet flows and quantities of flammable, naturally occurring hydrocarbon mixtures of methane, ethane, propane, butane and pentane. \n\nProcess 2:\n\nFlammable hydrocarbon mixtures of methane, ethane, propane, butane, pentane associated with NGL removal from the sales gas stream and propane refrigeration systems. \n\nProcess 3:\n\nHydrogen Sulfide (H2S) associated with the naturally occurring hydrocarbon mixture of natural gas entering the Gas Plant and the associated Sulfur Recovery Unit used to remove the H2S from the gas and convert the H2S to elemental Sulfur. \n\n\nWORST CASE SENARIOS\n\nProcess 1: \nWorst-case scenario (WCS) for Process 1 is a loss of containment of the V-1101 (Slug Catcher) vessel contents, releasing the entire vessel volume (284,000 lbs.), resulting in a vapor cloud explosion. The facility has numerous controls in place to prevent such releases and to manage the consequences.  The calculated maximum distance to endpoint (1 psi overpressure) for the WCS of Process 1 is beyond the facility boundary, but there are no public receptors within that calculated radius due to the remote location of the facility.\n\nProcess 2:\nWorst-case scenario (WCS) for Process 2 is a loss of containment of the V-1301 (Glycol Separator) vessel contents releasing the entire vessel volume of 30,500lb including gas and NGLs resulting in a vapor cloud explosion. The facility has numerous controls in place to prevent such releases and to manage their consequences.  The calculated maximum distance to endpoint (1 psi overpressure) for the WCS of Process 2 is beyond the facility boundary, but there are no public receptors within that calculated radius due to the remote location of the facility.\n\nProcess 3- \nWorst-case scenario (WCS) for Process 3 is the loss of containment of the V-1101 (Slug Catcher) vessel contents to the atmosphere resulting in the entire volume of H2S (7,500 lbs) being relea"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000110319,
      "SummaryText": "d to strip the H2S and CO2 from the gas stream. \n\nProcess 2\u0096 Dehydration and NGL Extraction\n\nThe treated, high-pressure gas from the Diethanolamine unit (meeting pipeline specification) is sent to Process 2 for dehydration and natural gas liquid (NGL) extraction.  Dehydration is accomplished through injection of Ethylene Glycol into the gas stream upstream of the gas chiller.  \n\nTreated, high-pressure gas is chilled to -20 deg. F in the High-Pressure Sweet Gas Chiller (V-1302) to achieve a required sales gas hydrocarbon dew point requirement of 15deg. F and a gas water content of 7 lb/MMSCF.  Extracted natural gas liquids  are then sold as stabilized NGL product via a NGL Pipeline. Chilling is accomplished through propane refrigeration.  \n\nThe full stream is then sent to V-1301 (Glycol Separator) where the natural gas, ethylene glycol, and NGL\u0092s are separated.  The NGL\u0092s are stabilized (de-methanized) and then shipped to the NGL sales pipeline.  (Enterprise Products)\n\n\nProcess 3- H2S removal and Sulfur recovery\n\nThe sour natural gas from Process 1 is sent to an amine treating unit where diethanolamine (DEA) is used to strip H2S and CO2 from the gas stream.  \n\nThe DEA is regenerated to produce a gas stream containing H2S, CO2, and water vapor (Acid Gas) which is further processed for conversion to elemental sulfur in a 3-Stage Claus unit. The regenerated DEA is recirculated back to the H2S Absorbers.\n\nThe H2S liberated from the DEA is reacted and converted to elemental sulfur utilizing a Claus Sulfur Recovery process (SRU).  The residual gas stream after the Claus unit is treated in the Tail Gas Unit which includes reactors to convert sulfur species back the H2S and a Flexsorb unit to selectively remove residual H2S from the Tail Gas Stream.  \n\nThe tail gas from the Plant is then heated and lofted to the atmosphere at or below Wyoming State DEQ permitted levels for emission components.\n\nREGULATED SUBSTANCES ABOVE THRESHOLD QUANTITIES AT CCGP\n\nThere are three RMP defi"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000110319,
      "SummaryText": "FACILITY DESCRIPTION\n\n\tThe Carter Creek Gas Plant (CCGP) is owned and operated by Hilcorp Energy Company. The gas plant, located in the Whitney Canyon / Carter Creek gas field (approx. 21 miles North and East of Evanston, Wyoming), was originally designed to process approximately 150 MMscfd of natural occurring natural gas.\n\t\n\tHilcorp employs approximately 28 full time employees and contractors at the facility.   \n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nIt is the policy of Hilcorp Energy Company to conduct business in a responsible and ethical manner that protects the safety and health of employees and the public as well as protecting the environment. The CCGP Emergency Action Plan covers procedures for reporting fires or other emergencies, emergency evacuation and exit routes, procedures for employees who remain to operate critical plant operations prior to evacuation, accounting for personnel, rescue and medical duties, and contact information for employees responsible for plan implementation and who can provide more information to other employees about the plan.  The Emergency Action Plan also involves coordination with local emergency response personnel and routine drills and table top exercises.   \n\n\nPRIMARY ACTIVITIES\n\nProcess 1- Well Stream separation, stabilization, and \n\nThe well stream separation area at the plant inlet takes in the natural gas from the field and provides gas/liquid separation and stabilization.  It is designed to handle about 150 MMscfd of natural gas per day. \n\nThe well stream enters the plant as a three-phase stream: gas, hydrocarbon condensate, and free water. The gas and liquid are separated in V-1101 (Slug Catcher). The gas is then filtered and treated. The hydrocarbon condensate is de-pressured, stripped of H2S, and stabilized. The free water is degassed of H2S and sent to a sour liquids blowdown system.\n\nThe natural gas stream is sent to an amine treating unit (described below in Process 3) where Diethanolamine is use"
    }
  ]
}