{
  "FacilityID": 1000029659,
  "FacilityName": "High Desert Power Project",
  "FacilityStr1": "19000 Perimeter Road",
  "FacilityStr2": null,
  "FacilityCity": "Victorville",
  "FacilityState": "CA",
  "FacilityZipCode": "92394",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "34.595293",
  "FacilityLongDecDegs": "-117.369122",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "High Desert Power Project, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "High Desert Power Project, LLC",
  "OperatorStr1": "19000 Perimeter Road",
  "OperatorStr2": null,
  "OperatorCity": "Victorville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92394",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": "CAR000144493",
  "EPAFacilityID": "100000181288",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "1047",
  "SafetyInspectionDate": "2012-07-17 00:00:00",
  "SafetyInspectionBy": "FM Global",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-08-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-10-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-10-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-10-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.595409,
  "FRS_Long": -117.363355,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036167,
      "AltID": null,
      "FacilityID": 1000029659,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043772,
          "ProcessID": 1000036167,
          "ChemicalID": 57,
          "Quantity": 304000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000036549,
          "ProcessID": 1000036167,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000024349,
              "Process_NAICS_ID": 1000036549,
              "SafetyReviewDate": "2011-11-29 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2012-07-06 00:00:00",
              "ChangeCompletionDate": "2013-07-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Double Walled Storage Tank",
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Level Alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": "Safety Procedures and Policies",
              "OpProceduresReviewDate": "2011-11-29 00:00:00",
              "TrainingReviewDate": "2011-11-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-11-29 00:00:00",
              "EquipmentInspectionDate": "2011-11-08 00:00:00",
              "EquipmentTested": "Tank Inspection",
              "ComplianceAuditDate": "2014-08-13 00:00:00",
              "AuditCompletionDate": "2014-08-21 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2002-10-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000024675,
                  "PreventionProgram2ID": 1000024349,
                  "ProcessChemicalID": 1000043772
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000029659,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Victorville Fire Department",
    "CoordinatingAgencyPhone": "7609555229",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029659,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES \r\n\r\nThe High Desert Power Plant is dedicated to the operation of a safe work place for its employees, visitors, and neighboring community.  The High Desert Power Plant has prepared risk and safety programs to ensure safe handling of the aqueous ammonia system. The High Desert Power Plant conducted the following technical studies to identify potential hazards and the appropriate mitigation measures:  Hazard Review, a Hazard Assessment, and a Seismic Assessment.  All three studies were revalidated in July 2007 and again in July 2012.\r\n\r\nThe High Desert Power Plant employees conduct ongoing inspections, testing, and replacement of critical items in the aqueous ammonia systems.  The aqueous ammonia systems are monitored during every scheduled shift by a High Desert Power Plant employee.  A record of the maintenance or work performed on the system is maintained by the Plant Supervisor.\r\n\r\nThe High Desert Power Plant has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning & Response program section of the CalARP document maintained at the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which is implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the CalARP and RMP regulations, as well as to incorporate any facility changes.\r\n\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE \r\n\r\nThe High Desert Power Plant is located at 19000 Perimeter Road in Victorville, California.  The facility is situated northwest of Interstate 15 off of the D Street exit.  The immediate area is primarily industrial and rural.  The facility began operations in January 2003.\r\n\r\nThe regulated substances of concern at the High Desert Power Plant facility are 25% aqueo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029659,
      "SummaryText": "us ammonia and 19% aqueous ammonia. The 25% aqueous ammonia is used as a catalyst in the Selective Catalytic Reduction (SCR) process that is employed to control NOx (oxides of nitrogen) emissions from the stack of the High Desert Power Plant.  The 19% aqueous ammonia is used to control the pH level of the boiler feed water.  The 19% aqueous ammonia pH control system is only regulated under the CalARP Program Level 2 regulation.\r\n\r\nThe maximum inventory of 25% aqueous ammonia is 40,000 gallons (303,760 pounds).\r\n\r\nA 25% aqueous ammonia solution  is used at the High Desert Power Plant in the SCR  system to help maintain air quality compliance of the emission stack,  specifically, reducing NOx  emissions.  Once in operating mode, the aqueous ammonia system is automatically controlled based on system demand.  The aqueous ammonia is stored in a 40,000 gallon double walled tank inside a bermed containment area.  Along with the tank, the pump skid is also situated with the containment berm.\r\n\r\nThe liquid is pulled from the tank through the ammonia shut off valve by a pump.  It then travels to the three Heat Recovery Steam Generators (HRSG) where it is used in separate SCR skid units for each HRSG.  There it flows through a strainer manifold and then flows through a back pressure regulator control valve, a flow control valve, to the vaporizer and then the injection grid.  The catalyst bed provides the surface area for the SCR reactions to occur.\r\n\r\nThe ammonia shut off valve remains open based on several permissive conditions including, but not limited to: boiler load, reactor temperature, ammonia storage tank level, and metering pump operation.  The aqueous ammonia is mixed with compressed air prior to entering the vaporizer where it is mixed with hot blower air and then fed to either the economizer superheat-side or the economizer reheat-side of the ammonia injection grid in the combustion exhaust stack.\r\n\r\nThe NOx in the flue gas reacts with ammonia in the SCR reactor ca"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029659,
      "SummaryText": "talyst layers to form harmless elemental nitrogen and water.  The elemental nitrogen and water remain in the flue gas as it passes through the stack to the atmosphere.  The SCR reactor is designed for a NOx reduction efficiency of 89.3% when firing natural gas.\r\n\r\nThe maximum amount of aqueous ammonia delivered to the system is 6,000 gallons per visit as that is the capacity of the truck.  As a precaution for an aqueous ammonia spill during delivery, there is a drain which rests below the loading area.  This drain is connected to an underground containment tank.  Any spill of aqueous ammonia would drain to the tank.  \r\n\r\nThe SCR system is equipped with various automatic process controls which ensure safe and efficient operation of the SCR reactor, vaporizer, metering pumps, shut-off and regulating valves.  In addition, pressure relief valves automatically engage in the event the system experiences a very high pressure situation.\r\n\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS \r\n\r\nThe storage of aqueous ammonia at the High Desert Power Plant is governed by many safety features.  Much of the safety of the process ins inherent in the policies and procedures that govern the operation of the process.  For example, the High Desert Power Plant operates in accordance with the California Accidental Release Prevention (CalARP) Program.  The CalARP Program included detailed hazard review to identify potential release scenarios, an analysis of the potential consequences associated with select release scenarios and a detailed seismic inspection of the aqueous ammonia process equipment.  In addition to the technical studies, the CalARP program incorporated preventative programs such as detailed operating and maintenance procedures, incident investigation, training, auditing, and emergency response activities.  Finally, the aqueous ammonia process is inspected by operators twice per shift.\r\n\r\nThe High Desert Power Plant maintains tight control of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029659,
      "SummaryText": "its aqueous ammonia systems through various process controls and monitors.  In the event that the primary engineering or administrative controls at the facility fail and result in a release of aqueous ammonia from the SCR System, there are three mechanisms at the facility to minimize the impact:  1) a containment berm surrounding the aqueous ammonia tank d to hold the entire contents of the tank, 2) an underground storage tank to contain any spills during the unloading process, and 3) both the storage tank and the underground containment tank are double-walled.  There are level controls on the storage tank to alert operator to extreme level conditions.\r\n\r\n\r\nFIVE YEAR ACCIDENT HISTORY \r\n\r\nAn investigation into the facility's accident history conducted at the time of the Hazard Review Revalidation (July 6, 2012) revealed that there have been no aqueous ammonia releases over the past five years (July 2007 to July 2012) that exceeded the Federal Reportable Quantity of 1,000 pounds of aqueous ammonia or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material.  In addition, there have been no injuries resulting from an ammonia release, nor any releases or \"near misses\" that warranted an internal incident investigation.\r\n\r\n\r\nEMERGENCY RESPONSE PROGRAM \r\n\r\nThe High Desert Power Plant has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the CalARP document, which is maintained at the facility and updated as necessary.  This Plan was designed to meet the following objectives:\r\n\r\n  1.)  To save lives.\r\n  2.)  To minimize and avoid injuries.\r\n  3.)  To protect the environment.\r\n  4.)  To minimize property damage.\r\n\r\nThe High Desert Power Plant maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, aque"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000029659,
      "SummaryText": "ous ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the RMP regulation, as well as to incorporate facility changes due to the renovation of the facility.\r\n \r\nThe High Desert Power Plant has coordinated emergency response efforts with the local fire department, Victorville Fire Department.  In the case of an aqueous ammonia-related emergency, it is the policy of the High Desert Power Plant to evacuate the employees and to allow the fire department to respond to the emergency (potentially with the assistance of trained facility personnel).\r\n\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY \r\n\r\nA Hazard Review Revalidation was conducted on July 6, 2012.  The status of the recommendations resulting from the previous Hazard Review Revalidation (2007) and the 2011 Three-Year Compliance Audit were reviewed during the Hazard Review Revalidation study.  The 2012 Hazard Review Revalidation study generated mitigation measures (recommendations) to improve safety at the High Desert Power Plant facility located in Victorville, California.  The mitigation measures include additional training, key maintenance   related tests/inspection, and enhanced emergency response policies and procedures.  The High Desert Power Plant safety committee is planning to complete several items, including all outstanding and new recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\r\n\r\n1. Continue to train all employees in the facility Safety Plan/Programs.\r\n\r\n2. Continue to have employee involvement in Safety Plan Development.\r\n\r\n3. Continue employee involvement through safety team participation.\r\n\r\n4. Continue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}