{
  "FacilityID": 1000009388,
  "FacilityName": "City of Mabank -  Water Treatment Plant",
  "FacilityStr1": "2200 West Main Street",
  "FacilityStr2": null,
  "FacilityCity": "Gun Barrel City",
  "FacilityState": "TX",
  "FacilityZipCode": "75147",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48213",
  "LEPC": "Henderson County LEPC",
  "FacilityLatDecDegs": "32.332111",
  "FacilityLongDecDegs": "-096.150570",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Mabank",
  "OperatorStr1": "P.O. Box 293",
  "OperatorStr2": null,
  "OperatorCity": "Mabank",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75147",
  "OperatorZipCodeExt": "0293",
  "RMPContact": "Steve Barley",
  "RMPTitle": "Water Treatment Superintendent",
  "FTE": 5,
  "OtherEPAFacilityID": "000007116790",
  "EPAFacilityID": "100000131984",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.33094,
  "FRS_Long": -96.1488,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000011013,
      "AltID": "Water Treatment Facility",
      "FacilityID": 1000009388,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011408,
          "ProcessID": 1000011013,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012538,
          "ProcessID": 1000011013,
          "ChemicalID": 62,
          "Quantity": 4800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512538,
          "ProcessID": 1000011013,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009388,
      "SummaryText": "      Mabank's water treatment plant lies inside the city limits of Gun Barrel City, Texas with boundaries delineated by a chain link fence.  The facility has been in operation since the 1960's.  The water treatment plant remains an essential facility for the City of Mabank, Texas.  The plant treats and pumps approximately 2.6 million gallons per day of the city's potable water.  The plant has a planned upgrade to 3.16 million gallons per day to be complete by August 2005. This project also includes removing existing vehicle barriers around the gas storage and constructing new barriers.  In addition, the project includes new chlorine detectors. This treatment plant is the primary source of drinking water for the City of Mabank's residents.\n\n     Water treatment is the regulated process at this facility.  Chlorine gas disinfects the water making it safe for public consumption.  The disinfectant chlorine in water treatment ia a cost-effective method for meeting state and federal disinfecting rules and regulations.  The plant safely stores 4800 pounds of chlorine on site.  However, only one ton container is connected and in service at any one time.  \n\n     The design engineer of the plant and Water Treatment Plant & Distribution Supervisor drafted the written operating procedures in accordance with guidelines established by the TCEQ and the Chlorine Institute.  In addition, all operators must have an operator's license from the Texas Commission on Environmental Quality.  The dangers of chlorine gas and how to safely handle it are heavily stressed to all employees.  The size of the facility also aids in chemical safety.  The storage and process areas are adjacent to each other.  This allows for close monitoring of the chlorination system and a quick response in the event of a malfunction.  The chief operator continually cross trains the men in all aspects of the chlorination system.     \n\n     The City of Mabank's water treatment plant complies with the rules and regula"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009388,
      "SummaryText": "tions of the EPA RMP.  The most important preventative measure for avoiding accidental release involves the chlorine gas feed system.  The chlorine gas feeds via a gas vacuum created by running water through an injector.  The gas will cease to flow when any section of chlorine gas supply tubing breaks and vacuum is lost.  This ensures that any failure in the process equipment cease gas flow which helps to eliminate chlorine releases.  Since the vacuum regulator is mounted directly on the one ton container, the only potential for gas escaping results from a puncture in the container or a yoke valve failure.  A building with proper ventilation encloses the process area.\n\n     All operators are trained in the written operating procedures and must be licensed by the Texas Commission on Environmental Quality.  Preventative maintenance procedures meet or exceed manufacturer's recommendations.  They aid in changing out wearable parts before they fail.  For example, tubing is changed out annually or at any sign of deterioration.  Gaskets are replaced after any type of servicing.  Daily Inspections of the storage area and process area help to ensure that all valves and components are quite capable of proper shut down to isolate and stop leaks.  In addition the SCBA's are tested on a routine basis for proper functioning.  The plant size itself allows for close monitoring and detection of any potential signs of chlorine gas.  All maintenance and inspections and test are logged.  Finally, this plant is competently staffed 24 hours a day and seven days a week. \n\n     The Mabank's water treatment plant has not had any accidental releases within the last five years that resulted in personal injury or property damage offsite or onsite.\n\n     This facility coordinates emergency response with the local community emergency response.  Any incidence of a chlorine chemical leak or spill subject to off-site contamination will result in a 911 call by plant personnel.  The caller will state"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009388,
      "SummaryText": " the nature of the emergency and whether or not to contact the police and volunteer fire department and implement the community emergency evacuation plan.  The city of Mabank complies with EPCRA reporting requirements, thus all chemical quantities and storage locations are on file with the and Local Emergency Preparedness Committee (LEPC).  The Henderson County LEPC's has CAMEO software, which helps to clearly define an evacuation area.  The community emergency response personnel will implement evacuation procedures in accordance with the Emergency Management Plan.  All employees are instructed on the emergency action plan and the proper procdures for contacting emergency personnel.  The engineering firm which prepared the initial RMP and this resubmission has been hired to perform the mandated vulnerability assessment.  The assessment will improve the emergency response plan for more contingencies and better prepare the Mabank water treatment plant for emergencies."
    }
  ]
}