{
  "FacilityID": 1000090090,
  "FacilityName": "Antelope Hills Gas plant",
  "FacilityStr1": "16495 FM 2758",
  "FacilityStr2": null,
  "FacilityCity": "Canadian",
  "FacilityState": "TX",
  "FacilityZipCode": "79014",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48211",
  "LEPC": "Hemphill County LEPC",
  "FacilityLatDecDegs": "35.9983",
  "FacilityLongDecDegs": "-100.1206",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.energytransfer.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "La Grange Acquisitions, LP",
  "Company2Name": null,
  "CompanyDUNS": 31863330,
  "Company2DUNS": null,
  "OperatorName": "Energy Transfer Partners",
  "OperatorStr1": "800 E. Sonterra Blvd",
  "OperatorStr2": "Suite 400",
  "OperatorCity": "San Antonio",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78258",
  "OperatorZipCodeExt": "3941",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000207769",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "O-03543",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "New Facility",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-11-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-10-01 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-10-01 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-02-22 00:00:00",
  "DeRegistrationEffectiveDate": "2021-01-28 00:00:00",
  "AnniversaryDate": "2025-10-01 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.99692,
  "FRS_Long": -100.11749,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112041,
      "AltID": "Flammable Mixture",
      "FacilityID": 1000090090,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000140063,
          "ProcessID": 1000112041,
          "ChemicalID": 155,
          "Quantity": 603936.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000123505,
              "ProcessChemicalID": 1000140063,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000123506,
              "ProcessChemicalID": 1000140063,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000123507,
              "ProcessChemicalID": 1000140063,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000123508,
              "ProcessChemicalID": 1000140063,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000123509,
              "ProcessChemicalID": 1000140063,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000113374,
          "ProcessID": 1000112041,
          "NAICSCode": "21113",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000095604,
              "Process_NAICS_ID": 1000113374,
              "SafetyReviewDate": "2019-12-01 00:00:00",
              "PHA_Date": "2019-05-09 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-07-11 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "Yes",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-12-31 00:00:00",
              "TrainingReviewDate": "2018-06-29 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-07-31 00:00:00",
              "EquipmentInspectionDate": "2020-07-31 00:00:00",
              "EquipmentTested": "Production pump and discharge piping",
              "ChangeMgmtDate": "2020-07-13 00:00:00",
              "ChangeMgmtReviewDate": "2020-03-01 00:00:00",
              "PreStartupReviewDate": "2020-03-05 00:00:00",
              "ComplianceAuditDate": "2018-09-18 00:00:00",
              "AuditCompletionDate": "2019-07-11 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-03-01 00:00:00",
              "HotWorkPermitReviewDate": "2017-08-01 00:00:00",
              "ContractorSafetyReviewDate": "2020-09-10 00:00:00",
              "ContractorSafetyEvalDate": "2019-12-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000119403,
                  "PreventionProgram3ID": 1000095604,
                  "ProcessChemicalID": 1000140063
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000090090,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-12-17 00:00:00",
    "ERTrainingDate": "2019-12-17 00:00:00",
    "CoordinatingAgencyName": "Canadian Fire Department",
    "CoordinatingAgencyPhone": "8063236484",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 1000090090,
      "SummaryText": "(mitigate) a release.  The following types of safety features are used in the covered process:\r\nRelease Containment Control\r\n1. Excess flow valve\r\n2. Valves to permit isolation of the process (manual or automated)\r\n3. Automated shutdown systems for specific process parameters (e.g., high temperature, high level)\r\n4. Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system, backup pumps)\r\n5. Atmospheric relief devices\r\n\r\nRelease Mitigation\r\n1. Fire extinguishers\r\n2. Trained personnel\r\n3. Personal protective equipment\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\nThe Antelope Hills Gas Plant has had no offsite accidents within the previous 5 year time period.\r\n\r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\nThe Antelope Hills Gas Plant maintains a written emergency action plan which is in place to protect workers, the public's safety, as well as the environment.  There are no 112(r) threshold toxic substances on the plant site.  For a non-incidental release of a flammable substance, including the possibility of a fire, response actions have been coordinated with the local fire department and mechanisms for notification are in place.  Employees receive the training necessary to perform their specific emergency actions.  The emergency action plan will be updated as needed and affected personnel will be informed and or trained in the change before implementation.  The Antelope Hills Gas Plant has around the clock communications capability with appropriate officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  The plant emergency plan is tailored to this facility and the emergency services available in the community.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nThe Antelope Hills Gas Plant resolved PHA findings.  At the current time, no changes are planned over the foreseeable future."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000090090,
      "SummaryText": "parts are used when repairs are made.\r\n\r\nSafe Work Practices\r\nThe Antelope Hills Gas Plant has safe work practices in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous materials before process piping or equipment is opened, (4) a permit and procedure to control spark producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\r\nManagement of Change\r\nThe Antelope Hills Gas Plant has a system to manage changes to all covered processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards, and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\r\n\r\nIncident Investigation\r\nThe Antelope Hills Gas Plant will promptly investigate all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence and forwards these results to gas plant"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090090,
      "SummaryText": "EXECUTIVE SUMMARY\r\n                                                              \r\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\nEnergy Transfer is committed to worker protection and public safety. This is demonstrated by the resources invested in accident prevention, such as training of personnel and consideration of safety in the design, installation, operation, and maintenance of this facility. Our standing practice is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if an incidental release does occur, trained gas plant personnel will respond. Should an emergency occur, our policy is to notify the Canadian Fire Department and request they respond and plant personnel are prepared to work with the fire department, LEPC and other authorities to control and mitigate the effects of the release. \r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\nThe Antelope Hills gas plant, located near Canadian, Texas, operates processes to extract petroleum products (i.e. natural gas liquids (NGL)) from field natural gas. NGL is a flammable mixture of aliphatic and aromatic hydrocarbons including the regulated flammables ethane, propane, butanes, and pentanes. The NGL product is shipped from the plant by pipeline. There is no threshold quantity of 112(r) regulated toxic substances at this facility. \r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\nThis gas plant complies with applicable rules and regulations.  In the design, construction, equipment specification and installation applicable ANSI, ASME, ASTM, API and NFPA codes and standards were consulted.  The processes at the gas plant that are regulated by the EPA's RMP regulation are also subject to the OSHA's PSM standard, therefore this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\nEmployee Participation\r\nThe Antelope Hills Gas Plant encourages employees to pa"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000090090,
      "SummaryText": "nd that all supporting systems are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification that accident prevention program requirements are properly implemented.\r\n\r\nMechanical Integrity\r\nThe Antelope Hills Gas Plant has established practices and procedures to maintain pressure vessels, piping systems, relief systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\r\n\r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner.  Written procedures help ensure that work is performed in a consistent manner and provide a basis for training.  Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels).  If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\r\n\r\nAnother integral part of the mechanical integrity program is quality assurance.  The Antelope Hills Gas Plant incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that proper materials and spare"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090090,
      "SummaryText": "rticipate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information, to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the gas plant accident prevention program.  Specific ways to employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the gas plant and addresses each accident prevention program element.  In addition, the gas plant has initiatives under way which address process safety and employee safety issues.  These initiatives include forming a team to promote both process and personal safety.  The team typically have a member from operations, maintenance and plant management.\r\n\r\nProcess Safety Information\r\nThe Antelope Hills Gas Plant keeps a variety of technical documents that are used to help maintain safe operation of the processes.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information.  Specific departments within the gas plant are assigned responsibility for maintaining up to date process safety information.  Reference documents and their location is readily available as part of the written employee participation plan to help employees locate any necessary process safety information.\r\n\r\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in MSDSs.  For specific process areas, the plant has documented safety related limits for specific process parameters (e.g., temperature, level, composition).  The gas plant ensures that the processes are maintained within acceptable limits using process controls and monitoring instruments, highly trained personnel, and protective instr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090090,
      "SummaryText": "ument systems (e.g., automated shutdown systems).\r\n\r\nThe Antelope Hills Gas Plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\r\nProcess Hazard Analysis (PHA)\r\nThe Antelope Hills Gas Plant has a comprehensive program to help ensure that hazards associated with the processes are identified and controlled.  Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\n\r\nThe Antelope Hills Gas Plant primarily uses the HAZOP, What If Checklist analysis techniques to perform these evaluations.  The analyses are conducted using a team of people who have operating and maintenance experience as well as engineering expertise.  This team identifies and evaluates hazards of the process, as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\n\r\nThe PHA team findings are forwarded to local and corporate management for resolution.  Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team.  This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention.  All approved mitigation options in response to PHA team findings are tracked until they are completed.  The final resolution of each findings is documented and retained.\r\n\r\nTo help ensure that the process cont"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000090090,
      "SummaryText": "rols and/or process hazards do not eventually deviate significantly from the original design safety features, the plant will periodically update and revalidate the hazard analysis results.  These periodic reviews are conducted at least every five years and will be conducted at this frequency until the process is no longer operating.  The results and findings from these updates are documented and retained.  Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\r\n\r\nOperating Procedures\r\nThe Antelope Hills Gas Plant maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process.  These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate.  The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process.\r\n\r\nThe Antelope Hills Gas Plant written operating procedures are readily available in the process unit to operators and for other personnel to use as necessary to safely perform their job tasks.\r\n\r\nTraining\r\nTo complement the written procedures for process operations, the Antelope Hills Gas Plant has a training program for all employees involved in operating a process.  New employees receive basic training in gas plant operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process specific duties and tasks.  After operators demonstrate (e.g., through tests, skills demonstration) adequate knowledge to perform the duties and tasks in a safe manner on their own, t"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000090090,
      "SummaryText": "management for resolution.  Correction actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation will be documented, and the investigation results reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports will be retained for at least five years so that the reports can be reviewed during future PHAs and PHA revalidations.\r\n\r\nCompliance Audits\r\nTo help ensure that the accident prevention program is functioning properly, the Antelope Hills Gas Plant will periodically conduct an audit to determine whether the procedures and practices required by the accident prevention program are being implemented.  Compliance audits are conducted at least every three years, both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to plant management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n\r\nCHEMICAL SPECIFIC PREVENTION STEPS\r\nThe processes at the Antelope Hills Gas Plant have hazards that must be managed to ensure continued safe operation.  Following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\n\r\nUniversal Prevention Activities\r\nThe accident prevention program summarized previously is applied to all RMP covered processes at the Antelope Hills Gas Plant.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\n\r\nSpecialized Safety Features\r\nThe Antelope Hills Gas Plant has safety features on many units to help (1) contain/control a release, and (2) reduce the consequences of"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000090090,
      "SummaryText": "hey can work independently.  In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every three years.  All of this training is documented for each operator, including the means used to verify that the operator understood the training.\r\n\r\nContractors\r\nThe Antelope Hills Gas Plant uses contractors to supplement its workforce during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the gas plant has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event or an emergency, (5) understand and follow site safety rules, and (6) inform gas plant personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, the Antelope Hills Gas Plant evaluates contractor safety programs and performance during the contractor selection process.  Gas plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\r\n\r\nPre Startup Safety Review (PSSR)\r\nThe Antelope Hills Gas Plant conducts a PSSR for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications a"
    }
  ]
}