{
  "FacilityID": 1000069181,
  "FacilityName": "Innovative Ag Services - Independence",
  "FacilityStr1": "1101 2nd Ave NE",
  "FacilityStr2": null,
  "FacilityCity": "Independence",
  "FacilityState": "IA",
  "FacilityZipCode": "50644",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19019",
  "LEPC": "Buchanan County EMA",
  "FacilityLatDecDegs": "42.478143",
  "FacilityLongDecDegs": "-91.896042",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 80148,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 80148,
  "Company2DUNS": 0,
  "OperatorName": "Innovative Ag Services",
  "OperatorStr1": "2010 S. Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Monticello",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "52310",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000092197",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-09-14 00:00:00",
  "SafetyInspectionBy": "IDALS",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-04-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-04-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-04-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-10-27 00:00:00",
  "DeRegistrationEffectiveDate": "2021-09-29 00:00:00",
  "AnniversaryDate": "2023-04-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 42.47869,
  "FRS_Long": -91.88733,
  "FRS_Description": "NE CORNER OF LAND PARCEL",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086717,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000069181,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108205,
          "ProcessID": 1000086717,
          "ChemicalID": 56,
          "Quantity": 834360.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000087939,
          "ProcessID": 1000086717,
          "NAICSCode": "42491",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000054389,
              "Process_NAICS_ID": 1000087939,
              "SafetyReviewDate": "2016-03-02 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Applicable building, electrical, and plumbing codes. This facility complies with the Iowa Fertilzier law.",
              "FR_Comments": "We utilize those portions of these codes which are deemed applicable by the jurisdictional authority",
              "HazardReviewDate": "2018-04-11 00:00:00",
              "ChangeCompletionDate": "2018-09-28 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Vandalism/Theft (methamphetamines); vehicular protection; potential leaking from underground piping.",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Breakaway couplers have been installed at the risers and a remote emergency shut-off valve installed at the storage tank.",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Regular plant inspection/Routine preventive maintenance & repair",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Routine visual inspections.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-03-02 00:00:00",
              "TrainingReviewDate": "2018-03-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-03-02 00:00:00",
              "EquipmentInspectionDate": "2014-04-07 00:00:00",
              "EquipmentTested": "Pumps, pump seals, pipes and plumbing, valves, electrical equipment, and safety equipment. The breakaway couplers, pressure relief valves, and hoses are also inspected and replaced as necessary.",
              "ComplianceAuditDate": "2016-03-02 00:00:00",
              "AuditCompletionDate": "2016-09-02 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The plan is to minimize those hazards to human health and to the environment that are associated with accidental releases of anhydrous ammonia.  Employees working at the bulk storage plant make routine observations prior to and during transfer operations of the anhydrous ammonia from the storage vessel(s) to nurse tanks.  In so doing, they are able to detect problems before they arise.  This routine inspection identifies any portion of the system which may be under stress or about to fail.  Repairs can be made before they become problematic.  Employees are annually trained to recognize the hazards associated with storage and handling of anhydrous ammonia.  In addition to annual training for employees who have been on the job for a number of years, the company conducts training for new hires.  This training includes classroom instruction, on-site training at the plant, and follow-up observation to determine their individual comprehension and understanding of the new hire.  Finally, the company routinely invites local fire departrment personnel to visit the site.  In the event that the local fire department requests assistance in training its employees on anhydrous ammonia, the company cooperates fully in their endeavors.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000055155,
                  "PreventionProgram2ID": 1000054389,
                  "ProcessChemicalID": 1000108205
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000069181,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Buchanan County Emerg Mgmt Agency",
    "CoordinatingAgencyPhone": "3193346411",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "Iowa Fertilizer Law."
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069181,
      "SummaryText": "Executive Summary\n\n\n\nACCIDENTAL RELEASE PREVENTION/EMERGENCY RESPONSE \n\n\n\nThis facility complies with ANSI/CGA G-2.1-2014 requirements with amendments for Anhydrous Ammonia storage.  It is our policy to adhere to all applicable Federal, State, and local regulations.  If an emergency were to occur, it is our policy to immediately notify the local fire department (via a 911 call) and request that it respond to the emergency. Incidental to the fire department notification, the appropriate LEPC/EMA will be contacted.\n\n\n\nWhile we have planned for an emergency, it is acknowledged that a real emergency will be unexpected and may be much different and cannot be ensured to duplicate what may have been planned. In reality, the situation that develops may not happen in the manner in which it has been planned.  In that event, what may have been planned will serve only as a guideline to follow.  \n\n\n\nThe Emergency Action Plan for this facility describes certain procedures that are intended to minimize the hazards associated with human health and the environment from fires, explosions, the sudden and unexpected release of chemicals (i.e., Anhydrous Ammonia), tornadoes, bomb threats or other accidents or Acts of God which might occur on our premises.  The primary emergency coordinator for the facility is the location manager. \n\n\n\n\n\nDESCRIPTION OF THE ANHYDROUS AMMONIA STORAGE/DISTRIBUTION PLANT AND THE REGULATED SUBSTANCE HANDLED AT THE FACILITY\n\n\n\nThis facility is a bulk anhydrous ammonia storage and distribution plant.  The anhydrous ammonia, stored at this facility, is distributed to agricultural crop producers in the surrounding area who utilize anhydrous ammonia for crop nutrient purposes. The system consists of storage vessel(s) with associated piping, valves, liquid pump(s), and other miscellaneous equipment.  From time-to-time throughout the year, portable nurse tanks may also be present at this site. The anhydrous ammonia plant is operated on a seasonal basis (Spring and F"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069181,
      "SummaryText": "all).  Full-time equivalent employee numbers were computed on that basis. The plant operates a total of three months (1/4 of the year).  The FTEs for the facility are four (4).\n\n\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThis facility complies with EPA's accident prevention rule and all applicable State and local codes and regulations. The anhydrous ammonia system is designed, installed, and maintained in accordance with ANSI/CGA G-2.1-2014 with amendments and State law.\n\n\n\nIn addition, the company has specific operating procedures in place intended to minimize the potential for an accidental (and potentially catastrophic) release of anhydrous ammonia.  The company has extended to the responding fire department the opportunity to visit our anhydrous ammonia plant, to participate in mock emergency simulation training, and to avail themselves of specific anhydrous ammonia health hazard information and training provided by the company. \n\n\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThis facility has not experienced any accidental release involving anhydrous ammonia in the last five years that caused death, injuries, property or environmental damage, evacuations or sheltering in place.\n\n\n\n\n\nTHE EMERGENCY RESPONSE PROGRAM\n\n\n\nIn the event of an emergency involving our anhydrous ammonia system, it is the policy of the company is to immediately notify the responding fire department, and the appropriate LEPC/EMA to request that they respond to the emergency.  In the unlikely event that the responding fire department is unable to adequately respond to an emergency at the location, the fire department with whom the responding fire department has a reciprocal agreement will be summoned.  This policy has been reviewed with the fire department and LEPC/EMA. \n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe plan is to minimize those hazards to human health and to the environment that are associated with accidental releases of anhydrous ammonia.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069181,
      "SummaryText": "Employees working at the bulk storage plant make routine observations prior to and during transfer operations of the anhydrous ammonia from the storage vessel(s) to nurse tanks.  In so doing, they are able to detect problems before they arise.  This routine inspection identifies any portion of the system which may be under stress or about to fail. Repairs can be made before they become problematic.  Employees are annually trained to recognize the hazards associated with storage and handling of anhydrous ammonia.  In addition to annual training for employees who have been on the job for a number of years, the company conducts training for new hires.  This training includes classroom instruction, on-site training at the plant, and follow-up observation to determine their individual comprehension and understanding of the new hire.  The company routinely invites local fire department personnel to visit the site.  Should the local fire department request assistance in the training of its employees on the properties and characteristics of anhydrous ammonia, the company cooperates in their endeavors.\n\n"
    }
  ]
}