{
  "FacilityID": 1000062779,
  "FacilityName": "Vignolo Farms Potato Shed",
  "FacilityStr1": "16456 Slater Road",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93308",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": null,
  "FacilityLatDecDegs": "35.555380",
  "FacilityLongDecDegs": "-119.198090",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6914212,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Vignolo Farms",
  "OperatorStr1": "P.O. Bin 1270",
  "OperatorStr2": null,
  "OperatorCity": "Shafter",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93263",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ana Landeros",
  "RMPTitle": "Safety Manager",
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000183437",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-04-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-04-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-05 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-04-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.55333,
  "FRS_Long": -119.19889,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078703,
      "AltID": "Chlorine",
      "FacilityID": 1000062779,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000079883,
          "ProcessID": 1000078703,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098040,
          "ProcessID": 1000078703,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598040,
          "ProcessID": 1000078703,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000078813,
      "AltID": "Chlorine Storage",
      "FacilityID": 1000062779,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000079993,
          "ProcessID": 1000078813,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098180,
          "ProcessID": 1000078813,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598180,
          "ProcessID": 1000078813,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062779,
      "SummaryText": "1. Executive Summary\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n- California Accidental Release Prevention (CalARP) Program \"\" Title 19 CCR, Chapter 4.5\n\n- Federal EPA Risk Management Program (RMP) \"\" Title 40 CFR 68\n\n- California Process Safety Management (PSM) Program, Title 8 CCR 5189\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR 1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Vignolo - Potato Shed has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 Vignolo - Potato Shed, Risk and Process Safety Management Program\n\n\n\nThis is to inform all interested persons, including employees, that Vignolo - Potato Shed has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following processes which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nProcess Name                     | Process Chemical                | Process Quantity(lbs.)\n\nP2 Chlorine                           Chlorine                                  4,000\n\nP3 Chlorine                           Chlorine                                  4,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\n\n\n\nOur company has many policies and procedures in place to p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062779,
      "SummaryText": "romote overall plant, worker and public safety. We have: \n\n1. Prepared a unified program based on the PSM regulation to meet CalARP and RMP obligations as well\n\n2. Organized the program so that it meshes closely with general business practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Descriptions\n\n\n\nThe chlorine process at Vignolo Farms Potato Shed is an integral part of the potato processing business, which operates for only a few months out of the year.   The chlorine process operates as follows:\n\n- Chlorine one-ton containers are delivered by a chlorine vendor and then connected to the process by Vignolo personnel.\n\n- When water treatment is required, the water pump for the chlorination system is turned on.\n\n- An ejector installed in the water pump discharge line draws chlorine gas through a regulator mounted on the one-ton container.\n\n- The highly acidic chlorinated water downstream of the ejector is dumped into a buffer tank where the pH is neutralized. \n\n- Chlorinated, buffered water with a neutral pH is sent to the Potato Wash process and then to the Pit.\n\n- Empty cylinders are disconnected from the process and removed from the facility by the chlorine vendor for refilling.\n\n\n\nThe chlorine process at this facility consists of vessels which are interconnected, or which are co-located in two separate areas, such that a release of chlorine could impact the ability to operate vessels in the same area that are not directly connected.  Therefore, the systems are treated as two processes.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of chlorine in annual safety meetings. During these meeting we a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062779,
      "SummaryText": "lso discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nVignolo - Potato Shed has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for a process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 Chlorine\n\n\n\nThe chlorination process at the Vignolo - Potato Shed facility is an integral part of the overall business and operates for only a few months out of the year. The chlorination process utilizes one [QUANTITY (lbs.)] cylinder, with another cylinder stored next to it as a backup. As with the ammonia process management is committed to making sure that employees are made aware of the potential danger of a chlorine leak. \n\nVignolo - Potato Shed personnel monitor the chlorination process. In addition, the process is checked frequently during the operational season by our outside water treatment contractor. This contractor also assists in performing the annual mechanical integrity review of our chlorine equipment.\n\n\n\n1.4 Five Year Accident History\n\n\n\nVignolo - Potato Shed has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\n\n\nVignolo - Potato Shed's emergency action and response program has been developed to satisfy the following requirements:\n\n- Cal/OSHA's Emergency Action Plan \"\" Title 8 CCR 3220\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Emergency Action Plans - Title 29 CFR 1910.38\n\n- Cal/OSHA's Process Safety Management [Emergency Response Program Requirements] \"\" Title 8 CCR 5189(n)\n\n- U.S. Occupational Safety and Health Administration's (OSHA) Process Safety Management [Emergency Planning and Response Requirements]- Title 29 CFR 1910.119(n)\n\n- California Accidental Release Prevention (CalARP) Program [Emergency Response Program Requirements] \"\" Title 19 CCR, Division 2, Chapter 4.5"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062779,
      "SummaryText": " 2765.1-2765.2\n\n- USEPA Risk Management Program [Emergency Response Program Requirements] - Title 40 CFR 68.95\n\n- California Hazardous Materials Business Plan (HMBP) [Emergency Response Plans and Procedures] \"\" Title 19 CCR, Division 2, Chapter 4 2731\n\n- California \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) \"\" Title 8 CCR Title 8 5192(q)\n\n- Federal \"Hazardous Waste Operations and Emergency Response\" (HAZWOPER) \"\" Title 29 CFR 1910.120(q)\n\n\n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nVignolo - Potato Shed has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Vignolo - Potato Shed continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Vignolo - Potato Shed's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Vignolo - Potato Shed's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nVignolo - Potato Shed has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Vignolo - Potato Shed has also entered into a contract with Resource Compliance to obtain help with RMP-PSM prog"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000062779,
      "SummaryText": "ram implementation.\n\n\n\nFor the future, Vignolo - Potato Shed now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Vignolo - Potato Shed employees, but allows for feedback and continual improvement. Through the RMP-PSM program Vignolo - Potato Shed will continue to maintain overall plant worker and public safety."
    }
  ]
}