{
  "FacilityID": 1000007397,
  "FacilityName": "Jennie-O Turkey Store, Inc., Montevideo",
  "FacilityStr1": "901 North 24th Street",
  "FacilityStr2": null,
  "FacilityCity": "Montevideo",
  "FacilityState": "MN",
  "FacilityZipCode": "56265",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27023",
  "LEPC": "Minnesota LEPCs",
  "FacilityLatDecDegs": "44.954833",
  "FacilityLongDecDegs": "-095.699028",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6160766,
  "ParentCompanyName": "Hormel Foods Corp.",
  "Company2Name": null,
  "CompanyDUNS": 6147383,
  "Company2DUNS": 6147383,
  "OperatorName": "Jennie-O Turkey Store, Inc",
  "OperatorStr1": "901 North 24th Street",
  "OperatorStr2": null,
  "OperatorCity": "Montevideo",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56265",
  "OperatorZipCodeExt": null,
  "RMPContact": "Devin Naber",
  "RMPTitle": "Plant Engineer",
  "FTE": 250,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000102792",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2000-09-21 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-02-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 44.95411,
  "FRS_Long": -95.72197,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000008543,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000007397,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000008746,
          "ProcessID": 1000008543,
          "NAICSCode": "311615",
          "_desc": {
            "NAICS_CODE": "311615",
            "NAICS_DESCRIPTION": "Poultry Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000009562,
          "ProcessID": 1000008543,
          "ChemicalID": 56,
          "Quantity": 22300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000509562,
          "ProcessID": 1000008543,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007397,
      "SummaryText": "SOURCE\nThe Jennie-O Turkey Store, Inc. facility in Montevideo, Minnesota is a processing facility consisting of the further processing, cooking, packaging and shipping of turkey.  The facility is subject to the USEPA's Risk Management Program (RMP) for Accidental Chemical Release regulation (40 CFR 68) because it has a refrigeration system that contains more than the threshold quantity (10,000 pounds) of anhydrous ammonia (CAS Number 7664-41-7).  The anhydrous ammonia (ammonia) refrigeration system is used to control the temperature for turkey processing and packaging.  The entire system contains approximately 22,300 pounds of ammonia in various physical states (gas, liquid, and saturated vapor).  The largest vessel is the high pressure receiver that operates at approximately 150 psig and can contain as much as 11,400 pounds of liquid ammonia, assuming a 90 percent fill volume.  Most of the ammonia equipment is located indoors.  The condensing towers and some piping are located outdoors.  \n\nProcess Description\nThe ammonia refrigeration system at the Montevideo facility is a two-stage system consisting of a high pressure side and a low pressure side.  The low side (i.e., low pressure) is intended to quickly freeze product, while the high side (i.e., high pressure) is intended to refrigerate the product.  Equipment and piping carry the necessary gas, liquid, and saturated vapor throughout the system.  \n\nThe ammonia refrigeration system is protected by the existence of specific safety systems/hardware, including safety relief valves (SRVs), engine room ventilation, and system safety interlocks.  SRVs protect the compressor discharge, condensers, pumper drums, accumulators, and pump-out system from the hazards associated with over-pressure.  Safety interlocks include high pressure and high temperature alarms and cutouts for the compressors, as well as high level floats and sensors for the vessels.\n\nPREVENTION PROGRAM\nThe Montevideo facility has carefully considered the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007397,
      "SummaryText": "potential for accidental releases of ammonia, such as the occurrence of the worst-case and alternative-case release scenarios.  To help minimize the probability and severity of an ammonia release, a prevention program that satisfies the Occupational Safety and Health Administration (OSHA), Process Safety Management (PSM) of Highly Hazardous Chemicals (29 CFR 1910.119) has been implemented.  The key components of the prevention program are summarized below:\nThe development of an employee participation program, which includes Montevideo facility employees from all areas within the plant (i.e., production and maintenance). \nThe development, documentation, and operator availability of critical process safety information regarding the hazards of ammonia, the design basis of the system, and the equipment.  This information is used to fully understand and safely operate the ammonia refrigeration system.\nThe performance of a formal process hazard analysis (PHA) on the ammonia refrigeration system using a \"What-If\" Analysis.  A team with expertise in engineering, operations, maintenance, and safety evaluated the existing refrigeration system in depth and developed recommendations to improve the safety and operability of the system. The PHA will be updated and revalidated every five years.\nStandard operating procedures (SOPs) are used to provide the basis for proper and safe operation of the ammonia refrigeration system.  The SOPs include procedures for normal operations, startup, shutdown, emergency operations, and emergency shutdown.  They also describe safe operating limits for temperature and pressure, the consequences of operating outside these safe operating limits, and a description of safety systems and how they operate.\nRefrigeration system operators receive refresher training at least every three years.  The training content is based on the process safety information and operating procedures.  The training program ensures that the operators understand the nature and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007397,
      "SummaryText": " causes of problems arising from system operations and serves to increase awareness with respect to the hazards particular to ammonia and the refrigeration process.\nContractors that are hired to work on, or adjacent to, the refrigeration system are pre-qualified based on their knowledge of ammonia refrigeration, understanding of applicable codes and standards, and their demonstrated ability to work safely.  In addition, these contractors are periodically evaluated to ensure that they continue to work safely.\nA Jennie-O Turkey Store, Inc. refrigeration system computer preventative maintenance program is utilized at the Montevideo facility. This includes regular inspection and calibration of liquid level sensors, temperature and pressure instruments, switches and shutdown devices that have safety implications. Also included is the regular inspection of major powered equipment, including compressors, pumps and large fans, bearings, couplings, shaft seals, mountings, etc., for vibration or incipient mechanical failure.\nFormal authorization systems (i.e., management of change procedure, pre-startup safety review) are in place to ensure that system changes or expansions are as safe as the original design and that an independent recheck confirms that the changes are consistent with the engineering design and in a condition to be safely operated prior to startup.\nEvents that might cause an accidental or unexpected release of ammonia are subjected to a formal investigation.  The objective of the investigation is to correct deficiencies in such a way as to prevent recurrence.\nPrior to the performance of any hot work (i.e., spark or flame producing operations such as welding, cutting, brazing, grinding), management must approve the work by executing a written hot work authorization permit to verify that precautions to prevent fire have been implemented.\nPlanning with the local fire department to ensure a rapid response to potential incidents with the system or external events,"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000007397,
      "SummaryText": " such as floods or tornadoes.\nPrevention program compliance audits are performed every three years to verify that the appropriate management systems are in place and are being properly implemented.  Any deficiency found in an audit is corrected.\nACCIDENT HISTORY\nThere have been no accidental releases of ammonia at the Montevideo facility that resulted in deaths, injuries, property damage onsite, or known offsite deaths, injuries, property damage, or environmental damage, evacuations, or sheltering-in-place.\nEMERGENCY RESPONSE PROGRAM\nThe Montevideo facility has implemented a detailed written Emergency Response Plan (ERP).  The ERP is intended to address all emergencies at the facility, in addition to incidents related to a release of anhydrous ammonia.  The ERP includes:\nCoordination with the local fire department and with the Local Emergency Planning Committee (LEPC);\nEmergency escape procedures and emergency escape route assignments;\nProcedures to be followed by employees who remain to operate critical plant operations before they evacuate;\nProcedures to account for all employees after emergency evacuation has been completed;\nWhat personal protective equipment and spill response equipment is available;\nThe preferred means of reporting fires and other emergencies;\nNames of persons or departments who can be contacted for further information or explanation of duties under the plan;\nDesignation and training of a sufficient number of persons to assist in the safe and orderly evacuation of employees;\nThe names of personnel:  (1) responsible for maintenance of equipment and systems installed to prevent or control ignition, and (2) responsible for control of fuel source hazards;\nRefers to other pertinent elements of the management system (i.e., standard operating procedures).\nJennie-O Turkey Store will continue to conduct operator training, and coordinate emergency response drills with the local fire department to improve ammonia safety and emergency response."
    }
  ]
}