{
  "FacilityID": 1000002135,
  "FacilityName": "Wyckoff Water Treatment Plant",
  "FacilityStr1": "3728 Mars Hill Road",
  "FacilityStr2": null,
  "FacilityCity": "Acworth",
  "FacilityState": "GA",
  "FacilityZipCode": "30101",
  "Facility4DigitZipExt": "3837",
  "FacilityCountyFIPS": "13067",
  "LEPC": "Cobb Co. Resource Council/LEPC",
  "FacilityLatDecDegs": "34.045562",
  "FacilityLongDecDegs": "-084.688967",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Cobb County - Marietta Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 785430158,
  "Company2DUNS": 0,
  "OperatorName": "Cobb Co.-Marietta Water Authority",
  "OperatorStr1": "1660 Barnes Mill Road",
  "OperatorStr2": null,
  "OperatorCity": "Marietta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30062",
  "OperatorZipCodeExt": "7535",
  "FTE": 42,
  "OtherEPAFacilityID": "N/A",
  "EPAFacilityID": "100000046014",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-12-18 00:00:00",
  "SafetyInspectionBy": "Insurance Loss Officer",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-07-02 00:00:00",
  "DeRegistrationEffectiveDate": "2013-02-11 00:00:00",
  "AnniversaryDate": "2014-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.04498,
  "FRS_Long": -84.69334,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "1",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002797,
      "AltID": "Chlorine used at WTP",
      "FacilityID": 1000002135,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000003050,
          "ProcessID": 1000002797,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000002904,
          "ProcessID": 1000002797,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000001421,
              "Process_NAICS_ID": 1000002904,
              "SafetyReviewDate": "2007-01-23 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "Uniform Fire Code (UFC), Chlorine Institute Standards (CIS)",
              "FR_Comments": null,
              "HazardReviewDate": "2007-01-23 00:00:00",
              "ChangeCompletionDate": "2007-01-23 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Vandalism, Terrorism, Airplane Crashes",
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-02-25 00:00:00",
              "TrainingReviewDate": "2007-03-27 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-06-25 00:00:00",
              "EquipmentInspectionDate": "2008-11-11 00:00:00",
              "EquipmentTested": "Daily inspections of chlorine containers and chlorination process equipment.",
              "ComplianceAuditDate": "2007-01-23 00:00:00",
              "AuditCompletionDate": "2007-01-23 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "The chlorine storage and the chlorination system are designed and installed in accordance with the design standards.  In addition to the standard operating procedures, manufacturer's specifications are followed where applicable for safe operation of the process.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000001467,
                  "PreventionProgram2ID": 1000001421,
                  "ProcessChemicalID": 1000003050
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000002135,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Cobb Co. Fire and Emergency Service",
    "CoordinatingAgencyPhone": "7705288000",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": "SDWA, CERCLA"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000002135,
      "SummaryText": "Introduction\n\nChemicals are widely used in industry, in the home, in the environment.  They are transported on roads, water, and railways.  We at the Wyckoff Water Treatment Plant (WTP) use chemicals, too.  For example, we use chlorine to disinfect our water to provide safe drinking water. Storing large qualities of chlorine can be a hazard.  We take our safety obligations in storing and using chlorine as seriously as we take providing safe drinking water.  The following document describes what could happen if there were to be an accident, the steps we take everyday to ensure a safely operating plant, and what to do in event of an emergency.  Please feel free to contact the CCMWA General Manager at 770-426-8788 if you have any questions.\n\nPolicy Statement\nAccidental Release and Emergency Response Policies\n\nIt is the policy of CCMWA to operate the Wyckoff WTP safely, reducing to the greatest extent possible any hazards associated with the chlorine system and reducing any subsequent risk to the surrounding community, personnel, and environment.  Safe operation depends upon proper storage of chlorine, proper handling of the chlorination system, and inherent safety features in the design of the chlorination system. \nThe Wyckoff WTP accidental release prevention policy involves a unified approach that integrates proven technology, trains staff on operation and maintenance practices, and uses tested management system practices.  All applicable procedures of the Risk Management Program Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.\nThis policy includes working with the surrounding community and local emergency response agencies, to promote a spirit of cooperation and teamwork, to orchestrate an effective contingency plan in the unlikely event of a process incident occurring at the Wyckoff WTP.  The emergency response plan includes procedures for notifying the Cobb County Fire and Emergency "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000002135,
      "SummaryText": "Services. \n\nThis document complies with the U.S. Environmental Protection Agency's (EPA's) Risk Management Program, under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68.   The Wyckoff WTP has a chlorination system that uses chlorine gas fed from liquid chlorine containers. CCMWA has prepared a detailed and comprehensive ERP to handle any potential accidental releases that is designed to safeguard both on- and off-site people. To date, we have had an excellent record in preventing accidents from occurring.\n\nGeneral Facility and Regulated Substance Information\n\nThe Wyckoff WTP facility, operating since 1963, is located in Cobb County, Georgia. The primary activity at the Wyckoff WTP is municipal water treatment, including chlorination of water for disinfection and taste and odor control.  The Wyckoff WTP has a present water treatment capacity of 72 million gallons  per day (MGD). The sludge lime by-product from the facility is applied to farm land.\n\nThe facility currently stores chlorine in one-ton steel storage cylinders. This chlorine storage exceeds the listed threshold quantity in the RMP Rule. The chlorine is also used to generate chlorine dioxide, which is used as it is generated, and is not present in the process in amounts greater than the threshold quantity in the RMP Rule.\n\nA chlorine leak detector monitor continuously checks for leaks in the cylinder storage area and in the chlorinator room.  The facility also has additional alarms for process control. These alarms are annunciated at the chlorine central control panel at the Wyckoff WTP. \n\nBoth the cylinder storage area and the chlorinator room are enclosed in a building.  The building is equipped with a manually operated ventilation system.  Emergency showers and eye wash stations are provided at the building.  \n\nNo chlorine releases that could have caused safety or health hazard (no deaths, injuries, property or environmental damage, evacuations"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000002135,
      "SummaryText": ", or sheltering in place) occurred at the Wyckoff WTP during the last five years.  Some minor, incidental releases may have occurred over this period, but they were quickly handled by staff, were neutralized, or posed no safety or health hazards.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe CCMWA's Wyckoff WTP is in compliance with the RMP Rule, 40 CFR 68.  The facility has conducted a comprehensive review of the chlorine system, as well as of administrative, technical, operating and maintenance procedures, in addition to the other required program elements of the RMP rule.  A hazard review was conducted at this facility using a \"What-If\" analysis.\n\nChemical-specific prevention steps include availability of self-contained escape breathing apparatus, a fully equipped and maintained chlorine cylinder \"B\" kit, awareness of the hazardous and toxic properties of chlorine, and the presence of chlorine detectors and alarms.\nThe Wyckoff WTP and Intake accidental release prevention program is based on the following key elements:\n1) Detailed management system and clear levels of responsibilities and team member roles\n2) Comprehensive safety process information that is readily available to staff, emergency responders,  and contractors\n3) Comprehensive preventive maintenance program\n4) Completed a process hazard analysis of equipment and procedures with operation and maintenance staff participation and review\n5) Use of process and safety equipment\n6) Use of accurate and effective operating procedures, written with operations and maintenance staff participation\n7) High level of training of operators and maintenance staff\n8) Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nFive-year Accident History\n\nThe CCMWA's Wyckoff WTP has never had a release of chlorine resulting in offsite injury or dispersion, or an onsite injury.\n\nEmergency Response Program\n\nThe CCMWA's Wyckoff WTP c"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000002135,
      "SummaryText": "oordinates it's emergency response efforts with the Cobb County Fire and Emergency Services' Hazardous Materials (HAZMAT) team, the police department, and the hospital.  Response activities also have been discussed with the Cobb County Resource Council. Tours have been given to the local fire station first responders.\n\nPlanned Changes to Improve Safety\n\nIt was observed during the hazard review that the CCMWA's Wyckoff WTP has the necessary equipment and the operating and training procedures required for the safe operation of the chlorination system.  The following recommendations for improving the safety of the chlorination process were made:\n1. Within the next five (5) years CCMWA will replace the existing system with an on site generation system.\n"
    }
  ]
}