{
  "FacilityID": 1000080863,
  "FacilityName": "Thornton Water Treatment Plant",
  "FacilityStr1": "9520 Ellen Court",
  "FacilityStr2": null,
  "FacilityCity": "Thornton",
  "FacilityState": "CO",
  "FacilityZipCode": "80229",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08001",
  "LEPC": "Adams County",
  "FacilityLatDecDegs": "39.8697",
  "FacilityLongDecDegs": "-104.9731",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "PC",
  "FacilityURL": "www.ci.thornton.co.us",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Thornton",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mr. Martin Kimmes",
  "OperatorStr1": "12450 Washington Dr",
  "OperatorStr2": null,
  "OperatorCity": "Thornton",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80241",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mr. Steve A Foster",
  "RMPTitle": " Water Plant Supervisor",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000074956",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-10-12 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-04-16 00:00:00",
  "DeRegistrationEffectiveDate": "2021-04-07 00:00:00",
  "AnniversaryDate": "2024-07-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.87083,
  "FRS_Long": -104.96944,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101122,
      "AltID": "Chlorine",
      "FacilityID": 1000080863,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102384,
          "ProcessID": 1000101122,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126778,
          "ProcessID": 1000101122,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000626778,
          "ProcessID": 1000101122,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080863,
      "SummaryText": "40 CFR 68.155 Executive Summary\n\n\n\n68.155 (a) Accidental Release Prevention and Emergency Response Policies: The Thornton Water Treatment Plant (TTP) is owned and operated by the City of Thornton (CITY). The CITY has developed a chlorine Risk Management Program (RMP) to comply with Program 2 of EPA regulation 40 CFR 68, which include three elements: Hazard Assessment; Prevention Program; and Emergency Response. The CITY has and continues to comply with the requirements of this regulation.\n\n\n\n68.155 (b) Stationary Source and Regulated Substances Handled: TTP uses chlorine primarily to disinfect the drinking water prior to distribution. The TTP stores chlorine in quantities above the regulatory thresholds at which an RMP is required. No other 40 CFR 68 chemicals are stored at the plant in quantities above the regulatory thresholds.\n\n\n\n68.155 (c) Worst Case and Alternative Release Scenarios: EPA amended the RMP rule in 2004 to remove this requirement from the executive summary because of security concerns.\n\n\n\n68.155 (d) General Accident Release Prevention Program and Chlorine Specific Prevention Steps: The TTP Prevention Program consists of seven elements designed to improve the system safety and decrease the likelihood of a release and is consistent with the RMP requirements. These seven elements are described below:\n\n\n\nSafety Information: All of the required process safety information for chlorine at that TTP was compiled as required by the RMP regulations. The information meets and in many cases exceeds the minimum required by the regulations.\n\n\n\nHazard Review: The chlorine Hazard Review was conducted by an interdisciplinary team of CITY staff familiar with the process operation and maintenance, plant management and an outside consultant. The Hazard Review was performed using the \"Checklist\" method. Based on the results of the Hazard Review, no changes in operating, maintenance, and other safety management procedures that would improve the overall safety of the TTP "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080863,
      "SummaryText": "were identified. \n\n\n\nOperating Procedures: Operating procedures for the chlorination process were developed prior to the RMP. The detailed operating procedures include start-up, shutdown, and emergency operating procedures. The procedures describe how the system should be operated to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.  A new procedure titled \"Risk Management Plan Administration SOP\" was added in May of 2019.\n\n\n\nTraining: An effective RMP training program can significantly reduce the number and severity of accidental release incidences. TTP staff has received training on the safety information and operations and maintenance of chlorine. TTP staff receive on-going chlorine refresher training. In addition, operators must demonstrate proficiency with the chlorine system and be fit tested for personal protective equipment (PPE) prior to be allowed to perform duties within the Chlorine Storage Room. In addition to the above referenced training, select CITY staff have been trained to respond to an incidental chlorine gas release. Larger releases are addressed as part of the TTP's Emergency Response Program.\n\n \n\nMaintenance: The TTP is maintained by the CITY's Water Treatment Division Staff. The CITY is currently using a computerized maintenance management system to generate work orders and schedule preventative maintenance. In addition to preventative maintenance, the CITY's maintenance staff performs corrective maintenance in the event of equipment malfunction or breakdown. Work orders indicate what safety precautions must be followed including whether lock-out/tag-out or confined space entry provisions are applicable.\n\n\n\nCompliance Audit: The RMP requires CITY staff to complete periodic internal compliance audits. The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compli"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080863,
      "SummaryText": "ance with RMP requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and increase safety awareness among CITY staff.\n\n\n\nIncident Investigation: Each incident that resulted in or could reasonably have resulted in a catastrophic release of chlorine must be investigated. A process to identify the underlying causes of incidents and to implement procedures for preventing similar events has been developed. To investigate an incident, an investigation team will be established. As part of the investigation, an incident report will be prepared to recommend system changes.\n\n\n\n68.155 (e) Five Year Accident History: TTP has not had a chlorine release in the last five years.\n\n\n\n68.155 (f) Emergency Response Program: TTP has an Emergency Response Plan (ERP) that provides specific emergency response procedures for accidental releases of chlorine and other chemicals not included in this RMP. The emergency response procedures cover a release from the initial alarm stage through either leak stoppage or notifying the local hazardous material (HAZMAT) department for assistance. The emergency response procedures include plans for leak investigation and communication with additional support agencies. In addition, critical plant operations are identified to ensure that, if possible, the critical TTP functions are kept operational. The ERP also indicates the level of training need to carry out the emergency response procedures. Only personnel trained that have the Emergency Chlorine Leak Response Training may attempt to stop a leak. The emergency response procedures refer to \"City of Thornton Water Treatment Plant Standard Operating Procedures for the Emergency Chlorine Leak Response\" in cases when TTP evacuation is necessary.\n\n\n\n68.155 (g) Planned Changes to Improve Safety: To improve safety with the chlorine system, the CITY provides on-going training to employees that are involved with operating and maintaining the chlorine s"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080863,
      "SummaryText": "ystem. \n\n"
    }
  ]
}