{
  "FacilityID": 1000000848,
  "FacilityName": "C&S Wholesale Grocers Inc.",
  "FacilityStr1": "1120 Harvey Lane",
  "FacilityStr2": null,
  "FacilityCity": "Suffield",
  "FacilityState": "CT",
  "FacilityZipCode": "06078",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09003",
  "LEPC": "Suffield LEPC",
  "FacilityLatDecDegs": "41.850000",
  "FacilityLongDecDegs": "-072.991389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A3",
  "LatLongDescription": "SW",
  "FacilityURL": "www.cswg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 410617000,
  "ParentCompanyName": "C&S Wholesale Grocers Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "C&S Wholesale Grocers Inc.",
  "OperatorStr1": "7 Corporate Drive",
  "OperatorStr2": null,
  "OperatorCity": "Keene",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03431",
  "OperatorZipCodeExt": null,
  "FTE": 200,
  "OtherEPAFacilityID": "CTD065531410",
  "EPAFacilityID": "100000102694",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.94571,
  "FRS_Long": -72.62425,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "150",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001036,
      "AltID": " ammonia (anhydrous)",
      "FacilityID": 1000000848,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001089,
          "ProcessID": 1000001036,
          "ChemicalID": 56,
          "Quantity": 15200.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000001116,
          "ProcessID": 1000001036,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000591,
              "Process_NAICS_ID": 1000001116,
              "SafetyReviewDate": "2006-07-11 00:00:00",
              "PHA_Date": "2009-05-13 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-05-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Ammonia Detection",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Five year revalidation.",
              "OpProceduresReviewDate": "2009-05-13 00:00:00",
              "TrainingReviewDate": "2005-09-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2006-07-10 00:00:00",
              "EquipmentInspectionDate": "2008-06-02 00:00:00",
              "EquipmentTested": "Annual system mechanical integrity audit and inspection.",
              "ChangeMgmtDate": "2001-11-21 00:00:00",
              "ChangeMgmtReviewDate": "2005-11-28 00:00:00",
              "PreStartupReviewDate": "2003-12-24 00:00:00",
              "ComplianceAuditDate": "2008-09-17 00:00:00",
              "AuditCompletionDate": "2009-09-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2005-09-28 00:00:00",
              "HotWorkPermitReviewDate": "2005-02-28 00:00:00",
              "ContractorSafetyReviewDate": "2005-09-28 00:00:00",
              "ContractorSafetyEvalDate": "2008-09-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "Refrigerated Warehouse Storage Facility",
              "_chemicals": [
                {
                  "PrimaryKey": 1000000641,
                  "PreventionProgram3ID": 1000000591,
                  "ProcessChemicalID": 1000001089
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000848,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-03-25 00:00:00",
    "ERTrainingDate": "2009-04-28 00:00:00",
    "CoordinatingAgencyName": "Suffield Fire Department",
    "CoordinatingAgencyPhone": "8606683888",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000848,
      "SummaryText": "C&S Wholesale Grocers Inc. Took over the Suffield facility in October of 2003.\nC&S Wholesale Grocers Inc. Has begun its facility risk management program by defining the process. The process at the perishable facility is one of refrigeration. To define would be to say that the anhydrous ammonia is used as a refrigerant to absorb heat from inside an insulated vault area and maintain temperatures of -10 F, 28 F, and 34 f. The process of absorbing takes place through evaporators that are suspended from the ceiling of the vaults or in penthouses. The anhydrous ammonia is pumped into these evaporator air handlers with the use of sealed pumps at the rate of 4 to 1 ratio. This means that 4 times the amount of refrigerant is pumped into the evaporator that can be boiled off during the refrigeration cycle. The refrigerant is then recycled to the pump packages. The screw compressors maintain the pressures required to maintain the desired temperature, by sucking a vapor off the top of the pump packages. This vapor is then compressed into a high pressure gas and piped to an evaporative condenser on the roof of the facility. The high -pressure gas is then condensed by removing heat from the refrigerant pipes within the evaporative condenser by passing water and air over them, thus condensing the high-pressure gas into high-pressure liquid. This liquid then drains into a high pressure liquid receiver. The level of refrigerant in the pump packages is maintained by a float switch allowing liquid refrigerant into thte low stage and high stage pump packages, each having it's own float switch. This liquid is supplied by liquid in the high pressure receiver. There the process being performed is one of boiling (therefore absorbing heat) and condensing (therfore rejecting heat into the atmosphere) within a closed loop system.\n\nThe facility's approach to chemical safety is taken from 29 CFR 1910.119\nWithin this reference are the following:\n\nEMPLOYEE PARTICIPATION\nWe have an on-going proces"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000848,
      "SummaryText": "s safety meetings. Employees, management, insurance co., fire dept, LEPC and contractors have been in attendance in these meetings when required. Employees have been involved in every aspect of the PSM program. There have not been any additions to the process since installation of the original equipment.\n\nPROCESS SAFETY INFORMATION\nThe contradctor information that was compiled during construction is complete. Although we , through the Process Hazard Analysis have approached all aspects of the information to confirm these facts. Since the process involved is one of refrigeration, the majority of the information needed is compiled on the M.S.D.S. Toxicity, permissible exposure limits, physical data, reactivity data, corrosive data, thermal and chemical stability data, and hazards of inadvertent mixing of different materials all are contained on the M.S.D.S. And are on file. It is also covered by our hazardous communication program posted in the warehouse.\n\nINFORMATION ON TECHNOLOGY OF THE PROCESS\n\nBlock flow diagrams have been made on a one-line diagram for simplicity. They include the zone valve locations for quick reaction by untrained eyes. The as built mechanical drawings and electrical diagrams are readily available in the maintenance office, and in the Emergency Response box located at the Guard Shack entering the facility. They are updated to show changes that have occurred in the program.\n\nMAXIMUM INTENDED INVENTORY\n\nThe Suffield facility has 15,200 lbs. Of anhydrous ammonia. Since our process is one of refrigeration all of our equipment is and has been purchased and designed for the pressure and temperature relationships of NH3. Each and every aspect of the process has been examined by hazard analysis.\n\nEVLUATION OF THE CONSEQUENCES OF DEVIATIONS\n\nC&S Wholesale Grocers Inc. Feels that since all of the equipment involved has been chosen with respect to NH3 that there are no deviations, therefore no consequence. All mechanics and contractors have been throuough"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000848,
      "SummaryText": "ly trained in the operation and installation of NH3.\n\nMATERIAL OF CONSTRUCTION\n\nDocumentation on site.\n\nPIPING AND INSTRUMENTS DIAGRAMS\n\nDocumentation on site\n\nELECTRICAL CLASSIFICATION\n\nThis area is a class II location in a division 2 area\n\nRELIEF SYSTEM\n\nRelief system is designed to relieve the entire system.\n\nVENTILATION SYSTEM\n\nVentilation system meets the code. Documentation on site.\n\nDESIGN CODE AND STANDARDS EMPLOYED\n\nMechanical codes have been met.\n\nSAFETY SYSTEMS\n\nAmmonia detection temperature alarms, relief system, maintenance programs, and remote pump down and shut down buttons, remote ventilation buttons, and auto ventilation detection system.\n\nPROCESS HAZARD ANALYSIS\n\nThe \"what-if method of process hazard analysis was used initially and is documented.  A Process Hazard Analysis Revalidation was completed in November of 2004.  The study implemented the Hazard and Operability Study (HAZOP) method and is documented.  A revalidation of the PHA was completed in May of 2009.\n\nOPERATIING PROCEDURES\n\nOperating procedures have been written on start-up and shut down of the ammonia plant, sprinkler operation, fire pump operation, hot work permit, confined space and lock out tag out.\n\nTRAINING\n\nAll employees involved in the actual operation and maintenance have been trained in all safe work practice policies. Ammonia safety, confined space, bloodborne pathogen, electrical safety, hazard communication, fire extinguishers, 24 hour tech, incident command and Operator I course at Garden City Community College, Kansas.\n\nCONTRACTORS\n\nTraining of contractors is an on-going process. Documentation  is on site. Contractors are trained  in all aspects of safe work practice policies. PSM is introduced to each contractor before he begins working at the facility. \n\nPRE-STARTUP SAFETY REVIEW\n\nThe risk management must attend any and all meetings that might concern modifying the process including other construction within the facility.\n\nMECHANICAL INTEGRITY\n\nTo date there has been "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000848,
      "SummaryText": "no modification to the process. There is however, on-going inspection of all equipment and integrity of the equipment is an on-going task of inspections. There is also periodic vibration and oil analysis on all compressors.\n\nHOT-WORK PERMITS\n\nStandard procedures have been established for both mechanics and contractors and hot work permits kept on site for daily use.\n\nMANAGEMENT OF CHANGE\n\nA management of change policy has been written and is in use.\n\nINCIDENT INVESTIGATION\n\nThe Suffield facility has an on-going incident investigation program.\n\nEMERGENCY PLANNING AND RESPONSE\n\nAn extensive plan has been created and distributed to all subject personnel and the fire dept. and LEPC.\n\nFACILITY PROFILE:\n\nC&S Wholesale Grocers Inc. Suffield Ct is a warehousing and distribution facility built in 1959 and expanded in 1968, 1976, 1978, 1984 and in 1992 for the storage and distribution of perishable food products and dry grocery. The main building is constructed of steel masonry and cooler panels and is alarmed and sprinkler equipped. It is approximately 700,000 sq. Ft. Sitting on 66 acres about 2.2 miles north of I-91 on the west side of the Connecticut River. There are no basements in either of the additons. 20,000 gals of #2 fuel oil is stored in one underground tank. \n\nThe main building is refrigerated using NH3 or Anhydrous Ammonia. The main machine room is located on the north side of the perishable section of the building. There are fire hydrants, diesel pump, and electric pump, and a 300,000 gallon tank for the sprinkler systems water supply.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nC&S Wholesale Grocers Inc. Follows the OSHA PSM Rules. The manufacturers maintenance schedules are followed, compressor log sheets filled out, refrigeration emergency pump down remote switches have been installed, evaporator and condenser cleaning, pipe guard inspections, pipe hanger inspections, temperature logs, PI&D labeling of all valves, ce"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000848,
      "SummaryText": "ntral relief valve piping and sprinkler inspection. Annual training is given to all maintenance personnel in ammonia safety, electrical safety, confined space, bloodborne pathogens, fire extinguisher, HAZCOM, fall protection, forklift training, sprinkler training, respiratory, hot work permits and lock-out tag-out.\n\nFIVE-YEAR ACCIDENT HISTORY\n\n None\n\nEMERGENCY RESPONSE PROGRAM\n\nC&S Wholesale Grocers Inc. Conducts continous planning to minimize the danger to life, health and property from emergencies or disasters. We cooperate with the state, local and public bodies and agencies charged with Emergency Response. We take necessary and prudent steps to assure continuity of operations and restoration of production activities as quickly as possible following and emergency or disaster. We have developed an Emergency Response Program, which includes all the criteria for implementation and assigned responsibilities. These elements include:\nPolicy, Scope and Priorities\nPlanning for Emergency Response\nDefinitions\nEmergency Classification Levels\nNotification Procedures\nInitial Mobilzation\nEmergency Response Team Comminications\nEmergency Response Council List\nEmergency Response Center and Command Post\nEvacuation Procedures\nEmergency Outside Help-Local and State\nHospitals\nLocations of Emergency Shutoffs\nEmergency Equipment Available\nFirst Aid & CPR first response\nEmployee Emergency Plan and Fire Prevention Plan\nActive member of the LEPC\n\nPLANNED CHANGES TO INCLUDE SAFETY\n\nTraining will be an on-going focus in any aspect of our process. PHA is constantly in progress."
    }
  ]
}