{
  "FacilityID": 1000061618,
  "FacilityName": "GLOBALFOUNDRIES Fab 8",
  "FacilityStr1": "400 Stone Break Rd Ext",
  "FacilityStr2": null,
  "FacilityCity": "Malta",
  "FacilityState": "NY",
  "FacilityZipCode": "12020",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36091",
  "LEPC": null,
  "FacilityLatDecDegs": "42.970089",
  "FacilityLongDecDegs": "-73.754370",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": "www.globalfoundries.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 595100884,
  "ParentCompanyName": "GLOBALFOUNDRIES, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "GLOBALFOUNDRIES, Inc.",
  "OperatorStr1": "400 Stone Break Rd Ext",
  "OperatorStr2": null,
  "OperatorCity": "Malta",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "12020",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joel Rouillard",
  "RMPTitle": "Environmental Manager",
  "FTE": 3396,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000227319",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-09-29 00:00:00",
  "SafetyInspectionBy": "DUV - ISO1800 Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-01-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-01-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077167,
      "AltID": "Phase I & II NH4OH Tanks",
      "FacilityID": 1000061618,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000078345,
          "ProcessID": 1000077167,
          "NAICSCode": "33441",
          "_desc": {
            "NAICS_CODE": "33441",
            "NAICS_DESCRIPTION": "Semiconductor and Other Electronic Component Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000095822,
          "ProcessID": 1000077167,
          "ChemicalID": 57,
          "Quantity": 28710.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000595822,
          "ProcessID": 1000077167,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061618,
      "SummaryText": "1.0    Purpose\n\n\n\nThe Purpose of this document is to describe the Fab 8 RMP Applicability Ammonium Hydroxide.\n\n\n\n2.0    RMP Applicability for Ammonium Hydroxide\n\n\n\nAmmonium Hydroxide used at the GLOBALFOUNDRIES facility in the Malta, New York is listed as a regulated substance in 40 CFR ?68.130.  The threshold quantity for ammonium hydroxide at concentrations greater than 20% is 20,000 pounds.  The ammonium hydroxide storage tanks, which consist of interconnecting storage tanks and associated piping located in Fab 8 Phase I & II buildings/areas, contain approximately 52,381 pounds of ammonium hydroxide in aggregate total. A summary of these interconnecting tanks are as follows:\n\n\n\nPhase I\n\n\n\n529 Gal Tank of 2%\n\n6505 Gal Tank of 29%\n\n529 Gal Tank of 29%\n\n500 Gal Tank of 1%\n\n\n\nPhase II  \n\n\n\n6900 Gal Tank 29%\n\n6900 Gal Tank 29%\n\n559 Gal Tank 29%\n\n559 Gal Tank 29%\n\n\n\nInterconnected piping ---  5% of total volume.\n\n\n\n2.1    Ammonium Hydroxide Storage and Delivery System Process Description\n\n\n\nAmmonium hydroxide is off-loaded from 16,000-liter capacity tanker trucks into two interconnected 6,900-liter storage tanks, located in the chemical storage room within the Fab 8 Extension Building (near the northeast corner of building).  The secondary containment system for the ammonium hydroxide off-loading activities is approximately 3,875 liters in size.  In the event of a spill during unloading operations, the ammonium hydroxide would be contained with the trenches of the secondary containment system.\n\n\n\nThe chemical storage room within the Fab 8 Extension Building is ventilated/exhausted through a roof mounted acid scrubber with a minimum of 90% control efficiency.\n\n\n\n2.2    Hazard Assessment\n\n\n\n2.2.1    Introduction. A Hazard Assessment was conducted for the GLOBALFOUNDRIES in accordance with 40 CFR 60 Subpart B.  The Hazard Assessment consists of the following tasks:\n\n\n\n?    worst-case release scenario analysis\n\n?    alternative release scenario analysis\n\n?    defining off-site impacts - populatio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061618,
      "SummaryText": "n and environmental receptors\n\n?    five-year accident history\n\n\n\nThe GLOBALFOUNDRIES facility currently uses 29% ammonium hydroxide solution, which is on the list of regulated flammable substances (40 CFR Part 68.130). The toxic endpoint for concentrations of ammonium hydroxide greater than 20% is 0.14 mg/L. \n\n\n\n2.2.2        Worst-Case Release Scenario Analysis.  The worst-case release scenario is defined as the \"release scenario that is estimated to create the greatest distance in any direction to an endpoint\" [40 CFR Part 68.25].  The \"endpoint\" or \"toxic endpoint\" of a substance is defined as \"the maximum airborne concentration below which it is believed that nearly all individuals can be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action\" [USEPA, 1998].  The Off-Site Consequence Analysis (OCA) Guidance provided by the USEPA recommends that the worst-case release scenario be based on the following:\n\n\n\n1.    Failure of the entire contents of an ammonium hydroxide tanker truck, which has a maximum capacity of 19,100 liters, during off-loading activities leading to an airborne release of the entire inventory directly to atmosphere.\n\n\n\n2.    The release rate is the total inventory uniformly distributed over 10 minutes.\n\n\n\n3.    The meteorological conditions at the time of the release are characterized by a wind speed of 1.5 meters per second (m/s), an ambient temperature of 77?F (25?C), and an atmospheric stability class F.\n\n\n\n4.    Passive mitigation systems may be included in the analysis (if applicable).\n\n\n\nThe worst-case release scenario is defined as a release of 29% ammonium hydroxide solution from a delivery tanker truck during outdoor off-loading operations, where the entire contents of the 16,000-liter tanker truck is released.  The spilled ammonium hydroxide, from a tanker truck hose rupture or pump failure, for example, would be directed to "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061618,
      "SummaryText": "the secondary containment system for the off-loading activities, which consists of a grated trench system.  The spilled materials are ultimately pumped out of the trench system for proper handling and disposal. \n\n\n\nPassive mitigation measures (e.g., secondary containment trench system) were considered as part of this worst-case release scenario. \n\n\n\n2.2.3        Alternative Release Scenario Analysis.  The alternative release scenario [40 CFR Part 68.28] is considered the most likely release to occur from a covered process that is expected to produce the greatest distance to a toxic endpoint.  The Off-Site Consequence Analysis (OCA) Guidance provided by the USEPA recommends that the alternative release scenario be based on the following:\n\n\n\n1.    The scenario most likely to occur.\n\n\n\n2.    The meteorological conditions at the time of the release are characterized by a wind speed of 3 meters per second (m/s), an ambient temperature of 77?F (25?C), and an atmospheric stability class D.\n\n\n\n3.    Active as well as passive mitigation systems may be included in the analysis (if applicable).\n\n\n\nThe alternative release scenario most likely to cause off-site consequences is a release of the entire contents of a single 6,900-gallon ammonium hydroxide storage tank, which is located within the chemical storage room of the Fab 8 Extension Building.  A catastrophic release from the 6,900-gallon storage tank would be contained within the secondary containment system for the ammonium hydroxide storage tanks.  The vapor emissions from the spilled ammonium hydroxide would be ventilated and exhausted through a acid scrubber with a minimum of 90% removal efficiency before entering the atmosphere.  \n\n\n\nThe active mitigation measures of venting ammonium hydroxide emissions through the acid scrubber were considered as part of this alternative release scenario. \n\n \n\n2.2.4        Off-Site Consequence Analysis.  The off-site consequence analysis considers the effects of the worst-case and the alternative release "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061618,
      "SummaryText": "scenarios on off-site areas.  The off-site area considered is a circle with its center at the release point and radius equal to the distance to the toxic endpoints.  For both the worst-case and the alternative release scenarios, the effected population is evaluated and public and environmental receptors are determined.  \n\n\n\n1.    Off-Site Consequence Analysis - Worst-Case Release Scenario.  The total affected area for the worst-case release scenario is approximately 0.28 mi2 (0.3 miles release radius).  Based on this scenario, there are no affected public receptors, which can include residences, schools, churches, and public recreation areas.  There are no environmental receptors within the vulnerable zone.\n\n\n\n2.    Off-Site Consequence Analysis - Alternative Release Scenario.  The total affected area for the alternative release scenario is less than 0.03 mi2 (<0.1 miles release radius).  Based on this scenario, there are no affected public receptors, which can include residences, schools, churches, and public recreation areas.  There are no environmental receptors within the vulnerable zone.\n\n\n\n2.3    RMP Program Level Determination\n\n\n\nThe USEPA regulations assigned three different levels of complexity to the RMP program, depending on certain criteria at the particular plant in question.  The GLOBALFOUNDRIES facility qualifies as \"Program 1\" plant based on several factors.  Specifically, the GLOBALFOUNDRIES facility is eligible for Program 1 because there are no public receptors within the distance to an endpoint from a worst-case release; the process has had no release of a regulated substance (29% ammonium hydroxide) in the past five years where exposure to the substance has resulted in one or more offsite deaths, injuries, or response/restoration activities for exposure to an environmental receptor; and the facility has coordinated their emergency response activities with the local responders.  \n\n\n\n"
    }
  ]
}