{
  "FacilityID": 1000011763,
  "FacilityName": "Sunoco Logistics L.P. Mechanicsburg Terminal",
  "FacilityStr1": "5145 Simpson Ferry Road",
  "FacilityStr2": null,
  "FacilityCity": "Mechanicsburg",
  "FacilityState": "PA",
  "FacilityZipCode": "17055",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42041",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "40.219571",
  "FacilityLongDecDegs": "-076.974083",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sunocologistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sunoco Partners Mktg.&Terminals LP",
  "OperatorStr1": "5145 Simpson Ferry Road",
  "OperatorStr2": null,
  "OperatorCity": "Mechanicsburg",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17055",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Humphreys",
  "RMPTitle": "North Central Complex Manager",
  "FTE": 3,
  "OtherEPAFacilityID": "110000492235",
  "EPAFacilityID": "100000209847",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "4204100011",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-09-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-09-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-09-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-11-07 00:00:00",
  "DeRegistrationEffectiveDate": "2013-11-05 00:00:00",
  "AnniversaryDate": "2016-09-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014189,
      "AltID": "Butane Blending System",
      "FacilityID": 1000011763,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014529,
          "ProcessID": 1000014189,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016315,
          "ProcessID": 1000014189,
          "ChemicalID": 118,
          "Quantity": 250793.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000516315,
          "ProcessID": 1000014189,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011763,
      "SummaryText": "The Sunoco Logistics - Mechanicsburg Terminal complies with the National Fire Protection Association #58 (2008 Edition) for Liquefied Petroleum Gas Storage, and it is this Facility's policy to notify the Hampden Township Volunteer Fire Department and Cumberland County EMA via the \"911\" service in the event of an emergency, and follow all additional response procedures set forth in the Facility's Integrated Contingency Plan, as appropriate.  Medical emergencies will require notification of Holy Spirit Hospital and associated Hampden Township Volunteer Emergency Medical Services via 911.  The Facility currently maintains a trained incipient stage fire and emergency response team (First Responder - Operations Level) to respond to small or initial stages of an emergency.  The Sunoco Logistics - Mechanicsburg Terminal transfers/stores refined product (regular/premium gasoline and diesel fuel) and handles product additives, including the liquefied butane blending system (direct injection into refined product pipelines to the truck loading rack).  The Risk Management Program covers the butane blending system including the associated piping, 1 x 60,000 gallon vessel, the blending/fast loop/SRT skids, sampling and analyzer unit (Bartec-Benke), and the truck off-loading station product connection point.  The Facility's worst case scenario is the catastrophic failure of the blending system's 60,000 gallon liquefied (pressure) butane vessel when filled to the greatest amount allowed (fill shut-off device at 85% with an alarm at 80%) resulting in a vapor cloud explosion.  This is the recommended scenario based on the EPA Guidance Document and RMP Comp.  The Facility's alternate scenario (unlikely) resulting in a substantive release based on discussion with Texon and terminal personnel capable of off-site effects is a Boiling Liquid Expanding Vapor Explosion (BLEVE) resulting in an explosion and associated fireball.  Other alternatives considered included pump failure, liquid but"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011763,
      "SummaryText": "ane pipe failure, and a truck pull-away incident.  These scenarios were considered highly unlikely and did not result in an off-site impact.\n\nThe Sunoco Logistics - Mechanicsburg Terminal complies with the U.S. Environmental Protection Agency's Accident Prevention Rules (40 CFR Part 68) and the U.S. Department of Labor - Occupational Safety and Health Administration (OSHA) Process Safety Regulations (29 CFR Part 1910 .119).  The butane blending system is designed, constructed, and maintained to meet or exceed the NFPA #58 requirements for Liquefied Petroleum Gas Storage.  To this date, this Facility has never had an accident involving the butane blending system (new process) resulting in deaths, injuries, property/environmental damage, evacuations or sheltering-in-place.  In the event of an emergency involving the Mechanicsburg Terminal butane blending system, it is the policy of the Facility to initially contact the Hampden Township Volunteer Fire Department and request their assistance.  The Facility maintains a trained (annually) incipient fire and emergency response team, as referenced above.  The Facility's emergency response plans are coordinated with the Hampden Township Volunteer Fire Department and the Cumberland County EMA.  The Hampden Township Volunteer Fire Department also maintains a full hazardous material response team, is aware of the Facility's butane blending system access via Simpson Ferry Road and Sheely Lane, and sources (hydrants available adjacent to the Terminal).  Sunoco Logistics - Mechanicsburg Terminal maintains a vegetation control program to minimize plant growth within 10 feet of the system.\n"
    }
  ]
}