{
  "FacilityID": 1000061777,
  "FacilityName": "Kwik Trip, Inc. (DC East and West)",
  "FacilityStr1": "2025 Kwik Trip Way",
  "FacilityStr2": null,
  "FacilityCity": "La Crosse",
  "FacilityState": "WI",
  "FacilityZipCode": "54603",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55063",
  "LEPC": "La Crosse County LEPC",
  "FacilityLatDecDegs": "43.853814",
  "FacilityLongDecDegs": "-091.226006",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AV",
  "FacilityURL": "www.kwiktrip.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Kwik Trip, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 59039339,
  "Company2DUNS": 0,
  "OperatorName": "Kwik Trip, Inc",
  "OperatorStr1": "1626 Oak Street",
  "OperatorStr2": "P.O. Box 2107",
  "OperatorCity": "La Crosse",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "54602",
  "OperatorZipCodeExt": "2107",
  "RMPContact": "John Frie",
  "RMPTitle": "Production Ops Maintenance Mngr",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000202078",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-05-17 00:00:00",
  "SafetyInspectionBy": "Traveler's Insurance Company Inspection",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-11-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-11-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-11-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-11-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000077345,
      "AltID": "NH3 Ammonia System",
      "FacilityID": 1000061777,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000078528,
          "ProcessID": 1000077345,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        },
        {
          "Process_NAICS_ID": 1000078529,
          "ProcessID": 1000077345,
          "NAICSCode": "312113",
          "_desc": {
            "NAICS_CODE": "312113",
            "NAICS_DESCRIPTION": "Ice Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096032,
          "ProcessID": 1000077345,
          "ChemicalID": 56,
          "Quantity": 36621.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000596032,
          "ProcessID": 1000077345,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061777,
      "SummaryText": "Kwik Trip, Inc. maintains several ammonia refrigeration facilities and systems in La Crosse, Wisconsin.  This Executive Summary only applies to the Kwik Trip Distribution Center (DC) East and West systems.  Each of these systems is a separate closed loop ammonia refrigeration system; however, due to proximity of roof piping, the systems were considered to be one single system for Risk Management Plan submittal purposes.\n\n\n\nThis Executive Summary briefly describes the following elements:\n\n\n\nThe accidental release prevention and emergency response policies at the stationary source.\n\nThe stationary source and regulated substances handled.\n\nThe worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\n\nThe general accidental release prevention program and chemical-specific prevention steps.\n\nThe five-year accident history.\n\nThe emergency response program.\n\nPlanned changes to improve safety.\n\n2012 Major Facility Expansion Information\n\n\n\n1. The accidental release prevention and emergency response policies at the stationary source\n\n\n\nTo address concerns of an accidental release, prevention and emergency response, all plant and field personnel are trained in ammonia emergency response procedures and use of appropriate protective equipment. Refresher training and emergency response drills are conducted on a periodic basis to ensure personnel are equipped, trained, prepared, and practiced in responding to ammonia emergencies.\n\n\n\nAs a result of information gathered during preparation of this Risk Management Program, Kwik Trip, Inc (DC East and West Systems) facility is committing additional resources to further increase employee awareness and equipment reliability and to establish operator training and preventive maintenance programs.\n\n\n\nAs a demonstration of the Kwik Trip, Inc (DC East and West Systems) facility's high degree of commitment to public safet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061777,
      "SummaryText": "y and service, Kwik Trip, Inc (DC East and West Systems) is taking action to decrease the risk of ammonia exposure to the public by implementing recommendations made during the Process Hazards Analysis and Off-site Consequence Analysis.\n\n\n\n2. The stationary source and regulated substances handled\n\n\n\nAnhydrous ammonia is used as a refrigerant in the Kwik Trip, Inc (DC East and West Systems) facility refrigeration system. The liquid is circulated as needed to the evaporators where heat is absorbed and removed from the medium. The anhydrous ammonia refrigeration system is a closed loop industrial refrigeration system. The ammonia is not used or mixed in any manner with other chemical processes.\n\n\n\n3. The \"Worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario \n\n\n\nA \"Worst-Case Scenario Offsite Consequence Analysis\" and an \"Alternative Scenario Offsite Consequence Analysis\" were performed identifying the public and environmental receptors within the toxic endpoint concentration radius of 200 ppm. The results are mitigated by the fact that all the vessels and the much of the piping are inside the Kwik Trip, Inc (DC East and West Systems) building. A variety of administrative controls and computerized controls are in place to shut the system down when operating parameters and limits are exceeded.\n\n\n\n4. The general accidental release prevention program and chemical-specific preventative steps The basic elements of the Program 3 Prevention program have been developed and are now in place. These include:\n\n\n\nProcess Safety Information\n\nProcess Hazard Analysis\n\nStandard Operating Procedures\n\nSafework Practices\n\nEmployee and Operator Training Programs\n\nMechanical Integrity Program\n\nManagement of Change Procedures\n\nPSM Compliance Audit Procedures\n\nIncident Investigation Procedures\n\nEmployee Participation Program\n\nHot Work Permit Procedures\n\nContractor Safe"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061777,
      "SummaryText": "ty Program\n\nEmergency Response Program\n\n\n\nAmmonia specific prevention steps include:\n\n\n\nAdministrative controls\n\nOperator Training\n\nComputerized controls\n\n\n\nThe Preventive Program 3 provides extensive maintenance and operator/mechanic training to ensure that the system's mechanical integrity is maintained for the life of the covered process. Program 3 also incorporates administrative controls when modifications are made to the covered process (ammonia refrigeration system), so the training and preventative programs are updated as the system expands and changes.\n\n\n\n5. The five-year accident history\n\n\n\nA five-year accident history has not been prepared and included in the RMP since there have been no reportable incidents within the last 5 years. To prevent and/or minimize any potential future release of anhydrous ammonia, Kwik Trip, Inc (DC East and West Systems) is implementing a detailed Process Safety Management program (Preventive Program 3).\n\n\n\n6. The emergency response program\n\n\n\nEmergency response is discussed in Section 5 of the RMP. Kwik Trip, Inc (DC East and West Systems) has a detailed Emergency Response Plan (ERP) for their facility. The purpose of this plan is to provide the means for rapidly determining the appropriate response for any emergency that may develop at the facility such as an accidental release of anhydrous ammonia. Kwik Trip, Inc (DC East and West Systems) conducts scheduled drills of the emergency response plan. The Emergency Response Program is written, includes specific actions to be taken in response to an accidental release, includes procedures for informing the public and local agencies responsible for responding to an accidental release, and includes information on emergency health care.\n\n\n\n7. Planned changes to improve safety\n\n\n\nKwik Trip, Inc (DC East and West Systems) is incorporating and addressing any recommendations resulting from the Process Hazard Analysis, Offsite Consequences, and program audits. The flexibility of the pro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000061777,
      "SummaryText": "gram allows Kwik Trip, Inc (DC East and West Systems) to respond effectively to prevent or minimize any potential exposure of Kwik Trip, Inc (DC East and West Systems) employees, the surrounding public, and/or the environment to a release of anhydrous ammonia. Specific actions taken to improve safety are the implementation of the Program 3 Prevention Program described above, improved operator training, administrative controls, and computerized system controls.\n\n\n\n8. 2012 Major Facility Expansion Information\n\n\n\nKwik Trip, Inc (DC East and West Systems) initiated a major facility expansion involving this Distribution/Ice facility.  This expansion involved the building of a second independent ammonia refrigeration system.  While this system is a second closed loop ammonia refrigeration system and completely independent of the original system, the two systems share the same roof line.  In some roof locations, these two systems' piping are in proximity that could allow both systems to fail simultaneously (roof collapse, air crash, major fire, etc).  For this reason, the new system was included with the 'old' system and not identified as a separate facility for the purposes of reporting.  Documentation of the equipment in the 'new' system was included as a Management of Change with the 'old' system.\n\n\n\nHistorical Notes:\n\n\n\n11/22/2017 - For the 2017 RMPlan resubmittal, several changes were made.  Among these were:\n\n\n\n1 - Previous submittal amount was only for DC West Plant and need to include charge for East plant\n\n2 - Previous offsite consequence analyses used mitigated releases.  This was determined to be inaccurate.  2017 used no mitigation.\n\n3 - 2017 Offsite consequence analysis valued inserted into RMPlan used DC West values based on results of OCA\n\n"
    }
  ]
}