{
  "FacilityID": 1000030257,
  "FacilityName": "Sunoco Partners Mktg. and Terminal LP Montello, PA",
  "FacilityStr1": "515 Fritztown Road",
  "FacilityStr2": null,
  "FacilityCity": "Sinking Spring",
  "FacilityState": "PA",
  "FacilityZipCode": "19608",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42011",
  "LEPC": "Berks County LEPC",
  "FacilityLatDecDegs": "40.316585",
  "FacilityLongDecDegs": "-76.032548",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sunocologistics.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 622910032,
  "ParentCompanyName": "Sunoco Partners Mktg. and Terminal LP Montello, PA",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Sunoco Partners Montello Terminal",
  "OperatorStr1": "515 Fritztown Road",
  "OperatorStr2": null,
  "OperatorCity": "Sinking Spring",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19608",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": "PAD000619924",
  "EPAFacilityID": "100000219186",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0605064",
  "SafetyInspectionDate": "2012-09-07 00:00:00",
  "SafetyInspectionBy": "PA DOLI",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-09-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-09-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-09-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-09-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036886,
      "AltID": null,
      "FacilityID": 1000030257,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044511,
          "ProcessID": 1000036886,
          "ChemicalID": 118,
          "Quantity": 251444.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000037248,
          "ProcessID": 1000036886,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000032278,
              "Process_NAICS_ID": 1000037248,
              "SafetyReviewDate": "2012-08-30 00:00:00",
              "PHA_Date": "2012-01-12 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-10-16 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Hydrocarbon detector (pump area, vessel area, blending skid), flow monitor along with temperature, pressure and liquid level indicators.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Vessel",
              "OpProceduresReviewDate": "2012-09-05 00:00:00",
              "TrainingReviewDate": "2011-11-30 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-08-06 00:00:00",
              "EquipmentInspectionDate": "2012-08-30 00:00:00",
              "EquipmentTested": "All operational components including ESDs and alarms",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2012-07-19 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-08-30 00:00:00",
              "HotWorkPermitReviewDate": "2011-02-18 00:00:00",
              "ContractorSafetyReviewDate": "2011-05-01 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Butane Blending System consisting of one (1) 60,000 gallon vessel plus lines.  Butane, liquefied under pressure is blended with refined product (gasoline) via lines feeding a truck loading rack.  Butane is delivered via truck.  Blending occurs during the \"cold\" season, September 16 - April 30.  The system design meets or exceeds NFPA #58 (LP gas).",
              "_chemicals": [
                {
                  "PrimaryKey": 1000038343,
                  "PreventionProgram3ID": 1000032278,
                  "ProcessChemicalID": 1000044511
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000030257,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2011-02-08 00:00:00",
    "ERTrainingDate": "2012-08-30 00:00:00",
    "CoordinatingAgencyName": "Western Berks Fire Department",
    "CoordinatingAgencyPhone": "6106781332",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030257,
      "SummaryText": "Sunoco Partners Marketing & Terminals LP\n\nMontello Terminal\n\nRMP EXECUTIVE SUMMARY\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES\n\n\n\nSunoco Logistics - Montello Terminal is a refined petroleum product distributor. The Montello Terminal is an onshore, light products, bulk petroleum storage terminal used in the storage and distribution of petroleum products to retail and commercial end-users in the vicinity of Sinking Spring, PA. The Terminal handles and stores various grades of unleaded gasoline, low-sulfur diesel, No. 2 fuel oil, butane, ethanol, and various other petroleum based additives.\n\n\n\nAt Sunoco Partners Marketing & Terminals LP- Montello Terminal in Sinking Spring, PA, hereafter referred to as the Montello Terminal, we are committed to operating and maintaining our processes in a safe, reliable and environmentally sound manner. We believe that excellent performance in health, safety, and the environment goes hand in hand with operating reliably, and that outstanding HES performance is of paramount importance.\n\n\n\nThe Montello Terminal is designed, operated and maintained in a manner that protects the environment, as well as the health and safety of our employees, contractors and the community in which we operate. We promote health, safety, and the environment through programs of awareness, compliance, prevention and protection. These programs include a combination of accidental release prevention and emergency response planning. This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n\n\nA. A description of our facility and the use of regulated substances\n\nB. An overview of our accidental release prevention programs\n\nC. A five-year accident history for accidental releases of regulated chemicals\n\nD. An overview of our emergency response program\n\nE. An overview of planned changes to improve safety\n\n\n\nA. STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe primary fun"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030257,
      "SummaryText": "ction of the Montello Terminal, located in Sinking Spring, Pennsylvania is to act as a refined petroleum distribution facility. The butane blending process has been classified as Program level 3. No Program 1 or 2 processes containing regulated substances were identified. By virtue of the flammable effects associated with butane, it is necessary to observe certain safety precautions in handling butane to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community. Sunoco Partners Marketing & Terminals LP- Montello Terminal is strongly committed to employee, public, and environmental safety and health. Safety at the Facility depends upon the manner in which butane is handled as well as the various safety devices incorporated into the design of the process. Furthermore, comprehensive training is provided to employees, which reinforces the safety policies and procedures of the Montello Terminal.\n\n\n\nThe facility has fixed inventories of butane. Butane is received by truck (transports) and stored in one (1) 60,000-gallon storage vessel. Specifically, liquefied butane is off-loaded by truck for storage under pressure (pressure reliefs set at 250 psi on the storage vessel). The butane is pumped to a blending skid for direct injection into regular and premium unleaded gasoline lines feeding the site gasoline truck-loading rack.  Injection quantities are controlled via the blending skid and Bartec-Benke Analyzer. Process safety controls include excess flow valves, low-melting point (<250oF) feeds to pneumatic valves (fail closed), 85% fill shutoff (80% alarm) on the vessel, emergency shut-off devices on the system and video display terminal, line thermal (pressure) reliefs, and grounding/interlock devices. Access to the Montello Terminal is restricted to authorized employees, management personnel, authorized contractors/visitors and tenants.\n\n\n\nB. GENERAL ACCIDENTAL RELEASE PREVENTION P"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000030257,
      "SummaryText": "ROGRAM AND CHEMICAL-SPECIFIC PREVENTION MEASURES\n\n\n\nOur accidental release prevention programs and emergency planning and response programs help us effectively manage the hazards posed by our regulated substances to our employees, the public, and the environment. The covered process is regulated by the EPA RMP regulation 40 CFR Part 68, as well as the OSHA Process Safety Management standard 29CFR 1910.119. The following accident prevention program elements are in place at the Montello Terminal:\n\n\n\n1) Employee Participation\n\n2) Process Safety Information\n\n3) Process Hazard Analysis (PHA) with Risk Assessments\n\n4) Standard Operating Procedures\n\n5) EHS Operator Training\n\n6) Contractors\n\n7) Pre-startup Safety Review\n\n8) Mechanical Integrity with Preventive Maintenance\n\n9) Work Permits\n\n10) Management of Change\n\n11) EHS Accident or Potential Catastrophic Event Investigation\n\n12) Emergency Response\n\n13) Compliance Audits\n\n14) Trade Secrets\n\n\n\nThese fourteen (14) individual elements of our prevention program work together to prevent accidental chemical releases. Our company and our employees are committed to the standards required by these management programs. In addition to the above elements, we also have specific prevention measures that are employed as part of our operating procedures and engineering and administrative controls to help contain/control a release, quickly detect a release, and reduce the consequences of a release. These are briefly summarized as follows:\n\n\n\nGeneral Risk Reduction and Safety Measures\n\n\n\n-Engineering and construction in accordance with recognized industry and company standards\n\n-Equipment properly designed with protection from overpressure (pressure safety relief valves, etc.)\n\n-Updated technical drawings, Piping & Instrument Diagrams and Process Flow Diagrams\n\n-Operating systems monitored and controlled by trained Operators\n\n-Computerized monitoring and control of process operation\n\n-Redundant control systems with battery back-ups\n\n-Autom"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000030257,
      "SummaryText": "atic and manual shutdown devices for critical systems\n\n-Scheduled inspection and testing of instruments, analyzers, and safety devices\n\n-Vehicular traffic prohibited from critical areas\n\n-Limited facility access\n\n-Regular safety meetings and safety awareness programs\n\n-Routinely scheduled safety inspections and audits\n\n-Radio communication system\n\n-Frequent unit surveillance by operators\n\n\n\nGeneral Release Mitigation\n\n\n\n-Automatic and remotely operated shut-offs to limit release quantity\n\n-Strategically located valves to isolate leaks\n\n-Hydrocarbon detectors at key areas to warn of a chemical release\n\n\n\nGeneral Emergency Response\n\n-Emergency alert system\n\n-Periodic emergency training for employees\n\n-Communication systems with local emergency responders and regulatory agencies\n\n-Emergency drills with plant personnel, regulatory agencies, and community emergency responders to enhance response skills and coordination among agencies\n\n-Mutual Aid with Local Fire Departments\n\n-Participation with the Local Emergency Planning Committee (LEPC)\n\n\n\nFurther, the Montello Terminal complies with the National Fire Protection Association's (NFPA's) Liquefied Petroleum Gas (LPG) Code (NFPA-58 [2011]) requirements for LP Gas storage.  In addition to the presence of appropriate controls to prevent possible releases of butane, if a release does occur, an Integrated Contingency Plan (ICP) is in place for the Facility and response activities are coordinated with the Western Berks and Township of Spring Fire Departments and Berks County LEPC.\n\n\n\nC. FIVE YEAR ACCIDENT HISTORY\n\n\n\nThe Montello Terminal has an excellent record of accident prevention. The terminal keeps records for all significant accidental chemical releases that occur at our facility. This is a \"new\" butane blending process; consequently, there have been no accidents within the past five (5) years resulting from the chemical release of materials covered under the EPA RMP regulation.\n\n\n\nD. EMERGENCY RESPONSE PROGRAM\n\n\n\nRespon"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000030257,
      "SummaryText": "se actions are coordinated with the Western Berks and Township of Spring Fire Departments . A Facility Response Plan (FRP) is in place to inform employees what to do in case of a release, fire, and to notify emergency responders when there is a need for a response.\n\n\n\nThe Terminal maintains compliance with local, state and federal regulations including OSHA CFR 1910.120, and Sara Title III. The programs are reviewed and updated on an annual basis, or more often if required. Our Discharge Prevention, Containment and Countermeasure Plan (DPCC) and Facility Response Plan (FRP) provide the essential planning and training for protecting employees, the public, and the environment during emergency situations. Contained in these Plans are written procedures that outline the actions to be taken for various types of emergencies that could occur at the terminal. These emergencies include: airborne releases of chemical substances, spills to the water or ground, fires, explosions. The Programs address all aspects of emergency response including:\n\n\n\n- Roles and responsibilities of personnel responding to the incident\n\n- Procedures for notifying employees that a release has occurred\n\n- Procedures for terminal evacuation and accounting of personnel\n\n- Procedures to notify local emergency response organizations and other appropriate authorities that a release has occurred\n\n- Guidance on proper first aid treatment\n\n- Procedures for post incident cleanup and decontamination\n\n\n\nThe terminal also maintains its own dedicated emergency response equipment. This equipment includes portable fire extinguishers, flame retardant clothing and first aid equipment. An inspection, testing and maintenance program is in place for emergency response equipment. Fire extinguishers are inspected monthly and receive annual maintenance per the international fire code. Inspection reports for emergency response equipment are filed onsite.\n\n\n\nIn the event of an emergency involving the Montello Terminal butane"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000030257,
      "SummaryText": " blending system, it is the policy of the Facility to initially contact the Western Berks Fire Department and request their assistance. The Facility maintains a trained (annually) incipient fire capability. The Facility's emergency response plans are coordinated with the Western Berks Fire Department and LEPC. The Berks County Department of Emergency Services also maintains a  full hazardous material response team, is aware of the Facility's butane blending system access and sources. Sunoco Logistics-Montello Terminal maintains a vegetation control program to minimize plant growth within 10 feet of the system.\n\n\n\nWe also maintain a relationship with the Western Berks and Township of Spring Fire Departments. Tours and drills with members of local emergency response organizations are held routinely. These tours and drills enable the public emergency responders to become familiar with the hazards, equipment, resources and personnel in the\n\nterminal.\n\n\n\nE. PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nWe are continually striving to make the Sunoco Logistics-Montello Terminal the safest and most reliable workplace possible for our employees, our neighbors and our community. The facility's focus is \"Nobody Gets Hurt\".\n\n\n\nThe goal of the Sunoco Logistics- Montello Terminal is to demonstrate continuous improvement in our health, environmental and safety performance. In addition, we will work cooperatively with the community to address any concerns. Should there be any question or comments on the contents of our Risk Management Plan, please contact Terry Wolfe, Terminal Manager at 717-766-2526.\n\n"
    }
  ]
}