{
  "FacilityID": 1000087462,
  "FacilityName": "Metcalf Energy Center, LLC",
  "FacilityStr1": "1 Blanchard Road",
  "FacilityStr2": null,
  "FacilityCity": "San Jose",
  "FacilityState": "CA",
  "FacilityZipCode": "95013",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06085",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "37.220648",
  "FacilityLongDecDegs": "-121.745880",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.calpine.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 170414630,
  "ParentCompanyName": "Calpine Corporation",
  "Company2Name": null,
  "CompanyDUNS": 112710876,
  "Company2DUNS": 112710876,
  "OperatorName": "Metcalf Energy Center, LLC",
  "OperatorStr1": "1 Blanchard Road",
  "OperatorStr2": null,
  "OperatorCity": "San Jose",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95013",
  "OperatorZipCodeExt": null,
  "FTE": 19,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190615",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "B2183",
  "SafetyInspectionDate": "2019-02-13 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-05-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-05-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-05-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-05-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000109056,
      "AltID": "SCR System",
      "FacilityID": 1000087462,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000136251,
          "ProcessID": 1000109056,
          "ChemicalID": 57,
          "Quantity": 95753.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000110342,
          "ProcessID": 1000109056,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000068112,
              "Process_NAICS_ID": 1000110342,
              "SafetyReviewDate": "2019-12-26 00:00:00",
              "FR_NFPA58": 1,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": "NEMA",
              "FR_Comments": null,
              "HazardReviewDate": "2019-12-10 00:00:00",
              "ChangeCompletionDate": "2020-04-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Secondary Containment",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-02-16 00:00:00",
              "TrainingReviewDate": "2016-09-23 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-09-02 00:00:00",
              "EquipmentInspectionDate": "2020-03-10 00:00:00",
              "EquipmentTested": "ammonia system",
              "ComplianceAuditDate": "2019-12-11 00:00:00",
              "AuditCompletionDate": "2020-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2010-01-17 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000068880,
                  "PreventionProgram2ID": 1000068112,
                  "ProcessChemicalID": 1000136251
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000087462,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-09-11 00:00:00",
    "ERTrainingDate": "2019-09-17 00:00:00",
    "CoordinatingAgencyName": "San Jose Fire Department",
    "CoordinatingAgencyPhone": "4082774444",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000087462,
      "SummaryText": "Executive Summary for Metcalf Energy Center, LLC\n\n\n\nThis document represents the Risk Management Plan (RMP) for the Metcalf Energy Center, LLC (MEC) located in San Jose, California. This document has been prepared in order to address the following issues:\n\n\n\nMEC uses aqueous ammonia at a concentration of approximately 28% (by wt) and stores greater than 20,000 lbs making the site subject to both the California Accidental Release Program (CalARP) and the Federal RMP Program under 40 CFR 68. The site is not subject to either the OSHA or EPA Process Safety Management Regulations. The site has been determined to be a Program Level 2 facility.\n\nThe RMP addresses the Program 2 requirements of CalARP as adopted by the State of California as outlined in California Code of Regulations (CCR), Title 19. These requirements build upon the provisions of the general duty clause of the Clean Air Act Amendments of 1990, and the federal RMP Program 2 requirements in 40 Code of Federal Regulations (CFR) 68, which require the following activities of all facilities which produce, process, store, or handle listed substances:\n\n* identify hazards\n\n* design and maintain a safe facility\n\n* prevent releases\n\n* minimize the consequences of releases.\n\n\n\nThe required approach to accomplishing the above, pursuant to the CalARP and Federal RMP regulations, is to have a documented RMP, which outlines the steps and procedures a facility will take to prevent and mitigate accidental releases. \n\n\n\nPursuant to CCR Title 19, Section 2745.3, the following summary is given:\n\nThis RMP applies to the MEC facility located at:\n\n1 Blanchard Rd.\n\nSan Jose, CA. 95013\n\nUTM: N 4119623m, E 611409m\n\n\n\nFacility Description and Regulated Substances\n\nThe Metcalf Energy Center (MEC) is a 600-megawatt (MW) (nominal output) natural-gas-fired combined cycle power plant, with a 230-kilovolt (kV) switchyard feed into a PG&E switchyard and approximately 200 feet of 230-kV transmission line. A transmission interconnection loops"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000087462,
      "SummaryText": " into the PG&E 230-kV Metcalf-Monta Vista No. 4 transmission line that passes near the northern boundary of the MEC site. No new transmission towers were required. Natural gas for the facility is delivered via approximately one mile of 16-inch pipeline that is connected to the PG&E transmission backbone pipeline that runs along the eastern side of U.S. 101. Recycled water for cooling is supplied by the South Bay Water Recycling Program (SBWR) and is delivered from a tap into SBWR's main pipeline in eastern San Jose via a 20inch, 7.3-mile pipeline. Industrial wastewater and sanitary sewer from the plant is transported from the plant via a 12inch (maximum) forced main installed in the same trench as the recycled water pipeline and connected to San Jose's sewer system downstream of any system constraints. Process makeup water and domestic water is supplied from the city's municipal water system (San Jose MUNI) via a 1.25-mile pipeline or from onsite wells. This supply will also serve as a backup water supply for plant cooling. \n\n\n\nThe site is located just west of Monterey Road, between Metcalf Road to the north and Bailey Road to the south.\n\n\n\nSubstance Used/Stored:    Aqueous Ammonia (conc 20% or greater)(CAS# 7664-41-7)\n\n                Ammonium Hydroxide, 15000 gallon tank\n\n\n\nFacility SIC Code: 4911    Facility NAICS Code: 221112\n\n\n\nThe accidental release prevention and emergency action policies at the facility are delineated in Sections 4.0 and 14.0 respectively. A brief description of the prevention and emergency action policies is as follows.\n\nAccident Prevention Program Policies and Elements.\n\n\n\nThe accident prevention program is implemented through an established set of policies and programs including, but not limited to, the following:\n\n\n\n* Inspection and maintenance program for all system equipment.\n\n* Monitoring of employee and contractor use of the system.\n\n* Contractor Safety Program\n\n* Emergency Action  Plan\n\n* Lockout/Tagout Procedures and Program\n\n* Hot Work Permit Pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000087462,
      "SummaryText": "gram\n\n* Confined Space Entry Program\n\n* Employee Safety Training Program\n\n* Compilation of substance information (SDS)\n\n* Incident investigation procedures\n\n* Periodic compliance audits.\n\n* Compliance with all applicable laws, ordinances, and regulations.\n\n\n\nIntegral parts of the prevention program are the following plans:\n\nHazardous Materials Business Plan, Injury and Illness Prevention Plan, Spill Containment Control and Countermeasure Plan, Hazardous Waste Storage and Handling Procedures, Hazard Communication Program, Fire Protection and Prevention Procedures, Hearing Conservation Program, Respiratory Conservation Program, Electrical Safety Program, Proposition 65 Compliance Program, Forklift and Industrial Truck Program, Welding, Cutting, and Brazing Safety Program.\n\nThese plans are kept on site, for inspection during normal business hours.\n\n\n\nEmergency Action Policies and Elements\n\nThe emergency action program is implemented through an established set of policies and programs including, but not limited to, the following:\n\n* Establishment of criteria defining an emergency\n\n* Staff training and responsibility assignments\n\n* Emergency notification procedures (on and off-site)\n\n* Evacuation procedures\n\n* Written emergency action  procedures\n\n* Coordination of emergency action with local authorities\n\n* Incident investigation and follow-up procedures\n\n\n\nThe general accidental release prevention program is comprised of the following elements:\n\n* Proper maintenance of all system equipment.\n\n* Proper operation of all system equipment.\n\n* Internal operating policies with respect to ammonia tank capacity.\n\n* Comprehensive personnel training.\n\n* A written emergency action plan.\n\n* A written hazardous materials management plan.\n\n* Documented safety procedures for employees and contractors.\n\n* Inclusion of ammonia specific health, safety, and response data in the RMP.\n\n\n\nThe project has never experienced an accidental release of ammonia or any other hazardous substance in th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000087462,
      "SummaryText": "e last 5 years.\n\nThe emergency action plan and procedures (EAP) for MEC are similar in scope and detail to the EAP for similar Calpine power generation facilities (See section 14.0 and Appendix H). The Santa Clara County and/or City of San Jose Fire Departments will be the first responders in an ammonia emergency. MEC personnel will perform \"awareness\" duties only, which simply means that once the ammonia spill or release is discovered, MEC personnel will make the proper notifications and set the emergency procedures in motion. The fire departments will handle spill/release response and mitigation. In the event of a major release, MEC may join forces with the fire departments and State/County OES personnel in a \"unified command effort\" until the emergency has been mitigated.\n\n\n\nChemical Specific Prevention Elements\n\nChemical specific prevention measures are summarized as follows:\n\n* Periodic inspection of ammonia tank, containment area, pumps, piping network, flow controllers, and injection grid.\n\n* Monitoring of tank and system pressures and temperatures.\n\n* Monitoring of unloading/delivery procedures.\n\n* Installation and use of ammonia detector(s) in the main tank area.\n\n* Installation and use of closed circuit cameras to view the ammonia storage area.\n\n* Provide all required safety and response equipment.\n\n* Provide a chemical specific training program.\n\n* Access to the MEC facility site is controlled and fenced.\n\n\n\nThe piping and distribution network is equipped with a number of manual and automatic valves, which effectively limit the amount and duration of any accidental release. System pressures and flow rates will be monitored at the main plant control room console.  All liquid (aqueous ammonia) carrying piping is dual contained. Review of the P&IDs (Appendix C) indicates that there are numerous pressure, temperature, and level indicator sensors, which will be reported directly to the distributed control system (DCS) for operator confirmation and action.\n\n\n\nP"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000087462,
      "SummaryText": "lanned Changes to Improve Safety\n\nPresently, Calpine is operating and constructing a number of similar peaking and base loaded power generation facilities in California. Data developed from the operational experience at these facilities will be directly applied to the operation and safety aspects of the MEC facility. Operational and safety issues identified at any Calpine facility are immediately analyzed for applicability to other operational sites. Additionally, the following will be used to identify and track safety improvements at MEC.\n\n\n\n* Completion of the initial PHA on January 10, 2005 for the MEC facility\n\n* Required periodic updating of the PHA per the CalARP regulations\n\n* Implementation and revision to safety and training procedures\n\n* Completion of the seismic \"walk-down\" inspection\n\n* Completion of the CBO's inspection of construction, i.e.,ascertain compliance with applicable building and seismic codes\n\n\n\nThe facility will constantly strive for improved performance and reliability from all its processes. As specific process and safety improvements are identified they will be evaluated by staff for application and implementation.\n\n\n\nTraining\n\nThe facility staff, as well as Calpine corporate staff, understands that incidents involving the accidental release of listed substances can be reduced and/or eliminated by having trained operations and maintenance staff. A training program, which incorporates specific operating procedures and safe work practices, is an essential element of an effective prevention program.\n\nThe training program is comprised of the following:\n\n* Initial employee training\n\n* Periodic re-training and certification\n\n* Training provided as a result of a new equipment addition or modification \n\n* Refresher training\n\n* Training records for each employee\n\n\n\nMaintenance\n\n\n\nThe maintenance element of the plant operations procedures ensures that new and modified equipment or processes are manufactured to meet process requirements, that they "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000087462,
      "SummaryText": "are installed correctly, and subsequently maintained in safe operating condition. \n\n\n\nThe facility's maintenance system is contained within the plant's computerized maintenance management system (CMMS) known as MAXIMO and applicable maintenance manuals. The system manuals delineate such practices as:\n\n* Equipment or process inspection techniques and frequency\n\n* Preventative maintenance schedules\n\n* Maintenance requirements and procedures\n\n* History of maintenance\n\n* Process identification, model numbers, and serial numbers\n\n* Maintenance logs (who performed the maintenance, and information on the maintenance activity, etc.)\n\n\n\nMAXIMO contains such records as:\n\n* Written maintenance, testing, and inspection procedures and schedules.\n\n* Maintenance training.\n\n* Maintenance documentation.\n\n* Deficiency correction procedures and documentation.\n\n\n\nPre-Startup Review\n\n\n\nThe pre-startup review program is not required to be documented in the RMP for Program 2 facilities. \n\n\n\nCompliance Audits\n\n\n\nAn essential element of the RMP program is the use of periodic compliance audits to assess the effectiveness of the written plan. Compliance audits under the federal and state RMP regulations must be conducted, at a minimum of once every three years. The periodic compliance audit addresses the following:\n\n* Implementation and comprehension of the current plan elements.\n\n* Are plan revisions required.\n\n* Does the plan adequately address all required RMP elements.\n\n* Effectiveness of the current plan.\n\n* Level of employee involvement.\n\n* Management commitment to plan provisions.\n\nThe audit team is typically comprised of people knowledgeable of the process. The results of the compliance audit are communicated to all staff levels subsequent to completion of the audit.\n\n\n\nIncident Investigation\n\nThorough investigation of \"incidents\" (any occurrence that results in or could result in catastrophic releases of aqueous ammonia) or \"near misses\" (any situation where conditions existed under "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000087462,
      "SummaryText": "which an incident could have occurred, but did not) is another essential element of the RMP program. Incident investigations typically yield perspectives on equipment or process safety that are not normally apparent to plant operations and maintenance staff, such as:\n\n* Incident causes outside of the PHA scope.\n\n* Was the facility response appropriate?\n\n* Did the EAP function as designed?\n\n* Did the EAP and RMP provide the necessary level of protection with respect to the offsite impacts?\n\n* What changes need to be made to the RMP and EAP to ensure an appropriate response in the future?\n\n\n\nIncident investigations pursuant to this RMP will be specific to the aqueous ammonia process system. The following data is typically gathered by the incident investigation team subsequent to the incident:\n\n* Date and time of the \"incident\" or \"near miss\"\n\n* Timeliness of incident report to the responding agency\n\n* Timeliness of public awareness and/or evacuation measures\n\n* Description of the \"incident\" or \"near miss\"\n\n* An evaluation of the events that resulted in the \"incident\" or \"near miss\"\n\n* Recommendations to prevent future occurrences of the incident\n\nThe incident investigation policy is delineated in the safety procedures. The investigation results, including the implementation of all recommendations, will be reviewed with facility staff whose job responsibilities are relevant to the findings. Copies of the investigation reports will be maintained on site for a minimum of five years, and will be used during the periodic PHA re-evaluations.\n\n\n\nEmployee Participation\n\n\n\nThe employee participation program is not required to be documented in the RMP for Program 2 facilities. \n\n\n\nManagement of Change\n\n\n\nThe management of change program is not required to be documented in the RMP for Program 2 facilities. \n\n\n\nContractor and Hot Work Program\n\n\n\nThe contractor safety and hot work permit programs are not required to be documented in the RMP for Program 2 facilities.\n\n\n\n\n\n    \n\n\n\n"
    }
  ]
}