{
  "FacilityID": 1000046378,
  "FacilityName": "Markham Station",
  "FacilityStr1": "7397 FM 1468 North",
  "FacilityStr2": null,
  "FacilityCity": "Markham",
  "FacilityState": "TX",
  "FacilityZipCode": "77456",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48321",
  "LEPC": "Matagorda County LEPC",
  "FacilityLatDecDegs": "28.99527",
  "FacilityLongDecDegs": "-96.15939",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Enterprise G C, L.P.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Enterprise Products Operating, LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000214154",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-03-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-09-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-09-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-09-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 28.99527,
  "FRS_Long": -96.15939,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000057744,
      "AltID": "Tank Truck Loading",
      "FacilityID": 1000046378,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000070508,
          "ProcessID": 1000057744,
          "ChemicalID": 118,
          "Quantity": 69000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000058667,
          "ProcessID": 1000057744,
          "NAICSCode": "42471",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000046378,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Matagorda County Emerg. Mgmt. Coord",
    "CoordinatingAgencyPhone": "9793230707",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046378,
      "SummaryText": "Environmental Protection Agency Risk Management Plan\r\nMarkham Station \r\nRMP Executive Summary\r\n\r\nEPA ID:  1000 0021 4154\r\n\r\nAt the Enterprise Markham Station we are committed to operating and maintaining our process in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public, as well as protection of the environment.\r\n\r\nMarkham Station is owned by Enterprise G C, L.P. and is operated by Enterprise Products Operating LLC. The Markham Station is a LPG pipeline terminal with two truck loading racks fed directly from a butane transmission pipeline.\r\n\r\nWe use a combination of accidental release prevention programs and emergency response planning programs to help provide for the safety of our employees and the public, as well as protection of the environment.  This document provides a brief overview of the risk management activities that we have designed and implemented, including:\r\n\r\n* A description of our facility and use of substances required by EPA's RMP regulation and the processes involved\r\n* A summary of results from our assessment of the potential offsite consequences from accodental chemical releases\r\n* Emergency Response Programs\r\n* General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n* A five-year accident history for accidental releases of chemicals at the Markham Station that are regulated by EPA's RMP rule.  \r\n\r\nFacility Description\r\n\r\nThe Markham Station engages in the pipeline receipt and delivery of butane under pressure.  The process is regulated by EPA 40 CFR Part 68.  We have registered the facility as an RMP Program Level 1 facility.\r\n\r\nThe facility receives and distributes butane LPG.  The facility consists of pressure regulation, flow control and flow metering equipment, a truck loading dock and associated piping, valves and other miscellaneous equipment.  The facility is a wholesa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046378,
      "SummaryText": "le product distribution terminal for butane LPG.    \r\n\r\nIn our process we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\r\n\r\nToxics\r\n\r\nThere are no toxic materials contained on site above the threshold limits.\r\n\r\nFlammables\r\n\r\nButane is the finished product that is received and routed to the loading docks for distribution. \r\n\r\nKey Offsite Consequence Analysis Scenarios\r\n\r\nThe EPA's RMP rule requires that we provide information about he worst-case scenario(s) and alterntive release scemario(s) for our facility.  The following are brief summaries of these scenarios, including information about the key andministrative controls and mitigation measures to limit the exposure distances for each senario.\r\n\r\nWorse Case Scenario - Regulated Flammable Chemicals\r\n\r\nThe Markham Station Risk Management Program registration includes information on a worst case scenario calculated according to the requirements of the RMP regulation.  The calculated release of flammable material was based upon the uncontrolled release from the delivery line at the loading docks.  This line has an installed choke to reduce the delivery pressure, and at the same time restrict the maximum flow, to the loading docks.   All emergency response and early warning procedures to inform employees and the community would be exercised immediately if this were to occur.  The quantity and endpoint of the simulation and the specifics of the simulation are available in the Risk Management Plan registration\r\n\r\nAlternate Case Scenario - Regulated Flammable Chemicals\r\n\r\nThe calculated endpoint of a 1.0-psi blast overpressure for the worst case scenario does not go offsite.  No alternate case scenario is required or reported.\r\n\r\nWorst Case Scenario - Regulated Toxic Chemicals\r\n\r\nAs stated earlier, there are no regulated toxic chemicals above the threshold quantity at Markham Station.  There is no wo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046378,
      "SummaryText": "rst case scenario to report.\r\n\r\nAlternate Case Scenario - Regulated Toxic Chemicals\r\n\r\nthere are no toxic chemicals on site at Markham Station.   There is no alternate case for toxic chemicals to report.\r\n\r\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nThe following is a summary of the accidental release prevention program in place at Markham Station.  the process at the facility is regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation as a Program 1 facility.  Release prevention is provided through the use of written opeating procedures, employee training in the written procedures, including normal operation and ememgency release procedures, and in the design of safety and release prevention equipment installed at the terminal site.  In addition, a written safety program designed to comply with all applicable OSHA safety performance regluations is strictly enforced at all Enterprise facilities, including markham Station.  As part of the Enterprise safety program, the station utilizes procedures that are included in the Enterprise program, but may not specifically be required at non-PSM and/or RMP Program 1 facilities (e.g. Safe work practice training, safe work permitting and hot work permitting.)\r\n\r\nThe engineering and administrative controls in place have been established to reduce the risk of an accidental release of identified hazards.  The controls have been installed to handle possible emergency situations that could arise from the handling of liquid petroleum gases (LPG) that are liquids under pressure, but which vaporize to a gaseous form upon release to the atmosphere.  Enterprise is committed to operations that are safe for employees and the surrounding community.\r\n\r\nEmergency Response Program\r\n\r\nEnterprise maintains an integrated contingency plan, which consolidates all of the various federal, state, and local regulatory requirements for emergency response planning and re"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046378,
      "SummaryText": "porting.  The program provides planning and training for effectively protecting workers, the public, and the environment during emergency situations.  The plan is coordinated with the Matagorda County LEPC and appropriate community emergency responders\r\n\r\nIn the event of an accidental release, local Enterprise personnel are trained to sound the alarm, shut off the source from a safe location and contact 9-1-1 and secure the area.  The 9-1-1 system is used to notify the local Police and Fire Departments.  \r\n\r\nAccident History\r\n\r\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\r\nBased on the criteria set forth in 40 CFR 68.10, this facility has not had an accidental release within the last five years..\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nThe following is a list of improvements that are planned for implementation at the facility to help prevent and/or better respond to accidental chemical releases:\r\n\r\n* There are no changes currently planned to improve safety at Markham Station."
    }
  ]
}