{
  "FacilityID": 1000003975,
  "FacilityName": "Carlisle Region Water Pollution Control Facility",
  "FacilityStr1": "54 North Middlesex Road",
  "FacilityStr2": null,
  "FacilityCity": "Carlisle",
  "FacilityState": "PA",
  "FacilityZipCode": "17013",
  "Facility4DigitZipExt": "1627",
  "FacilityCountyFIPS": "42041",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "40.237222",
  "FacilityLongDecDegs": "-077.146389",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "WR",
  "FacilityURL": "http://carlislepa.org",
  "FacilityEmailAddress": "jshearer@carlislepa.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Borough of Carlisle Sewer System Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Borough of Carlisle",
  "OperatorStr1": "53 West South Street",
  "OperatorStr2": null,
  "OperatorCity": "Carlisle",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17013",
  "OperatorZipCodeExt": "3447",
  "RMPContact": "Peter M. Selan",
  "RMPTitle": "Treatment Plants Manager",
  "FTE": 19,
  "OtherEPAFacilityID": "PA-0026077",
  "EPAFacilityID": "100000047647",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-20 00:00:00",
  "SafetyInspectionBy": "Insurance Inspector",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.23722,
  "FRS_Long": -77.14667,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000004878,
      "AltID": "5",
      "FacilityID": 1000003975,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000005064,
          "ProcessID": 1000004878,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000005520,
          "ProcessID": 1000004878,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000505520,
          "ProcessID": 1000004878,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000003975,
      "SummaryText": "The Borough of Carlisle Sewer Authority owns the Carlisle Regional Water Pollution Control Facility, which is operated by the Borough of Carlisle.  The facilityA?s service area is composed of five (5) contributing municipalities, including the Borough of Carlisle, Middlesex Township, North Middleton Township, South Middleton Township, and Silver Spring Township.  The wastewater treatment plant, located at 54 Middleton Road in Middlesex Township, processes up to 7.0 million gallons per day of wastewater and discharges to the Conodoguinet Creek under NPDES Permit No. PA0026077.   Wastewater treatment processes include grit and coarse screenings removal, primary sedimentation, secondary activated sludge treatment, clarification, filtration, and disinfection.  Solid material removed from this process is stabilized using post lime addition, dewatered, and utilized for agricultural purposes through land application.  The plant is operated 24 hours per day, 365 days per year.\n\nThe WWTP includes a disinfection system comprised of a chlorine scale room, which contains three (3) one ton containers of chlorine liquefied under pressure, a chlorinator room containing chlorinators, various safety equipment, and instrumentation consisting of automated chlorine and flow recorders, electrical panels, and a gas detector/alarm unit.  Up to three (3) one ton containers may be on site simultaneously.  The automated chlorinator system extracts chlorine gas from the storage containers through remote vacuum regulators and dissolves this gas in water to form a disinfection solution that is used to kill pathogenic bacteria and micro-organisms in the treated wastewater effluent prior to its discharge into the creek. Treatment plant operators regularly check the rooms and equipment, inventory the rate of chlorine use, and adjust the rate as necessary.  The maximum intended inventory of chlorine gas for planning purposes is 6,000 pounds.\n\nAtmospheric dispersion modeling was performed using the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000003975,
      "SummaryText": "RMP*Comp program distributed by the Chemical Emergency Preparedness and Prevention Office of the USEPA.  This model determined the distance traveled by the chlorine released until its concentration decreases to the A?toxic endpointA? of 0.0087 mg/L, as selected by USEPA.  The chlorine toxic endpoint of 0.0087 mg/L in air represents the American Industrial Hygiene Association (AIHA) Emergency Response Planning Guideline (ERPG)-2, defined as the A?maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.A?  This amount corresponds to 3.0 parts per million by volume.   \n\n \nThe Carlisle Region Water Pollution Control Facility's accidental release prevention program is based upon the following elements:\n\n1.    High level of training for the operators;\n\n2.    Preventative maintenance program for equipment;\n\n3.    Use of state of the art process and safety equipment;\n\n4.    Use of accurate and effective standard operating procedures, written with the participation of the operators;\n\n5.    Performance of a Hazard Review of the equipment and procedures; and\n\n6.    Implementation of an auditing and inspection program.\n\nChemical specific prevention steps include availability of self contained breathing apparatus (SCBA), awareness of the hazards and toxic properties of chlorine, and the presence of a chlorine gas detector.\n\nBased on available data, no accidental releases of chlorine have occurred at this facility in the past 5 years.\n\n    The facility has an emergency response program that has been reviewed and coordinated by the Cumberland County Local Emergency Planning Committee (LEPC) in Carlisle.  The operation and response procedures are reviewed and updated on an annual basis by the Cumberland County LEPC.  The Cumberland County Defensive Hazardous Materials (HAZMAT) Re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000003975,
      "SummaryText": "sponse Team is the designated first-responder in the event of a chlorine leak incident.  This HAZMAT team is state certified and undergoes extensive training in dealing with a variety of hazardous material incidents, including chlorine gas leaks.  \n\nRecommendations to improve safety were made following a May 5, 2009 inspection of the disinfection system by the Borough's Consulting Engineer.  These recommendations included improvements to written emergency standard operating procedures, development of an operator training program, and increased documentation of routine functions related to the performance of the two regulated processes.\n\n   "
    }
  ]
}