{
  "FacilityID": 1000091831,
  "FacilityName": "Lubrizol Advanced Materials, Inc.",
  "FacilityStr1": "4200 Bells Lane",
  "FacilityStr2": null,
  "FacilityCity": "Louisville",
  "FacilityState": "KY",
  "FacilityZipCode": "40211",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21111",
  "LEPC": "Jefferson County LEPC",
  "FacilityLatDecDegs": "38.221389",
  "FacilityLongDecDegs": "-085.828611",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 627773799,
  "ParentCompanyName": "The Lubrizol Corporation",
  "Company2Name": null,
  "CompanyDUNS": 4172565,
  "Company2DUNS": 0,
  "OperatorName": "Michael Brown",
  "OperatorStr1": "4200 Bells Lane",
  "OperatorStr2": null,
  "OperatorCity": "Louisville",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "40211",
  "OperatorZipCodeExt": null,
  "RMPContact": "Darren Kremer",
  "RMPTitle": "Health, Safety and Security Manager",
  "FTE": 135,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000117802",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "129-97-TV",
  "SafetyInspectionDate": "2020-08-11 00:00:00",
  "SafetyInspectionBy": "Air Pollution Control District - Title V Insp",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-02-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-02-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-02-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-02-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.22317,
  "FRS_Long": -85.82568,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114099,
      "AltID": "CPVC Resin Manufacturing",
      "FacilityID": 1000091831,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000115491,
          "ProcessID": 1000114099,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000142601,
          "ProcessID": 1000114099,
          "ChemicalID": 62,
          "Quantity": 3075000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000642601,
          "ProcessID": 1000114099,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000114100,
      "AltID": "Vinyl Latex",
      "FacilityID": 1000091831,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000115492,
          "ProcessID": 1000114100,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000142602,
          "ProcessID": 1000114100,
          "ChemicalID": 29,
          "Quantity": 282000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 29,
            "ChemicalName": "Vinyl acetate monomer  [Acetic acid ethenyl ester]",
            "CASNumber": "108-05-4",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000142603,
          "ProcessID": 1000114100,
          "ChemicalID": 110,
          "Quantity": 290000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 110,
            "ChemicalName": "Vinylidene chloride [Ethene, 1,1-dichloro-]",
            "CASNumber": "75-35-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000142604,
          "ProcessID": 1000114100,
          "ChemicalID": 101,
          "Quantity": 998000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 101,
            "ChemicalName": "Vinyl chloride  [Ethene, chloro-]",
            "CASNumber": "75-01-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000642602,
          "ProcessID": 1000114100,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000642603,
          "ProcessID": 1000114100,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000642604,
          "ProcessID": 1000114100,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091831,
      "SummaryText": "The Lubrizol plant in Louisville, Kentucky is a specialty chemical manufacturing facility located in the Rubbertown area. A portion of this plant, along with several in the vicinity, began operation in 1942 as a government-owned synthetic rubber facility. Thus, the name Rubbertown was established.\n\n\n\nFrom 1942 until February, 2001, the current Lubrizol facility was owned and operated by The BFGoodrich Company and from 2001 to 2004 by Noveon, Inc. In 2010 Lubrizol acquired an adjacent PVC manufacturer's plant once Oxy Vinyls ended all production on site.  Oxy Vinyls had supplied vinyl chloride monomer (VCM) to Lubrizol and the acquisition of the site allows for continued unloading and storage of VCM for processing in the latex unit.  Today, the facility operates as an integral part of Lubrizol Advanced Materials, a wholly owned subsidiary of The Lubrizol Corporation. Over 100 different products are produced at the Louisville facility. The latex unit supplies products consumed in paper coatings, automotive interiors, and non-woven cloth applications. The facility is the worlds largest producer of CPVC resins and compounds which are consumed in the manufacture of plumbing, fire sprinkler and industrial piping systems.\n\n\n\nThe plant utilizes four chemicals regulated under the EPA Risk Management program RMP Rule. These are vinyl chloride and vinylidene chloride, which are regulated as flammables, and chlorine and vinyl acetate, which are regulated as toxics. The systems required by the RMP to prevent serious accidents and to plan contingencies have long been in place at this facility. The relationship between excellent chemical safety programs and good business is well understood in the Lubrizol organization and is a core value in our operation. The RMP initiative provides us with an additional opportunity to expand our ongoing dialog with the community.\n\n\n\nThe Lubrizol Louisville facility is committed to conducting operations in a manner that protects the surrounding co"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091831,
      "SummaryText": "mmunity, the environment and our employees. We are fully compliant with applicable laws and regulations, the American Chemistry Council Responsible Care initiatives and Lubrizol Health, Safety and Environmental Policies.\n\n\n\nThe Lubrizol Louisville facility has a comprehensive program for process safety management, inclusive of both engineered and procedural/administrative systems to prevent releases of hazardous chemicals. These systems are consistent with and fully compliant with the elements established in OSHA's Process Safety Management Standard, 1910.119. Some highlights of the program include:\n\n\n\n1.    Employee Participation; Employees with various areas of expertise are involved in numerous activities to continuously improve plant safety systems and results. Key areas include safety committees, audits, pre-startup safety reviews, training, procedure development and safety meetings.\n\n2.      Process hazard analysis; Hazards associated with plant processes are analyzed. Recommendations are developed and implemented following evaluation. PHA's are updated a minimum of every 5 years.\n\n3.    Operating Procedures; Operating procedures have been developed for all plant processes to ensure safe operation. These are updated as required and are reviewed annually for correctness.\n\n4.    Employee Training; A training program has been established to train, test, and qualify employees involved in operating the chemical processes. The program includes plant-specifics, process-specifics and job specific training. All employees have completed this program and are re-qualified every 3 years.\n\n5.    Mechanical integrity; The plant follows a comprehensive mechanical integrity program for equipment in hazardous chemical service. Elements of this program include inspections and tests at prescribed frequencies and documentation thereof, development of maintenance procedures and training of maintenance personnel.\n\n6.    Pre-Startup Safety Reviews; Reviews are conducted of new processes, major proj"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000091831,
      "SummaryText": "ects and new chemicals to ensure safe transition into the operating mode.\n\n7.    Hot Work Permit; The plant follows a long-standing system to manage potential sources of ignition.\n\n8.    Management of Change; A system is in place to properly manage changes that are not replacement-in-kind.\n\n9.    Contractors; Contract companies are evaluated to ensure they have the appropriate job skills, knowledge training and certifications to perform work safely. All contract personnel must complete a Lubrizol Louisville-specific training course prior to entering the facility and annually thereafter.\n\n10.    Incident Investigation; All incidents or near-miss incidents involving the release of hazardous chemicals are investigated by a multi-functional team of plant personnel including those involved in operating the process. These reviews involve a critique of the incident and any related plant systems. Corrective actions are developed and tracked to completion. A report documenting these reviews is developed and circulated throughout this facility and to other Lubrizol locations.\n\n11.    Compliance Audits; Internal audits of our process safety management systems are conducted by Lubrizol personnel every 3 years. These audits review all systems and documentation thereof, verify process safety information and inspect the physical facilities. In addition, specific components of the PSM system are audited annually within the plant Focused Safety Audit program.\n\n\n\nThe RMP rule requires that each company include a 5 year history of all accidental releases of RMP-regulated chemicals that resulted in deaths, injuries, significant property damage on-site; off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage. The Lubrizol Louisville plant has had no events that meet the criteria.\n\n\n\nThe Lubrizol Louisville facility has an emergency response plan that is coordinated with the Jefferson County Local Emergency Planning Committee (LEPC), Pleasure Ridge Park Fire"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000091831,
      "SummaryText": " Department, the Rubbertown Mutual Aid Association, and other local response agencies. Plant personnel are trained annually on the plan and new employees are trained prior to working in process area. All operations personnel for the plant processes involving RMP-covered chemicals maintain 24-Hour Hazardous Material Technician certification to mitigate an accidental release.\n\n\n\nPersonal and process safety is integrated into every facet of plant operation. Improvement of these systems is an ongoing focus of each plant employee and is incorporated into such forums as incident investigations, process hazard analyses, capital project reviews and safety committees."
    }
  ]
}