{
  "FacilityID": 1000054940,
  "FacilityName": "Delta Energy Center",
  "FacilityStr1": "1200 Arcy Lane",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.018333",
  "FacilityLongDecDegs": "-121.846111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "AS",
  "FacilityURL": "www.calpine.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 130039378,
  "ParentCompanyName": "Delta Energy Center, LLC",
  "Company2Name": null,
  "CompanyDUNS": 112710876,
  "Company2DUNS": 0,
  "OperatorName": "Calpine Corporation",
  "OperatorStr1": "1200 Arcy Lane",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": null,
  "FTE": 25,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178247",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "B2095",
  "SafetyInspectionDate": "2020-05-07 00:00:00",
  "SafetyInspectionBy": "Contra Costa County Haz Mat",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-12-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 38.02528,
  "FRS_Long": -121.84944,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000068750,
      "AltID": "Anhydrous Ammonia for SCR",
      "FacilityID": 1000054940,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000084741,
          "ProcessID": 1000068750,
          "ChemicalID": 56,
          "Quantity": 72430.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000069892,
          "ProcessID": 1000068750,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000057416,
              "Process_NAICS_ID": 1000069892,
              "SafetyReviewDate": "2020-05-07 00:00:00",
              "PHA_Date": "2015-11-10 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-02-28 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Containment Area",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": "Revise/confirm procedures",
              "OpProceduresReviewDate": "2018-05-31 00:00:00",
              "TrainingReviewDate": "2018-01-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-12-30 00:00:00",
              "EquipmentInspectionDate": "2015-11-11 00:00:00",
              "EquipmentTested": "Ammonia System Inspection - Airgas Inc.",
              "ChangeMgmtDate": "2014-04-18 00:00:00",
              "ChangeMgmtReviewDate": "2015-11-16 00:00:00",
              "PreStartupReviewDate": "2012-06-03 00:00:00",
              "ComplianceAuditDate": "2018-05-25 00:00:00",
              "AuditCompletionDate": "2019-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-10-30 00:00:00",
              "HotWorkPermitReviewDate": "2015-10-30 00:00:00",
              "ContractorSafetyReviewDate": "2015-10-30 00:00:00",
              "ContractorSafetyEvalDate": "2015-12-31 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anhydrous Ammonia Process",
              "_chemicals": [
                {
                  "PrimaryKey": 1000070299,
                  "PreventionProgram3ID": 1000057416,
                  "ProcessChemicalID": 1000084741
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000054940,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Contra Costa County HazMat",
    "CoordinatingAgencyPhone": "9253353232",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000054940,
      "SummaryText": "1.1  Introduction \n\nCalpine Corporation operates the Delta Energy Center (DEC), a nominal 880-megawatt power plant located in Pittsburg, California.  The DEC uses anhydrous ammonia as a necessary part of reducing the emissions of nitrogen oxides to the atmosphere.  Storing a large quantity of ammonia can be a hazard if it is not handled properly. Calpine Corporation takes its safety obligations in storing and using ammonia as seriously as we take controlling emissions from the power plant. The following document describes what could happen if there were to be an accident, the steps we take every day to ensure a safe operating plant, and what to do in the event of an emergency.\n\n\n\n1.2  Accidental Release Prevention and Emergency Response Policies\n\nDEC's accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices. All applicable procedures of the State of California and U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\n\n\nIt is the policy of Calpine Corporation that every employee is entitled to a safe and healthful place in which to work and live. Calpine Operations and Maintenance Department incorporates the concepts of environmental responsibility and productivity with safety resulting in efficiency and productivity.  As part of Calpine's obligation to protect the integrity of human, environmental, physical, and financial resources, and to conserve and\n\nefficiently utilize those resources, Calpine will: \n\n?    Comply fully with laws regulating environmental protection and employee health and safety\n\n?    Furnish work places free of recognized hazards likely to cause injury to employees, the public, or the environment\n\n?    Train employees in safe and environmentally conscious practices and require compliance with envir"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000054940,
      "SummaryText": "onmental, health and safety regulations, policies, and procedures\n\n?    Provide a professional staff to maintain and support environmental, health and safety programs\n\n\n\nAccidental release prevention is implemented through an established set of policies and programs including, but not limited to, the following:\n\n?    Inspection and maintenance program for all system equipment\n\n?    Monitoring of employee and contractor use of the system\n\n?    Contractor Safety Program\n\n?    Emergency Action Plan\n\n?    Lockout/Tagout\n\n?    Hot Work Permit\n\n?    Confined Space Entry\n\n?    Employee Safety Training\n\n?    Material Safety Data Sheets\n\n?    Compliance Audits\n\n\n\nAll manuals and procedures are available to employees at all times. The environmental, health and safety program at DEC includes the CalARP RMP and the anhydrous ammonia system manual.\n\n\n\nEmergency response is implemented through an established set of policies and programs including, but not limited to, the following:\n\n?    Criteria defining an emergency\n\n?    Staff training and responsibility assignments\n\n?    Emergency notification procedures\n\n?    Evacuation procedures\n\n?    Emergency response procedures\n\n?    Incident investigation and follow-up procedures \n\n\n\nThis document complies with the EPA Risk Management Program under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68, and the California Accidental Release Prevention (CalARP) Program under California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5.  This document summarizes our existing health and safety programs, our internal management response procedures, and ongoing actions that are designed to prevent or minimize impacts of accidental releases of ammonia to the environment.  DEC has prepared a stand-alone emergency action plan to handle any potential accidental releases.\n\n\n\n1.3  Facility Description and Regulated Substances Information\n\nDEC is located on approximately 20 acres within a 139-acre parcel of land owned by Dow. The 20 ac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000054940,
      "SummaryText": "re site is leased to DEC by the Dow Chemical Corp. The site is located in the city limits of Pittsburg in Contra Costa County at the border of the City of Antioch, and is approximately 35 miles northeast of San Francisco. \n\nThe facility currently stores anhydrous ammonia, a regulated toxic substance under RMP and CalARP regulations, in one 15,000-gallon double walled steel storage tank at 85% capacity, which is located inside a secondary containment area.  Anhydrous ammonia is used at DEC to reduce nitrogen oxides (nitric oxide and nitrogen dioxide) created during the combustion of natural gas and exhausted from the three  Combustion Turbine Generators (CTG) and Heat Recovery Steam Generators (HRSG) duct burners.  Anhydrous ammonia  vapor is drawn from the top of the storage tank and diluted with air, and injected into the three Selective Catalytic Reduction (SCR) units to reduce the NOx emissions. \n\nThe maximum quantity of ammonia stored at DEC exceeds the federal RMP (and PSM) and CalARP specified threshold quantities of 10,000 pounds and 500 pounds, respectively; thus, the facility is subject to federal RMP, PSM and CalARP regulations.  The anhydrous ammonia process is a Program 3 process.\n\n\n\n\n\n1.4  Summary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\nManagement System\n\nRisk Management Program regulations require those facilities with processes subject to Program 3 to develop a management system to oversee the implementation of the RMP elements.  The management system must be assigned to a qualified person or position that will have the overall responsibility for the development, implementation, and integration of the RMP.  \n\nDEC has assigned the Operations Manager as the qualified person who will have the overall responsibility for the development, implementation, and integration of the RMP.  The Operations Manager will be assisted by the EHS Manager and the Maintenance Manager in the implementation of the RMP.  The manag"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000054940,
      "SummaryText": "ement system activities are further discussed below:\n\nPlanning - DEC has an environmental, health, and safety policy that clearly defines Calpine's goals and obligations.\n\nOrganizing - The Operations Manager is responsible for ensuring that written prevention procedures are in place and implements as described in the prevention program document.\n\nImplementing - The Operations Manager is responsible for implementing the Risk Management Program at DEC.  The EHS Manager is responsible for arranging for and tracking training of staff.\n\nControlling - The EHS Manager is responsible for conducting the internal compliance audits of the prevention program to ensure the procedures are being implemented by staff.  Unless otherwise indicated, RMP records are maintained for five years. \n\n\n\nChemical-Specific Prevention Steps\n\nThe prevention program elements described in the following section represent integrated administrative controls intended to ensure the safety of workers, the public, and the environment.  The program elements such as process hazard analysis, compliance audits, and incident investigation result in the development of additional safeguards.  Some of the physical safeguards that are part of the original design and are already in place include the following:\n\nAmmonia Storage Tank.  The storage tank is provided with local pressure indicator (in psig) and level indicators (in percent volume).  The tank also has pressure safety valves,  temperature gauges, and anhydrous ammonia  leak detectors. Indication and alarms for tank level, temperature, and pressure are displayed on the local control panel and Control Room DCS.  An ammonia vaporizer alarm is also provided in the Control Room DCS.\n\nSecondary Containment. The ammonia  storage tank and vaporizers are located inside a secondary containment area sufficient to contain the full contents of the vessel, 24 hours of rain fall as determined by the 25-year storm and deluge water for 20 minutes as determined by code.\n\nLe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000054940,
      "SummaryText": "ak Detection. Four SensAlert ammonia  leak detectors transmitters are provided and alarm locally and in the Control Room in the event of an ammonia leak. Two leak detectors are located beside the vaporizers and one leak detector is inserted into the PRV line.  A leak detector also is located by the unloading station. \n\nThe detectors trigger a local alarm and DCS alarm when a concentration of 50 ppm of ammonia is detected in the air.  If a concentration of 100 ppm is detected, the leak detection system alarms to the Pittsburg Fire Department. There is no automatic function provided with the leak detectors.  Subsequent measures from this high alarm activation will rely on the operator action.\n\nThe underground portion of the piping has secondary containment/single-walled pipe.   \n\nAlarm System.  A common trouble alarm is provided both to the main control panel and DCS on any of the following conditions:\n\n?    Low storage tank level - the storage tank low pressure alarm indicating that the vaporizer system has malfunctioned is provided in the DCS .  The alarm also is used to indicate that the storage tank needs to be refilled.\n\n?    High storage tank level - the storage tank high pressure alarm indicating that that the vaporizer system has malfunctioned, or an excessive high ambient temperature is provided in the Main control and DCS. The alarm also indicates when the anhydrous ammonia unloading should stop. \n\n?    Leakage of ammonia from the inner shell of the storage tank - In the event of leak detection by the pressure switch installed in the annular space, an alarm indicating high pressure in the annular space is annunciated in the DCS. \n\n?    Leakage from the hose during unloading - in the event of leakage from the hose(s) during unloading an operator shall use the \"emergency button\" on the unloading panel or the remote \"emergency button\" on the west side of the STG building wall to close the unloading valves.  The operator will then close the shutoff valves on the bulk delive"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000054940,
      "SummaryText": "ry vehicle.\n\n?    Storage tank high or low pressure alarm - The storage tank high pressure alarm indicating that the vaporizer system has malfunctioned, or an excessive high ambient temperature is provided in the main control panel and DCS.  The storage tank low pressure alarm indicating that the vaporizer system has malfunctioned is in the DCS.\n\n?    Storage tank high temperature alarm - the storage tank high temperature alarm indicating that that the vaporizer system has malfunctioned, or an excessive high ambient temperature is provided in the DCS.\n\n?    High pressure in the annular space indicating leakage of ammonia from the inner shell\n\nEmergency Shower and Eyewash. An emergency eyewash and shower are provided a the truck unloading station near the ammonia  storage tank. \n\nWet Pipe Sprinkler System.  A wet pipe sprinkler deluge water system is provided around the storage tank to dissipate the anhydrous ammonia vapor cloud in case of a leak.  The system will be manually activated locally at the anhydrous ammonia  tank or from the Control Room in the event of an anhydrous ammonia leakage.  The deluge system is not automatically activated because in the event of a large quantity of liquid anhydrous ammonia , adding water can cause a violent reaction and accelerate the release of ammonia  vapor.\n\nFire Safe Stop Valve. An emergency fire safe stop valve is provided on the main vapor line from the storage tank.  This stop valve is wired directly to the DCS system.  In the event of a fire or anhydrous ammonia spill, the operator is to manually initiate a valve closure form the DCS.  Limit switches on the valve will indicate the valve position in the Control Room DCS. \n\nQuick Shutoff Valves.  Quick shutoff valves are provided on the liquid fill and vapor return. The valves are electronically controlled from the Control Room and locally at the anhydrous ammonia storage area.  Procedures require that an operator is present at all times during unloading.\n\n\n\nPrevention Program Elem"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000054940,
      "SummaryText": "ents\n\nThe DEC accidental release prevention program is based on the following key elements:\n\n?    Detailed management system and clear levels of responsibilities and team member roles\n\n?    Comprehensive safety process information that is readily available to staff, emergency responders, and contractors\n\n?    Comprehensive preventive maintenance program\n\n?    A process hazard analysis of equipment and procedures with operation and maintenance staff participation\n\n?    Use of state-of-the-art process and safety equipment\n\n?    Use of accurate and effective operating procedures, written with operations and maintenance staff participation\n\n?    High level of training of operators and maintenance staff\n\n?    Implementation of an incident investigation, inspection, and auditing program using qualified staff\n\n\n\nProcess Safety Information\n\nComplete and up-to-date safety information is required to successfully implement most RMP elements including process hazard analyses, training, emergency planning and response, management of change, incident investigation, and compliance audits.  RMP regulations require that information concerning process chemicals, process technology, and process equipment be compiled as part of a prevention program, prior to conducting a process hazard analysis.  This information is beneficial to release prevention because it assists DEC staff in identifying and understanding such items as the hazards in operating the ammonia process, chemical incompatibilities, safety systems, safe operating limits, and process chemistry. The EHS Manager is responsible for compiling and maintaining the up-to-date safety information related to the regulated substances, processes, and equipment.\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazards, and chemical exposure limitations, as well as detailed physical properties of anhydrous ammonia.  This information was compiled from numerous sources and is intended to be a one-stop "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000054940,
      "SummaryText": "source for the reader seeking data about these substances.  This information includes ammonia background information, material safety data sheets (MSDS), and ammonia reaction chemistry.\n\nEquipment safety information has been compiled on the ammonia process, and specifications for the process are compiled in one place for easy reference 24 hours a day.  Details such as maximum intended inventory, safe upper and lower operating temperatures and pressures, and codes and standards used to design, build, and operate the processes are on file at the facility.  Calpine Corporation verifies that that equipment complies with recognized and generally accepted good engineering practices by specifying that the latest codes and standards be used for the design of the plant, conducting a seismic assessment to confirm that the process meets structural codes, and by reviewing the ammonia process in the process hazard analysis.  Calpine also has scheduled reviews of the risk management program to update safety information if there is a major change that would make existing information inaccurate.\n\n\n\nProcess Hazard Analysis \n\nEvaluation of new equipment and processes has and will continue to be implemented in an effort to protect employees, the public, and the surrounding environment. \n\n\n\nA systematized evaluation of new equipment and processes has and will continue to be implemented in an effort to protect employees, the public, and the surrounding environment.  The purpose of the process hazard analysis (PHA) is to: \n\n?    Identify equipment or process hazards\n\n?    Identify equipment failures that could lead to accidental release.\n\n?    Identify staff errors (operations or maintenance) that could lead to accidental releases\n\n?    Evaluate the consequences of such releases\n\n?    Identify additional program measures that may be needed to mitigate or prevent the release\n\n?    Identify additional training and/or safety needs \n\nThe Hazard Review was last conducted at the Delta Energy Center facility on "
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000054940,
      "SummaryText": "November 10, 2015. A multidisciplinary Team comprised of management, operations and maintenance staff was assembled to perform the Hazard Review. The Hazard Review Team included personnel familiar with design, operation, and maintenance requirements, and both a facilitator and scribe from Risk Management Professionals.\n\n\n\nThe primary objective of this new Hazard Review was to review the process equipment and\n\noperation in order to comply with applicable portions of the CalARP regulations; update/recertify the statements made in the December 2010 Hazard Review; identify potential hazards and operability concerns; and suggest methods or design improvements that might be implemented to reduce the risk of potential hazards and of a significant accidental release of a potentially hazardous material to atmosphere.\n\n\n\nAnalysis Scope\n\nThis Hazard Review considered all equipment associated with the Anhydrous Ammonia\n\nSystem. The analysis scope included evaluating routine and non-routine procedures such as\n\nstartup, shutdown, emergency shutdown, maintenance, etc. The Hazard Review also included\n\nevaluating operation for potential equipment failures, human errors, and process problems that\n\ncould result in consequences of interest. However, the Hazard Review Team did not consider\n\ndetailed hazard evaluations of written procedures necessary. Nevertheless, the Hazard Review\n\nTeam did consider recommendations that address procedure-related issues.\n\nThe Team used the Hazard and Operability (HAZOP) Guideword method in conjunction with\n\nWhat-If /Checklists to provide a comprehensive Hazard Review. This methodology was\n\napproved in advance by the Habib Amin - CCHD Haz Materials Division.\n\nThis technique is recognized as an acceptable method for evaluating process hazards. The\n\nmethod used in this Hazard Review was performed in accordance with the \"Guidelines for\n\nHazard Evaluation Procedures, 2nd Edition with Worked Examples,\" Center for Chemical\n\nProcess Safety, American Institute o"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000054940,
      "SummaryText": "f Chemical Engineers, September 1992.\n\n\n\nWhat-If/Checklists\n\nThis technique is also recognized as an acceptable method for evaluating process hazards.\n\nThe method used in this Hazard Review was performed in accordance with the \"Guidelines for\n\nHazard Evaluation Procedures, 2nd Edition with Worked Examples,\" Center for Chemical\n\nProcess Safety, American Institute of Chemical Engineers, September 1992.\n\nThe specific steps of the HAZOP methodology used in this study were:\n\n?    Choose a section of the plant to study (node) and highlight it on the Piping and\n\n?    Instrumentation Diagrams (P&IDs)\n\n?    Apply a design or operations deviation (guide word + parameter) including the\n\n?    intention for the parameter\n\n?    Identify possible causes of deviation from the intention\n\n?    For credible causes, characterize the worst credible set of consequences\n\n?    Identify existing safeguards\n\n?    Qualitatively assess the scenario likelihood, severity, and risk (using the risk-ranking\n\n?    matrix)\n\n?    If appropriate, identify meaningful recommendation(s) to address potential hazard or\n\n?    operability issues\n\nStudy Nodes\n\nThe nodes (sections) reviewed for the Hazard Review are identified in Table below. The Team\n\nalso reviewed all piping and equipment with crossties to the nodes listed and\n\npotential consequences of significance resulting from any crossties are documented in the\n\nHazard Review (HR) worksheets.\n\n\n\nNode    Description    Drawings\n\n1    Ammonia Tank to the Evaporator    \n\n2    Evaporator to the Injection Grid    \n\n3    Dilution Air Blower    \n\n4    Truck Loading    \n\n5    External Events    \n\n6    What-if - General Site Issues    \n\n\n\nThere were no recommendations from the new Hazard Review completed at the Delta Energy\n\nCenter. The next Hazard Review is due before November 10, 2020. The next Hazard Review is due before November 10, 2020.\n\n\n\nThe initial HAZOP was conducted on 12/7/2005 and revalidated on 12/16/2010. \n\n\n\nOperating Procedures\n\nDEC maintains up-to-date, accurate, written operating procedures that give clear instruction"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000054940,
      "SummaryText": "s for the ammonia process. Effective operating procedures, when combined with operator training, are instrumental in ensuring safe operation of the systems and preventing accidental releases.  The procedures are developed from equipment manuals and the experience of the operations and maintenance staff. Procedures include startup, shutdown, normal operations, temporary operations, abnormal conditions, emergency operations, and emergency shutdown.   The operating procedures also include safe work practices for hazardous material handling.   The operating procedures are accessible to all staff and are maintained in the control room.\n\nIf the operating procedures must be modified, the Operations Manager or designee will be responsible for modifying the procedure.  The Operations Manager will review the draft-revised procedures and sign the approval page.  The Operations Manager will forward the revised procedures to the General Manager for approval and signature. The Operations Manager or designee must update all copies of the operating procedures. \n\nAfter completing this review, the Operations Manager will certify each operating procedure as accurate and reflective of current operating practice.  The date that the procedures were modified will be listed on the first page of each operating procedure.  A memorandum should be prepared summarizing who reviewed and modified the procedures, the dates the work was done, who reviewed the revisions, the rationale for the changes, and the date the revised procedures were approved by the Operations  Manager.\n\nStaff designated by the General Manager will communicate revisions to the appropriate plant operations and maintenance staff.  If revisions are significant, a formal training session will be held to communicate the changes.  The communication to plant operations staff should be documented in a memorandum.  The Operations Manager will ensure that the operating procedures are updated if necessary whenever a major change occurs"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000054940,
      "SummaryText": " and prior to start up of the changed process.\n\n\n\nTraining \n\nEach DEC employee presently involved in operating or maintaining the ammonia process is trained in an overview of the process and applicable operating and maintenance procedures.  Training helps employees understand the nature and cause of problems arising from operations involving ammonia, and increases employee awareness of hazards.  DEC training program includes both initial and triennial refresher training that covers:  (1) a general overview of the processes, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices.  Written examinations are used to verify that an employee understands the training material before the process work can be resumed. \n\nTraining documentation includes:  date of most recent review or revision to the training program, type of training required and the type of competency testing used to ensure staff understands the training.  Ongoing employee training records are maintained.  \n\n\n\nMechanical Integrity\n\nDEC maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  Calpine believes that this program is the primary line of defense against a release.  Maintenance staff address equipment testing and inspection, preventative maintenance schedules, and personnel training of these procedures.  Our maintenance program includes the following:\n\n?    Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes, and prior operating experience\n\n?    Implementation of written procedures by performing inspections and tests on process equipment at specified intervals\n\n?    Training of maintenance personnel in safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of un"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000054940,
      "SummaryText": "safe conditions\n\n?    Procedures specifying training requirements for contract maintenance employees, as well as requiring contractors to use plant-developed maintenance procedures for process areas\n\n\n\nCompliance Audits\n\nInternal compliance audits are conducted every three years to verify compliance with the programs and procedures contained in the RMP.  DEC assembles an audit team that includes personnel knowledgeable in the Risk Management Program rule and in the regulatory process.  This team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\nA site audit of the Risk Management Plan was conducted on July 24, 2009 and an audit of the elements required in the Process Safety Management Plan was performed on March 9,2012.\n\n\n\nIncident Investigation\n\nDEC investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment, so that similar accidents can be prevented.  DEC trains employees to identify and report any incident that requires investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of any incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by appropriate staff and is added to, or used to revise operating and maintenance procedures.  Information from audits and any resulting changes in operating procedures are passed onto the training unit for their inclusion in existing training programs, if warranted, to prevent a future event.\n\nThe site shall utilize incident investigation procedures as defined in SHP-9, Incident Management. In addition, SHP 2, Safety Communi"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000054940,
      "SummaryText": "cation will be used to document incident resolutions and corrective actions of incident report findings.\n\n\n\nEmployee Participation \n\nThe Calpine Corporation recognizes that the participation of the DEC staff in preparing this RMP/PSM program is critical to the plan's successful implementation. The facility's Employee Participation Plan is designed to fulfill the regulatory requirements of a written plan of action for implementing employee participation requirements.  In addition, the plan serves as written documentation demonstrating the required accessibility of pertinent information to employees.  Employee participation is valuable because it increases the safety awareness of the staff and it allows the staff's experience in operating and maintaining the processes to be incorporated into the plan, especially the process hazard analysis.\n\nDEC management recognizes that it is essential to involve the employees in the development and implementation of the RMP/PSM program, communicating employees' rights to access RMP/PSM program information, and documenting employee participation.  The intent of this procedure is to involve employees operating the ammonia process to participate in the RMP/PSM program as follows:\n\n?    Employees are consulted during the development and compilation of written process safety information, the conduct of process hazard analyses and other elements in the RMP/PSM program\n\n?    Employees are informed on their rights to access the RMP/PSM program and information required to safely perform their duties\n\n?    Employees are informed on the procedures for obtaining access to RMP/PSM program information, including the process hazard analysis, and other relevant information required to safely perform their duties\n\n\n\nHot Work Permit \n\nPSM and CalARP regulations require employees and contractors to employ safe work practices when performing \"hot work\" in, on, or around the anhydrous ammonia  process.  To ensure that hot work is done safely, a hot work permits"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000054940,
      "SummaryText": " program must be developed that requires that a permit be issued before hot work is performed.  The purpose of hot work permits program is to provide accountability and documentation necessary for ensuring the safe performance of hot work during normal operations, maintenance and construction operations. Hot work permits document that the fire prevention and protection requirements in 29 CFR 1910.252(a) have been implemented prior to beginning the hot work operations.  The hot work permits program also applies to any contractor work conducted at this facility.  \n\nThe hot work permits program includes procedures for storage and use of cylinders, fire prevention and suppression, electric welding, cutting and heating procedures, ground returns and machine grounding, welding cables and connectors, manual electrode holders, and procedures for the removal of combustibles.  The hot work permit includes date and time of hot work, location of hot work, persons performing the hot work, description of the hot work, results of atmosphere testing, and a checklist to make sure that precautions have been taken.\n\nThe site shall utilize hot the work permit procedures as defined in SHP-11, Hot Work.\n\n\n\nContractors \n\nDEC has procedures and policies in place that ensure that only contractors with good safety programs are selected to perform work on and around the ammonia process.  Contractors are properly informed of the hazards, access limitations to these process areas, and emergency response procedures, and are prepared to safely complete the work.  DEC sets minimum contractor safety performance requirements for work in process areas, holds contractor safety briefings before allowing them near or in the process area, controls access to the process areas, and evaluates the contractor's performance.\n\nThe programs utilized at DEC are outlined in SHP-13, Contractor Safety and SHP-14, Contractor and Visitor (Escort & Non-Escort) Safety Orientation.\n\n\n\nManagement of Change \n\nDEC provides "
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000054940,
      "SummaryText": "a system and approach to maintain and implement management of changes or modifications to equipment, procedures, chemicals, and processing conditions.  This system allows our employees to identify and review safety hazards or provide additional safety, process, or chemical information before the proposed change is implemented. Effective management will help minimize the chance for an accidental release.  A system that manages changes made to the ammonia process will allow changes to be identified and reviewed before they are implemented to determine if the proposed change would compromise system safety.\n\nThe site will utilize the MOC procedures defined in PAP-04, Management of Change.\n\n\n\nPre-Startup Safety Review \n\nDEC ensures that a pre-startup safety review is completed for any new regulated process at the plant, or for significant modifications to an existing covered process that requires a change in the process safety information.  The prestartup safety review confirms the following:\n\n?    Equipment has been installed in accordance with design specifications\n\n?    Adequate safety, operating, maintenance, and emergency procedures are in place \n\n?    A PHA has been performed and recommendations resolved or implemented for new processes\n\n?    Facility and/or process modifications meet the requirements of Management of Change procedure\n\n?    Training for each employee involved in operating and maintaining the process has been completed\n\n\n\n1.6  Five-Year Accident History Summary\n\nDEC has had no accidents or releases involving ammonia in the past five years.\n\n\n\n1.7  Emergency Response Program Summary\n\nDEC has established a stand-alone emergency action program that is followed by the employees to help safely control accidental releases of hazardous substances.  PSM and RMP regulations require that an Emergency Action Plan be prepared for facilities that are not responding facilities.  The plan must be prepared in accordance with the provisions of 8 CCR 3220, Emergency Action Plan.  T"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000054940,
      "SummaryText": "he Emergency Action Plan described in this section is for facilities whose employees are not responders to emergency situations. This program has been coordinated (reviewed) by the CCCHSD and the Contra Costa County Fire Protection Department, which are members of the Local Emergency Response Planning Committee (LEPC).  Emergency operation and action procedures are also reviewed once per year. \n\n\n\n1.8  Planned Changes to Improve Safety\n\nA number of studies, inspections and changes have been performed to improve the safety , security and reliability of the ammonia process at DEC including:\n\n?    A new process hazard analysis (HAZOP/What if Checklist) completed November 2015. No recommendations were made.\n\n?    A new seismic assessment completed November 2015. There was one recommendation to implement an equipment inspection and ongoing corrosion prevention program to ensure equipment integrity. A corrosion prevention program implemented includes inspecting the ammonia system (piping, tank, blowers) daily during rounds.  The annual ammonia system preventative maintenance job plan was revised to include corrosion inspections and repairs.  \n\n?    A security and vulnerability assessment was completed November 2015. There were two recommendations that will be implemented to improve site security. Expected date of completion is December 31, 2016.\n\n?    An unannounced Contra Costa Ammonia Inspection/Drill conducted onsite on October 21, 2015. \n\n?    A hazardous material inspection by the Contra Costa Hazardous Materials on December 21, 2015. \n\n?    A follow-up seismic assessment conducted July 19, 2011\n\n?    A revalidation of the hazard review conducted in December 2010\n\n?    A safety inspection conducted by the Contra Costa County Fire Protection District on November 30, 2010 \n\n?    The pre-startup safety review conducted March 27, 2002\n\n?    A walk-down of the process conducted on March 9, 2002 with the contractor to confirm the system was installed as designed\n\n?    The seismic assessment conducted in J"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000054940,
      "SummaryText": "anuary 2002\n\n?    The process hazard analysis conducted in October 2001\n\nDuring these studies and inspections, several additional risk reduction measures were recommended to improve safety at DEC.  \n\nDetails of the recommendations from the PHA, SVA and the seismic assessment can be found in the report document.  The risk reduction measures include implementing corrosion prevention measures, installing additional security cameras and making security improvements. \n\n"
    }
  ]
}