{
  "FacilityID": 1000060042,
  "FacilityName": "Kemps - Rochester, Milk",
  "FacilityStr1": "701 1st Avenue SE",
  "FacilityStr2": null,
  "FacilityCity": "Rochester",
  "FacilityState": "MN",
  "FacilityZipCode": "55904",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27109",
  "LEPC": null,
  "FacilityLatDecDegs": "44.016056",
  "FacilityLongDecDegs": "-92.461287",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kemps.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 13085860,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kemps- Rochester Milk",
  "OperatorStr1": "701 1st Ave. SE",
  "OperatorStr2": null,
  "OperatorCity": "Rochester",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55904",
  "OperatorZipCodeExt": null,
  "RMPContact": "Corey Ramer",
  "RMPTitle": "General Manager",
  "FTE": 154,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000233605",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-11-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-10-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-10-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-08-27 00:00:00",
  "DeRegistrationEffectiveDate": "2020-07-09 00:00:00",
  "AnniversaryDate": "2021-10-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074970,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000060042,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000076132,
          "ProcessID": 1000074970,
          "NAICSCode": "311511",
          "_desc": {
            "NAICS_CODE": "311511",
            "NAICS_DESCRIPTION": "Fluid Milk Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092719,
          "ProcessID": 1000074970,
          "ChemicalID": 56,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000592719,
          "ProcessID": 1000074970,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060042,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nSince 1914, Kemps has been delighting families throughout the upper Midwest with wholesome and delicious dairy products. From our beginnings as a small creamery in Southeastern Minnesota, Kemps has extended its roots to include the manufacture and marketing of fresh milk, premium ice cream and frozen yogurt, frozen novelties, sour cream and cottage cheese through retail supermarkets and food service channels. Headquartered today in St. Paul, Minnesota, we operate five manufacturing facilities in Minnesota and Wisconsin and have over 1,126 employees.\n\n\n\nKemps is a wholly owned subsidiary of Dairy Farmers of America, Inc. 100% of our profits go to dairy farmers and their families.\n\n\n\nThe Kemps LLC facility in Rochester (Kemps) maintains a Safety Committee. Kemps has an Emergency Response Plan (Plan) in effect to provide the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\n?    Kemps, LLC is located at 701 1st Avenue SE in Rochester, Minnesota.  The facility is approximately 1.25 miles East of   Highway 63 and approximately 0.6 miles North of Highway 14.  The area immediately surrounding the facility is urban with a mixture of light commercial, industrial and residential areas.\n\n\n\n?    The regulated material present at the facility and the focus of this study is anhydrous ammonia.  The facility uses approximately 14,016 pounds of ammonia as a refrigerant within a closed system.  The system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage.\n\n\n\n?    The total ammonia inventory at the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060042,
      "SummaryText": "facility is 14,016  pounds.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nKemps ammonia refrigeration system has many safety features. Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system. For example, the facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards including the following:\n\n\n\n?    IIAR Bulletin 107, \"Suggested Safety and Operating Procedures When Making Ammonia Refrigeration Tie-ins\"\n\n?    IIAR Bulletin 109, \"Minimum Safety Criteria for a Safe Ammonia Refrigeration System\"\n\n?    IIAR Bulletin 110, \"Startup, Inspection, and Maintenance of Ammonia Refrigeration Systems\"\n\n?    IIAR, \"A Guide to Good Practices for the Operation of an Ammonia Refrigeration System\"\n\n\n\nThe facility, including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system. The ammonia refrigeration system is equipped with various automatic process controls which ensure safe and efficient operation of the compressors, condensers, evaporators and other process equipment, suction accumulator, and regulating valves.  In addition, pressure relief valves automatically engage in the event the system experiences a very high pressure situation.  In case of an ammonia leak, ammonia detectors will provide an alert.\n\n\n\nFrom an administrative standpoint, the facility has implemented a Process Safety Management program for compliance with 29 CFR 1910.119 and a Risk Management Program for compliance with 40 CFR Part 68.\n\n\n\nThe facility will continue to close out Mechanical Integrity, Process Hazard Analysis, and Compliance Audit recommendations to improve safety of the ammonia system.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nAn investigation into the Kemps accident history during the past Five-Year period (September 201"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060042,
      "SummaryText": "1 - September 2016) revealed that there have been no incidents that meet the EPA RMP definition which is as follows:\n\n\n\n?    On-site deaths, injuries, or significant property damage (?68.42(a)); or\n\n?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (?68.42(a)). \n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an Emergency Action Plan (plan) in effect.  This Plan was designed to meet the following objectives:  \n\n\n\n?    save lives;\n\n?    minimize and avoid injuries;\n\n?    protect the environment; and\n\n?    minimize property damage.\n\n\n\nThe Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. \n\n\n\n"
    }
  ]
}