{
  "FacilityID": 1000106972,
  "FacilityName": "Desert Hills RNG",
  "FacilityStr1": "350 Campbell Lane",
  "FacilityStr2": null,
  "FacilityCity": "Yerington",
  "FacilityState": "NV",
  "FacilityZipCode": "89447",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32019",
  "LEPC": "Lyon County LEPC",
  "FacilityLatDecDegs": "39.10555",
  "FacilityLongDecDegs": "-119.243115",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "ddarger@vanguardrenewables.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Dominion Energy",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Vanguard Renewables",
  "OperatorStr1": "133 Boston Road",
  "OperatorStr2": "Bldg 15",
  "OperatorCity": "Weston",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "02493",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000251611",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-09-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-09-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-09-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-09-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000133747,
      "AltID": "Renewable Nat Gas Plant",
      "FacilityID": 1000106972,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000167617,
          "ProcessID": 1000133747,
          "ChemicalID": 155,
          "Quantity": 81000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000150438,
              "ProcessChemicalID": 1000167617,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000135216,
          "ProcessID": 1000133747,
          "NAICSCode": "32512",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106972,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Mason Valley Fire Dept",
    "CoordinatingAgencyPhone": "7754632261",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106972,
      "SummaryText": "lace to respond quickly. Processes can be shut down on an emergency basis and the facility has a plan in place for evacuations, adequate first aid, and medical treatment and notification of local emergency response agencies. The facility is a non-responding facility and relies on the Mason Valley Fire Department to respond to chemical releases.\nPlanned changes to improve safety [40 CFR 68.155(f)]:\nSince the Desert Hills Dairy farm is a new process, Dominion is continually ensuring the implementation of the prevention program, including the closure of the most recent PHA recommendations.\n\nDominion has completed this report to provide the public with information about our activities at this facility.  We believe that the many controls instituted to maintain a safe operation, and our commitment to continuous improvement that an incident affecting our employees or the surrounding area is unlikely to occur."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106972,
      "SummaryText": "provisions set out under the US EPA RMP and OSHA PSM regulations are being implemented. These audits are conducted at least every 3 years and any corrective actions required as a result of the audits are undertaken in a prompt manner.\n\nIncident Investigation  \nDominion promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum period of 5 years.\n\nEmployee Participation  \nDominion believes that Process Safety Management and accident prevention is a team effort. Employees are encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, Dominion employees have access to all information created as part of the facility's implementation of the RMP and PSM rules, including information resulting from Process Hazard Analyses in particular.\n\nHot Work Permit  \nDominion has a hot work program that requires issuance of a hot work permit for hot work operations conducted on or near the covered process. \n\nContractor Safety Program  \nDominion occasionally hires contractors to conduct specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of the contractor's safety performance is carried out. Dominion has a strict policy of informing the contractors of known potential hazards associated with the contractor's work and the corresponding processes. Contractors are also informed of all the procedures for emergency response in the event of an accidental release of a regulated substance.\nThe five-year accident history [40 CFR 68.155(d)]:\nThe facility\u0092s RMP process is new and therefore have had no accidents.\nThe emergency response program [40 CFR 68.155(e)]:\nIn the event of an incident, Dominion has systems in p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106972,
      "SummaryText": "operations, Dominion maintains detailed written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations and normal shutdown. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nEmployee Training  \nDominion has a training program in place to ensure that employees who are operating plant processes are competent in the applicable operating procedures. Refresher training is provided at least every three years and more frequently as needed.\n\nMechanical Integrity  \nDominion carries out documented maintenance checks on process equipment to ensure proper operations. Inspected process equipment include pressure vessels, storage tanks, piping systems, pressure relief and vent systems, emergency shutdown systems, controls, and pumps. Maintenance operations are carried out by qualified personnel with previous training in maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\nManagement of Change [MOC]  \nWritten procedures are in place at the Dominion facility to manage changes in process chemicals, technology, equipment, and procedures. Facility operators or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification(s).\n\nPre-Startup Safety Review [PSSR]  \nPre-start up safety reviews related to new processes and modifications to existing processes are conducted routinely at the facility. These reviews are conducted to confirm that construction, equipment, operating, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits  \nDominion conducts audits on a regular basis to determine whether the"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106972,
      "SummaryText": "The accidental release prevention and emergency response policies at the stationary source [40 CFR 68.155(a)]:\nDominion is committed to employee, public and environmental safety. This commitment is demonstrated by our accidental release prevention program that encompasses design, installation, operating procedures, maintenance, and employee training. Engineering controls are in place to prevent possible releases of regulated substances. The Desert Hills Dairy Farm is a non-responding facility for releases of the RMP-listed chemicals, so the site utilizes an Emergency Action Plan.\nThe stationary source and regulated substances handled [40 CFR 68.155(b)]:\nThe Desert Hills Dairy farm produces gas in digesters that collect manure and treats the Biogas to produce renewable natural gas. The natural gas contains methane, which is a flammable RMP-regulated chemical, above the RMP threshold quantity of 10,000 pounds. There are no RMP-regulated toxic chemicals on site.\nThe general accidental release prevention program and chemical-specific prevention steps [40 CFR 68.155(c)]:\nDominion has a program in place to comply with the provisions of the accidental release prevention regulations under 40 CFR Part 68. The following sections briefly describe the elements of the existing release prevention program.\n\nProcess Safety Information  \nDominion maintains a record of process safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\nProcess Hazard Analysis  \nAnalyses ensure that hazards associated with our processes are identified and controlled efficiently. The methodology used to carry out these analyses is HAZOP. The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of at least 5 years. Any findings related to the hazard analysis are addressed in a timely manner.\n\nWritten Operating Procedures \nTo ensure safe"
    }
  ]
}