{
  "FacilityID": 1000025050,
  "FacilityName": "Konoike E Street Inc.",
  "FacilityStr1": "901 East E Street",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington, CA",
  "FacilityState": "CA",
  "FacilityZipCode": "90744",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.776915",
  "FacilityLongDecDegs": "-118.251570",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Konoike E Street Cold Logistics",
  "OperatorStr1": "901 East E Street",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington, CA",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90744",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000180902",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-10-13 00:00:00",
  "SafetyInspectionBy": "Los Angeles City Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-07-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-12-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-12-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-12-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 33.77611,
  "FRS_Long": -118.25056,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000030767,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000025050,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000037253,
          "ProcessID": 1000030767,
          "ChemicalID": 56,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000031083,
          "ProcessID": 1000030767,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000026669,
              "Process_NAICS_ID": 1000031083,
              "SafetyReviewDate": "2009-10-28 00:00:00",
              "PHA_Date": "2011-10-26 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-10-26 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Pipeline Breaks",
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Level Controls, UPS & Generator",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Ammonia Diffusion Tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Improve training and labeling, maintenance schedule, update Emergency Action Plan and Piping Diagrams, and review of SOPs",
              "OpProceduresReviewDate": "2011-10-26 00:00:00",
              "TrainingReviewDate": "2009-10-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "monthly safety meetings",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-10-28 00:00:00",
              "EquipmentInspectionDate": "2011-10-19 00:00:00",
              "EquipmentTested": "General system inspection (weekly)",
              "ChangeMgmtDate": "2005-01-01 00:00:00",
              "ChangeMgmtReviewDate": "2009-10-28 00:00:00",
              "PreStartupReviewDate": "2002-12-16 00:00:00",
              "ComplianceAuditDate": "2009-10-28 00:00:00",
              "AuditCompletionDate": "2010-10-28 00:00:00",
              "IncidentInvestigationDate": "2011-05-15 00:00:00",
              "InvestigationChangeDate": "2011-05-15 00:00:00",
              "ParticipationPlansReviewDate": "2009-10-28 00:00:00",
              "HotWorkPermitReviewDate": "2009-10-28 00:00:00",
              "ContractorSafetyReviewDate": "2009-10-28 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Ammonia refrigerataed cold storage and freezer warehouse.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000032022,
                  "PreventionProgram3ID": 1000026669,
                  "ProcessChemicalID": 1000037253
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000025050,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Los Angeles Fire Dept. - FS #38",
    "CoordinatingAgencyPhone": "3105487538",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000025050,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nThe facility uses ammonia as a refrigerant within a closed system.  Ammonia is a hazardous substance that must be handled properly in order to prevent accidental releases and injuries.  It is the policy of Konoike E Street, Inc. to conduct all operations (including the ammonia refrigeration system) in a safe manner.  This policy extends to all employees and contractors at the facility.  Konoike E Street, Inc. implements this policy towards chemical and general safety through on going employee participation, training, written operating procedures, maintenance, inspections, safety committee meetings, and safety reviews/evaluations.  These programs are in effect at the facility to prevent the accidental release of ammonia.  In the event of an ammonia accident, the facility has an Emergency Action Plan to notify the appropriate authorities and safely evacuate the facility.\n\n\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nThe Konoike E Street, Inc. facility is located at 901 East E St. in Wilmington, California, which is located approximately 1.5 miles east of Highway 110 and 1 mile south of the Pacific Coast Highway.  The area immediately surrounding the facility is urban.  The entire facility was constructed in 2002 with operations starting in late November of the same year.  The area immediately surrounding the facility is industrial.\n\n\n\nThe primary business of the Konoike E Street, Inc. facility is to provide refrigerated warehousing and storage for various food products.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 24,000 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeratio"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000025050,
      "SummaryText": "n for the blast freezer, freezer and cooler storage rooms, and a dock area.  Typical operating conditions range from vacuum 1.6\" Hg on the low pressure side of the system to 166 psig on the high side of the system.\n\n  \n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n\n\n1) OSHA's Process Safety Management (PSM);\n\n2) EPA's Risk Management Program (RMP); and\n\n3) California Accidental Release Prevention Program (CalARP).  \n\n\n\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on site workers.  The following summarizes the key compliance programs that have been implemented by Konoike E Street, Inc. to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that process modifications are implemented in a safe manner.  The Pre Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Hot Work Permit program ensures that Konoike E Street, Inc.' employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\n\n\n\nIt is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia.  For exam"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000025050,
      "SummaryText": "ple, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  The facility has also installed ammonia sensors at strategic locations throughout the facility.\n\n\n\nRefrigeration Rooms A to H (8) & Dock (1):\n\n50 ppm    - Audible and visual alarms are activated.\n\n                 The Hinch system sends an email to the facility operators and the refrigeration contractor to \n\n                 indicate the zone.\n\n    \n\n150 ppm - 1) The King Solenoid valve and solenoid feed valves to the main liquid lines out of the Engine Room \n\n                   are closed.\n\n                2) The solenoid valves located on the evaporators in the area where the detection occurred will \n\n                   close.\n\n    \n\n900 ppm    - De-energizing of all equipment in the refrigerated area.\n\n                  The Refrigeration Control Panel will automatically send a signal to the alarm monitoring \n\n                  company.\n\n\n\nEngine Room (1):    \n\n50 ppm    - Audible and visual alarms are activated.\n\n    \n\n150 ppm - 1) The King Solenoid valve and solenoid feed valves to the Recirculator out of the Engine Room are \n\n                    closed.\n\n                 2) The exhaust fan is turned on.\n\n    \n\n900 ppm    - De-energizing of all equipment in the Engine Room.\n\n                  The Refrigeration Control Panel will automatically send a signal to the alarm monitoring \n\n                  company who then calls the fire department.\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nAn investigation into the facility's accident history conducted at the time of the Process Hazard Analysis Revalidation revealed that there have been two ammonia releases over the past five years (October 2006 to October 2011).  Neither release exceeded the Federal Reportable Quantity on 1"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000025050,
      "SummaryText": "00 lbs of ammonia.  On September 26, 2008, Jose Brann and David Salmeron noticed an ammonia vapor cloud in the engine room.  Mike Munoz immediately initiated the Emergency Response Program and evacuated the facility.  The vapor leak was caused by a faulty bonnet and packing on a screw compressor.  The total amount of ammonia released was 15 lbs of ammonia vapor.  No injuries resulted from this ammonia release.  In May 2011, the facility had a release of ammonia in the dock area and only the dock area was evacuated.  At the end of the night shift, warehouse workers noticed an ammonia smell during the defrost cycle.  The warehouse workers were sent home.  Upon investigation, it was determined that the leak was caused by a hole in a seal packing.  The total amount of ammonia lost was below 1 lb.  No injuries resulted from this ammonia release.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \n\n\n\n- save lives;\n\n- minimize and avoid injuries;\n\n- protect the environment; and\n\n- minimize property damage.\n\n\n\nSince facility personnel will not respond to an ammonia release at the facility that poses a health or safety threat, the Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM, RMP, and CalARP regulations.  Facility personnel receive annual training regarding the emergency procedures.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nThe Process Hazard Analysis Revalidation was conducted on October 26, 2011 to satisfy the five year update requirements.  The team involved in the development of the HAZOP made several procedural/managerial recommendations to improve safety at the facility.  The 2011 Process Hazard Analysis consisted of the following:\n\n\n\n- A review of the Process Hazard Analysis Requirements / Histo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000025050,
      "SummaryText": "ry (Overview / Training Session).\n\n- A detailed review of the recommended action items from the 2009 Three-Year Compliance Audit.\n\n- Process Flow Diagram Review / Equipment List Review\n\n- A detailed review of any changes to the ammonia refrigeration system since the 2006 Process Hazard Analysis study.\n\n- A discussion of any releases of ammonia since the 2006 Process Hazard Analysis study (review Incident Investigation forms).\n\n- Conduct HAZOP Study.\n\n- Completion of Emergency Response Action Plan, EPA Alert, Human Factors, External Events, and Hazard Assessment Verification checklists.\n\n\n\nThe Process Hazard Analysis Revalidation generated mitigation measures (recommendations to improve safety at the Konoike E Street, Inc. facility located in Wilmington, California.  The mitigation measures include additional training, key maintenance-related tests/inspections, and enhanced emergency response policies and procedures.  The Konoike E Street, Inc. safety committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  This analysis provided the mitigation measures outlined below to improve safety at the Konoike E Street, Inc. \n\n\n\nIn addition, the facility is planning to complete several items over the next year as their continue effort to provide safe work environment for Konoike E Street, Inc. employees in Wilmington, California.  These changes include the following items:\n\n\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n\n\n3. Continue employee involvement through safety team participation.\n\n\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n\n"
    }
  ]
}