{
  "FacilityID": 1000049388,
  "FacilityName": "ALTA VISTA COLD STORAGE",
  "FacilityStr1": "2557 ROAD 136",
  "FacilityStr2": null,
  "FacilityCity": "DELANO",
  "FacilityState": "CA",
  "FacilityZipCode": "93215",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.836389",
  "FacilityLongDecDegs": "-119.268889",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "FC",
  "FacilityURL": "WWW.ALTAVISTACS.COM",
  "FacilityEmailAddress": "INFO@ALTAVISTACS.COM",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ALDO RISI JR.",
  "OperatorStr1": "2557 ROAD 136",
  "OperatorStr2": null,
  "OperatorCity": "DELANO",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93215",
  "OperatorZipCodeExt": null,
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000205137",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-08-23 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": "Cold Storage",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061935,
      "AltID": "REFRIGERATION",
      "FacilityID": 1000049388,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000076196,
          "ProcessID": 1000061935,
          "ChemicalID": 56,
          "Quantity": 43720.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000063096,
          "ProcessID": 1000061935,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000051457,
              "Process_NAICS_ID": 1000063096,
              "SafetyReviewDate": "2014-10-29 00:00:00",
              "PHA_Date": "2014-10-29 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-12-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-10-29 00:00:00",
              "TrainingReviewDate": "2014-10-29 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-10-29 00:00:00",
              "EquipmentInspectionDate": "2015-03-24 00:00:00",
              "EquipmentTested": "Whole system",
              "ChangeMgmtDate": "2013-01-01 00:00:00",
              "ChangeMgmtReviewDate": "2014-10-29 00:00:00",
              "PreStartupReviewDate": "2013-04-10 00:00:00",
              "ComplianceAuditDate": "2014-10-29 00:00:00",
              "AuditCompletionDate": "2015-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-10-29 00:00:00",
              "HotWorkPermitReviewDate": "2014-10-29 00:00:00",
              "ContractorSafetyReviewDate": "2014-10-29 00:00:00",
              "ContractorSafetyEvalDate": "2014-10-29 00:00:00",
              "CBI_Flag": 0,
              "Description": "As a Process Safety Management facility, Alta Vista Cold Storage strives to maintain a compliant system, to protect both our employees and the environment.  Please see execsum.txt for more information.  Full documentation is available in the office of our cold storage manager.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000062939,
                  "PreventionProgram3ID": 1000051457,
                  "ProcessChemicalID": 1000076196
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000049388,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-10-29 00:00:00",
    "ERTrainingDate": "2015-05-11 00:00:00",
    "CoordinatingAgencyName": "Tulare County Environmental Health",
    "CoordinatingAgencyPhone": "5596247400",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000049388,
      "SummaryText": "Executive Summary                                         \n\nAlta Vista Cold Storage is committed to employee, public and environmental safety as  demonstrated by its Accidental Release Prevention program. This program addresses management practices in areas such as operating procedures, equipment maintenance, hazard analysis and employee training associated with the processes at our facility. \n\nIt is the policy of  Alta Vista Cold Storage to implement appropriate controls to prevent releases of regulated substances to the greatest extent possible.\n\n\n\nRegulated Substances    \n\nAnhydrous ammonia is present above threshold amounts at the cold storage facility.\n\n \n\nWorst-Case and Alternative Scenarios    \n\nA Process Hazard Analysis was conducted to determine the specific hazards associated with the anhydrous ammonia system. Several release scenarios were modeled: a Worst-Case scenario involving the total loss of inventory, an alternative high-pressure gas release (the most common cause of anhydrous ammonia releases nationwide), and a low-pressure liquid release.  Each scenario includes population impacts and a map showing the potential sphere of influence.\n\n\n\nAccidental Release Prevention Program and Chemical-Specific Prevention Steps    \n\nAlta Vista Cold Storage has taken all the necessary steps to comply with California's Accidental Release Prevention requirements set forth by CCR Title 19, Division 2, Chapter 4.5.  The following sections briefly describe the elements of Alta Vista Cold Storage's release prevention program for the cold storage facility.\n\n  \n\nProcess Safety Information\n\nAlta Vista Cold Storage maintains a detailed record of safety information that includes the chemical hazards, operating parameters and equipment designs associated with all processes. This documentation is available in the office of the Cold Storage Manager.\n\nProcess Hazard Analysis\n\nAlta Vista Cold Storage conducts comprehensive studies to ensure that hazards associated with the covered processes are identified and controll"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000049388,
      "SummaryText": "ed efficiently using the What If/Checklist methodology. The studies are conducted by a team of qualified personnel with expertise in engineering and process operations and are revalidated every five years. Any findings related to the hazard analysis are addressed and mitigated in a timely manner.\n\nOperating Procedures\n\nAlta Vista Cold Storage maintains written operating procedures to ensure maintenance and operation of the covered processes are conducted in a safe and efficient manner. These procedures address various modes of operation such as initial startup, normal, temporary and emergency operations, normal and emergency shutdown,  and startup after a shutdown. The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\nTraining\n\nAlta Vista Cold Storage has a comprehensive training program in place to ensure employees are competent to perform the operational duties, tasks and procedures  associated with the covered processes. Refresher training is provided at least annually and more frequently as needed. Training documentation is maintained in the main business office.\n\n \n\nMechanical Integrity\n\nTo ensure proper operation, Alta Vista Cold Storage performs highly documented maintenance checks on process equipment such as pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, compressors and pumps.  Maintenance operations are  performed by qualified personnel who have received training in maintenance practices.  Additional specialized training is provided as needed. Any identified equipment deficiency is corrected in a safe and timely manner.\n\nManagement of Change\n\nEstablished written procedures address managing changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly notified. Additional training is provided as required."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000049388,
      "SummaryText": "\n\nPre-Startup Safety Reviews\n\nPre-Startup Safety Reviews related to new processes and modifications to established processes are conducted on a regular basis to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\n\nAlta Vista Cold Storage conducts audits every three years to verify that the provisions set forth under the Risk Management Plan (RMP) rule are being implemented.   Any corrective actions identified in the audits are completed in a safe and timely manner.\n\nIncident Investigation\n\nAlta Vista Cold Storage promptly investigates any incident that has resulted in, or could reasonably result in, a catastrophic release of a regulated substance.  These investigations are conducted to identify the situation leading to the incident as well as any corrective actions to prevent a reoccurrence.  All reports are retained for a minimum of five years.\n\nEmployee Participation\n\nAlta Vista Cold Storage believes that process safety management and accident prevention is a team effort. Therefore, employees are encouraged to express their views concerning accident prevention issues and recommend improvements.  In addition, employees have access to all information associated with the facility's implementation of the RMP rule, including information resulting from Process Hazard Analysis.\n\nContractors\n\nContractors are utilized for specialized maintenance and construction activities. Prior to selecting a contractor, a thorough evaluation of their safety performance is conducted. Alta Vista Cold Storage has a strict policy of informing contractors of known potential hazards related to their work and the associated processes. Contractors are also informed of emergency response procedure should an accidental release of a regulated substance occur.\n\n\n\nFive-Year Accident History    \n\nAlta Vista Cold Storage has an excellent record of preventing accidental releases. As such, the"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000049388,
      "SummaryText": "re have been no accidental releases within the last five years.\n\n\n\nEmergency Response Plan    \n\nA written Emergency Response Plan addressing accidental releases of hazardous materials includes all aspects associated with emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. This Plan is promptly updated to reflect any pertinent changes that require a modified emergency response. Additionally, emergency response equipment is regularly inspected and serviced to ensure proper operation.  \n\n\n\nPlanned Changes to Improve Safety    \n\nThe implementation of the various elements of our Accidental Release Prevention program have identified that periodic safety inspections and ongoing employee training can be enhanced in order to improve safety at the facility. These changes are expected to be implemented by 12/1/2015.\n\n"
    }
  ]
}