{
  "FacilityID": 1000080380,
  "FacilityName": "COGEN TECHNOLOGIES LINDEN VENTURE, LP",
  "FacilityStr1": "c/o Phillips 66 Bayway Refinery",
  "FacilityStr2": "RAILROAD & CHEMICO AVENUE",
  "FacilityCity": "LINDEN",
  "FacilityState": "NJ",
  "FacilityZipCode": "07036",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34039",
  "LEPC": "LINDEN EMERGENCY RESPONSE COMM",
  "FacilityLatDecDegs": "40.632222",
  "FacilityLongDecDegs": "-074.215556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 932949589,
  "ParentCompanyName": "EAST COAST POWER LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "COGEN TECH. LINDEN VENTURE, LP",
  "OperatorStr1": "P.O. BOX 4400",
  "OperatorStr2": null,
  "OperatorCity": "LINDEN",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "07036",
  "OperatorZipCodeExt": null,
  "RMPContact": "Peter Geissler",
  "RMPTitle": "VP Operations and Maintenance",
  "FTE": 60,
  "OtherEPAFacilityID": "NJD986632610",
  "EPAFacilityID": "100000064324",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "BOP130001",
  "SafetyInspectionDate": "2019-03-11 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 40.64014,
  "FRS_Long": -74.21888,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100348,
      "AltID": "AQUEOUS AMMONIA SYSTEM",
      "FacilityID": 1000080380,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101597,
          "ProcessID": 1000100348,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125695,
          "ProcessID": 1000100348,
          "ChemicalID": 57,
          "Quantity": 156172.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625695,
          "ProcessID": 1000100348,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080380,
      "SummaryText": "Cogen Technologies Linden Venture\n\nProgram 2 Executive Summary\n\n\n\nSystem Description\n\n\n\nCogen Technologies Linden Venture (Linden Cogen) owns a 895 megawatt (MW) cogeneration plant in Linden, Union County, New Jersey. The plant is located wholly within the Phillips 66 Bayway Refinery. North American Energy Services (NAES) has been contracted by Linden Cogen to operate the facility. This facility has been in operation since 1992. The land use immediately surrounding the facility is industrial.\n\n\n\nLinden Cogen's facility combusts natural gas in six GE Frame 7 combustion turbines to generate electricity. Each combustion turbine is equipped with a heat recovery steam generator (HRSG) that utilizes waste heat from the exhaust to convert water to steam. The steam from each HRSG is combined to drive three steam turbines. Electricity is generated at the gas turbines and the steam turbines. Steam is also piped to offsite industrial facilities. A State-mandated selective catalytic reduction (SCR) system is located within each HRSG to reduce nitrogen oxide (NOx) emissions from the combustion turbine exhaust gas. The SCR consists of a catalyst and injection grid within the HRSG. Ammonia gas is injected through the grid upstream of the catalyst. The ammonia mixes with the exhaust gas, and as the exhaust/ammonia mixture passes through the catalyst, NOx emissions are reduced to nitrogen and water.\n\n\n\nExisting Risk Management Activities\n\n\n\nThe ammonia system has been regulated under New Jersey's Discharge Prevention regulations (NJAC 7:1E) since 1992. These regulations have required the development of plans and procedures to reduce the risks of releases of hazardous substances. The elements of these programs include standard operating procedures, training, maintenance, and emergency response.\n\n\n\nLinden Cogen has also implemented environmental programs and procedures to ensure compliance with all applicable environmental regulations. These programs and procedures, maintained in manu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080380,
      "SummaryText": "als at the plant, are kept up to date and available to all plant personnel. The programs consist of the environmental permits and plans required to operate the facility. In addition to these programs, Linden Cogen also maintains an EHS program. Elements of the Linden Cogen program include hazard work permits, employee training, and general safety procedures. Linden Cogen is also ISO 9000 certified.\n\n\n\nIn summary, Linden Cogen has developed, implemented, and maintained environmental programs to ensure that risks associated with all plant operations are minimized and employees, nearby populations, and the environment are protected.\n\n\n\nRisk Management Program Summary\n\n\n\nThe Linden Cogen Facility Manager has overall responsibility for maintaining the risk management program. Responsibilities for specific program elements are shared among Linden Cogen and East Coast Power LLC (Linden Cogen's parent company).\n\n\n\nSafety information is maintained at the facility. As there have been no changes to the ammonia system since plant start-up, modifications to the safety information have been minimal. Operating procedures have been implemented at the facility and address the possible operating conditions of the ammonia system. A maintenance program is in place and consists of maintenance procedures, testing and inspection schedules, and a work order system that initiates and tracks work and inspections performed on the ammonia system.\n\nHot works procedures along with other hazard permits (general work permit, lockout/tagout, etc.) exist at the plant and are applicable to all plant work. Contractors working on the ammonia system or any plant equipment/system are required to comply with the facility's contractor safety program. Currently, there are no planned changes to improve safety under consideration.\n\nAll facility personnel must complete initial and refresher training on procedures applicable to their position. All operators and maintenance personnel undergo a qualification proc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080380,
      "SummaryText": "ess which addresses ammonia system operating procedures and/or maintenance procedures along with emergency response training.\n\nAdministrative personnel must undergo emergency response training.\n\n\n\nCompliance audits will be conducted on an annual basis because the NJ TCPA RMP program 2 has to follow program 3 requirements. These audits will consist of a risk management program audit and a safety review of the ammonia system. The program audit will review the risk management program and procedures to ensure the program is being implemented. The ammonia system safety review will consist of an audit of the ammonia system and operating procedures and interviews with plant personnel to ensure that the ammonia system is designed and operated in accordance with the appropriate safety information.\n\n\n\nEmployee participation has always been implemented at the facility. Employees are included in hazard reviews and incident investigations even though it is not a requirement of the RMP regulations. In addition, employees conduct self-assessments (plant audits conducted by employees), hold monthly safety meetings and daily safety talks, conduct annual drills and participate in safety committees. Incident investigation procedures have been implemented at the facility since start up.\n\n\n\nA hazard review was conducted in 2013. The hazard review identified the hazards associated with the process, opportunities for equipment malfunctions or human errors that could cause an accidental release, safeguards used or needed to control the hazards or prevent equipment malfunctions or human error, and steps used or needed to detect or monitor releases. Once the hazard review was completed, a list of recommendations was developed and reviewed by plant personnel and management. The recommendations have been implemented at the site to further reduce the risk associated with the aqueous ammonia system.\n\n\n\nThere have been no accidents or releases from the ammonia system within the last five years.\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080380,
      "SummaryText": "\n\nEmergency Response\n\n\n\nAn emergency response program has been implemented at the facility since the plant's construction. The emergency response program includes an emergency response plan and coordination of emergency information and activities with the Linden Fire Department. The emergency response plan contains the information and procedures necessary to respond to a release of any hazardous material at the site. The shift supervisor at the facility is the Emergency Coordinator, as necessary. The facility runs 24/7 with 4 shifts. In addition to Justin Krempecki listed in Section 1.8(a), the other shift supervisors are Philip Esteves, John Buchman and Patrick Neilan.\n\n\n\nEmergency information includes a list of emergency response personnel, notification requirements, evacuation procedures, and health/first aid data. Linden Cogen has confirmed with the Linden Fire Department that personnel and equipment necessary to respond to a release of a hazardous substance at the site will be provided. Coordination with the fire department has included providing a copy of the emergency response plan. The fire department has taken part in plant emergency response drills and drill critiques. Linden Cogen also contributes emergency equipment to the fire department. In addition to emergency drills, the fire department tours the facility to familiarize its personnel with plant operations and the locations of potential hazards. In addition, plant personnel are trained in the procedures necessary to respond to emergency releases.\n\n"
    }
  ]
}