{
  "FacilityID": 1000067678,
  "FacilityName": "Corning Incorporated, Concord Facility",
  "FacilityStr1": "14556 Highway 601 South",
  "FacilityStr2": null,
  "FacilityCity": "Midland",
  "FacilityState": "NC",
  "FacilityZipCode": "28107",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37025",
  "LEPC": "Cabarrus County Emergency Serv",
  "FacilityLatDecDegs": "35.215000",
  "FacilityLongDecDegs": "-080.524444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AS",
  "FacilityURL": "corning.com",
  "FacilityEmailAddress": "haleytd@corning.com",
  "FacilityDUNS": 3938586,
  "ParentCompanyName": "Corning Incorporated",
  "Company2Name": null,
  "CompanyDUNS": 3938586,
  "Company2DUNS": 3938586,
  "OperatorName": "Corning Incorporated",
  "OperatorStr1": "P.O. Box 1700",
  "OperatorStr2": null,
  "OperatorCity": "Concord",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28026",
  "OperatorZipCodeExt": "1700",
  "FTE": 840,
  "OtherEPAFacilityID": "NC0002223329",
  "EPAFacilityID": "100000162753",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "08436T16",
  "SafetyInspectionDate": "2017-12-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-02-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-01-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-01-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-01-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 35.21619,
  "FRS_Long": -80.51783,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000084896,
      "AltID": "Chlorine Process",
      "FacilityID": 1000067678,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000105924,
          "ProcessID": 1000084896,
          "ChemicalID": 62,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000086078,
          "ProcessID": 1000084896,
          "NAICSCode": "327212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000071675,
              "Process_NAICS_ID": 1000086078,
              "SafetyReviewDate": "2019-07-12 00:00:00",
              "PHA_Date": "2017-12-14 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-03-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 1,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-11-17 00:00:00",
              "TrainingReviewDate": "2019-07-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-07-12 00:00:00",
              "EquipmentInspectionDate": "2019-07-12 00:00:00",
              "EquipmentTested": "Piping, connections, and associated equipment in the optical waveguide process area (leak testing)",
              "ChangeMgmtDate": "2020-07-15 00:00:00",
              "ChangeMgmtReviewDate": "2019-07-12 00:00:00",
              "PreStartupReviewDate": "2020-12-05 00:00:00",
              "ComplianceAuditDate": "2019-07-12 00:00:00",
              "AuditCompletionDate": "2020-12-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2019-07-12 00:00:00",
              "HotWorkPermitReviewDate": "2019-07-12 00:00:00",
              "ContractorSafetyReviewDate": "2019-07-12 00:00:00",
              "ContractorSafetyEvalDate": "2019-07-12 00:00:00",
              "CBI_Flag": 0,
              "Description": "The Corning Concord facility is committed to a proactive prevention program as it relates to the storage and usage of the RMP/PSM covered process involving Chlorine. This program entails Administrative controls as well as every feasible engineering control available that will assist with prevention. Listed below is a summary of the proactive control measures.\n\n\n\n-A written and implemented RMP program that meets and(or) exceeds EPA 40 CFR requirements.\n\n-A written and implemented PSM program that meets and(or) exceeds OSHA 29 CFR 1910.119 requirements.\n\n-Internal RMP and PSM program compliance audits conducted annually.\n\n-Third party RMP and PSM program compliance audits conducted at least every three years and and fully revalidated every five years\n\n-A proactive RMP and PSM compliance team that provides diverse representation on PHAs, PSSR, MOC, Compliance Audits, and 5-Year Revalidation's. This team is made up of Process Engineers with backgrounds in Electrical, Mechanical, Chemical Engineering as well as EH&S, Middle/Upper Managment, Chemical Technicians, and Facilities/Maintenance.\n\n-State of the art process equipment materials that meets and(or) exceeds the Chlorine Institute recommendations. This includes a redundant scrubber system design to mitigate a worst case scenario release. Additionally, the facility has >300 CL2 static sensors that detect minute releases that lead to a proactive response from an EPA Level 3 / OSHA 1910.120(q) HAZMAT TechnicianTrained ERT.  ",
              "_chemicals": [
                {
                  "PrimaryKey": 1000089012,
                  "PreventionProgram3ID": 1000071675,
                  "ProcessChemicalID": 1000105924
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000067678,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2017-12-13 00:00:00",
    "ERTrainingDate": "2018-01-19 00:00:00",
    "CoordinatingAgencyName": "Midland Vol. Fire Department",
    "CoordinatingAgencyPhone": "7048881357",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067678,
      "SummaryText": "RISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n40 CFR 68.155\n\nFOR\n\nCORNING INCORPORATED\n\nCONCORD FACILITY\n\n\n\nJANUARY 2018\n\nThe executive summary listed below is a comprehensive overview of the RMP / PSM covered process at the Corning Concord facility. After a detailed review, it was determined there are no changes in the executive summary for 2018 verses the previous summary written in 2013. The information in the summary precisely reflects the current covered process.\n\n\n\n\n\n\n\nTABLE OF CONTENTS\n\n\n\n1.0     Accidental Release Prevention and Emergency Response Policies (40 CFR 68.155(a))\n\n\n\n2.0     Stationary Source and Regulated Substances Handled (40 CFR 68.155(b))\n\n\n\n3.0     REMOVED 2007 - Worst-case and Alternative Release Scenarios (40 CFR 68.155(c))  \n\n\n\n4.0     General Accidental Release Prevention Program and Chemical Specific Prevention Steps (40 CFR 68.155(d))\n\n\n\n5.0     Five-Year Accident History (40 CFR 68.155(e))\n\n\n\n6.0     Emergency Response Program (40 CFR 68.155(f))\n\n\n\n7.0     Planned Changes to Improve Safety (40 CFR 68.155(g))\n\n\n\n\n\n\n\n\n\n1.0     Accidental Release Prevention and Emergency Response Policies (40 CFR 68.155(a))\n\n\n\nThe accidental release prevention policy for the Corning Incorporated, Midland North Carolina Plant (Corning Concord) involves a unified approach that integrates technology, procedures and management practices.  Corning Concord's prevention program complies with all applicable U.S. EPA Risk Management Program (RMP) Prevention Program regulations codified under 40 CFR 68.\n\n\n\nManagement System\n\n\n\nCorning Concord maintains a management system to oversee the implementation of and compliance with all elements of the RMP regulations.  This management system, along with other Corning Concord policies, provides a means to eliminate and/or reduce the potential for hazardous chemical releases at the plant.\n\n\n\nPrevention Program Level 3\n\n\n\nCorning Concord is a Program 3 facility.  Therefore, Corning Concord's prevention program provides for policies, procedures, and syst"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067678,
      "SummaryText": "ems that address all elements of the RMP concerning Program Level 3 facilities and implementation procedures.  Corning Concord's prevention program also addresses the Occupational Safety and Health Administration's (OSHA) Process Safety Management (PSM) Program elements, which are similar to those required by the RMP regulations.  The prevention program in place for the facility is maintained in Corning Concord's Process Information Management System (PIMS) document control system.\n\n\n\n\n\n\n\n\n\n2.0     Stationary Source and Regulated Substances Handled (40 CFR 68.155(b))\n\n\n\nSite Description\n\n\n\nThe 155-acre Corning Concord plant site is owned and operated by Corning Incorporated, Telecommunications Products Division.  The site is located at 14556 Highway 601 South, Midland, Cabarrus County, North Carolina.  The Corning Concord plant currently employs approximately 550 full-time employees engaged in the manufacture of fiber optics.  \n\n\n\n\n\nRegulated Substance\n\n\n\nChlorine is the only regulated substance at the plant that exceeds the threshold quantity listed in 40 CFR 68; therefore, chlorine is the only substance at the plant for which the RMP regulations apply.  The chlorine storage and distribution system is contained in a specially designed process building.  The majority of the chlorine utilized at the facility is contained with the Bulk Chlorine Storage Building that is equipped with vent make-up and exhaust scrubber systems.  The chlorine process was installed as part of the fiber optic manufacturing process.  Chlorine is received, stored and distributed to four (4) control panels.\n\n\n\nChlorine is a halogen with the formula Cl2 and serves as a chlorinating or oxidizing agent.  Chlorine is an Environmental Protection Agency (EPA) and OSHA listed toxic chemical, an irritant, and a corrosive substance.  Chlorine is not a carcinogen or a flammable substance.  OSHA's ceiling Permissible Exposure Limit (PEL) for chlorine is 1 ppm.  The National Fire Protection Association (NFPA"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067678,
      "SummaryText": ") lists chlorine with a health rating of 4 (severe) with immediate and delayed health hazards.  \n\n\n\n\n\n\n\n\n\n3.0     REMOVED 2007 - Worst-case and Alternative Release Scenarios (40 CFR 68.155(c))  \n\n\n\n\n\n\n\n\n\n4.0     General Accidental Release Prevention Program and Chemical Specific Prevention Steps (40 CFR 68.155(d))\n\n\n\nGeneral Accidental Release Prevention Program\n\n\n\nThroughout the facility many elements of the prevention program are used for all operations.  Overviews of the program are as follows.\n\n\n\nCorning Concord keeps detailed process safety information on all operations.  The PIMS document control system is an integral part of the management of change for all facility operation\n\n\n\nEmployee training is ongoing in all plant areas and is the backbone of employee knowledge and job operations.  Employee training in operations and maintenance provides an awareness of the hazardous and toxic properties of all chemicals used on-site.  \n\n\n\nMaintenance and preventative maintenance are implemented in all facility operations to ensure the mechanical integrity of each piece of equipment.\n\n\n\nIncident investigations of accidents and potential accidents allow learning from each incident as well as provide corrective actions for each incident.  Environmental Non-conformance reports are completed if a chemical was involved.\n\n\n\nEmployees participate in all aspects of the plant as listed under the Emergency Response Program.\n\n\n\nSafe work practices used throughout the facility include Hot Work Permits, Lock-Out/Tag-Out Permits, Vessel Entry Permits, Site Security, and Breaking into Chemical Lines.\n\n\n\nContractors must meet Corning Concord's high safety and technical standards as part of contractor selection and ongoing contractor evaluations.  Also, Corning Concord requires training of contractors in their specific work locations.\n\n\n\n\n\nChemical Specific Prevention Steps\n\n\n\nChemical specific prevention features of the Corning Concord facility include those listed previously, as well as, th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067678,
      "SummaryText": "e following features specific to the chlorine process.  \n\n\n\nSpecific response procedures for the operation of the chlorine building.\n\n\n\nCompletion of a Pre-Startup Safety Review prior to the start up of the chlorine system.  \n\n\n\nSpecific emergency response procedures for chlorine releases as provided under the Emergency Response Program.\n\n\n\nSpecific employee training in the properties, hazards, handling requirements, and leak repair for chlorine.\n\n\n\nKnowledge and records of the facility and equipment design lead to the safe operations of the chlorine system.\n\n\n\nFacility Design\n\n\n\nThe facility and support equipment of the chlorine storage and control building meet and exceed design code standards and good engineering practices.  The building is equipped with temperature controls and make-up vents.  The building is operated under negative pressure created by the vent scrubber.  There are two (2) modes of vent operations:  normal and emergency.  In the event of a chlorine release, the vent system doubles the air turnover through the building.  \n\n\n\nRedundant system.\n\n\n\nEquipment Design\n\n\n\nThe chlorine piping system is constructed of Hastelloy metal tubing.  This tubing is both compatible with chlorine (non-corrosive) and rated to 1,500 psig.  The maximum pressure of the chlorine is only 150 psig allowing for a 10 to 1 safety margin.  There is a chlorine monitor that detects the presence of chlorine in the storage building.  The monitor, along with the other plant detection systems, will alarm to alert employees of a potential chlorine release.\n\n\n\n\n\n\n\n5.0     Five-Year Accident History (40 CFR 68.155(e))\n\n\n\nPer 40 CFR 67.42(s), no accidental releases of chlorine meeting reportable accident guidelines have occurred at the Corning Concord site over the last five (5) years.\n\n\n\n\n\n\n\n\n\n6.0     Emergency Response Program (40 CFR 68.155(f))\n\n\n\nEmergency response procedures are contained in the facility's Contingency Plan (Emergency Response Plan).  The plan includes an emergency respo"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000067678,
      "SummaryText": "nse decision tree and an emergency notification plan.  Emergency response drills and drill evaluations are conducted once every month by the Operating Department and once every quarter by the Safety Department.  Emergency operation and response procedures are reviewed at each emergency response drill evaluation.  \n\n\n\nThe Contingency / Emergency Response Plan is coordinated with and reviewed by Cabarrus County Emergency Services (LEPC member) and the Midland Volunteer Fire Department.  Copies of the program are given to local key agencies such as fire, medical, rescue, waste management and police departments in Cabarrus County.  Aside from the specific contingency/emergency response plan, key elements of the prevention programs are incorporated into the operating culture of the Corning-Concord facility.\n\n\n\nThe Contingency/Emergency Response Plan procedures detail the actions and responses to releases of chlorine.  The plan includes training of all operators in chlorine areas, a primary response team, and back-up response team.  Training is included for responding to catastrophic, severe, and moderate releases of chlorine.  A chlorine kit is maintained on site to stop leaks.\n\n\n\n\n\nPersonnel\n\n\n\nPersonnel are the key resources of Corning-Concord's prevention program.  Employees make up the operators and emergency response teams.  Corning Concord fosters a high level of involvement in every aspect of chlorine system operations, including participation in the following.\n\n\n\nChlorine safety teams\n\nDevelopment of the operating procedures\n\nHazard evaluations \n\nOn-going training of the operators and other involved staff.\n\n\n\n\n\n\n\n\n\n7.0     Planned Changes to Improve Safety (40 CFR 68.155(g))\n\n\n\n\n\nThe Corning Concord facility started manufacturing operations during the summer of 1999.  To date, there have been no recommended actions on the current safety information complying with the RMP and PSM programs.  Corning Concord continually reviews implemented and potential safety improvem"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000067678,
      "SummaryText": "ents for all its operations."
    }
  ]
}