{
  "FacilityID": 1000012210,
  "FacilityName": "Covanta Stanislaus, Inc. (CSI)",
  "FacilityStr1": "P.O. Box 278",
  "FacilityStr2": "4040 Fink Road",
  "FacilityCity": "Crows Landing",
  "FacilityState": "CA",
  "FacilityZipCode": "95313",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.390833",
  "FacilityLongDecDegs": "-121.076389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Covanta Energy Group",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Covanta Stanislaus, Inc. (operator)",
  "OperatorStr1": "P.O. Box 278",
  "OperatorStr2": "4040 Fink Road",
  "OperatorCity": "Crows Landing",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95313",
  "OperatorZipCodeExt": null,
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000066536",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "N-2073-1",
  "SafetyInspectionDate": "2013-11-12 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-01-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-01-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-01-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.38538,
  "FRS_Long": -121.14088,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000015063,
      "AltID": "DeNOx System",
      "FacilityID": 1000012210,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000017608,
          "ProcessID": 1000015063,
          "ChemicalID": 56,
          "Quantity": 67750.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000015386,
          "ProcessID": 1000015063,
          "NAICSCode": "562213",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000012328,
              "Process_NAICS_ID": 1000015386,
              "SafetyReviewDate": "2014-05-22 00:00:00",
              "PHA_Date": "2014-05-22 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-05-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-02-13 00:00:00",
              "TrainingReviewDate": "2014-01-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-05-22 00:00:00",
              "EquipmentInspectionDate": "2014-05-22 00:00:00",
              "EquipmentTested": "Storage tank and vaporizer",
              "ChangeMgmtDate": "2014-04-11 00:00:00",
              "ChangeMgmtReviewDate": "2014-05-22 00:00:00",
              "PreStartupReviewDate": "2014-05-22 00:00:00",
              "ComplianceAuditDate": "2013-11-12 00:00:00",
              "AuditCompletionDate": "2014-03-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-05-22 00:00:00",
              "HotWorkPermitReviewDate": "2014-05-22 00:00:00",
              "ContractorSafetyReviewDate": "2014-05-22 00:00:00",
              "ContractorSafetyEvalDate": "2013-11-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000014615,
                  "PreventionProgram3ID": 1000012328,
                  "ProcessChemicalID": 1000017608
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000012210,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-05-22 00:00:00",
    "ERTrainingDate": "2014-01-28 00:00:00",
    "CoordinatingAgencyName": "SCDER",
    "CoordinatingAgencyPhone": "2095256700",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012210,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\n1.1\tACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICY SUMMARY\r\n\r\nThe California Accidental Relase Prevention (CalARP) Program includes The United States Environmental Protection Agency (USEPA) regulatory program with certain additions specific to the state to prevent accidental releases of certain regulated substances that may potentially affect public health and the environment. The Californa Code of Regulations, Title 19, Division 2 Chapter 4.5 requires that facilities in Californa and and rule (40 CFR Part 68) requires facilities across the United States in various industries develop a Risk Management Program (RMP). The RMP incorporates various required elements into a program designed to prevent accidental releases of regulated substances and establish emergency response preparedness in the event of an accidental release of such regulated substances.  RMPs must be submitted to the the regulating California Certified Unified Protection Agency (CUPA) and USEPA by the owner or operator of any facility that has a process containing more than a threshold quantity of any of the regulated substances that is covered under the RMP rule. Pursuant to the RMP rule, Covanta Stanislaus, Inc. (\"CSI\" or \"the Facility\") has submitted this RMP for anhydrous ammonia.  CSI has Sulfuric Acid above the CalARP Reportable Quantity, but the facility is not required to include Sulfuric Acid in the RMP because it is exempt as specified in Table 3, Foot Note 7 of the CalARP regulations.\r\n\r\nAnhydrous ammonia is a commonly used chemical with various applications in industry and agriculture. By volume, anhydrous ammonia is the fourth largest industrial chemical produced over 80% of which goes to agricultural fertilizers.  In addition to anhydrous ammonias application as a fertilizer in crop production, some other common uses for anhydrous ammonia include: air pollution control system reagent, food production and processing, textile and chemical manufacturing, re"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012210,
      "SummaryText": "frigeration (such as refrigerated warehouses) and metal treating.   \r\n\r\nAnhydrous ammonia is used at Covanta Stanislaus, Inc. exclusively as a reagent in the facility's nitrogen oxide (NOx) control system. The NOx control system is an important part of the Facility's air pollution control equipment that reduces nitrogen oxides to within permitted limits. Nitrogen oxides are pollutants that contribute to acid rain and photochemical smog. Nitrogen oxide (NO) is a colorless gas produced during high temperature combustion.  In ambient air, nitrogen oxide is oxidized to nitrogen dioxide (NO2). Nitrogen dioxide reacts with water in ambient air to form nitric acid, which contributes to the formation of acid rain; and, nitrogen oxides also contribute to the formation of photochemical smog by reacting with sunlight to form ozone (O3) in the atmosphere. The Facility's NOx control system reduces nitrogen oxides by the injection of anhydrous ammonia into the furnace section of the boilers.  In the boilers, a reaction takes place between the anhydrous ammonia, nitrogen oxide and oxygen. The resulting products of this reaction are the major components in the air we breathe, nitrogen gas (N2), oxygen and water. A significant environmental benefit is achieved through the use of anhydrous ammonia in the operation of the NOx control system. \r\nCSI operates the Facility, which is located in Crows Landing, California in a manner that is protective of the health and safety of CSI employees, contractor employees, the public and the environment. In addition, the Facility operates in compliance with applicable California Occupational Safety and Health Administration (Cal/OSHA) requirements, federal regulatory requirements and applicable state and/or local requirements.\r\n\r\nCSI previously developed a Cal/OSHA Process Safety Management (PSM) Program for anhydrous ammonia. The Cal/OSHA PSM rule guides employees in the preventive maintenance, safe management and operation of processes that use r"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012210,
      "SummaryText": "egulated substances, and aims to protect employees from accidental releases of these materials onsite. The USEPA's RMP regulation builds and expands upon the Cal/OSHA PSM program by requiring facilities to evaluate offsite impacts to public and environmental receptors, in the event of an accidental release. Key elements of the Cal/OSHA PSM program have been incorporated into the USEPA RMP regulation.\r\n\r\nAs part of the USEPA RMP effort, CSI has updated the Cal/OSHA PSM program for anhydrous ammonia and the associated Process Hazard Analysis (PHA). Among the other important components of the RMP are systems of policies and procedures for operation and maintenance of the facility, and the facility-specific Emergency Action Plan (EAP). CSI has operated the regulated process for a number of years now without a release due to these solid preventive maintenance programs, safe design and operating practices, and established training programs.  \r\n\r\nThe Facility Manager has the primary responsibility for this RMP and its implementation.\r\n\r\n\r\n1.2\tSTATIONARY SOURCE DESCRIPTION\r\n\r\nThe CSI facility is a waste-to-energy (WTE) facility that burns municipal solid waste and recovers steam to produce electricity. Each day, this WTE facility converts approximately 800 tons municipal solid waste from Stanislaus County and the City of Modesto into electricity.\r\n\r\nOne process at the Facility involves the use of a substance regulated under 40 CFR Part 68, thereby requiring the preparation and implementation of an RMP. This covered process is the NOx control system (discussed in Section 1.1 above), which utilizes anhydrous ammonia injection for NOx control. Anhydrous ammonia is the reagent utilized in the Facility's NOx control system in order to significantly reduce nitrogen oxide emissions, as discussed above. \r\n\r\nAnhydrous ammonia is stored under pressure at the Facility. Administrative controls are used to limit the tank capacity to 87%.\r\n\r\nBoth passive and active mitigation measures ar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012210,
      "SummaryText": "e used by the Facility to limit the likelihood and/or severity of an accidental release of anhydrous ammonia.  Passive mitigation systems do not require human, mechanical or energy input. An example of such passive mitigation is a concrete containment dike, which is installed around the storage tank and vaporizer area.  Conversely, active mitigation systems do require human, mechanical or energy input for initiation.  Leak detectors and alarms, excess flow valves, pressure relief valves, emergency shut-off devices and a water deluge system are examples of the active mitigation systems in place at the Facility. \r\n\r\n1.3\tWORST CASE AND ALTERNATIVE CASE ACCIDENTAL RELEASE SCENARIOS\r\n\r\nA summary of the off-site consequence analysis (OCA) for the worst-case and alternative release scenarios is no longer required to be included in the executive summary.  While the RMP rule originally required that the executive summary briefly describe the OCA for the worst-case and alternative release scenarios, the USEPA amended the RMP rule in 2004 to remove this requirement because of security concerns.\r\n\r\n\r\n1.4\tACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\r\nThe Facility has an accidental release prevention program that is based upon a foundation of employee awareness and proactive system maintenance. This program is documented in the RMP, and meets the requirements of the RMP regulation.\r\n\r\n\tThe Facility provides process safety information to employees through written materials, such as Material Safety Data Sheets, various operating and maintenance manuals, system descriptions and safety procedures.  Employees attend periodic training and contractors are briefed on process hazards prior to working onsite. Preventive maintenance and regular inspections are conducted for maintaining mechanical integrity. Inspections and testing are scheduled through the preventive maintenance program. Hazard analysis documents are reviewed periodically and updated as required. Compliance audits are used to ev"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000012210,
      "SummaryText": "aluate the need for revising or updating the procedures related to the processes.\r\n\r\n\r\n1.5\tFIVE-YEAR ACCIDENT HISTORY\r\n\r\nFor the five years prior to the submission of this RMP, there have been no accidental releases, as defined in 40 CFR Part 68.42(a) and 29 CCR 2750.09, at the Facility, which resulted in injuries or death to onsite (i.e., Facility or contractor employees) or offsite (i.e., the public). Since there has not been an accidental release, there has not been a need for sheltering in place or evacuation; nor has damage to property or environmental receptors ever occurred as a result of an accidental release. In fact, CSI has operated the Facility in the safest possible manner since it has commenced operations.\r\n\r\n\r\n1.6\tEMERGENCY RESPONSE PROGRAM\r\n\r\nThe Facility does not have Emergency Response capability, but it does have an Emergency Action Plan (EAP) that defines the sequence of actions to be taken by CSI employees in the event of an accidental release of anhydrous ammonia. This EAP has been communicated to the Stanislaus County Department of Environmental Resources (SCDER). Employees who are likely to witness or discover a release have been trained to initiate an emergency response sequence by notifying the Control Room Operator, who will then make the proper notifications to public response agencies. The Facility Hazardous Materials Management Business Plan (HMMBP) \"Evacuation Plan and Procedures\" specifically identifies steps to be taken during an ammonia release, including who to call and who/how to manage the event.\r\n\r\nIt is currently CSI's policy that the Facility has received the requisite training and will attempt to secure a release of anhydrous ammonia if the action can be taken without significant risk of injury or death. The Stanislaus County Department of Environmental Resources (SCDER) is presently responsible for determining when sheltering-in-place or evacuation of off-site areas is necessary, and also for public notification.  The SCDER"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000012210,
      "SummaryText": "is the overall Emergency Response leader for the County.\r\n\r\n\r\n1.7\tPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe RMP incorporates the Facility's existing procedures, which are designed to improve employee safety awareness and enhance safe operations. Further, emergency action procedures have been reviewed and coordinated with local response entities to increase the speed and effectiveness of a response should a release occur."
    }
  ]
}