{
  "FacilityID": 1000104556,
  "FacilityName": "Thermo No. 1 BE-01, LLC Facility",
  "FacilityStr1": "7966 W Southside Rd",
  "FacilityStr2": null,
  "FacilityCity": "Milford",
  "FacilityState": "UT",
  "FacilityZipCode": "84751",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49001",
  "LEPC": "Beaver County LEPC",
  "FacilityLatDecDegs": "38.160264",
  "FacilityLongDecDegs": "-113.194847",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "AO",
  "LatLongDescription": "PG",
  "FacilityURL": "www.cyrqenergy.com",
  "FacilityEmailAddress": "info@cyrqenergy.com",
  "FacilityDUNS": 809190684,
  "ParentCompanyName": "Cyrq Energy",
  "Company2Name": null,
  "CompanyDUNS": 97897404,
  "Company2DUNS": null,
  "OperatorName": "Thermo No. 1 BE-01, LLC",
  "OperatorStr1": "P.O. Box 11",
  "OperatorStr2": null,
  "OperatorCity": "Minersville",
  "OperatorStateFIPS": "UT",
  "OperatorZipCode": "84752",
  "OperatorZipCodeExt": null,
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000221164",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-02-21 00:00:00",
  "SafetyInspectionBy": "Insurance Boiler Inspector",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-03-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-03-15 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-03-15 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-03-15 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 38.160264,
  "FRS_Long": -113.194847,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-OTHER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000130360,
      "AltID": "Isopentane, motive fluid",
      "FacilityID": 1000104556,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000163496,
          "ProcessID": 1000130360,
          "ChemicalID": 115,
          "Quantity": 86790.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131736,
          "ProcessID": 1000130360,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104556,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Beaver County LEPC",
    "CoordinatingAgencyPhone": "4353872620",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000104556,
      "SummaryText": "ach employee presently involved in the operating process or newly assigned to the process.  The training included emphasis on the specific safety and health hazards of the process, emergency operations including shutdown and other safe work practices that apply to the employee\u0092s job tasks.\n\nRefresher training has occurred on the three (3) year audit cycle and the five (5) year PHA update.  Thermo No. 1 will continually evaluate and determine if training should be performed more often to ensure that each employee involved in the operating process adheres to the current operating procedures.\n\nComprehension and understanding of initial and refresher training will be evaluated either through written or verbal tests/quizzes or by hands-on demonstrations.  A record of each employee\u0092s attendance and comprehension of the training is kept on file.  \n\nThis section complies with 29 CFR 1910.119(g) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n6)   CONTRACTORS\n\nThermo No. 1 along with Cyrq Corporate will use an evaluation process to select contractors that are working on or near the process to ensure they have effective safety programs and performance.  Contractors will also be informed of the potential hazards involved in the process and the appropriate emergency action plans.  Contractor control and site access will be granted only upon an understanding of Thermo No. 1 EHS policies, procedures and practices.\n\nThe contractor must ensure that each contract employee is trained in the work practices necessary to perform their job safely, and in any potential hazards on the site.  The contractor must document that each contract employee has received and understood the training.\n\nThe contractor must also ensure that each contract employee follows the EHS procedures and rules of Thermo No. 1, including the required work practices and the operating procedures addressed in section 5.  The contractor must also advise Thermo No. 1 of any unique hazards presen"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104556,
      "SummaryText": "CHAPTER 1\n\nEXECUTIVE SUMMARY\n\n1.1   INTRODUCTION and PROCESS DESCRIPTION\n\nThermo No. 1 BE-01, LLC (\"Thermo No. 1\"), a wholly-owned subsidiary of Cyrq Energy is a binary cycle geothermal power generation plant.  In the power generation process, iso-pentane is used as the binary working fluid.  Due to the chemical characteristics of iso-pentane and the quantities stored and used on site, it qualifies as a regulated substance under the provisions of Title 40, Code of Federal Regulations, Part 68 - Chemical Accident Prevention Provisions and the establishment of a Risk Management Plan or RMP.\n\nThe purpose of this RMP is to assist Thermo No. 1 with preventing or minimizing the consequences of accidental releases of vapors, flammable, or explosive substances that could cause harm to the surrounding public and/or the environment.  This RMP update qualifies as the required five (5) year update to the original RMP submitted in Jan. 2013.  \n\nThis RMP update has been developed by AAL Consulting, LLC on behalf of Thermo No. 1 to meet the requirements of 40 CFR 68, furthermore called the \"Rule\".  The format of this RMP update will also follow a similar format to the original submittal in 2013 for ease of employee and operator understanding and use. \n\nProcess Description\n\nThermo No. 1 utilizes geothermal production wells to deliver heated well water to the vaporizer and then a pre-heater each of which are shell and tube type heat exchangers.  The heat exchangers utilize a binary system where the well water doesn't actually come in contact with a separately contained working fluid (iso-pentane).  Because iso-pentane's boiling point is much lower than water the fluid vaporizes quickly creating enough pressure to spin the turbines.  The spinning turbines are each coupled to opposite ends of the generator and electricity is produced.  The iso-pentane and the well water remain in their own separate closed loop systems.\n\nThe iso-pentane vapor then moves from the turbines into the conde"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104556,
      "SummaryText": "nsers.  Here the iso-pentane vapor is condensed back into a liquid as water from an adjacent cooling tower circulates through the condenser tubes, thus dropping the temperature and condensing the vapor.  Once the iso-pentane is back in a liquid form, it is pressurized using feed pumps and re-circulated through the heat exchangers and the whole closed loop process continues.\n\nThe facility currently generates approximately 12 MW gross of \"green\" electricity.\n\nThe entire iso-pentane closed loop system involving the heat exchangers, vaporizers and condensers along with the adjacent storage tank containing the iso-pentane will be considered as the \"process\" throughout this manual and update.\n\nIso-pentane is the regulated substance above the threshold quantity listed in the Rule, thus requiring the facility to register this chemical and follow the requirements of an RMP.\n\n\n1.2   LOCATION AND SITE DESCRIPTION\n\nThermo No. 1 is situated in the remote desert region of Utah approximately 17 miles west of the town of Minersville and approximately 1.0 mile north of the Beaver County/Iron County line (see Figure 1.1 - Site & Facility Location Map).   The entire site consists of approximately 1,120 acres of land with the facility and production/injection wells occupying only 68 acres of the land.  The elevation of the power-generation facility is approximately 5,700 feet above sea level.  Topography at the site slopes gently to the northwest at a slope of approximately 50 vertical feet per mile.  Thermo Hot Springs are located approximately 1.0 mile northwest of the facility in the center of the valley between the Black and Shauntie Mountain ranges.\n\nThe actual facility with the power generation equipment, support equipment, offices and substation occupy approximately 8 acres on the site.  The entire facility area is fenced with the front main office as the security point of check in for all contractors, visitors and/or vendors.\n\n1.3   APPLICABILITY\n\nThe working fluid used in the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104556,
      "SummaryText": "Thermo No. 1 geothermal power generation process is iso-pentane (CAS No. 78-78-4).  The Safety Data Sheet listing all the chemical and physical properties for iso-pentane is found in Appendix A - (NEW) Conoco/Phillips SDS for Iso-pentane.   \nIn the Chemical Accident Prevention Provisions Rule, certain toxic and/or flammable substances are regulated under the Rule.  These regulated substances and their threshold quantities are listed in Tables 1, 2, 3, and 4 of 40 CFR 68.130.  If a facility has a regulated substance greater than the listed threshold quantity contained in the process, then the substance and the facility must meet the requirements of the Rule.  Isopentane is found in Table 3, with a threshold quantity of 10,000 lbs.\n\nAt the Thermo No. 1 site, exact quantities used in the process and their storage locations can be found in Table 1-1 - Iso-pentane Quantity and Storage Locations.\nTable 1-1 - Iso-pentane Quantity and Storage Locations\nLevel 2\nHeat Exchangers/Vaporizers/Condensers\t16,500 gal.\t   16,500 gal.\n\nThe total volume of iso-pentane in use and contained in the Level 2 process at the Thermo No. 1 site is 16,500 gallons or 85,372 lbs. @ a bulk density of 5.174 lbs./gal.  This volume and weight exceeds the 10,000 lb. threshold in the Level 2 process, therefore iso-pentane and the Thermo No. 1 facility is required to comply with the Chemical Accident Prevention Provisions standard (40 CFR 68), and establish a Risk Management Plan or RMP.\n\nUnder the Rule, facilities are also required to determine their level of compliance and registration, dependent upon whether Program 1, 2, or 3 criterion is met (see 40 CFR 68.10(b)).  During the past five years (2013-2018) the Thermo No. 1 facility continues to meet the eligibility requirements of a Program 1 certification.  A facility is eligible for Program 1 certification provided it meets the following requirements:\n\nFor the five years prior to the submission of an RMP, and the five years since, the process has not"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000104556,
      "SummaryText": "had an accidental release of the regulated substance (iso-pentane) where exposure to the substance, its reaction products, overpressure generated by an explosion involving the substance, or radiant heat generated by a fire involving the substance led to any of the following offsite consequences:\n\n(i) Death;\n(ii) Injury; or\n(iii) Response or restoration activities for an exposure of an environmental receptor\n\nThis Plan is written to meet the requirements established in the Rule under Program 1 certification, and continues to certify that no additional measures are necessary to prevent offsite impacts from accidental releases.\n\n1.4 Site Process Safety Management (PSM)/Risk Management Program (RMP)\n\nThe site's PSM/RMP Program consists of fourteen (14 ) elements and these include:\n(i)     Employee Participation\n(ii)    Process Safety Information\n(iii)   Process Hazard Analysis\n(iv)   Operating Procedures\n(v)    Training\n(vi)   Contractors\n(vii)  Pre-Start Up Review\n(viii) Mechanical Integrity\n(ix)   Hot Wok Permit\n(x)    Management of Change\n(xi)   Incident Investigation\n(xii)  Emergency Planning and Response\n(xiii) Compliance Audits\n(xiv) Trade Secrets\n\nFollowing is a description for each element:\n\n1) Employee Participation\n\nThermo No. 1 has developed a written plan of action regarding the implementation of employee participation required by PSM.  Thermo No. 1 has consulted with employees, equipment design experts and other representatives during the development of process hazard analyses and on other elements of process management.  All information concerning the process hazard analysis (PHA) findings & recommendations and the entire PSM manual has been communicated to employees and made available to them for future review.\n\nEmployees are encouraged to participate in the PSM process according to:  EHS-SOP 9.0 Employee Participation Program (in PSM Manual).  The initial communication and training of the process hazard analysis report and the entire PSM manual was perf"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000104556,
      "SummaryText": "ormed on March 5-6, 2013.  Additional training and participation on the Thermo No. 1 Geothermal Power Plant Operations & Maintenance manual, hereafter referred to as the Operations & Maintenance Manual (O&M Manual) occurred April 1-5, 2013, by Ormat.  Upon the five (5) year renewal cycle and Revision 3 update of the entire PSM; the PHA, and all reference documents were again trained and communicated to all plant personnel on March 26, 2018.\n\nThis section complies with 29 CFR 1910.119(c) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n2) Process Safety Information\n\nThermo No. 1 compiled all the necessary process safety information before conducting the process hazard analysis required by the PSM standard.  The process safety information aids Thermo No. 1 and its employees in identifying and understanding the hazards posed by iso-pentane.  Process safety information includes information on the hazards of iso-pentane, the technology and on the equipment in the process.  The majority of this information is provided by experienced operators, the Operations & Maintenance Manual (O&M Manual), and construction turnover documentation.\n\nThis section complies with 29 CFR 1910.119(d) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n3) PROCESS HAZARD ANALYSIS\n\nThermo No. 1 has performed an initial and a follow-up five (5) year process hazard analysis on the processes covered by the PSM standard.  The process hazard analysis considers the complexity of the process and appropriately identifies, evaluates and establishes controls for the hazards involved in the process.\n\nThermo No. 1 has determined and documented the priority for conducting the process hazard analyses based on the extent of the process hazards, number of potentially affected employees, age of the process, and operating history of the process.\n\nThe initial and five (5) year follow-up process hazard analysis was performed by a team with expertise in engineering and p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000104556,
      "SummaryText": "rocess operations.  The PHA took into consideration the following:\n\n\u0095\tHazards of the process;\n\u0095\tIdentification of any previous incident which had potential for catastrophic consequences in the workplace;\n\u0095\tEngineering and administrative controls applicable to the hazards;\n\u0095\tConsequences of failure of engineering and administrative controls;\n\u0095\tFacility layout and siting;\n\u0095\tHuman factors; and\n\u0095\tA qualitative evaluation of a range of possible safety and health effects of failure of controls on employees in the workplace.\n\nAll findings and recommendations are documented and added to a corrective action list to be completed in a timely manner.  The initial process hazard analysis was performed in February 2013.  The five (5) year follow-up and revalidation of the PHA was performed in February 2018 and another in February 2023. PHA recommendations and corrective action tracking log are kept on site.\n\nThis section complies with 29 CFR 1910.119(e) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n4)   OPERATING PROCEDURES\n\nThermo No. 1 has developed and implemented written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the process safety information.  These procedures are readily accessible to employees who work in or maintain the process.\n\nThermo No. 1 has developed and implemented other safe work practices and procedures that provide for the control of hazards during operations and maintenance.  These procedures are applicable to employees and contractors alike.  All operating procedures will be reviewed annually or as often as necessary to assure that they reflect current practices, including changes in process chemicals, technology, equipment and facilities.\n\nThis section complies with 29 CFR 1910.119(f) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n5)   TRAINING\n\nThermo No. 1 has performed initial operating procedure training for e"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000104556,
      "SummaryText": "ted or found by the contractor\u0092s work.\n\nThis section complies with 29 CFR 1910.119(h) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n7)   PRE-STARTUP REVIEW\n\nThermo No. 1 performed a pre-startup review for the process and any other modified facilities throughout the facilities operation life.  This review considers the process safety information prior to the introduction of isopentane to the process or placing a modified system into operation.\n\nThe pre-startup review confirms the following:\n\n\u0095\tConstruction and equipment are in accordance with design specifications;\n\u0095\tSafety, operating, maintenance and emergency procedures are in place and are adequate;\n\u0095\tA process hazard analysis has been performed and recommendations have been resolved or implemented before startup; and\n\u0095\tTraining of each employee involved in the operating process has been completed.\n\nThe initial pre-startup review for the new process took place on April 8-9, 2013.  Follow-up pre-startup reviews must take place as required by the Management of Change process .\n\nThis section complies with 29 CFR 1910.119(i) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n8)   MECHANICAL INTEGRITY\n\nThermo No. 1 has established and implemented written procedures to maintain the ongoing integrity of process equipment.  All employees involved in maintaining the integrity of process equipment have been trained in the hazards and procedures applicable to the employee\u0092s job tasks.\n\nManufacturer\u0092s recommendations for inspection and testing has been implemented in operating procedures and performed at the required frequency.  Equipment deficiencies outside the acceptable limits defined by the process safety information have been and will be quickly corrected in a safe and timely manner.\n\nThermo No. 1 has assured that all equipment is fabricated and installed correctly.  They have also ensured that the appropriate maintenance materials, critical spare parts and equipment ar"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000104556,
      "SummaryText": "e suitable for the process application for which they are used.\n\nThis section complies with 29 CFR 1910.119(j) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n9)  HOT WORK PERMIT\n\nThermo No. 1 has implemented a hot work permit procedure for hot work operations conducted on or near the covered process.  The permit documents the fire prevention and protection requirements set forth in 29 CFR 1910.252(a) and was implemented prior to the beginning of hot work operations.  \n\nPermits are kept on file until completion of the work and or Management of Change is complete.\n\nThis section complies with 29 CFR 1910.119(k) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n10)   MANAGEMENT OF CHANGE\n\nThermo No. 1 has established and implemented written procedures to manage changes to process chemicals, technology, equipment, procedures and changes to facilities that affect the covered process.  Employees and contractors whose jobs will be affected shall be informed and trained on the new process change.\nIf a proposed change involves modifications to procedures or practices found in the process safety information or operating procedures, such information shall be updated accordingly.\n\nThis section complies with 29 CFR 1910.119(l) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n11)   INCIDENT INVESTIGATION\n\nThermo No. 1 will have a team investigate each incident, which could have resulted in a catastrophic release of iso-pentane from the process.  The investigations and corrective actions will be promptly initiated.  All relevant findings and resolutions shall be communicated to personnel whose job tasks are affected by the incident.  All investigation reports will be kept for at least five (5) years.\n\nThis section complies with 29 CFR 1910.119(m) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n12)   EMERGENCY PLANNING AND RESPONSE\n\nThermo No. 1 has developed and implemented an emer"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000104556,
      "SummaryText": "gency action plan for the entire site in accordance with 29 CFR 1910.38(a).  The plan includes procedures for handling small spills or releases.  Employees and contractors are trained on the applicable provisions of the emergency action plan (see sections 6 & 7).  \n\nThis section complies with 29 CFR 1910.119(n) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n13)   COMPLIANCE AUDITS\n\nThermo No. 1 shall certify that they have evaluated compliance to the PSM standard and its provisions at least once every three (3) years.  The audit shall verify that the procedures and practices under PSM are being followed.  An audit report shall be generated indicating any deficiencies or findings.  Audit findings shall promptly be corrected and documented.  The two (2) most recent compliance audit reports and corrective actions must be kept on file. \n\nThis section complies with 29 CFR 1910.119(o) of the Process Safety Management of Highly Hazardous Chemicals standard.\n\n14)   TRADE SECRETS\n\nThermo No. 1 shall make available to those persons responsible for compiling PSM information all process safety information, process hazard analyses, operating procedures, incident investigations, emergency planning/response and compliance audits without regard to the possible trade secret status of such information.  Thermo No. 1 does, however, retain the right to request that those persons requesting the information may need to enter into a confidentiality agreement not to disclose the information.  The plant manager or management staff shall make the determination on the need for such agreements on a case-by-case basis.\n\nThis section complies with 29 CFR 1910.119(p) of the Process Safety Management of Highly Hazardous Chemicals standard."
    }
  ]
}