{
  "FacilityID": 1000060003,
  "FacilityName": "Mclane Foodservice",
  "FacilityStr1": "7600 W Roosevelt St",
  "FacilityStr2": null,
  "FacilityCity": "Phoenix",
  "FacilityState": "AZ",
  "FacilityZipCode": "85043",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04013",
  "LEPC": "Maricopa County LEPC",
  "FacilityLatDecDegs": "33.46007",
  "FacilityLongDecDegs": "-112.2228",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "McLaneco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "McLane Company Inc",
  "Company2Name": null,
  "CompanyDUNS": 9830555,
  "Company2DUNS": 0,
  "OperatorName": "McLane Food Service",
  "OperatorStr1": "7600 W. Roosevelt St",
  "OperatorStr2": null,
  "OperatorCity": "Phoenix",
  "OperatorStateFIPS": "AZ",
  "OperatorZipCode": "85043",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000233561",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-03-30 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-05-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-09-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-09-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074932,
      "AltID": "Anhydrous Ammonia Refrig",
      "FacilityID": 1000060003,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092659,
          "ProcessID": 1000074932,
          "ChemicalID": 56,
          "Quantity": 12893.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000076094,
          "ProcessID": 1000074932,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000062960,
              "Process_NAICS_ID": 1000076094,
              "SafetyReviewDate": "2020-04-01 00:00:00",
              "PHA_Date": "2015-11-23 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-09-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Diffusion Tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-02-03 00:00:00",
              "TrainingReviewDate": "2019-12-09 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-10-01 00:00:00",
              "EquipmentInspectionDate": "2020-03-04 00:00:00",
              "EquipmentTested": "Compressors, Vessels, Control System",
              "ChangeMgmtDate": "2020-04-20 00:00:00",
              "ChangeMgmtReviewDate": "2015-10-01 00:00:00",
              "PreStartupReviewDate": "2015-10-06 00:00:00",
              "ComplianceAuditDate": "2018-11-08 00:00:00",
              "AuditCompletionDate": "2019-03-18 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-10-06 00:00:00",
              "HotWorkPermitReviewDate": "2015-12-01 00:00:00",
              "ContractorSafetyReviewDate": "2015-12-01 00:00:00",
              "ContractorSafetyEvalDate": "2020-04-28 00:00:00",
              "CBI_Flag": 0,
              "Description": "Document Purpose: This document summarizes how McLane Food Service complies with the requirements of OSHA?s PSM 29 CFR ?1910.119(d), and the EPA?s RMP 40 CFR ?68.65 element relating to Process Safety Information. \n\n\n\nScope: The purpose of these elements is to verify that McLane Food Service has completed a compilation of written process safety information which is adequate for an effective process safety management program and for conducting process hazard analyses. Process safety information is needed to: \n\n?    Document formally the as-built/as-modified condition of the facility.\n\n?    Document formally the RAGAGEP for the facility.\n\n?    Provide the necessary data with which to perform the required hazard analysis.\n\n?    Provide the necessary data to support other process safety management policy, procedure, and practical elements, such as standard operating procedures, and emergency response and management of change procedures.\n\n?    Communicate information on hazardous substances to employees and others as required by state and federal regulations. \n\n\n\nReferences: \n\n?    29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals, paragraph (d). \n\n?    40 CFR 68, Chemical Accident Prevention Provisions, sub-part C, section 68.48 \n\n?    OSHA Instruction CPL 2-2.45A, Process Safety Management of Highly Hazardous Chemicals ? Compliance Guidelines and Enforcement Procedures, September 13, 1994.\n\n?    CCPS Guidelines for Process Safety Documentation, April 1995\n\n\n\nDefinitions: \n\nRecognized and Generally Accepted Good Engineering Practice: Engineering, operation, or maintenance activities based on established codes, standards, published technical reports or recommended practices or a similar document. RAGAGEPs detail generally approved ways to perform specific engineering, inspection or mechanical integrity activities, such as fabricating a vessel, inspecting a storage tank, or servicing a relief valve. \n\n\n\nEquipment Specifications: The most important information available about the operation of equipment and subsystems in the process is located in manufacturer?s installation, operation and maintenance manuals. These manuals are kept in the PSM Coordinator?s office and are located in the operation and maintenance file, or in their respective individual equipment files.\n\n\n\n\n\nProcedures: \n\n\n\nRequired Information in written and tabular form: Process safety information describes certain safety attributes of ammonia, the process in which it is used, and the equipment within that process. It is comprehensive enough for an accurate assessment of all the hazards that may occur within the process during normal and upset conditions. \n\n\n\nThe process safety information is compiled and maintained so that it is current. It is available to all employees and is included, as necessary, in employee training programs. Process safety information covers: \n\nInformation pertaining to the hazards of ammonia. A combination of Material Safety Data Sheets (MSDS?s) and the IIAR Ammonia Data Book were used in compiling information on ammonia as a refrigerant, its chemical properties, and health and safety hazards. This information includes: \n\n?    Physical data (i.e. boiling point temperature, vapor pressure, vapor density, etc.)\n\n?    Toxicity data (i.e. LD50/LC50, TLV, PEL, IDLH, etc.)\n\n?    Thermal and chemical stability data (i.e. flammability limits, flash point, auto-ignition temperature, etc.)\n\n?    Reactivity Data\n\n?    Corrosivity Data\n\n?    Erosion effects on the process equipment.\n\n\n\nInformation pertaining to the technology of the process. The process technology information is included in equipment specifications, operating procedures, or on drawings. This information includes: \n\n?    System Chemical Inventory and Maximum intended inventory levels for individual vessels as well as the system as a whole. A maximum level for vessels is also required and this is kept in the SOP of the vessel. \n\n?    Block Flow or Simplified Process Flow Diagram.\n\n?    Safe upper and lower limits for such items as temperatures, pressures, flows or compositions. This information is kept in the SOPs where it will be useful to operators.\n\n?    An evaluation of the consequences of deviations, including those affecting the safety and health of employees. This information is kept in the SOPs where it will be useful to operators.\n\n\n\nInformation pertaining to the equipment in the process. Equipment information is kept in the refrigeration control room. Digital copies and additional information are kept on the company intranet. This information includes: \n\n?    Materials of construction. This information is kept in the various valve bulletins, IOMs and Pipe Certifications, etc.\n\n?    Piping and instrument diagrams (P&IDs) \n\n?    Electrical classification addressed in a Letter to File.\n\n?    Design codes and standards employed addressed in a Letter to File.\n\n?    Pressure safety relief system including both the design basis and as-built condition.\n\n?    Safety systems/devices. This information is kept in the SOPs where it will be useful to operators.\n\n?    Ventilation system design including both the design basis and as-built condition.\n\n?    Material and energy balance addressed in a Letter to File.\n\n?    Compliance with recognized and generally accepted good engineering practices addressed in a Letter to File.\n\nAll systems and equipment have been designed, fabricated, or installed in accordance with codes and/or standards as applicable in the year they were built or significantly modified. A ?Letter to File? is present in the PSI binder under the tab entitled ?RAGAGEP? detailing the codes, standards and RAGAGEP used.\n\n\n\nPiping and Instrumentation Diagrams (P&ID): A Piping and Instrumentation Diagram (P&ID) is a mechanical schematic drawing of the facility?s refrigeration equipment. Details such as utility tie-ins, piping, relief valves, refrigeration control valve type, defrost drain condensate piping, valves, instruments, line types, and refrigeration equipment are shown on the P&ID. The P&ID, while not drawn to scale, does show relative sizes and locations. Instrumentation including such details as tie-in points, instrument numbers, control valve numbers, and panel or local control mounting details is shown. The name and some design features of the refrigeration equipment are shown on the P&ID. \n\n\n\n?    A title sheet or sheets (TS1) precede all the P&IDs which contains a listing of the P&IDs and some basic system information. \n\n?    A complete legend of the symbols used and a list of abbreviations used for the McLane Food Service P&IDs are contained on page R-3.0 of the P&ID book.\n\n?    Pre-fabricated equipment packages are not shown in detail unless it is necessary for a clear portrayal of the refrigeration piping, instrumentation, or utility connections. \n\n?    Major equipment, valving, instruments, and safety systems are also shown on the P&IDs\n\n?    All line colors on the P&IDs are for illustrative purposes only and do not necessarily reflect the color of the piping and equipment in the actual installation. \n\n?    All operators are encouraged to report inconsistencies found during P&ID use to their immediate supervisor to correct such deficiencies in a timely manner. \n\n\n\nDocument Management: All PSI is kept in the PSM Coordinator?s office in paper format. Additionally, digital copies of this information are available on the company intranet. This element requires an extensive collection of documents and they cannot all be located in a single binder. Process Safety Information that is not located directly in the binder is listed in a letter to file in the PSI binder that describes: \n\n?    The Name and description of the document.\n\n?    The equipment / system the document covers.\n\n?    The location(s) of the document(s).\n\n\n\n\n\nChanges to the Process Safety Information are handled under the Management of Change guidelines and require the authorization of the responsible person. \n\n\n\nPersonnel: Refer to the Program Activities document (Management System - Ammonia PSM-RM Program Activities) in the Risk Management Plan binder to ascertain the person or position responsible for ensuring this program element adheres to these guidelines.\n\n",
              "_chemicals": [
                {
                  "PrimaryKey": 1000077081,
                  "PreventionProgram3ID": 1000062960,
                  "ProcessChemicalID": 1000092659
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000060003,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-04-01 00:00:00",
    "ERTrainingDate": "2016-05-13 00:00:00",
    "CoordinatingAgencyName": "Phoenix Fire Department",
    "CoordinatingAgencyPhone": "6022626771",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060003,
      "SummaryText": " A process hazards analysis (PHA) was conducted on an ammonia refrigeration system for McLane Company's new facility  at 7600 W. Roosevelt St., in Phoenix on November 23, 2015 . This is a new facility, with construction in still in progress,  and does not yet have ammonia on site.\n\n \n\n The objective of the study was to identify potential catastrophic incidents by addressing Occupational Safety and Health Administration (OSHA) requirements for compliance PHAs.\n\n \n\nThe PHA was based on a generic study developed by the International Institute of Ammonia Refrigeration (IIAR) and the International Association of Refrigerated Warehouses (IARW). The generic study was customized and supplemented with unique site&#8209;specific issues to ensure that all hazards of this particular ammonia refrigeration system were thoroughly reviewed. This was done with a qualified PHA leader in a team format, centered around the What&#8209;If/Checklist technique.\n\n \n\nA number of recommendations were made concerning items revealed during the study which are summarized the the attached \" PHA Recommendation Summary\"\n\n\n\nRefrigeration System Basis of Design & Life Safety Systems Sequence of Operations:\n\n\n\nTHIS AMMONIA REFRIGERATION SYSTEM AS INSTALLED WITHIN THE SCOPE OF THESE PLANS IS OF THE CLOSED LOOP \"TWO STAGE - VAPOR COMPRESSION CYCLE\" TYPE WITH MAXIMUM DESIGN OPERATING PRESSURE OF 300 P.S.I.G.\n\n\n\nNOTE - THE ENTIRE SYSTEM IS AUTOMATICALLY SEQUENCED & MONITORED INCLUDING THE \"AMMONIA LEAK DETECTION / NOTIFICATION\" CODE REQUIRED FUNCTION BY A PLC (PROCESS LOGIC CONTROLLER) BASED SYSTEM WITH:\n\nALARM / FAILURE NOTIFICATION FUNCTIONALITY & REMOTE ACCESS\n\n\n\nELECTRICAL POWER TO THE \"PLC CONTROLLER / AMMONIA DETECTION & NOTIFICATION SYSTEM\" IS SUPPLIED BY A DESIGNATED PRIMARY CIRCUIT BREAKER TO BE LOCKED ON WITH A 4 HOUR \"UN-INTERUPTABLE POWER SUPPLY\" (UPS) BATTERY BACK-UP IN THE EVENT PRIMARY ELECTRICAL POWER IS LOST.\n\n\n\nNORMAL SYSTEM OPERATION:\n\n1ST STAGE PRESSURE LEVEL:  \"LOW TEMPERATURE\" SUCTIO"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060003,
      "SummaryText": "N LEVELS\n\n    OPERATING AT: 1.6 PSIG & -30 DEGREES F\n\n        3.6 PSIG & -20 DEGREES F\n\n2ND STAGE PRESSURE LEVEL: \"MEDIUM TEMPERATURE\" SUCTION LEVELS\n\n    OPERATING AT:    35 PSIG & +20 DEGREES F\n\nDISCHARGE PRESSURE LEVEL\n\n    OPERATING AT:    165.9 PSIG & +90 DEGREES F\n\n\n\nTHIS SYSTEM IS PER CODE AND IS EQUIPPED WITH:\n\n\"EMERGENCY STOP SWITCH'S\" LOCATED AT THE EXTERIOR & INTERIOR OF THE MECHANICAL ROOM EXTERIOR ACCESS / EGRESS DOOR & THE FRONT OF THE RCP (REFRIGERATION CONTROL PANEL) WHICH WILL STOP THE SYSTEM FROM OPERATION IF ACTUATED / OPERATED & INITIATE SYSTEM FAILURE ALARM OUTPUTS.\n\n\n\n\"AUTOMATIC LIQUID & HOT GAS KING SOLENOID VALVES\" WHICH UPON DE-ENERGIZING (DE-ACTIVATING) WILL STOP THE FLOW OF HIGH PRESSURE AMMONIA TO THE FACILITY FROM THE HIGH PRESSURE SIDE OF THE SYSTEM TO THE REST OF THE SYSTEM & SPACES\n\n\n\n\"EMERGENCY EQUALIZATION CONTROL VALVE STATION\" WHICH WILL BE ACTIVATED UPON SENSING OPERATING PRESSURES OF: 255 P.S.I.G.\n\n(15% DROP OF THE 300 P.S.I.G.) DESIGN MAXIMUM OPERATING PRESSURE)\n\n\n\n    ACTIVATION OF THIS \"AUTOMATIC PRESSURE EQUALIZATION SYSTEM WILL:\n\n    AUTOMATICALLY STOP THE SYSTEM (INCLUDING \"KING SOLENOIDS\" DEACTIVATION)\n\n    & REDUCE EXCESS SYSTEM PRESSURES BY - INTERNALLY RELIEVING (CASCADING) THE \n\n    OVERPRESSURIZED PORTION OF THE SYSTEM FROM UPPER SYSTEM PRESSURE LEVELS\n\n    TO THE NEXT LOWER SYSTEM PRESSURE LEVEL\n\n\n\nOVER PRESSURIZATION \"SAFETY RELIEF VALVES\" WITH THEIR DISCHARGES PIPED TO A COMMON DISCHARGE HEADER LEADING TO A WATER DIFFUSION TANK DESIGNED TO ABSORB THE DISCHARGED AMMONIA AT THE RATE PRESCRIBED BY CODE\n\n\n\nCONTINUOUS AMMONIA DETECTION SENSORS LOCATED IN AREAS NEAR EQUIPMENT & WHERE THE PROBABILITY OF AN AMMONIA RELEASE COULD OCCUR WITH \"AUDIBLE / VISUAL\" NOTIFICATION\n\n\n\n    OPERATION OF THE AMMONIA DETECTION SYSTEM IS AS FOLLOWS:\n\n    REFRIGERATED SPACES:\n\n    A)    IF AMMONIA IS DETECTED AT THE 25 PPM TLV-TWA LEVEL\n\n         1)    ACTIVATE HORN & STROBE ALARMS IN ALL REFRIGERATED SPACES\n\n         2)    PROVIDE ALARM TO OFF-SITE MONITIRING COMPANY TO NOTIFY THE FIRE \n\n        DEPART"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060003,
      "SummaryText": "MENT & SERVICING CONTRACTOR VIA 911 RESPONSE MANAGEMENT\n\n    B)    IF AMMONIA IS DETECTED AT 150 PPM = 50% OF IDLH (IMMEDIATELY\n\n        DANGEROUS TO LIFE & HEALTH) AMMONIA CONCENTRATION LEVEL\n\n        (IN ADDITION TO THE ABOVE)\n\n         1)    SHUT-OFF LIQUID SOLENOIDS TO THE AIR HANDLING UNITS MONITORED BY         THE LEAK DETECTION ZONE IN ALARM\n\n    MECHANICAL ROOM:\n\n    A)    IF AMMONIA IS DETECTED AT THE 25 PPM TLV-TWA LEVEL\n\n         1)    ACTIVATE HORN & STROBES IN THE MECHANICAL ROOM\n\n         2)    ACTIVATE HORN & STROBE ALARMS LOCATED AT EACH ENTRANCE TO THE \n\n        MECHANICAL ROOM\n\n         3)    ACTIVATE EMERGENCY PURGE VENTILATION\n\n         4)    PROVIDE ALARM TO OFF-SITE MONITORING COMPANYTO NOTIFY THE FIRE\n\n        DEPARTMENT & SERVICING CONTRACTOR VIA 911 RESPONSE MANAGEMENT\n\n    B)    IF AMMONIA IS DETECTED AT 300 PPM = IDLH (IMMEDIATELY DANGEROUS\n\n        TO LIFE AND HEALTH) AMMONIA CONCENTRATION LEVEL\n\n        (IN ADDITION TO THE ABOVE)\n\n         1)    SHUT DOWN MECHANICAL ROOM EQUIPMENT INCLUDING:\n\n        - COMPRESSORS (ALL)\n\n        - CONDENSERS (ALL)\n\n        - VESSELS (ALL)\n\n        - AIR UNIT ZONES (ALL)\n\n        - LIQUID & HOT GAS \"AUTOMATIC KING SOLENOIDS\" FEEDING HIGH PRESSURE\n\n        AMMONIA TO THE SYSTEM (ALL)\n\n\n\n\n\nTHE COMPRESSOR ROOM VENTILATION IS DESIGNED TO AUTOMATICALLY MAINTAIN THE ROOM BELOW THE LEL (LOWER EXPLOSIVE LIMIT) OF ANHYDROUS AMMONIA BASED ON ROOM DIMENSIONS AND AMMONIA INVENTORY QUANTITY\n\n\n\nTHE COMPRESSOR ROOM IS DESIGNED TO AUTOMATICALLY DE-ENERGIZE ALL SPARK GENERATING ELECTRICAL EQUIPMENT BELOW THE LEL (LOWER EXPLOSIVE LIMIT) THROUGH \"SHUNT TRIP\" OF ACTIVATION OF THE MAIN BREAKERS SUPPLYING ELECTRICAL POWER TO EQUIPMENT LOCATED IN THE MECHANICAL ROOM\n\n"
    }
  ]
}