{
  "FacilityID": 1000080242,
  "FacilityName": "Hunter Farms Dairy",
  "FacilityStr1": "1900 North Main Street",
  "FacilityStr2": null,
  "FacilityCity": "High Point",
  "FacilityState": "NC",
  "FacilityZipCode": "27262",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37081",
  "LEPC": "Guilford County LEPC",
  "FacilityLatDecDegs": "35.980278",
  "FacilityLongDecDegs": "-080.020833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.harristeeter.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48463103,
  "ParentCompanyName": "Kroger, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6999528,
  "Company2DUNS": 0,
  "OperatorName": "Dwight Moore",
  "OperatorStr1": "1900 North Main Street",
  "OperatorStr2": null,
  "OperatorCity": "High Point",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27262",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dwight Moore",
  "RMPTitle": "VP",
  "FTE": 140,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000091562",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-26 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 35.97944,
  "FRS_Long": -80.02117,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100179,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000080242,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101421,
          "ProcessID": 1000100179,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000101422,
          "ProcessID": 1000100179,
          "NAICSCode": "31151",
          "_desc": {
            "NAICS_CODE": "31151",
            "NAICS_DESCRIPTION": "Dairy Product (except Frozen) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125473,
          "ProcessID": 1000100179,
          "ChemicalID": 56,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625473,
          "ProcessID": 1000100179,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080242,
      "SummaryText": " EXECUTIVE SUMMARY\n\n\n\nBackground Data\n\n\n\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Hunter Farms Dairy (Hunter Farms) submits this Risk Management Plan (RMP) for operations at their High Point, North Carolina facility.  Hunter Farms operations include the processing of dairy products for public consumption. Hunter Farms has been in operation since 1917 and has been at this facility for over 28 years providing quality dairy products and over 140 jobs to the local community. Dairy production has occurred at this facility for over 65 years.\n\n\n\nAccidental Release Prevention and Emergency Response Policy\n\n\n\nHunter Farms is committed to protecting the health of its associates, the surrounding community, and the environment; therefore it is Hunter Farms? policy to maintain compliance with 40 CFR 68 as well as Occupational Safety and Health Organization (OSHA) Process Safety Management (PSM) regulations promulgated as Title 29 of the Code of Federal Regulations Chapter 1910, Section 119 (29 CFR 1910.119), and OSHA?s Hazardous Operations and Emergency Response regulations (29 CFR 1910.120). \n\n\n\nStationary Sources and Regulated Substances\n\n\n\nHunter Farms is subject to section 112(r) of the Clean Air Act because ammonia, a regulated substance, is present at the facility in amounts greater than 10,000 pounds.  Hunter Farms is required to maintain low temperatures in the dairy processing areas of the facility that are within standards required by the Federal Drug Administration (FDA)  to ensure quality in the delivered products.  Hunter Farms uses anhydrous ammonia (the 112(r) regulated substance) as a refrigerant to maintain 75,900 ft2 within the required range of operating temperatures.  Anhydrous ammonia is a typical refrigerant for dairy processing. Hunter Farms? refrigeration system consisting of receivers, accumulators, compressors, evaporators, condensers, and piping can c"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080242,
      "SummaryText": "ontain an operating capacity of 36,000 pounds of anhydrous ammonia.\n\n\n\nAccidental Release Prevention Program\n\n\n\nThe ammonia refrigeration system is designed and constructed in accordance with ANSI/IIAR 2-1992 Standard for Equipment, Design, And Installation of Ammonia Mechanical Refrigerating Systems.  To prevent and mitigate accidental releases of anhydrous ammonia, Hunter Farms has implemented several precautionary measures.  \n\n\n\nHunter Farms has developed and implemented a PSM program pursuant OSHA regulations and as such, has evaluated the system for the potential of anhydrous ammonia releases.   Some of the controls installed to prevent catastrophic releases of ammonia are process equipment (pressure relief valves, rupture disks, purge system, backup pumps, and manual shutoffs) and automated controls (automatic shut-offs, interlocks and ammonia leak detection system). In addition, Hunter Farms has spent time with the local Fire Department who would respond to potential ammonia releases and the Fire Department has toured the facility to become familiar with the location of the system equipment, valves and emergency shut-offs.\n\n\n\nHunter Farms has developed standard operating procedures (SOPs), that  incorporate safety measures into the procedures. for all associates and contractors that have contact with the ammonia refrigeration system. These safety procedures were developed by refrigeration system operators and are reviewed on an as-needed basis. Process safety information for the refrigeration system is reviewed anytime there is a change in the process or SOP.  Hunter Farms requires associate participation in development of overall safety measures used at the plant by means of company newsletters, total quality management teams and training sessions.  Pursuant to written management of change procedures established by Hunter Farms, any changes to the operating procedures are to be communicated to affected employees.\n\n\n\nHunter Farms understands that maintaining "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080242,
      "SummaryText": "the refrigeration system in good working order is essential to preventing accidental releases; therefore Hunter Farms has implemented a preventative maintenance program.  The preventative maintenance program is scheduled, documented and managed by the Maintenance Engineer and the Maintenance Manager to ensure that regular maintenance occurs on the system. \n\n\n\nTo ensure that Hunter Farms? control measures are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system:\n\n\n\n? In accordance with the PSM program, Hunter Farms conducts detailed PSM compliance audits every three years that incorporates review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\n\n \n\n\n\n.\n\n\n\n? The NCDA audits the facility on a quarterly basis.\n\n\n\n? The FDA audits the facility on a random basis.\n\n \n\n Five-Year Accident History\n\n \n\n Over the last five years, Hunter Farms has not experienced an accidental off-site release of anhydrous ammonia from the ammonia refrigeration system.\n\n \n\n \n\n \n\n Emergency Response Program\n\n \n\n Hunter Farms has documented emergency response procedures in two documents entitled Special Situation Manual and Emergency Evacuation Program in order to facilitate response efforts in the event of an on-site or off-site anhydrous ammonia release.  Included in the documents are measures to be taken internally by Hunter Farms as well as measures to be taken by off-site response agencies.\n\n \n\n Hunter Farms has 12 on-site personnel to respond to accidental ammonia releases. Personnel that work on the ammonia system receive initial training and annual update training every three years or as needed reviewing safe work practices"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080242,
      "SummaryText": ".  These associates are also trained in the proper use of respirators and receive an annual fit test and initial pulmonary function test.\n\n \n\n To assure that the local governmental response agencies are familiar with Hunter Farms? emergency response procedures, Hunter Farms has met with the local fire department.\n\n \n\n To plan for an ammonia release with off-site effects, Hunter Farms includes procedures/equipment to passively mitigate the release, procedures to inform local response agencies, transportation maps for response agencies, evacuation route maps, and procedures for public communication.\n\n \n\n In addition to the local response agencies, Hunter Farms has arranged emergency response assistance with a local clean-up contractor.\n\n \n\n In the event of an anhydrous ammonia release with off-site effects, the general public will be warned using the following methods:\n\n \n\n? Broadcast message via the Guilford County Central Dispatch\n\n \n\n? Police and fire vehicles equipped with public address systems, and\n\n \n\n? Door-to-door notification of residents (if time permits).\n\n \n\n Planned Changes to Improve Safety\n\n \n\n As a result of Hunter Farms initial process hazard analyses, several changes were implemented at the facility to improve safety and prevent anhydrous ammonia releases.  These changes included improvements to operating procedures, and preventative maintenance program, increased protection of ammonia equipment (e.g., guarding), increased ammonia safety training, improvements to security and formalizing inspections. Hunter farms has added the ePSM program to enhance recordkeeping and the PSM/RMP programs."
    }
  ]
}