{
  "FacilityID": 1000103308,
  "FacilityName": "California Dairies, Inc. Visalia",
  "FacilityStr1": "2000 North Plaza Drive",
  "FacilityStr2": null,
  "FacilityCity": "Visalia",
  "FacilityState": "CA",
  "FacilityZipCode": "93291",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.343078",
  "FacilityLongDecDegs": "-119.392772",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "California Dairies",
  "OperatorStr1": "2000 North Plaza Drive",
  "OperatorStr2": null,
  "OperatorCity": "Visalia",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93291",
  "OperatorZipCodeExt": null,
  "FTE": 295,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200828",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-06-27 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-12-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-11-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-11-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-11-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 36.34223,
  "FRS_Long": -119.39454,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000128356,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000103308,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000160941,
          "ProcessID": 1000128356,
          "ChemicalID": 56,
          "Quantity": 39000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000129749,
          "ProcessID": 1000128356,
          "NAICSCode": "311512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000110603,
              "Process_NAICS_ID": 1000129749,
              "SafetyReviewDate": "2022-11-05 00:00:00",
              "PHA_Date": "2022-10-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-10-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Severe weather, Sabatoge, Crimial Activity, Terrorism, Impact, Theft",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water Diffusion",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Portable Monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-02-16 00:00:00",
              "TrainingReviewDate": "2022-11-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-02-16 00:00:00",
              "EquipmentInspectionDate": "2022-04-18 00:00:00",
              "EquipmentTested": "All major components and piping in the system-5 Yr M.I.",
              "ChangeMgmtDate": "2022-10-19 00:00:00",
              "ChangeMgmtReviewDate": "2022-05-18 00:00:00",
              "PreStartupReviewDate": "2022-07-11 00:00:00",
              "ComplianceAuditDate": "2020-03-23 00:00:00",
              "AuditCompletionDate": "2022-12-01 00:00:00",
              "IncidentInvestigationDate": "2022-08-04 00:00:00",
              "InvestigationChangeDate": "2023-01-01 00:00:00",
              "ParticipationPlansReviewDate": "2022-10-11 00:00:00",
              "HotWorkPermitReviewDate": "2022-10-05 00:00:00",
              "ContractorSafetyReviewDate": "2022-09-14 00:00:00",
              "ContractorSafetyEvalDate": "2022-10-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000138903,
                  "PreventionProgram3ID": 1000110603,
                  "ProcessChemicalID": 1000160941
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000103308,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-11-05 00:00:00",
    "ERTrainingDate": "2022-11-02 00:00:00",
    "CoordinatingAgencyName": "Region 5 LEPC",
    "CoordinatingAgencyPhone": "5594455806",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CalARP Title 8  and Tile 19",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000103308,
      "SummaryText": "California Dairies, Inc. (CDI) revised this document in 2022 as a part of the 5-year update as required for Risk Management Programs and good practice.\n\nCDI Visalia prepared a Chemical Risk Management Program and Process Safety Management Program (RMP/PSM) in general accordance with state and federal regulations. The state risk management regulations, also referred to as the California Accidental Release Prevention program (CalARP), are codified in the California Code of Regulations (CCR), Title 19, Section 2735.1,et. Seq.\n\nThe Environmental Protection Agency (EPA) also regulates facilities with certain toxic and flammable substances to comply. The regulations are codified in Title 40 of the Code of Federal Regulations (CFR), Part 68.\n\nFinally, both the Federal Occupational Safety and Health Association (OSHA) and the California Occupational Safety and Health Association (CalOSHA) regulate facilities with certain acutely/extremely hazardous materials under the PSM regulations, as defined in CCR Title 8, Section 5189 and CFR Title 29, Part 1910, Section 119, respectively.\n\nSCOPE\nThe EPA RMP regulation requires that an Executive Summary be provided as part of the registration submitted to the EPA. The following areas are addressed in this summary:\n\u0095\tAccidental Release Prevention and Emergency Response Policies\n\u0095\tStationary Source Activities and Regulated Substances Handled\n\u0095\tWorst-Case and Alternative-Case Release Scenarios\n\u0095\tPrevention Program\n\u0095\tFive-Year Accident History\n\u0095\tEmergency Response Program\n\u0095\tPlanned Changes to Improve Safety\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nCDI is committed to complying with all of the regulatory requirements of the EPA Risk Management Program. CDI has developed their Risk Management Plan / Process Safety Management (RMP/PSM) programs to document policies/procedures and address the implementation of these regulations. The PSM sections pertain to the prevention of accidental releases and include the Process Haz"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000103308,
      "SummaryText": "ard Analysis study and procedures for operating, training, maintenance, emergency response, and others. \n\nThe RMP sections pertain to management systems and include the Hazard Assessment (Off-site Consequence Analysis)Report.\n\nReporting and Action: Federal regulations require reporting when there is a release of ammonia exceeding 100 pounds in 24 hours.  State regulations require reporting when there is a  significant release of ammonia or a threat of a release of ammonia. California Dairies interprets this regulation at any release that poses a threat of injury above and beyond minor irritation to anyone.\n\nAll releases and near misses are recorded using the incident investigation forms. All releases are  monitored and all readings recorded. All releases and near misses are reviewed to develop or correct policies and procedures that may prevent future incidents.\n\nSTATIONARY SOURCE ACTIVITIES AND REGULATED SUBSTANCES HANDLED\nCDI Visalia provides production, product cooling, and short-term storage of dairy products.  The facility is located in an industrial area of Tulare County on a contiguous property. Ammonia is used as the refrigerant in the Main Plant Refrigeration System. The total ammonia inventory in the Main Plant system exceeds the Federal and State thresholds.\n\nThe refrigeration system is a combination of a direct, closed loop, and secondary coolant mechanical refrigeration system. The original process was built in 2007. The ammonia equipment is located outside, in a machinery room, and in a cooler.\n\nHAZARD ASSESSMENT\nThe regulation requires that the Worst-Case Release Scenario use the ammonia quantity in the largest vessel or pipe. As this system has interconnected piping and since the largest vessel can hold the complete charge the total system charge was used for the worst case scenario.\n\nNOTE: It is important to consider that the Worst-Case Scenario is extremely unlikely to occur since this scenario does not consider any safety features of the system -"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000103308,
      "SummaryText": "in either design or operation. In addition the Main Plant System is separated by walls and distance. Furthermore as the refrigerant escapes pressure will decrease reducing the release rate. The scenario parameters are established by the regulation to provide uniformity for dialog between the industry, community, and regulatory agencies.  The regulation allows the facility to select the Alternate-Case Scenario.\n\nPREVENTION PROGRAM\nCDI Prevention Program is described in the RMP/PSM (CalARP) documents. The RMP Prevention Program is equivalent to OSHA's Process Safety Management Program (PSM). The Prevention Program implemented by California Dairies is essential to help prevent or minimize the effects if a release occurs.\n\nKey objectives of CDI Prevention Program are briefly described below:\n1)\tMaintain current and complete process technical information. (Addressed under the Process Safety Information Element).\n\n2)\tProvide thorough team evaluation of the refrigeration system. The evaluation considers a number of potential problems including: mechanical problems, human errors, and external events (e.g., earthquakes). All safety recommendations developed by the team are reviewed and addressed by CDI. (Addressed under the Process Hazard Analysis, Compliance Audits and Mechanical Integrity Elements).\n\n3)\tWritten procedures and policies that establish how the refrigeration system should be operated and maintained and how to investigate accidental releases. (Addressed under Operating Procedures, Mechanical Integrity, and Incident Investigation Elements).\n\n4)\tCertification of refrigeration operators to safely operate the refrigeration system. CDI certifies operators following completion of operator training and CDI confirmation of the operator's ability to apply what they have learned.  (Addressed under the Training Element).\n\n5) Employee involvement in the Prevention Program. This is addressed on two levels. First, refrigeration equipment operators participate in the planning"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000103308,
      "SummaryText": "and evaluation of the Prevention Programs (e.g., Process Hazard Analysis study team, writing and/or reviewing operating procedures, Incident Investigation team and Mechanical Integrity etc.).  This involvement encourages ownership of the Prevention Program and positively affects the operators' day-to day activities.\n\nSecond, all CDI employees (direct hires and contract) at this facility receive ammonia awareness training. Additionally, they have access to the RMP/PSM information. These activities improve the overall safety of the employees. (Both levels are addressed under the Employee Participation Element).\n\n6) Implementation of additional measures when changes are planned (procedural or mechanical). These measures begin before any changes are made and may include a Process Hazard Analysis, operator training, and Process Safety Information updates as well as other measures required by CDI Management of Change Procedure.\n\nIf a mechanical change is required and for maintenance contracts, CDI has a procedure for selecting a contractor based on the company's experience and safety history. Additionally, if welding, grinding, or other \"Hot Work\" occurs close to the refrigeration  system or anywhere at the site, a CDI Hot Work permit is required.  The purpose of the permit and the associated Hot Work procedure is to minimize the possibility of a fire.  During and following completion of a mechanical change, a pre-startup safety review is required before the system can be started. (These areas are addressed under Management of Change, Contractor Qualifications, Hot Work Permit, and Pre-Startup Safety Review Elements).\n\n7) Verification of CDI compliance with the RMP/PSM program. This in house and third party audit process is an important tool to confirm whether each of the elements in the Prevention Program (and the Risk Management Program) has been implemented and properly documented by CDI.  (Addressed under the Compliance Element).\n\n8) Minimize employee injury and illn"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000103308,
      "SummaryText": "ess. (Addressed under CDI Injury and Illness Prevention Program).\n\nFIVE YEAR ACCIDENT HISTORY\nThere were no reportable ammonia releases at this facility during the last 5 years that meet the standard of State or Federal regulations.\n\nEMERGENCY RESPONSE PROGRAM\nThis facility has trained personnel to implement the Emergency Action Plan developed specifically for this facility.  Qualified, authorized and trained maintenance and supervisory personnel are trained to mitigate a release defensively if the incident is deemed an emergency. \nCDI will act as a site resource during a Unified Command to assist local responders such as Visalia Fire and Tulare County Hazmat.\n\nMaintenance, production and supervisory personnel are trained to mitigate a release defensively first and then offensive if the incident is deemed incidental  .\n\nThis site has trained, qualified and authorized personnel that will only enter an IDLH condition for a viable rescue as responding agencies cannot arrive on site in time to perform a rescue.\n\nDetailed plans (emergency action plans) have been developed to assist responding facility personnel. All areas (zones) inside and outside the building can typically be brought under control within a short time frame. Small releases can typically be brought under control immediately.\n\nThe emergency release response plan for all releases is to gain access to the shutdown/isolation valves and switches/controls for the component or area with the release. If the system shut down areas are within the ammonia release area the entire ammonia system may be shut down if appropriate. The appropriate shut down switches are identified.\n\nThe Federal and California Emergency Planning Regulations considered in this program include:\n\u0095\tEPA's Risk Management Plan\n\u0095\tOSHA's Emergency Action Plan\n\u0095\tOSHA's Process Safety Standard\n\u0095\tEPA's Emergency Planning and Community Right to Know Act\n\u0095\tContingency Plan\n\u0095\tHazardous Materials Plan (HMBP)\n\nPLANNED CHANGES TO IMPROVE SAFETY\nEmployees,"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000103308,
      "SummaryText": "community safety, the environment and product care are primary concerns at this facility. The prevention program is updated as required on an ongoing basis as changes occur and to satisfy the 5 yr. update.\n\nA PHA study, compliance audit and mechanical integrity audits were conducted over the 5 years. \nThe study team made recommendations for additional safety.\nExamples of these planned changes include but are not limited to:\n1.\tInstall/replace alarm identification sign at ammonia detection horn and light at East side of cold box above door and above the engine rooms south man door.\n2.\tInstall sign at ammonia system bypass/test switch located adjacent to the central control HMI. Ammonia Detection Bypass. Management and maintenance must be notified prior to putting in test mode.\n3.\tRelocate SCBA's from the south engine room wall to the electrical room.\n4.\tLabel and tag glycol chiller GC-3 at catwalk by the RT silos.\n5.\tConsider installing cameras in the engine and MCC rooms. A benefit to this is contractor compliance with CDI policies and procedures and JHA's.\n6. Install ventilation flow switches and indicator lights."
    }
  ]
}