{
  "FacilityID": 1000043641,
  "FacilityName": "Zero Mountain, Inc. Johnson",
  "FacilityStr1": "6403 South Ball Street",
  "FacilityStr2": "P.O. Box 558",
  "FacilityCity": "Johnson",
  "FacilityState": "AR",
  "FacilityZipCode": "72741",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05143",
  "LEPC": "Washington LEPC",
  "FacilityLatDecDegs": "36.125556",
  "FacilityLongDecDegs": "-094.169444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "zeromountain.com",
  "FacilityEmailAddress": "joelneisler@zeromtn.com",
  "FacilityDUNS": 181055658,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Joseph F. Rumsey",
  "OperatorStr1": "8425 Hwy 45 South",
  "OperatorStr2": "P.O. Box 6209",
  "OperatorCity": "Fort Smith",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72916",
  "OperatorZipCodeExt": null,
  "RMPContact": "Joel Neisler",
  "RMPTitle": "Safety/Environmental Manager",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000102612",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-07-23 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.12514,
  "FRS_Long": -94.1665,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053904,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000043641,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054685,
          "ProcessID": 1000053904,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065599,
          "ProcessID": 1000053904,
          "ChemicalID": 56,
          "Quantity": 64115.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565599,
          "ProcessID": 1000053904,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043641,
      "SummaryText": "Executive Summary\n\nZero Mountain, Inc., Johnson\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nWe at Zero Mountain, Inc. are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our excellent safety record. Programs in place cover areas such as design, installation, operating procedures, maintenance, and employee training associated with the process at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Trained response personnel are on staff and ready to respond in the event of an incident.\n\n\n\nThe Stationary Source and the Regulated Substances Handled\n\nOur facilityA?s primary activity is storage and handling of low temperature food products.  We have 1 regulated substance present at our facility.  This substance is Anhydrous Ammonia.  Ammonia (anhydrous) is used as a refrigerant to maintain the temperature of our warehouse.\n\n\n\nThe General Accidental Release Prevention Program and the Chemical Specific Prevention Steps\n\nMaintaining the refrigeration system properly and ensuring that maintenance is performed in a safe and professional manner is the most critical part of preventing accidental releases. Operating and maintenance procedures have been implemented to help ensure this is done. \n\n\n\nInternational Institute of Ammonia Refrigeration (IIAR) standards are also very important in preventing releases. IIAR standards are reviewed to help identify potential problem areas, develop good management practices, and maintain our system in a manner that will provide the safest and most efficient operation.\n\n\n\nCompliance with PSM and RMP regulations is another important step in preventing releases. Zero Mountain, Inc. strives to meet or exceed all PSM an RMP requirements. The following sections briefly describe the elements of these programs:\n\n\n\nProcess Safety Information\n\nZero Mountain, Inc. maintains a detailed record of safety information "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043641,
      "SummaryText": "that describes the chemical hazards, operating parameters and equipment designs associated with all process.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our process are identified and controlled efficiently.  The methodology used to carry out these analyses is the A?What ifA?A? methodology.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at a regular interval of at least every five years.  Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Zero Mountain, Inc. maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the process. SOP checklists are used to ensure all steps are completed properly, using all safety precautions and PPE.\n\n\n\nTraining\n\nZero Mountain, Inc. has a comprehensive training program in place to ensure that employees who are operating the process are competent in the operating procedures associated with this process.  Refresher training is provided at least every three years and more frequently as needed.\n\n\n\nMechanical Integrity\n\nZero Mountain, Inc. carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; compressors, pressure vessels, storage tanks, piping systems, relief vent systems, emergency shutdown systems, controls and pumps.  Qualified personnel carry out maintenance operations with previous training in maintenance practices.  Furthermore, these personnel are offered specialized"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043641,
      "SummaryText": " training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at Zero Mountain, Inc. to manage changes in our process chemical, technology, equipment and procedures. Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly trained to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-starts up safety reviews related to modifications in our established process are conducted as needed at Zero Mountain, Inc.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nZero Mountain, Inc. conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nZero Mountain, Inc. promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nZero Mountain, Inc. truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facilityA?s implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\n"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043641,
      "SummaryText": "Contractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  Zero Mountain, Inc. has a strict policy of informing the contractors of known potential hazards related the contractorA?s work and the process.  Contractors are also informed of all the procedures for emergency response should an accidental release of our regulated substance occur.\n\n\n\n\n\nFive year Accident History\n\nZero Mountain, Inc. has had an excellent record of preventing accidental releases.  Zero Mountain has had no reportable accidental releases in the past 5 years.\n\n\n\nEmergency Response Program\n\nZero MountainA?s emergency response plan to deals with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nChanges to Improve Safety\n\nZero Mountain has implemented a program that will stop the flow of liquid ammonia to an area if the sensor in that area detects a release. This system is currently in place at all four of our locations and is tested regularly with the Nh3 sensors.  \n\n\n\nPlanned Changes to Improve Safety\n\nNh3 sensors in the blast freezers to protect customer product and employees.  These Nh3 sensors are in place at the Fort Smith facility and will be installed in the future at the other three ZMI locations.\n\n\n\n"
    }
  ]
}