{
  "FacilityID": 1000006663,
  "FacilityName": "Fort Knox Mine",
  "FacilityStr1": "#1 Fort Knox Road",
  "FacilityStr2": null,
  "FacilityCity": "Fairbanks",
  "FacilityState": "AK",
  "FacilityZipCode": "99712",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "02090",
  "LEPC": "Fairbanks Area LEPC",
  "FacilityLatDecDegs": "64.997222",
  "FacilityLongDecDegs": "-147.336111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kinross.com",
  "FacilityEmailAddress": "lauren.roberts@kinross.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Fairbanks Gold Mining, Inc.",
  "Company2Name": "Kinross Gold USA, Inc.",
  "CompanyDUNS": 807545777,
  "Company2DUNS": null,
  "OperatorName": "Fairbanks Gold Mining, Inc.",
  "OperatorStr1": "P.O. Box 73726",
  "OperatorStr2": null,
  "OperatorCity": "Fairbanks",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99707",
  "OperatorZipCodeExt": "3726",
  "FTE": 464,
  "OtherEPAFacilityID": "AKR000002352",
  "EPAFacilityID": "100000097691",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-04-27 00:00:00",
  "SafetyInspectionBy": "MSHA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2014-05-02 00:00:00",
  "DeRegistrationEffectiveDate": "2014-04-21 00:00:00",
  "AnniversaryDate": "2014-06-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 64.99953,
  "FRS_Long": -147.358107,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007826,
      "AltID": "Milling",
      "FacilityID": 1000006663,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008772,
          "ProcessID": 1000007826,
          "ChemicalID": 53,
          "Quantity": 36406.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000007995,
          "ProcessID": 1000007826,
          "NAICSCode": "21222",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000006663,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-02-23 00:00:00",
    "ERTrainingDate": "2009-06-03 00:00:00",
    "CoordinatingAgencyName": "Fairbanks North Star Borough EM",
    "CoordinatingAgencyPhone": "9074591481",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "MSHA 30 CFR"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006663,
      "SummaryText": "ined on-site into dore bars produced by fluxing and melting the sludge in an induction furnace.\n\nThe Fort Knox Mine completed a review of chemicals and flammable substances stored on-site and determined that the only substance stored in a quantity exceeding the threshold established in the 40 CFR Part 68 is Hydrochloric Acid.  Carbon stripped of gold in the refining process is washed in Hydrochloric Acid to regenerate the carbon by removing organic material and scale prior to introducing the carbon back into the recovery process.   The Hydrochloric Acid is stored within secondary containment in the refinery building in a tank that has a total capacity of 10,152 gallons.\n\nThe Mine Safety and Health Administration (MSHA), as determined by 30 CFR, has jurisdiction at the site in lieu of the Occupation Safety and Health Administration (OSHA).  Safety inspections and reporting are completed by and to MSHA.\n\nFGMI strives to prevent accidental releases of hazardous substances by providing training to all newly hired employees and annual refresher training to all employees. All employees are trained on the Standard for Hazard Communication procedure, including how to locate, read and understand a Material Safety Data Sheet (MSDS).  All employees are trained by their supervisor on the chemicals and products in their work areas that contain hazardous materials.  \n\n1.\tThe supervisor shows the employee the locations of hazardous materials, explaining how to read warning labels, and identifying the locations of Material Safety Data Sheets (MSDS).  \n2.\tThe supervisor reviews with the employees the appropriate MSDS sheets and during routine safety meetings or special training sessions review safety and health protective measures needed for the hazardous materials.\n\nThe Fort Knox Mine began construction in March 1995 and operations commenced in the fourth quarter of 1996.  During construction and almost eight years of operation the mine has not had a reportable incident involving H"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006663,
      "SummaryText": "employees.\n13.\tReinforce rule compliance with positive recognition.\n14.\tExplain and enforce personal protective equipment (PPE) requirements.\n15.\tTeach safe handling practices for hazardous substances.\n16.\tEnsure that adequate emergency equipment and first-aid supplies are available.\n17.\tOrient new and transferred employees and give comprehensive job instructions.\n18.\tEnsure employees receive proper skills training and safety instruction prior to task assignments.\n19.\tDuring group meetings and personal contacts, actively promote safety using facts, statistics, posters, and publications including off-the-job safety.\n20.\tAnalyze safety records and reports and communicate to all employeesÂ¿ lessons to be learned.\nThe Fort Knox Mine is owned and operated by Fairbanks Gold Mining, Inc., a wholly owned subsidiary of Kinross Gold USA, Inc.  The Fort Knox Mine is located in the Fairbanks North Star Borough, approximately 26-road miles northeast of Fairbanks, Alaska.  The site may be reached by driving north from Fairbanks approximately ten miles via the Steese Highway to Fox and northeast on Alaska Highway 2 for approximately eight and a half miles to the Twin Creeks exit.  At approximately three miles, the unpaved Twin Creeks road splits and a large sign directs traffic to the left.  Three miles further, the road ends at the Fort Knox Mine entrance.\n\nThe Fort Knox Mine utilizes open pit mining techniques to extract mineralized ore for subsequent processing.  The ore is crushed and conveyed to a stockpile that provides surge capacity for the crusher and milling operations.  The crushed ore is fed to the grinding circuit and processed using conventional milling and Cyanide in Leach technology.  Carbon removes gold from the tailing stream for refining and the tailing are detoxified prior to deposition in the tailing impoundment.  The carbon is stripped and the gold recovered on stainless steel cathodes within electrowinning cells.  Sludge from the electrowinning cells is ref"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000006663,
      "SummaryText": "ydrochloric Acid.\n\nThe FGMI Emergency Response Plan was prepared for responding to major injuries/entrapment, major accidents, minor injuries, minor accidents, overtopping/leakage/failure of the tailing impoundment, natural disasters, unplanned ignition or explosion, security emergencies, releases/spills of hazardous materials, fires, earthquakes, and corresponding media coverage at the Fort Knox Mine.  This plan also includes procedures for supporting responses to incidents that occur offsite involving hazardous materials being shipped to the Fort Knox Mine.  Implementation of this plan is intended to mitigate or protect Fort Knox personnel and the surrounding community from: \n1.\tInjury. \n2.\tPrevent contamination of waters of the United States with hazardous materials. \n3.\tPrevent damage to the environment. \n4.\tProvide fire fighting procedures \n5.\tDescribe other emergency response procedures that may be required at the sites. \n6.\tDescribe the assistance that will be given in the event of an incident involving a shipment of hazardous materials destined for the sites. \n\nThis plan will be implemented in the event of an injury, accident, failure, disaster, spill or release of hazardous materials/waste, fire, earthquake, or other incident requiring emergency response.  This plan is designed in accordance with Federal and State regulations with respect to emergency preparedness and spill response, including (RCRA) 40 CFR 264 subpart D, 40 CFR 265 subpart D, 40 CFR 279.52, 40 CFR 112, and 30 CFR.\n\nEmployees are trained in the initial notification procedures included in the Emergency Response Plan during the new hire safety training and during the annual refresher training.  Prior to working in an area where the hazardous materials are used or stored employees receive training in the proper handling of hazardous materials and emergency response procedures for these hazardous materials.   Employees also receive training on the spill reporting requirements contained in the p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000006663,
      "SummaryText": "lan during new hire safety training and annual refresher training.\n\nThe Fort Knox Mine is a small quantity generator as determined by 40 CFR Part 262 and therefore maintains an EPA Identification Number for Hazardous Waste activities.  The EPA Identification Number has been provided in Item 1.3 Other EPA Systems Facility Identifier.  The site currently operates under authority of Air Quality Operating Permit 53TVP01.\n\nEPA software (RMP*Submit 2009) has been utilized to compile the required information for an electronic submittal to the EPA.  The software RMP*Comp was utilized to model the worst-case scenario for the Fort Knox Mine."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006663,
      "SummaryText": "Executive Summary\nFairbanks Gold Mining, Inc. (FGMI) is committed to providing a safe and healthy work place for all employees and contractors.  FGMI applies industry standards, best management practices, and regulatory requirements to fulfill this commitment.  Procedures to protect against personal injury, property damage and fire, ensure occupational health, and protect our environment have been developed; all employees and contractors are required to perform their jobs in accordance with established procedures and operating practices.\n\nFGMIs goal is safe, efficient production.  Safety, health, and the environment are not compromised to meet production goals.  Every employee and contractor is encouraged to discuss any safety, environmental or potential loss issue with their supervisor, Loss Control or Environmental department as may apply, or any other member of supervision.   To ensure compliance with all regulatory environmental, health and safety requirements and to ensure timely follow up of employee concerns, management responsibilities have been delineated below.\n\nMANAGEMENT RESPONSIBILITIES\n1.\tCommunicate and reinforce the loss control policy.\n2.\tSet the right example for all employees to follow.\n3.\tConduct planned general loss control inspections.\n4.\tImplement and monitor pre-operational equipment inspections.\n5.\tEvaluate critical tasks and develop procedures and practices.\n6.\tInvestigate injuries, property damage and near miss incidents.\n7.\tDetermine basic causes and follow up with corrective action on all incidents.\n8.\tPerform planned task observations.\n9.\tInclude emergency preparedness in safety meetings and safety contacts \n10.\tCoordinate fire drills, evacuation exercises, and emergency team activities.\n11.\tEnsure consistent and continual communication by conducting regular group meetings with all employees.\n12.\tConduct an annual review of rules and enforce rules consistently with all employees. Explain rules in MSHA orientation for new and transferred"
    }
  ]
}