{
  "FacilityID": 1000068999,
  "FacilityName": "Ironhorse Complex",
  "FacilityStr1": "30 miles south U.S.  40 & U.S. 191",
  "FacilityStr2": null,
  "FacilityCity": "South of Vernal",
  "FacilityState": "UT",
  "FacilityZipCode": "84078",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "49047",
  "LEPC": "Uintah County LEPC",
  "FacilityLatDecDegs": "40.036170",
  "FacilityLongDecDegs": "-109.454827",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.andeavor.com",
  "FacilityEmailAddress": "Michael.P.Gebhardt@andeavor.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Andeavor Logistics LP",
  "Company2Name": null,
  "CompanyDUNS": 968042452,
  "Company2DUNS": null,
  "OperatorName": "Andeavor Field Services, LLC",
  "OperatorStr1": "1801 California Street, Suite 1200",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80202",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203246",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-07-13 00:00:00",
  "SafetyInspectionBy": "Ute Indian Tribe, Energy and Minerals Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-04-24 11:22:01",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-04-24 11:22:01",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-04-24 11:22:01",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-04-24 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.03617,
  "FRS_Long": -109.454827,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086494,
      "AltID": "NGL Recovery and Storage",
      "FacilityID": 1000068999,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000107982,
          "ProcessID": 1000086494,
          "ChemicalID": 155,
          "Quantity": 999336.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000094285,
              "ProcessChemicalID": 1000107982,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000094286,
              "ProcessChemicalID": 1000107982,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000094287,
              "ProcessChemicalID": 1000107982,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000094288,
              "ProcessChemicalID": 1000107982,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000094289,
              "ProcessChemicalID": 1000107982,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000094290,
              "ProcessChemicalID": 1000107982,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000094291,
              "ProcessChemicalID": 1000107982,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000087716,
          "ProcessID": 1000086494,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000073073,
              "Process_NAICS_ID": 1000087716,
              "SafetyReviewDate": "2018-04-03 00:00:00",
              "PHA_Date": "2019-09-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-08-08 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Gas detection and fire-eye detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-12-31 00:00:00",
              "TrainingReviewDate": "2017-08-27 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-07-06 00:00:00",
              "EquipmentInspectionDate": "2016-04-07 00:00:00",
              "EquipmentTested": "E-206",
              "ChangeMgmtDate": "2018-04-02 00:00:00",
              "ChangeMgmtReviewDate": "2017-06-01 00:00:00",
              "PreStartupReviewDate": "2018-02-26 00:00:00",
              "ComplianceAuditDate": "2017-05-19 00:00:00",
              "AuditCompletionDate": "2018-10-16 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2017-12-31 00:00:00",
              "HotWorkPermitReviewDate": "2017-11-09 00:00:00",
              "ContractorSafetyReviewDate": "2017-12-19 00:00:00",
              "ContractorSafetyEvalDate": "2017-11-08 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000090793,
                  "PreventionProgram3ID": 1000073073,
                  "ProcessChemicalID": 1000107982
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000068999,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Uintah LEPC",
    "CoordinatingAgencyPhone": "4357815466",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068999,
      "SummaryText": "is committed to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of Andeavor processing trains. Andeavor's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, plant personnel will respond in order to contain and control the release.\r\nBecause the process at the Ironhorse Complex is regulated by the Environmental Protection Agency's (EPA's) RMP regulation and also subject to the Occupational Safety and Health Administration's (OSHA's) process safety management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\n\r\nProcess Safety Information:\r\nAndeavor must compile certain written Process Safety Information (PSI) before conducting a PHA. The PSI must include information pertaining to the hazards of highly hazardous chemicals used or produced by the process, the technology of the process, and the equipment used in the process.\r\n\r\nProcess Hazard Analysis (PHA):\r\nThe Ironhorse Complex conducted a Process Hazard Analysis (PHA) to help ensure that hazards associated with the various Ironhorse Complex processes are identified and controlled. Within the PHA program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. The PHA included an evaluation of routine and non-routine modes of operation for potential equipment failures, human errors, and process upsets that could result in a catastrophic consequence.\r\n\r\nAndeavor held PHA study sessions in August 2017 to identify process hazards associated with the Ironhorse Complex. The methodology and content of the PHA met the requirements of 29 CFR 1910.119(e). As required, the study team was composed of p"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000068999,
      "SummaryText": "nto a process:\r\n¿\tConstruction and equipment comply with design specifications;\r\n¿\tSafety, operating, maintenance, and emergency procedures are in place and are adequate;\r\n¿\tA PHA has been performed and recommendations were resolved or implemented; and\r\n¿\tTraining of each operating employee has been completed.\r\n\r\nCompliance Audits:\r\nAndeavor must certify at least once every three years that it has evaluated the Ironhorse Complex's compliance with the provisions of the PSM regulation. Andeavor must determine and document a proper response to each of the findings from such evaluations and document that all deficiencies have been corrected.\r\n\r\nIncident Investigation:\r\nAndeavor must investigate each incident that results in, or could reasonably have resulted in, a catastrophic release of highly hazardous chemicals in the workplace. An investigation must be initiated within 48 hours of the incident. A report must be prepared at the end of the investigation and must be reviewed with all affected personnel, including contract employees whose jobs are relevant to the findings. A system must be established to promptly address and resolve all findings and recommendations.\r\n\r\nEmployee Participation:\r\nA written plan of action must be developed regarding the implementation of the employee's participation.  Employees must be given access to information required by the PSM Regulation; in addition, they must be consulted on the conduct and development of PHAs and all other elements of a PSM program.\r\n\r\nSafe Work Practices:\r\nA hot work permit must be issued and approved for hot work (open flame or spark-producing) activities conducted on or near the Ironhorse Complex.\r\n\r\nEmergency Response Program Summary:\r\nAndeavor maintains a written Emergency Action Plan (EAP) for this facility that is coordinated with local response agencies.  The EAP is designed to minimize injury and loss of human life and company resources by training employees, and assigning responsibilities.  The EAP, which"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000068999,
      "SummaryText": "was last revised in January 2018, is periodically reviewed and updated as conditions require.  The overall emergency response program for the Ironhorse Complex is coordinated with the Uintah County Local Emergency Planning Committee (LEPC)."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068999,
      "SummaryText": "ular sieve dehydration system. The temperature of the gas stream exiting the dehydration system is dropped significantly through expansion. The closed-loop hot oil system supplies heat to multiple process vessels to aid in preventing freezing. The hot oil system is also utilized to increase the temperature of the gas stream throughout the process to facilitate the recovery of NGLs. Ironhorse Train 2 is designed to process 150 MMSCF/D.  The process description and routing of process streams are identical to that of Ironhorse Train 1.\r\n\r\nThe Ironhorse Complex stores flammable mixtures of methane, ethane, propane, butanes, and pentanes (NGL) in four 60,000-gallon pressurized tanks.  Administrative controls on the NGL tanks limit the storage of NGL to 48,200-gallons per tank.  NGL is a flammable mixture subject to the RMP rule as it is primarily comprised of propane and/or ethane, with a National Fire Protection Association (NFPA) Flammability Rating 4 [will rapidly or completely vaporize at normal atmospheric pressure and temperature, or is readily dispersed in air and will burn readily (e.g., propane, hydrogen) and flash point below 23°C (73°F)]. Methane, ethane, propane, butanes, and pentanes are listed in 40 CFR 68.130 as regulated flammable substances.  The threshold quantity for regulated flammable substances is 10,000 pounds.  The maximum inventory of NGLs at the Ironhorse Complex is 240,000-gallons or 999,336 pounds of regulated flammable chemicals. NGL is stored at the facility in excess of the 10,000 lb. threshold quantities for flammable substances and  is therefore subject to the risk management program rule, as defined in 40 CFR Part 68.  Andeavor is submitting this Risk Management Plan 5-year update in compliance with 40 CFR 68.190(b)(1). \r\n\r\nFive Year Accident History:\r\nNo accidents involving regulated substances that resulted in onsite injuries, significant property damage, or offsite response have occurred since startup.\r\n\r\nPrevention Program:\r\nAndeavor"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000068999,
      "SummaryText": "articipants with expertise in engineering and process operations. The results of the PHA yielded 19 HAZOP recommendations as well as four Human Factors/Siting/Global Issues recommendations that will be addressed by Andeavor. All recommendations are relevant to the following consequence(s) of interest:\r\n1.\tCatastrophic release of a highly hazardous chemical (regulated flammable substance);\r\n2.\tInjuries or fatalities to workers and the public resulting from catastrophic hazards;\r\n3.\tEquipment damage resulting from catastrophic hazards; and\r\n4.\tEnvironmental impacts exceeding permitted levels.\r\n\r\nThe following issues were addressed in the recommendations:\r\n¿\tImproving or providing additional equipment/control related safety features;\r\n¿\tImproving human reliability through hardware or operating procedure improvements;\r\n¿\tConducting further investigation or engineering to confirm that the anticipated hazard scenarios are credible and warrant the given recommendation.\r\n\r\nOperating Procedures:\r\nAndeavor must develop and implement written operating procedures that address: steps for each operating phase such as start-up, normal operations, shut-down, operating limits, and safety and health considerations. Operating procedures must be accessible to employees and must be reviewed and updated as often as necessary to reflect current operating practices.\r\n\r\nTraining:\r\nEvery employee of the Ironhorse Complex is presently assigned as a process operator, and every employee working as a newly assigned process operator, shall be trained in an overview of the process and trained in the operating procedures before working unsupervised. Refresher training must be provided at least once every three years. Andeavor must document that each employee receives and understands the training.\r\n\r\nMechanical Integrity:\r\nAndeavor must establish and implement written procedures to maintain the integrity of the Ironhorse Complex process equipment. Andeavor must also document that inspections and tes"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000068999,
      "SummaryText": "ts are performed. Equipment deficiencies that are outside acceptable limits must be corrected before further use or necessary means must be taken to ensure safe operation. Andeavor must ensure that plant equipment is built and installed according to design specifications and manufacturers instruction and that all maintenance materials, spare parts, and equipment meet design specifications. Andeavor also must ensure that each employee involved in maintaining the integrity of the process equipment is trained in an overview of the process, in its hazards, and in all procedures pertaining to the employee's job.\r\n\r\nContractors:\r\nAndeavor must: inform contract employers of known hazards at the Ironhorse Complex and explain the applicable provisions of the emergency plan, periodically evaluate the performance of contractors, and maintain a contract-employee injury and illness log.\r\nThe Ironhorse Complex contract employers must: ensure that each contract employee is trained in the work practices necessary to safely perform his/her work, ensure that each contract employee is instructed in the known hazards related to his/her job and the process and the applicable provisions of the emergency plan, document that each contract employee has received and understands the required training, ensure that each contract employee follows the safety rules and safe work practices of the facility and advise the employer of any unique hazards of the contract employers work or of any hazards found during the contract employer's work.\r\n\r\nManagement of Change:\r\nAndeavor must establish and implement written procedures to manage change (except for replacements in kind) in the Ironhorse Complex's process chemicals, technology, equipment, procedures, and facilities.\r\n\r\nPre Startup Safety Review (PSSR):\r\nA PSSR must be performed for any new facility or any facility modification that requires a change in the PSI. The PSSR must confirm that prior to the introduction of highly hazardous substances i"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068999,
      "SummaryText": "RMP Executive Summary\r\nIronhorse Complex\r\nAndeavor Field Services, LLC - dba Andeavor\r\n\r\nLocation and Regulated Substances:\r\nAndeavor owns and operates the Ironhorse Complex, a natural gas processing facility, located approximately 30 miles south of Vernal, Utah (40.036170 N latitude, -109.454827 W longitude).    The Ironhorse Complex began operations in July 2008 and is comprised of three gas processing trains: Stagecoach, Ironhorse 1, and Ironhorse 2. \r\n\r\nThe Stagecoach Train is designed to process 200 million standard cubic feet of gas per day (MMSCF/D).  The gas is delivered from pipelines and various compressor stations.  To reduce the dew point of the gas, the facility uses a propane refrigeration system to chill the inlet gas, which first flows through a slug catcher to remove bulk liquids from the gas stream.  Ethylene glycol (EG) is injected into the inlet stream to help prevent formation of hydrates.  Natural Gas Liquids (NGL) are removed and processed to meet industry specifications.  Condensate, also removed in the process, is stabilized and removed from the site via tanker truck. \r\nNGLs are removed by significantly lowering the temperature of the inlet gas stream via propane refrigeration.  The propane system is close-looped, and the refrigerant is circulated throughout the system by a compressor.  The chilled gas stream and its associated liquids pass through a three-phase cold separator where the gas exits off the top and leaves the facility by way of the sales line.\r\n  \r\nIronhorse Train 1 is designed to process 150 MMSCF/D.  The inlet stream enters the facility and is directed through a separate slug catcher. Condensate and water are directed from the slug catcher to the separator of the Stagecoach train. The gas stream is routed from the slug catcher to an inlet filter separator/coalescer system and then to an adsorbent treater for the removal of impurities, including mercury and hydrogen sulfide, if present. The gas stream is then routed to a molec"
    }
  ]
}