{
  "FacilityID": 1000045826,
  "FacilityName": "Lilly Technology Center",
  "FacilityStr1": "1400 W. Raymond St.",
  "FacilityStr2": null,
  "FacilityCity": "Indianapolis",
  "FacilityState": "IN",
  "FacilityZipCode": "46221",
  "Facility4DigitZipExt": "2004",
  "FacilityCountyFIPS": "18097",
  "LEPC": "Marion County LEPC",
  "FacilityLatDecDegs": "39.744444",
  "FacilityLongDecDegs": "-086.182222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.lilly.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Eli Lilly and Company",
  "Company2Name": null,
  "CompanyDUNS": 6421325,
  "Company2DUNS": null,
  "OperatorName": "Eli Lilly and Company",
  "OperatorStr1": "Lilly Corporate Center",
  "OperatorStr2": null,
  "OperatorCity": "Indianapolis",
  "OperatorStateFIPS": "IN",
  "OperatorZipCode": "46285",
  "OperatorZipCodeExt": null,
  "FTE": 4704,
  "OtherEPAFacilityID": "IND000806935",
  "EPAFacilityID": "100000060907",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "097-32466-00072",
  "SafetyInspectionDate": "2014-03-31 00:00:00",
  "SafetyInspectionBy": "IOSHA VPP Inspection",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-08-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-08-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-08-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.744444,
  "FRS_Long": -86.182222,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056941,
      "AltID": "Biosyn. Human Insulin Mfg",
      "FacilityID": 1000045826,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000069602,
          "ProcessID": 1000056941,
          "ChemicalID": 26,
          "Quantity": 62000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000057880,
          "ProcessID": 1000056941,
          "NAICSCode": "325412",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000036351,
              "Process_NAICS_ID": 1000057880,
              "SafetyReviewDate": "2014-05-30 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2013-09-25 00:00:00",
              "ChangeCompletionDate": "2014-10-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Cameras",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of closed-circuit TV",
              "OpProceduresReviewDate": "2014-06-09 00:00:00",
              "TrainingReviewDate": "2014-03-26 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-01-02 00:00:00",
              "EquipmentInspectionDate": "2014-06-06 00:00:00",
              "EquipmentTested": "Conservation vent valve",
              "ComplianceAuditDate": "2012-04-20 00:00:00",
              "AuditCompletionDate": "2013-02-22 00:00:00",
              "IncidentInvestigationDate": "2014-07-07 00:00:00",
              "InvestigationChangeDate": "2014-07-10 00:00:00",
              "MostRecentChangeDate": "2014-05-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000036877,
                  "PreventionProgram2ID": 1000036351,
                  "ProcessChemicalID": 1000069602
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000045826,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-08-01 00:00:00",
    "ERTrainingDate": "2013-09-30 00:00:00",
    "CoordinatingAgencyName": "Indianapolis Fire Department",
    "CoordinatingAgencyPhone": "3176341313",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "326 IAC 1-5-2 Emergency Reduction Plans",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045826,
      "SummaryText": "Eli Lilly and Company is a leading, innovation-driven corporation committed to developing a growing portfolio of best-in-class and first-in-class pharmaceutical products that help people live longer, healthier and more active lives.  This document provides a brief overview of the comprehensive risk management activities that Lilly has designed and implemented, including:\r\n\r\n1.  Accidental Release Prevention and Emergency Response Policies\r\n2.  Stationary Source and Regulated Substances Handled\r\n3.  General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n4.  Five-Year Accident History\r\n5.  Emergency Response Program\r\n6.  Planned Changes to Improve Safety\r\n\r\n1.  ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nThe Lilly Technology Center (LTC) is committed to operating and maintaining all processes in a safe and responsible manner.  This is especially important for those processes using hazardous substances.  The Lilly Technology Center has numerous systems in place to manage these chemicals.  Lilly uses a combination of accidental release prevention programs and emergency response planning programs to ensure the safety of employees and the public, as well as protection of the environment.  Lilly's accidental release prevention programs and contingency planning efforts help effectively manage the hazards that are posed to employees, the public, and the environment by the use of these chemicals.\r\n\r\nThe Lilly Technology Center has an Integrated Contingency Plan that contains procedures on how to handle emergencies that occur.  This plan includes procedures for notification of local authorities and notification of any potentially affected neighbors.  Additionally, individual business units at the plant maintain local emergency response procedures which focus on the actions of local personnel in the event of an emergency.\r\n\r\nThe Lilly Technology Center plays an active role in its Local Emergency Planning Committee (LEPC).  A p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045826,
      "SummaryText": "rimary goal of the LEPC is to protect local citizens by developing and maintaining a coordinated emergency response plan and working with industry to minimize the impacts of chemical hazards.  Through LEPC, citizens can obtain information about hazardous substances handled at local facilities and about emergency planning efforts designed to successfully cope with accidents if they occur.  LEPC maintains a coordinated emergency response plan for the community detailing operational procedures to be followed in the event of an accident involving hazardous materials.  The plan is available for public inspection.\r\n\r\nThe Lilly Technology Center actively supports community outreach efforts through Community Advisory Panels and neighbor groups.  These panels provide useful feedback from the community and advise Lilly on community issues.  Lilly also hosts plant tours and informative evening programs for nearby neighbors.\r\n\r\n2.  STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\r\n\r\nEli Lilly produces a variety of pharmaceutical products using a variety of chemicals and processing operations.  The Lilly Technology Center (LTC) is bounded by Raymond Street on the South, Harding Street on the West, and Morris Street on the North (plus one property to the north of Morris Street which totals 9 acres); the LTC Site is comprised of 267 total acres.  LTC North was originally opened in 1946 and LTC South in 1968.  The following regulated substances are handled at LTC in quantities above the threshold quantities established under the RMP regulations:\r\n\r\nToxics:  Ethylenediamine\r\n\r\nFlammables:  None\r\n\r\n3.  GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS\r\n\r\nThe Lilly Technology Center is subject to OSHA's Process Safety Management requirements, as well as other OSHA requirements.  The facility is also subject to regulations by other agencies, including the Indiana Department of Environmental Management and the United States Environmental Protection Agency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045826,
      "SummaryText": ".\r\n\r\nSpecific prevention programs include conducting pre-startup and design hazard assessments, proactive maintenance programs, routine vessel inspections, emergency response training, safe-to-work programs, employee and contractor safety programs, and accident investigation programs.\r\n\r\nLilly has been a part of the American Chemistry Council's Responsible Care initiative since its inception in 1989.  Responsible Care began in 1989 as a collection of management practices that are organized around Codes of Management Practice.  The original code consisted of Community Awareness and Emergency Response and was complemented by five other codes by the end of 1992.  Those five codes are Distribution Safety, Employee Health and Safety, Pollution Prevention, Process Safety and Product Stewardship.  At Lilly our strategy has been to integrate the management practices associated with these 6 codes (there are a total of 106) into our health, safety and environmental management policy and principles as well as our global policy requirements.  Continuous improvement has been driven by annual self-evaluations of the codes. \r\n\r\nA \"new\" Responsible Care was rolled out by the American Chemistry Council in 2001, which responds to both public feedback about the initiative and the changing global economic and socio-political climate.  The \"new\" Responsible Care initiative has resulted in a Responsible Care Management System (RCMS) technical specification, which all member companies must implement and then seek external certification to verify implementation.  Furthermore, an additional Code of Management Practice was added to address chemical security.  As required by the Responsible Care initiative, all affected sites have completed security vulnerability assessments.  As a result of these assessments, action plans were developed to address critical items identified.  Corrective measures have been put into place, and members of local law enforcement were brought in to verify this as a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045826,
      "SummaryText": "third party.  The \"new\" Responsible Care also requires public disclosure of selected HSE metrics, a practice that was already in place at Lilly.  \r\n\r\nLilly takes a systematic, proactive approach to preventing accidental releases of hazardous chemicals.  Our management systems address each of the key features of successful prevention programs including:\r\n\r\n¿\tProcess safety information\r\n¿\tProcess hazard analysis\r\n¿\tOperating procedures\r\n¿\tTraining\r\n¿\tMechanical integrity\r\n¿\tManagement of change\r\n¿\tPre-startup review\r\n¿\tCompliance audits\r\n¿\tIncident investigation\r\n¿\tEmployee participation\r\n¿\tHot work permit\r\n¿\tContractors\r\n\r\nThese individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\r\n\r\n4.  FIVE-YEAR ACCIDENT HISTORY\r\n\r\nLTC has had no accidents as defined in 40 CFR 68.42 during the past five years.\r\n\r\n5.  THE EMERGENCY RESPONSE PROGRAM\r\n\r\nEmergency Management at Lilly Technology Center\r\nThe Lilly Technology Center emergency response plan is linked to the plans of the Marion County Emergency Planning Committee.  The site's response is coordinated by plant security using the plant's emergency response teams and equipment.  The emergency response plan spells out the \"hows\" of emergency response and the roles and responsibilities of the incident response and management response teams.  It includes response procedures that are applicable for each building/area of the plant.  Periodic tabletops, functional drills and exercises test readiness and help employees practice responses to alarms and incidents.  The emergency response plan has been written based upon the \"one-plan\" EPA guidance and covers all topics based on that guidance.\r\n\r\nRapid Notify (RN) System\r\nThe Lilly Technology"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000045826,
      "SummaryText": "Center implemented an innovative community emergency notification system in 1996.  The Rapid Notify (RN) system is an automated phone messaging system.  Within ten minutes it can send a recorded message to everyone who lives or works within one mile of the plant site.  The system calls every number up to three times if there is no answer initially.  It also generates a report advising what phones were not answered.  In conjunction with the Marion County emergency planning organizations, Lilly tests the RN system annually.\r\n\r\nLilly Fire Rescue (LFR)\r\nThe Lilly Indianapolis plant sites have a trained emergency response team, Lilly Fire Rescue (LFR), made up of full time emergency staff and trained extended staff members (volunteers who have other job duties but can be called as needed). LFR is trained as an all hazard response team including Fire, Rescue, HazMat and EMS. LFR will respond to any emergency situation on the plantsite when called. When Security has been notified that an emergency has occurred via telephone (555), radio, alarm or other means, Security dispatches the LFR full time staff along with the LFR extended staff who are in or near the incident area to immediately report to the incident scene to verify that an emergency exists and respond as necessary.  \r\n\r\nLilly Fire Rescue undergoes regular training to meet Local, State, Federal and Company requirements. On-site training facilities and simulators facilitate the training process.  In an emergency situation, one of the site emergency coordinators, or his designate, becomes the incident commander.  Lilly Fire Rescue has the responsibility for maintaining the emergency response equipment.  Vehicles on-site include the following:  two ambulances, response van, response truck, hazardous materials response truck, rescue truck, fire engine and two on-site medical facilities.\r\n\r\nHazardous Material (HAZMAT) Team Hazardous material response is part of the Lilly Fire Rescue (LFR) training and includes respond"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000045826,
      "SummaryText": "ing to hazardous spills or vapor releases.  LFR personnel are trained to the Hazmat Technician level and to use proper equipment and techniques to stabilize a hazardous area and rescue employees who may need help.  This team undergoes rigorous monthly training in HAZMAT response.  \r\n\r\nConfined Space Rescue Team\r\nPart of the training for Lilly Fire Rescue (LFR) also includes Confined Space Rescue.  LFR specializes in rescue from tanks, pits, and other confined areas.  LFR is trained to use ropes, mechanical rescue and high angle rescue techniques.\r\n\r\nMedical First Responders\r\nPart of the training for Lilly Fire Rescue (LFR) also includes Emergency Medical Response.  LFR personnel are trained to give emergency medical aid.  All first responders are certified in CPR, first aid, and defibrillation.  In addition, most LFR personnel have received state certification to the level of Emergency Medical Technician (EMT).\r\n\r\nFire Response\r\nLilly Fire Rescue (LFR) personnel are state certified and are trained to deal with structural fires in the incipient stage and how to deal with chemical fires.  If additional resources are necessary, the Indianapolis Fire Dept is called to support the LFR response efforts.\r\n\r\n6.  PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Lilly Technology Center is committed to ongoing safety improvement.  A system to conduct Process Hazard Assessments is in place.  The system will assure Process Hazard Assessments are conducted for each of the appropriate processes at the Lilly Technology Center.\r\n\r\nIt is the practice of the Lilly Technology Center to reduce its hazards through the pursuit of inherently safer process design as appropriate.  Specifically, in 2007, the site was able to substitute the use of sodium hypochlorite for elemental chlorine, and in 2009 the site was able to reduce its anhydrous ammonia inventory below the threshold quantity.  Further efforts to effectively manage and reduce risk will continue to be considered as appropriate.\r\n\r\nThe mec"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000045826,
      "SummaryText": "hanical systems are routinely tested to insure proper operation and performance.  Any problems found are corrected and opportunities for improvements are noted and evaluated.\r\n\r\nPractice tabletops, functional drills and field exercises are also conducted to practice and improve the procedures for responding to emergencies."
    }
  ]
}