{
  "FacilityID": 1000092270,
  "FacilityName": "Anheuser-Busch, LLC. Cartersville Brewery",
  "FacilityStr1": "100 Busch Drive",
  "FacilityStr2": null,
  "FacilityCity": "Cartersville",
  "FacilityState": "GA",
  "FacilityZipCode": "30121",
  "Facility4DigitZipExt": "7217",
  "FacilityCountyFIPS": "13015",
  "LEPC": "Georgia Dnr",
  "FacilityLatDecDegs": "34.256389",
  "FacilityLongDecDegs": "-084.781944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.anheuser-busch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 801498171,
  "ParentCompanyName": "Anheuser-Busch Companies, LLC.",
  "Company2Name": null,
  "CompanyDUNS": 98630254,
  "Company2DUNS": 0,
  "OperatorName": "Anheuser-Busch, LLC.",
  "OperatorStr1": "100 Busch Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Cartersville",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30121",
  "OperatorZipCodeExt": "7217",
  "FTE": 420,
  "OtherEPAFacilityID": "GAD984294298",
  "EPAFacilityID": "100000128186",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "20820150061V040",
  "SafetyInspectionDate": "2020-02-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-02-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-02-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-02-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-02-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": 34.26499,
  "FRS_Long": -84.80183,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000114587,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000092270,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143209,
          "ProcessID": 1000114587,
          "ChemicalID": 56,
          "Quantity": 140000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000115980,
          "ProcessID": 1000114587,
          "NAICSCode": "31212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000097955,
              "Process_NAICS_ID": 1000115980,
              "SafetyReviewDate": "2021-02-04 00:00:00",
              "PHA_Date": "2020-04-13 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-07-05 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Hand held ammonia detectors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Ventillation system tied to ammonia detection system.",
              "OpProceduresReviewDate": "2021-01-10 00:00:00",
              "TrainingReviewDate": "2020-01-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 0,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-09-22 00:00:00",
              "EquipmentInspectionDate": "2021-02-03 00:00:00",
              "EquipmentTested": "Relief valve on Kathapac unit, SAP#10036085 NH3 PSV-04-1510A",
              "ChangeMgmtDate": "2019-08-31 00:00:00",
              "ChangeMgmtReviewDate": "2020-01-31 00:00:00",
              "PreStartupReviewDate": "2021-01-05 00:00:00",
              "ComplianceAuditDate": "2020-01-17 00:00:00",
              "AuditCompletionDate": "2021-06-30 00:00:00",
              "IncidentInvestigationDate": "2020-07-15 00:00:00",
              "InvestigationChangeDate": "2021-07-01 00:00:00",
              "ParticipationPlansReviewDate": "2020-02-20 00:00:00",
              "HotWorkPermitReviewDate": "2021-02-04 00:00:00",
              "ContractorSafetyReviewDate": "2021-02-04 00:00:00",
              "ContractorSafetyEvalDate": "2020-09-01 00:00:00",
              "CBI_Flag": 0,
              "Description": "Ammonia Refrigeration",
              "_chemicals": [
                {
                  "PrimaryKey": 1000122208,
                  "PreventionProgram3ID": 1000097955,
                  "ProcessChemicalID": 1000143209
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000092270,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-08-07 00:00:00",
    "ERTrainingDate": "2020-12-10 00:00:00",
    "CoordinatingAgencyName": "Bartow Emergency Management",
    "CoordinatingAgencyPhone": "7703875089",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092270,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nRisk Reduction Policies\n\nThe management of the Anheuser-Busch brewery in Cartersville, Georgia recognizes and\n\nshares the community's interest in safe operation of our facility. We have completed this report\n\nunder the U.S. Environmental Protection Agency's (EPA) risk management program (RMP) to\n\ncommunicate our efforts to achieve a safe workplace.\n\n\n\nThe brewery uses ammonia as a key part of the cooling system that maintains beer at the proper\n\ntemperature during certain stages of the brewing process. Ammonia is one of the materials covered\n\nunder the U.S. Occupational Safety and Health Administration's Process Safety Management\n\nstandard (PSM) and U.S. Environmental Protection Agency's Risk Management Program\n\nregulations. The brewery follows these regulations, as well as others, to ensure that it safely\n\nhandles, uses, and stores ammonia and other potentially hazardous chemicals safely. The brewery\n\nhas had no releases of ammonia that resulted in injuries to the public or damage to\n\nthe environment since it opened in 1993. In 1996, the Brewery experienced one release which resulted in one minor injury to a contractor. In 2005, the brewery had a fire that resulted in a release of 19,548 pounds of ammonia which caused property damage on-site but no injuries to employees or the public.\n\n\n\nOur global environmental, health, and safety (EHS) policy and requirements promote the overall\n\nsafety of this brewery, employees, and the public. This policy includes risk reduction programs that\n\nprovide assurance for the safe management of process risks to prevent environmental, health and\n\nsafety incidents and to protect the workplace, the community and the environment. These programs\n\nenable the brewery to prevent the occurrence, or minimize the consequences of, significant releases\n\nof ammonia.\n\n\n\nIt is Anheuser-Busch's policy to conduct our business in accordance with all applicable laws,\n\nregulations, and permits and to promote a safe workplace and a qu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092270,
      "SummaryText": "ality environment. Each\n\nemployee is trained and required to comply strictly with this policy. We do not allow production goals\n\nor financial objectives to over-ride safety and environmental concerns.\n\n\n\nAlso, it is Anheuser-Busch's policy to lead by example so that other companies, including vendors\n\nand suppliers, are similarly interested in protecting the health and safety of employees and\n\nsafeguarding the environment. We are committed to the spirit as well as the letter of our EHS policy\n\nand promote, throughout the organization, responsibility and accountability for strict compliance with\n\nthat policy. Anheuser-Busch employees whose actions in the performance of their duties may affect\n\nthe environment and/or public health are trained sufficiently to permit them to comply strictly with our\n\nEHS policy.\n\n\n\nIn conducting our businesses, we continue to seek and implement cost effective methods to reduce\n\nthe EHS impact of our operations. We integrate EHS considerations into our business planning and\n\ndecision-making processes, including product research and development, packaging, and new\n\nmanufacturing methods. Our continuous EHS improvement goals include pollution prevention and\n\nresource conservation. We ask our contractors to adopt EHS standards, ethics, and policies similar\n\nto our own and we will give preference to suppliers that do so.\n\n\n\nWe encourage our employees, customers, and the public to share with us their EHS concerns. We\n\ncontinually talk with local authorities in communities in which we operate to share ideas about\n\npreventing incidents with materials we use or store.\n\n\n\nAmmonia System\n\nAmmonia is used in the refrigeration system of the brewery. As part of the brewing process, the\n\nbeer is cooled to ensure its consistency, flavor and overall quality. Because of the characteristics of\n\nammonia, our employees observe certain safety precautions to prevent unnecessary human and\n\nenvironmental exposure, both within the brewery and in the surrounding "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092270,
      "SummaryText": "community.\n\n\n\nWorst-Case Release Scenario\n\nAs required by the EPA's Risk Management regulations, we have identified an extremely unlikely\n\n\"worst-case\" scenario in which liquid line outside of powerhouse ruptures, releasing contents of distribution piping   and releases 100% of its capacity of 14000 pounds of anhydrous ammonia(5.42 lbs/gal @ 32 psig, 18.6 deg F). Under worst-case weather conditions, ammonia could travel 2.2 miles before dispersing enough to no longer pose a threat to the public.\n\n\n\nThis scenario is unlikely to occur at the Cartersville brewery for a number of reasons :\n\n-Brewery piping and vessels that contain ammonia meet or exceed industry manufacturing and\n\nquality control standards;\n\n-Ammonia is not corrosive in the form in which it is used at the brewery;\n\n-Pressure relief safety valves limit operating pressures so the chance of a large-scale release is\n\nminimal;\n\n-Operating level of the vessel is well below full capacity with routine monitoring and high level safety interlocks; \n\n-Manual safety valves allow the immediate shut-off of the ammonia system;\n\n-Equipment is inspected and kept in proper working order and replaced when necessary;\n\n-The brewery has an emergency response plan and equipment in place (see description below).\n\n\n\nAlternative Release Scenario\n\nWe have also identified an \"alternative release\" scenario involving the release of 2,840 pounds of anhydrous ammonia due to the opening of a pressure safety relief valve, which itself is a system\n\nsafety device designed to relieve pressure to avoid a more serious release. This release scenario is\n\nbased upon historical release data for Anheuser-Busch breweries. Under common weather\n\nconditions, this amount of ammonia could travel 0.3 miles and remain mostly on brewery property\n\nbefore dispersing enough to no longer pose a threat to the public.\n\n\n\nAccidental Release Prevention Program\n\nAnheuser-Busch has years of experience operating ammonia-based refrigeration systems at its\n\nbreweries."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092270,
      "SummaryText": " This experience has helped bring about designs and operating plans that produce a safe\n\nsystem. No ammonia releases from any of the company's breweries have ever resulted in\n\nconsequences off brewery property. \n\n\n\nThe following elements have produced this safe operating record:\n\n-Process hazard analysis and review, including corrective action follow-up requirements;\n\n-Standard operating procedures that all operators of the refrigeration system must follow;\n\n-Formal operator training;\n\n-Preventative maintenance to ensure that the entire refrigeration system is mechanically sound;\n\n-Procedures to ensure that changes to the refrigeration system are managed so ammonia flow\n\nremains safe;\n\n-Safety review prior to the start-up of new or modified equipment;\n\n-Audits of the PSM and RMP programs;\n\n-Incident investigations to ensure that lessons are learned to prevent future incidents;\n\n-Employee involvement in risk reduction programs;\n\n-Contractor safety procedures are reviewed to ensure outside workers exercise the same safety\n\nconsciousness as employees;\n\n-A work permit system that ensures all welding work is conducted safely;\n\n-Process safety information; and\n\n-Emergency planning and response.\n\n\n\nThe brewery additionally complies with the requirements of the OSHA PSM standard (40 CFR\n\n1910.119), the EPA RMP rules (40 CFR 68), and applicable Recognized and Generally Accepted\n\nRefrigeration System Practices for Equipment, Design, and Installation of Ammonia Mechanical\n\nRefrigerating Systems.\n\n\n\nFive-Year Accident History\n\nThe brewery has had no releases that have caused onsite or offsite injuries, or damage to property\n\nor the environment. \n\n\n\nEmergency Response Program\n\nThe Cartersville brewery has in place a variety of emergency response procedures in the event of an\n\nincident involving ammonia. The emergency response program is based on OSHA's requirements\n\nfor emergency action plans (29 CFR 1910.38) and HAZWOPER (29 CFR 1910.120). We have\n\ntrained employees for emergen"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000092270,
      "SummaryText": "cy response and maintain a plan titled ES Incident Plan\n\n(HAZWOPER Plan) which has been supplied to, and discussed with, Cartersville Fire Department. We conduct annual drills with local agencies to help us remain prepared to implement the ES Incident Plan (HAZWOPER Plan) at the brewery.\n\n\n\nBrewery personnel notify local agencies when emergency response is needed. Local agencies\n\ndetermine if the public needs to be notified. If it is determined that the public needs to be notified, the local agencies perform the notification task.\n\n\n\nPlanned Changes to Improve Safety\n\nAnheuser-Busch's Cartersville brewery ammonia refrigeration system is periodically modified to\n\nimprove safety. In 2018 a continuous ammonia monitoring/detection system was installed in\n\nthe machine room (Powerhouse). Upon detection of a high ammonia concentration, the system will\n\nalarm and automatically shut down all boilers, ammonia compressors, and other electrical equipment\n\nin addition to activating the exhaust ventilation fans in the machine room. \n\n\n\nConclusion\n\nAnheuser-Busch is pleased to share its record of safe operations with the citizens of Cartersville. We\n\nbelieve the Risk Management Plan under which we are providing this information is an important tool\n\nfor encouraging communications with our neighbors. Although we are confident the \"worst case\"\n\nand \"alternative\" scenarios presented in this report are highly unlikely, we want you, our neighbors,\n\nto know we are prepared to respond quickly and effectively should one ever occur. Anheuser-Busch\n\nhas worked hard over the years to ensure the highest standard of safety. Our goal is to continue the\n\nexcellent and safe track record.\n\n"
    }
  ]
}