{
  "FacilityID": 1000062758,
  "FacilityName": "Chemical Unloading Facility",
  "FacilityStr1": "19760 Seaton Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Perris",
  "FacilityState": "CA",
  "FacilityZipCode": "92570",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.833972",
  "FacilityLongDecDegs": "-117.254806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.mwdh2o.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Metropolitan Water District of So. California",
  "Company2Name": null,
  "CompanyDUNS": 63842975,
  "Company2DUNS": null,
  "OperatorName": "MWD of Southern California",
  "OperatorStr1": "700 North Alameda Street",
  "OperatorStr2": null,
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": "CAL000034541",
  "EPAFacilityID": "100000126927",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-08-25 00:00:00",
  "SafetyInspectionBy": "Riverside County Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-04-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-04-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.833972,
  "FRS_Long": -117.254806,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R05",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078666,
      "AltID": "Chlorination System",
      "FacilityID": 1000062758,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000097813,
          "ProcessID": 1000078666,
          "ChemicalID": 62,
          "Quantity": 856000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000079848,
          "ProcessID": 1000078666,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000066111,
              "Process_NAICS_ID": 1000079848,
              "SafetyReviewDate": "2017-02-17 00:00:00",
              "PHA_Date": "2016-03-14 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Remote shutoff capability",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Video Cameras",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-02-17 00:00:00",
              "TrainingReviewDate": "2017-02-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Manufacturer O&M Training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-04-03 00:00:00",
              "EquipmentInspectionDate": "2017-04-03 00:00:00",
              "EquipmentTested": "Entire System",
              "ChangeMgmtDate": "2017-01-20 00:00:00",
              "ChangeMgmtReviewDate": "2015-12-01 00:00:00",
              "PreStartupReviewDate": "2017-03-06 00:00:00",
              "ComplianceAuditDate": "2014-07-24 00:00:00",
              "AuditCompletionDate": "2014-11-24 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-11-20 00:00:00",
              "HotWorkPermitReviewDate": "2014-10-31 00:00:00",
              "ContractorSafetyReviewDate": "2016-10-17 00:00:00",
              "ContractorSafetyEvalDate": "2015-12-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000081710,
                  "PreventionProgram3ID": 1000066111,
                  "ProcessChemicalID": 1000097813
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000062758,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Riverside Co. Fire Dept.,Station 34",
    "CoordinatingAgencyPhone": "9519266430",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Cal/ARP-T19, Div. 2, Chp 4.5 and Cal/OSHA T8, 5189 PSM Standard"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 9,
      "FacilityID": 1000062758,
      "SummaryText": "employees trained in the Incident Command System, who can coordinate with and provide technical assistance to outside emergency responders.  Depending on the severity of the accidental release, external hazardous materials response agencies, such as the Riverside County Fire Department Hazardous Materials Response Team, will be called to handle a chlorine release.  CUF coordinates routinely with local response agencies (Riverside County Fire Department Hazardous Materials Response Team) to help ensure that they are familiar with the CUF cargo tank filling system and its emergency response requirements and that this is reflected in their Area Plans.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nNumerous changes to improve safety (recommended actions) were previously identified for the CCHF chlorine unloading in 2012, 2014, and 2016 when Process Hazard Analyses (PHAs) were prepared for CUF. Each of these recommended actions have been evaluated and implemented, as required."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062758,
      "SummaryText": "he Chlorine Containment and Handling Facility (CCHF).  The CCHF is equipped with two enclosed bays, each capable of containing two rail cars and two cargo tanks.  Only one rail car is in use at a time.  Bay No. 1 is used to transload chlorine liquid from rail cars directly into cargo tanks for delivery to other MWD facilities.  Bay No. 2 is currently only used for hydrotesting cargo tanks.  Empty and full chlorine cargo tanks may also be temporarily stored for less than 24 hours in a paved storage area on the east side of CUF.  The chlorine transloading process utilizes air padding on the rail car and an ejector vacuum on the cargo trailer to create a pressure differential to move the liquid chlorine.  The evaporator vaporizes any remaining liquid chlorine in the cargo tanker gas, which may then be drawn downstream through the chlorinators and ejectors into the underground aqueduct.  The evaporators and the chlorinators are located in separate rooms adjacent to the CCHF. The maximum quantity of chlorine present at the CUF at any given time may be more than the listed threshold quantities in the RMP and CalARP rules.  It is also more than the listed threshold quantities in the federal and California Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standards.  \r\n\r\nChlorine leak sensors are provided in both bays, the evaporator and chlorinator rooms, inside the chlorine vent boxes, the air compressor room, the electrical room, the scrubber ducting, the control building, the maintenance shop, and outside around the facility perimeter.  In addition, each rail car and chlorine cargo tank angle valve, which is connected during the unloading process, is provided with a pneumatic emergency shutoff system, which may be activated manually or automatically.  In case of a major chlorine leak, the chlorine supply in the rail car or chlorine cargo tank will be stopped automatically if two or more fixed chlorine detectors exceed 3 ppm.  Alternati"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062758,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\nThe Metropolitan Water District of Southern California (MWD) distributes drinking water to member water agencies throughout Southern California.  MWD provides more than half of the drinking water used by over 19 million people living on the southern California coastal plain between Ventura County and the Mexican border.\r\n\r\nDisinfection is a critical process used by MWD in the treatment of its drinking water.  Disinfection helps to protect public health by killing pathogens in the water and preventing the spread of waterborne diseases.  The use of chlorine as a disinfectant in the treatment of drinking water and wastewater has been the dominant disinfection method in the United States since it was introduced, around the beginning of the last century.  While many of MWD's facilities have switched to ozone as a primary disinfectant, MWD will still continue to utilize bulk chlorine for residual disinfection and as a backup disinfectant to ozone at all of its water treatment plants.  The MWD Chemical Unloading Facility (CUF) plays a critical role in supplying chlorine for drinking water disinfection.  The chlorine at CUF is received in rail cars and then transferred to chlorine cargo tanks.  These cargo tanks then supply chlorine at various MWD water treatment facilities.\r\n\r\nAs one might expect from its superior disinfection properties, chlorine is a hazardous substance.  Thus, storing and handling chlorine can present a risk to employees and the public without proper precautions.  MWD regards safe practices in the storing and usage of chlorine to be of primary importance and has an excellent safety record with chlorine.\r\n\r\nCUF's chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program Rule (RMPR) and also to the California Accidental Release Prevention (CalARP) Program regulation.  Both of these regulations require submission of a Risk Management Plan (RMP).  An integral part of the RMP is a summ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062758,
      "SummaryText": "ary of policies and procedures followed to safely operate the facility, including a description of the possible consequences in case of an accident and the actions which will be taken by the facility in an emergency.\r\n\r\nThe following information is specifically required in the RMP Executive Summary: \r\n\r\n-\tAccidental release prevention and emergency response policies.\r\n-\tGeneral facility and regulated substances information.\r\n-\tSummary of the accidental release prevention program and chemical-specific prevention steps.\r\n-\tFive-year accident history summary.\r\n-\tEmergency response program summary.\r\n-\tPlanned changes to improve safety.\r\n\r\nAn RMP for CUF has been prepared and is being submitted to the EPA and Riverside County Environmental Health Department in February 2017 as part of the five-year RMP update process.  MWD has constructed a new Chlorine Containment and Handling Facility which contains all chlorine inside a building that is protected by caustic scrubbers to neutralize any accidental chlorine release.\r\n\r\nThe information required in the RMP Executive Summary is provided below for CUF.\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe MWD accidental release prevention policy for chlorine involves a unified approach that integrates proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable procedures of the State of California and EPA's RMP Prevention Program are adhered to, including key elements such as training, systems management, and emergency response.  CUF has an excellent safety record with chlorine use.\r\n\r\nGeneral Facility and Regulated Substance Information\r\n\r\nCUF was built in 1972, and is located at 19760 Seaton Avenue, in Perris, California.  The facility is situated just west of Interstate Highway 215 and south of the Cajalco Expressway, covering approximately 3.8 acres.  At CUF, a majority of the activities involving chlorine occur within t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062758,
      "SummaryText": "vely, the shutoff system may be activated from the control panels at the platform in each bay, outside each bay, in the control room, and in the maintenance shop.  \r\n\r\nThe chlorine sensors will trigger alarms in the SCADA system.  Once alerted, fully trained personnel, including the CUF personnel will respond to assess the chlorine leak.  If any sensor reads above 3 ppm, the scrubber system will automatically switch on.  The scrubber system consists of two 10,800 gallon tanks of caustic solution, caustic recirculation pumps, exhaust fans, and packing media into which air is drawn from intakes in Bays No. 1 and 2, the Evaporator room, and the Chlorinator room, to prevent a release of chlorine from reaching the atmosphere.\r\n\r\nEmergency shower and eye wash stations are also provided around the chlorine unloading, caustic scrubber, emergency generator, and general maintenance areas.\r\n\r\nThe chlorine leak detectors are connected to an uninterruptible power supply (UPS) system. In the event power is lost at the chlorination facility, an alarm will be triggered in the SCADA system. CUF has an emergency generator system, which provides backup power to run CUF emergency systems in the event of a power failure.\r\n\r\nAccess to CUF is controlled through a closed gate, which is manned by a security guard 24/7. In addition, all of CUF is marked Authorized Personnel Only and monitored remotely by video camera.\r\n\r\nFinally, no chlorine releases that caused or could have caused a safety or health hazard or property or environmental damage, evacuations, or sheltering in place have occurred at CUF during the last five years.  \r\n\r\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nCUF's accidental release prevention program complies with all RMP, CalARP and PSM requirements and is based on the following key elements:\r\n\r\n-\tDetailed management system and clear levels of responsibilities and team member roles.\r\n-\tComprehensive process safety infor"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000062758,
      "SummaryText": "mation that is readily available to staff, emergency responders, and contractors.\r\n-\tComprehensive preventive maintenance program.\r\n-\tPerformance of process hazard analysis of process, equipment and procedures with operation and maintenance staff participation and review.\r\n-\tUse of state-of-the-art process and safety equipment.\r\n-\tUse of accurate and effective operating procedures, written with the participation of the operators.\r\n-\tHigh level of training of the operators and maintenance staff.\r\n-\tImplementation of an incident investigation, inspection, and auditing program using qualified staff.\r\n\r\nHazard-specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, presence of chlorine detectors and alarms, and remotely controlled shutoff device on the chlorine storage.\r\n\r\nProcess and Chemical Safety Information\r\n\r\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine.  This information includes chlorine health and safety background information and SDS sheets.\r\n\r\nEquipment safety information was meticulously compiled on the chlorine process. Specifications for the chlorine process are collected and provided in one place for easy reference. Details such as maximum intended inventory; safe upper and lower temperatures; safe upper and lower pressures; and codes and standards used to design, build, and operate CUF are on file at the facility.  CUF also has procedures in place to update process safety information if there is a change that makes existing information outdated.\r\n\r\nProcess Hazard Analysis \r\n\r\nIn 2012 and 2014, detailed process hazard analyses (PHAs) were conducted on the proposed design for the new CCHF at CUF. The 2014 PHA was recently reviewed"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000062758,
      "SummaryText": "and updated in March of 2016 to reflect design modifications made since the previous PHA.  This PHA will be updated again within a five-year period or whenever there is major change in the process.  Recommended actions were developed in the 2016 PHA to further improve chlorine safety and staff is currently evaluating these recommendations. Staff will document the completion of recommended actions.\r\n\r\nA seismic risk assessment was completed in February 2017, based on Region 1 LEPC CalARP Seismic Update Guidance.  Recommendations were provided to the CUF staff for evaluation and implementation.\r\n\r\nOperating Procedures\r\n\r\nCUF maintains up-to-date, accurate, written operating procedures that provide clear instructions for the CUF process.  CUF ensures effective operating and maintenance practices by combining them with operating and maintenance training programs.  Standard operating procedures (SOPs) provide system descriptions, specifications, equipment inspection requirements, and operating procedures for the CUF system.  The operating procedures include receiving and switching railcars, connecting/disconnecting railcars and cargo tanks, chlorine system startup and shutdown during normal operations, chlorine transfer operations, chlorine system startup and shutdown during abnormal operations, chlorine system startup and shutdown for maintenance, emergency operating procedures, and scrubber system operations.  Also included are the maintenance and troubleshooting procedures, including consequences of deviation and the steps to correct or avoid deviations.  CUF updates procedures annually or whenever a change occurs that alters the steps needed to operate safely.  Updated operating procedures will be developed and put in place prior to any new process equipment coming on line or changes made in the handling of chlorine equipment, and reconfiguration of the facilities.\r\n\r\nTraining \r\n\r\nCUF employees presently involved in operating or maintaining the cargo tank filling pr"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000062758,
      "SummaryText": "ocess are trained in an overview of the process and detailed applicable operating and maintenance procedures.  CUF ensures that each employee newly assigned to the process is trained and tested to be competent in the operating procedures listed pertaining to their duties.  The CUF training program includes four elements: (1) initial training and awareness training, (2) refresher training, (3) documentation, and (4) and testing.  Each employee presently involved in operating the cargo tank filling process has been trained to receive the required knowledge, skills, and abilities to safely carry out the duties and responsibilities, including chlorine leak response, as provided in the operating procedures.  \r\n\r\nRefresher training is provided every three years or less to each employee operating the covered process to ensure that the employee understands and adheres to the current operating procedures.  In addition, CUF ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their Management of Change procedures.\r\n\r\nCUF prepares and retains records of initial and refresher training, provides certification of the records, which includes the identity of the employee, the date of training, and the signature of the person (s) administering the training.\r\n\r\nContractors\r\n\r\nCUF has procedures and policies in place that ensure that the contractors are properly informed of the hazards, access limitations to these process areas, and emergency procedures, and are prepared to safely complete the work.  The contractors are informed, prior to the initiation of the work at the site, of the applicable provisions of the Emergency Action Plan.  CUF holds contractor safety briefings before allowing them near or in the process area; controls access to the process areas, and evaluates the contractor's performance.\r\n\r\nPre-Startup Safety Review and Mechanical Integrity Program\r\n\r\nCUF ensures that a pre-startup safety"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000062758,
      "SummaryText": "review is completed for any new process covered by this regulation, or for significant modifications to an existing covered process that requires a change in the process safety information.  CUF maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment.  The CUF mechanical integrity program includes the following:\r\n\r\n-\tWritten procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors, industry codes and practice, and prior operating experience.\r\n-\tImplementation of the written procedures by performing inspections and tests on process equipment at specified intervals.\r\n-\tTraining of maintenance personnel in preventive maintenance program procedures; safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions; and safe use and application of special equipment and/or unique tools.\r\n\r\nHot Work Permits and Management of Change \r\n\r\nCUF requires employees and contractors to employ safe work practices when performing hot work in, on, or around the covered process.  CUF uses a permitting and training program to ensure hot work is monitored and conducted safely on or near a process involving chlorine.\r\n\r\nMWD requires the Management of Change process to be completed for changes to the chlorine system that are not considered as a replacement-in-kind.  MWD PSM/RMP Management of Change Procedure HSE 108.5 describes the process that must be completed prior to implementing changes to the chlorine system.  CUF provides a system and approach to maintain and implement any management of change or modifications to process, equipment, procedures, chemicals, and processing conditions.  This system allows CUF staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the propo"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000062758,
      "SummaryText": "sed change would either compromise system safety or need training to be completed.\r\n\r\nInternal Compliance Audits\r\n\r\nInternal compliance audits are conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  CUF assembles an audit team that includes personnel knowledgeable in the Risk Management Program rule and in the process.  This team evaluates whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations resolved, and appropriate enhancements to the prevention program are implemented.\r\n\r\n\r\nIncident Investigation\r\n\r\nCUF investigates all incidents that could reasonably have resulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  If required, an investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.  There have been no such incidents involving the CUF chlorine cargo tank filling system.\r\n\r\nFive-year Accident History Summary\r\n\r\nNo chlorine releases that caused or could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at CUF during the last five years.\r\n\r\nEmergency Response Program Summary\r\n\r\nCUF is a non-responding facility and, as such, does not have an emergency response plan.  CUF has Technician Level HAZWOPER-trained plant employees who will respond only to incidental chlorine releases and will respond to emergency releases only to assess.  CUF also includes"
    }
  ]
}