{
  "FacilityID": 1000113286,
  "FacilityName": "Kemira Water Solutions, Inc. Mojave plant",
  "FacilityStr1": "18700 Highway 14 North",
  "FacilityStr2": null,
  "FacilityCity": "Mojave",
  "FacilityState": "CA",
  "FacilityZipCode": "93501",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Kern County Public Health Svcs",
  "FacilityLatDecDegs": "35.088806",
  "FacilityLongDecDegs": "-118.147556",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kemira.com",
  "FacilityEmailAddress": "mark.wenclawiak@kemira.com",
  "FacilityDUNS": 624047796,
  "ParentCompanyName": "Kemira Water Solutions, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 627945702,
  "Company2DUNS": null,
  "OperatorName": "Kemira Water Solutions, Inc.",
  "OperatorStr1": "200 Galleria Parkway",
  "OperatorStr2": "Suite 1500",
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30339",
  "OperatorZipCodeExt": null,
  "FTE": 16,
  "OtherEPAFacilityID": "CAD982447088",
  "EPAFacilityID": "100000160513",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-02-22 00:00:00",
  "SafetyInspectionBy": "Kern County Environmental Health Services",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-05-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-05-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-05-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.08527,
  "FRS_Long": -118.1425,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "300",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "126720",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000141080,
      "AltID": "Manufacturing",
      "FacilityID": 1000113286,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000176526,
          "ProcessID": 1000141080,
          "ChemicalID": 62,
          "Quantity": 4680000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000142573,
          "ProcessID": 1000141080,
          "NAICSCode": "32518",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000120885,
              "Process_NAICS_ID": 1000142573,
              "SafetyReviewDate": "2022-04-12 00:00:00",
              "PHA_Date": "2022-05-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-07-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "UniPro automated railcar valve closure system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2024-02-12 00:00:00",
              "TrainingReviewDate": "2024-03-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "on-line computer",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-04-16 00:00:00",
              "EquipmentInspectionDate": "2024-02-19 00:00:00",
              "EquipmentTested": "UniPro closure system",
              "ChangeMgmtDate": "2024-01-25 00:00:00",
              "ChangeMgmtReviewDate": "2024-04-15 00:00:00",
              "PreStartupReviewDate": "2024-02-21 00:00:00",
              "ComplianceAuditDate": "2024-04-15 00:00:00",
              "AuditCompletionDate": "2024-12-20 00:00:00",
              "IncidentInvestigationDate": "2023-10-27 00:00:00",
              "InvestigationChangeDate": "2023-11-20 00:00:00",
              "ParticipationPlansReviewDate": "2024-04-16 00:00:00",
              "HotWorkPermitReviewDate": "2024-04-15 00:00:00",
              "ContractorSafetyReviewDate": "2023-09-11 00:00:00",
              "ContractorSafetyEvalDate": "2024-04-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000151645,
                  "PreventionProgram3ID": 1000120885,
                  "ProcessChemicalID": 1000176526
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000113286,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2024-02-23 00:00:00",
    "ERTrainingDate": "2024-03-12 00:00:00",
    "CoordinatingAgencyName": "Mojave Fire Department",
    "CoordinatingAgencyPhone": "6618244581",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "California Aboveground Petroleum Storage Act"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000113286,
      "SummaryText": "in June 2017 the facility updated its seismic risk assessment.   Results of another compliance audit in May of 2022 led to additional safety measures of level sensor installment and planned safety interlock improvements.\n\n\nES 7.0 FOR MORE INFORMATION\n\nKemira Water Solutions, Inc. recognizes that some individuals and/or organizations may be interested in obtaining more detailed information regarding risk management and prevention program components not discussed herein.  Interested parties that have additional questions regarding the facility's Risk Management Plan are directed to contact:\n\nMr. Isaiah Aston\nKemira Water Solutions, Inc.\n18700 Highway 14 North\nMojave, California 93501\nIsaiah.aston@kemira.com"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000113286,
      "SummaryText": "safety of contractors, accident/incident investigation procedures, emergency response plan, RMP compliance auditing program, record keeping, and a variety of training programs.  Details of each of these components of the facility's Accidental Release Prevention Program are maintained at the facility.  \n\nThere are several chlorine leak detection and monitoring devices and other protective devices (e.g., for fire protection, etc.) placed at strategic locations throughout the facility.  In addition, the site has both manual and automatic shutoff systems to stop the flow of chlorine in an emergency.\n\n\nES 5.0 EMERGENCY RESPONSE\n\nKemira Water Solutions, Inc. recognizes that emergency planning and emergency response are an integral component of risk management.   As such, the Mojave Plant currently has emergency action plans and emergency evacuation plans in place.  These programs work together to mitigate the effects of unplanned releases or events.  However, as a continuous measure to improve safety, the facility reviews its emergency response plan, evacuation plan, and fire prevention plan on a regular basis.  This review process also ensures that the facility incorporates the latest safety developments into its existing programs.\n\n\nES 6.0 PLANNED CHANGES TO IMPROVE SAFETY\n\nA detailed hazard and operability study (i.e., hazards analysis) was performed on all operations involving chlorine in order to evaluate the potential for accidental releases in October, 2021.  As required under the California Code of Regulations, Title 19, Division 2, Chapter 4.5, section 2745.7 (q)(1-4) and 40 CFR 68, the hazards analysis included an analysis of natural and human-caused external events. As a result of the most recent 3-year compliance audit conducted in April 2024, improvements to our contractor management program, process safety information, work permit program, and document management system were identified as part of the ongoing continuous improvement at the site. Additionally,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000113286,
      "SummaryText": "ct chlorine in the air at a concentration of 10 ppm. The UniPro system is tied into the facility's emergency stop system.\n\n\nES 2.0 ACCIDENTAL RELEASE SCENARIOS\n\n RMP regulations require the evaluation of at least two types of release scenarios for their potential to impact off-site populations:\n\n- the worst-case release; and\n- an alternative release (that is more credible or more likely).\n\nIn developing these release scenarios, a number of hypothetical accidental release scenarios were postulated and evaluated for the RMP.  These scenarios were categorized into worst-case release scenarios and alternative release scenarios.  Each of these categories of hypothetical accidental release scenarios is discussed in the technical studies maintained at the facility.\n\n\nES 3.0 FIVE-YEAR ACCIDENT HISTORY\n\nDuring the five years preceding the submittal of this RMP, the facility did not have a chlorine release incident that meets the five-year accident reporting criteria. The facility did not have a chlorine release incident that resulted in at least one of the following:\n- Onsite injuries;\n- Onsite deaths or significant property damage; or\n- Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\nES 4.0 ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe Accidental Release Prevention Program at Kemira Water Solutions, Inc. Mojave facility consists of a series of programs, procedures, and policies designed to minimize the risk of accidental releases involving chlorine.  These programs include design and operating controls, compliance with specified codes, the facility's health and safety program, numerous standard operating procedures, the equipment inspection and maintenance program (including a mechanical integrity and preventive maintenance program), site security, the management of change program, pre-startup safety review, fire prevention/fire protection/hot work permit program, management and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000113286,
      "SummaryText": "m onsite inventory of 4,500,000 pounds of chlorine) each temporarily stored on a secure, company-owned rail spur;\n- Two continuous chlorinators for reacting water, chlorine, and hydrochloric acid to manufacture ferrous chloride solution;\n- Three scrap iron dissolver tanks, along with two expansion (overflow) tanks;\n- Three chlorinators utilized to convert ferrous chloride solution to ferric chloride solution; \n- A number of heat exchangers supplied by recirculating cooling water from a cooling tower; and\n- System piping, controls and instrumentation.\n\nNinety-ton railcars of chlorine are delivered to the facility and staged in dedicated spots for unloading.  Liquid chlorine from the railcars, dilute ferrous chloride, and water are mixed in two continuous chlorinators.  The resulting solution is circulated through three dissolver tanks containing scrap iron/steel and hydrochloric acid.  This process results in the manufacture of a weak ferrous chloride solution.  The dilute solution is continuously recirculated until a rich ferrous chloride solution is made.  \n\nThe rich Ferrous chloride solution is then filtered before transfer to a series of three chlorinators in the Ferric plant.  Chlorine is added to the chlorinators until the desired concentration of ferric chloride solution is manufactured.  The resulting material is then sent to finished product storage tanks.\n\nCentral Emergency Vacuum Relief Device (CEVRD)\nThe Mojave Plant has and maintains a central emergency vacuum relief device (CEVRD).  The CEVRD is connected to the overhead relief of each of the chlorinator vessels onsite.  The CEVRD utilizes a solution of ferrous chloride to remove excess chlorine in one stage.  In another stage of the CEVRD, recirculating water removes any excess hydrochloric acid before the air stream is released to atmosphere.\n\nAs an additional mitigation measure, the facility installed an automated railcar valve closure system (UniPro system) that is activated when area sensors dete"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000113286,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\nThis document comprises the Risk Management Plan (RMP) for the Kemira Water Solutions, Inc. facility located at 18700 Highway 14 North in Mojave, California 93501 (also referred to as the Mojave Plant).  The facility is located in an undeveloped area approximately 1.5 miles northeast of the town of Mojave.  The Mojave Airport, which is the nearest neighboring facility, is approximately 1 mile away. \n\nThe purpose of this document is to comply with various risk management planning requirements.  These are set forth in Section 25535(d) of Article 2 of Chapter 6.95 of the California Health and Safety Code (also known as the California Accidental Release Prevention Program - CalARP) and Part 68 of Title 40 of the Code of Federal Regulations (40CFR Part 68).  The latter is also known as the federal Accidental Release Prevention Requirements: Risk Management Programs or the federal RMP.  \n\nThe scope of the RMP includes all operations conducted at Kemira Water Solutions, Inc. Mojave facility which involve the storage, handling and/or use of chlorine.   Chlorine is the only regulated substance which is handled at the facility above the threshold quantity.  \n\n\nES 1.0 DESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED\n\nPRIMARY OPERATIONS\n\nThe primary operation conducted at Kemira Water Solutions, Inc. Mojave facility is the manufacture of Ferrous chloride and Ferric chloride solutions (NAICS Code 32518, SIC Code 2819).  The primary components utilized in the process include water, hydrochloric acid, chlorine, and scrap iron.  Chlorine is a regulated substance subject to the above-referenced regulations, and is the only such regulated substance handled at the facility.  Provided below is a brief description of the storage, handling, and use of chlorine at the site.\n\nSTORAGE, HANDLING AND USE OF CHLORINE \n\nThe chlorine management program consists of the following components:\n\n- A maximum of twenty-six 90-ton railcars of chlorine (i.e., a maximu"
    }
  ]
}