{
  "FacilityID": 1000000933,
  "FacilityName": "ExxonMobil Olathe Grease Plant",
  "FacilityStr1": "1400 South Harrison Street",
  "FacilityStr2": null,
  "FacilityCity": "Olathe",
  "FacilityState": "KS",
  "FacilityZipCode": "66061",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20091",
  "LEPC": "Johnson County LEPC",
  "FacilityLatDecDegs": "38.862500",
  "FacilityLongDecDegs": "-094.814722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 139485635,
  "ParentCompanyName": "Exxon Mobil Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Exxon Mobil Corporation",
  "OperatorStr1": "1400 South Harrison Street",
  "OperatorStr2": null,
  "OperatorCity": "Olathe",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66061",
  "OperatorZipCodeExt": null,
  "FTE": 57,
  "OtherEPAFacilityID": "KSD007234941",
  "EPAFacilityID": "100000104077",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-03-11 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-08-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.86299,
  "FRS_Long": -94.81569,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001140,
      "AltID": "Grease Manufacturing",
      "FacilityID": 1000000933,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000003899,
          "ProcessID": 1000001140,
          "ChemicalID": 31,
          "Quantity": 51000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000011197,
          "ProcessID": 1000001140,
          "ChemicalID": 77,
          "Quantity": 49000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000001226,
          "ProcessID": 1000001140,
          "NAICSCode": "324191",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000000593,
              "Process_NAICS_ID": 1000001226,
              "SafetyReviewDate": "2012-12-18 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": "API Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2010-04-01 00:00:00",
              "ChangeCompletionDate": "2012-03-28 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Hand Held Detection Units and Exposure Badge",
              "CH_ChemicalReduction": 1,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-01-29 00:00:00",
              "TrainingReviewDate": "2009-01-29 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer Based Training",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2007-11-30 00:00:00",
              "EquipmentInspectionDate": "2008-09-28 00:00:00",
              "EquipmentTested": "High Level Alarm Reset = Reset Radar and Float Gauge",
              "ComplianceAuditDate": "2011-11-09 00:00:00",
              "AuditCompletionDate": "2012-04-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2009-05-13 00:00:00",
              "CBI_Flag": 0,
              "Description": "TDI Addition",
              "_chemicals": [
                {
                  "PrimaryKey": 1000002172,
                  "PreventionProgram2ID": 1000000593,
                  "ProcessChemicalID": 1000003899
                },
                {
                  "PrimaryKey": 1000007777,
                  "PreventionProgram2ID": 1000000593,
                  "ProcessChemicalID": 1000011197
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000933,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2008-10-29 00:00:00",
    "ERTrainingDate": "2008-10-29 00:00:00",
    "CoordinatingAgencyName": "Johnson County LEPC",
    "CoordinatingAgencyPhone": "9137151006",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000933,
      "SummaryText": "Accidental Release Prevention\n\nThe ExxonMobil Olathe Grease Plant's operation involves the manufacturing of lubricants and lubrication products.  This includes the manufacturing and packaging of grease and specialty oils.  The manufacturing process utilizes refined oils, combined with additives to produce lubricants and lubricating products including grease.  Regulated substances are received by dray truck and tank truck.  Regulated materials are received in bulk from tank trucks or as packaged in 55 gallon drums. Both bulk and packaged raw materials are stored inside the plant in either a storage tank or in sprinkled storage racks.\n\nThe ExxonMobil Olathe Grease Plant has adopted continuous improvement principles to support an incident free culture.  Every incident that occurs is investigated with identification of assignable root causes.  Preventative and corrective measures are employed to lessen the chance of a repeat incident from occurring.\n\nTo further mitigate the possibility of an incident, the plant culture has an engaged workforce that proactively identifies incidents before they occur.  These near misses are investigated and findings tracked to resolution.\n\nAdditionally, by utilizing a behavior based safety system, the employees observe work tasks of their peers, both in their own work area as well as in other work areas, to ensure that we have experienced and A?cold eyesA? review of processes to further mitigate the possibility of a workplace incident.  These activities are strongly supported by management in the plant who also participate as observers.  Trending analysis of incidents and near miss incidents is used to identify target areas where more proactive behavior based observations are required to more effectively deploy resources for maximum impact.\n\nThe plant maintains permits for discharge of wastewater (POTW) and surface water (NPDES), permits for temporary storage and shipment of hazardous and non-hazardous wastes, as well as an air quality pe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000933,
      "SummaryText": "rmit.  To maintain the effectiveness of permit compliance, routine checks of systems performance, auditing by employees external to the plant as well as proper oversight of work practices is effectively deployed to ensure full permit compliance.  The site uses trained plant personnel to respond to small leaks of regulated substances.  Outside emergency responders would be requested in the event of a significant spill.  Outside emergency responders are familiar with the plant's operations.\n\nScheduled checks of our security system are proactively planned by the site security contact to mitigate possibility of an unplanned security incident.  These checks include measurements of 12 elements and 59 sub-elements to evaluate performance, procedures and processes as well as physical barrier integrity.  Audits are also conducted by subject matter experts from outside of the plant who also share best practices to further strengthen the performance of the plant security system.\n\nFive Year Accident History\n\nThe Olathe Grease Plant measures many metrics to assess incident-free performance.  Recent performance against the three key categories used to measure and support the effectiveness of the risk management plan are outlined below.\n\nSafety\nThe plant has not experienced a recordable workplace injury for four calendar years (last incident occurred in 2004), and there has not been a lost time incident for six calendar years (last incident occurred in 2002).  There have been no injuries in the last five years related to regulated substances.  \n\nEnvironmental\nThere have been no environmental excursions for six calendar years (last incident occurred in 2002), and there has not been a single spill above the reporting threshold (three barrels, or 126 gallons) for three calendar years (last incident occurred in 2005).  In calendar years 2006 and 2007, the State of Kansas Water Environment Association recognized the Olathe Grease Plant with the Gold Award for meeting all discharge limi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000933,
      "SummaryText": "t criteria as well as maintaining excellence in care of our pretreatment equipment for the entire year.  (It should be noted that the KWEA has not yet issued a list of award recipients for calendar year 2008; however, if the same criteria is used as previous years, the Olathe Grease Plant is expecting this recognition for the third consecutive year.)  There have been no releases of a regulated substance in the last five years which had any offsite consequence.\n\n\nSecurity\nThe plant has successfully passed all security system tests conducted, and has not had a security system failure since 2005.\n\nPlant employees are rewarded for maintaining an incident free work environment, to ensure proper alignment and focus on key workplace metrics.  The plant supports a Continuous Improvement committee comprised of a cross-department team of employees.  This CI committee stewards effective use of proactive behavior based observation processes to further enhance the success of our key performance metrics.  The committee also identifies opportunities to improve overall plant effectiveness through broadened accountability and involvement.\n\nIn calendar years 2006, 2007 and 2008, the Olathe Grease Plant was recognized by the Vice-President of Operations for achieving excellence in all key plant metrics, which included (amongst other parameters) safety, environmental, and security performance.  For the sustained performance in these key metrics, the Olathe Grease Plant was recognized in 2008 by the President of ExxonMobil Lubricants & Specialties, a distinction shared with only two other plants in the world.\n\n\nStationary Source\n\nThe lubricants and lubricating products are manufactured in a batch process in mixing and cooking kettles of various sizes.  The kettles are heated by either hot oil or steam.  Finished products are stored in the tanks within the warehouse or in the manufacturing kettles until they are packaged.  The finished products are manufactured in a variety of package st"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000933,
      "SummaryText": "yles and they are stored in the warehouse pallet racks until shipped to the various customers.  Finished products are also loaded into bulk trucks and delivered to customers.\n\nThe ExxonMobil Olathe Grease plant currently operates in compliance with Air Permit #0910014.  A representative of the Johnson County Environment Department (JCED), acting as a designated agent for the Kansas Department of Health and Environment (KDHE), conducts annual inspections to verify compliance. The Olathe Grease Plant is also subject to Emergency Planning and Community Right-to-Know Act (EPCRA) Tier II filing for toxic chemicals.  Additionally, the site is regulated under OPA 90 and has developed a Facility Response Plan which it exercises annually.\n\nThe two chemicals stored at the ExxonMobil Olathe Grease Plant in quantities over the threshold values are toluene-diisocyanate (TDI) and cyclohexylamine (CHA).  TDI and CHA are brought in as raw materials and are essential in the production of various greases.  These materials are received in bulk and drums.  Each is added during the grease maufacturing process.  The site does not store any regulated flammables over a threshold quantity.\n\nThe RMP rule requires companies to develop chemical release scenarios that estimate the potential community impact from an accidental release. These scenarios are useful for emergency planning in the event of an accident. There are two types of scenarios required by the EPA. The worst case scenario (WCS) is the release of the largest quantity of a regulated substance. It assumes the worst case meteorology that would allow the release to travel the greatest distance. The alternative release scenario (ARS) allows companies to develop a more realistic planning scenario.\n\nThe WCS for toxics at the Olathe Grease Plant involve the release of toluene-diisocyanate (TDI) from an indoor storage vessel. The ARS for toxics involve the release of toluene-diisocyanate (TDI) and cyclohexylamine (CHA).  Off site impact "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000933,
      "SummaryText": "is mitigated by our prevention programs.\n\nGeneral Release Prevention & Emergency Response\n\nThe Olathe Grease Plant takes a systematic, proactive approach to prevent accidental releases of hazardous chemicals. ExxonMobil's Operations Integrity Management System (OIMS) addresses each of the essential features of a successful accident prevention program and includes the following elements.\nA?    Management Leadership, Commitment, and Accountability\nA?    Risk Assessment and Management\nA?    Facilities Design and Construction\nA?    Information and Documentation \nA?    Regulatory Compliance and Environmental Management\nA?    Personnel Safety and Occupational Health\nA?    Operations and Maintenance\nA?    Work Control Procedures\nA?    Management of Change\nA?    Personnel Training\nA?    Third Party Services\nA?    Incident Investigation and Analysis\nA?    Community Awareness and Emergency Preparedness\nA?    Operations Integrity Assessment and Improvement\n\nOur RMP uses these individual management system elements to prevent accidental chemical releases.  In addition to our industry leading management programs, we have designed systems and equipment to control, prevent, detect and mitigate potential accidental releases.  We have installed fixed monitors to detect small leaks of TDI and also use portable monitors for the purpose of leak detection.\n\nWe train our employees to safely perform their assigned tasks. Our training program includes initial training as well as periodic refresher training and training updates when major process or equipment changes are made.\n\nThe site has developed a written Emergency Response Action Plan. The document details the response activities and notifications necessary in the event of a spill.  The notification requirements include both internal and external community stakeholders.  Small spills of the regulated substances are handled by trained plant personnel.  Larger spills will be handled by outside emergency responders or a pre-qualified oil spill response organization.  We maintain "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000000933,
      "SummaryText": "an on-going relationship with or local municipal emergency responders and participate in the Johnson County Local Emergency Planning Committee.\n\nPlanned Improvements\n\nThe Olathe Grease plant has contracted an independent third party to evaluate safety, health and environmental (SHE) programs of selected contractors against ExxonMobil Lubricants and Specialties expectations.  This ensures our contractors meet or exceed our requirements for safety, health and environmental programs.  We believe this review reduces the likelihood of an accidental release.  Additionally, we have established a program which supports an ongoing relationship with critical contractors.  This program involves monthly facility tours, stewardship of SHE metrics, sharing of behavioral based safety observations, and resolution of any findings.  We believe these activities support our efforts to execute an effective risk management program.\n\nWe also conduct annual internal evaluations of our Operations Integrity Management Systems.  These systems are also evaluated every three years by external subject matter experts.  Additionally, an external assessment is conducted periodically for compliance with local, state and federal regulations.  For all audits, any finding is tracked to final resolution.\n"
    }
  ]
}