{
  "FacilityID": 1000041680,
  "FacilityName": "Polysource, Inc",
  "FacilityStr1": "555 East Statler Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Piqua",
  "FacilityState": "OH",
  "FacilityZipCode": "45356",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39109",
  "LEPC": "Miami County LEPC",
  "FacilityLatDecDegs": "40.13564",
  "FacilityLongDecDegs": "-84.22545",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "UN",
  "FacilityURL": "www.polysource.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 621471929,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Polysource, Inc",
  "OperatorStr1": "PO Box 916",
  "OperatorStr2": null,
  "OperatorCity": "Piqua",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45356",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Quality / EH&S Manager",
  "FTE": 62,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184837",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-01-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "7",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051336,
      "AltID": null,
      "FacilityID": 1000041680,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000051857,
          "ProcessID": 1000051336,
          "NAICSCode": "32614",
          "_desc": {
            "NAICS_CODE": "32614",
            "NAICS_DESCRIPTION": "Polystyrene Foam Product Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062278,
          "ProcessID": 1000051336,
          "ChemicalID": 115,
          "Quantity": 65809.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562278,
          "ProcessID": 1000051336,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041680,
      "SummaryText": "INTRODUCTION\n\n\n\n    Polysource Inc. is located in Piqua, Ohio and is a manufacturer of Expandable Polystyrene products (EPS).  During the manufacturing process of EPS, Iso-pentane is used as a blowing agent and is an essential key component to the product.  Due to the storage of Iso-pentane in a quantity over the threshold limit of 10,000 lbs., Polysource is subject to compliance with the EPA Risk Management Program.  Due to the nature of codes and regulations continually changing, individuals should not rely on the codes and regulations stated in this document as being completely accurate and all inclusive.  \n\n\n\n    By implementing the Risk Management Plan, it is not only the intent of Polysource to be in compliance with the regulations set by federal and state agencies, but to protect its employees and members of the surrounding community.  The following information contained in this document is intended to be used as a reference to maintain compliance with the RMP.  A copy of this document will be located at a point of use for all employees to access, should an emergency situation arise.  \n\n\n\nREGISTRATION\n\n\n\n    The facility registration has been completed using the RMP*e-Submit program.  The information contained in the registration is available on the internet or can be requested in hard copy form.  Requests by the public for information pertaining to the RMP will be dealt with by the President/CEO.  \n\n\n\nPOPULATION DATA\n\n\n\n    Based on OAC 3745-104-12 Population Data, it is stated that \"the owner or operator shall estimate the population in the RMP.\"  The population data shall include information pertaining to residences, institutions (schools, hospitals etc.), recreational areas and industrial buildings.  It is required that the most current census data is used when developing this information.  Based on the current calculations the 2010 census data was used to determine the population data for the program.  Appendix A describes the means to which the information was deve"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041680,
      "SummaryText": "loped to determine the population data.\n\n\n\nHAZARD REVIEW\n\n\n\n    Assessing the hazards associated with the RMP is very important in determining the success of the program.  The items listed below are key items that contribute to the Hazard Assessment.  These items were reviewed and compiled to satisfy the requirement of OAC 3745-104-15 Hazard Assessment.\n\n    Material Stored Above Threshold Quantity\n\n    Appendix B contains the information used in determining the maximum amount of Iso-pentane stored at the facility.  These figures shall not be exceeded based on their relevance to the maximum quantity that can be held by the storage tanks.  \n\n\n\n    Worst-Case Release Scenario\n\n    The determination of the worst-case scenario and the alternative release scenario were conducted using RMP*Comp: (http://www.epa.gov/osweroe1/content/rmp/rmp_comp_download.htm)\n\nThe Worst-Case Release endpoint is 0.1 miles.  Within this distance there are no industrial receptors at this time.  There are a minimal number of residences that are potentially within this limit.  These residences are potentially in the limit based on the tolerances of the tools used in developing the population data.  The Alternative Scenario is less than 0.1 miles.  Based on the distance on the Alternative Scenario, there will be no impact on surrounding residences or other structures.  The results from the RMP*Comp for Worst-Case and Alternative Case can be found in Appendix B.  The maximum tank capacity is also located in Appendix B.\n\n\n\n    5-Year Accident History\n\n    During the past 5 years, the facility has not had an accidental release of Iso-pentane which resulted in death, injury, or an offsite impacts.  The facility has never had an accidental release in the history of the program.  Measure will always be taken to ensure that the facility remains at a 0% accident history.  If an accident does occur that fits the RMP criteria, an accident investigation will take place and proper changes to procedures will take place after rev"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041680,
      "SummaryText": "iew by the management team.  \n\n\n\n    Review and Update\n\n    The President/CEO or designee will be responsible for the development, implementation and maintenance of the RMP.  A periodic review will be conducted to determine if any changes are needed to the RMP.  Every 5 years, the plan will be re-evaluated and re-submitted to the EPA.  If major changes occur within the 5 year period a revised RMP must be submitted.  Major changes include, but not limited to: changes in the quantity stored, worst-case scenario situations, and major changes to the Census Data.  An electronic file has been created on the server which contains the proper checklists needed to perform a Hazard Review.  \n\n     \n\nPREVENTION PROGRAM\n\n\n\n    Safety Information\n\n    A current MSDS relating to the Iso-pentane is located in the MSDS station outside of the supervisor's office.  The MSDS was used in the development of the proper PPE and Engineering measures in regards to working with Iso-pentane.  The safety manager will conduct periodic reviews to ensure that the MSDS is always current as well as ensuring the proper PPE is available for working with Iso-pentane.  \n\n\n\n    \n\nHazard Assessment\n\n    An evaluation of the following information has been reviewed and it has been determined that the process meets Program Level 2 criteria.  Based upon the most recent Census data for the facility, it is operating under NAICS code 326140, and the facility is not subject to OSHA PSM Standard CFR 1910.119.   The major hazards associated with handling of Iso-pentane are flammability and toxicity.  Iso-pentane can cause eye and skin irritation, therefore PPE in the form of safety glasses, and hand protection should be worn when coming into contact with Iso-pentane.  \n\n\n\n    Iso-pentane is a flammable material with a flash point of <-60?F.  When working with the Iso-pentane, fire extinguishers must be accessible.  \"No Smoking\" signs are posted in the appropriate areas.  Piping, valves and other parts of the Iso-pentane system are service"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041680,
      "SummaryText": "d regularly by maintenance personnel to ensure integrity of the system.  \n\n    Another potential hazard to the Iso-pentane system is the risk of human error.  Human error possesses the highest threat to an accidental release.  Only trained and competent individuals are permitted to service or work with the Iso-pentane system.  \n\n     A Hazard Assessment will be conducted annually to ensure the safety of the system.  The assessment must include a human error inspection.  An electronic folder has been created on the shared drive, which contains the necessary items needed for a hazard assessment.  \n\n\n\nOperating Parameters\n\n    The normal operating conditions for the tanks at atmospheric pressure is less than 0.5psig.  The conservation value, for normal venting, will prevent the tank pressures of exceeding 2.0psig.  The tanks are equipped with emergency rupture disks that area rated for 2.5psig (as stated in NFPA 30).  The based on the 2 safe-guards installed on the tanks (vents and rupture disks) the chance of over pressurization is minimal.  The operating temperature of the tanks (at atmospheric pressure) is expected to be within 10 degrees F of the ambient air temperature. The Iso-pentane is distributed to the manufacturing area piping system.  The Iso-pentanes is moved using a pump that operates at a maximum operating pressure of 90psig.  The normal operating pressure of the pumps is 70psig +- 5psig.  If the pressure exceeds 90psig, a pressure relief will activate preventing the over pressurization of the piping.  In the event of a major drop in pressure, an automatic shut-off will deactivate the pump.  This will prevent an accidental release into the production area.  Another safety measure that is in place is the Emergency Shut-Off located in the production area.  This is located by line 2 and is clearly marked.  Activating this shut-off will result in the immediate deactivation of the pumping system.  The final stage the Iso-pentane is to have it directly injected into th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000041680,
      "SummaryText": "e extruders.  This is done by have gas pumps pump the Iso-pentane into the machines at approximately 1500-2000 psig.  The system is equipped with check-valves that will prevent increased back pressure.  The pumps at the extruder have a safety set for 3500 psig.  \n\n\n\n    \n\n\n\n\n\nOperating Procedures\n\n    Procedures for unloading during delivery, start-up, and shut-down procedures are all listed in Appendix C.  These procedures will be monitored and changed as processes change.  Only properly trained and competent employees will perform these tasks.\n\n    \n\nTraining    \n\n    On the job training is provided for all employees whom will be working with the Iso-pentane system.  Maintenance personnel will receive more in-depth training due to the nature of servicing the equipment.  General employees will receive training to ensure their ability to properly comply with the operating procedures stated in Appendix C.  Employees will also be trained specifically on the following:\n\nEmergency Evacuation Procedures\n\nHazard Communication\n\nPPE\n\nWorst-Case Scenario Release\n\nImportance of RMP\n\n\n\nMaintenance\n\n                The Iso-pentane system is listed in the Polysource PM program.  The PM program is used as a tool to routinely check and service all items in the facility.  Maintenance documents pertaining to the Iso-pentane system will be maintained for 5 years. The ongoing mechanical integrity of the Iso-pentane system is established through our Preventative Maintenance Program called KEEP TRAK software.  The Polysource PM program is managed by the Maintenance Manager and includes ALL mechanical equipment in the Polysource Facility.  The Iso-pentane storage tanks are serviced on a routine, quarterly basis.  The equipment is inspected using service manuals, process descriptions and expertise of the inspector.  The only authorized employees permitted to work on equipment at Polysource are maintenance employees.  The conditional term of the employment is that they possess all the required knowledge and"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000041680,
      "SummaryText": " experience associated with services mechanical and electrical systems within Polysource.  Additional hands-on training is provided for maintenance employees who require additional instruction.\n\n\n\n    \n\nCompliance Audits\n\n    Compliance audits will be conducted every 3 years.  The audit sheet used can either be obtained from the \"Compliance Audit Folder\" located on the server, or from the EPA website.  The audits will be completed by a competent individual, and will use the NFPA 30 as a guideline.  \n\n\n\n    Inspections\n\n    The storage tanks were initially inspected using the API 650/653 standard.  Based on current guidelines the tanks will need inspected every 10 years using the API 653 standard as long as the tanks are not moved or altered in a drastic manner.  These inspections will be done by an outside vendor and records will be maintained by the maintenance manager.  \n\n    Annual Inspections will be completed by the RMP representative.  Each inspection will be retained for a minimum of 5 years to show compliance to the RMP requirements.\n\n\n\nEMERGENCY RESPONSE \n\nAll employees receive training on the emergency response program.  This program will be evaluated regularly to determine if changes are needed.  Appendix D contains a copy of the Emergency Response Plan.  An Emergency Contact list is also located in Appendix E with the pertinent people to contact in the event of an emergency.  \n\n\n\n\n\nAPPENDIX A\n\n\n\nPopulation Data\n\n\n\n\n\n    The population data used or the current RMP was developed by using a variety of tools.  The Worst-Case and Alternative Release scenarios were developed by using RMP*Comp.  This tool determined that a Worst-Case scenario would affect a 0.1 mile radius, while an Alternative scenario would affect less than 0.1 mile (See Appendix B).  A Bushnell laser range finder was used to determine that there are residences that are potentially within the .1 mile radius.  Google Earth was used to derive Latitude and Longitude coordinates for Polysource, Inc.  The coordinat"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000041680,
      "SummaryText": "es for the tanks are Latitude: 40.13564 and Longitude -84.22545   When these coordinates were plugged in to Landview 6, it was determined that there are 3 residences within 0.1 mile of the coordinates used.  According to the 2010 Census Data, there is a total population of 8 people within 0.1 mile of the coordinates used.  The Alternative Release Scenario will not affect any population based on the fact that there are no receptors less than 0.1 mile from the coordinates used.  There are no institutions, parks or recreational areas, or schools within the 0.1 mile radius.\n\n\n\nAPPENDIX B\n\n\n\nRMP*Comp was used to determine factors associated with the Hazard Assessment.  \n\n\n\n(A)     \n\na.    Worst-case scenario is based on a vapor cloud explosion with an affected distance endpoint of .1miles.  This was derived using RMP*Comp.  A copy of the RMP*Comp is part of this Appendix B.  The rationale and assumptions used for this program are based off of the MSDS's, and safe work standards in developing the safe work practices associated with Iso-pentane.\n\nb.    The vessels at Polysource are 2 \"bullet-style\" vessels with operating at atmospheric pressure.  The vessels are carbon steel construction butt welded together and painted with exterior elements resistive paint.  The piping and valves used for the movement of the Iso-pentane meet the specifications of standardized gas/fluid containment.  An external engineering contractor was used for the inspection of the vessels and system upon initial installation.\n\nc.    Administrative controls and engineering controls are implemented to reduce the hazard associated with the Iso-pentane system.  Administrative controls consist of training and inspections of the system.  Engineering controls consist of pressure relief valves, routine maintenance and dike walls.\n\nd.    The anticipated effects of these controls are to minimize the accidental worst-case scenario release through prevention and awareness.  The worst-case scenario of a vapor cloud explosion ca"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000041680,
      "SummaryText": "nnot be controlled if it occurs.  This is why prevention is key to the program.  If a worst-case scenario does occur, emergency procedures will be immediate taken i.e. contact emergency services.  \n\n(B)    \n\na.    The alternative release scenario was derived using RMP*Comp.  The speculated alternative release is a smaller puncture hole to the storage tanks.  The scenario identified is the un-monitored flow of Iso-pentane during the release.  This scenario was selected because it is the most likely occurrence that will go temporarily un-noticed, resulting in emergency measures.\n\nb.    Administrative controls and engineering controls will help to prevent this from occurring.  Training, awareness and dike walls are the controls that will help deter this scenario.  The dike walls will be most beneficial in this scenario because they will prevent the Iso-pentane from leaving the containment area.  The dikes were designed to hold the total quantity of the tank which was released.  Annual Inspections of the RMP includes a Human Factors review which aids in assessing and recognizing hazards.  \n\n(C)    \n\na.    The worst case estimated quantity released is 34,833 lbs.  This is determined by taken 6,560 gallons (largest tank) and multiplying it by 5.3 (lbs/gal of pentane).  The release rate is 194 lbs per minute (derived from RMP*Comp).  The alternative release scenario is a vapor cloud fire.  This would have a release duration of 10 minutes (the average time to notice a drop in pentane pressure) and a rate of 25 lbs per minute.  Again, RMP*Comp was used in determining endpoints affected.  \n\nb.    The release rates are based on knowledge and assumptions of calculating the vessel  and flow rates caused by the scenario.  The release rate of the worst-case scenario is based on a large hole in the vessel and the loss of approximately 194 gallons a minute and duration of 10 minutes.  10 minutes is based on the time it would take to notice a rapid drop in the pentane pressure.  The alternative releas"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000041680,
      "SummaryText": "e scenario is a smaller  hole that would dissipate 25 lbs per minute.  Again, the duration of 10 minutes is used based on the time it would take to notice the drop in pressure.  \n\n(D)    The methodology used to determine endpoints is given in RMP*Comp and then GPS coordinates are used to visually determine the receptors in that endpoint.  The distance is measure using a laser range finder.\n\nThe most current census data was used to determine the population and the environmental receptors.  There are no environmental receptors which will be affected and the 2010 census data states that there are approximately 8 people within the endpoints\n\n"
    }
  ]
}