{
  "FacilityID": 1000050779,
  "FacilityName": "Solutia Inc., Indian Orchard Plant",
  "FacilityStr1": "730 Worcester Street",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "MA",
  "FacilityZipCode": "01151",
  "Facility4DigitZipExt": "1089",
  "FacilityCountyFIPS": "25013",
  "LEPC": "Springfield LEPC",
  "FacilityLatDecDegs": "42.153056",
  "FacilityLongDecDegs": "-072.527500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.solutia.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1114818,
  "ParentCompanyName": "Solutia Inc.",
  "Company2Name": "Eastman Chemical Company",
  "CompanyDUNS": 40853731,
  "Company2DUNS": 808898381,
  "OperatorName": "Solutia Inc.",
  "OperatorStr1": "575 Maryville Centre Drive",
  "OperatorStr2": null,
  "OperatorCity": "St. Louis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63141",
  "OperatorZipCodeExt": null,
  "FTE": 380,
  "OtherEPAFacilityID": "01151MNSNT730WO",
  "EPAFacilityID": "100000114985",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "109627",
  "SafetyInspectionDate": "2014-05-15 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-08-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-08-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2015-08-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-08-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.154981,
  "FRS_Long": -72.526419,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064028,
      "AltID": "South Butvar",
      "FacilityID": 1000050779,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000079232,
          "ProcessID": 1000064028,
          "ChemicalID": 29,
          "Quantity": 2300000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000065170,
          "ProcessID": 1000064028,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000053180,
              "Process_NAICS_ID": 1000065170,
              "SafetyReviewDate": "2015-02-03 00:00:00",
              "PHA_Date": "2015-02-03 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Also Layers of Protection Analysis (LOPA)",
              "PHACompletionDate": "2019-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Extreme weather conditions - hot & cold temperatures, high winds, lightning, etc.",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "Yes",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Computer-based process control system",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Relief system quench tanks and chemical collection systems (process sewers)",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Routine walk-through inspections and monitoring by process operators",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-04-14 00:00:00",
              "TrainingReviewDate": "2015-08-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer-based training modules",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Computer-based testing",
              "MaintenanceReviewDate": "2015-04-14 00:00:00",
              "EquipmentInspectionDate": "2015-07-15 00:00:00",
              "EquipmentTested": "Glycol Chiller",
              "ChangeMgmtDate": "2015-05-06 00:00:00",
              "ChangeMgmtReviewDate": "2014-11-05 00:00:00",
              "PreStartupReviewDate": "2015-05-06 00:00:00",
              "ComplianceAuditDate": "2013-05-17 00:00:00",
              "AuditCompletionDate": "2015-12-31 00:00:00",
              "IncidentInvestigationDate": "2015-07-01 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-11-08 00:00:00",
              "HotWorkPermitReviewDate": "2014-06-02 00:00:00",
              "ContractorSafetyReviewDate": "2015-06-05 00:00:00",
              "ContractorSafetyEvalDate": "2012-12-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000065385,
                  "PreventionProgram3ID": 1000053180,
                  "ProcessChemicalID": 1000079232
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000050779,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-12-17 00:00:00",
    "ERTrainingDate": "2015-08-05 00:00:00",
    "CoordinatingAgencyName": "Springfield Emergency Preparedness",
    "CoordinatingAgencyPhone": "4137876720",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "OSHA PSM requirements contained in 29 CFR 1910.119",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000050779,
      "SummaryText": "EXECUTIVE SUMMARY - SOLUTIA INC. INDIAN ORCHARD PLANT\r\n\r\n2015 RISK MANAGEMENT PLAN RESUBMITTAL\r\n\r\nThis resubmittal has been prepared to renew the Risk Management Plan (RMP) for the Solutia Inc. Indian Orchard Plant. This renewal updates the RMP to reflect the following changes:\r\n- Removal of the Adhesives process unit.  This process unit was physically shut down as of October 1, 2014 and no longer presents a worst-case toxics (vinyl acetate monomer [VAM]) release scenario nor will it be included in a Level 3 Prevention Program.\r\n- As a result of removal of the Adhesives unit, the Building 89 Warehouse no longer handles VAM-containing materials and as a result, is no longer covered under our RMP.\r\n- Update of the worst-case and alternative toxics release scenario to reflect operations in South Butvar.  The bulk VAM tank is now considered part of South Butvar for this analysis.\r\n- As corrected in June, within 30 days of his departure, John Weiss is no longer the Person Responsible for RMP implementation or the Emergency Contact.\r\n- Updates to all relevant process-related dates for safety inspections, Process Hazard Analyses (PHAs), etc.\r\n\r\nSolutia Inc. (Solutia) is a wholly owned subsidiary of Eastman Chemical Company (based in Kingsport, TN), but still maintains a corporate structure in St. Louis, MO.\r\n\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nAt Solutia's Indian Orchard Plant, we are committed to operating and maintaining all of our processes, especially those using federally-regulated hazardous substances, in a safe and responsible manner. We use a combination of accidental release prevention programs, process safety management systems, and emergency response planning to help ensure the safety and health of our employees, the public, and the environment. This Executive Summary provides an overview of the comprehensive risk management and process safety procedures and practices that we have designed and implemented at the Indian Orchard Pl"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000050779,
      "SummaryText": "ant and includes information on the following:\r\n- A description of our facility and the use of substances regulated by the EPA's Risk Management Program Rule.\r\n- An overview of our accidental release prevention programs.\r\n- A five-year accident history for accidental releases of chemicals regulated by the Risk Management Program rule.\r\n- An overview of our emergency response programs.\r\n- An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the surrounding community, or the environment.\r\n\r\n\r\nFACILITY (STATIONARY SOURCE) DESCRIPTION\r\n\r\nThe Indian Orchard Plant was originally established by the Fiberloid Corporation in 1904 and purchased by Monsanto Company in 1938. In 1963, Monsanto acquired the Shawinigan Resins facility on the opposite side of Grochmal Avenue, creating the current site. The plant took the Indian Orchard name in 1982 and following a spin-off from Monsanto in 1997, Solutia Inc. was formed. The site includes manufacturing units producing high-value specialty products that include Saflex interlayer, and Butvar resin. The site also includes a Technology Center, complete with research laboratories and pilot plant facilities, finished product warehouse buildings, wastewater collection and neutralization facilities, a powerhouse, analytical laboratories, and office buildings. In addition, Ineos Melamines, and MassPower each own and operate facilities within the borders of the Indian Orchard site. Soca USA, leases a former warehouse building from Solutia to house a small recycling process they own and operate at the site as well. The Adhesives Department that was owned by Cytec Industries, Inc. (but operated and maintained by Solutia employees), was permanently shut down by October 1, 2014.  As a result, the processes related to the Adhesives department have been removed from this RMP.  The entire plant occupies approximately 250 acres and Solutia currently empl"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000050779,
      "SummaryText": "oys approximately 380 people from the greater Springfield area and the surrounding communities. Additional employees for Ineos Melamines, MassPower, Cytec Industries, and Soca USA also work at the site. \r\n\r\n\r\nREGULATED SUBSTANCES\r\n\r\nIn our current production processes, we use only one chemical that the EPA has identified as having the potential to cause significant offsite consequences in the event of a substantial accidental release; vinyl acetate monomer.\r\n\r\nVinyl acetate monomer is shipped by our suppliers as a liquid in approved railcars. Three(3) railcars, on average, are typically present at the site at any given time; however, a maximum of 5 railcars may be stored at the site to support plant operations. These railcars are unloaded into an aboveground storage tank that has a capacity of approximately 200,000 gallons and is filled to 80% capacity or 160,000 gallons. This tank is located inside a concrete containment structure designed to hold the entire contents of the tank in the event of an accidental release. The plant's South Butvar Department utilizes vinyl acetate as a key raw material in the production of polyvinyl butyral (PVB) resin. This resin is the primary ingredient in the manufacture of a plastic sheet (interlayer) that is \"sandwiched\" in laminated safety glass for automotive and architectural applications. A significantly smaller \"Day Tank\" of approximately 5,000 gallons capacity, is utilized to support daily production needs.\r\n\r\nOur accidental release prevention programs, process safety management systems, and contingency planning efforts help us effectively manage the potential hazards that are posed to our employees, the public, and the environment by our use of vinyl acetate and all other chemicals at the site.\r\n\r\n\r\nWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\r\n\r\n- Worst-Case:  South Butvar - Release of full contents of a rail car of Vinyl acetate (195,000 pounds), which had been in the sun, heating the VAM to 80F.  Released at rate of 4,510"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000050779,
      "SummaryText": "pounds/min - 43 minutes.  Distance to endpoint is 6.2 miles.\r\n- Alternative:  South Butvar - Release of partial contents (70,000 pounds) of vinyl acetate into secondary containment from a 2\" hole in the side of the bulk Vinyl Acetate Monomer tank (200,000 gallon tank).  Released at rate of ~1,600 pounds per minute for a duration of ~45 minutes.  Distance to endpoint is 0.7 miles.\r\n\r\nMore information on these releases is available in the submitted RMP scenarios.\r\n\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nSolutia employs a systematic and proactive approach to preventing accidental releases of hazardous chemicals at the Indian Orchard Plant. Our process safety management and risk management systems include each of the key components of a successful prevention program including:\r\n- Development and maintenance of process safety information.\r\n- Completion and revalidation of process hazards analysis (PHA) studies.\r\n- Development, review, and use of written operating procedures.\r\n- Development and administration of employee training programs.\r\n- Mechanical integrity programs for the inspection, testing, preventive maintenance, and repair of plant equipment.\r\n- Management of change procedures to evaluate, approve, and communicate new or modified equipment, process conditions, raw materials, etc.\r\n- Execution of pre-startup safety reviews.\r\n- Completion of program compliance audits evaluating all elements of our programs.\r\n- Incident investigations for injuries, spills, fires, and near miss events.\r\n- Employee participation in all elements of our process safety and risk management prevention programs.\r\n- Implementation of hot work permitting requirements.\r\n- Evaluation, qualification, and management of contractors utilized at the site.\r\n- Additional identification of potential environmental and safety risks, reviewed annually, via the American Chemistry Council's Responsible Care&reg; 14001 (RC 14001) program.\r\n\r\nAs part of"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000050779,
      "SummaryText": "our prevention efforts, we have also implemented the following chemical-specific prevention steps:\r\n\r\nDESIGNING for Safety:\r\n- Corporate engineering standards established for the design, construction, and installation of process equipment and related systems based on recognized and generally accepted good engineering practices.\r\n- Tanks, vessels, and piping designed, constructed, and tested in accordance with American Society of Mechanical Engineers (ASME) and American Petroleum Institute (API) codes and standards.\r\n- All systems and components designed to meet or exceed government standards.\r\n- Hazardous area classifications determined for electrical installations and equipment in or near process areas.\r\n- Computer-based process control systems that continuously monitor process parameters, provide warning alarms, and take actions when necessary, to prevent process deviations that could lead to a chemical release or other undesired event.\r\n- Secondary containment structures installed around all storage tanks.\r\n- Sprinkler systems, deluge systems, and fixed fire monitors installed throughout the plant. These systems are inspected, tested, and maintained in accordance with National Fire Protection Association (NFPA) codes and standards.\r\n- Containment structures and collection systems installed for loading and unloading of railcars and\r\ntank trucks.\r\n- Safety-critical systems designed for \"fail safe\" conditions during a loss of utilities.\r\n- Use of instrumented protective systems and alarms for critical process control systems.\r\n- Multiple layers of protection for all safety critical systems and/or operations.\r\n\r\nMAINTAINING our Plant:\r\n- Inspection, testing, and preventive maintenance tasks scheduled and conducted in accordance with recognized industry codes and standards, manufacturer's recommendations, and decades of operating experience.\r\n- Written mechanical integrity procedures developed and implemented to specify site requirements.\r\n- Process and equipment main"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000050779,
      "SummaryText": "tenance performed by highly-skilled and trained plant mechanics.\r\n- Inspection and testing of tanks, pressure vessels, and piping includes use of non-destructive methods such as hydrostatic pressure testing, ultrasonic thickness measurement, radiography (xray), and dye penetrant testing, among others.\r\n- Inspection, testing, and preventive maintenance tasks are scheduled and tracked by a computer based system that automatically generates work orders for activities that are due for completion.\r\n\r\nOPERATING Safely:\r\n- All site operations are continuously monitored and controlled by computer systems that automatically shut down equipment and systems to preserve safety.\r\n- Process control rooms are continually staffed to monitor operating conditions and provide immediate response to process deviations.\r\n- All process operators are trained and tested on the operating procedures and safe work practices required for their department including annual refresher training.\r\n- Each manufacturing department has developed process-specific operating procedures (SOP's), work instructions, and standard operating conditions (SOC's) documents, which address all process operations including normal operations, emergency operations, and emergency shutdown.\r\n- Written operating procedures and supporting documents are developed, maintained, and reviewed in accordance with OSHA, EPA and Solutia company requirements.\r\n- The inventories of chemicals on-site are minimized, where possible, to reduce risk while satisfying manufacturing needs.\r\n- Random drug testing is conducted for all plant personnel performing safety-critical functions at the site.\r\n\r\nAUDITING our Operations:\r\n- Solutia was awarded Responsible Care&reg; 14001 certification in October 2007. The most recent program recertification audit was completed in September 2013 and a surveillance audit was just conducted in August 2015. Internal compliance audits are conducted quarterly by the site HSES staff.\r\n- Compliance audits of the"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000050779,
      "SummaryText": "process safety management and risk management prevention programs are conducted at least every three years. \r\n- Comprehensive audits of safety, health, industrial hygiene, property protection, process safety, and occupational medicine are conducted by Solutia Corporate ESH every three to five years. \r\n- Routine external audits and/or inspections are conducted by OSHA, EPA, U.S. Department of Transportation, and Massachusetts Department of Environmental Protection.\r\n- Corporate environmental compliance audits are conducted every five years. \r\n- Environmental self-audits conducted and documented by HSES staff monthly.\r\n- Process hazards analysis studies conducted for each covered process by multi-disciplined teams at least once every 5 years and more frequently for major project modifications and process expansions. \r\n- Audits of all 4 permitted processes (Breaking into Process, Confined Space Entry, Lockout/Tagout, and Hot Work) are conducted throughout the plant every month, throughout the course of each month, by a designated team consisting of personnel from engineering, department supervision, ESHS, and plant management. Audit results are documented, compiled, and reported to identify areas for improvement.\r\n- Chemical spills, injuries, fires, security incidents, near misses, and other events are reported and investigated.\r\n\r\nThe above individual elements of our program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we do business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\r\n\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nSince our previous plan submittal in August 2010, there have been no accidental releases from our RMP covered processes that resulted in deaths, injuries, or significant property damage at the site. In addition, there have been no incidents resulting in offsite"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000050779,
      "SummaryText": "deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\n\r\nEMERGENCY RESPONSE PROGRAMS\r\n\r\nSolutia has developed written emergency response plans to address the various federal, state, and local regulatory requirements for emergency response planning. Our program provides the essential procedures and training for effectively protecting workers, the public, and the environment during emergency situations. Furthermore, we coordinate our facility emergency response procedures with the community emergency response plan.\r\n\r\nTraining and Preparation:\r\n- The site has a well-established Emergency Response Team consisting of members trained in first aid and emergency medical response, rescue including confined space, hazardous materials incidents and firefighting at an industrial facility.  Training and drills include interior and exterior structural fire-fighting, hazardous material response and control, confined space and technical rescue, first aid, CPR, and use of automated electronic defibrillator (AED).\r\n- Dedicated fire house with training facility\r\n- Fire truck - E-One 500 gallon pumper with 250 gal AR-FFF Foam capacity. \r\n- Hazmat Truck - equipped with PPE, spill control and containment and decontamination equipment\r\n- Rescue trailer - equipped with rescue PPE and retrieval gear, ropes & rigging, patient packaging SAR breathing apparatus, etc.\r\n- Dry Chem Wagon - Ansul 500 pound capacity Purple-K dry chem agent\r\n- Foam wagon - 1000 gallon capacity AR-FFF firefighting foam, equipped with two 500 GPM nozzles\r\n- Additional emergency and spill response equipment staged throughout the plant for immediate use.\r\n- Specialized teams and technical specialists dedicated to off-site response for hazardous material transportation emergencies.\r\n- Personnel in chemical manufacturing departments are trained in emergency shutdown procedures.\r\n- Members of Springfield Fire Department and the Emergency Preparedness group tour the site and our op"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000050779,
      "SummaryText": "erations on a periodic basis.\r\n- Solutia ERT training and drills are conducted periodically with municipal fire, police, and ambulance crews.\r\n- Solutia maintains active participation on the City of Springfield Local Emergency Planning Committee.\r\n\r\nChemical Release Response:\r\n- Department operators proceed to shut down and isolate the affected system.\r\n- Emergency Response Teams alerted and dispatched through the plant Guard House, which is staffed 24/7/365.\r\n- Plant Fire Truck and Hazardous Materials Truck are dispatched to the scene of the incident.\r\n- Pre-planned drill scenarios for chemical releases are put into action.\r\n- Site HSES personnel are alerted and dispatched.\r\n- Springfield Fire and Police Departments and the LEPC are contacted to activate the city emergency plan, if necessary.\r\n\r\nCommunity Emergency Response:\r\n- Once notified by Solutia, Springfield Emergency Management System notifies the local public safety officials.\r\n- Local law enforcement and fire departments will alert the community via public address speakers, radio, television, and/or door-to-door notification and will advise whether to shelter-in-place or evacuate, if necessary.\r\n- Affected personnel will follow emergency procedures.\r\n\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nSolutia's Indian Orchard Plant is committed to the principals of continuous improvement in all areas of safety. This is essential to our participation in the American Chemistry Council's Responsible Care&reg; 14001 Program. Our plant is constantly upgrading its operations and safety systems to improve the level of protection to our employees, the community, and the environment we operate in.\r\n\r\nProgress continues to be made in the improvement of the process safety and risk management systems at the Indian Orchard Plant, and within Solutia as a whole, since the previous RMP resubmittal. Some examples of these improvements include, but are not limited to, the following:\r\n\r\nSite-Wide Emergency Drill: Solutia plans to cond"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000050779,
      "SummaryText": "uct a site-wide emergency drill in early September 2015.  Planned scenarios include utilization of the onsite ERT to address a process-based emergency.\r\n\r\nProcess Hazard Analysis (PHA): At the Indian Orchard Plant, revalidation studies were conducted to evaluate the processes in the South Butvar Department in February 2015.\r\n\r\nLayers of Protection Analysis (LOPA): The Solutia LOPA technique will continue to be utilized during the revalidation of PHAs in the South Butvar Department.\r\n\r\nLockout / Tagout (LOTO) Program: The LOTO program at the Indian Orchard Plant was recently updated as part of an effort to continuously improve the program.  This program will continue to be reviewed and audited in order to ensure the proper control of hazardous energy, particularly in PSM and RMP affected units."
    }
  ]
}