{
  "FacilityID": 1000020801,
  "FacilityName": "ALVARADO WATER TREATMENT PLANT",
  "FacilityStr1": "5540 KIowa Drive",
  "FacilityStr2": null,
  "FacilityCity": "LA MESA",
  "FacilityState": "CA",
  "FacilityZipCode": "91942",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06073",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.818333",
  "FacilityLongDecDegs": "-117.046083",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "CITY OF SAN DIEGO WATER DEPARTMENT",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Jesus Meda",
  "OperatorStr1": "2797 Caminito Chollas",
  "OperatorStr2": null,
  "OperatorCity": "San Diego",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92105",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": "CAD 981993090",
  "EPAFacilityID": "100000143855",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-08-01 00:00:00",
  "SafetyInspectionBy": "County of San Diego Hazardous Materials Inspection",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2015-09-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-03-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-03-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-03-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 32.779986,
  "FRS_Long": -117.039964,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "2000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000025340,
      "AltID": "Water Treat- Disinfection",
      "FacilityID": 1000020801,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000030124,
          "ProcessID": 1000025340,
          "ChemicalID": 62,
          "Quantity": 88000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000025706,
          "ProcessID": 1000025340,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000021745,
              "Process_NAICS_ID": 1000025706,
              "SafetyReviewDate": "2010-03-01 00:00:00",
              "PHA_Date": "2006-10-18 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Sabotage",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-04-21 00:00:00",
              "TrainingReviewDate": "2010-01-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-03-01 00:00:00",
              "EquipmentInspectionDate": "2010-09-24 00:00:00",
              "EquipmentTested": "Chlorine Scrubber",
              "ChangeMgmtDate": "2004-12-05 00:00:00",
              "ChangeMgmtReviewDate": "2010-03-01 00:00:00",
              "PreStartupReviewDate": "2003-02-05 00:00:00",
              "ComplianceAuditDate": "2010-07-02 00:00:00",
              "AuditCompletionDate": "2011-07-02 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-03-01 00:00:00",
              "HotWorkPermitReviewDate": "2010-03-01 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2010-03-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000025709,
                  "PreventionProgram3ID": 1000021745,
                  "ProcessChemicalID": 1000030124
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000020801,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-12-13 00:00:00",
    "ERTrainingDate": "2009-04-13 00:00:00",
    "CoordinatingAgencyName": "County Dpt of Env Health HazMat",
    "CoordinatingAgencyPhone": "6193382284",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000020801,
      "SummaryText": "Policy:\nThe City of San Diego Water Department has and continues to design facilities, operate and maintain equipment and commit the personnel and resources to meet or exceed industry standards and regulatory requirements.  The City developed and implemented the City's Process Safety Management/ Risk Management Prevention Program that provides a systematic approach to employee involvement, safety awareness and program assessment.\n\nPlant Description:\nThe Alvarado Water Treatment Plant was built in the early 1950's and became an architecture center piece of the community due to its beauty and mission style design. The Alvarado Water Treatment Plant has a maximum water treatment capacity of 150-million gallons per day (mgd), with a current capital improvement project goal of expanding treated water capacity to 200 mgd. The facility is located on a mesa on relatively flat terrain bounded by the Lake Murray Reservoir to the north, and by residential areas in other directions bordering the City of La Mesa.  There is elevated terrain across the reservoir, and downward-sloping terrain to the south.\n\nAlvarado Water Treatment Plant uses a combined form of chlorine to disinfect water, making it suitable for use in the City of San Diego's drinking water distribution system and for sale to other agencies. The chlorine is received in one-ton pressurized liquid cylinders at the Chlorine Storage Room in the Raw Water Chemical Building.\n\nCommitment:\nThe Alvarado Water Treatment Plant has a well trained and committed operations and maintenance staff with a record of over 50 years of using chlorine safely.  To support the efforts of continued safe handling and use of chlorine at the Alvarado Water Treatment Plant, senior management has committed to the development of a comprehensive Process Safety Management Program under the guidelines of State and Federal mandates which has involved complete engineering reviews of the chlorine feed system and design certification.\n\nProgram Complianc"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000020801,
      "SummaryText": "linder releasing the entire contents over a 10 minute period.   The distance of impact (greater than 3 parts per million [ppm]) extended 2.4 miles (12,600 feet) from the storage facility. Alternative scenarios, using only the passive treatment of the building, were developed to assess the impacts of release events that have the possibility of occurring at the treatment plant.  The chlorine endpoint distances were reduced to 0.50 mile.\n\nAlternative scenarios, assuming worst-case release parameters and using active and passive treatment, were developed to assess the impacts of release events that have the possibility of occurring at the treatment plant. Active treatments include process leak detection and monitoring, chlorine chemical scrubber, and pressure relief valves. The combination of the passive (e.g. building) and the active treatments reduce the endpoints to less than 100 feet which is well within the facility's property.\n\nSafety Elements:\nSafety elements include administrative controls, engineering controls and personal protective equipment (PPE).  \n\nAdministrative elements may include but are not limited to:\n- Standard operations\n- Maintenance procedures\n- Training\n- Record Keeping\n\nEngineering controls may include but are not limited to:\n- Facility alarms\n- Isolation Valves\n- Chlorine Scrubbers\n\nPPE controls may include but are not limited to:\n- Self Contained Breathing Apparatus \n- Chemical Protective Overalls\n- Safety Goggles\n\nSeveral administrative and engineering controls were upgraded to enhance the facility's emergency response capabilities if a chlorine leak were to occur. They consist of: \n\n1)\tChlorine leak detection sensors installed in both the chlorine cylinder storage room and chlorine feeder room which activate alarms in the plant when low-levels of chlorine are detected; \n\n2)\tThe Plant Control System collects these data, making the information immediately available to the Plant staff, enabling them to assess and respond to the release from se"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000020801,
      "SummaryText": "e:\nThe Risk Management Prevention and Process Safety Management Programs have been developed and implemented.  The Risk Management Prevention is in fulfillment of the United States Environmental Protection Agency (EPA) 40 CFR PART 68 - Chemical Accident Prevention Provisions and the California Code of Regulations Title 19, Division 2, Chapter 4.5 - California Accidental Release Prevention (CalARP) Program.  The Process Safety Management Program is in fulfillment of the Occupational Health and Safety Administration's (OSHA) 1910.119, as well as Cal/OSHA's California Code of Regulations, Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials.\n \nAs with the use of any hazardous chemicals, the use of chlorine in this treatment process poses the potential for an accidental release that could have offsite consequences.  It is for this reason that several years ago, under the provisions of 40 CFR PART 68, the Alvarado Water Treatment Plant conducted an assessment of offsite consequences of accident scenarios involving the uncontrolled release of chlorine to the surrounding environment.  Under the provisions of the rule, the treatment process used at the Alvarado Water Treatment Plant is considered a Program 3 process, and as such conducted an analysis of: (1) a worstÂ¬case release scenario and (2) one or more alternative release scenarios. The analysis of offsite consequences produced information incorporated into the Risk Management Plan (RMP) which covers population and environmental receptors in the environs within the affected areas.\n\nOffsite Consequence Analysis:\nIn accordance with 40 CFR PART 68, Subpart D, worst-case release scenarios and alternative scenarios are required to be completed to determine the distance to endpoint (e.g., under worst-case weather, the substance could travel X distance before dispersing enough to no longer pose a hazard to the public).  \n\nThe worst-case scenario for chlorine assumed a one-ton (2,000 pound) cy"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000020801,
      "SummaryText": "veral locations within the Plant; \n\n3)\tAn automatic chlorine shut-off system has been installed to minimize the volume of a chlorine release by securing the chlorine at the cylinders; \n\n4)\tThe chlorine storage room was constructed as a containment facility to eliminate the free discharge of chlorine to the atmosphere. A critical component of this system is the scrubber, which is capable, in the event of a release, of neutralizing 2,000 pounds of chlorine. This scrubber is activated by data acquired by the leak sensors, and may be initiated manually by Plant staff; \n\n5)\tSeveral safe-work-practices for the operations and maintenance sections have been developed in conjunction with other safety programs to ensure employees work and respond safely.\n\nEmergency Response:\nThe Alvarado Water Treatment Plant, in conjunction with the Water Department Emergency Management Coordinator, have developed and tested a Chlorine Emergency Response Plan. The Emergency Response Plan was developed to support the Water Plant Operator in the event a chlorine release occurs and additional resources are needed to mitigate the situation. The San Diego Fire Department, Hazardous Materials Incident Response Team is dedicated to respond to our water plants if we have an incident. The Alvarado Water Treatment Plant has a Business Plan that identifies evacuation points on the site and provides additional emergency information about chlorine and additional contacts if needed.\n \nThe Chlorine Emergency Response Plan describes in detail the procedures for responding to a chlorine release or chlorine release threat.  The Plan contains a flow chart which visually presents this information for both controlled and uncontrolled release scenarios.  The basic emergency response steps include:\n- Verification/Situation Assessment\n- Isolation\n- Notification\n- Reporting\n- Remediation & Recovery\n- Incident Investigation\n- Implementation of Improvements\n- Training\n\nThe Alvarado Water Treatment Plant is curre"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000020801,
      "SummaryText": "ntly going through upgrades of its treatment processes. The new Chlorine Facility with chlorine detection, containment, and scrubbing capabilities was completed in 2003. Additionally, upgraded security systems were added to all access points to allow the duty operator to monitor the complete facility with ease.\n\nAccident History:\nThe City has maintained a clean record of accidental releases of acutely hazardous materials with as of January 28, 2010, no significant accidental releases of chlorine occurring within the last five years requiring plant evacuation or requiring off site evacuation or consequences.\n \nCompliance Audit:\nThe most recent compliance audit was conducted in accordance with RMP/PSM requirements by an outside consultant in 2010.  The audit was to evaluate the adequacy of the PSM and RMP programs and provide recommendations of improvements."
    }
  ]
}