{
  "FacilityID": 1000081042,
  "FacilityName": "Bama Frozen Dough",
  "FacilityStr1": "2435 N. Lewis Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Tulsa",
  "FacilityState": "OK",
  "FacilityZipCode": "74110",
  "Facility4DigitZipExt": "2121",
  "FacilityCountyFIPS": "40143",
  "LEPC": "Tulsa LEPC",
  "FacilityLatDecDegs": "36.189270",
  "FacilityLongDecDegs": "-095.956360",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bama Frozen Dough",
  "OperatorStr1": "2435 N. Lewis Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74110",
  "OperatorZipCodeExt": "2121",
  "RMPContact": "Jason Belanger",
  "RMPTitle": "Plant Manager",
  "FTE": 286,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000047059",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-03-12 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.18964,
  "FRS_Long": -95.95807,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101302,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000081042,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102562,
          "ProcessID": 1000101302,
          "NAICSCode": "311813",
          "_desc": {
            "NAICS_CODE": "311813",
            "NAICS_DESCRIPTION": "Frozen Cakes, Pies, and Other Pastries Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126950,
          "ProcessID": 1000101302,
          "ChemicalID": 56,
          "Quantity": 57000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000626950,
          "ProcessID": 1000101302,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081042,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Bama Frozen Dough facility abides by the emergency response procedures and policies detailed in the Bama Safety Plan manual.  This Plan was designed to meet the following objectives:\n\n1.)    To save lives.\n\n2.)    To minimize and avoid injuries.\n\n3.)    To protect the environment.\n\n4.)    To minimize property damage.\n\n\n\nBama Frozen Dough maintains an emergency response team whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan will be reviewed and updated to ensure compliance with the PSM and RMP regulations, as well as to incorporate any facility changes.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Bama Frozen Dough facility prepares frozen bakery products for distribution.  The refrigeration process, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for process equipment and cold storage rooms.  Typical operating conditions range from vacuum (approximately 15.5\" Hg) on the low pressure side of the system to 160 psig on the high side.\n\n\n\nAmmonia is used as the refrigerant in the refrigeration process.  The total ammonia inventory is 57,000 pounds.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\n\n\n\n1)      OSHA's Process Safety Management (PSM); and\n\n2)      EPA's Risk Management Program (RMP).\n\n\n\nThe facility also follows recognized "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081042,
      "SummaryText": "standards and good engineering practices using state and local codes and IIAR standards.\n\n\n\nIt is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  The facility has also installed ammonia sensors throughout the facility which will alert plant personnel in the event of an ammonia detection.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nA review of the Bama Frozen Dough's five year accident history showed that there have been no incidents at the facility that meet the RMP criteria for a reportable accident (onsite deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place).  In addition, there have been no significant releases of ammonia that exceeded the Federal Reportable Quantity of 100 pounds.\n\n\n\nWithin the course of the last five years, the facility has experienced small ammonia leaks from the system, however none of these incidents meet the criteria discussed above.  As required, these incidents are investigated following the procedures within the Incident Investigation program.  The objective of the investigation is to determine the root cause of the leak and any contributing factors, and to devise and implement corrective actions to prevent recurrence of these incidents.  Incident investigation reports for the last five years are retained onsite.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nBama Frozen Dough has an Emergency Response Program, which includes procedures for responding to ammonia releases and other foreseeable emergencies that could occur onsite.  The"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081042,
      "SummaryText": " facility has an Emergency Response Team, and team members receive initial 24-hour training and an 8-hour refresher on an annual basis.  Incident Commanders also receive 8-hour initial training and 8-hour annual refresher training.  All team members are fit tested and respiratory trained annually.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nBama Frozen Dough has worked to address safety issues as they arise in a continued effort to ensure a safe work environment.  A Compliance Audit was completed on June 26, 2017, and the Process Hazard Analysis (PHA) was revalidated on May 6, 2019.  Prior to the revalidation, a PHA was conducted on September 12, 2018 to address the installation of a new glycol chiller.  Recommendations were generated during these studies to improve process safety, and the facility is working towards completing these action items.  In addition, Bama Frozen Dough plans to further improve safety at the facility by conducting additional training, key maintenance related tests/inspections, and coordinating emergency response activities with the Tulsa County LEPC.\n\n"
    }
  ]
}