{
  "FacilityID": 1000001273,
  "FacilityName": "Tyson Prepared Foods, Fort Worth",
  "FacilityStr1": "7401 Will Rogers Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Fort Worth",
  "FacilityState": "TX",
  "FacilityZipCode": "76140",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.639722",
  "FacilityLongDecDegs": "-097.311111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.Tyson.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 600306690,
  "ParentCompanyName": "Tyson Foods, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 6903702,
  "Company2DUNS": 0,
  "OperatorName": "Tyson prepared Foods, Inc",
  "OperatorStr1": "7401 Will Rogers Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Fort Worth",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76140",
  "OperatorZipCodeExt": null,
  "RMPContact": "Greg Irby",
  "RMPTitle": "Plant Manager",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000119935",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0-02198",
  "SafetyInspectionDate": "2002-05-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.6408,
  "FRS_Long": -97.31262,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001659,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000001273,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001742,
          "ProcessID": 1000001659,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001774,
          "ProcessID": 1000001659,
          "ChemicalID": 56,
          "Quantity": 110000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501774,
          "ProcessID": 1000001659,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001273,
      "SummaryText": "Tyson Prepared Foods, Fort Worth\nRisk Management Plan\nExecutive Summary\n\nI. Accidental release prevention and emergency response policies\n\nIt is the policy of Tyson Foods Inc to implement a Risk Management Plan (RMP) in accordance with 40 CFR Part 68. Included in this process is the implementation of OSHA standard 29 CFR 1910.119.\n\nThe purpose of implementing these programs is to prevent the release of anhydrous ammonia. By doing so we protect employees and guests on site while protecting the general public off site. \n\nAs part of these programs, Tyson Foods has developed an emergency response plan that includes a well trained response team that coordinates closely with local fire department and other off site emergency personnel.\n\nII. The stationary source and regulated substance\n\nThe food production process at this facility requires very low temperatures to process and maintain the finished product. The refrigeration system uses anhydrous ammonia to provide the proper temperature in the production areas, coolers and blast freezers. \n\nIII. General accident release prevention program and chemical-specific prevention.\n\nA. Tyson Prepared Foods, Fort Worth has designed and implemented a preventative maintenance program to reduce the potential for release of ammonia from the refrigerations system. This program complies with the requirements of OSHA regulation 29 CFR 1910.119 Process Safety Management. The key concept of this release prevention program is employee participation, appropriate design and maintenance of equipment and appropriate training of all Tyson Team Members.\n\nThe PSM Team is responsible for conducting and implementing findings from the PHA Process Hazard Analysis for the ammonia system. Team members are also members of the facility emergency response team. This ER Team has developed an Emergency Response Plan which includes specific procedures and equipment to allow the safe response to an ammonia leak or release. These procedures are designed to minimi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001273,
      "SummaryText": "ze a leak or release.\n\nThe list below identifies individuals with specific responsibilities in the prevention and response plans.\n\nB. Lines of Authority and Responsibility in RMP\n\nGreg Irby: Plant Manager \n\nThe Plant Manager has responsible for all regulatory affairs within the plant.  Greg delegates program responsibilities to individuals in the facility depending on individual roles and job descriptions.  \n\nTravis Schulte:  Complex Environmental Manager\n\nThe Complex Environmental Mgr. is responsible for oversight of all environmental programs including the Risk Management Program.  However, the day-to-day management of the PSM and RMP program is the duty of the PSM coordinator.  \n\n: Refrigeration Manager\n\nThe Refrigeration Mgr. is responsible for Maintenance, Repair, and Refrigeration systems at the facility.  The Refrigeration Manager is the direct supervisor of the Refrigeration Supervisor whom the Process Safety and Risk Management Programs have been delegated.  The Refrigeration Manager has the responsibility of ensuring the PSM/RMP elements are properly implemented by the Refrigeration Supervisor.\n\nRefrigeration Supervisor\n\nThe Refrigeration Supervisor is responsible for refrigeration engineering and all refrigeration operations and maintenance of refrigeration equipment.   This position has management oversight over all refrigeration staff.  The Refrigeration Supervisor ensures all equipment in the refrigeration system is maintained in proper working order.\n\nNathan Chet Smith:  Process Safety Management Coordinator\n\nThe PSM Coordinator is responsible for implementation and maintenance of the Process Safety and Risk Management Prevention Program documentation, including but not limited to Mechanical Integrity, Management of Change, Training, Operating Procedures, Incident Investigation and Emergency Response.  \n\nRefrigeration Operator Staff:\n\nThe Refrigeration staff act in a supporting role for Process Safety and Risk Management and as operators of the refrig"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001273,
      "SummaryText": "eration system.  Day-to-day operations include but are not limited to performing operational checks on refrigeration equipment, completion and maintenance of equipment logs, preventive maintenance, pre-operational inspections.  \n\nLinda McDanial: Plant Safety Manager\n\nThe Plant Safety Manager is responsible for development and implementation of safety policies and procedures at the plant site.  The Plant Safety Manager shall work side by side with the Refrigeration Manager to ensure all refrigeration staff are provided with proper personal protective equipment and enforcement that it is worn when appropriate.  This position is also responsible for Contractor Safety program, Hot Work permits and updates to the emergency response program.  The Plant Safety Mgr. also supports the hazmat team to ensure all personnel and equipment remain fully functional and available at all times for emergency response.  \n\n\nIV. Five-year accident history\n\nThere have not been any releases of anhydrous ammonia at this facility in the last five years that resuted in deaths, injuries, or significant damage on site or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. \n\nV. Emergency Response Program\n\nAs part of these programs, Tyson Foods has developed an emergency response plan that includes a well-trained response team that coordinates closely with local fire department and other off site emergency personnel.\n\nVI. Planned changes to improve safety\n\nThe Facility PSM Team is continuously evaluating operational, maintenance, and safety procedures to reduce the possibility of a release of ammonia and ensure the safety of Team members, guests, and the general public off site. \n\nOur plan is to continue to add highly skilled refrigeration mechanics to our staff. We are also providing skills training to the team members we now have on staff."
    }
  ]
}