{
  "FacilityID": 1000010070,
  "FacilityName": "Southeast Regional WTP",
  "FacilityStr1": "3304 Dike Rd",
  "FacilityStr2": null,
  "FacilityCity": "Winter Park",
  "FacilityState": "FL",
  "FacilityZipCode": "32792",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12117",
  "LEPC": "District 6 LEPC",
  "FacilityLatDecDegs": "28.636806",
  "FacilityLongDecDegs": "-081.285667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.seminolecountyfl.gov",
  "FacilityEmailAddress": "srankin@seminolecountyfl.gov",
  "FacilityDUNS": 67834358,
  "ParentCompanyName": "Seminole County BCC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Seminole County BCC",
  "OperatorStr1": "500 W. Lake Mary Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Lake Mary",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32773",
  "OperatorZipCodeExt": "7499",
  "RMPContact": "Gary Rudolph",
  "RMPTitle": "Utilities Manager",
  "FTE": 27,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000089815",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2005-12-20 00:00:00",
  "SafetyInspectionBy": "Department of Community Affairs, State of Florida",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-10-26 00:00:00",
  "DeRegistrationEffectiveDate": "2012-10-18 00:00:00",
  "AnniversaryDate": "2015-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 28.63664,
  "FRS_Long": -81.28775,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "0.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000011822,
      "AltID": "3",
      "FacilityID": 1000010070,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000012227,
          "ProcessID": 1000011822,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000013629,
          "ProcessID": 1000011822,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000513629,
          "ProcessID": 1000011822,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000010070,
      "SummaryText": "          Introduction and Background\n\nSeminole County is committed to delivering quality drinking water and responsive service to its customers, and strives to be a good neighbor to the people who live near its treatment plants. This document is the Seminole County Southeast Regional Water Treatment Plant (SERWTP) Risk Management Plan/Process Safety Management Plan (RMP/PSMP), which details the prevention programs that have been implemented at the SERWTP to prevent and minimize the emergency release of chlorine gas. \nBecause the SERWTP stores chlorine gas above the threshold quantity, shown in Table ES-1, the County is required to develop a plan to prevent and minimize emergency releases of chlorine gas to the atmosphere in quantities that could potentially affect the public beyond the facility's boundaries. The RMP regulations are from the U.S. Environmental Protection Agency's (USEPA) Clean Air Act Amendments of 1990, which are detailed and codified in Chapter 40 of the Code of Federal Register (CFR) Part 68. The PSMP regulation is from the Occupational Safety and Health Act (OSHA) Standards, which are detailed in OSHA 29 CFR 1910.119. \n                    \nThe chlorination process at the SERWTP is subject to the most stringent of the three RMP programs, Program 3, which has three major requirements. The first requirement is a Hazard Assessment, in which the effects of a release from a regulated substance could have on the public are determined. The Hazard Assessment for the SERWTP has been completed and can be found in the document titled, Offsite Hazard Assessment for the City of Seminole County East Water Treatment Plant, located in the office of the Facilities Safety Coordinator. The second requirement is a Prevention Program, which consists of 12 elements designed to improve the system safety and decrease the likelihood of a release. The third requirement is an Emergency Response Program, which requires development of a plan for dealing with a release in the unlikely event"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000010070,
      "SummaryText": " that one would occur. The second and third requirements are detailed in this document.\nBecause the RMP and PSM regulations are very similar, the Prevention Program and the Emergency Response Program of the RMP also serve as the OSHA PSMP; therefore, this document is referred to as the RMP/PSMP. This RMP/PSMP is divided into 14 sections, each representing a paragraph of requirements from the OSHA PSM Standard.\n\nPrevention Measures\n\nTo protect the welfare of the community, staff, and the environment, Seminole County has taken many proactive steps over the last decade to minimize potential hazards related to chlorine gas. It has satisfied and exceeded the requirements of RMP/PSMP, and has a number of preventative measures in place to guard against the release of chlorine gas. Safety features implemented at the SERWTP include:\n    Chlorine gas sensors to detect leaks and trigger safety systems.\n    Emergency chlorine gas scrubbers that will automatically sense and neutralize any chlorine gas leak from the treatment system. The scrubbers are tested weekly to ensure proper operation and effectiveness.\n    Automatic valves and vacuum technologies that will stop the flow of chlorine gas if there is a break in the piping system.\n    Specially engineered buildings constructed to house the chlorine gas system and to contain a chlorine gas leak, minimizing potential impacts on surrounding areas. \n    Extensive training of all plant operators involved in the water treatment process on the use, hazards, handling, and safe operation of chlorine gas. Plant operators and maintenance personnel also have special emergency action training on how to respond to a chlorine gas leak. \n    Comprehensive planning and coordination with the Seminole County Fire Department and HAZMAT team in the unlikely event that a leak occurs.\n\nProcess Technology\n\nChlorination System Description\n\nGaseous chlorine is stored in 1-ton cylinders and is provided to the vacuum regulator under pressure. The chlorination system draw"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000010070,
      "SummaryText": "s chlorine gas from the vacuum regulator and injects the gas into a solution that is used to disinfect water to produce potable water. A vacuum is created in an injector that pulls the gaseous chlorine through chlorinators that control and measure the flow of gaseous chlorine. The gaseous chlorine is used to disinfect the raw well water coming into the plant and then again prior to leaving the plant and entering the distribution system.\n\nMaximum Intended Inventory\n\nThere are a maximum of 18 1-ton cylinders of chlorine stored onsite. Up to 18 cylinders are located inside the building withsix online, the other six in standby, six full or empty cylinders are stored on trunnions inside the building. \n\nProcess Equipment\n\nChlorine Process Equipment Storage Cylinders\nWhen chlorine cylinders are in service, they rest on weighing scales. The cylinders in storage rest on trunnions. The cylinders are welded and have a tare weight of up to 1,700 pounds. The cylinder has two valves, one for liquid withdrawal and the other for gas, that are protected by a removable steel housing.\n\nBridge Crane \n\nA monorail bridge crane is located in the Chlorine Building. An electric hoist and container clamp are furnished to transfer the cylinders to the Chlorine Building from a flatbed truck. The bridge crane is rated as a 2-ton system.\n\nPiping \n\nThe piping for gaseous chlorine under pressure is schedule 80 carbon (black) steel pipe. Piping for the gaseous lines under vacuum is schedule 80 PVC. \n\nChlorine Gas Filters\n\nThere is one chlorine gas filter per pressure system manifold. There are two manifolds (online and standby) with each manifold containing six (6) cylinders. The filters process the chlorine gas before entering the vacuum regulator.\n\nChlorine Vacuum Regulator \n\nTwelve (12) cylinders are tied together by a dual manifold pressure line system. The pressure lines are tied to a single vacuum regulator, which switches the line from pressure to a vacuum system.\n\nAutomatic Switchover\n\nThe "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000010070,
      "SummaryText": "vacuum regulator can automatically switch from the online cylinders to the standby cylinders by means of an automatic switchover. The automatic switchover is achieved by setting the valve for those cylinders not in use on standby. The valve on the switchover unit is set in this position and is held closed by a detent-type lockout. When the online cylinders become exhausted the vacuum rises and overcomes the latching force of the lockout mechanism allowing the standby cylinders to feed into the system along with those already online.\n\nChlorinators\n\nThe Chlorine Feeder Room contains three (3) 2,000-lb/day, two (2) 100-lb/day and two (2) 500 lb/day vacuum type chlorinators (manufacturer: Hydro Automatic Valves) that meter chlorine gas flow. Each chlorinator feeds a single injector. Chlorine gas can be fed from any of the seven (7) chlorinators to the seven (7) injectors by using inter-connecting pipes and valves. The chlorinators have high and low vacuum alarms.\n\nChlorine Injectors\n\nSeven (7) chlorine injectors can feed chlorine gas into plant water pipes. Plant water is used as the source of solution water. Plant water passes through the injector, which has a Venturi-shaped throat to increase the water velocity. The passing water creates a vacuum that draws chlorine gas from the chlorinator. The injector creates enough vacuum to transfer the chlorine from the supply system through the chlorinator and to dissolve the gas into the injector water supply.\n\nChlorine Ventilation and Scrubber Systems\n\nThe chlorine building is equipped with a manually operated ventilation system and an automatic scrubber system. The building has three man-doors and two loading bay doors. Ventilation is provided through louvers located near the man doors. Louvers are gravity dampened.\nChlorine gas is monitored in the room. If chlorine gas is detected above 0.2 ppm, the chlorine gas scrubber located adjacent to the chlorine building is activated. The scrubber sucks air from the chlorine buildin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000010070,
      "SummaryText": "g through a pack tower where chlorine gas is neutralized by a caustic solution. \n\nSafety Systems\n\nFacility-Wide Safety Systems\n\nA gate controls access to the Seminole County SERWTP. Visitors and contractors must enter the main lobby of the control building and be approved by the Seminole County SERWTP staff prior to entry into the facility. In addition, \"No Parking\" and \"No Unauthorized Personnel\" signs are posted onsite. \n\nChlorine Gas Safety Systems\n\nTon Cylinder Automatic Shut-Off Valves\nPneumatic shut-off valves are located on the cylinders in use (online and standby). The valves are interfaced with the leak detection system and will shut off the chlorine gas supply at the cylinder upon a detected chlorine leak. These valves prevent the continuous discharge of chlorine in the pressure portion of the chlorine gas system. \n\nVacuum Feed System\n\nThe largest portion of the chlorine gas feed system is under vacuum. The vacuum portion of the system is located between the vacuum regulator and the chlorine injection point. Any pipe break or leak that occurs in the vacuum portion of the feed system will produce a loss of vacuum and no additional chlorine gas will be feed from the vacuum regulator.\n \nLeak Detection\n\nThree chlorine leak detectors are located in the chlorine building, one inside the chlorinator room and one in the chlorine storage room. The detectors are self-contained, electrically operated devices designed to detect 0.2 ppm by volume of chlorine in the air. Because of numerous false alarms at this relatively low setting, the Seminole County SERWTP is considering raising the alarm level to 3 ppm. The 3 ppm setting is considered adequate since plant staff intermittently occupies the chlorinator or the storage rooms. Currently, if a leak occurs, a chlorine level of 0.2 ppm will activate the alarm light on the face of the detector unit. A chlorine level above 0.2 ppm will result in the following:\n    Activate an alarm at the control room computer\n    Activate the au"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000010070,
      "SummaryText": "tomatic cylinder shut-off valves\n    Activate the emergency chlorine scrubber system. The chlorine scrubber will continue to work until an operator manually resets the scrubber.\n    Activate three red lights, one located at the west side of the loading dock, one at the east door of the cylinder room and one at the north door of the chlorinator room\n    Activate an audible alarm outside the building. \nEmergency Shower and Eyewash\nEmergency eyewashes are located on the exterior of the chlorine building on the east and west side near the exit doors. \nEscape Pack\nThere are 5-minute emergency escape respirators provided to employees who may change chlorine cylinders. See Section 4, Operating Procedures, for a discussion of the escape respirator.\n\nProcess Hazard Analysis\n\nIntroduction\n\nA PHA is an organized and systematic effort to identify and analyze the significance of potential hazards associated with the processing or handling of highly hazardous chemicals. The PHA provides information to assist the staff of the SERWTP in making decisions for improving safety and reducing the consequences of unwanted or unplanned releases of chlorine gas. The PHA focuses on equipment, instrumentation, utilities, human actions (routine and non-routine), and external factors which may impact the release of chlorine gas. The safety considerations are prioritized conA?sidering the potential severity of a chlorine release, the number of potentially affected employees, the operating history of the process, the age of the chlorination process, and any other relevant factors. Seminole County conducted a PHA for the chlorine gas process on May 17, 2006. The next PHA will be due in May 2011.\n\nRelease Scenario\n\nTwo release scenarios were evaluated in the PHA:\n    Worst-case release scenario:  Catastrophic failure of a 1 ton (2,000-lb) container of chlorine.\n    More likely accidental release scenarios:  Minor chlorine gas release resulting from hookups and change of feed piping from containers, etc. \nThe wors"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000010070,
      "SummaryText": "t-case release scenario includes such things as container rupture, break in a line under pressure, broken flexible connection, fusible plug failure, and/or repair work while a system is under chlorine supply pressure. Minor leaks (more likely accidental release scenarios) usually occur at the start-up of a new installation or right after maintenance or inspection procedures. They are usually the result of a gasket failure, valve packing adjustment, or equipment malfunction. There have been no significant chlorine leak incidents in the last 5 years; however, there have been cases where a minor leak has tripped the alarm and dispatched the Fire Department. \n\nEmergency Planning and Response\n\nIntroduction\n\nThis section addresses actions employees are to take when there is a release of chlorine. Both the RMP and the OSHA PSM regulation 29 CFR 1910.119(n) require that an Accidental Release Emergency Response Plan be prepared. The plan is prepared in accordance with the provisions of another OSHA regulation?Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA Hazardous Waste and Emergency Response standard, 29 CFR 1910.120 (a), (p), and (q), were also considered. A facility like the Seminole County SERWTP must comply only with the requirements of paragraph (q) of this section. Plan 29 CFR 1910.120 (q) requires a more detailed Emergency Action Plan compared to the requirements of 1910.138. However, since it is Seminole County procedure to evacuate employees from the danger area when an emergency occurs, and not permit employees to assist in handling the emergency, the regulations exempt the Seminole County SERWTP from the requirements of 29 CFR 1910.120 (q), providing that an emergency action plan complying with section 1910.38(a) is prepared. Therefore, the Emergency Planning and Response Plan described in this section complies with the requirements of 1910.38(a). \n\nSpecific Emergency Response Procedures\n\nThe specific response procedures should"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000010070,
      "SummaryText": " be undertaken in event of a hazardous chemical leak. The County's Emergency Action Plan provides these procedures. The Emergency Action Plan is located in the Operations building. Table 12 1 provides an emergency response protocol that can provide quick and easy way to understand procedures in the event of a chorine leak.  A copy of the Emergency Action Plan is located at the end of this section.  The Emergency Action Plan is currently under review by County Staff and will be updated in the near future.\n\nEvacuation of Areas Adjacent to the Plant\n\nWhen an incident requiring evacuation occurs, fire and police agencies responding to the incident are responsible for evacuating civilian populations located in areas adjacent to the plant. With input from the Chief Operator, the senior fire or police official responding to the incident will determine whether evacuation of the surrounding area is required. Prevailing winds in the Seminole County area are from the southeast; there is a good chance that if a release should occur, the chlorine gas would be blown to the northwest of the site. This information will be helpful in identifying areas that could be affected by a hazardous materials spill.\n\nEmergency Operations: \nEmergencies are unplanned events.  The following procedures are intended to provide guidance in response to an emergency.  The emergency may be related to the chlorine process.  ALTERNATIVELY, the emergency may be unrelated to but still impact the chlorine process.  See the separate Integrated Emergency Response Detailed Procedures for more details.\n\nChlorine Leak Monitor System Alarms.\nFour separate monitors detect 0.20-ppm chlorine in the air; three monitors are located within the chlorine one-ton container bay area and one monitor located within the injector room.  If a leak occurs, the monitor alarms locally by audible and strobe lights located outside the storage bay as well as through out the operations building.  The monitor alarm system is tied to th"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000010070,
      "SummaryText": "e SCADA alarm system which auto dials Central Florida Alarms and 911.\n\nSCADA OPERATOR\n1.    Determine which area has the alarm. SCADA chlorine control screen will display which monitor has detected 0.20-ppm. This will allow the SCADA operator to direct the Fire Department where to start the search for the leak. \n2.    Notify Chief Operator and/or Water Operations Manager\n3.    Observe security camera #5 to determine if leak is catastrophic or faulted equipment. \n4.    If catastrophic, notify all staff to follow the evacuation plan for a chemical leak.\n\nSERWTP Staff\n1.    Shall have knowledge of the facility alarms and warning.\n2.    Shall have knowledge of all hazardous materials on site.\n3.    If notified, follow evacuation plan by exiting plant \"up-wind\" from the chlorine storage bay.\n4.    After evacuation from the water treatment facility, staff shall meet at the pre-determined meeting point (Parking Lot of Lake Howell High School) for a head count.\n\nIf an evacuation is necessary, the Fire Department with help of the HAZMAT Team will contain and naturalize the contaminated area. After the area is \"safe\" the Fire Department will contact the either Chief Operator and/or Water Operations Manager with the \"All Clear\" insuring safe return.\n \nPlant Site Communication\n\nThe Seminole County SERWTP is staffed and operated 24 hours a day, every day of the year with trained operations personnel. The chlorine is checked three times a day during each shift as part of the normal rounds at this facility. In the chlorine building, there is a chlorine leak detector and alarm. \nAudible alarms located inside the Chlorine Buildings will indicate that a leak has occurred. These alarms emit a high-pitched electronic sound that differs from other alarms at the site.\nThe audible alarms are accompanied with a beacon mounted on the exterior of the buildings. The leak detectors also alarm at computer control terminals. At concentrations less than 0.2 ppm, the Chief Operator or Operator in charge should attempt to"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000010070,
      "SummaryText": " verify the extent of the leak as previously described. At concentrations greater than 0.2 ppm, the chlorine alarm is activated, and the Emergency Action Plan is implemented. Activation of the alarm will automatically notify the Seminole County Fire Department.  If an evacuation is required, employees are notified to begin evacuation procedures via the telephone system, city radio or door to door. The alarm systems must be restored to the normal operating condition as promptly as possible after each test or alarm.\nIf a leak is confirmed and the alarm system does not sound, the Seminole County Fire Department should be notified of the release as soon as possible by calling 911:\n    Seminole County Fire Department?Emergency Response:  911\nIncident Investigation\nFollowing a release, the procedures described in Section 11, Incident Investigation, should be followed.\nIn-Place Protection\nSheltering plant staff indoors during an accidental leak (in-place protection) is not recommended unless concerns associated with in-place protection are resolved. Concerns include uncertainties about whether indoor air concentrations would remain low for a sufficiently long-time period. To determine this would require an evaluation of the ventilation systems of all buildings to be used for shelter.\nBecause the number of employees to evacuate is relatively small and because an effective communications system exists to evacuate employees, evacuating employees should be an effective means of protecting them.\n\nChlorine Operating Procedures\n\nReason for Issue:      Update of Chlorination Operating Policy and Procedures\nRevisions:    This policy can only be changed by following the Process Safety Management Protocol for the Management of Change.\nDistribution:    This is a controlled document.  The Water Operations Manager keeps the master copy as part of Seminole County Environmental Services, Risk Management Program Manual.\nDCA:     Policy reviewed by Department of Community Affairs (DCA).  \n\nCylinder Handli"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000010070,
      "SummaryText": "ng\n1    Visually inspect lifting equipment before use.\n2    Lift cylinders only with an approved and load-tested device wearing proper PPE, refer to MSDA Section 8 ? Exposure Controls/Personal Protection.\n3    Never leave a cylinder suspended.\n4    Avoid dropping cylinders.\n5    Avoid bumping cylinders into other objects.\n6    Secure cylinders into position immediately.\n7    Store cylinders on their sides only (horizontally).\n8    Do not stack empty or full cylinders.\n9    Never apply a direct flame to a cylinder.\n10    Use the oldest cylinder in stock first.\n11    Always keep dome valve protection, (bonnets) in place until cylinders are ready for connection.\n12    Do not tamper with the cylinder fusible plugs.\n13    During connecting or disconnecting a cylinder shall:\n(a) When connecting or disconnecting a cylinder both the Connect/Disconnect Operator, and the Standby Operator must wear and use a properly fitted and tested SCBA, or a face mask and hose connected to a stationary air supply.\n(b) When connected to a stationary air supply, the Operator must have a 5-minute escape supply attached to his breathing mask.\n14.    Inspect all threads and surfaces of cylinder connectors for good condition and check for and replace any old gaskets before making any connections. \n15.    Use a new lead gasket each time a cylinder connection is made.\n16.    Use only the specified wrench to operate cylinder valves.\n17.    Open cylinder valves slowly, no more than one full turn.\n18.    Check for leaks as soon as the cylinder connection is made.\n19.    Correct all minor leaks at the cylinder connection immediately. \n20.    Repair minor leaks at connection points immediately by tightening connections. If there is a leak other than a minor leak at a connection point, refer to Section 12, Emergency Planning and Response, for procedures to be followed.\nNormal Operations\nShipping and Receiving Chlorine Containers\nEffective Date:  \n1.    Observe truck prior to entering the storage area. Plant staff will assist driver by instructing the delivery drive"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000010070,
      "SummaryText": "r where to enter the storage area. The delivery vehicle shall enter the Chlorine Room from South to North. Upon stopping inside the Chlorine Room, both overhead doors will be closed for proper ventilation control in the event of a chlorine gas release during unloading. Also prior to any unloading, SCADA shall be informed that shipping and receiving is to take place with the chlorine cylinders.\n2.    When receiving a delivery of chlorine, check the shipping invoice to ensure that the proper number and type of cylinders are being delivered.\n3.    Check the physical condition of the cylinders, and use ammonia vapor to check all cylinders for leaks at fusible plugs and angle valves. A leak is indicated by the presence of a white vapor when contacted by ammonia. If a leak is detected, do not accept delivery of that cylinder and notify the driver of the situation. This leak test should be performed with the protective valve covers, (bonnets) in place.\n*County employees are not permitted to board the delivery vehicle. All checks are to be conducted from ground level.\n4.    Ensure that the dome valve cap, (bonnets) is secure before moving cylinders.\n5.    Two Utility personnel, (1) Utility personnel that will be performing the loading and unloading (2) other utility personnel will be the SCADA operator, must always be present while receiving chlorine containers. \n6.    Store FULL tanks in storage area with valves facing manifold and mark with a \"FULL\" sign. Store EMPTY containers with all valves and dome cap secured with an \"EMPTY\" sign. Cylinders that are feeding shall be marked with an \"In Use\" sign.\n7.    Do not store containers on top of one another.\n8.    When unloading truck, unload all full cylinders and store them on the empty bank. Then load truck with all empty cylinders. Cylinder scales shall be reset and zeroed with both sides of scales unloaded, (no cylinders in place) prior to placing full cylinders.\nNOTE: Because of the availability of storage space on the chlorine scales, and th"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000010070,
      "SummaryText": "e weight distribution requirements of the vehicle, it may be necessary and/or more efficient to stagger the exchange of full and empty cylinders.\n9.    If a container valve cannot be opened, place a tag on it stating the situation; then notify the Chief Operator and the chlorine supplier so proper replacement can arranged.\n10.    Regardless of the availability of full cylinders on the delivery vehicle, at no time will there be more than 18 full cylinders (36 tons of chlorine) at the SERWTP.\n\nChanging Chlorine Feed from an Empty to a Full Cylinder\nEffective Date: \nPreparation \nThe SERWTP has two banks of scales where chlorine cylinders can be stored. Each bank consists of six cylinders connected on a separate manifold. When one bank is emptied, SERWTP has an automatic vacuum switch-over unit that will transfer over to the full bank. At this time the empty cylinders are disconnected and removed from service and new full cylinders are moved in and connected. Procedures are described below.\n1    All changing of chlorine cylinders will consist of three SCBA-trained WTP employees. Refer to the SCBS SOPs.\n(1) Primary Operator of the chlorine cylinder change. This individual will be performing all disconnections and connections of the chlorine cylinders as well as giving the order of ?All Clear.?\n(2) Standby Operator, assist with operations of cylinder host and communications between the Chief Operator and SCADA personnel. \n(3) SCADA personnel will be on standby in the control. Duties will be to monitor the chlorine change through security camera #5, and make necessary changes through the SCADA controls as directed by the Chief Operator of the chlorine cylinder change. \n2    Use oldest cylinder in stock first.\n3    Use only specified wrench to operate the cylinder valve.\n4    Inspect all threads and surfaces of new cylinder for good condition and check for and replace any old lead gaskets before making any connections.\n5    Check to ensure that the container is as empty as possible by verifying"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000010070,
      "SummaryText": " the chlorinator or rotometer will no longer feed chlorine gas. This can be done by reading the vacuum indicator. If the vacuum indicator shows a vacuum greater than 20 Hg, then the chlorine cylinder is empty.\n6    Shut off the container valves, and monitor the vacuum indicator until a vacuum of more than 20? Hg is indicated.\n7.    Prior to either connection or disconnection of any chlorine cylinders the Primary Operator shall request that SCADA place the plant alarms in test by contacting Central Florida Alarms at 1-800-432-1429.\n8.    Both the Primary and the Standby Operator shall don a SCBA and mask. Test the assembly for air leaks, and place SCBA in service. All connects and disconnects shall be performed while using an independent (SCBA) air supply.\n9.    The Standby Operator must be present and within view of the operator changing the cylinder.\nChanging Cylinder Feed Source\n1.    Primary Operator shall contact SCADA to request an injector be placed in override @ 1,500 lbs. per day. \n2.    Confirm that the cylinder valves have been shut off then monitor the vacuum indicator until a vacuum of more than 20? Hg is indicated.\n3.    Next remove the automatic actuator from the yoke. Loosen the yoke assembly threaded stud slightly, and test for chlorine gas leakage. If there is indication of a gas leak, re-secure the yoke and take appropriate corrective action. If no chlorine gas leakage is indicated, shut off the manifold valve and continue with the removal of the yoke assembly from the cylinder valve. DANGER: There could be residual chlorine (either gas or liquid) that may be trapped in piping or fittings which can be released.\n4.    Repeat steps #1 through #3 with the remaining empty cylinders. \n5.    Remove, bend, and properly discard the used lead washer from the yoke assembly.\n6.    Replace the empty container?s valves hexagonal cap and domed valves cover, (bonnet).\n7.    Remove empty cylinders and replace with new full cylinders.\n8.    Starting with the first cylinder on the bank, check the flex"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000010070,
      "SummaryText": "ible tubing connected to the manifold to be used with the full chlorine cylinder for damage. If the connector shows any sign of damage, it should be replaced immediately.\n9.    Inspect and clean the yoke seat and valve assembly fittings, carefully remove any old lead washers, and install a new lead washer. Never reuse a lead washer.\n10.    Connect the yoke valve to the cylinder?s top valve. Repeat steps 8 through 10 for each cylinder on the bank.\n11.    Beginning with the first cylinder, open cylinder valve slowly (less then A? turn) to pressurize the flexible connector then close valve and check for leaks. Use ammonia vapor to check for leaks around the connections. A leak is indicated by the presence of a white vapor when contacted by ammonia. If a leak is detected, immediately close the cylinder valve and tighten the leaking connection. Retest the leak using ammonia. If the leak persists, open the manifold valve to relieve pressure on the flexible connection then repeat steps #2 through #11.\n12.     While attempting to open valve with an approved wrench, if the valve will not open, do not use this cylinder. Notify the supervisor of the situation and mark or tag the cylinder \"DO NOT USE\". Under no circumstances is excess force or a larger wrench to be used to open the valve.\n13.    If the valve stem should bend or break while opening notify supervisor and mark or tag cylinder \"DO NOT USE\".\n14.    If valves open without any problems continue to open cylinder valve no more then one full turn. Install automatic actuator to the yoke assembly. Place the container valve wrench on the manifold valve. (Never leave a valve wrench on the automatic actuator stem). Inspect automatic actuator to ensure that it is set in proper position. Re-test for leaks at the cylinder valve gasket. Repeat steps #11 through #14 for the remaining cylinders.\n15.    Open all manifold valves one at a time and recheck for leaks at all the connections on the bank header. If a leak is detected take appropriate correctiv"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000010070,
      "SummaryText": "e actions before proceeding to step #16.\n16.    Primary Operator shall contact both Standby and SCADA Operators that all is ?All Clear?. At that time SCADA can place the injector that is in override back to normal operations.\n17.    Chlorine cylinder change out completed.  \n*Under No circumstances is there to be more than ONE (1) cylinder open without an automatic actuator in-place. \n        "
    }
  ]
}