{
  "FacilityID": 1000080109,
  "FacilityName": "Alfred Merritt Smith Water Treatment Facility",
  "FacilityStr1": "243 Lakeshore Road",
  "FacilityStr2": null,
  "FacilityCity": "Boulder City",
  "FacilityState": "NV",
  "FacilityZipCode": "89005",
  "Facility4DigitZipExt": "1201",
  "FacilityCountyFIPS": "32003",
  "LEPC": "Clark County LEPC",
  "FacilityLatDecDegs": "36.071111",
  "FacilityLongDecDegs": "-114.813111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AE",
  "FacilityURL": "WWW.SNWA.COM",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Southern Nevada Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Richard W. Giltner",
  "OperatorStr1": "P.O. Box 99955",
  "OperatorStr2": null,
  "OperatorCity": "Las Vegas",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89193",
  "OperatorZipCodeExt": "9955",
  "RMPContact": "Richard W. Giltner",
  "RMPTitle": "Treatment Manager",
  "FTE": 130,
  "OtherEPAFacilityID": "22131",
  "EPAFacilityID": "100000018946",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-05-09 00:00:00",
  "SafetyInspectionBy": "State of Nevada Chemical Accident Prevention Progr",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 36.11295,
  "FRS_Long": -114.86441,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100019,
      "AltID": "Chlorination System",
      "FacilityID": 1000080109,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000101261,
          "ProcessID": 1000100019,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125296,
          "ProcessID": 1000100019,
          "ChemicalID": 62,
          "Quantity": 408000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000625296,
          "ProcessID": 1000100019,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080109,
      "SummaryText": "The Southern Nevada Water Authority (SNWA) is a water utility company that uses chlorine gas as a disinfectant to produce potable water. SNWS is the primary potable water supplier in southern Nevada.  Our mission is to \"provide world-class water service in a sustainable, adaptive, and responsible manner to our customers through reliable, cost-effective systems\".  \n\n\n\nThe senior management team at SNWA is firmly committed to achieve a safe work place for the employees at our water treatment facilities by protecting their health and wellness while striving to eliminate exposures to highly hazardous chemicals. The goal of the SNWA senior management team is to achieve full compliance with the applicable federal Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) program, and the Environmental Protection Agency (EPA) Risk Management Plan (RMP) program, as well as the State of Nevada Chemical Accident Prevention Program (CAPP).  \n\n\n\nOur commitment to total chemical safety is demonstrated through: \n\n1.) The employment of a full-time chemical engineer at the water treatment plant who is dedicated to evaluate and improve the water treatment processes, \n\n2.) A process safety engineer is assigned to SNWA to focus on the OSHA PSM, EPA RMP and Nevada CAPP compliance programs, \n\n3.) Implementing and improving the comprehensive PSM/RMP/CAPP programs to ensure the following are systematically evaluated and implemented: chlorine process design, process modifications, process technology, process hazard analysis, operational and maintenance activities, standard operating procedures and employee training, \n\n4.) Coordinating with the local emergency responders including the Clark County, Nevada Fire Department and the National Park Service on emergency response program, \n\n5.) Implementing an orientation procedure to inform visitors of chlorine and other non-PSM chemicals stored at the Alfred Merritt Smith Water Treatment Facility (AMSWTF), and the genera"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080109,
      "SummaryText": "l site safety protocol plus site evacuation plan, \n\n6.) Practicing an open-door policy where employees are encouraged to discuss any chemical related safety issues with their respective supervisors and managers, \n\n7.) The SNWA employees remain vigilant in following safe work practices, doing the right thing, and ensuring safety through continuous education and training efforts.  \n\n\n\nSNWA has two water treatment facilities with a combined total maximum production capacity of 900 million gallons per day (MGD) potable water. Both are situated in remote locations and away from the densely populated areas of Clark County, Nevada. The AMSWTF is the larger of the two facilities and the only one that uses chlorine as a disinfectant in the water treatment process.  Chlorine is an OSHA PSM and EPA RMP covered chemical.   \n\n\n\nThe SNWA water treatment process starts by pumping raw water from Lake Mead into a contactor building to undergo ozone disinfection where ozone and oxygen gas mixture generated on-site are diffused, mixed and dissolved into water traveling through the contactor to achieve the desired disinfection.  In the event the ozone generation system is down for maintenance, AMSWTF can use chlorine gas as a back-up disinfectant.  \n\n\n\nFollowing ozone disinfection, the ozonated water flows through a channel to the rapid mixers where a coagulant aid is added to combine the waterborne suspended particles.  Water then flows into multiple flocculation basins where the gentle mixing of water and coagulant aid causes the suspended particles to form larger clumps called \"floc\".  \n\n\n\nFrom the flocculation basins, water flows to the multi-media filters where the last step of physical polishing takes place.  As water passes through these filters, \"floc\" is trapped and collected, and the filtered water passes through to the storage clearwell.  A corrosion inhibitor and fluoride are added, then chlorine is added to ensure a sufficient \"residual chlorine\" level is maintained throug"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080109,
      "SummaryText": "hout the distribution/transmission system to safeguard water quality. The finished water is now ready to be distributed to water users that include City of Boulder City, Clark County, City of Henderson, City of Las Vegas, City of North Las Vegas, and outlying areas.   \n\n\n\nLiquid chlorine is stored in trailers and shipped to AMSWTF by truck transport then kept in two enclosed buildings which have equipment to park the trailers and to evaporate the liquid chlorine for use as a disinfectant.  Access to the two chlorine buildings is restricted to SNWS employees, authorized contractors, or visitors. AMSWTF also maintains an onsite meteorological monitoring station. The prevailing winds at AMSWTF are to the north-northwest; towards the Saddle Island cove and Lake Mead area.\n\n\n\nThe chlorine facility was designed and constructed in accordance with National Fire Protection Association (NFPA) standards and complies with EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations.  \n\n\n\nTo ensure chemical safety, a multitude of technological steps have been incorporated into the AMSWTF chlorine system:\n\n\n\n1.) The entire process inside the two chlorine buildings is monitored and controlled remotely by operators located in a separate control room, \n\n2.) Chlorine sensors are located inside the two chlorine buildings to continuously monitor chlorine level, \n\n3.) The same two buildings are kept under a slight vacuum, i.e., the pressure inside the building is slightly less than the outside ambient pressure; such a set-up minimizes chlorine leaking from inside the building to the outside, \n\n4.) In case of a chlorine trailer roll-over, each trailer has two excess flow valves to shut-off chlorine flow to minimize discharges, \n\n5.) Each chlorine trailer is of double-shell construction, \n\n6.) Each chlorine trailer also has an emergency \"shut-off valve\" on top of the dome to automatically shut off the chlorine liquid feed if chlorine is detected inside the "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080109,
      "SummaryText": "two buildings, \n\n7.) A chlorine scrubber unit is in service and activates at a pre-set chlorine level; the scrubbing chemical media neutralizes the leaking chlorine vapor to minimize chlorine released into the ambient atmosphere, \n\n8.) Both chlorine buildings have sprinkler systems and fire walls, \n\n9.) Gaseous chlorine is delivered under vacuum by PVC pipe to different application points such that, in case of a chlorine pipe leak, air is pulled into the pipe rather than chlorine gas released into the environment. \n\n\n\nAdministrative controls are also incorporated into the chlorine safety program; specifically, Treatment Division employees and Production Division operators in the control room who work with chlorine:\n\n\n\n1.) Are trained in established standard operating procedures (SOP) and management of change (MOC) requirements, \n\n2.) Have received 24-hour hazardous materials technician training to deal with accidental releases of chlorine, \n\n3.) Have received annual 8-hour hazardous materials refresher training, \n\n4.) Have participated in hands-on chlorine leak repair training,\n\n5.) Have received initial as well as refresher PSM training,\n\n6.) Are certified as Water Treatment Operators or Water Distribution Operators by the State of Nevada.  \n\n\n\nSNWA has a comprehensive maintenance program and scheduled preventive maintenance is performed on all chlorine equipment.  AMSWTF also has a dedicated chlorine emergency response plan (ERP) that is reviewed and updated routinely. Additionally, visitors to AMSWTF are informed of general safety rules and chemical safety at the facility entrance gate by way of the visitor orientation procedure.  \n\n\n\nThe AMSWTF chlorine ERP spells out the purpose, scope, roles and responsibilities, chain of command, line of communication, hazard recognition and prevention, alarm system, site security and control, evacuation plan, incident command structure, emergency planning and coordination with National Park Service and Clark County Fire Depa"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080109,
      "SummaryText": "rtment, emergency response procedure and reporting, and outside agency notification.  \n\n\n\nThe AMSWTF chlorine system is subjected to routine inspection by respective government agencies. The State of Nevada Occupational Safety and Health Enforcement Section (OSHES) conducted a wall-to-wall audit of the AMSWTF PSM compliance program in April 2009.  The Clark County Fire Department most recently inspected AMSWTF in August 2017.  In 2015 a tabletop exercise for a chlorine release at AMSWTF was conducted involving the Southern Nevada Water Authority, Las Vegas Valley Water District, National Park Service, Double Barrell Environmental Services, City of Henderson Fire Department, City of North Las Vegas Office of Emergency Management, and Disaster Emergency Response Training Specialists. AMSWTF also conducts annual evacuation drills with the most recent drill taking place in December 2018.  \n\n\n\nThe State of Nevada CAPP Division audits the AMSWTF chlorine system on an annual basis.  Since the last RMP submittal, CAPP has conducted audits on June 17, 2014, August 13, 2015, August 10, 2016, August 16, 2017, and May 9, 2018.  CAPP is scheduled to audit the AMSWTF chlorine system next on June 18, 2019.\n\n\n\nThe combination of the technology, administrative controls, regulatory audit and self-inspection, and employee dedication has resulted in no accidental releases of chlorine exceeding the 10-pound reportable quantity during the past 20 years at AMSWTF.\n\n\n\nThe SNWA shall strive to remain in compliance with all applicable federal, state, and local regulatory mandates and we will continue to execute our PSM/RMP/CAPP program through continuous review and improvement.  Process hazard analysis (PHA), standard operating procedures review, maintenance activities, and trainings are ongoing. SNWS has also taken the steps to break out the chlorine ERP as a stand-alone document; independent of the emergency response plan under the auspices of the Department of Homeland Security (DHS), whi"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000080109,
      "SummaryText": "le maintaining the desired integration and uniformity among the various emergency response plans mandated by different government agencies including DHS, OSHA, EPA and CAPP.\n\n"
    }
  ]
}