{
  "FacilityID": 1000083054,
  "FacilityName": "Nokian Tyres",
  "FacilityStr1": "150 Greenway Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Dayton",
  "FacilityState": "TN",
  "FacilityZipCode": "37321",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47143",
  "LEPC": null,
  "FacilityLatDecDegs": "35.533042",
  "FacilityLongDecDegs": "-84.994143",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "AO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Nokian Tyre PLC",
  "OperatorStr1": "P.O. Box 20",
  "OperatorStr2": null,
  "OperatorCity": "nokian",
  "OperatorStateFIPS": null,
  "OperatorZipCode": null,
  "OperatorZipCodeExt": null,
  "RMPContact": "Peter Chia",
  "RMPTitle": "Operations Director",
  "FTE": 60,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000242864",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "973288",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Marshall",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": "nokian",
  "ForeignZipCode": "37101",
  "ForeignCountry": "FI",
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-10-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-10-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-10-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-10-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103808,
      "AltID": "Propane as backup fuel",
      "FacilityID": 1000083054,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000105122,
          "ProcessID": 1000103808,
          "NAICSCode": "339999",
          "_desc": {
            "NAICS_CODE": "339999",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129956,
          "ProcessID": 1000103808,
          "ChemicalID": 98,
          "Quantity": 44400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629956,
          "ProcessID": 1000103808,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083054,
      "SummaryText": "The accidental release prevention and emergency response policies at your facility: This facility complies with\n\nNFPA-58 requirements for LP-Gas storage as well as ASTM 53A and ASTM 2513 requirements for system piping.  It is our policy to adhere to all applicable federal, state, and local laws.  If an emergency were to occur, it is our policy to notify the Dayton Fire Department and request that they respond to the emergency.  We do not maintain a fire brigade but do maintain fire response equipment such as hand held fire extinguishers for small fires.\n\n\n\nA description of your facility and the regulated substances handled:  The Nokian Tyres (Nokian) facility, located at 520 Nokian Tyres Drive, Dayton Tennessee, is operated as a tire manufacturing facility.  Nokian manufactures passenger car tires and small truck tires.  The facility operates one 12,000 gallon propane tank which is used as a back-up fuel source for the boilers on site. The operational intent is to limit the filling of this tank to 85% of tank capacity.\n\n\n\nThe worst-case and alternative release scenario:  Our proposed worst-case scenario is failure of one 12,000-gallon propane storage tank, resulting in a vapor cloud explosion.  The resulting distance to the endpoint extends offsite, and public receptors are within the distance to the endpoint (0.3 miles).  Two alternative release scenarios are included in this Risk Management Program, one of which appears to be the actual worst-case scenario .  The first scenario depicts a pull-away explosion resulting in a rupture of a 2-inch diameter hose with a 1 psi overpressure, leading to a 5-minute release and explosion.  Approximately 2,050 pounds/ minute of propane, totaling 20,500 pounds, would be released.  The resulting distance to the endpoint is 407 yards (approximately 0.2 miles) from the source and extends offsite.  According to 2010 U.S Census Data no residential areas are present within this distance however, approximately 2 commercial/ industrial "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083054,
      "SummaryText": "facilities are.  The second alternative release scenario, and actual worst-case scenario, depicts a break in a 4-inch diameter pipe with a 1 psi overpressure, leading to a 5-minute release and explosion.  Approximately 8,199 pounds/ minute of propane is released, resulting in the potential release of 40,995 pounds of material in 5 minutes.  The resulting distance to the endpoint for such a release extends offsite approximately 0.47 miles (834 yards) and would effect public receptors.  \n\n\n\nThe general accidental release prevention program and chemical-specific prevention steps:  This facility complies with EPA's accident prevention rule, the OSHA PSM standard, and all applicable state and local codes and regulations.  The propane system is designed, installed, and maintained in accordance with NFPA-58, ASTM 53A, ASTM 2513 and state law.\n\n\n\nFive-year accident history:  The Nokian facility at this location is newly constructed and has not had an accident involving propane that caused deaths, injuries, property or environmental damage, evacuations, or sheltering in place within the last five years of the preparation of this plan.\n\n\n\nThe emergency response program:  In the event of an emergency involving our propane system, it is our policy to notify the Dayton Fire Department and request that they help respond to the emergency.  We have coordinated our response plans with the fire department; members of the fire department have inspected our propane system and will conduct a joint exercise with us in an emergency evacuation test.\n\n\n\nPlanned changes to improve safety:  Continue to reinforce safe practices during operational training and safety training meetings.\n\n"
    }
  ]
}