{
  "FacilityID": 1000080356,
  "FacilityName": "Wetumka Liquid Loading Facility",
  "FacilityStr1": "6 miles S. of Wetumka on Hwy 75",
  "FacilityStr2": null,
  "FacilityCity": "Wetumka",
  "FacilityState": "OK",
  "FacilityZipCode": "74883",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40063",
  "LEPC": "Hughes County LEPC",
  "FacilityLatDecDegs": "35.144444",
  "FacilityLongDecDegs": "-096.247222",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Energy Transfer LP",
  "Company2Name": null,
  "CompanyDUNS": 610792264,
  "Company2DUNS": null,
  "OperatorName": "Energy Transfer LP",
  "OperatorStr1": "8111 Westchester Dr",
  "OperatorStr2": "Suite 600",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75225",
  "OperatorZipCodeExt": "6142",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000001151",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-12-14 15:08:45",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-12 11:29:37",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-12 11:29:37",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.144444,
  "FRS_Long": -96.247222,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100322,
      "AltID": "Storage Tanks",
      "FacilityID": 1000080356,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125666,
          "ProcessID": 1000100322,
          "ChemicalID": 98,
          "Quantity": 1051832.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101571,
          "ProcessID": 1000100322,
          "NAICSCode": "42471",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000062301,
              "Process_NAICS_ID": 1000101571,
              "SafetyReviewDate": "2017-07-26 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2017-06-12 00:00:00",
              "ChangeCompletionDate": "2019-07-26 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Gas Detection",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-12-03 00:00:00",
              "TrainingReviewDate": "2018-10-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-11-08 00:00:00",
              "EquipmentInspectionDate": "2019-02-05 00:00:00",
              "EquipmentTested": "Gas Detection",
              "ComplianceAuditDate": "2019-04-09 00:00:00",
              "AuditCompletionDate": "2019-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2017-09-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000063069,
                  "PreventionProgram2ID": 1000062301,
                  "ProcessChemicalID": 1000125666
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080356,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-10-10 00:00:00",
    "ERTrainingDate": "2018-10-10 00:00:00",
    "CoordinatingAgencyName": "Hughes County LEPC - OK132",
    "CoordinatingAgencyPhone": "4053792203",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080356,
      "SummaryText": "Enable Midstream Wetumka Liquid Loading Facility \r\nExecutive Summary\r\n\t\r\n\t\r\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\n\t\r\nEnable Midstream and the Wetumka Liquid Loading Facility have a long-standing commitment to worker and public safety. Our commitment is demonstrated by the capital and human resources invested in our accident protection and accidental release prevention/mitigation programs. Enable Midstream's mitigation efforts include:  personnel training; safety engineered design; thorough process hazard analyses; compliance audits; management of change; contractor oversight; and planned equipment installation/operation/maintenance of our processes.  Enable Midstream's policy is to implement reasonable controls to prevent foreseeable releases of regulated substances.  However, if a release does occur, gas plant and loading facility personnel are trained to follow Enable Midstream's emergency response procedures in an effort to safely avert further release and minimize the impact to public and environmental receptors.\r\n\t\r\nDESCRIPTION OF THE WETUMKA LIQUID LOADING FACILITY AND REGULATED SUBSTANCES\r\n\t\r\nThe Wetumka Liquid Loading Facility (Wetumka LLF), located approximately six (6) miles south of Wetumka in Hughes County, Oklahoma, operates a highway loading facility. This loading facility receives propane by pipeline from the Enable Midstream Wetumka Gas Plant approximately 4 ½ miles away. This propane is a natural gas liquid (NGL) product comprised primarily of propane, but can contain small amounts of ethane and butane, all of which are regulated flammable substances.  The part of the process that was selected to represent all regulated flammable substances at the Wetumka LLF which could contain a regulated flammable substance above the threshold quantity is as follows:\r\n\t\r\n¿\t Propane Storage Tank comprised of a primarily propane (NGL) mixture.\r\n\t\r\nThis storage vessel was selected due to having the greatest inventory and endpoint potential of a regula"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000080356,
      "SummaryText": "proper materials and spare parts are used when repairs are made. \r\n\t\r\n\t\r\nSafe Work Practices\r\n\t\r\nThe Wetumka LLF has long-standing safe work practices in place to help ensure worker and process safety.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\n\t\r\nManagement of Change (MOC)\r\n\t\r\nThe Wetumka LLF has a comprehensive system to manage changes to all covered processes.  This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided any necessary training on the change.\r\n\t\r\nIncident Investigation\r\n\t\r\nThe Wetumka LLF promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080356,
      "SummaryText": "ted flammable substance that could hypothetically be released and have offsite consequences.\r\n\t\r\nIn order to establish the safest possible environment for our employees and the public, any inventory of regulated toxic substances is maintained below the threshold quantity. OSHA's Process Safety Management (PSM) standard 29 CFR 1910.119 does not apply to the Wetumka LLF due to its status of an unmanned facility.\r\n\t\r\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\r\n\t\r\nUnder the RMP regulations, the Wetumka LLF is classified as a Program Level 2 facility.  Under Program Level 2 guidelines, the Worst-Case Scenario (WCS) associated with a release a regulated flammable mixture is a Vapor Cloud Explosion (VCE) involving the full inventory of the largest storage tank containing the propane NGL mixture.  A written procedure is in place to limit the storage inventory to 219,094 pounds (80% of the maximum tank capacity).  However, for Worst Case Scenario calculations, the full inventory (100% maximum tank capacity of 273,868 pounds) of this tank are assumed to release and ignite, resulting in a VCE.  The maximum distance to the 1-psi over pressure endpoint for this WCS is 0.21 miles or 376 yards.  Additionally, although there are numerous controls in place to prevent such releases and to manage their consequences, no credit for passive mitigation measures was taken into account in evaluating this WCS for the Wetumka LLF.\r\n\t\r\nThe Alternative Release Scenario (ARS) for flammable substances at the Wetumka LFF is a VCE resulting from a 10 minute release of propane NGL from a propane loading pump seal leak totaling 34,000 pounds.  The release is expected to be isolated by the gas detection system initiating a facility emergency shutdown within ten (10)  minutes (active mitigation).  The maximum distance to the 1-psi overpressure endpoint for this event is 0.09 miles or 159 yards.\r\n\t\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\n\t\r\nThe following is a summary of the accidental release preventi"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000080356,
      "SummaryText": "recurrence of the incident or a similar incident.  The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to loading facility management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete.  The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings.  Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations. \r\n\t\r\nCompliance Audits\r\n\t\r\nTo help ensure that the accidental release prevention program is functioning properly, the Wetumka LLF periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are required at least every 3 years.  Both hourly and staff personnel participate as audit team members.  The audit team develops findings that are forwarded to loading facility management for resolution.  Corrective actions taken in response to the audit team's findings are tracked until they are complete.  The final resolution of each finding is documented, and the two most recent audit reports are retained. \r\n\t\r\n\t\r\nCHEMICAL-SPECIFIC PREVENTION STEPS\r\n\t\r\nThe processes at the Wetumka LLF have hazards that must be managed to ensure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\n\t\r\nUniversal Prevention Activities\r\n\t\r\nThe accident prevention program summarized previously is applied to all processes at the Wetumka LLF.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors."
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000080356,
      "SummaryText": "Specialized Safety Features\r\n\t\r\nThe Wetumka LLF has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release.  The following types of safety features are used in the covered processes:\r\n\t\r\nRelease Detection\r\n¿\tHydrocarbon area detectors with alarms and shutdowns\r\n¿\tHigh/Low process alarms and shutdowns\r\n\t\r\nRelease Containment/Control\r\n¿\tPressure relief valves set below maximum allowable operating pressure of equipment\r\n¿\tValves to permit isolation of the process (manual or automated)\r\n¿\tAutomated shutdown systems for specific process parameters (e.g., high temperature)\r\n¿\tRedundant equipment and instrumentation (e.g., uninterruptable power supply for process control system)\r\n¿\tAtmospheric pressure relief devices\r\n\t\r\nRelease Mitigation\r\n¿\tFire extinguishers.\r\n¿\tPersonnel trained in company emergency response procedures\r\n¿\tPersonal protective equipment (e.g., chemical protective clothing)\r\n\t\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\t\r\nThe Wetumka LLF has an excellent record of accidental release prevention over the past 5 years.  There have been no accidental releases that have occurred in the past 5 years that have resulted in offsite effects.  Every incident is investigated thoroughly to determine ways to prevent similar incidents from recurring.  \r\nEMERGENCY RESPONSE PROGRAM INFORMATION\r\n\t\r\nThe Wetumka LLF maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of fire or explosion if a flammable substance is accidentally released.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a rele"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080356,
      "SummaryText": "ed to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\n\t\r\nThe Wetumka LLF primarily uses the Hazard and Operability (HAZOP) analysis technique to perform these evaluations.  HAZOP analysis is recognized as one of the most systematic and thorough hazard evaluation techniques.  The analyses are conducted using a team of Enable Midstream personnel and/or contractors who have operating and maintenance experience as well as engineering expertise.  This PHA (Process Hazards Analysis) Team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary. \r\n\t\r\nThe PHA team's recommendations are reviewed with corporate management to approve or revise recommended mitigation actions.  Once approved, mitigation actions are assigned a relative risk ranking based upon the magnitude/immediacy of necessary actions to reduce hazard risks - as deemed necessary by the PHA Team, PHA Team Leader, and/or Corporate Management. This risk reduction ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention.  All management-approved PHA Team recommendations are mitigation options in response to PHA team findings are tracked until they are completed.  The final resolution of each finding is documented and retained.\r\n\t\r\nPeriodically, the Wetumka LLF updates and revalidates the initial PHA to ensure that process controls remain technologically adequate, and that process hazards are minimized and are within acceptable company risk tolerances.  The PHA Revalidation verities that the process does not deviate significantly from its original engineering design and safety features. These periodic revalidations/reviews are conducted at least every 5 years and will be conducted at this frequency until the process is decommissioned. The result"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080356,
      "SummaryText": "on program in place at the Wetumka LLF. The processes at the loading facility which are regulated by the Environmental Protection Agency's (EPA's) Risk Management Program (RMP) rule are also subject to the Occupational Safety and Health Administration's (OSHA's) Process Safety Management (PSM) regulation and this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accidental release prevention program.\r\n\t\r\nEmployee Participation\r\n\t\r\nThe Wetumka LLF encourages employees to participate in all facets of process safety management and accident prevention.  Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team.  Employees have access to all information created as part of the loading facility accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan that is maintained at the loading facility and addresses each accident prevention program element.  In addition, the loading facility has a number of initiatives under way that address process safety and employee safety issues.  These initiatives include forming teams to promote both process and personal safety. The teams typically have members from various areas of the loading facility and plant, including operations, maintenance, engineering, and loading facility management. Operations personnel also participate in the development and review of operating procedures, process safety information (PSI) and training and mentoring of other personnel.\r\n\t\r\nProcess Safety Information\r\n\t\r\nThe Wetumka LLF develops and maintains a variety of technical documents that are used to help maintain safe operation of the loading facility.  These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080356,
      "SummaryText": "ventories, and equipment design basis/configuration information.  Specific departments within the loading facility are assigned responsibility for maintaining up-to-date process safety information.  A table summarizing the reference documents and their location is readily available as part of the written employee participation plan to help employees locate any necessary process safety information.\r\n\t \r\nChemical-specific information, including exposure hazards and emergency response/ exposure treatment considerations, is provided in material safety data sheets (MSDSs). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals.  For specific process areas, the loading facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in our Operating Procedures and/or Process Safety Information. The loading facility ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\r\n\t\r\nThe loading facility also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment.  This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\n\t\r\nProcess Hazard Analysis (PHA)\r\n\t\r\nThe Wetumka LLF has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled.  Within this program, each process is systematically examin"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000080356,
      "SummaryText": "s and findings from these updates are documented and retained.  As with the initial analysis, the PHA Team findings/recommendations will be forwarded to corporate management for approval/revision, and the final resolution of the action tasks will be documented and retained.\r\n\t\r\nOperating Procedures\r\n\t\r\nThe Wetumka LLF maintains written procedures that address various modes of process operations, including (1) initial unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) startup following a turnaround or after an emergency shutdown These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators.  These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process. \r\n\t\r\nIn addition, the Wetumka LLF maintains Operating Procedures and/or process safety information that provide guidance on how to respond to upper or lower limit exceedances for specific process or equipment parameters.  This information is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks.\r\n\t\r\nTraining\r\n\t\r\nTo complement the written procedures for process operations, the Wetumka LLF has implemented a comprehensive training program for all employees involved in operating a process.  New employees receive basic training in loading facility operations if they are not already familiar with such operations.  After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks.  After operators demonstrate (e.g., through tests, and skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently.  In addition,"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000080356,
      "SummaryText": "all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level.  This refresher training is conducted at least every 3 years.  All training is documented for each operator, including the means used to verify that the operator understood the training.\r\n\t\r\nContractors\r\n\t\r\nThe Wetumka LLF uses contractors to supplement its work force during periods of increased maintenance or construction activities.  Because some contractors work on or near process equipment, the loading facility has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform loading facility personnel of any hazards that they find during their work.  This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work.  In addition, the Wetumka LLF evaluates contractor safety programs and performance during the selection of a contractor. Loading facility/plant personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\r\n\t\r\nPre-Startup Safety Reviews (PSSRs)\r\n\t\r\nThe Wetumka LLF conducts a Pre-Startup Safety Review (PSSR) for any new facility or facility modification that requires a change in the process safety information.  The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service.  This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000080356,
      "SummaryText": "ase occurs.  Company personnel are also available to assess post-incident cleanup and decontamination requirements.  In addition, the facility has procedures that address maintenance, inspection, and testing and use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties.  The emergency response program is updated when necessary based on modifications made to facility processes or lessons learned from other Enable Midstream gas plants and facilities.  \r\n\t\r\nThe overall emergency response program for the Wetumka LLC is coordinated with the Hughes County Local Emergency Planning Committee (LEPC) and the local fire department.  This coordination includes periodic meetings of the LEPC, which includes local emergency response officials, local government officials, and industry representatives.  The Wetumka LLC has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  \r\n\t\r\nCHANGES/PLANNED CHANGES TO IMPROVE SAFETY\r\n\t\r\nThe Wetumka LLC places high priority in resolving findings and recommendations from PHAs, safety audits and incident investigations, some of which may result in modifications to the process and procedures. The following changes have been completed in response to these types of activities:\r\n\t\r\n¿\tRevisions/enhancements to personnel training programs\r\n¿\tRevisions/enhancements to contractor safety programs\r\n¿\tRevisions/enhancements to mechanical integrity programs\r\n¿\tRevisions/enhancements to site security and access control"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000080356,
      "SummaryText": "are operationally ready.  The PSSR review team uses checklists to verify all aspects of readiness.  A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n\t\r\nMechanical Integrity\r\n\t\r\nThe Wetumka LLF has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process.\r\n\t\r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they perform their jobs in a safe manner. Written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment. \r\n\t\r\nAnother integral part of the mechanical integrity program is quality assurance. The Wetumka LLF incorporates quality assurance measures into equipment purchases and repairs.  This helps ensure that new equipment is suitable for its intended use and that"
    }
  ]
}