{
  "FacilityID": 1000057869,
  "FacilityName": "Coyne Chemical - Reading Plant",
  "FacilityStr1": "125 Witman Road",
  "FacilityStr2": null,
  "FacilityCity": "Reading",
  "FacilityState": "PA",
  "FacilityZipCode": "19605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42011",
  "LEPC": "Berks County LEPC",
  "FacilityLatDecDegs": "40.398401",
  "FacilityLongDecDegs": "-075.931581",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 112233445,
  "ParentCompanyName": "George S. Coyne Chemical Co., Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "George S. Coyne Chemical Co., Inc.",
  "OperatorStr1": "3015 State Road",
  "OperatorStr2": null,
  "OperatorCity": "Croydon",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19021",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": "PAD014409742",
  "EPAFacilityID": "100000214519",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-03-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-05-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-05-26 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-05-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-05-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.39732,
  "FRS_Long": -75.93208,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "500",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072318,
      "AltID": "Chemical Handling/Storage",
      "FacilityID": 1000057869,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089246,
          "ProcessID": 1000072318,
          "ChemicalID": 62,
          "Quantity": 9600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000073500,
          "ProcessID": 1000072318,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000060553,
              "Process_NAICS_ID": 1000073500,
              "SafetyReviewDate": "2016-03-05 00:00:00",
              "PHA_Date": "2016-02-17 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Loss of Toxic Gas Sensor",
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Toxic Gas Monitor",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-03-09 00:00:00",
              "TrainingReviewDate": "2016-03-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Chlorine Safety Video with handout",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-05-04 00:00:00",
              "EquipmentInspectionDate": "2016-03-23 00:00:00",
              "EquipmentTested": "Chlorine Gas Monitor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2015-08-22 00:00:00",
              "PreStartupReviewDate": "2010-09-04 00:00:00",
              "ComplianceAuditDate": "2016-03-10 00:00:00",
              "AuditCompletionDate": "2016-08-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-04-01 00:00:00",
              "HotWorkPermitReviewDate": "2016-02-10 00:00:00",
              "ContractorSafetyReviewDate": "2016-05-04 00:00:00",
              "ContractorSafetyEvalDate": "2016-05-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000074152,
                  "PreventionProgram3ID": 1000060553,
                  "ProcessChemicalID": 1000089246
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000057869,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-03-09 00:00:00",
    "ERTrainingDate": "2016-03-05 00:00:00",
    "CoordinatingAgencyName": "Berks County LEPC",
    "CoordinatingAgencyPhone": "6103744300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057869,
      "SummaryText": "Executive Summary - Coyne Chemical - Reading Plant\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nIt is the policy of Coyne Chemical - Reading Plant, to have programs in place to identify and handle emergency response and public preparedness issues involving products handled at the Reading Plant, in transit, and during storage and/or use at a customer's site. These programs address the following items deemed critical to achieving this goal: \r\n\r\nA¿     Documentation, review, coordination and tests of emergency response plans. \r\nA¿     Procedures for response, reporting, investigation and preventative measure implementation \r\n      with respect to incidents which could have or did result in a release, explosion and/or fire. \t\r\nA¿     Procedures for supplying emergency response information regarding chemicals handled to \r\n      emergency response agencies and communication with state and local emergency planning and \r\n      response organizations regarding potential hazards of products handled at facilities. \r\n\r\nFACILITY DESCRIPTION AND REGULATED SUBSTANCES HANDLED\r\n\r\nCoyne Chemical - Reading Plant, is a chemical distributor serving the areas of Pennsylvania, New Jersey, Delaware, New York, Maryland, Washington D.C. and Virginia.  In this capacity, Coyne is a re-seller of pre-packaged chemicals to industrial, commercial, and municipal customers.  Of the current inventory of approximately 100 types of chemicals at Coyne Chemical - Reading Plant, only four (4) are currently subject to the PSM Standard; one (1) of these is also subject to the EPA RMP rule.  The PSM chemicals include chlorine, sulfur dioxide, formaldehyde solution, and oleum; chlorine (CAS # 7782-50-5) is also subject to the EPA RMP.  These four chemicals are received and stored for ultimate distribution to customers. \r\n\r\nThe facility is located on 5.5 acres within Muhlenberg Township.  It is bordered by an industrial park to the North, Norfolk-Southern and RBMN Railroads to the East,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057869,
      "SummaryText": "ct off-site human health or the environment.\r\n\r\nAccidental releases from storage and handling of the RMP-regulated chemicals are prevented by studying the hazards of the operation to identify potential hazards, and implementing procedures, installing control devices and systems, and providing training to control those hazards.  The storage and handling processes are periodically evaluated to assess the risk of the operations by current standards and to make improvements where necessary. \r\n\r\nMaintenance of equipment which contains or handles hazardous substances is also a key element in preventing accidental releases.  In addition, any changes made to the equipment which handles or stores hazardous substances are carefully reviewed prior to implementation to ensure that safety and environmental risks are recognized and addressed.  Finally, while many steps have been taken to prevent accidental releases, in the event that an accidental release would occur, it would be formally investigated to determine the root causes and to prescribe corrective actions to prevent the release from recurring in the future.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nThere have been no accidents involving RMP or PSM regulated chemicals in the previous five (5) years.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nCoyne Chemical - Reading Plant utilizes an Integrated Preparedness, Prevention, and Contingency Plan (IPPC) to manage the response to potential fires, toxic vapor releases, chemical spills, natural disasters and medical and/or rescue emergencies.  Coyne Chemical - REading Plant operations employees are trained under the HAZWOPER regulations to respond to various plant emergencies, including minor spills and releases.  The plant relies on the local fire department (Goodwill Fire Company, Reading, PA) for fire fighting and search and rescue activities, and chemical spills or toxic vapor releases beyond the capabilities of Coyne personnel.  The worst-case scenario for the Reading facility is a release of"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000057869,
      "SummaryText": "the entire contents of one 150 lb. chlorine cylinder in 10 minutes (resulting from a broken valve.)  This scenario has an ERPG-3 end point of 4/10 mile.  Due to the fact that that this item is stored and transported in storage racks designed to house this type of cylinder, the worst case scenario is not likely to occur.  An alternate-case scenario for Chlorine is a small leak from the valve or packing nut of a cylinder releasing 150 lbs. of Chlorine over a period of one hour, with an ERPG-3 endpoint of less than 1/10 mile. Mitigation for either scenario includes applying a cylinder A Kit or placing the leaking cylinder into a containment vessel located on-site.  \r\n\r\nCHANGES TO IMPROVE SAFETY\r\n\r\nThere are many operating and mechanical changes that continuously occur to improve the safe operation of Coyne Chemical - Reading Plant facilities.  It is the policy of Coyne Chemical - Reading Plant to have programs in place to promote the process of risk assessment and management in relation to the chemicals and services provided by the Company. These programs address the primary goal of continual risk reduction by analysis of the hazards of the chemicals distributed, the likelihood of accidents/incidents, and the impact of these releases on the public and the environment.  The Company fully supports and encourages employee participation in the safety programs established and requires strict adherence to the guidelines established for the safe operation of its facilities. Continuous risk reduction will be encouraged through the following steps: \r\nA¿\tProduct review and hazard assessment\r\nA¿\tHazard  ranking of the chemicals distributed, \r\nA¿\tReview with Manufacturer of products supplied,\r\nA¿\tIncident review and analysis, and \r\nA¿\tEmployee training \r\n\r\nIn addition, there is a Safety Suggestion Program, which is part of the site's overall Safety Program, which allows employees the opportunity to actively participate in improving safety and health at the facility."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057869,
      "SummaryText": "Service Tire Company on the West, and Witman Road and Pacific Pride Fueling Station to the South.  Storm water runs off to the South towards Witman Road into municipal storm drains.\r\n\t\r\nChlorine is transported to and from this facility in DOT-approved cylinders of 150 lb. capacity. All full cylinders are stored inside the warehouse in storage racks with 16 cylinders per rack, inside a sealed room with atmospheric monitoring equipment.\r\n\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nManaging Process Safety at Coyne Chemical - Reading Plant requires proactive identification, evaluation, and mitigation or prevention of chemical releases that could occur as a result of failures in processes, procedures, or equipment.  Coyne Chemical - Reading Plant maintains a process safety management program that requires a systematic approach to evaluating the whole process. Using this approach, the process design, process technology, operational and maintenance activities and procedures, non-routine activities and procedures, emergency preparedness plans and procedures, training programs, and other elements which impact the covered RMP process are all considered in the evaluation.  The various levels of protection  that have been incorporated into the design and operation of the unit process to prevent or mitigate the release of hazardous chemicals are evaluated periodically and  revised as needed to assure their effectiveness at each level.  Ultimately, the major objective of process safety management of hazardous chemicals is to prevent unwanted releases of hazardous chemicals which could expose our employees, the community and the environment to serious hazards.\r\n\r\nThe processes subject to the RMP regulation are also subject to OSHA process safety management (PSM) regulation.  OSHA's PSM regulation is intended to prevent potential releases inside the plant and the RMP program is meant to help control and prevent releases which may affe"
    }
  ]
}