{
  "FacilityID": 1000115434,
  "FacilityName": "Ormond Beach Generating Station",
  "FacilityStr1": "6635 South Edison Drive",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93033",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.128889",
  "FacilityLongDecDegs": "-119.178889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": "www.genon.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Ormond Beach Power, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ormond Beach Power, LLC",
  "OperatorStr1": "6635 South Edison Drive",
  "OperatorStr2": null,
  "OperatorCity": "Oxnard",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93033",
  "OperatorZipCodeExt": null,
  "FTE": 35,
  "OtherEPAFacilityID": "CAR000039750",
  "EPAFacilityID": "100000095327",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "00065",
  "SafetyInspectionDate": "2020-05-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 34.13248,
  "FRS_Long": -119.16674,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000143978,
      "AltID": "Aqueous Ammonia",
      "FacilityID": 1000115434,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000180034,
          "ProcessID": 1000143978,
          "ChemicalID": 57,
          "Quantity": 87000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000145532,
          "ProcessID": 1000143978,
          "NAICSCode": "221112",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000087159,
              "Process_NAICS_ID": 1000145532,
              "SafetyReviewDate": "2024-06-18 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2024-06-18 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-04-14 00:00:00",
              "TrainingReviewDate": "2024-06-18 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "computer based",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-06-18 00:00:00",
              "EquipmentInspectionDate": "2021-10-26 00:00:00",
              "EquipmentTested": "Aqueous Ammonia SCR System",
              "ComplianceAuditDate": "2024-06-18 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000088007,
                  "PreventionProgram2ID": 1000087159,
                  "ProcessChemicalID": 1000180034
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000115434,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-08-15 00:00:00",
    "ERTrainingDate": "2023-10-31 00:00:00",
    "CoordinatingAgencyName": "City of Oxnard Fire/CUPA",
    "CoordinatingAgencyPhone": "8053857722",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 7,
      "FacilityID": 1000115434,
      "SummaryText": "ppendix J. The last emergency response and evacuation drill was conducted in the 23 February 2023. A CUPA inspection was conducted on 27 May 2020.\nThe Ormond Beach\u0092s emergency response plan includes the following core elements:\nSpecific actions to be taken in response to an accidental release of aqueous ammonia\nProcedures to notify local and public agencies including the CUPA (Oxnard Fire Department), the California Office of Emergency Services, and the National Response Center as necessary\nInformation regarding the training of employees \nA list of other federal and state requirements to which the facility is subject\nManagement System Summary\nThe management system oversees the implementation of the RMP elements in order to manage the risk of a chemical release at this facility. Pursuant to Title 19 CCR Section 5050.6, a program management system has been established to oversee the implementation of the RMP elements.  Management system components for this facility include:\nIdentification of the qualified person/position with responsibility for coordinating the RMP\nOrganizational chart showing the positions with tasks involving the aqueous ammonia storage and handling system\nRoles and responsibilities of positions at the facility\nPlanned Changes to Improve Safety\nNo action items were identified during the Hazard Review \u0093what-if\u0094 scenarios analysis. Ormond Beach enforces continuous improvements to safety and health and tracks training to ensure commitment to safe working practices and the protection of the employees and the environment. Ormond Beach will work closely with the CUPA to continue to ensure that all requirements are addressed."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000115434,
      "SummaryText": "ction 3220 (Emergency Action Plan) and OSHA Standard 29 CFR Part 1910.38 (Emergency Action Plans or EAP). The basic concept of Ormond Beach\u0092s emergency procedures is to provide a comprehensive approach for managing emergencies. The four elements of this approach are prevention, preparedness, response, and recovery.\nOrmond Beach\u0092s emergency procedures serve as a guide for emergency control staff, company personnel, emergency assistance groups, and law enforcement agencies that may be called upon to participate in controlling an emergency within the facility and surrounding areas. These procedures include employee notification of emergencies and evacuation procedures for all emergency situations.  \nIn December 2021, EPA updated Chapter 8 of the General Risk Management Program Guidance to reflect the new emergency response coordination provision (40 CFR 68.93), which required compliance beginning September 21, 2018. The owner or operator of a stationary source shall coordinate response needs with local emergency planning and response organizations to determine how the stationary source is addressed in the community emergency response plan and to ensure that local response organizations are aware of the regulated substances at the stationary source, their quantities, the risks presented by covered processes, and the resources and capabilities at the stationary source to respond to an accidental release of a regulated substance. Ormond Beach coordinates with the CUPA via Hazardous Materials Business Plan (HMBP) reporting via the California Environmental Reporting System (CERS) and other CUPA required RMP update procedures.\nPursuant to CUPA requirements (per 40 CFR Part 68.12 and 19 CCR Section 2745.8) emergency procedures are in place in the event of a release of a regulated substance (aqueous ammonia). Emergency response training is conducted annually. The most recent emergency response training was conducted in October 2023. A copy of the training logs is included in A"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000115434,
      "SummaryText": "to the design and operation of the process to prevent or mitigate the release of hazardous chemicals have been evaluated and strengthened to assure their effectiveness at each level. Ormond Beach uses the proactive identification, evaluation, and mitigation for prevention of chemical releases that could occur as a result of failures in process, procedures, or equipment. \nChemical-Specific Prevention Steps\nIn addition to implementation of the CalARP Prevention Program 2 elements, Ormond Beach has implemented specific safety features for the prevention, detection, and control of releases of regulated (and other) substances at the facility. The following are some of the control and detection equipment located in and around the facility to minimize the risk of an accident involving hazardous materials:\nPressure relief and safety valves\nHigh-level alarms and shutoffs\nSecondary tank containment (55,000 gallons) \nEmergency control stations (control room)\nAmmonia gas detector system\nFail-safe and interlock process controls (automatic)\nEmergency shutdown systems (ESD)\nFive-Year Accident History\nThere have been no accidental releases from the aqueous ammonia storage and handling system at Ormond Beach in the past 5 years that have resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage (40 CFR Part 68.42).\nOffsite Consequence Analysis Summary\nPer 9 April 2004, amendments to the Chemical Accident Prevention rule (69 FR 18819), description of OCA is no longer required in the Executive Summary. \nEmergency Response Program Summary\nOrmond Beach has developed written emergency response procedures to address all elements that may be encountered during planning, response, or follow-up of an emergency at the facility. Application of the emergency response procedures ensures compliance with California Occupational Health and Safety Administration (OSHA) Title 8, Se"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000115434,
      "SummaryText": "Beach uses aqueous ammonia in the SCR NOX reduction system. Aqueous ammonia is a regulated substance and is present at the facility above the federal RMP and CalARP TQ. Therefore, Ormond Beach is subject to the RMP and CalARP requirements. The facility is coded:\nNorth American Industrial Classification System (NAICS) as 221112\nStandard Industrial Classification (SIC) Code 4911\nIn accordance with the CalARP regulations and with the guidance of the Oxnard Fire Department as the CUPA, it has been determined that the SCR system falls under the CalARP Prevention Program 2 requirement.\nCompliance with the CalARP comprehensive program validates the integrity of the processes which handle flammable or toxic materials. The objective of the regulation is to prevent accidental releases of hazardous chemicals. To control these types of hazards, Ormond Beach has developed the necessary expertise, experience, judgment, and proactive initiative within their workforce to properly implement and maintain an effective prevention program. Through compliance with the regulations, standards, and with CUPA guidance, the Ormond Beach facility has implemented the requirements of the Prevention Program 2.\nPrevention Program 2 Elements\nAn effective program requires a systematic approach to evaluating the entire chemical process. Using this approach the following components were considered in the evaluation in accordance with Title 40 CFR Parts 68.48 through 68.60 (Subpart C) and Title 19 CCR Section 5070.6. Program 2 includes all four Program 1 elements and seven additional elements:\nProgram 1 Elements (40 CFR 68.12 and 68.15)\n5-Year Accident History\nHazard Assessment (Offsite Consequence Analysis)\nEmergency Response Program\nManagement System\nAdditional Program 2 Elements (40 CFR Part 68, Subpart C)\nSafety Information\nHazard Review\nOperating Procedures\nEmployee Training\nMaintenance Procedures\nCompliance Audits\nIncident Investigation\nThe various lines of defense that have been incorporated in"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000115434,
      "SummaryText": "adium pentoxide (V2O5) on a ceramic substrate and operates within a normal temperature range of 600 to 750°F. A process flow diagram is provided in Appendix B. \nRegulated Substances\nAqueous ammonia is a toxic substance above the federal RMP and CalARP thresholds (19 California Code of Regulations [CCR], Section 5130.6, Tables 1 and 3, respectively). No regulated flammable substances are present at the facility in excess of the TQs under the regulation. All quantities of other materials are also below applicable thresholds.\nAqueous ammonia, 29 percent by weight, 40,0000 gallons (maximum), 87,000 pounds (maximum) as NH3\nTable 1 shows capacities for determination of CalARP applicability for an RMP. As shown below, the aqueous ammonia quantity onsite exceeds CalARP and federal RMP thresholds. Appendix C contains safety data sheets for aqueous ammonia. For the mass determination, a specific gravity of 0.8974 was used to calculate a density of 7.48 pounds per gallon for the 29 percent ammonium hydroxide (NH4OH) solution. \nTable 1\tRMP/CalARP Substance Criteria for Applicable Materials and Quantities\nListed\nSubstance\tCAS\nNo.\tRMP / CalARP Threshold\tMaximum\nQuantity\nAqueous Ammonia\n(20% or greater)\t1336-21-6\n(7664-41-7)\t20,000 lb federal\n500 lb state\t87,000 lb\n(as ammonia)\nV2O5\t1314-62-1\t10,000 lb state only\t(Article Exemption)\nNotes:\n% = percent\nlb = pounds\nV2O5 = vanadium pentoxide\nV2O5 (trade name VNX) is the active SCR catalyst material. VNX is a solid deposited on a ceramic honeycomb material (less than 5 percent in matrix), the design of which promotes interaction with the exhaust gas stream within the SCR. As such, VNX remains within the SCR and is not released to the atmosphere. This substance, therefore, meets the definition of an article (Section 5050.3) and is therefore exempted from the requirements of the CalARP Program as per Section 5130.2(b)(3). VNX is not federally listed under 40 CFR 68, Appendix A.\nSummary of the Accidental Release Prevention Program\nOrmond"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000115434,
      "SummaryText": "fault zones are the Malibu Coast-Santa Monica-Hollywood-Raymond Fault Zone, 9 miles southeast of the site; the Oak Ridge Fault, 9 miles north of the site; and the Ventura Fault, 11 miles north of the site.\nThe site is located in a light to heavy industrial zone. The main area covers approximately 53 acres and is bounded by Edison Drive to the north and by the Pacific Ocean to the south. A Ventura County Railway spur  terminates at the site. The local railway is shared with other industrial facilities in the area. A vicinity and location map is contained in Appendix A.\nThe Ormond Beach consists of two gas-fired boilers and associated steam-driven turbine units. The Unit 1 steam boiler is rated at 741 megawatts (MW) and the Unit 2 steam boiler is rated at 750 MW. The two auxiliary boilers used for starting the main units, are rated at 275 million British thermal units (MMBTU)/hour. Main Units 1 and 2 are each equipped with SCR for the control of oxides of nitrogen (NOX) emissions. Aqueous ammonia is also used in the station water treatment system for pH control, and in the demineralizer system for the regeneration of anion and cation exchange resins.\nThe regulated substance used at the facility above California\u0092s threshold quantity (TQ) is aqueous ammonia (ammonium hydroxide, 29 percent by weight). All other regulated substances onsite are in quantities below applicable TQs.\nSelective Catalytic Reduction\nAqueous ammonia (CAS Number 1336-21-6), 29 percent concentration by weight, with a vapor pressure of 9.1 pounds per square inch gauge (psig) at 60 degrees Fahrenheit (°F), is used in the SCR system to control NOX emissions from the two steam boilers (Units 1 and 2) as Best Available Control Technology (BACT). The SCR system reduces NOX emissions by injecting ammonia into the boiler exhaust gas stream, upstream of a catalyst matrix. Ammonia, NOX, and oxygen react on the surface of the catalyst to form nitrogen and water. The low temperature catalyst is comprised of van"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000115434,
      "SummaryText": "rdkeeping and reporting requirements. RMP*eSUBMIT continues to be the tool for submitting RMP information to the EPA.\nEffective 6 March 2024, the California Environmental Protection Agency (CalEPA) has amended and relocated the California Code of Regulations, title 19, division 2, chapter 4, sections 2640 to 2671, including two appendices and chapter 4.5, into a new division 5. The creation of a new division 5 has prompted a renumbering of the regulations. This renumbering is reflected throughout this RMP.\nAccidental Release Prevention and Emergency Response Policies\nIt is the policy of Ormond Beach to conduct its business operation in a manner that protects its employees, environment, property, and the general public from any harm that may occur as a result of its operation. To achieve this end, Ormond Beach: \nStrives to conduct its business so as to maintain compliance with applicable federal, state, and local safety, health, and environmental regulations.\nImplements its emergency response policies to comply with the overall corporate policy of providing its workers with a safe workplace and of minimizing risk to the public. The safety of emergency and non-affected personnel is the highest priority; therefore, all procedures must be implemented in the appropriate manner (i.e., safely executed rescue and medical activities). Protection of the environment is also a high priority. Once the issues of life, safety, and the environment are addressed, the secondary issues of property conservation and business recovery may be considered.\nFacility Description\nThe Ormond Beach (Facility Identification [ID] Number 1000 0009 5327) is located at 6635 South Edison Drive in Oxnard, California (site/facility at the southern margin of the Oxnard Plain adjacent to the Pacific Ocean, and approximately 60 miles west northwest of Los Angeles, California (34° 7\u0092 44\u0094 north, 119° 10\u0092 4\u0094 west). The elevation of the facility is approximately 15 feet above sea level. The nearest earthquake"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000115434,
      "SummaryText": "EXECUTIVE SUMMARY\nPursuant to the requirements of Title 40 Code of Federal Regulations (CFR), Parts 68.1 through 68.220 and Chapter 6.95, Article 2 of the California Health and Safety Code (HSC) Section 25531 through Section 25543.3, this Federal Risk Management Plan (RMP) is implemented as the California Accidental Release Prevention (CalARP) Program.\nThe scope of this RMP is based on the guidance of the Certified Unified Program Agency (CUPA), the City of Oxnard Fire Department, to ensure that all contemporary issues are resolved and to incorporate state requirements. With input from the CUPA, the selective catalytic reduction (SCR) ammonia storage and handling system has been identified as the only process at the Ormond Beach Generating Station (Ormond Beach) facility, which triggers the CalARP RMP requirements. This system was determined to be covered by the CalARP Prevention Program 2 requirements.\nOn 31 March 2004, the amendment to the Chemical Accident Prevention Rule (Risk Management Program), under the Clean Air Act, Section 112 (r) (7), was signed. The amendment:\nRequires a correction to reportable information on chemical accidents be added to the RMP within 6 months of the date of the accident\nRequires that changes to emergency contact information be corrected within 1 month\nRemoves the requirement to include a brief description of the offsite consequence analysis (OCA) in the RMP\u0092s Executive Summary\nAdds three RMP data elements\nThe Environmental Protection Agency (EPA) also amended the RMP*Submit format to expand the list of possible causes for accidents to include uncontrolled chemical reactions. This amendment became effective on 9 April 2004 when it was published in the Federal Register (FR). In April 2008, EPA began work on the RMP*eSUBMIT software, which replaced RMP*Submit. RMP*eSUBMIT was released on 13 March 2009. On that date, additional modifications to the RMP regulation became effective, including changes to the accidental release 5-year reco"
    }
  ]
}