{
  "FacilityID": 1000094045,
  "FacilityName": "Milner Terminal",
  "FacilityStr1": "1345 Old 41 Highway",
  "FacilityStr2": null,
  "FacilityCity": "Milner",
  "FacilityState": "GA",
  "FacilityZipCode": "30257",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13171",
  "LEPC": "Lamar County LEPC",
  "FacilityLatDecDegs": "33.151567",
  "FacilityLongDecDegs": "-084.207125",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Enterprise Products Operating LLC",
  "Company2Name": null,
  "CompanyDUNS": 62457304,
  "Company2DUNS": 62457304,
  "OperatorName": "Enterprise Propane Termnls & Storg",
  "OperatorStr1": "1275 U. S. Highway 11 North",
  "OperatorStr2": null,
  "OperatorCity": "Petal",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39465",
  "OperatorZipCodeExt": null,
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165625",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-06-24 00:00:00",
  "SafetyInspectionBy": "Bureau of Explosives",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-09-21 08:42:10",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-06-07 00:12:33",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-06-07 00:12:33",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-06-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.151366,
  "FRS_Long": -84.207421,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116732,
      "AltID": "Milner Terminal",
      "FacilityID": 1000094045,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146018,
          "ProcessID": 1000116732,
          "ChemicalID": 105,
          "Quantity": 11000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000146019,
          "ProcessID": 1000116732,
          "ChemicalID": 98,
          "Quantity": 920000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118146,
          "ProcessID": 1000116732,
          "NAICSCode": "42471",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094045,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lamar County Fire Department",
    "CoordinatingAgencyPhone": "7703585159",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094045,
      "SummaryText": "Environmental Protection Agency Risk Management Plan\r\nEnterprise Propane Terminals & Storage\r\nMilner Terminal\r\nRMP Executive Summary\r\nEPA ID: 1000 0016 5625\r\n\r\nAccidental Release Prevention and Response\r\n\r\nAt Enterprise, we are committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\r\n\r\n* A description of our facility and use of substances regulated by EPA's RMP regulation\r\n* An overview of our accidental release prevention programs\r\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\r\n* An overview of our emergency response program\r\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\n\r\nThe Milner Terminal is located north of Milner, Georgia in Lamar County.  The terminal engages in the pipeline receipt and storage of liquefied propane under pressure, and the loading of propane tank trucks. \r\n\r\nThe facility receives, stores and distributes LPG. The three propane storage tanks are administratively controlled to hold and not exceed 80% of their capacity.  The facility consists of pressure storage tanks, a truck loading dock, a propane dehydration system, an LPG odorization system and associated piping, valves and other miscellaneous equipment.  \r\n\r\nThe process is regulated by Federal OSHA 29 CFR 1910.119 and 40 CFR Part 68.  We have entered the facility as an RMP Program Level 1 facility.\r\n\r\nToxics\r\n\r\nThere are"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094045,
      "SummaryText": "no toxic materials contained on site above the threshold limits.\r\n\r\nFlammables\r\n\r\nPropane is a finished product which is received into the three storage tanks. This material is routed from these tanks to the loading docks for delivery into LPG tank trucks. Ethyl mercaptan, which is used to odorize the propane delivered to the tanker trucks, is also present above the threshold quantity.\r\n\r\nOffsite Consequence Analysis Results\r\n\r\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\r\n\r\nGeneral Accidental Release Prevention Program\r\n\r\nThe following is a summary of the accidental release prevention program in place at Milner Terminal.  The process at the facility is regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1).  Release prevention is provided through the use of written operating procedures, employee training in written procedures, including normal operation and emergency release procedures, and in the design of safety and release prevention equipment installed at the terminal site.  In addition, a written safety program designed to comply with all applicable OSHA safety performance regulations is strictly enforced at all Enterprise facilities, including the Milner Terminal facility.  As part of the Enterprise safety program, the facility utilizes procedures that are included in the Enterprise program, but may not specifically be required at non-PSM and/or RMP Program 1 facilities (e.g. Safe work practice training; safe work permitting and hot work permitting).\r\n\r\nUniversal Prevention Activities\r\n\r\nThe accident prevention program summarized previously is applied to all RMP covered processes at Milner Terminal.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094045,
      "SummaryText": "and human errors.\r\n\r\nSpecialized Safety Features\r\n\r\nThe Milner Terminal has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\r\n\r\nRelease Detection\r\n* Hydrocarbon (hazardous gas) detectors and alarms\r\n* Fire detectors on gas compression equipment\r\n* Plant video surveillance system\r\n\r\nRelease Containment and Control\r\n\r\n* Valves to permit isolation of the process (manual or automated).\r\n* Automatic shutdown systems for specific process parameters (e.g., high pressure).\r\n* Secondary containment (curbs and dikes) to contain any release of liquid chemicals\r\n* Redundant equipment and instrumentation where advisable\r\n* Atmospheric relief devices \r\n\r\nRelease Mitigation\r\n* Hand-held fire extinguishers\r\n* Personnel trained in emergency response and procedures.\r\n* Personnel protective equipment (e.g., chemical protective apron, hard hats, safety glasses, etc.)\r\n\r\nFive Year Accident History\r\n\r\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five years:\r\nThis facility has not had an accidental release in the last five years which meets the criteria set forth in 40 CFR 68.10, \r\n\r\nEmergency Procedures Information\r\n\r\nMilner Terminal maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.  \r\n\r\nThe emergency plan is coordinated w"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094045,
      "SummaryText": "ith the Lamar County Sheriff's Department Emergency Management District, which includes the local Police Department, Lamar County Sheriff's Department, Lamar County Fire Department, and Emergency Medical Service.\r\n\r\nIn the event of an accidental release, local Enterprise personnel are trained to sound the alarm, shut off the source from a safe location, contact 9-1-1 and secure the area.  The 9-1-1 system is used to notify the local Police and Fire Departments.\r\n\r\nPlanned Changes to Improve Safety\r\n\r\nThe Milner Terminal resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Milner Terminal.\r\n\r\n*Upgrades to the facility switchgear."
    }
  ]
}