{
  "FacilityID": 1000045730,
  "FacilityName": "Alta-Dena Certified Dairy, LLC - Buena Park",
  "FacilityStr1": "6400 Regio Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Buena Park",
  "FacilityState": "CA",
  "FacilityZipCode": "90620",
  "Facility4DigitZipExt": "1158",
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.867222",
  "FacilityLongDecDegs": "-118.017875",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Dean West II, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Alta-Dena Certified Daiiry, LLC",
  "OperatorStr1": "6400 Regio Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Buena Park",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90620",
  "OperatorZipCodeExt": "1158",
  "RMPContact": "Dan Decker",
  "RMPTitle": "Plant Manager",
  "FTE": 53,
  "OtherEPAFacilityID": "CAL000194882",
  "EPAFacilityID": "100000157894",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-05-20 00:00:00",
  "SafetyInspectionBy": "Orange County Health Care Agency - Environ. Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-07-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-08-23 00:00:00",
  "DeRegistrationEffectiveDate": "2016-08-02 00:00:00",
  "AnniversaryDate": "2019-07-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.8648,
  "FRS_Long": -118.011,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056767,
      "AltID": "Ammonia Refrigeration Sy.",
      "FacilityID": 1000045730,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000057708,
          "ProcessID": 1000056767,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000069363,
          "ProcessID": 1000056767,
          "ChemicalID": 56,
          "Quantity": 13138.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000569363,
          "ProcessID": 1000056767,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045730,
      "SummaryText": "DESCRIPTION OF FACILITY AND REGULATED SUBSTANCE HANDLED:\n\n\n\nDean Foods of California, LLC of Buena Park, CA produces ice cream and frozen desserts.  The facility utilizes anhydrous ammonia as refrigerant to freeze ice cream and to maintain the proper temperature of ice cream and frozen desserts within the facility.  Anhydrous ammonia is an effective and environmentally friendly refrigerant that has been used for many years by most food processing facilities.  The refrigerant would be a gas at ambient temperatures, but is handled as a gas liquefied under pressure in a closed loop refrigeration system.  The refrigeration system consists of a high-pressure receiver, recirculators, condensers, evaporators, compressors, piping, and valves.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:\n\n\n\nAs a part of its PMS Program, Dean Foods utilizes all the Elements of the PSM/RMP/CalARP requirements which are helpful in maintaining our system in very good condition and preventing accidental releases of ammonia.  These Elements included:\n\n\n\n     Process Safety Information\n\n     Process Hazard Analysis\n\n     Operation Procedures\n\n     Training\n\n     Mechanical Integrity\n\n     Management of Changd\n\n     Pre-Startup Review\n\n     Compliance Audits\n\n     Incident Investigations\n\n     Employee Participation\n\n     Hot Work Permits\n\n     Contractor Safety\n\n\n\nEMERGENCY RESPONSE INFORMATION:\n\n\n\nAs a part of the PSM Program, the facility maintains an Emergency Action Plan that was prepared in order to improve responsiveness to an emergency incident, and to increase the realibility of actions taken during an incident.  The plan includes all the requirements of an emergency action plan.\n\n\n\nIn the event of an emergency involving the refrigeration system, it is the policy of the facility to request assistance as necessary by calling 911, which will notify the California Region 1 LEPC.  In addition, the LEPC has included Dean Foods in its local emergency response p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045730,
      "SummaryText": "lanning.\n\n\n\nFIVE YEAR ACCIDSENT HISTORY:\n\n\n\nThe facility has had an excellent record of preventing accidental releases over the last 5 years.  Due in part to our stringent release prevention programs, there have been no accidental release during this period.\n\n\n\nSTEPS TO IMPROVE SAFETY:\n\n\n\nSince the last RMP submission, our facility has removed insulation from the intercooler and low temperature recirculator vessels, inspected the bare metal on the vessels, applied RG 2400 Reactive Gel to the metal surfaces and re-insulated the vessels.  The reactive gel is known as Bluegoo and is to stop or prevent corrosion under insulation.  Employee training and operating procedure reviews are emphad as part of continuous improvement goals at our facility.  The facility will continue to operate and maintain the refrigeration system in accordance with industry association standards and will continue operate under the PSM/RMP/CalARP Program requirements.\n\n\n\nEXTERNAL EVENTS ANALYSES:\n\n\n\nUnder CalARP program requirements, applicable external events are considered within the hazard review.  Hazard reviews are encompassed within a complete Process Safety Management program, which is reviewed and updated every five years.  Such events included, but were not limited to; seismic activity & sabotage with the effect on safety of the facility and the surroundings being considered.\n\n\n\nSABOTAGE\n\n\n\nThe Dean Foods facility installed a surveillance system.  The facility has restricted access within the production facility.  A key code entry is required to gain access to the production facility and refrigeration room.  For these reasons, the likelihood of a chemical accident was considered remote.\n\n\n\nSEISMIC ACTIVITY\n\n\n\nThe potential for earthquakes, and the possible effect on the facility were taken into account.  The existing seismic restraints incorporated into the facility/equipment design were also considered.  In the event of a loss of pressure in the refrigeration system due to a system bre"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045730,
      "SummaryText": "ach, the system would be automatically shut down via pressure sensing controls and/or ammonia sensors.\n\n\n\nFIRE / EXPLOSION\n\n\n\nAn emergency ventilation system is in place which would operate automatically to maintain the concentration of ammonia in the Engine Room at no more than 25% of the  lower explosive level.  Obviously, the possibility of an explosion and/or fire related to the facility refrigeration system was considered, although the occurrence would be very remote.  In such an event, the refrigeration (ignition) source would be removed by shutting down the feed valves and appropriate safety measures would be taken by operation personnel.  If a fire is of an electrical nature, power to the affected area would be shut down via circuit breakers.\n\n\n\nWEATHER\n\n\n\nVarious weather conditions, and their possible effect on the facilities refrigeration system were also studied, and considered to be remote."
    }
  ]
}