{
  "FacilityID": 1000047898,
  "FacilityName": "Fabriclean Supply of Arkansas Limited",
  "FacilityStr1": "6600 Allied Way",
  "FacilityStr2": null,
  "FacilityCity": "Little Rock",
  "FacilityState": "AR",
  "FacilityZipCode": "72209",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05119",
  "LEPC": "Pulaski County LEPC",
  "FacilityLatDecDegs": "34.687778",
  "FacilityLongDecDegs": "-092.299722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Fabriclean Supply, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Jim Hericks",
  "OperatorStr1": "502 2nd Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75226",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000126259",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-05-22 00:00:00",
  "SafetyInspectionBy": "Environmental Services Group, Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-12-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-12-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-12-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-12-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.68843,
  "FRS_Long": -92.299,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059811,
      "AltID": "Chemical And Supply Distr",
      "FacilityID": 1000047898,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000073219,
          "ProcessID": 1000059811,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000060913,
          "ProcessID": 1000059811,
          "NAICSCode": "42469",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000038070,
              "Process_NAICS_ID": 1000060913,
              "SafetyReviewDate": "2014-05-22 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 1,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2014-05-22 00:00:00",
              "ChangeCompletionDate": "2014-07-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": "Cylinder rupture or valve stem damage from human error or accident.",
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Valve stem protective covers and chains to secure stored cylinders",
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Shop Fans",
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Draeger tubes for chlorine detection and exposure level.",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-05-22 00:00:00",
              "TrainingReviewDate": "2014-05-22 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Y",
              "MaintenanceReviewDate": "2014-05-22 00:00:00",
              "EquipmentInspectionDate": "2014-05-22 00:00:00",
              "EquipmentTested": "Cylinder dolleys, chains",
              "ComplianceAuditDate": "2014-05-22 00:00:00",
              "AuditCompletionDate": "2014-07-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "PREVENTION PROGRAM DATA\n\nFABRICLEAN SUPPLY OF ARKANSAS, LIMITED (FSA)is chemical and allied products wholesale facility.  This facility falls under the NAICS code 42469. Our safety information was last reviewed and updated May 27, 2010.  All applicable OSHA standards have been implemented here through written manuals by Environmental Services Group, Inc.  There has been a recent hazard review and update conducted for this facility uses safe storage and handling practices.  Due to the type and quantity of hazardous materials handled at this facility and large number of offsite receptors, this facility incorporates a mitigation system. The system includes written handling and storage procedures, and a sprinkler system to prevent releases due to fire over-pressurization.  Operating and training procedures were also reviewed and revised in May of 2010.  The employees of FABRICLEAN SUPPLY OF ARKANSAS, LIMTED are trained in the classroom and by on-the-job training.  This training is completed with competency tests including oral tests, demonstration, and observation.  Last training was completed on May 27, 2010.  The Safe Operating procedures are reviewed by operators on a regular basis to ensure proper chlorine handling and storage.  Maintenance is not performed on the cylinders at FSA because they are delivered and returned to the vendor.  The last time operating procedures were reviewed and written out was in May 27, 2010.  Updated MSDS are kept on site in the Warehouse Managers office and as a part of the RMP Manual.  There have been no incident investigations the past five years.  The last compliance audit for FSA's RMP was performed in May 27, 2010, with another on due May of 2011.  FABRICLEAN SUPPLY OF ARKANSAS, LIMITED contracted Environmental Services Group, Inc., which triggered a review of our safety information, operating and maintenance procedures, and training.\n\nFABRICLEAN SUPPLY OF ARKANSAS, LIMITED is a level 2 Prevention Program facility.  The following pages are the Prevention Program Elements to comply with the Risk Management Plan requirements under EPA regulations.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000038596,
                  "PreventionProgram2ID": 1000038070,
                  "ProcessChemicalID": 1000073219
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000047898,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-05-07 00:00:00",
    "ERTrainingDate": "2014-05-22 00:00:00",
    "CoordinatingAgencyName": "Little Rock Fire Department",
    "CoordinatingAgencyPhone": "5019183710",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047898,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nIn this chemical and other allied wholesale facility, we handle chlorine which is considered hazardous by EPA.  The same properties that make chlorine valuable as a retail/wholesale chemical also make it necessary to observe certain safety precautions while handling. Overall, the prevention of unnecessary human exposure, reducing the threat to our own personal health as well as our co-worker's, and reducing the threat to nearby members of the community is the main goal of incorporating this risk management plan into our daily operations.  It is our policy to adhere to all applicable federal and state rules and regulations. Safety depends upon the manner in which we handle chlorine, combined with the safety storage devices inherent in the design of this facility, with the safe handling procedures that we utilize, and the training of our personnel.\n\n\n\nOur emergency response (action) program was developed with the assistance of Environmental Services Group, Inc.  The emergency response plan includes procedures for notification of trained HazMat Personnel from the Little Rock Fire Department to respond to a release of chlorine.  This facility has no employees who are trained to respond.  If Hazmat response is required, the Little Rock Fire Department to respond to a release of chlorine.  This facility has no employees who are trained to respond.  If Hazmat response is required, the Little Rock Fire department will be contacted.  Fabriclean Supply of Arkansas (FSA) will then notify 911 for notification to Pulaski County LEPC and other agencies.\n\n\n\nThe primary purpose of this facility is to receive and distribute pre-packaged chlorine to customers. Chlorine is received in 150 pound cylinders at the 6600 Allied Way location and stored in the warehouse until sold and distributed.  The chlorine is stored in the warehouse area in designated areas.  The area is a well-ventilated concrete floor.  Maximum quantity on hand will not exceed 30,000 pounds.  Acce"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047898,
      "SummaryText": "ss to the site is restricted to authorized facility employees, authorized management personnel, and authorized contractors.\n\n\n\nThe regulated substance stored at the 6600 Allied Way location is chlorine.  The maximum amount of chlorine that can be stored in the warehouse is 30,000 pounds.\n\n\n\nThe worst-case scenario is failure of the largest storage tank. When filled to the greatest amount allowed, it would release 150 pounds of chlorine from the 6600 Allied Way location. Passive mitigation has been considered for this scenario.  The chlorine cylinders are located in the warehouse building, which is constructed of a concrete floor and concrete walls. The receiving dock and bay door are open to the air when the door is open.  It is assumed that the entire content of the 150 lb. cylinder is released as a toxic vapor. The distance to the endpoint of 0.0087 mg/l for the worst-case scenario is 0.4 miles.  This location is classified as urban due to the dense concentration of buildings and people.\n\n\n\nAn alternative scenario was determined for this facility; however based on the type of prevention system in place and the no-use chlorine. The potential for an alternative release from a 150 lb. cylinder should be minimal for the 6600 Allied Way site.  Since chlorine is not actually used in a process, rather it is only stored, there should not be a release from a chlorine cylinder.  All cylinders are repackaged and inspected by the supplier prior to arrival at FSA.  The alternative release scenario from a 150 lb. cylinder for the 6600 Allied Way site would possibly occur because of an improperly sealed packaging nut at the valve.   An estimation of the release would be approximately 5 pounds of toxic vapor being released into the atmosphere.  The amount of toxic vapor released from the chlorine leak would result in an estimated distance to toxic endpoint of approximately 0.1 miles.\n\n\n\nThis chemical distributing facility complies with EPA's Accidental Release Prevention Rule and"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047898,
      "SummaryText": " with all applicable state codes and regulations.\n\n\n\nFSA has had had no accidental releases of chlorine in the last five years.  The chlorine is received, stored, and loaded with trained personnel; the likelihood of a release of chlorine from the cylinders is minimal.\n\n\n\nOur emergency response (action) program was developed with the assistance of Environmental Service Group, Inc..  We have discussed this program with the Pulaski County LEPC and the Little Rock Fire Department. A representative of Environmental Service Group, Inc. visited this plant May 22, 2014, to review and update the training and safety programs at this facility."
    }
  ]
}