{
  "FacilityID": 1000078294,
  "FacilityName": "MTC Logistics, Inc.",
  "FacilityStr1": "4851 Holabird Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21224",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24510",
  "LEPC": "Baltimore City LEPC",
  "FacilityLatDecDegs": "39.269452",
  "FacilityLongDecDegs": "-76.553558",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "MTC LOgistics, INC.",
  "OperatorStr1": "4851 Holabird Ave",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21224",
  "OperatorZipCodeExt": null,
  "RMPContact": "Curt Edmisten",
  "RMPTitle": "Director of Engineering",
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000207581",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-23 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-25 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000097547,
      "AltID": "Refrigeration System",
      "FacilityID": 1000078294,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000098798,
          "ProcessID": 1000097547,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000122101,
          "ProcessID": 1000097547,
          "ChemicalID": 56,
          "Quantity": 32173.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000622101,
          "ProcessID": 1000097547,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000078294,
      "SummaryText": "INTRODUCTION\n\nIn response to the city of Baltimore, the Occupational Safety and\n\nHealth Administration (OSHA), and the Environmental Protection Agency (EPA), this Process Safety\n\nManagement/Risk Management Program (PSM/RMP) document has been developed for the Merchants\n\nTerminal facility located at: 4851 Holabird Ave., Baltimore, MD 21224. This document has been\n\nprepared to satisfy multiple regulations and is governed by the following agencies:\n\n1. OSHA's Code of Regulations, OSHA 29 CFR 1910.119, Process Safety Management of Highly\n\nHazardous Chemicals (PSM)\n\n2. Federal EPA's, Code of Federal Regulations, Title 40, Part 68, Accidental Release Prevention\n\nRequirements: Risk Management Programs Under Clean Air Act Section 112(r), Program 3\n\nRequirements (RMP)\n\nThe purpose of this document is to:\n\n1. Increase the protection of public health, the environment, and facility employees by ensuring\n\nproper emergency response and mitigation procedures when handling regulated substances.\n\n2. Assist Merchants Terminal and local government agencies in their communication and\n\ncoordination efforts to improve facility safety while handling regulated substances.\n\nThis document addresses Merchants Terminal administrative and operational programs to prevent\n\naccidents related to regulated substances and to reduce potential risks. The regulated substance of\n\nconcern and focus of this document is anhydrous ammonia. Ammonia is used to provide refrigeration\n\nfor warehouse cold storage and dock operations.\n\nThis Executive Summary contains tables outlining the PSM/RMP sections. It includes the purpose,\n\nfrequency of use, responsibilities and requirements, and forms for each section of the PSM/RMP\n\nprogram.\n\n\n\nFACILITY DESCRIPTION\n\nMerchants Terminal operates a refrigeration system utilizing anhydrous ammonia as the primary\n\nrefrigerant. The refrigeration system is located in the main building.\n\nMechanical refrigeration is a thermodynamic process where the refrigerant, ammonia, is used as"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000078294,
      "SummaryText": " a heat\n\nexchanging fluid to maintain a desired temperature in an enclosed environment. The refrigeration cycle\n\nconsists of evaporation, compression, condensation, and expansion. Evaporation and condensation are\n\ndesigned to alter the quantity of energy associated with refrigerant. Compression and expansion are\n\ndesigned to change the availability of the associated energy. The refrigeration cycle is a closed-loop\n\nprocess. The ammonia refrigeration cycle utilizes fluid temperature, pressure, and latent heat of\n\nvaporization for cooling. The refrigeration system utilizes these phenomenons to remove heat from a\n\ndesired area, and then to discard that heat, through condensation, to an area where it is of no\n\nconsequence.\n\nThe Merchants Terminal facility utilizes ammonia refrigeration to cool various storage areas. The\n\nrefrigeration system contains the following equipment: nine screw compressors, three evaporative\n\ncondensers, one -43?F recirculator with pumps, one -25?F recirculator with pumps, one high pressure\n\nreceiver, one thermosyphon receiver, six blast cells evaporators, four minus -20?F penthouse evaporators,\n\neighteen -10?F penthouse evaporators, two cooler penthouse evaporators, and eight dock evaporators.\n\n\n\nEMPLOYEE PARTICIPATION\n\nEvery section of the RMP/PSM program must allow for employee participation in its development and\n\nimplementation. The plan allowing for this participation must be documented. Employees and their\n\nrepresentatives must have access to all information that is developed, for the Process Safety\n\nManagement program without regard to possible trade secret status of such information.\n\nFrequency of Use Responsible Party Requirements\n\nAll employees especially those new to the facility or transferred from another department\n\n\n\nDirector of Engineering or Designee\n\nNotifying all employees of the use of ammonia at the facility. \n\nProvide information and hazards related to ammonia to employees.\n\nAnnually\n\n\n\nDirector of Engineering or Designee\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000078294,
      "SummaryText": "\nInformation on the most likely accident scenarios and consequences of ammonia releases.\n\nRelated Form: PSM/RMP COMMITTEE REVIEW FORM\n\nThis form can be found in the Employee Participation Section of this manual.\n\n\n\nPROCESS SAFETY INFORMATION\n\nComplete and accurate written information concerning process chemicals, process technology, and\n\nprocess equipment is essential to an effective RMP/PSM program and to other aspects such as the\n\nProcess Hazard Analysis (PHA). The information to be compiled about the chemicals needs to be\n\ncomprehensive enough for an accurate assessment of the fire and explosion characteristics, reactivity\n\nhazards, the health and safety hazards to workers, and the corrosion effects on process equipment as well\n\nas monitoring and safety related equipment. MSDS information can provide a portion of the required\n\ndata but other information will be required.\n\nProcess technology information is also required. This includes information on the amount of hazardous\n\nmaterial stored and used at the facility as well as operating limits for the process. Diagrams of the\n\nsystem and information on all of the equipment utilized in the system are required. Piping and\n\ninstrumentation diagrams (P&IDs) are required in the Process Hazard Analysis and are included in the\n\nProcess Safety Information.\n\n\n\nFrequency of Use Responsible Party Requirements\n\nUpdate if a change is made and train operators at least every three years\n\nDirector of Engineering or Designee\n\nMake available to all employees who work on or near the equipment of the ammonia process.\n\nRelated Form: NOT APPLICABLE\n\n\n\nPROCESS HAZARD ANALYSIS\n\nThe Process Hazard Analysis (PHA) is the basis for many of the decisions and procedures associated\n\nwith an effective PSM/RMP program. It is a systematic effort to determine the potential hazards\n\nassociated with the process and to evaluate mitigation alternatives including equipment modifications,\n\nprocedural modifications, training, and administrative controls. An"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000078294,
      "SummaryText": " effective PHA considers and\n\nanalyzes the potential consequences associated with a release of the hazardous materials including fires,\n\nexplosions, and exposure of people to toxic materials. It focuses on equipment, instrumentation,\n\nutilities, human actions, and external events.\n\nTo ensure that both operator safety as well as off-site safety is addressed, the A?What-IfA? Checklist\n\nanalysis was conducted during the PHA session. Human factors such as lighting, accessibility, and\n\noverall working conditions were incorporated in the analysis.\n\n\n\nFrequency of Use Responsible Party Requirements\n\nReview and update hazard assessments or process hazard analysis at least every five years or\n\nas the result of a change.\n\nDirector of Engineering or Designee\n\nMake available to all employees who work on or near the equipment of the ammonia process.\n\nIf no changes have occurred since initial PHA, include a statement to this fact in the document.\n\nRelated Form: NOT APPLICABLE\n\n\n\nOPERATING PROCEDURES\n\nOperating procedures describe all employee tasks, data to be recorded, operating conditions to be\n\nmaintained, and safety and health precautions to be utilized in operation of the process containing\n\nregulated substances. The procedures need to be technically accurate and will result in safe operation of\n\nthe facility. In addition, they need to be understandable to the employees and/or contractors. The\n\nprocedures must be updated as changes are made to the facility or to the operating limits of the system.\n\nThe regulations require that the employer annually certify that the operating procedures are current and\n\naccurate.\n\nAll phases of system operation must be covered by written procedures. Specifically, procedures must be\n\navailable for:\n\n1. Initial startup\n\n2. Normal operation\n\n3. Temporary operations as the need arises\n\n4. Emergency shutdown\n\n5. Normal shutdown\n\n6. Emergency Operations\n\n7. Startup following a turnaround, or after an emergency shutdown\n\nThe procedures contain proce"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000078294,
      "SummaryText": "ss operation limits and provide information of the consequences of\n\ndeviation from these limits and the steps required to correct any deviations. Safety and health measures\n\nare included in the procedures to warn employees of potential risks and protective action that should be\n\ntaken.\n\nFrequency of Use Responsible Party Requirements\n\nAs often as necessary. Director of Engineering or Designee\n\nOperating Procedures reviewed to reflect any changes in the facility\n\nAnnually Director of Engineering or Designee\n\nOperating Procedure Review where each procedure is reviewed and\n\ndecided to be either:\n\n1. Current\n\n2. Still used, but needs updating\n\n3. No longer needed.\n\nResults are documented on the SOP REVIEW SUMMARY & CERTIFICATION form.\n\nRelated form: SOP REVIEW SUMMARY & CERTIFICATION\n\nThis form can be found in the SOP section of this manual.\n\n\n\nEMPLOYEE TRAINING\n\nAll employees, including maintenance and contractor employees involved with regulated substances (i.e.\n\nammonia) need to fully understand the health and safety hazards associated with the chemical with\n\nwhich they are working. This will allow them to better protect themselves, fellow employees, and the\n\nneighboring communities. In addition to the normal awareness training, which informs personnel of the\n\nhazards of the chemical and the safety precautions to use, training in operating procedures and practices,\n\nemergency response, and other required management controls are required.\n\nEmployees must identify the personnel who require training, develop a training protocol with procedures\n\nand objectives, and maintain a record of personnel training. Regular evaluation of the training program\n\nmust be accomplished to ensure that it is appropriate information to the employees in a useful and\n\nunderstandable way.\n\nIf outside employees (maintenance or contract) are performing work which might impact the ammonia\n\nrefrigeration system, the Director of Engineering or his Designee has an obligation to assure that they\n\nhav"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000078294,
      "SummaryText": "e been properly trained by their employer and have been informed of any hazardous conditions and\n\nthe proper procedures to be utilized at the facility.\n\nFrequency of Use Responsible Party Requirements\n\nInitial training for new employees.\n\nDirector of Engineering or Designee\n\n1. Generalized training during orientation period and specific training\n\nonce assigned to a department.\n\n2. Specialized training includes.\n\n            a. Labeling of all ammonia materials uses and references to the Material Safety Data Sheets (MSDS).\n\n            b. Providing ammonia information consisting of the Process Safety Information, Process Hazards Analysis and the Employee Training sections of this manual.\n\n3. Employees sign a certification page that lists those requirements covered under the Employee Training section of this manual.\n\nRefresher training/ Annually for all employees\n\nDirector of Engineering or Designee\n\n1. Periodic training on unchanged procedures and policies:\n\n     a. Competencies in handling regulated substance\n\n     b. Items covered in classroom & on-the-job training\n\n     c. Review of accidents and near misses associated with the use of ammonia\n\n2. Training on the information, procedures and/or policies that have changed, including new process or a process equipment.\n\n3. Hazard Communication Training, providing routine and non-routine training to department and workstation level employees.\n\nRelated Forms and Documents: Merchants Terminal TRAINING CERTIFICATION FORM (INITIAL TRAINING AND EMPLOYEE VERIFICATION), Industry A?Ammonia Refrigeration Training GuidelineA?\n\nThese forms and documents can be found in the Employee Training Section of this PSM/RMP.\n\n\n\nCONTRACTOR SAFETY\n\nAny use of outside contractors who work in and around the ammonia refrigeration system requires that\n\ntheses contractors have accomplished the training, utilize proficient personnel, and have been informed\n\nof the necessary health and safety aspects of working in the area. The goal is to assure th"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000078294,
      "SummaryText": "at contractor\n\nemployees perform work in a safe manner and do not endanger themselves, other employees, or the\n\nfacility. A plan for screening potential contractors to ensure satisfactory performance is required.\n\nFrequency of Use Responsible Party Requirements\n\nIn the event of hiring an outside contractor.\n\nDirector of Engineering or Designee\n\nEvaluation of contractor's safety program, safety performance and programs prior to allowing them work at the facility\n\nInform contractor of potential fire and hazards related to the work and requiring contractor's signature on selected\n\nforms before performing work. Depending on the event, these forms can include: OUTSIDE CONTRACTOR HAZARD COMMUNICATION FORM, \n\nOUTSIDE CONTRACTOR LOCKOUT- TAGOUT FORM, AMMONIA EMERGENCY PLAN INFORMATION RECEIPT, AND CONTRACTOR EMPLOYEE INJURY/ILLNESS LOG. \n\nAn explanation of Merchants ammonia emergency plan and safe work practices before contractor's admittance into the facility.\n\nMeetings following specific work (for a one-time effort) or annually (for ongoing programs such as ammonia system maintenance).\n\nDirector of Engineering or Designee\n\nEvaluate performance of contract employees in meeting\n\ntheir responsibilities, assuring that their safety-training\n\nprogram is equivalent to the facilities program.\n\nDeficiencies are immediately corrected.\n\nOn-going process Director of Engineering or Designee\n\nA log of contract employees' injuries and illnesses related to contractor's work remain available to all employees and/or contractors.\n\nOn going process/as necessary Contractor Instruct contractor employees of potential fire and hazards.\n\nDocuments that employees receive training. Assures that employee follows Merchants Terminal Services safety rules. \n\nAdvises Director of Engineering of any unique hazards presented.\n\nRelated Form: OUTSIDE CONTRACTOR HAZARD COMMUNICATION FORM, OUTSIDE CONTRACTOR LOCK OUT-TAG OUT FORM, CONTRACTOR SAFETY FORM, \n\nAMMONIA EMERGENCY PLAN INFORMATION RECEIPT, CONTRACTOR"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000078294,
      "SummaryText": " EVALUATION, Merchants Terminal CONTRACTOR TRAINING CERTIFICATION\n\nThese forms can be found within the Contractor Safety Section of this manual.\n\n\n\nPRE-STARTUP SAFETY REVIEW\n\nFor a new design or the addition of significant changes to the process, a Pre-Startup Safety Review\n\n(PSSR) must be employed to determine that the changes are not themselves deficient or that the addition\n\nof the new portions of the system will adversely affect the original system. Management procedures\n\nmust be developed to ensure that a satisfactory hazard analysis has been completed before the system is\n\nstarted. The records from this Pre-Startup Safety Review must be kept on file.\n\nFrequency of Use Responsible Party Requirements\n\nFor all modifications that result in a change to the process safety information, the construction of a new facility, \n\nand/or for a prolonged shutdown of the process.\n\nDirector of Engineering or Designee\n\nProcess safety information is compiled a process hazard analysis performed; recommendations from the hazard analysis resolved; \n\nsafety, operating, maintenance, and emergency procedures are written, implemented and adequate; construction and equipment is \n\nin accordance with design specification, and training for each employee involved in the process is completed\n\nA PRE-STARTUP SAFETY REVIEW VERIFICATION form is signed when the above is documented.\n\nRelated Form: PRE-STARTUP SAFETY REVIEW VERIFICATION, PRE-STARTUP SAFETY REVIEW CHECKLIST\n\nThese forms can be found within the Pre-Startup Safety Review Section of this manual.\n\n\n\nMECHANICAL INTEGRITY\n\nA formal maintenance program will be in place for all systems using regulated substances (i.e.\n\nammonia). This program will consist of routine (scheduled) inspection, testing, overhaul, and\n\nreplacement as needed. Equipment must be categorized and ranked with respect to the maintenance\n\ninvolved. This maintenance and inspection information will include all equipment such as storage tanks,\n\ncompressors, condensers, evapor"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000078294,
      "SummaryText": "ators, process piping relief and vent systems, fire protection system\n\ncomponents, emergency shutdown systems, and alarms. Each component must be placed into a category\n\nthat indicates how maintenance and inspection will be performed on that class of components.\n\nFrequency of Use Responsible Party Requirements\n\nDaily Merchants Terminal Maintenance personnel\n\nFollow and complete the Daily Log Sheet- Engine Room\n\nWeekly Merchants Terminal Maintenance personnel\n\nFollow and complete the Merchants Terminal Weekly Ammonia Inspection Checklist\n\nMonthly Maintenance Contractor \n\nFollow and complete the Merchants Terminal Monthly Ammonia Inspection Checklist\n\nQuarterly Maintenance Contractor \n\nFollow and complete the Merchants Terminal Quarterly Ammonia Inspection Checklist\n\nSemi-Annually Maintenance Contractor \n\nFollow and complete the Merchants Terminal Semi-Annual Ammonia Inspection Checklist\n\nAnnually Maintenance Contractor \n\nFollow and complete the Merchants Terminal Annual Ammonia Inspection Checklist\n\nFive Year 3rd Party Inspector \n\nFollow and complete the Merchants Terminal Five-Year Ammonia Inspection Checklist\n\nAs Necessary Director of Engineering or Designee\n\nIf potentially faulty or unsafe equipment is observed by any employee, it is to be documented using the FAULTY OR UNSAFE\n\nEQUIPMENT REPORT form. Management will respond to the observation in a written and timely manner and see to the correction\n\nbefore the next use.\n\nRelated forms: Roundsheets and Inspection Forms\n\nThese forms can be found within the Mechanical Integrity Section of this manual.\n\n\n\nHOT WORK PERMIT\n\nA management control program must be employed that recognizes extra care is required for non-routine\n\nwork practices. This program will advise the personnel that significant potential hazards exist and that\n\nextra care should be taken in certain circumstances. This will ensure that employees, contractors, and\n\ncompany property are protected against fire, explosion, and other dangers resulting from ho"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000078294,
      "SummaryText": "t work.\n\nFormal procedures should exist for these programs and paperwork associated with ongoing work should\n\nbe kept for documentation.\n\nFrequency of Use Responsible Party Requirements\n\nIssued before beginning hot work. Requested by any facility employee or outside contractor.\n\nInitiating a hot work permit the day that the hot work is to be performed.\n\nDirector of Engineering or a Chief Engineer\n\nIssuing a hot work permit before hot work is started. List of precautions is reviewed with cutter/welder and the\n\nfirewatcher. Hot work permit is signed by appropriate parties. Sections 1 & 2 completed by Director of\n\nEngineering (or designated representative).\n\nDirector of Engineering or a Chief Engineer\n\nPerforming hot work includes making the permit visible where hot work is being performed. Firewatcher looks for\n\nfire hazards. \n\nDirector of Engineering (or designated representative) inspects work area during operation.\n\nPermit is kept on file for at least 30 days after all work is completed.\n\nDirector of Engineering or a Chief Engineer\n\nCompletion of hot work permit includes: inspecting area for 30 minutes after hot work performed: permit signed and\n\nreturned to Director of Engineering or a Chief Engineer who also inspects area and signs Section 3 of the hot work permit.\n\nCopies sent to the Facilities Manager and the contractor, if appropriate.\n\nRelated Form: HOT WORK PERMIT\n\nThis form can be found within the Hot Work Permit Section of this manual.\n\n\n\nMANAGEMENT OF CHANGE\n\nOther than A?replacement in kind,A? any change to the system must be documented. In particular, the\n\nchange of any equipment, control system, or procedure must be evaluated to determine that it will not\n\nhave an adverse effect on the safety aspects of the system. In addition, procedures must be revised to\n\nreflect the changes in the system.\n\nFrequency of Use Responsible Party Requirements\n\nWhenever there is a design change regarding the ammonia system.\n\nDirector of Engineering or Assistant Director o"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000078294,
      "SummaryText": "f Engineering or Chief Engineer\n\nA change includes: Modifications to the process Piping modifications Instrumental changes that result in the a\n\nchange to the system piping Procedural modifications Safety and health equipment Change to a \"controlled\" document\n\nBuilding modifications including destruction or removal of equipment from service \n\nInitiator of a proposed change will prepare the Management of Change Record form and submit it to the responsible\n\nparty. A control number to this form is entered into the facility's\n\nManagement of Change Record Log form. If the work is a \"replacement in kind\" the record is signed off and filed, \n\notherwise, the responsible party will coordinate the progress including the technical, safety, training, and\n\ndocumentation requirements.\n\nEmergency Basis- A management of change record must be initiated within 72 hours.\n\nMaintenance Contractor Procedural change made on an emergency basis to improve safety of an operation.\n\nRelated Forms: Merchants Terminal MANAGEMENT OF CHANGE RECORD (MCR), MANAGEMENT OF CHANGE RECORD (MCR) LOG,\n\nSAFETY REVIEW CHECKLIST\n\nThese forms can be found within the Management of Change Section of this manual.\n\n\n\nINCIDENT INVESTIGATION\n\nIncident investigation is the process of identifying the underlying causes of incidents and implementing\n\nsteps to prevent similar events from occurring. It is expected that employees will recognize and\n\ninvestigate events that resulted in or could reasonably have resulted in a hazardous chemical release.\n\nEmployees must develop in-house capability to investigate incidents that occur in their facilities. A team\n\nshould be assembled by Merchants Terminal and trained to collect and document information related to\n\nany incident. Usually a multi-disciplinary team is better able to gather the facts and evaluate A?what\n\nhappened and why.A? All employees with information should be interviewed and other facts should be\n\ngathered to develop a complete picture of the facts concerning the"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000078294,
      "SummaryText": " incident. Recommendations are then\n\ndeveloped for changes in equipment, procedures, or safety systems to prevent recurrence of the event.\n\nFrequency of Use Responsible Party Requirements\n\nA release or near release event. Director of Engineering or Assistant Director of Engineering\n\nASAP, but no later than 48 hours after an incident. A committee is assembled to determine the facts and the cause\n\nof the incident and recommend corrective preventative actions. Information will be retained in the administrative\n\noffice and documentation is completed on the INCIDENT INVESTIGATION REPORT. Employees of Merchants Terminal will \n\nreview the documentation once complete. The data will be retained for 5 years following implementation of the recommendations.\n\nRelated Forms: AMMONIA INCIDENT INVESTIGATION REPORT (INCIDENT SUMMARY: APPROVALS, FOLLOW-UP AND REVIEWS: REFRENCE NO. LOG)\n\nThis form can be found within the Incident Investigation Section of this manual.\n\n\n\nEMERGENCY PLANNING AND RESPONSE\n\nEmergency plans are required in case there is a release of ammonia (or other emergency such as fire or\n\nearthquake). Employers must select a formal plan on how to handle an emergency situation and a plan\n\nto educate employees as to what they should do. This plan must be detailed and include procedures for\n\nnotifying local authorities and following up with written accident reports, should the release meet or\n\nexceed the reportable quantity (100 pounds of ammonia). Many local site factors will be included in the\n\nammonia emergency and fire prevention plan. Merchants Terminal has a stated policy of responding to\n\nall leaks to determine the proper response. Merchants Terminal will respond to and mitigate all leaks\n\nwithin the limits of training and with the proper use of PPE.\n\nFrequency of Use Responsible Party Requirements\n\nIn the case of a significant release of a hazardous material.\n\nDirector of Engineering or Assistant Director of Engineering\n\nDetermines extent of release or designates "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000078294,
      "SummaryText": "someone to do so. Decides which personnel should be evacuated \n\nto the designated assembly areas. Immediately notifies all of the appropriate agencies. Is informed of \n\nany fire or ammonia emergencies and has the ultimate responsibility of facility personnel or contractors. \n\nResponsible for completing the HAZARDOUS MATERIALS INCIDENT REPORT.\n\nChief Engineer Performs the same responsibilities, as above if Incident Commander (IC) is not available.\n\nEach Manager Performs roll call for the personnel in their department and reports to the IC. Brings first aid\n\nkits to assembly area if applicable.\n\nAmmonia Emergency and Fire Prevention Plan is reviewed:\n\n1. Initially when the plan is developed\n\n2. At the time of hire, for each new employee\n\n3. When employee's responsibilities change\n\n4. Whenever the plan changes\n\nRefresher training is conducted at least annually\n\nChief Engineer or Assistant Chief Engineer Responsible for ensuring Emergency training for all employees, \n\nsuch as First Aid and Emergency Evacuation Training for operators and those associated with hazardous materials \n\nalso receive Hazard Communication and HAZWOPER Training. Solicit input from all employees during a 2 week period \n\nfollowing completion of each drill to correct any deficiencies found.\n\nRelated Forms: HAZARDOUS MATERIALS INCIDENT REPORT, CERIFICATION FOR AMMONIA EMERGENCY PLAN\n\nThese forms can be found within the Emergency Planning and Response Section of this manual.\n\nNotification of releases must be made to administrative agencies that include:\n\nNational Response Center\n\n2100 Second Street S.W.\n\nWashington, D.C.\n\n1-800-424-8802\n\nMaryland Emergency Response Division 1-866-633-4686\n\nOrganizations to be contacted immediately in the event of an emergency include the following:\n\n1. First, call 911 on an internal landline phone for the Fire Department, Police\n\nDepartment, Emergency Medical Services, and the Hazmat Team.\n\n2. Call the Maryland Emergency Response Division 1-866-633-4686\n\n3. Call Balti"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000078294,
      "SummaryText": "more City LEPC at 410-396-6188\n\n4. If additional help is required for an ammonia spill, the facility can call Chemtrec-\n\nManufacturing Chemists Association 1-800-424-9300.\n\n5. If an ammonia release may meet or exceed 100 pounds in a 24-hour period (Federal\n\nReportable Quantity CERCLA), immediately call the National Response Center 1-\n\n800-424-8802.\n\n6. If an employee ingests ammonia, the Poison Control Center can be reached 24 hours per\n\nday at 1-800-222-1222.\n\nCOMPLIANCE SAFETY AUDITS\n\nAn effective audit program is required to determine that facility personnel and contractors are following\n\nthe procedures and intents of the overall PSM requirements. Periodic reviews of all areas of the\n\nmanagement programs are required to verify compliance. OSHA has published compliance guidelines\n\nfor their compliance personnel. These guidelines make a good basis for developing an internal audit\n\nprogram. Corrective actions related to the audit will need to be documented and kept on record to show\n\nhow the audit is improving the overall performance of the risk management programs in place at the\n\nfacility.\n\nFrequency of Use Responsible Party Requirements\n\nEvery 3 years. Director of Engineering or Assistant Director of Engineering\n\nIncludes verification that procedures developed to comply with the risk management regulations are adequate and are\n\nbeing followed. The Compliance Audit form is used for this procedure. A written report of the findings of the audit is\n\ndeveloped and an appropriate response to each of the findings. Documentation showing that deficiencies have been corrected.\n\nAs necessary Merchants Terminal \n\nThe two most recent audit reports shall be retained by the employer and made available to employees.\n\nRelated Forms: COMPLIANCE AUDIT FORMS\n\nThese forms can be found within the compliance Audit Section of this manual.\n\n\n\nTRADE SECRETS\n\nNo documents currently contained in the PSM files contain trade secret information.\n\nRISK MANAGEMENT PLANNING\n\nREGULATORY COMPLIANCE"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000078294,
      "SummaryText": " MATRIX\n\nSubject OSHA, 29CFR 1910.119 (PSM) EPA 40 CFR Part 68, Program 3 (RMP)\n\nExecutive Summary Not Applicable Subpart G, 68.155\n\nProgram Registration Not Applicable Subpart G, 68.160\n\nEmployee Participation (c) Subpart D, 68.83\n\nOperating Procedures (f) Subpart D, 68.69\n\nTraining (g) Subpart D, 68.71\n\nMechanical Integrity (j) Subpart D, 68.73\n\nManagement of Change (l) Subpart D, 68.75\n\nPre-Startup Safety Review (i) Subpart D, 68.77\n\nCompliance Audits (o) Subpart D, 68.79\n\nIncident Investigation (m) Subpart D, 68.81\n\nHot Work Permits (k) Subpart D, 68.85\n\nContractor Safety (h) Subpart D, 68.87\n\nEmergency Response Planning (n) Subpart E, 68.90-68.95\n\nRecordkeeping & Updates Not Applicable Subpart G, 68.190-68.200\n\nTrade Secrets (p) Not Applicable\n\nManagement Programs/Certification Not Applicable\n\nSubpart A, 68.15\n\nSubpart G, 68.185\n\nProcess Safety Information (d) Subpart D, 68.65\n\nProcess Hazard Analysis (e) Subpart D, 68.67\n\nSeismic Hazard Assessment Not Applicable Not Applicable\n\nHazard Assessment (OCA) Not Applicable Subpart B, 68.20-68.42"
    }
  ]
}