{
  "FacilityID": 1000063621,
  "FacilityName": "Seaboard Triumph Foods",
  "FacilityStr1": "5555 Seaboard Triumph Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Sioux City",
  "FacilityState": "IA",
  "FacilityZipCode": "51111",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19193",
  "LEPC": "Iowa Emergency Response Comm.",
  "FacilityLatDecDegs": "42.422775",
  "FacilityLongDecDegs": "-96.386246",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Seaboard Triumph Foods",
  "OperatorStr1": "5555 Seaboard Triumph Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Sioux City",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "51111",
  "OperatorZipCodeExt": null,
  "RMPContact": "Andrew Schroeder",
  "RMPTitle": "Utilities Superintendent",
  "FTE": 2400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000235435",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-04-04 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-07-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-07-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-07-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-07-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079837,
      "AltID": "Processing/Cold Storage",
      "FacilityID": 1000063621,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000081019,
          "ProcessID": 1000079837,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000099526,
          "ProcessID": 1000079837,
          "ChemicalID": 56,
          "Quantity": 186000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000599526,
          "ProcessID": 1000079837,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063621,
      "SummaryText": "Executive Summary\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe accidental release prevention and emergency response policies at Seaboard Triumph Foods in Sioux City, Iowa facility are ingrained in the fundamentals of the process safety prevention program. At the Sioux City, Iowa facility anhydrous ammonia is used for refrigeration. The refrigeration system has an inventory of ammonia that is considered hazardous by the Environmental Protection Agency (EPA). The same properties that make this chemical valuable as a refrigerant also make it necessary to observe specific safety precautions. These safety precautions are exercised in the operation and maintenance of the refrigeration system to control human environmental exposure in an effort to reduce the overall threat to workers as well as the surrounding communities and the environment.\n\n\n\nIt is Seaboard Triumph Foods' policy to adhere to all applicable federal, state, and local laws, rules, and regulations. However, the safe handling of ammonia is paramount at Seaboard Triumph Foods. Standards and recommended practices governing the safe handling of ammonia are used to ensure that a reasonable level of risk reduction is maintained. Safety depends upon management commitment, the manner in which ammonia refrigerant is handled, the safety devices inherent to the refrigeration system design, operating procedures and philosophies, and the training of Seaboard Triumph Foods workers.\n\n\n\nThe Emergency Evacuation Plan outlines procedures for warned and unwarned emergencies that\n\nmay occur at the plant. Warned emergencies are usually tornadoes, heavy snowstorms, or conditions that are reasonably predictable. Unwarned emergencies usually consist of onsite emergencies such as a spill, fire/explosion, or a chemical release. As a responsible company, Seaboard Triumph Foods coordinates emergency response activities with the local emergency management organizations. This ensures prompt response and mitiga"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063621,
      "SummaryText": "tion actions during incidents.\n\n\n\nFacility Description and Regulated Substances Handled\n\n\n\nSeaboard Triumph Foods uses anhydrous ammonia for processing and cold storage. It is located at 5555 Seaboard Triumph Parkway in Sioux City, Iowa. There are approximately 2,400 employees at the plant site at any one time. Only one chemical covered by 40 CFR Part 68 is inventoried at the Sioux City site. This substance is present in quantities greater than the threshold quantity identified by the RMP regulation and therefore is included in our risk management program.\n\n\n\nAmmonia (anhydrous) - Ammonia is used as a refrigerant at the plant. It is received into the plant by truck, however deliveries of ammonia are infrequent. One of the primary refrigeration vessels is the High Pressure Receiver vessel. This vessel has a maximum inventory of 91,475 pounds that is controlled through administrative procedures. The refrigeration system at the facility has a total capacity of approximately 186,000 pounds of anhydrous ammonia.\n\nAccidental Release Program & Chemical-Specific Prevention Steps\n\n\n\nSeaboard Triumph Foods contracted with an outside consulting firm to assist in the refinement of the prevention program tailored exclusively to ammonia refrigeration operations. This prevention\n\nprogram was designed around mechanical integrity and training aspects. The primary objective of the prevention program is to ensure complete containment of ammonia through safe operation and maintenance of the refrigeration system.\n\n\n\nSeaboard Triumph Foods completed a process hazard analysis (PHA) of the ammonia refrigeration system in March 2017. The recommendations generated during this review were prioritized using a standardized Risk Rank Matrix method and resolution will be in a timely fashion.\n\n\n\nFive Year Accident History\n\n\n\nSeaboard Triumph Foods has a very comprehensive Incident Reporting and Investigation procedural process. This process is defined and explained in the prevention program proced"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063621,
      "SummaryText": "ures. Basically, an incident occurs when a deviation from expected performance is experienced. Individuals knowledgeable in refrigeration operation or the equipment being investigated lead formal incident investigations. Root cause and corrective actions are determined and formal reports are prepared. Progress regarding corrective action on all investigated incidents is tracked through final resolution. As the ammonia system is new, there have been no accidents reported at the facility.\n\n\n\nEmergency Response Program \n\n\n\nSeaboard Triumph Foods' emergency evacuation plan has been designed to address likely incidents arising from our ammonia refrigeration system. The emergency plan is a vital part of Seaboard Triumph Foods' overall prevention program. Seaboard Triumph Foods continues to plan for the unplanned ammonia release while striving to adhere to the latest mechanical integrity and inherently safer technologies.\n\n\n\nPlanned Improvements to Reduce Risk\n\n\n\nIn accordance with its risk management program, Seaboard Triumph Foods conducts continuous self-examination evaluations designed to identify and assess process/operational risk employees and the community. The ammonia refrigeration employs an audio and visual leak detection and repair program that requires multiple checks per day. In addition, ammonia detectors are strategically located throughout the facility to quickly detect any releases.\n\n"
    }
  ]
}