{
  "FacilityID": 1000045091,
  "FacilityName": "Essex Control Center",
  "FacilityStr1": "HBMWD Essex Control Center",
  "FacilityStr2": "7270 West End Road",
  "FacilityCity": "Arcata",
  "FacilityState": "CA",
  "FacilityZipCode": "95521",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06023",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "40.906944",
  "FacilityLongDecDegs": "-124.054722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.hbmwd.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 47391776,
  "ParentCompanyName": "Humboldt Bay Municipal Water District (HBMWD)",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Humboldt Bay Municipal Water Distr.",
  "OperatorStr1": "828 Seventh Street",
  "OperatorStr2": "P.O. Box 95",
  "OperatorCity": "Eureka",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95501",
  "OperatorZipCodeExt": null,
  "RMPContact": "Carol Rische",
  "RMPTitle": "General Manager",
  "FTE": 19,
  "OtherEPAFacilityID": "100000127141",
  "EPAFacilityID": "100000127141",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-04-05 00:00:00",
  "SafetyInspectionBy": "Insurer",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-26 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.90633,
  "FRS_Long": -124.05553,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055827,
      "AltID": "Water Chlorination",
      "FacilityID": 1000045091,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056768,
          "ProcessID": 1000055827,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068130,
          "ProcessID": 1000055827,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568130,
          "ProcessID": 1000055827,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045091,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES AT THE ESSEX FACILITY\n\nThe Humboldt Bay Municipal Water District (HBMWD) has the utmost commitment to the safety of its employees and the surrounding public. The HBMWD uses chlorine for disinfection of its potable water supply at the Essex Control Center (facility). Toward that end, preventing accidental releases of chlorine gas to the atmosphere is essential. The HBMWD's policies and practices have emphad safety for many years, long before the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard or the United States Environmental Protection Agency (USEPA) Risk Management Plan (RMP) rule existed. HBMWD plant operators are highly trained to operate and maintain the chlorination system safely and training is ongoing. In HBMWD's nearly 54-year history of using chlorine gas for water disinfection (since approximately 1960), the Essex Control Center has never had a release of chlorine that endangered the public or the environment. The HBMWD will do everything in its power to perpetuate its excellent safety record. Facility personnel train annually in leak response and repair.  In the case of a release or threatened release of chlorine, the Arcata Fire Department will be called immediately to assist. An operator is on duty 24 hours a day, 365 days a year.\n\n\n\nFACILITY DESCRIPTION AND REGULATED SUBSTANCES HANDLED\n\nThe HBMWD is the regional water purveyor in the Humboldt Bay area. The Essex Control Center is the main pumping and chlorination station. One-ton containers are used to supply the chorine for disinfecting the water prior to its distribution to wholesale and retail customers. Five containers are kept in the chlorination building at the facility. The chlorine is compressed gas, liquefied by pressure. Chorine gas is piped from the on line container to the piping and vacuum regulation system to be metered into the water to achieve the proper dose for disinfection.\n\n\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045091,
      "SummaryText": "\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe accidental release prevention program is described in a document titled Process Safety Management of Chlorine at Essex Control Center. The prevention program complies with the OSHA PSM standard and the EPA RMP rule, as well as the California Accidental Release Prevention Program. Numerous prevention measures are applied to all aspects of the chlorination system. Some important examples of prevention measures include the following:\n\n\n\n1.  Training of personnel emphas maintaining and operating the chlorination system in a safe manner.\n\n\n\n2.  The facility is always staffed, and the night operators inspect the chlorination system every two hours.\n\n\n\n3.  There is a chlorine leak detector and audible alarm. As a backup to on site personnel, the alarm is telemetered to the HBMWD security contractor, who will notify additional staff regarding unanswered alarms.\n\n\n\n4.  There is a seismic sensor shut of switch for additional earthquake safety.\n\n\n\n5.  An automatic valve shutoff system closes the valve on each chlorine container when triggered by either the chlorine detector or the seismic sensor.\n\n\n\n6.  A standby electric power generator powers the facility during power outages.\n\n\n\n7.  Established procedures are followed for the safe handling of containers while being delivered, maneuvered, and stored.\n\n\n\n8.  Only one chlorine container is on-line at a time. One chlorine container is on ready reserve to allow for the automatic switchover of the containers when the on-line container is empty. The valves of the other containers are closed.\n\n\n\n9.  Pigtails are installed with the proper amount of slack and are replaced annually.\n\n\n\n10.  Each time a pigtail is connected to a container, a new lead washer is used and the valve and the connection are immediately tested for leaks.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no releases of chlorine that have caused deaths, injuries, property or"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045091,
      "SummaryText": " environmental damage, evacuations, or sheltering in place.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nFacility personnel are trained to respond to chlorine leaks. In the event of a major release or threatened release of chlorine, facility personnel are trained to notify appropriate persons and agencies and respond with the assistance of the Humboldt Bay Fire/Haz Mat team.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nNo changes are being implemented as part of the risk management program. However, improving safety is an ongoing process, and changes are made from time to time. The RMP and PSM plan are updated when changes to process or procedures are made.\n\n\n\nMANAGEMENT SYSTEM\n\nThe HBMWD is committed to keeping its facilities safe for its employees and the potentially affected public and environment. The General Manager has the overall responsibility for the development, implementation, and integration of the risk management program elements. Under the direction of the General Manager, the Superintendent plays a key role in accomplishing these objectives. In particular, the Superintendent has the responsibility for implementing the risk management program at the Essex facility on a day-to-day basis. The Superintendent involves the facility supervisors and other staff to assist with the program and in accomplishing the safe operation of the facility."
    }
  ]
}