{
  "FacilityID": 1000055206,
  "FacilityName": "Pyramid Water Treatment Plant",
  "FacilityStr1": "1300 Pyramid Creek Road",
  "FacilityStr2": null,
  "FacilityCity": "Unalaska",
  "FacilityState": "AK",
  "FacilityZipCode": "99685",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "02016",
  "LEPC": "Aleutian  LEPC",
  "FacilityLatDecDegs": "53.846466",
  "FacilityLongDecDegs": "-166.563034",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.ci.unalaska.ak.us/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 60037488,
  "ParentCompanyName": "City of Unalaska",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Unalaska",
  "OperatorStr1": "P.O. Box 610",
  "OperatorStr2": null,
  "OperatorCity": "Unalaska",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99685",
  "OperatorZipCodeExt": null,
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000194773",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-05-14 00:00:00",
  "SafetyInspectionBy": "Larsen Consulting Group, Inc",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-01-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-01-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-01-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-01-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "0.6",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "600",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000069053,
      "AltID": "Chlorine Storage",
      "FacilityID": 1000055206,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000085120,
          "ProcessID": 1000069053,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000070215,
          "ProcessID": 1000069053,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000043154,
              "Process_NAICS_ID": 1000070215,
              "SafetyReviewDate": "2015-10-15 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 0,
              "FR_ANSI": 0,
              "FR_ASME": 0,
              "FR_None": 1,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2015-12-30 00:00:00",
              "ChangeCompletionDate": "2016-03-01 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Chlortainers",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-10-15 00:00:00",
              "TrainingReviewDate": "2015-10-15 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-02-26 00:00:00",
              "EquipmentInspectionDate": "2016-01-09 00:00:00",
              "EquipmentTested": "Regulators, tubing, manifolds, rotometer, injectors, pumps, scales, alarms",
              "ComplianceAuditDate": "2015-04-20 00:00:00",
              "AuditCompletionDate": "2015-10-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2015-10-15 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000043840,
                  "PreventionProgram2ID": 1000043154,
                  "ProcessChemicalID": 1000085120
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000055206,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": "2015-12-11 00:00:00",
    "ERTrainingDate": "2014-03-28 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "9075811233",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "OSHA 29 CFR 1910.11, EPA 40 CFR, part 68, Reportable Quantity Limits 40 CFR"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055206,
      "SummaryText": "The water treatment plant (WTP) in Unalaska, Alaska stores and uses chlorine, a regulated substance by the Environmental Protection Agency (EPA) and the Occupational Safety and Health Administration (OSHA). A maximum of three 1-ton cylinders are stored at the facility for a total of 6,000 lbs of chlorine. The chlorine cylinders are co-located and interconnected, which qualifies as a process subject to the Risk Management Program (RMP) developed by the EPA. Chlorine is stored over the threshold value of 2,500 lbs listed for the RMP rule, and 1,500 lbs listed for Process Safety Management (PSM) regulation.\n\n\n\nA new WTP was constructed to replace the old WTP and began initial operations in October 2015 with final completion anticipated in February 2016.  Based on previous compliance audits and hazard reviews, chlorine safety concerns of the old WTP have been addressed with the new facility.\n\n\n\nCHLORINE STORAGE PROCESS ASSIGNED AS PROGRAM LEVEL 2\n\nChlorine cylinder storage is considered a process at the facility.  Modeling of a worst-case release was performed using the RMP Comp off-site consequence analysis software developed by the EPA.\n\n\n\nThe modeling determined that there is a public receptor (seasonal recreational area) within the distance to the endpoint for a worst-case release. The worst-cast scenario was defined as release of chlorine from 1 cylinder (1-Ton) for a 10 minute duration using a wind speed of 1.5 meters per second set by the EPA.  The design passive mitigation factor of 0.035 for Chlortainers was used. The release was modeled in an enclosed space with direct contact with the outside air. The WTP is located in a remote and uninhabited area, so rural surroundings was assigned for the topography.\n\n\n\nThe facility is not subject to the OSHA PSM standard because it qualifies for an exemption for normally unoccupied remote facilities, and it is a municipally owned water treatment facility.\n\nThe area surrounding the plant provides seasonal recreational use "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055206,
      "SummaryText": "for hikers, which makes it a public receptor that could be impacted during a worst-case release.  As a result, Program Level 2 was assigned to chlorine storage at the Unalaska WTP. \n\n\n\nWATER TREATMENT AND CHLORINE STORAGE\n\nUnalaska's economy is based on commercial fishing, fish processing, and fleet services (fuel, repairs and maintenance, trade, transportation). The community enjoys a strategic position as the center of a rich fishing area and for transshipment of cargo between Pacific Rim trading partners. There are 10 major docks in Unalaska, to support the processing and trade activities. The island operates five fish processing facilities to process commercial catches. Between the industrial and domestic users, the community treats and distributes over 1 billion gallons of water each year.\n\n\n\nWater treatment is provided at the Pyramid Control Plant. The treatment plant is located in a remote and uninhabited area in the mountains approximately 2 miles south of the developed town site. Access to the site during the winter is unreliable. As such, the facility requires extra chlorine storage so that chlorine does not have to be delivered during hazardous weather conditions. \n\n\n\nWater treatment is an unfiltered process with ultraviolet (UV) and chlorine disinfection prior to distribution. The treatment building serves as storage for the chlorine gas cylinders. Operators typically perform routine checks at the plant twice per week - once for 20 minutes and once for 2 hours.  For added security, the facility uses video cameras that can be accessed remotely.\n\n\n\nACCIDENTAL RELEASE PREVENTION\n\nTo protect against the accidental release of chlorine, the following safety and engineering controls for the storage area are in place:\n\n?    vacuum/injection equipment have safeguards to prevent chlorine gas flow unless a vacuum is present\n\n?    an evacuation fan connected to a gas monitor with local and remote alarms\n\n?    a sprinkler system for the building\n\n?    posted signs warning of the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055206,
      "SummaryText": " presence of chlorine\n\n?    chains for the cylinders to prevent tipping accidents\n\n?    chlortainers for passive mitigation, which have an automated shutoff for seismic events and vacuum loss\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nAn emergency action plan was developed for the water utility in 2004 and has been updated annually. The plan outlines procedures for the response to various emergency scenarios which may impact the ability of the water utility to deliver water to users. One of the scenarios evaluated in the plan is the release of hazardous materials, which can be applied to a chlorine release. The following paragraphs summarize the goals and procedures developed in the emergency action plan.\n\n\n\nCoordination: Emergency response procedures have been coordinated with the local fire department and Public Safety Department. However, the fire department does not have a HAZMAT team to respond to major chlorine leaks, so the water treatment operators are designated as the first responders for the repair and response to a chlorine release.\n\n\n\nTraining: Employees are trained via-in house training at least once a year on the various aspects for chlorine use and handling. The entire staff is also 40-hr Hazardous Waste Operator and Emergency Response (HAZWOPER) certified and maintains the annual 8-hour refresher course. The staff is trained to use safety equipment which includes goggles, respirators, and self-contained breathing apparatus (SCBA) suits and kits for use when responding to a chlorine release.\n\n\n\nDrills: On the job and hands-on training begins after safety material has been covered.\n\nPublic notification: Evacuations would be coordinated with the Public Safety Department and City emergency responders. The procedure for public notification of a boil water notice would be initiated if warranted.\n\n\n\nAlert systems: The water treatment plant is equipped with a gas monitor that activates an evacuation fan and local and remote alarms.  If a chlorine leak is detected, an emergen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000055206,
      "SummaryText": "cy dialup alarm calls each Water Operator in sequence and loops until it receives a response.  In the unlikely event that an operator fails to respond, the Public Utilities Director will be contacted after the fourth loop so that someone in authority knows immediately if there is a problem.  Water Utility employees are required to carry cell phones during and after normal work hours.  The Water Supervisor and properly certified operators coordinate time off to ensure that a qualified person is always available to respond.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nTo date there have been no recorded incidents pertaining to the storage of chlorine at the facility.\n\n\n\nPREVENTION PROGRAM AND PLANNED IMPROVEMENTS\n\nIn accordance with Program 2 level requirements, a compliance audit is completed every three years, a hazard review is completed every five years, and operation and maintenance procedures and training are reviewed for the WTP facility.  Typically, a chlorine inspection by an outside agency or consulting firm is completed every five years; however, the inspection originally scheduled for 2015 was delayed due to construction of the new WTP to replace the old WTP.\n\n\n\nThe major hazards that were identified include a fire in the building, seismic event, and potential equipment failure causing the release of chlorine gas. To address major hazards, process controls include: manual shutoffs for the chlorine equipment; vacuum/injection equipment with safeguards; chlorine gas detectors and alarms to alert employees of a release; chlortainers are used for passive mitigation and are equipped with automated seismic monitor/shut-offs and vacuum loss sensor shutoffs; emergency power to maintain essential equipment in the event of a power outage; and emergency air supply for employees in the event of a chlorine leak.  \n\n\n\nIn October 2015, staff reviewed the operating and maintenance procedures and training for the new WTP.  Classroom and on the job training is provided to educate employe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000055206,
      "SummaryText": "es on the use, handling, and storage of chlorine at the facility.  Employees must demonstrate an understanding of the training during the classroom training sessions. \n\n\n\nOperating and maintenance require regulators, tubing, manifolds, rotometer, injectors, pumps, scales, and alarms are to be routinely inspected or tested at a minimum of once per year with some components inspected or tested weekly.\n\n"
    }
  ]
}