{
  "FacilityID": 1000046641,
  "FacilityName": "Air Liquide Delaware City, DE CO2 Plant",
  "FacilityStr1": "4442 Wrangle Hill Road",
  "FacilityStr2": null,
  "FacilityCity": "Delaware City",
  "FacilityState": "DE",
  "FacilityZipCode": "19706",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "10003",
  "LEPC": "New Castle LEPC",
  "FacilityLatDecDegs": "39.581088",
  "FacilityLongDecDegs": "-075.638463",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Air Liquide Industrial US L.P.",
  "Company2Name": null,
  "CompanyDUNS": 180015336,
  "Company2DUNS": null,
  "OperatorName": "Air Liquide Industrial US L.P.",
  "OperatorStr1": "4442 Wrangle Hill Road",
  "OperatorStr2": "PO Box 272",
  "OperatorCity": "Delaware City",
  "OperatorStateFIPS": "DE",
  "OperatorZipCode": "19706",
  "OperatorZipCodeExt": null,
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000132983",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "AQM-003/00064",
  "SafetyInspectionDate": "2012-02-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-09-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-09-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-09-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-01-24 00:00:00",
  "DeRegistrationEffectiveDate": "2016-12-14 00:00:00",
  "AnniversaryDate": "2019-09-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.581088,
  "FRS_Long": -75.638463,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000058130,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000046641,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000071017,
          "ProcessID": 1000058130,
          "ChemicalID": 56,
          "Quantity": 21800.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000059061,
          "ProcessID": 1000058130,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000048399,
              "Process_NAICS_ID": 1000059061,
              "SafetyReviewDate": "2011-06-20 00:00:00",
              "PHA_Date": "2014-06-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Addition of outside process area ammonia monitors",
              "OpProceduresReviewDate": "2014-04-29 00:00:00",
              "TrainingReviewDate": "2012-04-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "computer based training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "computer base testing",
              "MaintenanceReviewDate": "2014-07-31 00:00:00",
              "EquipmentInspectionDate": "2013-11-28 00:00:00",
              "EquipmentTested": "Process instrument and alarm testing",
              "ChangeMgmtDate": "2011-11-05 00:00:00",
              "ChangeMgmtReviewDate": "2013-05-31 00:00:00",
              "PreStartupReviewDate": "2011-11-05 00:00:00",
              "ComplianceAuditDate": "2014-06-06 00:00:00",
              "AuditCompletionDate": "2016-06-06 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-04-17 00:00:00",
              "HotWorkPermitReviewDate": "2014-08-31 00:00:00",
              "ContractorSafetyReviewDate": "2014-04-05 00:00:00",
              "ContractorSafetyEvalDate": "2013-03-21 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000058883,
                  "PreventionProgram3ID": 1000048399,
                  "ProcessChemicalID": 1000071017
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000046641,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-05-02 00:00:00",
    "ERTrainingDate": "2013-11-13 00:00:00",
    "CoordinatingAgencyName": "New Castle County LEPC",
    "CoordinatingAgencyPhone": "3027921590",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000046641,
      "SummaryText": "cuments onsite and in the company's electronic document control system that are used to help maintain safe operation of its processes.  These documents address chemical properties and associated hazards, equipment design/configuration information, specific chemical inventories and operation limits for key process parameters - all key information for operating the process safely.  Process operators are trained to operate the process using process controls and instrumentation within these operating limits.\r\n\r\nThe Plant Manager is responsible for maintaining up-to-date process safety information.  A table summarizing the reference documents and their location is readily available as part of the written employee participation plan described below.  \r\n\r\nProcess Hazard Analysis\r\nAir Liquide has a risk management program to help ensure that hazards associated with the various processes are identified and control.  The covered process underwent an initial process hazard analysis (PHA) and will continue to undergo periodic review/re-validations at least every five years.   The PHA team consists of members with the appropriate experience to define the hazards and mitigating controls of the process and also represents a cross-section of the employees working in the process.  For upcoming PHA reviews, local and corporate management will review the PHA team findings and develop a resolution action plan for each item, which will be documented, tracked and ultimately closed in the Air Liquide action item database tracking system.  The Delaware City CO2 Plant manager is responsible for prioritizing and tracking implementation of the action plan.\r\n\r\nOperating Procedures\r\nAir Liquide maintains written procedures that address various modes of ammonia refrigeration process operations, such as (1) unit initial startup; (2) unit normal and temporary operations; (3) unit shutdown; (4) emergency shutdown; (5) startup following an emergency shutdown; and (6) process deviation, consequence a"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000046641,
      "SummaryText": "Air Liquide Industries US, L.P. (Air Liquide) operates a carbon dioxide (CO2) Facility in Delaware City, DE (Delaware City CO2 Plant) to produce liquid and solid carbon dioxide (dry ice) products for use in the food processing and preservation, pH control of water, fire protection and other applications. The manufacture of the liquid carbon dioxide requires the removal of heat at temperatures below zero degrees Fahrenheit.   The subzero heat removal is provided through a closed loop industrial anhydrous ammonia refrigeration process.  The Delaware City CO2 plant commenced liquid plant operations in April 1972 and dry ice in 2007. The site has 18 employees. Air Liquide's commitment to safety and environmental protection extends beyond its gates.  As part of the community, we have a responsibility to our customers and to those who live in the surrounding area.  \r\n \r\nRegulated Chemical\r\nThe anhydrous ammonia is a listed highly hazardous substance under the EPA Risk Management Plan (RMP) and OSHA Process Safety Management (PSM) regulations.   The Delaware City combined ammonia refrigeration process inventory is in excess of 10,000 pounds making the ammonia refrigeration process a RMP/PSM Covered Process.  \r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM STEPS\r\nAir Liquide's Delaware City ammonia refrigeration process is covered by the EPA Risk Management Plan (RMP) and OSHA Process Safety Management (PSM) regulations.  The toxic nature of the ammonia in the process makes it necessary for Air Liquide to observe certain safety precautions to prevent unnecessary human and environmental exposure and to reduce the potential threat to personnel and nearby members of the community.  Air Liquide's policy is to comply with all applicable federal and state rules and regulations. The summary below discusses some of the management system in place to implement the accidental release prevention program.\r\n\r\nProcess Safety Information (PSI)\r\nAir Liquide keeps a variety of technical do"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000046641,
      "SummaryText": "l dangers involved with a system covered by PSM/RMP.  Procedures are in place to make sure that contractors:  (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, and (4) understand what they should do in the event of an emergency, prior to their beginning work. Periodically contractors are evaluated to ensure that both their safety performance and training required for work on the ammonia refrigeration meet Air Liquide's safety standards. \r\n\r\nChemical Specific Prevention Steps\r\nAir Liquide's accidental release prevention program activities helps prevent potential accident scenarios that could be caused by equipment failures and human errors.  The following are examples of the types of safety features in place:\r\n\r\nRelease Detection\r\n¿\tAmmonia sensors detectors inside the plant building, the control room and the outside production area\r\n¿\tHandheld monitor for use in local leak detection\r\n\r\nRelease Mitigation\r\n¿\tManual and automated valves to isolate the refrigeration process.\r\n¿\tVentilation system in the production equipment enclosure \r\n¿\tPlant emergency stop to shutdown the compressors\r\n¿\tCheck valves on ammonia loading line\r\n¿\tA contracted emergency response specialist, HMHTTC, to support the Delaware City CO2 Plant emergency response plan.\r\n\r\nFive-Year Accident History\r\nThe Delaware City CO2 Plant has had no accident resulting in either on or offsite effects in the last 5 years for the covered ammonia refrigeration process.\r\n\r\nEmergency Response Program Information\r\nThe Delaware City  CO2 Plant has developed an emergency response plan.  The plan outlines action to be taken at the plant and the communication to emergency responder, local response agencies, and outside agency notification procedures in the event of an ammonia release. The emergency plan provides for the evacuation of Delaware City CO2 Plant personnel and visitors.  If an emergency involving the release of ammonia occ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000046641,
      "SummaryText": "use of an Incident Investigation and reporting procedure.  Air Liquide documents incident and subsequent investigation, follow up actions, and closure in the electronic document system.  The Plant Manager is responsible for maintaining a log and tracking incidents and corrective actions through completion.  Results of findings and corrective actions are shared with employees who could be affected by the findings.  Reports are retained for at least five years to be reviewed during future PHAs and PHA revalidations.\r\n\r\n Employee Participation\r\nAt the Delaware City  CO2 Plant employees are expected to participate in accidental release prevention program (RMP/PSM).   Employees are trained on and are provided access to the ammonia refrigeration process safety information.  The specific ways an employee can be involved in the accident prevention program are documented in the Employee Participation plan.  Forms of participation include being part of a PHA, a PSSR, and/or being involved in incident investigation. Employees participate in monthly safety meetings where process safety issues are discussed and corrective actions are developed, and they are involved in the review of the covered process operating procedures annually to ensure they are correct and recommend any necessary changes. \r\n\r\nSafe & Hot Work Permit System\r\nAir Liquide has a safe & hot work permit system in place to help ensure worker and process safety.  This system is comprised of a group of corporate procedures and standards under the life safety program.  Procedures in place included:  (1) energy control; (2) safe work; (3) hot work; (4) confined space entry.  Plant personnel are trained on these safe work practices to ensure that operations and maintenance activities are performed safely.\r\n\r\nContractors\r\nAir Liquide uses contractors to supplement its own work force when maintenance activities exceed the capabilities or time available for their own operators.  Contractors are made aware of the potentia"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000046641,
      "SummaryText": "urs that will have off-site consequences the contracted emergency responder HMHTTC will be contacted and will respond to mitigate the release.    The Delaware City Fire Department and the New Castle County Local Emergency Planning Committee shall coordinate action of the affected community.  Air Liquide is a member of DC CAER and maintains regular communication with the Delaware City Fire department to ensure that they are familiar with the facility's Emergency Action Plan.\r\n\r\nPlanned Changes to Improve Safety\r\nThe Delaware City CO2 plant resolves the findings of its PHA and other hazard reviews some of which result in modifications of the process. such as;   \r\n\r\n¿\tReview and modification of all ammonia relief valves and header system to meet current industries standards (ASHRAE)\r\n¿\tThe addition of drain pots and self closing manual drain valves to the oil removal drain points for the ammonia refrigeration system"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000046641,
      "SummaryText": "nd action.  These procedures are used by experienced operators and provide a basis for consistent training of new operators. These procedures are reviewed and annually certified as current and accurate. \r\n\r\nTraining\r\nAir Liquide has implemented a training program for all employees involved in operating the ammonia refrigeration process.  All employees receive a combination of classroom, computer-based (CBT) and hands-on training that addresses such topic as:  general orientation, site rules and practices, process safety information, normal and emergency operating procedures, health and safety consideration, use of safety procedures and equipment, incident investigation and emergency response.  In addition, all operators are required to attend refresher training at least every three years.  Training is documented and tracked in an electronic document system. \r\n\r\nMechanical Integrity\r\nAir Liquide has established mechanical integrity (MI) practices and procedures, based on preventative philosophy, to maintain pressure vessels, piping systems, and relief valves and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition.  The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests; (4) correcting identified deficiencies, and (5) applying quality assurance measures.  In combination, these activities form a system that maintains the mechanical integrity of the process equipment.  \r\n\r\nThe MI program assists with the verification and suitability of new and existing process equipment and, as well as quality control of spare parts and modifications to existing process equipment.\r\n\r\nManagement of Change\r\nAir Liquide's management of change (MOC) procedure has established the requirements for ensuring that proposed process or equipment changes or changes indirectly affecting processes are evaluated, approved and documented prior to implementation th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000046641,
      "SummaryText": "rough the use of a management of change process.  The MOC procedure outlines the requirements for documenting, evaluating the impact, and approving planned deviations from procedure.  All MOC's are submitted, reviewed by subjective matter specialist (such as Engineering, Risk Management, Operations, Health and Safety), approved, tracked and closed using an electronic approval and tracking system.  Upon closure, personnel whose assigned job functions are impacted by the MOC, are briefed and /or trained in the MOC requirements. \r\n\r\nPre-startup Safety Reviews (PSSRs)\r\nAir Liquide ensures the safety of new/modified facilities or processes before placing those facilities or processes into service through the use of pre-startup safety reviews (PSSRs).  PSSRs are intended to ensure safety through confirmation that:  (1) construction and equipment are in accordance with design specifications; (2) safety, operating, maintenance and emergency procedures are in place and adequate; (3) PHAs have been performed and recommendations resolved before startup of new plants or processes; (4) MOC requirements have been satisfied for modified facilities; and (5) training has been completed for affected employees.\r\n\r\nCompliance Audits\r\nTo help ensure the accident prevention program is functioning properly, Air Liquide conducts an audit to determine whether the procedures and practices required by the accidental release prevention program are being implemented.  Compliance audits are conducted at least every three years.  Resolutions to the recommendations are documented, tracked and closed.  Once the resolutions have been completed, changes are communicated to operating, maintenance and other employees whose work assignments are in the process and who may be affected by the recommendations or actions. \r\n\r\nIncident Investigation\r\nAir Liquide defines management systems and establishes the requirements for communicating, investigating and reporting of incidents at all facilities through the"
    }
  ]
}