{
  "FacilityID": 1000097485,
  "FacilityName": "Cloverdale Foods Company",
  "FacilityStr1": "3015 34th Street N.W.",
  "FacilityStr2": null,
  "FacilityCity": "Mandan",
  "FacilityState": "ND",
  "FacilityZipCode": "58554",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38059",
  "LEPC": "Morton County LEPC",
  "FacilityLatDecDegs": "46.5856692",
  "FacilityLongDecDegs": "-100.593095",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 61445813,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Gene Keller",
  "OperatorStr1": "3015 34th Street N.W.",
  "OperatorStr2": null,
  "OperatorCity": "Mandan",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58554",
  "OperatorZipCodeExt": null,
  "FTE": 444,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000073074",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-12-12 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-08-03 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-08-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-08-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 46.85758,
  "FRS_Long": -100.93151,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000120712,
      "AltID": "Food Manufacturing",
      "FacilityID": 1000097485,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000151034,
          "ProcessID": 1000120712,
          "ChemicalID": 56,
          "Quantity": 22937.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000122085,
          "ProcessID": 1000120712,
          "NAICSCode": "311612",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000103599,
              "Process_NAICS_ID": 1000122085,
              "SafetyReviewDate": "2022-05-04 00:00:00",
              "PHA_Date": "2021-04-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2023-10-21 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Installation of a new ammonia refrigeration system in Engine Room 2",
              "OpProceduresReviewDate": "2022-05-04 00:00:00",
              "TrainingReviewDate": "2022-05-04 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-05-04 00:00:00",
              "EquipmentInspectionDate": "2022-05-04 00:00:00",
              "EquipmentTested": "Daily check",
              "ChangeMgmtDate": "2021-12-01 00:00:00",
              "ChangeMgmtReviewDate": "2022-05-04 00:00:00",
              "PreStartupReviewDate": "2022-05-16 00:00:00",
              "ComplianceAuditDate": "2022-05-04 00:00:00",
              "AuditCompletionDate": "2023-11-04 00:00:00",
              "IncidentInvestigationDate": "2014-05-08 00:00:00",
              "InvestigationChangeDate": "2014-06-16 00:00:00",
              "ParticipationPlansReviewDate": "2022-05-04 00:00:00",
              "HotWorkPermitReviewDate": "2022-05-04 00:00:00",
              "ContractorSafetyReviewDate": "2019-07-10 00:00:00",
              "ContractorSafetyEvalDate": "2022-05-04 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000130058,
                  "PreventionProgram3ID": 1000103599,
                  "ProcessChemicalID": 1000151034
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000097485,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-03-06 00:00:00",
    "ERTrainingDate": "2021-09-30 00:00:00",
    "CoordinatingAgencyName": "Mandan Fire Department",
    "CoordinatingAgencyPhone": "7016673288",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000097485,
      "SummaryText": "INTRODUCTION\r\n\r\nThis PSM/RMP document has been developed for the Cloverdale Foods facility located in Mandan, North Dakota.  This document has been prepared to satisfy the PSM/RMP of the following regulations:\r\n\r\n?\tEPA Risk Management Prevention Program (RMP), 40 CFR Part 68.\r\n\r\n?\tOSHA Process Safety Management (PSM), 29 CCR 1910.119.\r\n\r\nThe purpose of this document is to:\r\n\r\n?\tIncrease the protection of public health, the environment, and facility employees by ensuring proper emergency response and mitigation procedures when handling regulated substances.\r\n\r\n?\tAssist Cloverdale Foods and local government agencies in their communication and coordination efforts to improve facility safety while handling regulated substances.\r\n\r\nThis document addresses Cloverdale Foods' administrative and operational programs to prevent accidents related to regulated substances and to reduce potential risks.  The regulated substance of concern and focus of this document is anhydrous ammonia. The facility utilizes an ammonia refrigeration system for the storage of food products.\r\n\r\nOPERATING PROCEDURES\r\n\r\nOperating procedures describe all employee tasks, data to be recorded, operating conditions to be maintained, and safety and health precautions to be utilized in operation of the process containing regulated substances.  The procedures need to be technically accurate and will result in safe operation of the facility.  In addition, they need to be understandable to the employees and/or contractors.  The procedures must be updated as changes are made to the facility or to the operating limits of the systems.  The regulations require that the employer annually certify that the operating procedures are current and accurate.\r\n\r\nAll phases of system operation must be covered by written procedures.  Specifically, procedures must be available for:\r\n\r\n?\tinitial startup;\r\n?\tnormal operation;\r\n?\ttemporary operations as the need arises;\r\n?\temergency shutdown;\r\n?\tnormal shutdown; and\r\n?\tstartup fo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000097485,
      "SummaryText": "llowing a turnaround, or after an emergency shutdown.\r\n\r\nThe procedures contain process operation limits and provide information of the consequences of deviation from these limits and the steps required to correct any deviations.  Safety and health measures are included in the procedures to warn employees of potential risks and protective action that should be taken.\r\n\r\nEMPLOYEE TRAINING\r\n\r\nAll employees, including maintenance and contractor employees involved with regulated substances (i.e. ammonia), need to fully understand the health and safety hazards associated with the chemical with which they are working.  This will allow them to better protect themselves, fellow employees, and the neighboring communities.  In addition to the normal awareness training which informs personnel of the hazards of the chemical and the safety precautions to use, training in operating procedures and practices, emergency response, and other required management controls is required.\r\n\r\nEmployers must identify the personnel who require training, develop a training protocol with procedures and objectives, and maintain a record of personnel training.  Regular evaluation of the training program should be accomplished to ensure that it is providing the appropriate information to the employees in a useful and understandable way.\r\n\r\nMECHANICAL INTEGRITY\r\n\r\nA formal maintenance program must be in place for all systems using regulated substances (i.e. ammonia).  This program could consist of routine (scheduled) inspection, testing, overhaul, and replacement as needed.  Equipment must be categorized and ranked with respect to the maintenance involved.  This maintenance and inspection information should include all equipment such as storage tanks, compressors, condensers, evaporators, process piping, relief and vent systems, fire protection system components, emergency shutdown systems, and alarms.  Each component must be placed into a category that indicates how maintenance and inspection will"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000097485,
      "SummaryText": "be performed on that class of components.\r\n\r\nMANAGEMENT OF CHANGE / PRE-STARTUP SAFETY REVIEW\r\n\r\nOther than replacement in kind, any change to the system must be documented.  In particular, the change of any equipment, control system, or procedure must be evaluated to determine that it will not have an adverse effect on the safety aspects of the system.  In addition, procedures must be revised to reflect the changes in the system. For a new design or the addition of significant changes to the process, a Pre-Startup Safety Review (PSSR) must be employed to determine that the changes are not themselves deficient or that the addition of the new portions of the system will adversely affect the original system.  Management procedures must be developed to ensure that a satisfactory hazard analysis has been completed before the system is started.  The records from this Pre-Startup Safety Review must be kept on file.\r\n\r\nINCIDENT INVESTIGATION\r\n\r\nIncident investigation is the process of identifying the underlying causes of incidents and implementing steps to prevent similar events from occurring.  It is expected that employers will recognize and investigate events that resulted in or could reasonably have resulted in a hazardous chemical release. Employers must develop in-house capability to investigate incidents that occur in their facilities.  A team should be assembled by Cloverdale Foods and trained to collect and document information related to any incident.  Usually a multi-disciplinary team is better able to gather the facts and evaluate what happened and why.  All employees with information should be interviewed and other facts should be gathered to develop a complete picture of the facts concerning the incident. Recommendations are then developed for changes in equipment, procedures, or safety systems to prevent a reoccurrence of the event.\r\n\r\nCONTRACTOR SAFETY\r\n\r\nAny use of outside contractors who work in and around the ammonia refrigeration system requires that th"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000097485,
      "SummaryText": "ese contractors have accomplished the training, utilize proficient personnel, and have been informed of the necessary health and safety aspects of working in the area.  The goal is to assure that contractor employees perform work in a safe manner and do not endanger themselves, other employees, or the facility.  A plan for screening potential contractors to ensure satisfactory performance is required.\r\n\r\nPSM AUDITS\r\n\r\nAn effective audit program is required to determine that facility personnel and contractors are following the procedures and intents of the overall PSM requirements.  Periodic reviews of all areas of the management programs are required to verify compliance.  OSHA has published compliance guidelines for their compliance personnel.  These guidelines make a good basis for developing an internal audit program.  Corrective actions related to the audit will need to be documented and kept on record to show how the audit is improving the overall performance of the risk management programs in place at the facility.\r\n\r\nHOT WORK PERMIT\r\n\r\nA management control program must be employed that recognizes that extra care is required for non-routine work practices.  This program will advise the personnel that significant potential hazards exist and that extra care should be taken in certain circumstances.  This will ensure that employees, contractors, and company property are protected against fire, explosion, and other dangers resulting from hot work.  Formal procedures should exist for these programs and paperwork associated with ongoing work should be kept for documentation.\r\n\r\nEMPLOYEE PARTICIPATION\r\n\r\nEvery section of the PSM/RMP program must allow for employee participation in its development and implementation.  The plan allowing for this participation must be documented.  Employees and their representatives must have access to all information required to be developed for the Process Safety Management program without regard to possible trade secret status of suc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000097485,
      "SummaryText": "h information.\r\n\r\nEMERGENCY PLANNING AND RESPONSE\r\n\r\nEmergency plans are required in case there is a release of ammonia (or other emergency such as fire or earthquake).  Employers must select a formal plan on how to handle an emergency situation and also a plan to educate employees as to what they should do.  This plan must be detailed and include procedures for notifying local authorities and following up with written accident reports should there be any significant releases or threatened releases.  Many local site factors will be included in the emergency response plan.  Cloverdale Foods has a stated policy of not responding offensively to an ammonia emergency situation.\r\n\r\nPROCESS SAFETY INFORMATION\r\n\r\nComplete and accurate written information concerning process chemicals, process technology, and process equipment is essential to an effective PSM/RMP program and to other aspects such as the Process Hazard Analysis (PHA).  The information to be compiled about the chemicals needs to be comprehensive enough for an accurate assessment of the fire and explosion characteristics, reactivity hazards, the health and safety hazards to workers, and the corrosion effects on process equipment as well as monitoring and safety related equipment.  SDS information can provide a portion of the required data but other information will be required. \r\n\r\nPROCESS HAZARD ANALYSIS\r\n\r\nThe Process Hazard Analysis (PHA) is the basis for many of the decisions and procedures associated with an effective PSM/RMP program.  It is a systematic effort to determine the potential hazards associated with the process and to evaluate mitigation alternatives including equipment modifications, procedural modifications, training, and administrative controls.  An effective PHA considers and analyzes the potential consequences associated with a release of the hazardous materials including fires, explosions, and exposure of people to toxic materials.  It focuses on equipment, instrumentation, utilities, huma"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000097485,
      "SummaryText": "n actions, and external events.\r\n\r\nTo ensure that both operator safety as well as off-site safety is addressed, a hazard and operability (HAZOP) study using the Guide Word method was conducted during the initial PHA Study on March 28, 2017 and during the PHA Revalidation on April 21, 2021. Human factors such as lighting, accessibility, and overall working conditions were incorporated into the analysis. The following checklists, relating to human factors and facility siting were also used to identify potential hazards: Human Factors Engineering, EPA Ammonia Alert, Facility Siting, and Emergency Response Action Plan.  An External Events Analysis Matrix was also completed, which examined the possible likelihood and consequences of external events in and around the facility."
    }
  ]
}