{
  "FacilityID": 1000074264,
  "FacilityName": "North Brawley Geothermal Project",
  "FacilityStr1": "4982 Hovley Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Brawley",
  "FacilityState": "CA",
  "FacilityZipCode": "92227",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.019328",
  "FacilityLongDecDegs": "-115.542802",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "ORNI 18 LLC",
  "Company2Name": "Ormat Nevada, Inc.",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ORNI 18 LLC",
  "OperatorStr1": "6140 Plumas Street",
  "OperatorStr2": null,
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89519",
  "OperatorZipCodeExt": null,
  "RMPContact": "Keith Hovley",
  "RMPTitle": "Operations Manager",
  "FTE": 3,
  "OtherEPAFacilityID": "CAL000336199",
  "EPAFacilityID": "100000204316",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-06-27 00:00:00",
  "SafetyInspectionBy": "Lawrence Environmental Consulting",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-11-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092521,
      "AltID": "North Brawley Isopentane",
      "FacilityID": 1000074264,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093785,
          "ProcessID": 1000092521,
          "NAICSCode": "221116",
          "_desc": {
            "NAICS_CODE": "221116",
            "NAICS_DESCRIPTION": "Geothermal Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115773,
          "ProcessID": 1000092521,
          "ChemicalID": 115,
          "Quantity": 713309.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 115,
            "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
            "CASNumber": "78-78-4",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000615773,
          "ProcessID": 1000092521,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000074264,
      "SummaryText": "The North Brawley Geothermal Project is operated by Ormat Nevada, Inc. (Ormat), and owned by ORNI 18, LLC (plant) and ORNI 17, LLC (well field).  The North Brawley Geothermal Project (North Brawley facility) is located north of the city of Brawley, California within the North Brawley Known Geothermal Resource Area (KGRA) and generates electricity from renewable geothermal resources in an environmentally friendly manner.  The North America Industrial Classification System code for the North Brawley facility is 221119.  Ormat operates the North Brawley Geothermal Project in accordance with all applicable federal, state, and local environmental and safety regulations and is committed to maintaining compliance with these regulations.  The North Brawley Geothermal Project has emergency response procedures and protocols in place at the facility in coordination with local emergency response agencies. \n\n \n\nThe North Brawley facility consists of five Integrated Two Level Unit (ITLU) Ormat Energy Converter (OEC) units that are designed to generate a net output of 49.9 megawatts (MW).  \n\n\n\nThe Combined Process Safety Management Plan and Risk Management Plan (PSM/RM) requires proactive identification, evaluation and mitigation or prevention of chemical releases that could occur as a result of failures in processes, procedures, or equipment.  The PSM/RMP regulations also define the responsibilities of employers and contractors involved in work that affects or takes place near processes covered by the regulations to ensure the safety of both plant and contractor employees and the potential effects on public receptors.\n\n\n\nThe lone chemical used at the North Brawley facility that is covered by PSM/RMP Program is isopentane.  In the binary process of electrical generation, isopentane is used as the motive fluid in the generation of electricity from natural geothermal fluid in a series of interconnected Ormat Energy Converters at each facility.  Geothermal fluid is used to heat isope"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000074264,
      "SummaryText": "ntane liquid to vapor in the Ormat Energy Converters, which in turn is used as the motive fluid to spin a turbine connected to a generator to produce electricity.  The isopentane vapor is then condensed and reused in a continuous, closed loop process within each Ormat Energy Converter and does not involve any chemical reactions or changes to the isopentane.  Isopentane is stored in two storage tanks, located within the facility.\n\nAn integral part of the PSM/RMP is the completion of a hazards and operability study of the facility's flammable and toxic materials.  The study was conducted by a Process Hazard Analysis/Hazards and Operability Study (PHA/HAZOP) team composed of Ormat personnel with detailed knowledge of the process (es) and consulting members retained for the completion of this document.  The objective of the study was to identify potential hazards and their causes, consequences and appropriate responses or actions to mitigate the identified hazards.  A relative risk ranking was used to assign a hazard to each identified segment or \"node\" of a given process based on experience frequency and the consequence category of the hazard.  The performance of this study and relative risk ranking meets the requirement for a process hazard analysis.  A supplemental \"What If\" analysis was also performed to evaluate other circumstances or outside influences beyond the control of the system operators and maintenance workers.  These outside influences were evaluated by the PHA/HAZOP team and possible consequences were discussed.  For each of the consequences, a mitigating action was presented and/or developed to address such occurrences.\n\n\n\nThe PHA/HAZOP team conducted a formal review of the previous HAZOP analysis for North Brawley.  During this update, the previously established HAZOP segment nodes for the North Brawley processes were evaluated changed or eliminated as necessary to more accurately reflect the current processes as of 2018.  The team carefully reviewed 1"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000074264,
      "SummaryText": "7 nodes within the isopentane process and the potential hazards associated with these nodes. The PHA team did not recommend any Risk 1 (Unacceptable) or 2 (Undesirable) priority items.  The PHA team identified four Risk 3 (Acceptable with controls), and 56 Risk 4 (Acceptable as is) priority items that are acceptable as is under the current operating conditions and training programs implemented at the North Brawley facility.\n\n\n\nAs set forth in Title 40 of the Code of Federal Regulations (CFR) Part 68, Chemical Accident Prevention Provisions, an offsite consequence analysis was performed to determine the offsite impact of hypothetical releases of isopentane.  Under the RMP regulations, the facility is required to perform an offsite consequence analysis for a worst-case release scenario of isopentane, and at least one alternative release scenario.  The offsite consequence analysis is designed to evaluate the potential for impacts to offsite receptors in the event that such a release occurs.  Evaluation of the impact of the worst case and alternative release scenarios was performed using the EPA approved models RMP*Comp and Areal Locations of Hazardous Atmospheres (ALOHA) version 5.4.7.   \n\n\n\nThe worst-case scenario selected was a release of the entire contents of the largest storage tank for isopentane on site.  The worst-case scenario for flammable liquids requires the use of a 1-psi overpressure endpoint caused by the explosion of the vapor cloud formed by the release of the largest amount contained in the vessel.  For the alternative release scenario for isopentane, it is assumed that vapor cloud fire results from the release of isopentane through a 4-inch hole at the bottom of the storage tank directly to atmosphere at ground level.  \n\n\n\nFor the worse-case scenario, a release of 12,000 gallons of isopentane forming a vapor cloud explosion was modeled using RMP*Comp, which resulted in an estimated distance to 1 psi overpressure of 0.3 miles (0.5 kilometers).  A wors"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000074264,
      "SummaryText": "t case scenario using ALOHA initially utilized a Boiling Liquid Expanding Vapor Explosion (BLEVE) scenario of a flammable liquid in a horizontal cylindrical tank.  However, this scenario was ruled out because according to the ALOHA definitions, \"BLEVE typically occur in closed storage tanks that contain a liquefied gas, usually a gas that has been liquefied under pressure.\"  An example of a liquefied gas is propane.  \n\n\n\nSince isopentane is stored at ambient temperatures and pressure, the worst case scenario using the ALOHA air dispersion model assumed a leak from a hole in the storage tank with the isopentane burning as it escapes the tank.  This then forms a large puddle of burning isopentane to a diameter of approximately 14 yards.\n\nThe ALOHA model produced the following results:\n\n\n\nThreat modeled - Thermal radiation from Pool fire\n\n\n\nRed Zone - 47 yards (potential lethal within 60 seconds)\n\nOrange Zone - 65 yards (Second degree burns within 60 seconds)\n\nYellow Zone - 99 yards (pain within 60 seconds)\n\n\n\nFor the alternate scenario, a release of 12,000 gallons of isopentane forming a vapor cloud fire was modeled using RMP*Comp, which resulted in an estimated distance to lower flammability limit of <0.1 mile (<16 kilometers).  Using ALOHA, a release of 11,656 gallons of isopentane was modeled as isopentane leaking from the storage tank through a 4-inch hole at the bottom of the tank forming a large (30-yard diameter) puddle.  The isopentane quickly evaporates forming a large flammable vapor cloud.  \n\n\n\nThe ALOHA model produced the following results:\n\n\n\nThreat modeled - Flammable area of Vapor cloud as Lower Explosive Limit, LEL.\n\n\n\nRed Zone - 82 yards (8,400 ppm = 60% LEL = flame pockets)\n\nYellow Zone - 236 yards (1,400 ppm = 10% LEL)\n\n\n\nNorth Brawley Geothermal Project is surrounded by agricultural land beyond the distance to end point of the worst case scenario of isopentane, however, a single family residence is located approximately 0.45 miles (800 yards) to th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000074264,
      "SummaryText": "e south of the North Brawley facility.  This distance is greater than the distance to endpoint of the worst and alternate case scenario modeled using RMP*Comp and ALOHA.  Therefore, the estimated risk to this potential off-site receptor appears to be low.  The federal RMP regulations do not consider agricultural land as public receptors unless farm workers predictably or routinely occupy the fields.  Some of the agricultural land in the worst-case impact areas may qualify as public receptors.\n\nOffsite Population Impacts were estimated using a U.S. Census population density for counties and Puerto Rico Municipals, dated July 1, 2011.  According to the U.S. consensus concentration maps, Imperial County has a population density of approximately 40 to 86.8 persons per square mile.  The US Census population data tables from 2017, indicates that the population of people in Imperial County is approximately 183,000 people.  This is a 4.8% increase from the previous population data of 2011.\n\n\n\nWith an area of approximately 4,482 square miles, that translates to a population density of approximately 40 people per square mile within Imperial County.  \n\nUsing an assumed population density of 40 persons per square mile and the greatest distance to end point of 0.3 miles (0.28 square mile) for the worst case scenario for an isopentane release and vapor cloud explosion, the number of persons affected could potentially be 11.\n\n\n\nAccording to the EPA Risk Management Program Guidance for Offsite Consequence Analysis, environmental receptors are defined as national or state parks, forests, or monuments officially designated wildlife sanctuaries, preserves or refuges and federal wilderness areas.  Based on a review of the USGS 7.5-minute Westmoreland East topographic map, there are no obvious or significant environmental receptors.\n\n\n\nNorth Brawley Geothermal Project has complied with the PSM/RMP requirements and is committed to reviewing and updating the program periodically as approp"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000074264,
      "SummaryText": "riate and maintaining compliance with regulatory requirements.  This PSM/RMP has been updated to comply with all applicable regulations and is accessible to all interested persons at all times.  Ormat has been proactive in developing and implementing the PSM/RMP for the North Brawley facility, not only to comply with state and federal requirements but also as a commitment to a safe workplace as a top priority.\n\n"
    }
  ]
}