{
  "FacilityID": 1000035043,
  "FacilityName": "Hudson Compressor Station",
  "FacilityStr1": "9501 Weld County Road 47",
  "FacilityStr2": null,
  "FacilityCity": "Hudson",
  "FacilityState": "CO",
  "FacilityZipCode": "80642",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08123",
  "LEPC": "Weld County LEPC",
  "FacilityLatDecDegs": "40.120900",
  "FacilityLongDecDegs": "-104.637500",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Western Gas Partners, LP",
  "Company2Name": "Anadarko Petroleum Corporation",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Anadarko Petroleum Corporation",
  "OperatorStr1": "1201 Lake Robbins Dr.",
  "OperatorStr2": null,
  "OperatorCity": "The Woodlands",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77380",
  "OperatorZipCodeExt": null,
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000172591",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "950PWE057",
  "SafetyInspectionDate": "2004-11-01 00:00:00",
  "SafetyInspectionBy": "DOT",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-03-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-06-21 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-06-21 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2017-09-13 00:00:00",
  "DeRegistrationEffectiveDate": "2017-08-17 00:00:00",
  "AnniversaryDate": "2018-06-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.120883,
  "FRS_Long": -104.638019,
  "FRS_Description": "PROCESS UNIT AREA CENTROID",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R02",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000042852,
      "AltID": "Natural Gas Liquid Extrac",
      "FacilityID": 1000035043,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000051459,
          "ProcessID": 1000042852,
          "ChemicalID": 155,
          "Quantity": 130000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000043932,
              "ProcessChemicalID": 1000051459,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000043933,
              "ProcessChemicalID": 1000051459,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000043934,
              "ProcessChemicalID": 1000051459,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000043935,
              "ProcessChemicalID": 1000051459,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000043936,
              "ProcessChemicalID": 1000051459,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000043937,
              "ProcessChemicalID": 1000051459,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000043938,
              "ProcessChemicalID": 1000051459,
              "ChemicalID": 94
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000043234,
          "ProcessID": 1000042852,
          "NAICSCode": "48621",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000035043,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-05-22 00:00:00",
    "ERTrainingDate": "2013-05-22 00:00:00",
    "CoordinatingAgencyName": "Keenesburg Fire Department",
    "CoordinatingAgencyPhone": "3037324203",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000035043,
      "SummaryText": "This executive summary is a brief overview of the Risk Management Program and the associated policies at the Anadarko Petroleum Corporation (APC) Hudson Compressor Station (Station). Because there are employees at the station more than 4 hrs./day, the station is subject to the OSHA PSM standard.\r\n\r\nAccidental Release Prevention and Response\r\n\r\nAnadarko Petroleum Corporation has a longstanding commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention. APC has an extensive operator and maintenance training program. Safety is a major concern in the design, installation, operation, and maintenance of our processes. APCs policy is to implement reasonable controls to prevent foreseeable releases of hazardous materials. However, if a release does occur, personnel are trained on how to respond to such emergencies. If the situation requires, APC will notify, cooperate with, and support the various emergency response agencies.\r\n\r\nLocation and Regulated Substances\r\n\r\nThe Hudson Compressor Station is located in Weld County about two and one-half (2 ½) miles north of the town Hudson in a rural area which is used primarily for farming.\r\n\r\nThe Station consists of seven compressor units that discharge 120 MMCF/D through glycol dehydration to delivery points via 12 and 20 cleanable pipelines. The discharge pressure is not to exceed 1,220 psig. The station is equipped with inlet separation. Liquids separated (condensate) go into five 225 barrel storage tanks.\r\n\r\nThe purpose of the compressor station is to increase the pressure of the gas being transported in the pipelines and to reduce the water dew point of the gas to a level that is acceptable for pipeline transmission. Each compressor receives gas from various gathering lines and supplies the pipeline(s) that transport the gas to a processing plant. Control of the dew point is critical since the incoming gas contains moisture (water) that must be removed. \r\n\r\nAs gas"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000035043,
      "SummaryText": "flows through the pipeline, its temperature will decrease to about the same temperature as the surrounding environment. If this temperature is below the dew point of the gas, the water and heavy hydrocarbons will condense. The resulting formation of liquids restricts gas flow, particularly at orifices and bends in the pipe. In extreme cold, the liquids may form hydrates, a potentially dangerous ice plug.  In order to reduce the dew point of the gas and potential formation of hydrates, the inlet gas flows through a slug catcher and inlet separator that physically separates the liquids from the gas stream. The gas is then compressed, and cooled, which causes some of the heavy hydrocarbons to condense out of the stream resulting in a lower dew point. These condensed raw, natural gas liquids (NGL), also called condensate, is pumped into a liquids pipeline for further stabilization at a processing facility.  After compression, the gas is dried using a liquid desiccant, Triethylene glycol (TEG). The glycol is regenerated and used again.\r\n\r\nThe Station's maximum intended inventory of flammable substances in a mixture is larger than the threshold quantity (10,000 lbs.) of regulated flammable substances. Therefore, the Station is subject to the EPA RMP Standard.\r\n\r\nHistory and Ownership\r\n\r\nThe Hudson Compressor Station was built by Panhandle Eastern Co in the early 1970's. The compressor station was sold to Kinder Morgan Inc., formerly known as KN Energy, in 1993 and who maintained operations through December 1, 1999. In 1999, HS Resources bought the station and operated it until 2001.\r\n\r\nIn August 2001, Kerr McGee (KMG) acquired HS Resources and continued operations until APC acquired Kerr McGee in 2006.\r\n\r\nProgram Level \r\n\r\nAPC has determined that Program Level 1 applies to the Hudson Compressor Station for the following reasons:\r\n\r\n1.\tThe station has a documented Emergency Response Plan which has been coordinated with the local fire department;\r\n2.\tThe station has not had"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000035043,
      "SummaryText": "an accidental release of the regulated substances (condensate) that directly or indirectly caused death, injury, or response/restoration activity for an environmental receptor in the previous five years; and\r\n3.\tThe distance to any receptor is greater then calculated endpoint for the worst-case scenario of 0.4 miles.\r\n\r\nEmergency Response Program\r\n\r\nAPC has developed a site-specific emergency response plan for this facility.  This plan is coordinated with local response agencies. The goals of the program are to protect employees and the public from the hazardous effects of releases and to minimize the effects of any releases. The program is routinely reviewed and updated to reflect station, personnel, and regulatory changes.\r\n\r\nAccident History\r\n\r\nThere have not been any accidents in the past five years that meet the criterion for inclusion with this submittal."
    }
  ]
}