{
  "FacilityID": 1000073188,
  "FacilityName": "McGinness Hills",
  "FacilityStr1": "1350 Grass Valley Road",
  "FacilityStr2": null,
  "FacilityCity": "Austin",
  "FacilityState": "NV",
  "FacilityZipCode": "89310",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "32015",
  "LEPC": "Lander County LEPC",
  "FacilityLatDecDegs": "39.5906",
  "FacilityLongDecDegs": "-116.9133",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "UN",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ormat.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Ormat Technologies, Inc.",
  "Company2Name": "Ormat Nevada Inc.",
  "CompanyDUNS": 929315661,
  "Company2DUNS": null,
  "OperatorName": "Ormat Nevada Inc.",
  "OperatorStr1": "6140 Plumas Street",
  "OperatorStr2": null,
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89519",
  "OperatorZipCodeExt": null,
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000217464",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-29 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2018-10-12 12:12:33",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-10-12 12:12:33",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2018-10-12 12:12:33",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-10-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 39.5906,
  "FRS_Long": -116.9133,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R03",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000091385,
      "AltID": "MGH1 - OEC 1, 2, 3",
      "FacilityID": 1000073188,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000114223,
          "ProcessID": 1000091385,
          "ChemicalID": 125,
          "Quantity": 759710.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000092628,
          "ProcessID": 1000091385,
          "NAICSCode": "221116",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000091386,
      "AltID": "MGH2 - OEC 21, 22, 23",
      "FacilityID": 1000073188,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000114224,
          "ProcessID": 1000091386,
          "ChemicalID": 125,
          "Quantity": 817732.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000092629,
          "ProcessID": 1000091386,
          "NAICSCode": "221116",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000091387,
      "AltID": "MGH3 - OEC 31, 32",
      "FacilityID": 1000073188,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000114225,
          "ProcessID": 1000091387,
          "ChemicalID": 115,
          "Quantity": 563296.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000114226,
          "ProcessID": 1000091387,
          "ChemicalID": 118,
          "Quantity": 733935.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000092630,
          "ProcessID": 1000091387,
          "NAICSCode": "221116",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000073188,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-09-21 00:00:00",
    "ERTrainingDate": "2018-10-02 00:00:00",
    "CoordinatingAgencyName": "Austin Volunteer Fire Department",
    "CoordinatingAgencyPhone": "7759642482",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000073188,
      "SummaryText": "McGinness Hills Risk Management Plan\r\nExecutive Summary\r\n\r\nAccidental Release Prevention and Emergency Response Policies\r\n\r\nIt is Ormat Nevada Inc.'s (Ormat's) policy to adhere to all applicable federal, state, and local laws. The McGinness Hills facility actively manages all operational permits and safety programs such as Nevada Division of Environmental Protection's Air Quality, Chemical Accident Prevention Program (CAPP), and Underground Injection Control programs as well as OSHA's Process Safety Management program. In addition, Ormat is ISO 14000 and 9001 certified and undergoes several audit processes to ensure all facilities are aggressively pursuing the highest quality, safety and environmental standards. Ormat is committed to handling the n-pentane, i-pentane and n-butane (generally referred to as motive fluid) systems regulated by the Risk Management Program in a safe manner to protect the environment. Copies of emergency response, process hazard analyses, Chemical Accident Prevention and process safety management plans and all technical drawing (P&IDs) for process equipment are maintained onsite for reference.\r\n\r\nFacility Description\r\nThe McGinness Hills Geothermal Power Plant (McGinness Hills) is wholly owned by Ormat Nevada Inc (Ormat), which is a division of Ormat Technologies, Inc., a publicly traded company. The power plant is located in Lander County and encompasses approximately 7,680 acres of public and private lands. The physical plant is located about 11 miles northeast of Austin, Nevada on Grass Valley Road. The leased acreage covers the defined geothermal resource area and receptive injection zones.\r\n\r\nThe physical address is: \t1350 Grass Valley Road\r\n\t\t\t        Austin, NV   89310\r\n\t\t\t\r\nTwo processes, McGinness Hills 1 (MGH1) and McGinness Hills 2 (MGH2) are essentially identical processes within the power plant that comprise this stationary source.  MGH1 became operational in 2012.  MGH2 became operational in 2015.  MGH1 and MGH2 utilize the m"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000073188,
      "SummaryText": "otive fluid n-pentane.\r\n\r\nMcGinness Hills 3 (MGH3) is configured differently from MGH1 and MHG2 and utilizes the motive fluids i-pentane and n-butane.  This process will become operational in October, 2018.\r\n\r\nAll three processes are geothermal electric power generation facilities.  The processes utilize hot brine that is pumped from a geothermal reservoir.  The hot geothermal brine is used to drive an organic Rankine Cycle process.  The hot geothermal brine vaporizes the process motive fluid in shell and tube heat exchangers.  The hot, high pressure motive fluid exiting the heat exchangers drives a turbine/generator set to produce electricity.  The motive fluid exhausted from the turbine is condensed in air cooled condensers and returned to the shell and tube heat exchangers via feed pumps to form a closed-loop process.  The cooled geothermal brine exiting the process is returned to the geothermal reservoir through dedicated injection wells.\r\n\r\nAt MGH1 and MGH2, the process consists of two, Integrated Two Level Unit (ITLU) Ormat Energy Converters (OEC) and one, level 3 air-cooled OEC.  The OEC levels are differentiated by the operating pressure of the heat exchangers and turbines.  Each OEC incorporates one double ended shaft generator driven by two 1800 RPM direct coupled special organic fluid turbines, and associated auxiliary systems. \r\n\r\nThe MGH3 process consists of one Integrated Three Level Unit (I3LU) Ormat Energy Converter.  There are two OECs (a level 1 OEC and a level 2&3 OEC) each of which incorporates one double ended shaft generator driven by two 1800 RPM direct coupled special organic fluid turbines, and associated auxiliary systems.\r\n\r\nMcGinness Hills is operated by Ormat's Eastern Nevada Operations Group (ENOP).  The organization is comprised of management, administration, maintenance, engineering and operations personnel. ENOP operates five eastern Nevada power generation facilities owned by Ormat.\r\n\r\nAll the Eastern Nevada power plants operate con"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000073188,
      "SummaryText": "tinuously, 24 hours per day and 365 days per year (excluding scheduled maintenance downtime or plant upsets).   The McGinness Hills complex is staffed 24 hours per day and 365 days per year.\r\n\r\nRegulated Substance Handled\r\nIn addition to the motive fluid inventory present in the OECs, each plant has dedicated storage tanks for the on-site motive fluid.  The tanks provide evacuation capacity that is necessary to facilitate removal of motive fluid from an OEC for maintenance activities. At MGH1, two tanks have a nominal capacity of 30,000 gallons each and one has a nominal capacity of 12,000 gallons.  MGH2 has two, 36,000 gallon capacity tanks.  MGH3 has two 60,000 gallon tanks dedicated to iso-pentane and three 60,000 gallon tanks dedicated to normal butane.  During normal operation, the tanks are essentially empty.  The registered quantities of motive fluid for each process include the quantity charged to each OEC plus a nominal amount of residual fluid in a storage tank.\r\n\r\nWorst Case Scenario: Worst case scenario assessment has been conducted and the potential off-site consequence analysis (OCA) was undertaken. However, in conformance with Office of Emergency Management guidance, the OCA for worst-case and/or alternative release scenario(s) has not been included in this Executive Summary.\r\n\r\nAccident Prevention Program\r\nGiven the lack of proximity to offsite receptors and lack of accidents, McGinness Hills is registered as a program level 1 stationary source.  Notwithstanding the program level, Ormat maintains a complete accident prevention program as specified for a program level 3 facility at all processes.\r\n\r\nSafe Work Practices: Safe work practices have been developed and implemented to provide for the control of hazards during work activities such as lock out/tag-out, confined space entry, opening process equipment or piping, and control over entrance into a facility by maintenance, contractor, laboratory or other support personnel. These safe work practices"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000073188,
      "SummaryText": "apply to both employees and contractors.\r\n\r\nMaintenance Procedures: A Mechanical Integrity Program (MIP) has been initiated at the McGinness Hills\r\nFacility. The MIP adopts a maintenance concept for periodic preventative and corrective maintenance of the OEC systems. The preventative maintenance tasks include visual inspection, lubrication of rotating parts, system cleaning, replacing liquids and filters, and periodic tests to verify that the system is in proper operating condition. Preventative maintenance tasks and procedures are scheduled to be undertaken over a series of maintenance intervals.  Alarm system maintenance is determined using a combination of regulatory requirements, manufacturer's recommendations, plant operating experience and best practices. \r\n\r\nTraining: Initial training for personnel is given before an employee is allowed to either handle motive fluid, operate or work on the facility's process area or work on process equipment.  Overview of the plant operations is conducted with Emergency Services Personnel including a tour of the site, gas and fire detection system operations, and familiarization with the motive fluid characteristics.\r\n\r\nEmployee refresher training is conducted on an annual basis, at a minimum, and when review of the chemicals or process reveals a need for additional training. Initial and refresher training, associated with the Risk Management Program, is documented and maintained per the requirements of the Training Program.  Additional training is also provided as needed or requested by Emergency Services Personnel. Contracted employees, shall be trained in the requirements of the EAP procedure prior to working at the McGinness Hills site. Training includes the following items, but is not limited to: (a) Location and sounds of the stand down, and evacuation alarms; (b) Expectations of response to injuries and emergencies by personnel on site; and (c) Evacuation routes and locations. Refresher training for all personnel shall"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000073188,
      "SummaryText": "be conducted annually at a minimum.\r\n\r\nSafety Training: Some equipment at the McGinness Hills Geothermal Power Plant poses potential fire, explosion, and electrical hazards that could cause serious personal injuries and costly property damage if safety procedures are not followed correctly. Safety training, conducted monthly and required of all employees, identifies the different hazards to be found on the sites. These subjects include Emergency Action Plan (EAP), motive fluid hazards, fire prevention and hot work, lock out and tag out procedures, hazard communication, confined space, hearing conservation, personal protective equipment, accident, injury and incident reporting. Safety training is supplemented by the use of the Standard Safety Procedures.\r\n\r\nOEC Unit Control: The OEC units are controlled and monitored by their own dedicated Programmable Logic Controller (PLC). The PLC receives all discrete (logic) and analog signals from the input devices (e.g. switches and measuring sensors), processes the signals according to pre-loaded Ormat software, and then outputs logic and analog command signals to local and field devices. All parameters needed for proper operation of the OEC units, such as pressure, temperature, voltage, current, power, speed, etc. are measured by the proper measuring instruments. Deviation from the operating parameters will immediately be detected by the PLC and the PLC will initiate correction or automatic shutdown of the related OEC unit. Under normal circumstances, no releases or other dangerous situations are expected to result from these automatic actions. Appropriate manual override is provided.\r\n\r\nRelief system design: Relief valves are located on the motive fluid storage tanks and on the OEC vaporizers and condensers. Each pressure relief valve relieves directly to atmosphere, and some installations have extension pipes installed to direct the relief valve discharge away from critical machinery. \r\n\r\nVentilation System Design: All co"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000073188,
      "SummaryText": "mponents of the motive fluid transfer and storage systems and the OEC units are located outdoors.\r\n\r\nSafety Systems: Beyond the relief system at McGinness Hills, the OEC units have extensive fire protection, gas and flame detection, and alarm systems.  These protective systems, in conjunction with the administrative control system, ensure the focus is upon fire prevention.\r\n\r\nThe fire detection systems include gas monitors, which continuously monitor the area surrounding the OEC's, and flame detectors located throughout the plant. The facility has a fire water system installed in a continuous loop around the generating units and within reach of the motive fluid storage tanks and major process equipment. The fire water systems consist of fire monitors, hydrants and deluge systems.  Diesel driven fire pumps that draw from adjacent fire water tanks are located at MGH1 and MGH3.  The fire water system at MGH2 is supplied from MGH1 by a buried pipeline.  Operators are trained in the proper use of the installed fire protection equipment, and the training information is appropriately documented by the facility operator.\r\n\r\nProcess Hazard Analysis\r\nAn initial Process Hazardous Analysis (PHA) including Hazard and Operability (HAZOP) study, an external events analysis, and a human factors analysis was conducted in April, 2012 for MGH1 and revalidated in May, 2014.  The initial PHA for MGH2 was completed in February, 2014.  The PHA for MGH3 was completed in November, 2017.  The PHAs will be updated and revalidated at least every 5 years for each process. \r\n\r\nFive-Year Accident History\r\nMGH1 and MGH2 have had no accidents reportable pursuant to the RMP criteria.  MGH3 is a new facility and motive fluid has not been introduced as of this submittal.\r\nEmergency Response Program\r\nThe Emergency Response Program is intended to identify and coordinate personnel in the event there is an emergency. The EAP procedures apply to all personnel working at the McGinness Hills facility. The EA"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000073188,
      "SummaryText": "P has been submitted to the local fire department, sheriff's office and LEPC. \r\n\r\nImplementation, Control and Compliance: The Regional Manager has overall responsibility for the development and implementation of the Emergency Action Plan. The Emergency Action Plan is reviewed annually to verify regulatory compliance and accuracy with both OSHA Regulations on Emergency Plans 29CFR1910.38 and CAPP's Emergency Response Programs, NAC 459.9544. The Emergency Response Program must also be periodically reviewed and updated and employees notified of any changes in conformance with 40 CFR 68.95. The EAP may also be reviewed, as part of any Incident Investigations or when deemed required during Management of Change. Current copies of the Emergency Action Plan are located in the McGinness Hills Control Building and in the company's electronic data base.\r\n\r\nEvacuation of Personnel: In the event of an emergency determined to be motive fluid-system related and evacuation is deemed necessary, the control room operator or other designated personnel will sound the plant evacuation alarm.  Activation of fire and gas detectors are also interlocked to sound the alarms automatically.\r\n\r\nFirst Aid: All personnel have been trained in adult CPR and basic first aid procedures.\r\n\r\nControl Room Operator: Upon notification from the site that an emergency has occurred, the Control Room Operator shall verify that appropriate response activities have been initiated and emergency response teams have been called. The Control Room Operator assumes initial communications with the site over emergency situations until relieved by either the Plant Manager or Regional Manager.\r\n\r\nEmergency Response Personnel: Fire, police, and/or ambulance crews will be called if necessary. The senior employee on site at the time of the incident will give a report to the person in charge of the emergency teams.  The emergency response personnel assume the role of incident commander upon arrival on scene.\r\n\r\nPlanned Chang"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000073188,
      "SummaryText": "es to Improve Safety\r\nPHA recommendations that were made to improve operations or safety have been implemented."
    }
  ]
}