{
  "FacilityID": 1000028538,
  "FacilityName": "Poet Biorefining - Corning, LLC",
  "FacilityStr1": "1680 Brooks Road",
  "FacilityStr2": null,
  "FacilityCity": "Corning",
  "FacilityState": "IA",
  "FacilityZipCode": "50841",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19003",
  "LEPC": "Adams County LEPC",
  "FacilityLatDecDegs": "40.966172",
  "FacilityLongDecDegs": "-094.793342",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.poet.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 794758156,
  "ParentCompanyName": "NA",
  "Company2Name": "NA",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Poet Biorefining - Corning, LLC",
  "OperatorStr1": "1680 Brooks Road",
  "OperatorStr2": null,
  "OperatorCity": "Corning",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50841",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Sawtelle",
  "RMPTitle": "Technical Manager",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000199117",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "NA",
  "SafetyInspectionDate": "2011-11-16 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-05-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-05-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-05-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034756,
      "AltID": "Denaturant System",
      "FacilityID": 1000028538,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000035098,
          "ProcessID": 1000034756,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000042041,
          "ProcessID": 1000034756,
          "ChemicalID": 125,
          "Quantity": 708000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 125,
            "ChemicalName": "Pentane",
            "CASNumber": "109-66-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000542041,
          "ProcessID": 1000034756,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028538,
      "SummaryText": "FACILITY DESCRIPTION\n\nThe Poet Biorefining-Corning is located on the east and south sides of Brooks Road, approximately one 1/2-mile east of [unincorporated] Brooks, Iowa and 4 miles southwest of Corning, Iowa (Adams County).  The main product of the Poet Biorefining-Corning facility is denatured ethanol for use as motor vehicle fuel. Production at the facility was initiated in 2007. POET Biorefining-Corning produces ethanol using the dry mill method.  Corn meal is mixed with water and digestive enzymes to produce starch.  The resulting mash is converted to fermentable sugars, and yeast is added to ferment the sugars to ethanol.  The fermented mash (beer) contains about 20% alcohol by volume and is distilled, then passed through a dehydration system to produce 200-proof anhydrous ethanol.  After final dehydration, the ethanol is collected in three storage tanks (two 2,000,000-gallon tanks and one 270,000-gallon tank).  Denaturant (natural gas condensate, NGC) is added during the load-out to make the ethanol unfit for human consumption, per federal and state requirements.  The NGC denaturant is normally stored in Tank No. 805, which has a capacity of 126,900 gallons (approximately 710,000 pounds).  Denatured 200-proof ethanol is shipped from the facility in tank trucks and rail cars.\n\n\n\nCHEMICALS REGULATED UNDER THE EPA CHEMICAL ACCIDENT PREVENTION PROGRAM\n\nThe NGC denaturant is the only CAPP/RMP regulated chemical present at Poet Biorefining-Corning which exceeds the CAPP quantity thresholds for applicability of the regulation.  The CAPP/RMP regulated process consists of the NGC denaturant storage tank, and the associated blending/transfer equipment and piping.  The facility uses in-line blending; thus the two 1,000,000 gallon storage tanks do not contain denatured ethanol.  The denaturant is added to the ethanol to a concentration of 1% to 3%. The greatest CAPP regulated quantity of denaturant in a tank, vessel or piping system is the maximum capacity of the denatu"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028538,
      "SummaryText": "rant storage tank (Tank 805; 710,000 pounds), located in the center containment area of the tank farm.\n\n\n\nACCIDENTAL RELEASE EMERGENCY RESPONSE POLICY AND PROGRAM\n\nPOET Biorefining-Corning is committed to the protection of it employees, the surrounding community and the environment from hazardous substances used in the ethanol fuel production process.  In the event of an emergency, the POET Biorefining-Corning Emergency Coordinator will direct internal response activities to the extent they are within the qualifications and capabilities of company personnel, taking reasonable precautions to prevent or minimize the extent of release or the co-mingling of materials.  There is no facility emergency response team.  Employees within their designated work areas will respond to small releases, if such response does not pose a danger to their health or safety.  In the event of a larger release, it is the policy of POET Biorefining-Corning to notify the Corning Fire Department (and pre-identified emergency response contractor if conditions warrant) and evacuate all non-essential or threatened employees at the facility.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM & CHEMICAL-SPECIFIC PREVENTION STEPS\n\nPOET Biorefining-Corning is committed to protection of the environment through the combined use of inspection, maintenance, employee training and response preparation.  Public access to the facility from the highway is restricted by a gate.  Much of the property is fenced, limiting vehicle access.  The plant is fully lighted.  Personnel are typically on-site 24 hours a day, 7 days a week.  There is a multi-camera video surveillance system installed at the property, and a general computer based alarm system.  The alarm system includes monitoring of the storage tanks and denaturant blending system (level control and overfill monitors).  The alarm system is monitored in the control room for abnormal conditions, which trigger visual control panel alarm lights and audible alarms.  All of"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028538,
      "SummaryText": " the facility storage tanks have secondary storage containment and are included in the facility Spill Prevention Control and Countermeasure (SPCC) Plan.  The facility has a computer-based maintenance management and tracking system (MAXIMO) which enhances plant safety and equipment reliability.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nPOET Biorefining-Corning has experienced no accidents which require inclusion in the five-year accident history required by Subpart B of the CAPP/RMP regulation.  \n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe POET Biorefining-Corning management team is committed to an on-going system of reviewing changes in available technologies and any plant incidents to identify opportunities to improve plant safety.  At this time POET Biorefining- Corning has no plans to update or improve process equipment.  Operating procedures are reviewed annually and will be updated as needed to improve the safety of our facility. \n\n"
    }
  ]
}