{
  "FacilityID": 1000041960,
  "FacilityName": "INEOS Melamines LLC",
  "FacilityStr1": "730 B Worcester Street",
  "FacilityStr2": null,
  "FacilityCity": "Springfield",
  "FacilityState": "MA",
  "FacilityZipCode": "01151",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25013",
  "LEPC": "Springfield LEPC",
  "FacilityLatDecDegs": "42.159065",
  "FacilityLongDecDegs": "-72.517605",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ineos.com",
  "FacilityEmailAddress": "info@ineosmelamines.com",
  "FacilityDUNS": 869261094,
  "ParentCompanyName": "INEOS Industries Holdings Limited",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "INEOS Melamines LLC",
  "OperatorStr1": "730 B Worcester Street",
  "OperatorStr2": null,
  "OperatorCity": "Springfield",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01551",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Hansen",
  "RMPTitle": "Operations Director",
  "FTE": 37,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000212691",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "X237177",
  "SafetyInspectionDate": "2014-05-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-06-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-06-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051692,
      "AltID": "Coatings Resin Mfg",
      "FacilityID": 1000041960,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000052261,
          "ProcessID": 1000051692,
          "NAICSCode": "32551",
          "_desc": {
            "NAICS_CODE": "32551",
            "NAICS_DESCRIPTION": "Paint and Coating Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062710,
          "ProcessID": 1000051692,
          "ChemicalID": 1,
          "Quantity": 1000000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562710,
          "ProcessID": 1000051692,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041960,
      "SummaryText": "EXECUTIVE SUMMARY-INEOS MELAMINES INDIAN ORCHARD PLANT\n\n\n\n2016 RISK MANAGEMENT PLAN SUBMITTAL\n\n\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nAt INEOS Melamines Indian Orchard Plant we are committed to operating and maintaining all of our processes, especially those using hazardous substances, in a safe and responsible manner.\n\nThis Executive Summary provides an overview of the risk management and process safety procedures and practices that have been designed and implemented at the the Indian Orchard facility and will include information on the following:\n\n\n\n- facility description and the use of substances regulated by the EPA's Risk management program Rule.\n\n\n\n- an overview of our accidental release prevention programs.\n\n\n\n- a five year accident history for accidental releases of chemicals regulated by the Risk Management Program rule.\n\n\n\n- an overview of the emergency response programs.\n\n\n\n- an overview of planned improvements to help prevent accidental chemical releases from occuring and adversely affecting our employees, the surrounding community, or the environmnent.\n\n\n\n\n\n\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nThe Ineos Melamines LLC facility in Springfield, Massachusetts produces amino resins that are used in a broad array of protective coating applications in automotive paints and other industrial applications.  Primary raw materials include melamine, formalin, methanol, and butanol.  The facility utilizes one regulated substance, formaldehyde, which is used in a 56% aqueous solution called formalin.  The solution is shipped to the facility in approved tank trucks that are unloaded upon arrival into one of two bulk storage tanks.  One tank has a capacity of 83,000 gallons and can be filled to a maximum volume of 80,000 gallons while the other has a capacity of 35,000 gallons and a maximum fill volume of approximately 33,000 gallons.  An additional Day Tank of approximately 7,000 gallons is utilized in the process area to su"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041960,
      "SummaryText": "pport daily production needs.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nINEOS Melamines employs a systematic and proactive approach to preventing accidental releases of hazardous chemicals at the Indian orchard facility. Our process safety systems and risk management systems include each of the key components of a successful prevention program including:\n\n\n\n-  development and maintenance of process safety information.\n\n-  completion and revalidation of a process safety analysis (PHA).\n\n-  development, review, and use of written operating procedures.\n\n-  development and administration of an employee training program.\n\n-  mechanical integrity integrity programs for the inspection, testing, preventive       \n\n   maintenance, and repair of department equipment.\n\n-  management of change procedures to evaluate, approve, and communicate new or modified \n\n   equipment, process conditions, raw materials, etc.\n\n-  execution of pre-startup safety reviews.\n\n-  completion of program compliance audits evaluating all aspects of our programs.\n\n-  incident investigations for injuries, spills, fires, and near miss events.\n\n-  employee participation in all elements of process safety and risk management prevention \n\n   programs.\n\n-  implementation of hot work permitting requirements.\n\n\n\nSafety in Design:\n\n\n\n-  tanks, vessels, and piping designed, constructed and tested in accordance with American Society of Mechanical Engineers (ASME) and American Petroleum Institute (API) codes and standards.\n\n-  all systems and components designed to meet or exceed government standards.\n\n-  hazardous area classifications determined for electrical installations and equipment in or near process areas.\n\n-  computer based process control systems that continually monitor process parameters, provide warning alarms, and take action when necessary, to prevent process deviations that could lead to a chemical release or other undesired event.\n\n-  secondary containment structures installed around all "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041960,
      "SummaryText": "storage tanks.\n\n-  sprinkler systems, deluge systems, and fixed monitors installed throughout the department and are inspected, tested, and maintained in accordance with national Fire Protection (NFPA) codes and standards.\n\n-  containment structures and collection systems installed for loading and unloading of railcars and tank trucks. \n\n-  safety-critical systems designed for \"fail safe\" conditions during loss of utilities.\n\n-  use of instrumented protective systems and alarms for critical process control systems.\n\n-  multiple layers of protection for all safety critical systems and/or operations.\n\n\n\nOperating Safely:\n\n\n\n-  department operations are continually monitored and controlled by computer systems that automatically shutdown equipment and systems to preserve safety.\n\n-  the process control room are continually staffed to monitor operating conditions and provide immediate response to process deviations.\n\n-  process operators are trained and tested on the operating procedures, work instructions, and standard operating conditions which address all process operations including normal operations, emergency operations and emergency shutdowns.\n\n-  inventories of chemicals in the department are minimized, where possible, to reduce risk while satisfying customer needs.\n\n\n\nAuditing of Operations:\n\n\n\n-  compliance audits of the process safety management and risk management prevention programs are conducted every three years. The most recent audit was conducted in June 2016.\n\n-  process hazard analysis studies conducted for our processes by a multi-disciplined team at least once every five years and more frequently for major project modifications and process expansions. Most recent study conducted in February 2015.\n\n\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidental releases from the RMP covered process that resulted in deaths, injuries, or significant property damage at the site.  In addition, there have been no incidents resulting in offsite deaths, inju"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041960,
      "SummaryText": "ries evacuation, sheltering in place, property damage, or environmental damage.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAMS\n\n\n\nINEOS Melamines has developed hazardous waste contingency and emergency response procedures to address federal,state, and local regulatory requirements for emergency response planning.  As a facility that operates on the site of Solutia Inc., Indian Orchard, Ma., INEOS and Solutia have a agreement where Solutia provides emergency fire and hazmat response in emergency situations.\n\n\n\nTraining and Preparation:\n\n\n\n-  emergency and spill response equipment staged throughout the department for immediate use.\n\n-  specialized teams and technical specialists dedicated to off-site response for hazardous material transportation emergencies.\n\n-  process operators and manufacturing staff are trained in emergency shutdown procedures.\n\n-  members of the Springfield Fire department and Emergency Preparedness group tour our operations on a periodic basis.\n\n\n\nChemical Release Response:\n\n\n\n-  department operators proceed to shutdown and isolate the affected system.\n\n-  Solutia and INEOS combined emergency response teams alerted and dispatched through the plant guard house, which is staffed 24/7/365.\n\n-  plant fire truck and hazmat truck are dispatched to the seen of the incident.\n\n-  pre-planned drill scenarios for chemical releases are put into action. \n\n-  INEOS and site ESHS personnel are alerted and dispatched.\n\n-  Springfield Fire and Police Departments and the LEPC are contacted to activate the city emergency plan, if necessary.\n\n\n\nCommunity Emergency Response:\n\n\n\n-  once notified by INEOS Melamines, Springfield Emergency Management System notifies the local public safety officials.\n\n-  local law enforcement ad fire departments will alert the community via public address speakers, radio, television, and/or door-to-door notification and will advise whether to shelter-in-place or evacuate, if necessary.\n\n-  affected personnel will follow emergency procedures. \n\n\n\n\n\nP"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000041960,
      "SummaryText": "LANNED CHANGES TO IMPROVE SAFETY\n\n\n\nINEOS Melamines, Indian Orchard facility, is committed to the principals if continuous improvement in all areas of safety. We are constantly upgrading our operations and safety systems to improve the level of protection to our employees, contractors, the community, and the environment we operate in.\n\n\n\nTo help facilitate continual improvement in the elements of process safety and risk management, INEOS Melamines hired a maintenance supervisor/reliabilty engineer in 2014 to help improve the mechanical integrity, inspection, testing, preventive maintenance, and repair programs of department equipment and processes.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n"
    }
  ]
}