{
  "FacilityID": 1000033576,
  "FacilityName": "Alpha Resins, LLC",
  "FacilityStr1": "17350 Ryan Road",
  "FacilityStr2": null,
  "FacilityCity": "Detroit",
  "FacilityState": "MI",
  "FacilityZipCode": "48212",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26163",
  "LEPC": "Wayne County LEPC",
  "FacilityLatDecDegs": "42.421277",
  "FacilityLongDecDegs": "-83.062423",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Technisand Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Karl Nelson",
  "OperatorStr1": "17350 Ryan Road",
  "OperatorStr2": null,
  "OperatorCity": "Detroit",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48212",
  "OperatorZipCodeExt": null,
  "RMPContact": "Karl Nelson",
  "RMPTitle": "Plant Manager",
  "FTE": 15,
  "OtherEPAFacilityID": "48212DLTRS17350",
  "EPAFacilityID": "100000220432",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-05-04 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-04-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-04-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-04-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-09-09 00:00:00",
  "DeRegistrationEffectiveDate": "2021-05-01 00:00:00",
  "AnniversaryDate": "2018-04-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000041088,
      "AltID": "Formalin Tank Farm",
      "FacilityID": 1000033576,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000041510,
          "ProcessID": 1000041088,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        },
        {
          "Process_NAICS_ID": 1000041511,
          "ProcessID": 1000041088,
          "NAICSCode": "325998",
          "_desc": {
            "NAICS_CODE": "325998",
            "NAICS_DESCRIPTION": "All Other Miscellaneous Chemical Product and Preparation Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000049312,
          "ProcessID": 1000041088,
          "ChemicalID": 1,
          "Quantity": 300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000549312,
          "ProcessID": 1000041088,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033576,
      "SummaryText": "Alpha Resins, LLC is a subsidiary of Technisand Inc.  Alpha Resins, LLC owns and operates an industrial resin manufacturing plant in Detroit, Michigan. The plant is located at 17350 Ryan Road, Detroit, Michigan, 48212. The resin plant was originally constructed in 1974 and has undergone construction in 2012 to add additional batch kettles and controls. The resin process includes kettles, blend/mix tanks, raw material tank farms, finished resin tank farms, utilities, and warehouse storage. The plant employees 21 people at the Detroit location.\n\n\n\nAlpha Resins is committed to operating a plant that is compliant with safety rules, regulations, and good engineering practices.  This is done to create a safe environment for our workers, the community, and the environment. One way we do this is through our Risk Management Program (RMP) that manage risks at the plant and complies with the requirements of the Environmental Protection Agency (EPA's) regulation 40 CFR part 68, Accidental Release Prevention Requirements: Risk Management Programs (RMP). One of the requirements of the RMP rule is to submit a risk management plan (RMP Plan) that describes the risk management program at the plant. This document is intended to satisfy the RMP Plan requirement and to provide the public with a description of the RMP program at the plant.\n\n\n\nThe risk management program at the Plant consists of the following:\n\n\n\n-Process Hazard Analysis to assess and understand the risks of potential offsite consequences of potential releases and accidents and a review of incidents from the last five years associated with the use of RMP regulated substances.\n\n\n\n-Prevention and training programs to help maintain and safely operate a process that contains more than a threshold quantity of a regulated substance.\n\n\n\n- An Emergency Response Program to respond to accidental releases of regulated substances.\n\n\n\nThe RMP program at the plant is one piece of the safety program to provide assurance that the plant "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033576,
      "SummaryText": "is maintained and operated in a safe manner. Other safety programs include:\n\n\n\n- New chemical introduction process that manages the use of hazardous substances. When a hazardous substance is used at the Plant, we consider less hazardous alternatives and the potential for this substance to adversely affect plant workers, the community, and the environment and take corrective actions through engineering and administrative controls.\n\n\n\n- New equipment and processes are designed, constructed, and operated to reduce the likelihood of an accidental release. This includes the use of good engineering practices where industry and government standards are used in the design, construction, and operation of the equipment. \n\n\n\n- Spill response training for employees to respond to various  accidental releases thus reducing the consequences and coordinating with the local fire department and LEPC to help prevent injuries and environmental damage if a release does occur.\n\n\n\nThe safety program at the Plant consists of a number of components to comply with regulations and to manage risk. This RMP Plan is primarily intended to describe the parts of the safety program at the Plant that are required by the RMP rule.\n\n\n\n(A) Accidental Release Prevention and Emergency Response Policies\n\nAlpha Resins implements controls and best practices to prevent releases of hazardous substances. These controls include training programs for maintenance and operations personnel, programs for managing change, reliability, mechanical integrity, good engineering practices, and programs to evaluate the hazards at the plant.\n\n\n\nIn the event of an accidental release, the Plant will control and contain the release in a manner that will be safe for workers and will prevent injury to the public and the environment. The plant provides leadership and response training to its personnel, designates an emergency response Incident Commander to oversee response activities, and coordinates response efforts with the local"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033576,
      "SummaryText": " emergency services. \n\n\n\n(B) Regulated Substances\n\nThe Plant handles one regulated substance above the regulated quantity for RMP, Formaldehyde.\n\n\n\n(C) Offsite Consequence Analysis: \n\nThe offsite consequence analysis for Formaldehyde was conducted in accordance with 40 CFR, Part 68, Subpart B. This was completed using EPA's Offsite Consequence Analysis Guidance (OCAG) recommended equations and is summarized in the EPAs RMP CDX system.\n\n\n\n (D) Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nBeginning in 2013, the plant formalized the prevention program for the processes that use or store formaldehyde to comply with the elements of the OSHA process safety management (PSM) standard along with additional requirements of a RMP level 3 program. \n\n\n\nThe Plants Program 3 prevention system consists of the following elements:\n\n-Process Safety Information\n\n-Process Hazard Analysis\n\n-Operating Procedures\n\n-Training\n\n-Mechanical Integrity\n\n-Management of Change\n\n-Pre-startup Safety Review\n\n-Compliance Audits\n\n-Incident Investigation and corrective action\n\n-Employee Participation\n\n-Hot Work Permits\n\n-Contractor Management\n\n\n\nThe plant has implemented the requirements of the OSHA 1910.1048 Formaldehyde Standard to improve chemical specific preventive safety. Also, we designed the storage process to include spill containment and a scrubber system to recover emissions.\n\n\n\n(E) Five Year Accident History\n\nAt Alpha Resins there have not been any releases, which resulted in deaths, injuries, significant property damage, offsite deaths or injuries, sheltering in place, evacuations, or environmental damage.\n\n\n\n\n\n(F) Emergency Response Programs\n\nThe Plant has established a written emergency response plan to safely respond to accidental releases of hazardous substances. The emergency response plan includes training and drills to improve the effectiveness of the plan.\n\n\n\n(G) Planned Changes to Improve Safety \n\nAlpha Resins uses management systems and continuous "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033576,
      "SummaryText": "improvement processes to improve the safety of the process. These management systems are evergreen and have reoccurring review of process hazards, ongoing training for plant personnel, auditing to improve the systems, planned drills, and systems to manage and review changes and their impact. "
    }
  ]
}