{
  "FacilityID": 1000058344,
  "FacilityName": "Los Medanos Energy Center",
  "FacilityStr1": "750 East Third Street",
  "FacilityStr2": null,
  "FacilityCity": "Pittsburg",
  "FacilityState": "CA",
  "FacilityZipCode": "94565",
  "Facility4DigitZipExt": "2108",
  "FacilityCountyFIPS": "06013",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.029444",
  "FacilityLongDecDegs": "-121.872778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AS",
  "FacilityURL": "www.calpine.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 127334683,
  "ParentCompanyName": "Calpine Corporation",
  "Company2Name": null,
  "CompanyDUNS": 112710876,
  "Company2DUNS": 0,
  "OperatorName": "Los Medanos Energy Center",
  "OperatorStr1": "750 East Third Street",
  "OperatorStr2": null,
  "OperatorCity": "Pittsburg",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94565",
  "OperatorZipCodeExt": "2108",
  "RMPContact": "Victor Shaw",
  "RMPTitle": "General Manager",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000176034",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "B1866",
  "SafetyInspectionDate": "2020-11-18 00:00:00",
  "SafetyInspectionBy": "Contra Costa County HSD",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-12-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-08-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-08-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-08-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 38.03072,
  "FRS_Long": -121.87059,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000072876,
      "AltID": "Aqueous Ammonia for SCR",
      "FacilityID": 1000058344,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000074058,
          "ProcessID": 1000072876,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000089926,
          "ProcessID": 1000072876,
          "ChemicalID": 57,
          "Quantity": 129030.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000589926,
          "ProcessID": 1000072876,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000058344,
      "SummaryText": "Executive Summary\n\n\n\n1.1 Introduction \n\nCalpine Corporation operates the Los Medanos Energy Center (LMEC), a nominal 500 megawatt power plant located in Pittsburg, California. The Los Medanos Energy Center uses aqueous ammonia (24.5 percent solution) as a necessary part of reducing the emissions of nitrogen oxides to the atmosphere. Storing a large quantity of ammonia can be a hazard if it is not handled properly. As the company responsible for operating Los Medanos Energy Center, Calpine Corporation takes its safety obligations in storing and using ammonia as seriously as we take controlling emissions from the power plant. The following document describes what could happen if there were to be an accident, the steps we take every day to ensure a safely operating plant, and what to do in the event of an emergency.\n\n\n\n1.2 Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe Los Medanos Energy Center accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices. All applicable procedures of the State of California and U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.\n\n  \n\nCalpine Corporation recognizes the responsibility to make our environment, community and employee safety a primary part of our daily concerns. Calpine Corporation is committed to being a responsible member of any community in which it has operations by giving top priority to operating in a safe and environmentally sound manner. Calpine is dedicated to developing an environmentally responsible energy resource compatible with community needs. \n\n\n\nCalpine aims to protect and conserve California's valuable air and water resources, while providing a reliable source of low-cost electricity for residents and businesses. Calpine is committed "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000058344,
      "SummaryText": "to working closely with community members, environmental groups and local governmental agencies to meet its obligation to the community and to the environment.\n\n\n\nIt is the policy of Calpine Corporation that every employee is entitled to a safe and healthful place in which to work and live. Calpine Operations and Maintenance Departments incorporates the concepts of environmental responsibility and productivity with safety resulting in efficiency and productivity. As part of CalpineA?s obligation to protect the integrity of human, environmental, physical, and financial resources, and to conserve and efficiently utilize those resources, Calpine:\n\n\n\nA? Will comply fully with laws regulating environmental protection and employee health and safety\n\n\n\nA? Furnish work places free of recognized hazards likely to cause injury to employees, the public, or the environment\n\n\n\nA? Train employees in safe and environmentally conscious practices and require compliance with environmental, health and safety regulations, policies, and procedures\n\n\n\nA? Provide a professional staff to maintain and support environmental, health and safety programs\n\n\n\nCalpine Corporation has developed a corporate environmental program. The Calpine Western Regional Office is acting in the corporate environmental role and is responsible for developing, implementing and maintaining the environmental program at LMEC. LMEC staff verify and improve the safety and environmental program by implementing the Risk Management Prevention Program (RMP) requirements such as performing hazard reviews, maintaining current operating procedures, conducting training on the ammonia system, conducting compliance audits, and implementing procedures for process modifications.\n\n\n\nCalpine stresses safety and environmentally sound operations in its written documentation and training courses. Calpine has trained all of its personnel to be capable of operating the plant in a safe manner under any condition, including proper emergency"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000058344,
      "SummaryText": " response procedures as necessary. In addition to required training, the LMEC staff conducts regular safety meetings.\n\nAll manuals and procedures are available to employees at all times. The environmental, health and safety program at LMEC includes this CalARP RMP and the aqueous ammonia system manual.\n\n\n\nThis document complies with the EPA Risk Management Program under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68, and the California Accidental Release Prevention (CalARP) Program under California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5. This document summarizes our existing health and safety programs, our internal management response procedures, and ongoing actions that are designed to prevent or minimize impacts of accidental releases of ammonia to the environment. Los Medanos Energy Center has prepared an emergency action plan to handle any potential accidental releases.\n\n\n\n1.3 Facility Description and Regulated Substances Information\n\n\n\nThe Los Medanos Energy Center is located approximately 0.5 miles northeast of Pittsburg, California in Contra Costa County.  LMEC is situated on a 12-acre site at East 3rd Street, east of the intersection of East 3rd and Harbor. The facility sits on the northwest corner of property owned by USS-POSCO Industries. The plant is a merchant facility marketing electrical power on the open power exchange market and ancillary service support to the California Independent Systems Operator (CAL-ISO) grid. Lines owned by Pacific Gas and Electric transport electricity generated by this facility.  LMEC will provide steam and electricity to USS-POSCO and backup steam to Dow Chemical. \n\n\n\nThe facility currently stores aqueous ammonia, a regulated toxic substance under RMP and CalARP regulations, in two 10,000 gallon steel bulk storage tanks.  Ammonia is used at the Los Medanos Energy Center to reduce nitrogen oxides (NOx) created during the combustion of natural g"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000058344,
      "SummaryText": "as and exhaust from the two Combustion Turbine Generators (CTG) and Heat Recovery Steam Generators (HRSG) duct burners and one Auxiliary Boiler. Ammonia is pumped from a storage tank, diluted with exhaust gases, and injected into the two HRSG Selective Catalytic Reduction (SCR) units to reduce the NOx emissions. The Auxiliary Boiler utilizes air blowers for dilution and injection of the ammonia into the boilerA?s injection grid. Figure 1-1 shows a diagram of the aqueous ammonia process.\n\n\n\nAs indicated in the table below, the Los Medanos Energy Center stores and handles a maximum of approximately 129,000 lbs (17,000 gallons) of aqueous ammonia at a concentration of 24.5 percent. This exceeds the EPA RMP and CalARP thresholds of 20,000 pounds for concentrations greater than 20 percent based on the pounds of ammonia in solution (e.g., 31,612 pounds) using the following equation:\n\n17,000 gallons x 7.59 pounds/gallon x 24.5 percent solution\n\n= 31,612 pounds of aqueous ammonia\n\n\n\nTherefore this process is subject to CalARP and federal RMP regulations. Aqueous ammonia is used for selective catalytic reduction of NOx in the exhaust of Heat Recovery Steam Generators and Auxiliary Boiler at the Los Medanos Energy Center. Because it is not part of the NAICS codes listed by USEPA in 68.10(d), it is not subject to CalOSHA Process Safety Management (PSM) regulations (due to its concentration being less than 44 percent) and there are public receptors in the toxic endpoint zone for the worst-case release scenario for aqueous ammonia, the aqueous ammonia process falls into CalARP Program 2.\n\n\n\nHydrogen is also stored onsite, however the maximum quantity is well below the CalARP/RMP thresholds and is, therefore not subject to CalARP/RMP requirements.\n\n\n\n1.4 Offsite Consequence Analysis Results\n\n\n\nThis discussion is no longer required in the Executive Summary.\n\n                                                                                                                            "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000058344,
      "SummaryText": "                                                        \n\n1.5 Summary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\n\n\n1.5.1 Management System\n\n\n\nRisk Management Program regulations require those facilities with processes subject to Program 2 to develop a management system to oversee the implementation of the RMP elements. The management system must be assigned to a qualified person or position that will have the overall responsibility for the development, implementation, and integration of the RMP.  \n\n\n\nThe Los Medanos Energy Center has assigned the Operations Manager as the qualified person who will have the overall responsibility for the development, implementation, and integration of the RMP. The Operations Manager will be assisted by the EHS Manager and the Maintenance Manager in the implementation of the RMP. Table 1-1 provides the details of the responsibilities of the key personnel in the implementation of the RMP. \n\nIn addition to the management system described in Table 1-1, the RMP and changes to it are communicated by supervisors to staff through normal day to day interaction, refresher training, regular safety meetings, and the management of change procedures outlined in the Process Modification section of the prevention program.\n\n\n\nThe management system activities are further discussed below:\n\n\n\nPlanning : Los Medanos Energy Center has an environmental, health, and safety policy that clearly defines CalpineA?s goals and obligations.\n\n\n\nOrganizing : The Operations Manager is responsible for ensuring that written prevention procedures are in place and implements as described in the prevention program document.\n\n\n\nImplementing : The Operations Manager is responsible for implementing the Risk Management Program at Los Medanos Energy Center. The EHS Manager is responsible for arranging for and tracking training of staff.\n\n\n\nControlling : The EHS Manager is responsible for conducting the internal compliance audits of th"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000058344,
      "SummaryText": "e prevention program to ensure the procedures are being implemented by staff. Unless otherwise indicated, RMP records are maintained for five years. \n\n                                                                                                                                                                                  \n\n1.5.2 Chemical-Specific Prevention Steps\n\n\n\nThe prevention program elements described in the following section represent integrated administrative controls intended to ensure the safety of workers, the public, and the environment. The program elements such as hazard reviews, compliance audits, and incident investigation result in the development of additional safeguards. Some of the physical safeguards that are part of the original design and are already in place include the following:\n\n\n\nPressure Relief Valves.\n\nEach aqueous ammonia storage tank is furnished with a pressure/vacuum relief valve assembly. The valve is set to protect the tank from overpressurization and to limit vacuum in the tank to 2 ounces per square inch vacuum. A pressure reducing station with appropriate pressure regulator, pressure gauge, valves, piping, and fittings are provided. An external pressure relief valve returned back to the storage tank is supplied.\n\n\n\nTank Level Indication.\n\nHigh and low tank level switches are provided on the storage tanks. The high level switches are interlocked with the unloading pump. The low level switches are interlocked with the supply pumps. The level switches are wired to the local panel as well as the control room. The interlocks included do not allow the unloading pump to operate with a high tank level in either tank. \n\n\n\nSecondary Containment.\n\nThe ammonia storage tanks are located in containment area that is 37 feet 6 inches long by 37 feet 4 inches wide by 2 feet 10 inches high. This area is sufficient to contain the full contents of the ammonia storage tank.\n\n\n\nLeak Detection.\n\nPressure gauges are located on the inner and oute"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000058344,
      "SummaryText": "r shell of each ammonia tank to notify operators if there is a leak. The pressure gauges have local indication and indication in the control room. A high level switch with alarming function in the control room is provided for leak detection of the annular space of each storage tank.\n\n\n\nUnderground Containment Tank.\n\nThe ammonia unloading area has been designed so that any spillage of aqueous ammonia during an ammonia truck offload would be directed to a sump where it will be valved and piped to an underground containment tank.   Except during delivery of ammonia, the valve to the containment tank will be kept closed.  Rainwater collected on the unloading station will be pumped out as needed. The underground containment tank is equipped with a sump into which a submersible pump can be lowered to pump out the contents when required for disposal.\n\n\n\nEmergency Shower and Eyewash.\n\nTwo emergency showers and eyewash stations are located at the truck unloading station; within a few steps of the truck fill and vapor return connections. The emergency showers and eyewash stations employ activation switches that alarm in the control room when in use.\n\n\n\nStop Valve.\n\nTwo emergency stop valves are provided on the main liquid line on the tank suction. The valve position indication is wired directly to the DCS system. In the event of a fire or ammonia spill, the operator is to manually initiate a valve closure.\n\n\n\n1.5.3 Prevention Program Elements\n\n\n\nThe Los Medanos Energy Center accidental release prevention program is based on the following key elements:\n\n\n\n- Detailed management system and clear levels of responsibilities and team member roles\n\n\n\n- Comprehensive safety process information that is readily available to staff, emergency responders, and contractors\n\n\n\n- Comprehensive preventive maintenance program\n\n\n\n- A hazard review of equipment and procedures with operation and maintenance staff participation\n\n\n\n- Use of state-of-the-art process and safety equipment\n\n\n\n- Use of a"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000058344,
      "SummaryText": " for significant modifications to an existing covered process that requires a change in the process safety information. Los Medanos Energy Center provides a system and approach to maintain and implement management of changes or modifications to equipment, procedures, chemicals, and processing conditions. This system allows our employees to identify and review safety hazards or provide additional safety, process, or chemical information before the proposed change is implemented.\n\n\n\n1.6 Five-Year Accident History Summary\n\n\n\nEPA RMP regulations require reporting the five-year accident history of the covered processes.  The details of accidental releases are required for accidents that have caused at least one of the following:\n\n\n\nA? Onsite deaths, injuries, or significant property damage\n\n\n\nA? Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place\n\n\n\nLos Medanos Energy Center is a new facility and has had no accidents involving ammonia.\n\n\n\n1.7 Emergency Response Program Summary\n\n\n\nLos Medanos Energy Center has established a written emergency action program that is followed by the employees to help safely control accidental releases of hazardous substances.  PSM and RMP regulations require that an Emergency Action Plan be prepared for facilities that are not responding facilities. The plan must be prepared in accordance with the provisions of 8 CCR 3220, Emergency Action Plan.  The Emergency Action Plan described in this section is for facilities whose employees are not responders to emergency situations. This program has been coordinated (reviewed) by the CCCHSD and the Contra Costa County Fire Protection Department, which are members of the Local Emergency Response Planning Committee (LERPC).  Emergency operation and action procedures are also reviewed once per year. \n\n\n\nThe Contra Costa County Hazardous Materials Team is the designated first responder for Los Medanos Energy Center.  Calpine has coordinated response "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000058344,
      "SummaryText": "ccurate and effective operating procedures, written with operations and maintenance staff participation\n\n\n\n- High level of training of operators and maintenance staff\n\n\n\n- Implementation of an incident investigation, inspection, and auditing program using qualified staff\n\n\n\n1.5.4 Safety Information\n\n\n\nComplete and up-to-date safety information is required to successfully implement most RMP elements including hazard reviews, training, emergency planning and response, management of change, incident investigation, and compliance audits. RMP regulations require that information concerning process chemicals, process technology, and process equipment be compiled as part of a Prevention Program, prior to conducting a hazard review. This information is used to identify and understand the hazards in operating the ammonia process. The Operations Manager is responsible for compiling and maintaining the following up-to-date safety information related to the regulated substances, processes, and equipment.\n\n\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazards, and chemical exposure limitations, as well as detailed physical properties of aqueous ammonia.  Ammonia process information has also been prepared. This information was compiled from numerous sources and is intended to be a one-stop source for the reader seeking data about aqueous ammonia. This safety information is available in the Control Room library to LMEC employees at all times. This information includes:\n\n\n\n- Safety data sheets (SDS) for aqueous ammonia\n\n- Ammonia reaction chemistry\n\n- A description of the ammonia process\n\n- The process chemistry\n\n- A block flow diagram\n\n- A simplified process flow diagram\n\n- Piping and instrumentation diagrams\n\n- Maximum intended inventory\n\n- High temperature and low and high operating pressure operating limits for the storage tank\n\n- Low and high temperature operating limits for the ammonia flow control unit\n\n- High"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000058344,
      "SummaryText": " pressure operating limits for the liquid ammonia piping\n\n- Low and high flow operating limits for the ammonia process\n\n- Electrical system classification\n\n- Description of the storage tank relief system\n\n- Description of safety systems employed at LMEC including pressure relief valves, tank level indicators, secondary containment, leak detectors, underground containment tank, emergency stop valve\n\n\n\nCalpine evaluated the consequences of deviations from operating procedures in the hazard review and in Section 1.6.5 of the Prevention program. The operating procedures also contain consequences of deviation.\n\nCalpine also has scheduled reviews of our risk management program to update safety information if there is a major change that would make existing information inaccurate.  For example, when a major change is made to the ammonia process the Operations Manager will review and revise Section 1.0 (Safety Information) of the prevention program. All copies of the prevention program will then be updated. For contract projects, the engineering contractor will be required to produce or revise all RMP required safety information. The Operations Manager will verify that the information is accurate. The safety information will be retained for 5 years. All changes and revisions will then be communicated to all personnel who may be affected by the revision of the safety information.\n\n\n\nCalpine Corporation verifies that that equipment complies with recognized and generally accepted good engineering practices by specifying that the latest codes and standards be used for the design of the plant, conducting a seismic assessment to confirm that the process meets structural codes, and by reviewing the ammonia process in the hazard review. The primary codes and standards that were used for the ammonia system are provided in Table 1-2.\n\n\n\n1.5.5 Hazard Review \n\n\n\nThe intent of the hazard review is to provide information that will assist Los Medanos Energy Center staff in making decision"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000058344,
      "SummaryText": "s for improving safety and reducing the consequences of hazardous accidental releases.  A hazard review is a systematic effort to evaluate potential causes and consequences of accidental releases.  The hazard review focuses on equipment, instrumentation, utilities, human factors, and external events, including seismic events that might affect the process.  \n\nSeveral methodologies can be used to perform a Hazard Review or a Process Hazard Analysis as described in Guidelines for Hazard Evaluation Procedures, Second Edition with Worked Examples, Center for Chemical Process Safety of the American Institute of Chemical Engineers, 1992. For less complex systems, the What-if Analysis/Checklist method is commonly used. The What-If Analysis is a brainstorming approach in which the Hazard Review team identifies potential accidental release scenarios and recommendations for risk reduction.   The Checklist method uses industry checklists or checklists developed by staff familiar with the process. \n\nWith the concurrence of the Contra Costa County Health Services Department, the What-If Analysis/Checklist method was selected for evaluating potential accidental releases at Los Medanos Energy Center.   Calpine Corporation believes this approach provides the most detailed and applicable level of analysis, incorporating both general industry information and plant-specific knowledge.\n\n\n\nThe initial aqueous ammonia Hazard Review was performed at LMEC on November 2, 2000.  The Hazard Review team consists of process operating and maintenance personnel, health and safety personnel and engineers, a team with at least 45 years of experience in power plants.  This team includes LMEC staff with experience and knowledge specific to the process, and a Hazard Review facilitator or team leader knowledgeable in the specific Hazard Review methodology being used. The Hazard Review team leader is a licensed Chemical Engineer with 27 years of experience, including 19 years in industry and 8 years in c"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000058344,
      "SummaryText": "onsulting. He has led over 15 PHAs including 6 for ammonia systems. He has extensive experience in preparing PSM and RMP plans and audits including experience in preparing ammonia PSM programs for ammonia refrigeration, ammonia production, and cogeneration facilities. The LMEC Operations Manager represented operations staff and has 23 years of experience in power production and 2.5 years of experience with ammonia. The LMEC Maintenance Manager represented the maintenance staff and has 28 years of power plant experience including 2 years of recent experience in installation.\n\n\n\nThe Hazard Review team used a piping and instrumentation diagram to systematically identify causes of potential aqueous ammonia releases. Accidental release scenarios were identified based on the following considerations:  \n\nA? The hazards of the process,\n\nA? Previous incidents which had a likely potential for catastrophic consequences,\n\nA? Engineering and administrative controls applicable to the hazards and their interrelationships,\n\nA? Consequences of failure of engineering and administrative controls,\n\nA? Facility siting,\n\nA? Human factors, and\n\nA? Consideration of external events, including seismic events.\n\n\n\nA list of 44 external events (provided in Section 3) was reviewed to provide potential release scenarios.  Checklist questions for aqueous ammonia systems provided in EPAA?s Risk Management Guidance for Wastewater Treatment Plants, October 1998, were also used.  For each potential accidental release scenario identified by the Hazard Review team, onsite and offsite consequences were determined using a risk-ranking matrix.  This matrix provides a qualitative evaluation of risk based on the likelihood and severity of each potential accidental release scenario. Risk was evaluated assuming that existing accidental release controls and safeguards fail.  \n\n\n\nThe Hazard Review team brainstormed recommendations to reduce the risk of accidental aqueous ammonia releases for each significant rel"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000058344,
      "SummaryText": "ease scenario.  Significant release scenarios were defined as any accidental release that would probably occur during the lifetime of LMEC and could result in an onsite injury requiring medical treatment, or any offsite injury or death.\n\nIn support of the evaluation of seismic events, Calpine Corporation also conducted a seismic assessment of the ammonia process.  The purpose of the assessment is to provide reasonable assurance that a release of regulated substances having offsite consequences would not occur as a result of an earthquake. This seismic assessment was conducted in accordance with the provisions of Contra Costa County CalARP Program Guidance Document (June 1998) and Guidance for California Accidental Release Prevention (CalARP) Program Seismic Assessments (September 1998). The seismic assessment was conducted by a registered structural engineer with over 15 years of experience and included the following activities:\n\n\n\nA? Determining the seismic hazards.  The site-specific seismic hazard assessment address and quantify six separate earthquake effects.\n\n\n\nA? Performing a physical inspection of the existing facility.  The engineer performing the review systematically walked each equipment item, building, or system to look for potential seismic vulnerabilities.  The walkdown review emphad the primary seismic load resisting elements and the potential areas of weakness due to design, construction, or modification practices, as well as deterioration or damage.\n\n\n\nA? Performing an evaluation of existing structures, systems, and their foundations.  The CalARP program provides two procedures for establishing acceptance of these systems.\n\n\n\nA? Performing an assessment of equipment and non-structural elements. \n\n\n\nA? Performing an evaluation of tanks at grade.  Engineering judgement was used to determine the need for analytical evaluations.  The evaluations if necessary can be performed using any number of accepted methodologies.\n\n\n\nA? Performing an evaluation of "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000058344,
      "SummaryText": "above ground piping systems.  This is primarily accomplished by field walkthroughs.\n\n\n\nNo mapped traces of faults classified under the Alquist-Priolo Act cross the Los Medanos Energy Center.  The nearest mapped fault is the Great Valley fault, located approximately 5.3 miles away.  As no active faults are mapped onsite, the potential that sympathetic movements could occur along this fault because of a major earthquake is considered low. LMEC, including the aqueous ammonia system, was designed to meet seismic zone 4 requirements.  Other design codes and standards are listed in Section 1.5.4. \n\n\n\nA list of actions to resolve any significant findings from the analysis was prepared and included confirming vendor procedures, posting speed limits, posting unloading procedures, confirming maintenance procedures, and labeling the tank fill lines. No significant recommendations were made as a result of the seismic assessment.  Staff will document completion of each action item. A brief description of the process hazards, safeguards, and changes to the process associated with the Hazard Review and external events analyses is provided in Attachment A.\n\n\n\nA new Hazard Review, Seismic Assessment and Security and Vulnerability were conducted in November and December 2015. The Facilitator of the review was a licensed Chemical Engineer, from RMP Professionals. Participants included the Contra Costa Health Services Inspector, Maintenance Manager, EHS Specialist, and plant operating personnel. \n\n\n\nThe Hazard Review will be updated again within a 5-year period or whenever there is major change in the process.\n\n\n\n1.5.6 Operating Procedures\n\n\n\nLos Medanos Energy Center maintains up-to-date, accurate, written operating procedures that give clear instructions for the ammonia process. Effective operating procedures, when combined with operator training, are instrumental in ensuring safe operation of the systems and preventing accidental releases.  The procedures are developed from equipmen"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000058344,
      "SummaryText": "t manuals and the experience of the operations and maintenance staff. Procedures include startup, shutdown, and normal operations, abnormal (emergency) operations, emergency shutdown, and startup after emergency shutdown. The operating procedures also include safe work practices for hazardous material handling. The operating procedures are accessible to all staff and are maintained in the control room. Temporary operating procedures are not included because, at the present time, there are no expected conditions where temporary operating procedures would be needed. Normal and emergency operating procedures cover the anticipated operating conditions.\n\n\n\nAqueous ammonia is delivered to the Los Medanos Energy Center by a tanker truck that is able to provide approximately 40,000 pounds of ammonia. Deliveries are only accepted during daylight hours, Monday through Friday. The truck is escorted to the unloading pad and site personnel follow the unloading SOP including completion of the Aqueous Ammonia Receiving Checklist.\n\n\n\nModifications to Operating Procedures\n\n\n\nIf operating procedures require changing because of a modification to the process, they must be updated and recertified in accordance with management of change (MOC) procedures.  Changes that may require updating of operating procedures include changes in process chemicals, changes in process technology, and equipment and facility changes.\n\nIf the operating procedures must be modified, the Operations Manager or designee will be responsible for modifying the procedure. The Operations Manager will review the draft-revised procedures and sign the approval page.  The Operations Manager will forward the revised procedures to the General Manager for approval and signature. The Operations Manager must update all copies of the operating procedures. \n\n\n\nAfter completing this review, the Operations Manager will certify each operating procedure as accurate and reflective of current operating practice.  The date that the pr"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000058344,
      "SummaryText": "ocedures were modified will be listed on the first page of each operating procedure.  A memorandum shall be prepared summarizing who reviewed and modified the procedures, the dates the work was done, who reviewed the revisions, the rationale for the changes, and the date the revised procedures were approved by the Operations Manager.\n\n\n\nIf any operations or maintenance staff member believes that the operating procedures should be modified to improve system safety and reliability, that person shall notify their supervisor, who will determine if the procedures should be modified and, if modification is required, initiate the procedures previously described to modify the operating procedures.\n\n  \n\nAnnual Certification\n\n\n\nIf determined necessary, the Operations Manager will designate a senior operator from the process area who will annually review and update all operating procedures to confirm that they are current and accurate.  An example annual certification form is attached to the end of Section 3 of the Prevention Program. It is recommended that the following procedures be followed to annually certify the operating procedures:\n\n\n\n1. Demonstrate and Observe Operating Procedures. A manager or designee shall observe an operator executing all operating procedures. The staff member will use the plantA?s existing written operating procedures to check off each step as the operator is performing the procedures. If the actual procedure cannot be performed, the operator must verbally describe to the observer the procedures that would be followed to allow the observer to check the procedures.\n\n\n\n2. Address Deviations. The observer will note any deviations from the written operating procedures and ask the operator to discuss the reason for the deviations.  If the deviation is not justified, training or some other type of instruction shall be given to all operators to ensure that the specific existing written procedures are followed in the future. If the deviation appears justi"
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000058344,
      "SummaryText": "fied, then all Management of Change Procedures will be followed to assure considerations regarding the deviation such as impacts on safety, training, and process safety information are addressed. If all Management of Change Procedures are satisfied then the written operating procedures will be revised to reflect the deviation or change in procedures.\n\n\n\n3. Procedures to be Certified. All of the applicable operating procedures must be certified including the following:  \n\nA? Initial startup\n\nA? Normal operations\n\nA? Temporary operations (as applicable)\n\nA? Emergency shutdown and operations \n\nA? Normal shutdown\n\nA? Startup following a turnaround or after an emergency shutdown\n\n\n\n4. Related Procedures. The following elements relating to the operating procedures shall also be certified that they are current and accurate. See 40 CFR 68.69(a)(2-4) and 19 CCR Section 2760.3(c) for more details:\n\nA? Operating limits\n\nA? Safety and health considerations\n\nA? Safety systems and their functions\n\n\n\n5. Documentation. To document that certification has been done and each of the elements described in items 1 through 4 have been addressed, it is recommended that the form in Section 3 of the Prevention program document be completed. This form, like all RMP records, must be maintained on file for at least 5 years. It is not necessary to make a submittal to EPA regarding the certification.\n\n\n\nCommunication of Changes\n\n\n\nStaff designated by the Operations Manager will communicate revisions to the appropriate plant operations and maintenance staff.  If revisions are significant, a formal training session will be held to communicate the changes. The communication to plant operations staff shall be documented on a training roster. The Operations Manager will ensure that the operating procedures are updated if necessary whenever a major change occurs and prior to start up of the changed process.\n\n\n\n1.5.7 Training Program\n\n\n\nEach Los Medanos Energy Center employee presently involved in opera"
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000058344,
      "SummaryText": "ting or maintaining the ammonia process is trained in an overview of the process and applicable operating and maintenance procedures. Training helps employees understand the nature and cause of problems arising from operations involving ammonia, and increases employee awareness of the hazards. Los Medanos Energy CenterA?s training program includes both initial and refresher training that covers:  (1) a general overview of the processes, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices. Oral reviews and written self-evaluations are used to verify that an employee understands the training material before the process work can be resumed. \n\nTraining is also conducted on new and revised operating procedures in accordance with the operating procedures and management of change protocols. Whenever a significant change is made in a procedure, the management of change form is completed. This form requires that operations personnel be trained in the new procedures. The training will include rationale and background for the changes, step-by-step review of the procedure changes, and oral review or written evaluation that staff has understood the training.\n\n\n\nThe Operations Manager has overall responsibility for developing and maintaining the written Operator Training Program, associated training materials, and applicable training records.\n\nThe EHS Manager is responsible for ensuring that all required personnel at the facility complete and maintain all safety and environmental related training for his or her position and that all supporting documentation is filed in the Delta Projects central filing system. Supporting documentation includes training materials, training records, and proficiency verification records. \n\nTraining documentation includes:  date of most recent review or revision to the training program, type of training required and the type of competency testing used t"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000058344,
      "SummaryText": "o ensure staff understands the training.  Ongoing employee training records are maintained.  \n\n\n\n1.5.8 Maintenance\n\n\n\nLos Medanos Energy Center maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. Calpine believes that this program is the primary line of defense against a release.  Maintenance staff address equipment testing and inspection, preventative maintenance schedules, and personnel training of these procedures. Our maintenance program includes the following:\n\n\n\nA? Written procedures for maintaining mechanical integrity through inspection and testing of process equipment, based on instructions of equipment vendors (such as the Peerless Manual), industry codes, and prior operating experience\n\n\n\nA? Implementation of written procedures by performing inspections and tests on process equipment at specified intervals\n\n\n\nA? Training of maintenance personnel in safe work practices such as lockout/tagout, line or equipment opening, and avoidance and correction of unsafe conditions\n\n\n\nA? Procedures specifying training requirements for contract maintenance employees, as well as requiring contractors to use plant-developed maintenance procedures for process areas\n\n\n\nThe following ammonia equipment is included in the maintenance program at Los Medanos Energy Center: \n\nA? Ammonia unloading station\n\nA? Ammonia storage tanks and pumps\n\nA? Ammonia vaporizer\n\nA? Ammonia injection grid\n\nA? Process piping \n\nA? Controls  \n\n\n\nLos Medanos Energy Center staff will use a computerized facility asset management program by the name of Maximo. Maximo is a proven software program that will assist staff by managing the corrective, preventive, and predictive maintenance tasks at our facility. It also provides inventory control and asset cost analysis for the plant and its systems. \n\n\n\nTypically, most corrective maintenance tasks will be generated in the form of a work request generated by the "
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000058344,
      "SummaryText": "shift operators. The Maintenance Manager will review the work requests daily for validity and authorize a work order. Each work order is sequentially numbered by the Maximo system. These work orders will be stored electronically in the Maximo program to be completed by the Maintenance Department as scheduling permits.\n\n\n\nPreventive and predictive maintenance tasks will be generated automatically in the form of work orders from the Maximo program. These tasks will also be stored electronically in the Maximo program to be completed by the Maintenance Department as scheduling permits. The preventive and predictive maintenance tasks will be developed utilizing equipment vendor recommended and best maintenance practices techniques. Maintenance procedures will be reviewed annually by the Maintenance Manager or designee to evaluate whether the procedures need to be modified.\n\nMaintenance tasks include inspecting pump bearings, calibrating meter, gauges, and transmitters annually, visually inspecting control valves, cleaning strainers, and checking piping for leaks.  Structural components are inspected by using an aqueous ammonia maintenance checklist. Table 1-3 lists maintenance activities some of which are used to maintain the structural integrity of the ammonia process.\n\n\n\nPreventive maintenance records are maintained on file for review as needed. Los Medanos Energy Center maintains records of all critical equipment maintenance activities and maintenance schedules, including inspection and testing activities, for the life of each process. Maintenance records are completed by maintenance personnel and include the following as applicable:\n\nA? Equipment name and reference number\n\nA? Date and description of maintenance activity\n\nA? Name and signature of person performing maintenance activity\n\nA? Name of procedure followed\n\nA? Results of maintenance activity and minimum criteria for acceptability\n\nA? Summary of actions required to correct any deficiencies\n\n\n\nThe Maintenance M"
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000058344,
      "SummaryText": "anager and Operations Manager will control quality assurance for spare parts and replacement equipment. The maintenance personnel will order only replacement parts specified by the original manufacturer or that meet the specifications contained on the process drawings and in the equipment files. All maintenance personnel are responsible for verifying replacement part numbers, ratings, and materials of construction against manufacturer procedures and equipment specifications. The replacement part, manufacturer, and/or specifications cannot be substituted without approval by the Maintenance Manager who is required to evaluate whether any suggested change of an equipment part or manufacturer still satisfies the original equipment specifications and does not constitute a change under the management of change procedure. Any suggested substitution that constitutes a change will first be subject to the management of change procedure described in Section 8.1 of the Prevention Program. Spare parts are stored in original containers until ready for use.\n\n\n\nFor new capital construction projects, the facility must ensure that equipment, as it is fabricated, is acceptable for the process application in which it will be used. This includes a review of the acceptable operating ranges (e.g., pressure, temperature, etc.) materials of construction, and any applicable codes or standards. The facility will perform inspections of new equipment to verify proper installation and consistency with all design specifications.\n\n\n\nMaintenance Training\n\n\n\nInitial and refresher training is provided to all employees before they are allowed to service ammonia system processes. In addition to the initial classroom training as part of the RMP, maintenance personnel receive on-the-job training, and specific training to maintain covered equipment by the equipment vendor.\n\n\n\n1.5.9 Internal Compliance Audits\n\n\n\nInternal compliance audits are conducted every three years to verify compliance with the progra"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000058344,
      "SummaryText": "ms and procedures contained in the RMP. The EHS Manager will assemble a team that includes at least one person knowledgeable in the ammonia process and an audit leader knowledgeable in RMP requirements and audit techniques.  A person is considered knowledgeable if they have operated or maintained the ammonia process for more than one year or have prepared RMPs for ammonia systems. An outside consultant or an internal team may be used to perform the compliance audit.\n\nThe audit team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation.   A series of questions on a Compliance Audit Questionnaire will be answered by conducting equipment inspections, record reviews and interviews.   \n\nThe audit team will summarize the results of the compliance audit in a Compliance Audit Report of Findings.  The report will record RMP program deficiencies identified by the team, the corrective actions to be taken, the staff assigned to implement the corrective actions, and the target completion date.  All identified corrective actions will be assigned by the Operations Manager to the appropriate staff for follow-up.  MOC procedures will be followed before corrective action is taken.  \n\nIt will be the responsibility of the EHS Manager to ensure all audit corrective actions are resolved or implemented in a timely manner and the resolution thoroughly documented.  The documentation shall include a summary of the corrective action taken, the staff member implementing the action, and the date completed.  Whenever a corrective action is not implemented, a written explanation will be prepared explaining why the action is no longer appropriate or no longer applicable.\n\n\n\n1.5.10 Incident Investigation\n\n\n\nEach incident that resulted in or could reasonably have resulted in a catastrophic release of aqueous ammonia must be investigated. The site shall utilize incident investigation procedure"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000058344,
      "SummaryText": "s as defined in SHP-9, Injury Management.  These procedures cover the RMP regulated process (aqueous ammonia) at Los Medanos Energy Center.  This procedure applies to all incidents that result in or could have resulted in a catastrophic release.  A catastrophic release is defined as a major uncontrolled emission, fire, or explosion involving one or more regulated substances that presents imminent and substantial endangerment to public health and the environment or presents serious danger to employees at the Los Medanos Energy Center.  CalpineA?s policy is to go further and investigate all reportable releases as well.\n\nThe purpose of this section is to summarize the process described in SHP-9 that will be used to identify the underlying causes of incidents and implement procedures to prevent similar events from occurring in the future.\n\nIncident Investigation Team. \n\nThe Operations Manager and/or EHS Manager shall establish an incident investigation team to investigate the incident.  The investigation team should include:\n\nA? The Operations Manager\n\nA? The Maintenance Manager \n\nA? The EHS Manager\n\nA? A member of the contractorA?s staff if the incident involved a contract employee\n\nA? A member of the Contra Costa Fire Department and/or a member of the CCCHSD Hazmat/CalARP team for a catastrophic release, if appropriate.\n\nOther members may be assigned to the Incident Investigation Team as deemed appropriate.\n\n\n\nIncident Investigation Process. \n\nThe investigation process is initiated with the report of the incident to the Operations Manager by the staff involved in the incident. The Operations Manager and Maintenance Manager shall be notified of the incident immediately after it occurs.  Refer to the Internal Notification Chart located in the EAP for additional notifications. When appropriate emergency response actions have stabilized the situation and conditions onsite are safe, the Operations Manager shall begin the investigation and serve as the leader of the investi"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000058344,
      "SummaryText": "gation.  The investigation must begin within 48 hours after the incident occurred.  The investigation team, as a group, will investigate the incident by:\n\nA? Interviewing staff involved in the incident\n\nA? Interviewing other staff who have knowledge about the process that may be helpful in the investigation\n\nA? Checking records such as alarm printouts\n\nA? Discussing the incident as a group\n\nA? Physically examining the process\n\nCalpine has complied a series of questions to help the investigation team identify some of the less obvious ways of preventing incidents. These questions may include:\n\nWHAT equipment failed?\n\nA? How can the failure be prevented or made less likely to occur?\n\nA? How can the approaching failure be detected?\n\nA? How can the failure be detected once it occurs?\n\nA? How can the consequences of the failure be mitigated?\n\nWHICH behavior failed? (Consider behavior of those who could operate, manage, supervise, train, check, and design better.)\n\nA? What did we fail to do?\n\nA? How can the failure be prevented or made less likely to occur? (Consider training, instructions, checking, etc.)\n\nWHICH material leaked, reacted, or exploded?\n\nA? What is the purpose of the material?\n\nA? What material could be used instead?\n\nAs part of the incident review, human error that may have contributed to the incident will also be reviewed. Such error may be classified as follows:\n\nA? Failure to perform a required function\n\nA? Performed required function out of sequence\n\nA? Performed an unnecessary function\n\nA? Failure to recognize a hazardous condition requiring correction\n\nA? Inadequate or inappropriate response to a contingency\n\nA? The wrong decision made to solve the problem\n\nA? Poor timing\n\nA determination will be made as to whether the error can be corrected by instituting general or specific safeguards for the process, or whether it is necessary to institute additional training for employees.\n\n\n\nIncident Investigation Report.\n\nThe Incident Investigation Team findings"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000058344,
      "SummaryText": " are inputted into the Calpine Incident Collection System (CICS). CICS serves as a central database for maintaining and communicating all near miss and injury related events throughout Calpine. The collection system consists of modules for providing details, defining contributing factors, and determining root causes. A seperate module called CAPA (Corrective Actions/Preventative Actions) is used to develop assignments and target dates for recommendations that are identified by the Incident Investigation Team. These recommendations are also disseminated throughout the Calpine Fleet in the form of a summarized Lessons Learned Bulletin.\n\nThe recommendations in CAPA will then be assigned by the Operations Manager to the appropriate staff (operations, maintenance, or engineering personnel) for prompt follow-up. Recommendations often require additional evaluation to determine if they are technically and/or economically feasible; therefore, the Operations Manager shall also list the target evaluation date, resolution and resolution date for each recommendation. It is the responsibility of the Operations Manager to ensure all recomendations are properly resolved and documented in the incident investigation report. Whenever a recommendation is not implemented, a written explanation of its exclusion shall be documented. The incident investigation shall be considered complete once all recommendations are resolved and documented.\n\nAny proposed changes to the covered process must be eviewed in accordance with the Management of Change procedures. Following these procedures will aid in identifying changes that will affect other sections of the plant.\n\n\n\nRecordkeeping\n\nAll written documentation, photographs, and/or drawings related to an incident investigation shall be retained by the EHS Manager for a minimum of 5 years.\n\n\n\n1.5.11 Process Modifications \n\n\n\nLos Medanos Energy Center ensures that a pre-startup safety review is completed for any new regulated process at the plant, or"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000058344,
      "SummaryText": "actions with response agencies by the following activities:\n\nA? Submitting the Hazardous Materials Business Plan to the County on May 24, 2001\n\nA? Conducting the Hazard Review of the aqueous ammonia process with CCCHSD staff\n\nA? Contacting the Chief of Operations for the Contra Costa County Fire Protection District on June 7, 2001\n\nA? Submitting the Hazardous Materials Business Plan and Hazardous Waste Contingency Plan to local responders (fire, police, ambulance) and the land owner\n\nA? Inviting local responders to tour the plant and the ammonia system\n\nA? Reviewing the Contra Costa County Hazardous Materials Area Plan and providing comment, as appropriate.\n\nA? Calpine Operations Managers have participated in CAER planning and drills at Calpine facilities in the past. Calpine will consider participating in future drills.\n\n\n\nIn the event of a leak of ammonia, the highest-ranking operations person must be notified immediately.  If personnel are near the area of the leak, they should leave the area before contacting the highest-ranking operations person.  In order of rank, the highest ranking operations person at Los Medanos Energy Center include the following:\n\n1. General Manager: Chris German \n\n2. Operations Manager: Jeff Krupp  \n\n3. Maintenance Manager: Rick Lloyd \n\n4. EHS Manager: Jeff Sorenson \n\n\n\nThe Operations Manager or shift supervisor will be the Emergency Response Coordinator (ERC) in charge of the site-specific Incident Command System (ICS) until the Contra Costa County Fire Protection Department or County HAZMAT team arrives.  At this time, the ERC will pass the responsibility to the senior member of that team.  If the evacuation route is through the main site road and if it is believed that the release is not traveling toward the main site road, the Emergency Evacuation Coordinator (EEC) will meet the Fire Department or HazMat team at the plant entrance on 3rd Street.  The EEC will provide the emergency responder with any available updated information reg"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000058344,
      "SummaryText": "arding the release.  If time allows, the EEC should bring a copy of the site plan with him or her before evacuating the plant to allow the emergency responders to locate the chemical storage tank.  All emergency responders and their communications are coordinated and controlled through the individual in charge of the ICS.\n\nNote: The A?senior officialA? at an emergency response is the person on the site who has the responsibility for controlling the operations at the site.  Initially, it is the first senior officer to arrive on the incident scene.  As higher-ranking officers arrive (e.g., battalion chief, fire chief, state law enforcement official, site coordinator), the responsibility is passed up the line of authority that has been established.\n\n\n\nThe individual in charge of the ICS should identify, to the extent possible, all hazardous substances or conditions present and address maximum exposure limits of the released chemical, hazardous-substance handling procedures, and use of any methods used to control leaks. The Contra Costa Hazardous Materials Area Plan provides procedures for initiating the Community Warning System (CWS). The CWS sirens will be requested by the incident commander or unified command, through consultation with the Hazardous Materials Incident Response Team. The Hazardous Materials Incident Response Team can initiate the CWS in their office or in the field via laptop computer.\n\nIf a controlled shutdown cannot be implemented, the Emergency Operation procedures in the aqueous ammonia system operation procedures shall be followed.\n\n\n\nThe ammonia unloading area has been designed that any spillage of aqueous ammonia would be directed to a sump where it will be valved and piped to an underground containment tank.   Except during delivery of ammonia, the valve to the containment tank will be kept closed.  Rainwater collected on the unloading station will be pumped out as needed.  The underground containment tank is equipped with a sump into which a "
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 1000058344,
      "SummaryText": "submersible pump can be lowered to pump out the contents when required for disposal.\n\n\n\n1.8 Planned Changes to Improve Safety\n\n\n\nA number of studies and inspections have been conducted or will soon be conducted to improve the safety of the ammonia process at Los Medanos Energy Center including:\n\nA? The hazard review in November 2000\n\nA? A revalidation of the hazard review conducted December 16, 2010\n\nA? The seismic assessment in May 2001\n\nA? A followup seismic assessment conducted July 19, 2011\n\nA? A safety inspection by the Contra Costa County Fire Protection District in February 2001 \n\nA? A walkdown of the process scheduled in June 2001 to confirm the system was installed as designed\n\n\n\nDuring these studies and inspections, several additional risk reduction measures were recommended to improve safety at Los Medanos Energy Center.  Details of the recommendations from the hazard review and the seismic assessment can be found in the prevention program document and in Section 4 of this document, respectively.  The risk reduction measures include posting speed limits near the ammonia tanks, posting the unloading procedure near the tank, and confirming that the ammonia vendor has a preventive maintenance program for the delivery truck hoses."
    }
  ]
}