{
  "FacilityID": 1000009626,
  "FacilityName": "Edgewater Wastewater Treatment Plant",
  "FacilityStr1": "500 West Ocean Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Edgewater",
  "FacilityState": "FL",
  "FacilityZipCode": "32132",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "12127",
  "LEPC": null,
  "FacilityLatDecDegs": "28.983889",
  "FacilityLongDecDegs": "-080.913333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I7",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Edgewater",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dennis Norman",
  "OperatorStr1": "500 West Ocean Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Edgewater",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "32132",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis Norman",
  "RMPTitle": "Superintendent of Wastewater",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000135935",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-06-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-02-22 00:00:00",
  "DeRegistrationEffectiveDate": "2013-02-18 00:00:00",
  "AnniversaryDate": "2014-07-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 28.98275,
  "FRS_Long": -80.93233,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "No Longer using Chlorine Gas and Sulfur Dioxide",
  "_processes": [
    {
      "ProcessID": 1000011333,
      "AltID": "Chlorine",
      "FacilityID": 1000009626,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011713,
          "ProcessID": 1000011333,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012959,
          "ProcessID": 1000011333,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000012960,
          "ProcessID": 1000011333,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512959,
          "ProcessID": 1000011333,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512960,
          "ProcessID": 1000011333,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009626,
      "SummaryText": "                      RISK MANAGEMENT PLAN\n                       EXECUTIVE SUMMARY\n                                \n                       CITY OF EDGEWATER\n                   WASTEWATER TREATMENT PLANT\n                                \n                                \nBACKGROUND\n\nThe City of Edgewater Wastewater Treatment Plant (WWTP) is firmly committed to providing\nexcellent service to its customers while protecting the safety of its neighbors and the surrounding environment.  In order to cleanse the processed water of any bacteria, pathogens, or viruses, the Edgewater WWTP uses chlorine to disinfect water at its modern facility located in Edgewater,\nFlorida.\n\nChlorine is one of the best disinfection substances currently produced and has the advantage of remaining in water as a residual to continue to disinfect any bacteria that may come in contact with the wastewater in the pipe lines.  Like other wastewater utilities, the WWTP is required to safely store the chlorine gas.  Chlorine gas is relatively inexpensive and operators are very familiar with handling chlorine.  Chlorine is stored under pressure in the liquid form in special chlorine cylinders.  A maximum of 4 tons of chlorine is typically stored at the wastewater treatment plant, and new deliveries of chlorine are made monthly.\n\nSulfur dioxide is used to remove the chlorine from the recycled wastewater prior to discharging the water back to the environment.  Like other wastewater utilities, the WWTP is required to safely store the sulfur dioxide gas.  Sulfur dioxide is very efficient at removing chlorine from the water.  A maximum of 3 tons of sulfur dioxide is stored at the wastewater treatment plant, and new deliveries of sulfur dioxide are made monthly.\n\nChlorine gas and sulfur dioxide are respiratory irritants and potentially toxic, and to minimize the potential for a chlorine leak a Risk Management Program has been established by the City of Edgewater Wastewater Treatment Plant to minimize the risk o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009626,
      "SummaryText": "f chlorine or sulfur dioxide gas release to the surrounding environment.  The City of Edgewater Wastewater Treatment Facility has never had an accidental chlorine or sulfur dioxide release with offsite consequences and in fact, they are rare in the wastewater treatment business.\n\nThe absolute worst case scenario as defined by EPA is for the contents of the chlorine container or a sulfur dioxide container to be released over a 10 minute period.  A faster or slower release time will likely result in a smaller chlorine gas or sulfur dioxide plume.  For the worst case scenario, the wind is nearly calm, the release occurs at night, the atmosphere is extremely stable,and no actions are taken to stop the leak.  The maximum distance this plume could reach and still cause possible long term physical damage to a person who does not evacuate is 3 miles for chlorine and 3.1 miles for sulfur dioxide. An alternative worst case scenario was also analyzed by the EPA, using more typical release rates, temperature, wind speed, and atmospheric stability. This results in a chlorine plume with an endpoint of 0.6 miles or a sulfur dioxide plume with an endpoint of 0.4 miles assuming no actions are taken to stop the leak.  For planning purposes, all residents within 0.6 miles from the chemical source in the direction of the wind will be notified immediately with emergency instructions in the unlikely event of an uncontrolled release of chlorine or sulfur dioxide gas.   \n\nThe Environmental Protection Agency (EPA) published 40 CFR, 68, Risk Management Planning\nAccidental Release Prevention Regulations, in June 1996 to implement Section 112 (r)(7) of\nthe Clean Air Act.  Risk Management Plans (RMPs) are required by organizations that exceed a threshold amount of a regulated hazardous chemical to help prevent accidents, operate safely, and to manage the chemicals safely.  The reporting threshold for chlorine gas is 2000 pounds and for sulfur dioxide it is 5000 pounds.  The Risk Management Plan"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009626,
      "SummaryText": " will be made available to the public so that communities can determine if any additional safeguards should be made.Completion of a RMP will also provide the majority of the requirements of the Occupational Safety and Health Administration (OSHA) Process Safety Management standard enacted in 29 CFR 1190.119.\n\nThe Risk Management Program established by the City of Edgewater Wastewater Treatment\nFacility is designed to minimize the risk of a chlorine or sulfur dioxide leak by establishing numerous controls to assess and prevent any possible hazards.  Some of the measures taken to ensure safety include:\n\nA?    Extensive operator training on the operation and handling of all chlorine and sulfur\n     dioxide equipment\nA?    Mock chemical emergency drills\nA?    Preventive maintenance and testing program\nA?    Automatic chlorine leak detectors and sulfur dioxide detectors for instantaneous leak\n     notification\nA?    Well designed chlorine and sulfur dioxide systems which operates under a vacuum,\n     causing air to leak into the system in the event of a leak\nA?    Maintaining the minimum inventory practical\nA?    Using the latest technology equipment\n\nThe City of Edgewater Wastewater Treatment Plant is a modern facility containing reliable\nequipment. The professionals operating the facility are experienced and well trained.  The\nemployees take great pride in serving the City of Edgewater and are dedicated to providing\noutstanding, safe service.\n"
    }
  ]
}