{
  "FacilityID": 1000077151,
  "FacilityName": "Lucas Water Treatment Plant",
  "FacilityStr1": "1321 Narrows Road",
  "FacilityStr2": null,
  "FacilityCity": "Glasgow",
  "FacilityState": "KY",
  "FacilityZipCode": "42141",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "21009",
  "LEPC": "Barren County LEPC",
  "FacilityLatDecDegs": "36.899167",
  "FacilityLongDecDegs": "-086.064167",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": "www.glasgowh2o.com",
  "FacilityEmailAddress": "lancecrimmins@glasgow-ky.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Glasgow Water Company",
  "Company2Name": null,
  "CompanyDUNS": 156252399,
  "Company2DUNS": 0,
  "OperatorName": "Glasgow Water  Company",
  "OperatorStr1": "301 West Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Glasgow",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42141",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lance Crimmins",
  "RMPTitle": "Safety Manager",
  "FTE": 4,
  "OtherEPAFacilityID": "KY-0050929A",
  "EPAFacilityID": "100000095844",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-03-04 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.8985,
  "FRS_Long": -86.05715,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "52.3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000095989,
      "AltID": "Water supply",
      "FacilityID": 1000077151,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000097272,
          "ProcessID": 1000095989,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120207,
          "ProcessID": 1000095989,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000620207,
          "ProcessID": 1000095989,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077151,
      "SummaryText": "Background\n\n\n\nThe Glasgow Water Company, located in Glasgow, Kentucky, operates the Lucas Water Treatment Plant (WTP).  The facility is subject to the requirements of the EPA's Risk Management Plan rule in accordance with Section 112(r) of the Clean Air Act (CAA).  The WTP provides the City of Glasgow and surrounding areas with potable water for human consumption.\n\n\n\nThe company takes its role as a responsible member of the community very seriously.  Glasgow Water Company facilities are operated to protect employees, contractors, and the public from injury and illness, as well as to minimize environmental impact.  Glasgow Water Company's policy is to inspect, maintain, and operate equipment and facilities to prevent incidents, including the release of hazardous materials, and to train employees in prevention of incidents.  Glasgow Water Company has developed and implemented a Process Safety Management (PSM) program and Risk Management Plan (RMP) at the Lucas WTP as part of an overall chemical management program.  These programs involve GWC management, the WTP superintendent, and the plant operators to ensure that all personnel are involved in the safe operation of the process.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Lucas WTP has developed PSM and RMP programs as part of the overall chemical management program.  The program involves the superintendent and all operators at the facility.  Lucas WTP personnel also provide safety training to staff as part of the accidental release prevention program.\n\n\n\nDescription of Facility and the Regulated Substances\n\n\n\nThe Lucas WTP is located at 1321 Narrows Road near Lucas, Kentucky, approximately 10 miles southeast of Glasgow.  The Lucas WTP withdraws and treats water from Barren River Lake for distribution of potable water to the surrounding areas.\n\n\n\nThe Lucas WTP utilizes a Wallace & Tiernan vacuum operated, automatic switch over, gaseous feed system.  Four 1-ton containers of chlorine are piped"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077151,
      "SummaryText": " together to provide uninterrupted flow of chlorine.  The maximum inventory at the WTP includes six 1-ton chlorine containers (12,000 lb), however only four of those containers (8,000 lb) can be in process use at any given time. Two in-use containers and two full standby containers are piped together and situated on the scale apparatus.  Up to two full, unconnected containers of chlorine may also be stored within the same room awaiting use.   The maximum amount of chlorine on-site at one time should be less than 12,000 pounds.   Currently, the feed rate for chlorine ranges from approximately 200-700 pounds per day.\n\n\n\nGeneral Accident Release Prevention Program\n\n\n\nThe Lucas WTP maintains a Process Safety Management (PSM) of Highly Hazardous Chemicals plan prepared in accordance with the Occupational Health and Safety Administration (OSHA) regulation 29 CFR 1910.119.  The WTP also utilizes preventative maintenance programs for its system components.  The preventative maintenance program for the chlorination system is conducted in conformance with recommendations from the equipment manufacturers and from the Chlorine Institute.\n\n\n\nFive-Year Accident History\n\n\n\nThere have been no process-related accidents within the last five years at the Lucas Water Treatment Plant.\n\n\n\nEmergency Response Program\n\n\n\nThe Lucas WTP has implemented an Emergency Action Plan in accordance with OSHA PSM regulations.  The facility will rely on the Glasgow Fire Department to respond in the event of a hazardous material release, fire, or other emergency situation.  The written Emergency Action Plan contains specific information regarding evacuation and notification procedures in the event of a catastrophic chlorine release.  The Glasgow Fire Department has conducted a reconnaissance of the facility and trained personnel are ready to respond if requested.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe Lucas WTP has implemented mechanisms to ensure compliance and encourage the continuing improvement"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077151,
      "SummaryText": " of its chemical safety programs, such as management of change, pre-startup safety reviews, compliance audits, employee involvement, etc.\n\n"
    }
  ]
}