{
  "FacilityID": 1000039691,
  "FacilityName": "Polycell Packaging Corporation",
  "FacilityStr1": "12719 H street",
  "FacilityStr2": null,
  "FacilityCity": "Biola",
  "FacilityState": "CA",
  "FacilityZipCode": "93608",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06019",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.801000",
  "FacilityLongDecDegs": "-120.019806",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A4",
  "LatLongDescription": "NE",
  "FacilityURL": "www.polycellPKG.com",
  "FacilityEmailAddress": "polycell1@aol.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ryan Hsu",
  "OperatorStr1": "12851 Midway Place",
  "OperatorStr2": null,
  "OperatorCity": "Cerritos",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90703",
  "OperatorZipCodeExt": "5225",
  "FTE": 35,
  "OtherEPAFacilityID": "CAL 000267313",
  "EPAFacilityID": "100000175847",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-11-07 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-03-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-03-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-03-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-03-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 36.80105,
  "FRS_Long": -120.01653,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000048843,
      "AltID": "Foam extrusion",
      "FacilityID": 1000039691,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000059253,
          "ProcessID": 1000048843,
          "ChemicalID": 107,
          "Quantity": 65224.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000059254,
          "ProcessID": 1000048843,
          "ChemicalID": 98,
          "Quantity": 65224.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000049265,
          "ProcessID": 1000048843,
          "NAICSCode": "32419",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000039691,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-09-23 00:00:00",
    "ERTrainingDate": "2013-09-30 00:00:00",
    "CoordinatingAgencyName": "North Central Fire District",
    "CoordinatingAgencyPhone": "5592755531",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "San Joaquin Valley Air Poultion Control District"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000039691,
      "SummaryText": "Attached file name: RMP_ES09.doc\r\n\r\nExecutive Summary\r\nPolycell Packaging Corp.\r\nBiola, California\r\n\r\nThe employees and management of Polycell Packaging Corporation strive to conduct its business in compliance with all applicable health, safety, and environmental rules, laws, and regulations. The health and safety of our employees, customers, and communities are among our primary concerns. Polycell is committed to provide a safe work environment, to promote the safe design, use and handling of Polycell¿s products and to comply with the laws relating to the protection of the environment. Each employee is expected to promote these goals in their everyday tasks.\r\n\r\n\r\nPolycell¿s Biola facility manufactures polyethylene foam products using an extruder. The extruder performs three distinct functions: melts and plasticizes the polyethylene, disperses and mixes the blowing agent with polyethylene, and cools the mixture sufficiently to prevent cell collapse when the material is extruded through dies. Polyethylene resin pellets are melted in the extruder. The blowing agent (isobutane or propane) is pumped into the extruder under high pressure. Once the polyethylene/blowing agent mixture leaves the dies, the mixture is no longer under pressure. The blowing agent is stored in an approved pressure vessel as non-odorized liquid petroleum under pressure of 125 psi max. The liquid is pumped at low pressure to high pressure metering system controls which controls the flow of the blowing agent into the extruder.\r\n\r\nThe facility has one liquid petroleum storage tank rated at 250 psi and has a water capacity of 15,768 gallons. The worst case release scenarios and the alternative scenarios: \r\n\r\nA flammable worst case scenario assumes a butane vapor cloud explosion using EPA RMP-comp guidance for a liquid propane storage facility. The calculated endpoint distance with the release of the full storage vessel (65,224 lbs) with a 1 psi endpoint is 0.03 miles or (1584 ft). The estimated resid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000039691,
      "SummaryText": "ent population at that distance is 90 people. The likelihood of vapor cloud explosion with a full release is possible but highly unlikely. The more possible scenario would be a leak of the piping at the storage tank. As an alternate scenario, we have considered the rupture of a pipe with a release rate of 736 pounds for 10 minutes, creating a vapor cloud explosion. The estimated distance to 1 psi over-pressure endpoint would be 0.01 miles or 264 feet. The estimated residential population would be 15 people.\r\n\r\nThe general accidental release prevention program and prevention steps include:\r\nA) Employee education and training\r\nB) All employees receive initial and yearly refresher training in our hazardous communication program, and spill response plans\r\nC) Incident investigation procedures are followed in addressing areas of concern\r\nD) An emergency action plan is used to document and train employees to handle non-routine situations\r\nE) Daily inventory reconciliation of the blowing agent tank is conducted\r\nF) Maintenance personnel physically inspect the blowing agent system each shift (2-times per day) and inspect the hazardous material storage area.\r\nG) The blowing agent equipment is equipped with electronic sensors which are monitored 24 hours per day by plant personnel and a private security firm.\r\nH) The blowing agent tank is coated with fire protective material which is rated for 2 hours and a water deluge protective system.\r\nI) The blowing agent equipment and tank is protected by an assortment of physical barriers.\r\nJ) The blowing agent equipment and tank are installed under the recommendations of the National Fire Protection Association Codes 58 and 70.\r\n\r\nThe fire year accident history: We have had no accidental releases of the blowing agent in the past five years. An accidental release is a spill of 500 pounds or more of the blowing agent.\r\n\r\nPolycell Packaging Corp-Biola has developed its Emergency action Plan to protect employees and the citizens of Biola f"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000039691,
      "SummaryText": "rom fire and other emergencies. It provides a written document for detailing procedures to be followed in an emergency. These plans have been developed with, and to meet, regulation 1910.38(a). At the time of an emergency, employees have been trained to know what type of evacuation is necessary and what their role is in carrying out the plan. In some cases, when the emergency is very grave, total and immediate evacuation of all employees from the plant is necessary. In other emergencies, a partial evacuation of nonessential employees, with a delayed evacuation of others, may be necessary for continuation of plant procedures.\r\n\r\nPolycell Packaging Corp.-Biola has a very robust environmental health safety program that is driven by active employee participation. Weekly and monthly inspections and training programs are on-going events that contribute to our commitment to create a safe and healthy work environment.\r\n\r\nCertification Statement:\r\nTo the best of the undersigned¿s knowledge, information, and belief formed after reasonable inquiry, the information submitted is true, accurate, and complete.  \r\n\r\nRyan Hsu     03/10/2014\r\nGeneral Manager"
    }
  ]
}