{
  "FacilityID": 1000000814,
  "FacilityName": "Triclad, Inc.",
  "FacilityStr1": "660 Forest Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sheboygan Falls",
  "FacilityState": "WI",
  "FacilityZipCode": "53085",
  "Facility4DigitZipExt": "1588",
  "FacilityCountyFIPS": "55117",
  "LEPC": "Sheboygan LEPC",
  "FacilityLatDecDegs": "43.743889",
  "FacilityLongDecDegs": "-087.809722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.fassepaint.com",
  "FacilityEmailAddress": "info@fassepaint.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Fasse Paint Co., Inc.",
  "Company2Name": null,
  "CompanyDUNS": 23546013,
  "Company2DUNS": 0,
  "OperatorName": "James H. Fasse",
  "OperatorStr1": "851 Forest Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Sheboygan Falls",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53085",
  "OperatorZipCodeExt": "1588",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000048101",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-05-06 00:00:00",
  "SafetyInspectionBy": "Private Propane Tank  Installation Service",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-05-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-02-12 00:00:00",
  "DeRegistrationEffectiveDate": "2016-02-12 00:00:00",
  "AnniversaryDate": "2014-05-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 43.74273,
  "FRS_Long": -87.80831,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Moved to a new location",
  "_processes": [
    {
      "ProcessID": 1000000989,
      "AltID": "Propane Injection System",
      "FacilityID": 1000000814,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001038,
          "ProcessID": 1000000989,
          "ChemicalID": 98,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000001040,
          "ProcessID": 1000000989,
          "ChemicalID": 118,
          "Quantity": 14200.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000001056,
          "ProcessID": 1000000989,
          "NAICSCode": "32551",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000566,
              "Process_NAICS_ID": 1000001056,
              "SafetyReviewDate": "2009-05-06 00:00:00",
              "PHA_Date": "2004-08-09 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2004-09-09 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 1,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2009-05-06 00:00:00",
              "TrainingReviewDate": "2009-05-06 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-05-06 00:00:00",
              "EquipmentInspectionDate": "2009-05-06 00:00:00",
              "EquipmentTested": "All equipment is inspected daily as part of the startup and shutdown procedures.  The function is the responsibility of the Department manager under the supervision of the Plant Manager.",
              "ChangeMgmtDate": "2009-05-06 00:00:00",
              "ChangeMgmtReviewDate": "2009-05-06 00:00:00",
              "PreStartupReviewDate": "2009-05-06 00:00:00",
              "ComplianceAuditDate": "2009-05-06 00:00:00",
              "AuditCompletionDate": "2009-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-05-06 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-06 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "Triclad, Inc. is a single unit Program 3 process.  Foremost in the prevention program is the proactive monitoring of equipment so that it operates at optimum efficiency.  State of the art equipment was implemented at this facility when it was put into operation in 1989, such as vents, relief valves, check valves, manual shutoffs, automatic shutoffs, alarms, grounding equipment, excess flow devices, and purge systems.  Maintenance and inspection of all related equipment is a direct responsibility of the Plant Manager.  Employees involved in any aspect of the operation is trained in proper handling procedures and Emergency Response and Action Plans.  Barriers have been constructed to prevent damage to the storage tank, equipment and delivery system.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000000614,
                  "PreventionProgram3ID": 1000000566,
                  "ProcessChemicalID": 1000001038
                },
                {
                  "PrimaryKey": 1000000616,
                  "PreventionProgram3ID": 1000000566,
                  "ProcessChemicalID": 1000001040
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000814,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-05-06 00:00:00",
    "ERTrainingDate": "2009-05-06 00:00:00",
    "CoordinatingAgencyName": "Sheboygan Falls Fire Department",
    "CoordinatingAgencyPhone": "9204677914",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000814,
      "SummaryText": "EXECUTIVE SUMMARY\n\nTRICLAD, INC.\n660 FOREST AVENUE\nSHEBOYGAN FALLS, WI   53085\n\n\n\nINTRODUCTION\n\nFasse Paint Company, Inc. is the parent company of Triclad, Inc. and holder of the EPA Systems Facility Identifier number WID982063968.  Fasse Paint is an industrial paint blending facility specializing in color matching, small batch mixing, custom packaging and warehouse/shipping programs.  This company does not manufacture raw materials, but instead formulates to customer specifications.  Triclad, Inc. is the paint and propane-blending operation producing aerosol paint cans from materials blended at Fasse Paint Company.  This operation relies on a significant source of propellant maintained on site.  The same properties that make the propane blend valuable as a propellant also make it necessary to strictly observe safety precautions.  Specific details of the blend are discussed in Section 2 below, The Stationary Source and Regulated Substance Handled.  Propellant must be handled appropriately to prevent unnecessary human exposure, to reduce hazards to our personal health as well as our co-workers, and to diminish the threat to nearby members of the community.  It is our policy to adhere to all applicable Federal and State rules and regulations.  Safety depends upon the manner in which we handle propellant, the engineering safety of this facility, and through training of employees.  \n\nTriclad, Inc. moved into the current facility in 1999.  Design concepts and plans developed by Fasse Paint Company and the certified and registered propane installation contractor were preapproved by State and local officials prior to construction.  The facility was inspected prior to operation so that it complies with Chapter 11, Wisconsin Administrative Code and NFPA-58.  Triclad, Inc. has a clean ten-year accident history and successful mechanical record which is confirmation of the planning and training efforts.\n\n\n1.  Accidental Release Prevention and Emergency Response Policies\n\nThe em"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000814,
      "SummaryText": "ergency response program is based upon the NPGAA?S LP-Gas Safety Handbook, A?Guidelines for Developing Plant Emergency ProceduresA? and A?How to Control LP-Gas, Leaks, and FiresA?.  Triclad, Inc. moved into the current facility in 1999.  A leader in the field of storage tank and delivery systems constructed the new propane-blend storage tank.  District and Section Inspectors with the Wisconsin Department of Commerce, Safety and Buildings Division-Gas Systems completed analysis and approval.   Every effort was made in the original plan to anticipate and prevent accidental release, and incorporate any equipment necessary to achieve that goal.\n\nThe Emergency Response Plan developed for OSHA compliance contains the following elements:  1) Personnel roles, lines of authority, and communication procedures; 2) Pre-emergency planning; 3) Emergency recognition and prevention; 4) Emergency medical and first-aid treatment; 5) Methods or procedures for alerting onsite employees; 6) Safe distance and places of refuge; 7) Site security and control; 8) Evacuation routes and procedures; 9) Decontamination procedures; 10) Critique of response and follow-up, and; 11) Personal protective and emergency equipment.\n\n\n2.  The Stationary Source and Regulated Substance Handled.\n\nThe purpose of this facility is to produce aerosol paint cans.  Propane under the product name Liquefied Petroleum Gas Bland and trade name B-80 Aerosol Grade Propellant is used in our aerosol operation to provide propellant in the spray cans.  Maximum amount of propellant stored on site is 44,400pounds with the tank filled to 90% maximum capacity.  The composition of the blend is as follows:\n\nPropane               68%           30,200 lbs.\nNormal Butane         32%           14,200 lbs.\n\n\nThe propellant is delivered by truck transport and stored in a single 12,000-gallon tank.  Fences and safety yellow concrete posts protect the tanks from collision with vehicles.  Valves on the tank are regularly inspected and pro"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000814,
      "SummaryText": "tected from weather.  Propane is pumped from the storage tanks to the propellant room as a liquid using a vane pump.  Pipes transporting the propellant to the injection room are insulated to protect it from varying weather conditions and the effect it may have on the stability of the propane.  Vegetation is controlled to be sure that the pipes remain visible and in good repair.  The propellant room is a separate, explosion-proof structure located adjacent to the main facility. Notably, the system was designed so that no employees are in the propellant room while the equipment is in operation.  This engineering achievement is critical in maintaining safe distance for Triclad employees during production. \n\nThe propellant room is constructed of three firewalls and a relief wall.  A check valve in the propellant room prevents fire from traveling back to the propane tank.  An airline bleeds remaining propane in the lines to a vent in the roof.  As the propane is injected into the aerosol can in liquid form, it converts to gas to fill the vacuum in the can.  In the rare event that a can should fail as the propane is expanding, the contents would be released in the safety and protection of the concrete walls of the propellant room where ignition sources are minimal, limited to mechanical operation and closely monitored.  Sensors detect a release of propane in the propellant room.  These sensors trigger an alarm in the aerosol department, shut down production, and immediately start two heavy-duty exhaust fans on the relief wall of the propellant room.  Any release or concentration of propane is immediately dissipated.  Readings on the alarm system indicate the status of the leak to personnel so that appropriate emergency action can be taken.  A propane release in the propellant room is a rare occurrence of approximately one in 900,000 cans.  After the aerosol can successfully completes the propane injection process, it is moved back into the main facility on a conveyer and "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000814,
      "SummaryText": "submersed in a 130-degree water bath.  This process has a two-fold purpose.  Along with testing for quality assurance, it provides a safe cushion for propane release should the quality assurance test fail.  If a leak occurs in the seal of the aerosol can, the propellant in the can converts from liquid to gas and vaporizes under water.  As a vapor, it rises to the surface and evaporates into the air.  A Plexiglas cover protects employees in the area and contains propane emissions.  Emergency response policies are outlined in the Company Emergency Response Plan.  Employees are fully trained on the guidelines of this plan.\n\n\n3. Worst Case Scenarios and the Alternative Release Scenario Including Administrative Controls and Mitigation Measures to Limit the Distance For Each Reported Scenario.\n\nWorst-case scenario is vapor cloud explosion, and alternative release is vapor cloud fire.  For these two events, passive and active mitigations are similar.  In the development of the storage and delivery system, considerable attention was given to protecting the surrounding industrial sites and adjacent mobile home park.  For that reason, the tank is located as far from the residential area as feasible.  The design includes a system of emergency shutoff, backpressure, and pop action pressure relief valves for large storage containers.  Design and construction of the storage tank, delivery pipeline, injection room, packaging equipment, conveyors, and site security was done by experts in the propane field.  The tank is protected by cement posts, fencing and guard rails.  Active mitigation is the emergency shutdown systems and deluge system. \n\n4.  The General Accidental Release Prevention Program and the Specific Prevention Steps.\n\nThis facility complies with EPAA?S Accidental Release Prevention Rule and with all applicable state codes and regulations.  This facility was designed and constructed in accordance with NFPA-58.  Specific prevention steps are discussed in the above sectio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000814,
      "SummaryText": "n on mitigation.\n\n5.  Ten-year Accident History\n\nNeither Triclad, Inc. nor Fasse Paint Company has had a propane or chemical accident in the past ten years.  As a point of fact, neither business entity has had a propane or chemical accident since they were established.  Engineering controls and employee awareness have played a key roll in the success of our safety record.\n\n\n6.  The Emergency Response Plan\n\nThis facilityA?s Emergency Response Plan is based upon the NPGAA?S LP-Gas Handbook, A?Guidelines for Developing Plant Emergency Response ProceduresA? and A?How to Control LP-Gas Leaks and FiresA?.  This information is combined with OSHA suggested procedure.  Employees are trained on all aspects of emergency response and that training is documented in the Health and Safety Files located in the Industrial Division office.  We have discussed this program with the Sheboygan County Local Emergency Planning Committee and the Sheboygan Falls Fire Department.\n\n\n7.  Planned Changes to Improve Safety\n\nWith well over ten years of accident free operation, management of Triclad, Inc. is not anticipating any changes at this time.  The commitment to proactive safety policy is ongoing, and improved safety changes will be evaluated and completed in conjunction with NFPA-58 revisions."
    }
  ]
}