{
  "FacilityID": 1000079824,
  "FacilityName": "Cacique, Inc.",
  "FacilityStr1": "14940 Proctor Ave.",
  "FacilityStr2": null,
  "FacilityCity": "City of Industry",
  "FacilityState": "CA",
  "FacilityZipCode": "91746",
  "Facility4DigitZipExt": "3219",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.027101",
  "FacilityLongDecDegs": "-117.972320",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 70936534,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Cacique, Inc.",
  "OperatorStr1": "14940 Proctor Ave.",
  "OperatorStr2": null,
  "OperatorCity": "City of Industry",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91746",
  "OperatorZipCodeExt": null,
  "RMPContact": "Henry England",
  "RMPTitle": "Plant Manager",
  "FTE": 259,
  "OtherEPAFacilityID": "CAD070936554",
  "EPAFacilityID": "100000057626",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-01-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.02816,
  "FRS_Long": -117.97154,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099618,
      "AltID": "Cheese Manufacturer",
      "FacilityID": 1000079824,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000100851,
          "ProcessID": 1000099618,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000124827,
          "ProcessID": 1000099618,
          "ChemicalID": 56,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000624827,
          "ProcessID": 1000099618,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079824,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nCacique is committed to providing a safe environment to its employees and surrounding communities.  This commitment is reflected in the safety and environmental programs that are implemented at the facility.  For example, written procedures have been created for operating the ammonia refrigeration system.  Only trained operators are permitted to perform system operations.  Cacique has also developed a robust maintenance program to ensure the equipment is in good operating condition.  All of these programs are geared towards the prevention of an accidental release at the facility.  In addition, these programs incorporate emergency procedures to mitigate the effects of a release if it does occur.  At such an event, emergency coordinators will assess the situation and notify outside responding agencies as necessary.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nCacique is located at 14940 Proctor Avenue in Industry, California.  Ammonia is used in the facility's refrigeration system to provide cooling for production and storage of food products.  The system uses a maximum of 19,000 pounds of ammonia.  A description of how the process operates is presented below:\n\n\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the High Pressure Receiver to the 40 ton chillers (3), 80 ton chillers (3), King Air Units (7), Silos (18), Ice Bank/Prechiller, and Evaporators (6).  The vapor from each piece of equipment is returned through the main suction header to Accumulator #1 or #2.  Each accumulator has an associated Transfer Tank which returns liquid ammonia to the High Pressure Receiver.  Vapor from the accumulators is pulled to the compressors (3) where the pressure and temperature of the gas is increased.  A common discharge header delivers hot gas to selected evaporators for defrost purposes.  The main discharge header is sent to the condensers (2) where it is condensed to a h"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079824,
      "SummaryText": "igh pressure liquid and returned to the High Pressure Receiver.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nCacique has developed an accidental release prevention program for compliance with the OES CalARP regulation.  The program includes but is not limited to the following elements:\n\n\n\n? Safety information regarding the chemical hazards, and operating and technical specifications for the equipment;\n\n? Written procedures for operating and maintaining the processes;\n\n? Training for employees involved with system operations and maintenance;\n\n? Written procedures for managing system changes and startup of a modified process;\n\n? Investigating releases and near misses and implementing measures to prevent recurrence;\n\n? Written procedures for conducting hot work on or near the regulated processes;\n\n? Contractor management policies to ensure contract employee safety while on facility premises; and\n\n? Employee involvement in program development and implementation. \n\n\n\nIn addition, engineering controls have been implemented to reduce the chance of an accidental release to the environment.  These are comprised of equipment monitoring systems and safety cutouts to shut off the equipment when operating parameters exceed safe operating limits.  Relief valves on pressurized ammonia vessels prevent equipment rupture in the event of overpressurization.  Regular inspections and tests are performed to ensure these controls are in good working order.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nA review of the facility's five year accident history showed that there have been no incidents at the facility that meet the RMP criteria for a reportable accident (onsite deaths, injuries, or significant property damage; or known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place).  In addition, there have been no incidents at the facility in the last five years that resulted in a release of more than the Federal Reportable Quantity (100 pounds). However,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079824,
      "SummaryText": " the facility has had an incident that required an incident investigation. The incident is summarized below.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nCacique has developed an Emergency Action Plan (EAP) for the purpose of protecting employees and the surrounding community.  The EAP covers procedures for: 1) evacuating and accounting for visitors and employees, 2) dealing with an ammonia release and other foreseeable emergencies that could occur onsite, 3) notifying external agencies and emergency response personnel, and 4) administering first aid measures for ammonia exposure.  Employees are informed of the elements of the EAP.  In the event of an ammonia release, employees will evacuate or shelter-in-place, depending on the nature of the release, and the facility will contact the fire department for assistance as necessary.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nProcess Hazard Analysis, Seismic Assessments, and Compliance Audits have been performed on the ammonia refrigeration system, and these studies have resulted in action items to improve safety at the facility.  The recommendations mainly consist of formalizing procedures, implementing practices consistent with industry standards, and performing inspections and tests to maintain the integrity of the equipment.  Cacique has implemented several of these action items and is moving forward with completing the remaining outstanding recommendations.   In addition, the facility plans to continue providing employees with a safe work environment through continued training on current policies and procedures, and conducting audits to identify deficiencies and make improvements."
    }
  ]
}