{
  "FacilityID": 1000062933,
  "FacilityName": "Camuy Hatillo Wastewater Treatment Plant",
  "FacilityStr1": "PR-485 Km. 3.5",
  "FacilityStr2": "Membrillo Ward Bajura Sector",
  "FacilityCity": "Camuy",
  "FacilityState": "PR",
  "FacilityZipCode": "00627",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72027",
  "LEPC": "ARECIBO LEPC",
  "FacilityLatDecDegs": "18.488744",
  "FacilityLongDecDegs": "-066.875578",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PC",
  "FacilityURL": "www.acueductospr.com",
  "FacilityEmailAddress": "ciecentral@acueductospr.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Puerto Rico Aqueduct and Sewer Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "PR Aqueduct and Sewer Authority",
  "OperatorStr1": "PO Box 7066",
  "OperatorStr2": "Ave. Barbosa 604",
  "OperatorCity": "San Juan",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00916",
  "OperatorZipCodeExt": "7066",
  "RMPContact": "Irma M. Lopez Santos",
  "RMPTitle": "Compliance and QC Director",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000122958",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-10-28 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10",
  "FRS_Lat": 18.49,
  "FRS_Long": -66.87806,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078906,
      "AltID": "Chlorination",
      "FacilityID": 1000062933,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000080088,
          "ProcessID": 1000078906,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098275,
          "ProcessID": 1000078906,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598275,
          "ProcessID": 1000078906,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062933,
      "SummaryText": "Camuy-Hatillo Wastewater Treatment Plant is located at the State Road 485 Km 3.5 Bo. Membrillo Sector Bajura Camuy, Puerto Rico, 000627.  This water treatment plant  is owned by Puerto Rico Aqueduct and Sewer Authority (PRASA) which is a Government Agency.  PRASA has developed the RMP following the Program #3 for the Management and Prevention of Risks associated with the storage and handling of the toxic substance used as for water disinfection: Chlorine.  The RMP was prepared in compliance with EPA 40 CFR Part68.  The Prevention Program was prepared in accordance with OSHA Process Safety Management (PSM) regulation, as established in 29 CFR Part 1910.119.\n\n\n\nAccidental Release:\n\nIt is PRASA policy to comply with EPA and OSHA Federal and State applicable requirements. Chlorine is a toxic substance regulated by EPA, for that reason Camuy-Hatillo Wastewater Treatment Plant is observing the appropriated engineering controls.  Changes have been put in place to improve safety and as a part of the Prevention Plan implanted to protect the wellness of workers, employees, contractors, visitors and immediately surrounding areas and inhabitants.\n\n\n\nThe Stationary Source and Regulated Substance handled.\n\nCamuy-Hatillo Wastewater Treatment Plant is located close to the Atlantic Ocean where the plant discharges the treated water.  The chlorine is used as a disinfectant to destroy the microorganism that could cause illness in humans and contamination of the receiving water body.\n\nThe chlorine is delivered from San Juan Chlorine Warehouse and Distribution Center to the plant in one (1) ton containers.  Camuy-Hatillo Wastewater Treatment Plant could has a  maximum storage volume of 12,000 pounds distributed in six (6) containers.  Two containers are connected to chlorinators only one container is used at the time the chlorine flows to the vacuum dosificator and from it the chlorine is sent to the contact chamber, through a underground pipeline, where it is combined with the used wat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062933,
      "SummaryText": "er at the end of plants process.\n\n\n\nWorst Case Scenario:\n\nThe Worst Case Scenario was determined as indicated in the EPA Wastewater Treatment Plant, as per Appendix F Supplemental Risk Management Program Guidance for Wastewater Treatment Plants.  This guidance considers the release of the Chlorine Gas of the entire container (2,000 pounds) during 10 minutes and other specifications related to the weather conditions and a radio of 1.3 miles, for a chlorine concentration equal or higher than 3 ppm, which is the American Industrial Hygiene Association exposure limit above which it is determined human health will be affected.  Using the Marplot EPA Simulator and the US Census 2010, it was identified that 4,603 public receptors are inside the 1.3 miles radio.  No known environmental receptors beside the beach (state parks, or official designated wildlife preserves) are located within this radio area.  The ALOHA Modeling Dispersion Program was used to simulate the gas dispersion.\n\n\n\nAlternative Case Scenario:\n\nThe more realistic scenario was also simulated as per EPA Wastewater Treatment Plants parameters, as a release of the total content of a 2,000 pounds container, but throughout a 3/8 inch valve rupture.  In such case the end point distance is calculated as 0.1 miles and none public receptors were identified over the most modeling map.  Recent aerial photographs evaluated show some residences within the 0.1 radius and an estimate of 14 residents live in the area.  No known environmental receptors, besides the beach, are located within the radio area.\n\n\n\nGeneral Accident Release Prevention Program \n\nPRASA is actually in a very aggressive operation to implement a Prevention Plan to ensure the maintenance and mechanical integrity of the facility which will improve significantly the safety scope of the current prevention plans.  Standard Operational Procedures (SOPs) are already in place to comply the OSHA and PROSHO requirements in order to keep all the involved parties "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062933,
      "SummaryText": "aware of the hazardous and risk related to the chlorine.  List of all SOPs are indicated in the PSM report and are located in the plant.\n\n\n\nEmergency Response Program:\n\nPRASA has various SOPs to manage emergency programs associated to a release of the chlorine and also related to the emergency actions to be taken before and after hurricanes and other atmospherics events.\n\n\n\nFive years Accident History:\n\nNo mayor release of chlorine in excess of ten (10) pounds has been reported during the last five years. \n\n\n\nPlanned Changes to Improve Safety:\n\nPRASA will implement in Camuy-Hatillo Wastewater Treatment Plant, practical training in the chlorine processes with all plant operators more frequently in order to improve safety practices  and create more confidence in the management of the chlorine processes.  "
    }
  ]
}