{
  "FacilityID": 1000024220,
  "FacilityName": "Hankinson Renewable Energy, LLC",
  "FacilityStr1": "9230 County Road 1",
  "FacilityStr2": null,
  "FacilityCity": "Hankinson",
  "FacilityState": "ND",
  "FacilityZipCode": "58041",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38077",
  "LEPC": "Richland County LEPC",
  "FacilityLatDecDegs": "46.073186",
  "FacilityLongDecDegs": "-096.886775",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.hankinsonre.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 832292812,
  "ParentCompanyName": "Guardian Hankinson, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hankinson Renewable Energy, LLC",
  "OperatorStr1": "9230 County Road I",
  "OperatorStr2": null,
  "OperatorCity": "Hankinson",
  "OperatorStateFIPS": "ND",
  "OperatorZipCode": "58041",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dean Reder",
  "RMPTitle": "CFO",
  "FTE": 57,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000203022",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "T5X-11001",
  "SafetyInspectionDate": "2011-04-12 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-10-20 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-10-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-10-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029630,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000024220,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029930,
          "ProcessID": 1000029630,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035576,
          "ProcessID": 1000029630,
          "ChemicalID": 56,
          "Quantity": 97200.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000535576,
          "ProcessID": 1000029630,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000029631,
      "AltID": "Denaturant Storage",
      "FacilityID": 1000024220,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029931,
          "ProcessID": 1000029631,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035577,
          "ProcessID": 1000029631,
          "ChemicalID": 155,
          "Quantity": 1052800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 107580,
              "ProcessChemicalID": 1000035577,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 107581,
              "ProcessChemicalID": 1000035577,
              "ChemicalID": 119,
              "_chemical": {
                "ChemicalID": 119,
                "ChemicalName": "1-Butene",
                "CASNumber": "106-98-9",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 107582,
              "ProcessChemicalID": 1000035577,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 107583,
              "ProcessChemicalID": 1000035577,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 107584,
              "ProcessChemicalID": 1000035577,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000535577,
          "ProcessID": 1000029631,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024220,
      "SummaryText": "Hankinson Renewable Energy, LLC\nRMP Executive Summary\nAugust 2011 \n\nThis Executive Summary briefly reviews the major elements of the Risk Management Plan (\"RMP\") for Hankinson Renewable Energy, LLC (\"HankinsonRE).  HankinsonRE is a dry mill fuel-ethanol production facility located in Hankinson, North Dakota. This summary is presented in response to the requirements of the United States Environmental Protection Agency (\"EPA\") under Title 40 of the Code of Federal Regulations (\"CFR\") Part 68 and Section 112(r) of the Clean Air Act.\n\nThe HankinsonRE facility is subject to the RMP rule due to storage above threshold quantities of anhydrous ammonia, a regulated toxic substance, and natural gasoline, a regulated flammable mixture.  This is an update to the earlier RMP submittal.\n\n1.  Accidental Release Prevention and Emergency Response Policies\nHankinsonRE is committed to operating the facilities in a manner that promotes both the safety of our employees and the general public as well as being protective of the environment. HankinsonRE has adopted and implemented policies and procedure that ensure our operations adhere to all applicable federal and state rules and regulations.  The design and construction of the facility has incorporated physical and operational safeguards to prevent accidental releases. Through the proper design, installation, operation, and maintenance of the equipment and through the training of our personnel, HankinsonRE has minimized the hazard to human health and the environment from fires, explosions, or any unplanned sudden or non-sudden release of hazardous materials.  In the event that a release does occur, the facility's emergency response actions are described in its Integrated Contingency Plan (\"ICP\"). The ICP includes procedures to coordinate response actions with local emergency response personnel (i.e., law enforcement, fire, and rescue departments, emergency medical services, hospital and government personnel, etc.) as well as any potenti"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024220,
      "SummaryText": "ally affected neighbors. In addition, the ICP is used to familiarize local emergency response personnel with the types of material handled and company-specific emergency response procedures.\n\n2. Facility Description and Regulated Substances Handled\nThe HankinsonRE facility is a 132-million gallon per year dry-mill fuel ethanol fuel production plant.  Ethanol is produced through the conversion of corn starch to sugars and then conversion of the sugars to ethanol (i.e. grain alcohol) through a continuous fermentation and distillation process.  RMP regulated substances stored at the facility include anhydrous ammonia, which is used for pH control and as a nutrient in the fermentation process, and natural gasoline, which is used as a denaturant in the ethanol fuel product.\n\n3. Accidental Release Prevention Program and Chemical-Specific Prevention Steps\nAs required by EPA, HankinsonRE has established programs to address accidental release prevention measures and notification requirements of Emergency Response and Community Right-to-Know regulations.  In addition, HankinsonRE has established programs to address the process safety management (PSM) requirements of the Occupational Safety and Health Administration (\"OSHA\").  These programs are summarized below.\n\n3.1. Employee Participation\nHankinsonRE has developed an employee participation program that ensures employees have access to all process safety information, results of any process hazard analysis (PHA), results of any incident investigation, results of any compliance audit, current operating procedures, current emergency response plan, and records of any management of change.\n\n3.2. Process Hazard Analysis and Process Safety Information\nThe facility utilizes the what-if PHA methodology. The PHA identified potential major hazards, including toxic gas release, flammable liquid fire, vapor cloud explosion, storage vessel over-pressurization, equipment failure due to corrosion, release of hazardous materials due to over-"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024220,
      "SummaryText": "filling and/or loss of containment.  The facility utilizes process controls such as vent collection systems, pressure and vacuum relief valves, in-line check valves, manual and automatic shutoffs, automated interlocks, operating level alarms, operating procedures, grounding and bonding equipment, rupture disks, and excessive flow devices to prevent or limit releases.  HankinsonRE keeps a variety of technical documents that are used to help maintain safe operation of the facility. Chemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs) and the Emergency Response Action Plan. The facility also maintains technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, and piping and instrument drawings (\"P&ID\").\n\n3.3. Operating Procedures and Training \nHankinsonRE maintains written operating procedures that address all modes of process operations, including normal operations, manual operation, regeneration, and emergency shutdown. The facility has developed and implemented a comprehensive training program for all employees involved in facility operations.\n\n3.4. Contractors\nThe contractor safety procedures establish minimum guidelines and activities in order to assure that contractor personnel follow safe work practices and procedures. The procedure includes a contractor screening process and hazard awareness, safety and emergency procedures training, and safe work permitting that includes hot work and fire prevention.\n\n3.5. Pre-Startup Safety Reviews\nHankinsonRE conducts a pre-startup safety review (\"PSSR\") for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024220,
      "SummaryText": "ipment are appropriately prepared for startup prior to placing equipment into service.\n\n3.6. Mechanical Integrity\nThe facility's mechanical integrity program includes written procedures, training, and regular inspections and equipment testing to maintain pressure vessels, piping systems, relief systems, pumps, emergency shutdown systems and controls in safe operating condition.\n\n3.7. Management of Change\nThe facility's management of change (MOC) program reviews all proposed changes to process chemicals, technology, equipment, procedures, materials, and design conditions prior to implementation of the change. Changes are reviewed to ensure that adequate controls are in place to manage any new hazards, and to verify that existing controls have not been compromised by a process change.\n\n3.8. Incident Investigation\nHankinsonRE has procedures to promptly investigate any incident that has resulted in, or could reasonably result in, a release of a regulated substance. The procedure establishes the minimum guidelines and activities of the incident investigation program in order to reduce the likelihood of repetitive occurrences of events which could reasonably lead to catastrophic releases. Investigations will be undertaken to identify the situation leading to the incident as well as any corrective actions to prevent a similar release in the future.\n\n3.9. Compliance Audits\nThe facility will conduct audits of the provisions of RMP and PSM to verify that procedures and practices are adequate and are being followed.  The audit will include a review of documentation and process safety information, inspection of the physical facilities, and interviews with all levels of plant personnel.\n\n4. Five-year Accident History\nThe facility has not had any accidents reportable under RMP. This RMP submittal is an update to initial start-up of the facility.\n\n5. Emergency Response Program\nHankinsonRE maintains a written emergency response program in its ICP that includes an Emergency Response"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000024220,
      "SummaryText": " Action Plan and the Facility Response Plan. The purpose of the ICP is to protect worker and public safety as well as the environment. The ICP addresses aspects of emergency response, including proper first-aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements. In addition, HankinsonRE has procedures that address maintenance, inspection, and testing of emergency response equipment as well as instructions that address the use of emergency response equipment.  Employees receive training in these procedures when first assigned to a job and on a recurring basis to ensure they can perform their specific emergency response duties.  HankinsonRE coordinates emergency response activities with the local fire departments and third-party emergency responders to ensure the proper execution of our plan. The emergency response program will be updated when necessary based on modifications made to facility processes.\n\n6. Planned Changes to Improve Safety\nThe HankinsonRE facility has been designed and constructed to meet existing construction and process safety requirements.  HankinsonRE will continue to evaluate and implement changes as necessary to improve safety at the facility. At the time of this RMP update, there are no immediate changes planned to improve safety.\n\n"
    }
  ]
}