{
  "FacilityID": 1000044926,
  "FacilityName": "Helix Ironwood, LLC",
  "FacilityStr1": "305 Prescott Road",
  "FacilityStr2": null,
  "FacilityCity": "South Lebanon Twp",
  "FacilityState": "PA",
  "FacilityZipCode": "17042",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42075",
  "LEPC": "Lebanon County LEPC",
  "FacilityLatDecDegs": "40.352900",
  "FacilityLongDecDegs": "-076.365100",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": "william.lewis@ethosenergygroup.com",
  "FacilityDUNS": 15169274,
  "ParentCompanyName": "Helix Ironwood, LLC",
  "Company2Name": "LS Power Development, LLC",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Helix Ironwood LLC",
  "OperatorStr1": "305 Prescott Road",
  "OperatorStr2": null,
  "OperatorCity": "Lebanon",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17042",
  "OperatorZipCodeExt": null,
  "FTE": 26,
  "OtherEPAFacilityID": "PAR000504928",
  "EPAFacilityID": "100000188833",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "38-05019",
  "SafetyInspectionDate": "2017-02-06 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-28 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-07-28 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-07-28 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 40.3509,
  "FRS_Long": -76.3658,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055609,
      "AltID": "Ammonia System",
      "FacilityID": 1000044926,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067838,
          "ProcessID": 1000055609,
          "ChemicalID": 57,
          "Quantity": 62000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000056518,
          "ProcessID": 1000055609,
          "NAICSCode": "22111",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000035792,
              "Process_NAICS_ID": 1000056518,
              "SafetyReviewDate": "2015-02-04 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API 510",
              "FR_Comments": null,
              "HazardReviewDate": "2014-05-02 00:00:00",
              "ChangeCompletionDate": "2014-06-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-12-18 00:00:00",
              "TrainingReviewDate": "2015-12-18 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-12-09 00:00:00",
              "EquipmentInspectionDate": "2014-06-19 00:00:00",
              "EquipmentTested": "CT 11 Ammonia Blower B",
              "ComplianceAuditDate": "2015-04-08 00:00:00",
              "AuditCompletionDate": "2015-12-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000036318,
                  "PreventionProgram2ID": 1000035792,
                  "ProcessChemicalID": 1000067838
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000044926,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-05-02 00:00:00",
    "ERTrainingDate": "2013-12-13 00:00:00",
    "CoordinatingAgencyName": "Lebanon County EMA",
    "CoordinatingAgencyPhone": "7172727621",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044926,
      "SummaryText": "ACCIDENTAL RELEASE AND EMERGENCY RESPONSE POLICIES\r\n\r\nIt is the policy of Ironwood to conduct activities in such a way as to take foremost account of the health and safety of ourselves and of other persons.\r\n\r\nWe will adhere to the highest standards for the safe operation of the plant, the protection of the environment, ourselves, customers and the people in the community where we do business.\r\n\r\nThe objective of this policy is to promote good health and a high level of safety.  We believe that excellence in the management of health and safety is an essential element within our overall business plan. The identification, assessment and control of health and safety and other risks are of equal importance to production and quality.  These aims will be achieved by allocating sufficient resources to provide and maintain conditions and places of work that are, so far as reasonably practicable, safe and healthy.  Effective control of health and safety is achieved through co-operative effort at all levels in our organization.\r\n\r\nOur policy is to provide and maintain safe and healthy working conditions, equipment and systems of work for all of us, and to provide such information, training and supervision as we need for this purpose. We also accept our responsibility for the health and safety of other people who may be working at the plant under our safety system.\r\n\r\nThe allocation of duties for safety matters and the particular arrangements that we will make to implement the policy are the overall responsibility of the Plant Manager.  The Environmental Specialist will be responsible during the Plant Manager's absence. \r\n\r\nWhenever one of us notices a health and safety problem, which we are not immediately able to correct, we will tell the appropriate person directly.  The appropriate person may either be the Team Leader in charge of the area in question or the Environmental Specialist.\r\n\r\nConsultation on safety issues between Ironwood people is provided by means of the safet"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044926,
      "SummaryText": "y steering committee, which meets monthly.  Daily plant maintenance meetings are utilized for communicating immediate issues to all plant personnel. \r\n\r\nThis policy will be kept up to date, particularly as the business changes in nature and .  To ensure that this takes place, the policy and the way in which it has operated will be reviewed continually.\r\n\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe Ironwood Power Plant is situated within the Township of South Lebanon, in Lebanon County, Pennsylvania.  The facility is secured by a chain-link fence with controlled entry security and 24-hour manning.\r\n\r\nThe power plant is a gas-fired combustion turbine generation facility that produces electricity.  As a means of reducing nitrogen oxide emissions from the turbine combustion process, aqueous ammonia (nominally 29.4 percent ammonia by weight) is vaporized and injected into the turbine exhaust.  The ammonia acts as a reagent in the selective catalytic reduction (SCR) of nitrogen oxides across a solid catalyst bed.\r\n\r\nThe aqueous ammonia is stored on site within two side-by-side aboveground storage tanks of equal.  The total capacity of the ammonia storage and feed system exceeds the threshold quantity for applicability to 40 CFR Part 68, the Risk Management Program (RMP) regulation.  There are no other toxic or flammable materials on site that exceed RMP threshold levels.\r\n\r\nThe power plant is not subject to 29 CFR 1910.119, the Process Safety Management (PSM) Standard because the aqueous ammonia concentration (29.4 percent by weight) is below the PSM threshold of 44 percent by weight.  The facility is classified as NAICS Code 221112, Fossil Fuel Electric Power Generation.  This set of conditions dictates Prevention Program Level 2 applicability under the RMP regulation.\r\n\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM \r\n\r\nThe Ironwood Power Plant implements management systems and practices that meet or exceed RMP Level 2 Prevention Program requir"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044926,
      "SummaryText": "ements.  These requirements are defined according to the following elements:\r\n\r\n- Safety information;\r\n\r\n- Hazard review;\r\n\r\n- Operating procedures;\r\n\r\n- Training;\r\n\r\n- Maintenance;\r\n\r\n- Compliance audits; and\r\n\r\n- Incident investigation.\r\n\r\nThe requirements of these elements are met or exceeded through implementation of safety procedures and safety management systems.  These programs are embodied in written documentation as well as continual training and awareness programs to reinforce the importance of facility safety.  Highlights of these policies and procedures are as follows:\r\n\r\n- Information regarding chemical and other hazards is incorporated into site training programs, is well understood, and continually reinforced with employees and contractors;\r\n\r\n- The ammonia system is subjected to periodic, detailed Hazard Reviews to identify hazards, safeguards, and opportunities for improved ammonia risk management;\r\n\r\n- Operations of all aspects of the facility are controlled through written procedures which are arranged to ensure the safe operation of the plant, including steps needed to control hazards in the event of an abnormal conditions;\r\n\r\n- All personnel involved with operating or maintaining the facility are thoroughly trained and qualified through formal qualification programs;\r\n\r\n- Equipment throughout the facility is subjected to continual inspection, testing, and maintenance to ensure the continual functionality of equipment and safety support systems;\r\n\r\n- The facility conducts regular safety inspections and self-reviews of compliance with various regulations and standards; and\r\n\r\n- In the unlikely event of their occurrence, all incidents, unsafe conditions, or other near-misses are promptly and thoroughly investigated by a qualified team to determine their cause and to implement corrective actions to ensure that the condition will not reoccur.\r\n\r\nCHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe ammonia system is designed to meet or exceed current design stan"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044926,
      "SummaryText": "dards for aqueous ammonia storage and handling systems.  A detailed Hazard Review was conducted to verify design and operational safety, and to identify the potential for safety enhancements.  The analysis included the delivery and unloading of ammonia to the storage tank, as well as ammonia storage, pumping, vaporization, and injection.  As a result of the review, the facility has implemented additional measures to ensure continual operability of ammonia safety systems.\r\n\r\nThe ammonia system is subjected to preventive maintenance inspections and testing to ensure its ongoing integrity.  As part of regular duties of the operations staff, the ammonia vessels, piping, and injection system are visually inspected daily to ensure that no undue hazards are present.  The ammonia vessels are periodically subjected to precise wall thickness tests to verify their integrity.\r\n\r\nProtection of the ammonia storage system includes a complete containment system provided around the side-by-side tanks.  In the unlikely event of an ammonia release from the tanks or their appurtenances, ammonia would be immediately contained so as to minimize potential vapor release impacts.  Provisions are in place to promptly respond to and remove any chemical that is spilled on site.\r\n\r\nAmmonia leak detection is provided for ammonia delivery piping, which provides an immediate leak notification within the constantly-manned control room.  Plant control systems are in place to automatically shut down the transfer of ammonia from the tanks to the process injection point in the event of a leak.\r\n\r\nThe delivery and unloading of ammonia into the tanks is strictly managed and controlled.  Tank vehicles and delivery connections are secured, tank levels are verified, and protective equipment is stationed prior to starting unloading operations.  The unloading operation is constantly manned by a trained individual who can immediately shut down ammonia transfer under abnormal conditions.  The ammonia vessels ar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044926,
      "SummaryText": "e each provided with high level alarms to minimize the potential for overfilling.\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nThe Ironwood Power Plant has not experienced an accidental release of ammonia.  Therefore, no accidents have resulted in either on site or off site effects as defined in 40 CFR Part 68 for five-year accident history reporting.\r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe facility maintains a written emergency response program which is in place to protect worker health and public safety.  The program is coordinated with the community response plan maintained by the Lebanon County LEPC.  \r\n\r\nPlant personnel are trained and equipped to respond to releases of ammonia.  The facility Spill Response and Emergency Action Plan includes chemical-specific procedures for responding to a release of any chemical on site, including ammonia.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures; evacuation plans and accounting for personnel after an evacuation; and notification of local emergency response agencies if a release occurs.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe aqueous ammonia system design exceeds the latest in design standards.  The detailed Hazard Review conducted on the ammonia system did not identify any significant needs to enhance the current program."
    }
  ]
}