{
  "FacilityID": 1000000355,
  "FacilityName": "Port of Port Lavaca - Point Comfort",
  "FacilityStr1": "2313 FM 1593 South",
  "FacilityStr2": null,
  "FacilityCity": "Point Comfort",
  "FacilityState": "TX",
  "FacilityZipCode": "77978",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48057",
  "LEPC": "Calhoun County LEPC",
  "FacilityLatDecDegs": "28.640489",
  "FacilityLongDecDegs": "-096.550403",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "AO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.calhounport.com",
  "FacilityEmailAddress": "crh@portofplpc.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Calhoun Port Authority",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Calhoun Port Authority",
  "OperatorStr1": "P.O. Box 397",
  "OperatorStr2": null,
  "OperatorCity": "Point Comfort",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77978",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000139156",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-07-28 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-11-03 10:29:04",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-05-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 28.65,
  "FRS_Long": -96.5417,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000410,
      "AltID": "marine cargo handling",
      "FacilityID": 1000000355,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000442,
          "ProcessID": 1000000410,
          "ChemicalID": 25,
          "Quantity": 59400000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000000443,
          "ProcessID": 1000000410,
          "ChemicalID": 56,
          "Quantity": 55000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000000446,
          "ProcessID": 1000000410,
          "NAICSCode": "48832",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000277,
              "Process_NAICS_ID": 1000000446,
              "SafetyReviewDate": "2004-04-04 00:00:00",
              "PHA_Date": "2009-11-30 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-07-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Foam chambers for tanks, fire monitor system for water sprays, fusible link valves",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Manual perimeter monitoring during emergencies.",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-10-22 00:00:00",
              "TrainingReviewDate": "2008-11-10 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": "Group discussion",
              "MaintenanceReviewDate": "2009-04-16 00:00:00",
              "EquipmentInspectionDate": "2008-11-12 00:00:00",
              "EquipmentTested": "Acrylonitrile tank",
              "ChangeMgmtDate": "2009-01-08 00:00:00",
              "ChangeMgmtReviewDate": "2008-01-18 00:00:00",
              "PreStartupReviewDate": "2008-10-08 00:00:00",
              "ComplianceAuditDate": "2007-10-23 00:00:00",
              "AuditCompletionDate": "2008-11-30 00:00:00",
              "IncidentInvestigationDate": "2009-02-17 00:00:00",
              "InvestigationChangeDate": "2009-04-30 00:00:00",
              "ParticipationPlansReviewDate": "2008-02-26 00:00:00",
              "HotWorkPermitReviewDate": "2007-06-21 00:00:00",
              "ContractorSafetyReviewDate": "2009-03-18 00:00:00",
              "ContractorSafetyEvalDate": "2006-09-26 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000000296,
                  "PreventionProgram3ID": 1000000277,
                  "ProcessChemicalID": 1000000442
                },
                {
                  "PrimaryKey": 1000000297,
                  "PreventionProgram3ID": 1000000277,
                  "ProcessChemicalID": 1000000443
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000355,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-01-04 00:00:00",
    "ERTrainingDate": "2009-03-26 00:00:00",
    "CoordinatingAgencyName": "Calhoun County Emergency Management",
    "CoordinatingAgencyPhone": "3615534400",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000355,
      "SummaryText": "r each operating phase including start-up procedures, routine/normal operations, batch/temporary procedures, shutdown procedures and emergency procedures;\n\n* Operating limits including risks and safeguards;\n\n* Safety and health considerations; and\n\n* Safety systems and their functions.\n\nThe operating procedures are readily accessible to employees on the process units and are reviewed as often as necessary to ensure they reflect current operating practice.  Procedures are routinely reviewed for content at least every three years depending on the criticality of the procedure as determined by the area managers or their designee.  Procedures are also modified and updated as needed as part of management of change.  Each Area Manager certifies annually that the operating procedures are current and accurate for process units within their area of responsibility.\n\nThe Area Manager is responsible for maintaining operating procedures for their department.  The HSE Manager is assigned to maintain written safe work practices site wide.  The Area Managers are responsible to ensure employees and contractors apply safe work practices in their departments.\n\n2.6   Training\n\nEmployees involved in handling hazardous chemicals receive both safety training and process unit specific training.  Safety training includes safety and health hazards and safe work practices.  Unit specific training includes process specific training including operating procedures and emergency operations.  Periodic reviews of safety and environmental issues are conducted.\n\nThe Area Managers ensure employees within their areas of responsibility receive the training and qualification required for the employee's position assignments.\n\n2.7   Contractors\n\nContract employees undergo training that covers hazards, emergency action and safe work practices.  The content of the training is determined by the Port and Ineos prior to allowing work by contractors on Port property.\n\n2.8   Pre-Startup Safety Review\n\nIneos perfor"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000355,
      "SummaryText": "esponsibility of each Port employee and each Ineos employee assigned to the Port facility to participate in the safety programs prepared for the marine cargo handling facility and to follow all applicable safety rules, policies and procedures, including those required by PSM, the RMP and general Port policies.  All employees are properly trained in the applicable safety practices, policies and procedures to safely conduct the activities of their job assignments and to respond to emergency events.\n\n2.3   Process Safety Information\n\nIneos has a compilation of process safety information (PSI).  The PSI is available for conducting process hazards analyses.  The PSI includes:\n\n* MSDS information pertaining to the hazards of the chemicals used or produced by the processes;\n\n* Information on the process technology including block flow diagrams or simplified process flow diagrams, process chemistry, maximum intended inventory, safe upper and lower limits and other information included in operating manuals and Standard Operating Procedures (SOPs); and\n\n* Information on the equipment used including P&IDs, electrical classification, relief system design and design basis, ventilation systems, safety systems, material and energy balances for new processes and equipment.\n\nControlled copies of the PSI documents are kept in the department responsible for them.  The PSI documents are maintained through application of Ineos Management of Change Procedure.  Management of Change also involves a technical review that ensures and documents that changes in equipment comply with recognized and generally accepted good engineering practices.  It is the policy of Ineos that all applicable equipment is designed, maintained, inspected, tested and operated in a safe manner.\n\nFor new processes, a project change procedure is utilized for construction until construction is complete and authorized for commission, at which time the process becomes subject to the Management of Change procedure.\n\nIt is"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000355,
      "SummaryText": "the responsibility of all personnel who lead activities involving PSI to ensure the applicable PSI is compiled and updated in accordance with OSHA PSM, the EPA RMP and the Management of Change Procedure.\n\n2.4   Process Hazards Analysis\n\nIneos performs process hazards analyses (PHAs) on existing process units and on new process units as part of project safety reviews.  The hazards analyses are updated at least every five years.  The priority order for the initial hazards analyses are based on a documented rationale.\n\nThe PHAs are carried out using acceptable methodology and address:\n\n* Hazards of the process;\n* Previous incidents;\n* Engineering and administrative controls;\n* Consequences of failure of controls;\n* Facility siting;\n* Human factors; and\n* Qualitative evaluation of possible safety and health effects.\n\nThe PHAs are performed by a team with expertise in engineering and process operations.  The teams include at least one employee with experience and knowledge in the process as well as one person knowledgeable in the PHA methodology being used.  All PHA recommendations are addressed and resolved with appropriate documentation in a timely manner.  Planned actions are adequately managed with scheduled milestone completion times.  PHA reports and documentation are retained for the life of the process.  The PSM/RMP Coordinator is assigned to provide leadership for ensuring that the process hazards analyses are in accordance with requirements.  The Area Manager is also responsible to provide the resources to resolve PHA recommendations, to complete recommended actions as needed and to communicate the actions to employees whose work may be affected by the recommendations or actions.\n\n2.5   Operating Procedures\n\nIneos maintains controlled written operating procedures that provide clear instructions for safely conducting process activities.  The operating procedure system consists of Operating Manuals and SOPs.  Included in the operating procedures are:\n\n* Steps fo"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000355,
      "SummaryText": "Calhoun Port Authority\n\tPort of Port Lavaca - Point Comfort\n\tEPA Risk Management Plan - Executive Summary\nMay 2009\n\n\n1.0   Introduction\n\n1.1   Relationship of Owner and Operator\n \nThe Port of Port Lavaca - Point Comfort (Port), directed by the Calhoun Port Authority, is the owner of the facility.  The portion of the Port facility that is subject to Risk Management Plan (RMP) regulations is operated by Ineos USA LLC, hereafter referred to as Ineos.  The RMP incorporates the release prevention, emergency response, and training provisions of both the owner and operator, since these two entities coordinate implementation of on-site procedures to ensure that both Port and site Ineos employees are properly prepared to prevent and respond to emergencies.\n\n1.2   Owner History\n\nThe Port was constructed in the 1950s and designed to accommodate the transfer of chemicals and petrochemicals between ship or barge traffic and pipelines connected directly to remote client facilities.  In 1998, a major expansion of the Port was initiated to accommodate Ineos material transfers and storage.  An additional tank was commissioned in 2004.  The Port owns all equipment used to transfer and store chemicals at the facility, and Ineos is responsible for operation of the equipment to properly manage the chemicals.\n\n1.3   Operator History\n\nThe process used to produce Ineos products contain quantities of listed hazardous chemicals that require application of Process Safety Management (PSM) as required in OSHA 29 CFR Part 1910 and the RMP.  Ineos has an outstanding environmental record and is an OSHA VPP Star site, is ISO 14000 certified, and is a participant of the Clean Texas 2000 initiative.  The facility has received the following awards:\n\n* Best In Texas from the Texas Chemical Council for the years `89, `91, `92, `95, `96, `97, `98, `99, `00, '02, `03, '04, '05, '06 and '07;\n\n* NPRA Gold Award  & Award for Achievement - `95, `97 and `98;\n\n* Governor's Award for Environmental Excellence -"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000355,
      "SummaryText": "`93; and\n\n* US EPA Environmental Excellence Awards - `93 (Underground Injection), `94 (NPDES) and `95 (UIC and NPDES).\n\n1.4  Regulated Substances Handled\n\nThe Port manages and stores acrylonitrile and ammonia for Ineos.\n\n1.5   Release Scenarios \n \nMethodology given in the RMP Offsite Consequence Analysis Guidance was used to determine worst and alternative case release scenarios.  The model RMP*Comp Version 1.07 was used with default weather conditions for worst case and neutral conditions.\n\n2.0   Release Prevention Program\n\n2.1   Responsibility\n\nCompliance with the RMP is the responsibility of the Port Director.  The Port Director works in cooperation with the Ineos Plant Manager who is in direct consultation with the PSM/RMP Coordinator.  The PSM/RMP Coordinator provides technical expertise for process safety, communicates requirements to appropriate manufacturing managers, and coordinates policies and procedures to meet process safety requirements in support of the manufacturing areas.  Because the day-to-day operations at the Port facility associated with Ineos are the responsibility of Ineos, the PSM program has been developed by Ineos, along with the Process Hazard Analyses, Process Safety Information compilation, Standard Operating Procedures, Inspection and Testing procedures, and other safety-related programs.  Due to the nature of the owner/operator relationship, emergency planning and response procedures and plans have been a collaboration of the Port and Ineos.  Both the Port and Ineos employees who are assigned to Port operations undergo operating and emergency response training specific to the potential hazards related to management of acrylonitrile and ammonia at the Port.\n\n2.2   Employee Participation\n\nEmployee participation, as appropriate, in the development of all safety-related programs and procedures has been utilized to ensure the practicality of the systems and to advance the understanding of both employees and system developers.  It is the r"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000000355,
      "SummaryText": "ms pre-startup safety reviews for both new and modified facilities.  It is the responsibility of those employees leading the change for small projects and of the project manager for large projects to ensure pre-startup safety reviews are conducted for new or modified facilities.\n\n2.9   Mechanical Integrity\n\nIneos has programs to maintain the ongoing mechanical integrity of process equipment.  The programs include written procedures, training, inspection and testing, correction of equipment deficiencies and quality assurance.\n\n2.10   Incident Investigation / Accident Release History\n\nNeither the Port nor Ineos has had an accidental release of a regulated substance in the past five years which resulted in deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  It is the policy of the Port and Ineos that all accidents, unsafe conditions and near misses are investigated, and remedial activities identified and implemented to prevent a reoccurrence of the condition.\n\n2.11   Emergency Planning and Response\n\nEmergency procedures have been designed to minimize an employee's exposure to a hazardous chemical release, protect the environment and surrounding community, contain and/or neutralize a spill or release, and have consistent standards applied during a release within the plant boundary.  The emergency procedures for the Port facility are updated and tested on an annual basis to ensure the plan stays current and will accomplish all of the desired results.\n\nThe overall emergency response program is coordinated with the Calhoun County Local Emergency Planning Committee (LEPC).  This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials, and industry representatives.  The Port has around-the-clock communications capability with appropriate LEPC officials and emergency response orga"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000000355,
      "SummaryText": "nizations (e.g., local fire department). \n\nIneos has a trained Emergency Response Team consisting of approximately 100 employees.  The team trains on a quarterly basis with emergency response drills and scheduled training days.  The facility has trained emergency Offsite responders and is a participating member of Chemnet.  This team responds to chemical spills in the plants geographic area, including the Port.\n\n2.12   Compliance Audits\n\nPSM/RMP compliance audits are conducted at least every three years to verify that the PSM/RMP procedures and practices are adequate and are being followed.  The compliance audits are conducted by at least one person knowledgeable in the process.  Compliance audit reports are prepared.  Responses to the audits are managed, and deficiency corrections are documented.  The two most recent audit reports are retained.\n\n3.0   Chemical-Specific Prevention Steps\n\nIn addition to the release prevention program activities, safety features have been designed for all units to:\n\n* quickly detect a release;\n* contain/control a release; and\n* reduce the consequences of (mitigate) a release.\n\n3.1   Release Detection\n\nDetectors with alarms located strategically throughout the process area.\n\n3.2 Release Containment/Control\n\nThe containment and control methods utilized to prevent migration to the environment from a release are:\n\n* Curbing or diking to contain liquid releases;\n\n* Redundant equipment and instrumentation (i.e. uninterruptible power supply for process control system, backup firewater pump); and\n\n* Atmospheric relief devices.\n\n3.3 Release Mitigation\n\nThe effects of releases are mitigated by:\n\n* Use of fire suppression and extinguishing systems;\n\n* Maintaining properly trained emergency response personnel;\n\n* Use of personal protective equipment (e.g., protective clothing, self-contained breathing apparatus);\n\n* Availability of mobile fire fighting equipment; and\n\n* Construction of blast-resistant buildings to help protect control systems and"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000000355,
      "SummaryText": "personnel.\n\n4.0   RMP Communication\n\nThe Port Director has the responsibility of providing RMP information (other than the required EPA submission) to employees and the public pursuant to Section 68.210 of the regulation.  These communications have been coordinated with local community cooperation and have been communicated in open forums in May 1999.\n\n5.0\tAccident History\n\nThere have been no accidents at the facility.\n\n6.0   Planned Changes to Improve Safety\n\nThe system of audits, review and management of change will ensure that any additional safety controls are identified and implemented."
    }
  ]
}