{
  "FacilityID": 1000083582,
  "FacilityName": "ExxonMobil - BTEC",
  "FacilityStr1": "5200 Bayway Drive",
  "FacilityStr2": "BTEC West",
  "FacilityCity": "Baytown",
  "FacilityState": "TX",
  "FacilityZipCode": "77520",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Baytown Area LEP",
  "FacilityLatDecDegs": "29.74338",
  "FacilityLongDecDegs": "-95.025659",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "ExxonMobil Chemical Company",
  "Company2Name": null,
  "CompanyDUNS": 1213214,
  "Company2DUNS": 0,
  "OperatorName": "Robert D. Bacon",
  "OperatorStr1": "5200 Bayway Drive",
  "OperatorStr2": null,
  "OperatorCity": "Baytown",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77520",
  "OperatorZipCodeExt": null,
  "FTE": 812,
  "OtherEPAFacilityID": "54171",
  "EPAFacilityID": "100000225589",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Internal Only",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-02-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-02-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-02-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-02-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R03",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000104429,
      "AltID": "WPP",
      "FacilityID": 1000083582,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000130771,
          "ProcessID": 1000104429,
          "ChemicalID": 155,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000115025,
              "ProcessChemicalID": 1000130771,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000115026,
              "ProcessChemicalID": 1000130771,
              "ChemicalID": 115
            }
          ]
        },
        {
          "ProcessChemicalID": 1000130772,
          "ProcessID": 1000104429,
          "ChemicalID": 115,
          "Quantity": 20000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000130774,
          "ProcessID": 1000104429,
          "ChemicalID": 107,
          "Quantity": 19000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000105762,
          "ProcessID": 1000104429,
          "NAICSCode": "54171",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000104631,
      "AltID": "Ethylene Trailer",
      "FacilityID": 1000083582,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131055,
          "ProcessID": 1000104631,
          "ChemicalID": 95,
          "Quantity": 41000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000105984,
          "ProcessID": 1000104631,
          "NAICSCode": "54171",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    },
    {
      "ProcessID": 1000105027,
      "AltID": "Pentane",
      "FacilityID": 1000083582,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000131521,
          "ProcessID": 1000105027,
          "ChemicalID": 125,
          "Quantity": 78000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000106378,
          "ProcessID": 1000105027,
          "NAICSCode": "54171",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000083582,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2019-06-05 00:00:00",
    "ERTrainingDate": "2019-03-14 00:00:00",
    "CoordinatingAgencyName": "Channel Industries Mutal Aid (CIMA)",
    "CoordinatingAgencyPhone": "2814765040",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": "DHS 6 CFR 27, OSHA 29 CFR 1910.1450, TxDPS Precursor Chemical Program"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083582,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES OF\n\nEXXONMOBIL\n\nThe ExxonMobil Baytown Technology and Engineering Complex (BTEC) has a long-standing commitment to worker and public safety and protection of the environment. This commitment is demonstrated by the resources investing in accident prevention, such as personnel training and considering safety in the design, installation, operation, and maintenance of our processes. The objective of risk management is to implement effective controls to prevent releases of regulated substances. However, if a release does occur, BTEC's trained personnel will respond to control, contain, and mitigate the release.\n\n\n\nExxonMobil Corporation enhanced its safety programs in 1991 by implementing a set of structured safety management systems entitled Operations Integrity Management Systems (OIMS). In 1997, Lloyd's Register Quality Assurance reviewed OIMS and evaluated it against an international standard for Environmental Management Systems (ISO 14001) to determine if OIMS is equivalent to the requirements of ISO 14001. After an extensive review, which included a number of audits of various ExxonMobil Corporation facilities, Lloyd's concluded that the \"environmental components of the OIMS are consistent with the intent and meet the requirements of the ISO 14001 Environmental Management Standard.\" They went on to say, \"We further believe ExxonMobil Corporation to be among the industry leaders in the extent to which environmental management considerations have been integrated into its ongoing business processes.\"\n\n\n\n\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nExxonMobil Baytown Technology & Engineering Complex (BTEC), located in Baytown, Texas,\n\nU.S.A., operates a variety of processes for conducting both fundamental and applied research in the development of new and improved processes and products for manufacturing basic and intermediate chemicals, commodity and specialty poly"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083582,
      "SummaryText": "mers, as well as, advantaged feed stocks.\n\n\n\nAlthough there are many regulated substances contained in these BTEC processes, only four substances (n-Pentane, Ethylene, Isobutane, and Isopentane) are above the threshold quantity. BTEC Risk Management Program and Plan (RMP) represent all these chemicals in three processes.\n\n\n\nThe RMP-covered processes at BTEC has been determined to be Program 1 per the U. S. EPA's\n\nAccidental Release Prevention Risk Management Program (RMP) provisions. However, the only areas affected by the processes are limited to workers at the ExxonMobil Baytown Chemical Plant and ExxonMobil Refinery surrounding the BTEC properties.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM STEPS\n\nThe following is a summary of the general accident prevention program in place at BTEC. This section addresses the following elements: Employee Participation, Process Safety Information,\n\nProcess Hazard Analysis, Operating Procedures, Training, Contractors, Pre-Startup Safety Reviews, Mechanical Integrity, Safe Work Practices, Management of Change, Incident Investigation, and \n\nCompliance Audits. The accident prevention program at BTEC equally covers all individually listed regulated substances, flammable mixtures, and toxic substances.\n\n\n\nEmployee Participation\n\nBTEC encourages employees to participate in all facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling operating and maintenance procedures to participating as a member of a process hazard analysis (PHA) team.\n\nEmployees have access to information created as part of the BTEC accident prevention program, which is document in an employee participation plan that is maintained at BTEC. In addition, BTEC has a number of initiatives that address process safety and employee safety issues. These initiatives include forming teams to promote both process and personnel safety. The teams typically have members from various areas of BTEC, inclu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083582,
      "SummaryText": "ding operations, maintenance, engineering, and BTEC management.\n\n\n\nProcess Safety Information\n\nBTEC keeps a variety of documents that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, safe limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. The specific business groups within BTEC are assigned responsibility for maintaining up-to-date process safety information.\n\n\n\nChemical-specific information, including exposure hazards and emergency response/exposure treatment consideration, is provided in safety data sheets (SDSs). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals. For specific process areas, BTEC has identified Operating Envelopes; i.e., documented safety-related limits for specific process parameters such as temperature, level, and compositions. BTEC ensures that the process is maintained within these safe limits using computerized process controls and monitoring instruments, highly trained personnel, and protective systems (e.g., automated shutdown systems, alarm systems, pressure relieving systems).\n\n\n\nBTEC also maintains numerous documents that provide information about the design and construction of process equipment. These documents include information such as materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\n\n\n\nProcess Hazard Analysis\n\nBTEC has a comprehensive program to help ensure that hazards associated with the various processes are identified and control"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000083582,
      "SummaryText": "ll-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, control instruments, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include:\n\n(1) conducting training;\n\n(2) developing written procedures;\n\n(3) performing inspections and tests;\n\n(4) correcting identified deficiencies; and,\n\n(5) applying quality assurance measures.\n\n\n\nIn combination, these activities form a system that maintains the mechanical integrity of the process equipment. Maintenance personnel receive training on:\n\n(1) an overview of the processes;\n\n(2) safety and health hazard;\n\n(3) applicable maintenance procedures;\n\n(4) emergency response plans; and,\n\n(5) applicable safe work practices to help ensure that they can perform their job in a safe manner.\n\n\n\nWritten procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or else the equipment use will be reviewed to determine what actions are necessary to ensure the continued safe operation of the equipment.\n\n\n\nAnother integral part of the mechanical integrity program is quality assurance. BTEC incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\n\n\n\nSafe Work Practices\n\nBTEC has long-standing safe work practices in place to help ensure worker and process safety. These include orientations for visitors/contractors, control of the entry/exit of support personnel, energy isolation for equipment bein"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083582,
      "SummaryText": "led. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards. BTEC primarily uses the Knowledge Based Hazard and Operability (HAZOP) study that is an adaptation of widely used industry methodologies to perform these evaluations. HAZOP analysis is recognized as a systematic and thorough hazard evaluation technique. These analyses are conducted using a team of people who have operating experience and engineering expertise on the process to be evaluated. The PHA team identifies and evaluates hazards on the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are appropriate.\n\n\n\nThe PHA team findings are forwarded to local management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk evaluation done by the PHA team. This evaluation helps ensure that potential accident scenarios assigned a greater risk receive attention first. All approved mitigation options are tracked until they are complete. The resolution and completion of each finding is documented and retained.\n\n\n\nTo ensure that the process controls are consistent with design safety features, BTEC periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years for the life of the process. These hazard reviews are also performed during the design stage of new facilities and for facilities undergoing significant modification.\n\n\n\nOperating Procedures\n\nBTEC maintains written procedures that address various modes of process operations, such as:\n\n(1) initial startup;\n\n(2) normal operations;\n\n(3) temporary operations;\n\n(4) emergency shutdown;\n\n(5) emergency operations;\n\n(6) normal shutdown; and,\n\n(7) start-up following a turnaround or after an emergency shutdown.\n\nThese procedures are used"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000083582,
      "SummaryText": " as a reference by experienced operators and provide a consistent basis for training of new operators. The procedures are kept current and accurate by revising them as necessary to reflect changes made through the management of change process. These procedures are periodically reviewed and annually certified as current and accurate.\n\n\n\nBTEC has identified Operating Envelopes; i.e., documented safety-related limits for specific process parameters such as temperature, level, and compositions. This information, along with written operating procedures, is readily available to operators in the process unit and for other personnel to use as necessary to safely perform their job tasks.\n\n\n\nTraining\n\nTo complement the written procedures for process operations, BTEC has implemented a comprehensive training program for all employees involved in operating a process. New employees receive basic training in BTEC operations. After successfully completing this training, a new operator is paired with an experienced operator to learn process-specific duties and tasks. After employees demonstrate (e.g., through tests and/or skills demonstrations) that they have adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operations technicians periodically receive refresher training on key operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted yearly on critical procedures and at least every three years on non-critical procedures. All of this training is documented for each operator, including the means used to verify that the operator understood the training.\n\n\n\nTraining is also provided for each employee involved in maintaining the ongoing integrity of process equipment. This training includes an overview of the process hazards. Training is provided on specific procedures applicable to the employee's job tasks to assure that the emplo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000083582,
      "SummaryText": "yees can perform the job tasks in a safe manner.\n\n\n\nContractors\n\nBTEC uses contractors to supplement its workforce. Contractors are to adhere to all safety rules and practices applicable to ExxonMobil Corporation employees. Because some contractors work on or near process equipment, BTEC has systems in place to ensure that contractors:\n\n(1) perform their work in a safe manner;\n\n(2) have the appropriate knowledge and skills;\n\n(3) are aware of the hazards in their work area;\n\n(4) understand what they should do in the event of an emergency;\n\n(5) understand and follow site safety rules; and,\n\n(6) inform BTEC personnel of any hazards that they find during work.\n\n\n\nThis is accomplished by providing contractors with:\n\n(1) a process overview;\n\n(2) information about safety and health hazards;\n\n(3) emergency response plan requirements; and,\n\n(4) safe work practices prior to their beginning work.\n\n\n\nIn addition, BTEC evaluates contractor safety programs and performance during the selection of a contractor. BTEC personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\n\n\n\nPre-startup and Safety Reviews (PSSRs)\n\nBTEC conducts a PSSR for any new facility or facility modification that requires a change in the process safety information controlled by management of change (MOC). The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for startup prior to placing the equipment into service. The review provides an additional check to ensure construction is in accordance with design specifications and that all supporting systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\n\n\n\nMechanical Integrity\n\nBTEC has we"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000083582,
      "SummaryText": "g worked on, procedures for the safe removal of hazardous materials before opening of process piping/equipment, hot work permit/procedure to safely manage spark-producing activities, control of vehicle entry into process area, confined space entry permit/procedure to help ensure precautions are taken before entering confined spaces, and job safety analyses to identify and mitigate hazards associated with maintenance tasks. These practices, along with related procedures and training of affected personnel, form a system to help ensure operations and maintenance activities are performed safely. These practices are primarily documented in the Safety Manual and the BTEC Maintenance Manual.\n\n\n\nManagement of Change\n\nBTEC has a comprehensive system to manage changes to process. This system requires that changes to items such as process equipment, chemicals, technology, procedures, and other facility changes be properly reviewed and authorized before being implemented. Changes are reviewed to:\n\n(1) ensure that adequate controls are in place to manage any new hazards; and,\n\n(2) verify that existing controls have not been compromised by the change.\n\n\n\nAffected chemical hazard information, process operating limits, and equipment information, as well as procedures are updated to incorporate these changes. In addition operations personnel are provided any necessary training before the change is implemented.\n\n\n\nIncident Investigation\n\nBTEC promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental impact, or personnel injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to BTEC management for resolution.\n\n\n\nCorrective actions taken in response to the"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000083582,
      "SummaryText": " investigation team's findings and recommendations are tracked until they are resolved. The resolution of each finding or recommendation is documented and the investigation results are reviewed with all affected personnel whose job tasks are relevant to the findings including contract employees where applicable. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.\n\n\n\nCompliance Audits\n\nTo ensure that the accident prevention program is functioning properly, BTEC periodically conducts audits to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3. The audit team develops findings that are forwarded to BTEC management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The resolution of each finding is documented, and the two most recent audit reports are retained.\n\n\n\nCHEMICAL SPECIFIC PREVENTION STEPS\n\nThe processes at BTEC have hazards that must be managed to ensure continued safe operation. The accident prevention program summarized above is applied to all RMP covered processes at BTEC. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human error.\n\n\n\nIn addition to the accident prevention program activities, BTEC has safety features on many processes to:\n\n(1) quickly detect a release;\n\n(2) contain/control a release; and,\n\n(3) reduce the consequences (mitigate) of a release.\n\n\n\nThe following types of safety features are used in various processes:\n\n1. Release Detection\n\n(1) Hydrocarbon detectors with alarms\n\n(2) Toxic Vapor detectors with alarms\n\n(3) TV surveillance cameras\n\n(4) Operator 'surveillance' rounds\n\n\n\n2. Release Containment/Control\n\n(1) Process relief valves that discharge to a flare to capture and incinera"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000083582,
      "SummaryText": "te episodic releases.\n\n(2) Valves to permit isolation of the process (manual or automated)\n\n(3) Automated shutdown systems for specific process parameters (e.g., high level, high temperature)\n\n(4) Alarms that give early indication of approaching operating limits and provide opportunity for operator intervention.\n\n(5) Redundant equipment and instrumentation (e.g., uninterruptable power supply for process control system, backup firewater pump)\n\n(6) Pressure control devices\n\n(7) Atmospheric relief devices\n\n(8) Curbing or diking to contain liquid releases\n\n\n\n3. Release Mitigation\n\n(1) Fire suppression and extinguishing systems\n\n(2) Deluge system for specific equipment\n\n(3) Trained on-site emergency response organization for day shift and Mutual Aid for off-hours\n\n(4) Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus)\n\n(5) Blast-resistant buildings and shelters to help protect personnel and control systems\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nBTEC has an excellent record of accident prevention over the life of facility. There have been no RMP reportable incidents at BTEC. BTEC conducts formal incident investigations to identify and correct the causes of events that do not meet the EPA definition of an RMP reportable incident.\n\n\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nBTEC maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment. The program consists of procedures for responding to a loss of containment, including possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements. In addition, BTEC has procedures that"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000083582,
      "SummaryText": " address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures as necessary to perform their specific emergency response duties. The emergency response program is updated when necessary based on modifications made to BTEC processes or other BTEC facilities.\n\n\n\nBTEC is a member of the Baytown ExxonMobil Emergency Response Network. Other members of this network include: Mont Belvieu Plastics Plant, Baytown Olefins Plant, and the Baytown Chemical/Refining Complex (BTCX). The network provides mutual aid emergency response to member sites. Active members also conduct joint training and response.\n\n\n\nBTEC meets with the Baytown Area Local Emergency Planning Committee (LEPC). This includes periodic meeting of the committee, which includes local emergency response officials, local government officials, and industry representatives. In addition to periodic LEPC meetings, BTEC conducts periodic emergency drills that involve the City of Baytown Fire Department. BTEC has around-the-clock communications capability via BTCX interface with appropriate LEPC officials and emergency response organizations (e.g., City of Baytown Fire Department). This provides a means of notifying the public of an incident as well as facilitating quick response to an incident. BTEC also uses the Community Awareness and Emergency Response (CAER) Line to provide messages to the community during an emergency.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Operations Integrity Management System (OIMS) forms the cornerstone for continuous improvement in BTEC's safety-related systems. These systems are evergreen and are in a continuous state of improvement, usually through improvement steps such as implementation of recommendations from hazard reviews, assessments, and any incident investigations. During the period of 2016-2019, BTEC continued to evaluate and complete step"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000083582,
      "SummaryText": "s to reduce the potential for incidents that could impact the surrounding community. Continuing improvements to safety include:\n\n- Improve and enhance the recently implemented Loss Prevention System (LPS)\n\n- Improve and enhance OIMS Critical Verifications and Measurements\n\n- Enhance work permit system refresher training consistent with the ExxonMobil best practice.\n\n\n\n\n\n"
    }
  ]
}