{
  "FacilityID": 1000042884,
  "FacilityName": "City of Edinburg Water Filtration Plant",
  "FacilityStr1": "500 East Mahl Road",
  "FacilityStr2": null,
  "FacilityCity": "Edinburg",
  "FacilityState": "TX",
  "FacilityZipCode": "78539",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.2977",
  "FacilityLongDecDegs": "-98.1578",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 155704653,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Edinburg",
  "OperatorStr1": "500 East Mahl Road",
  "OperatorStr2": null,
  "OperatorCity": "Edinburg",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78539",
  "OperatorZipCodeExt": null,
  "RMPContact": "Javier Valdez",
  "RMPTitle": "Water Plant Superintendent",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000161923",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-10-18 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-05-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 26.29871,
  "FRS_Long": -98.15838,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052885,
      "AltID": "Water Pump Station",
      "FacilityID": 1000042884,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053626,
          "ProcessID": 1000052885,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064189,
          "ProcessID": 1000052885,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564189,
          "ProcessID": 1000052885,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042884,
      "SummaryText": "Executive Summary [?68.155]\n\n\n\nThe owner or operator shall provide in the RMP an executive summary that includes a brief description of the following elements: (a) The accidental release prevention and emergency response policies at the stationary source; (b) The stationary source and regulated substances handled; (c) The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario;(d) The general accidental release prevention program and chemical-specific prevention steps; (e) The five-year accident history; (f) The emergency response program; and (g) Planned changes to improve safety.\n\n\n\nThe City of Edinburg Water Filtration Plant?s approach to accidental release prevention policy integrates technologies, procedures, and good management practices. The Edinburg emergency response policy involves the preparation of a response plan tailored to each facility and to the emergency response services available in the community. The policy adheres to EPA Prevention Program procedures where applicable, and complies with EPA Emergency Response Program requirements.\n\n\n\nAntonio Leal, Water Plant Superintendent, is the responsible official at the Edinburg Water Filtration Plant. The Water Filtration Plant is located at 500 E. Mahl, Edinburg, Hidalgo County, Texas. Its chlorination building sits on the south side of the plant and consists of a ten by ten-foot room with two, 1-ton Chlorine cylinders next to the building and facing north. One cylinder is operational and the other used for backup. The chlorine cylinders are equipped with manual shutoff valves in the event of an emergency, and an alarm activates at the occurrence of released chlorine. Personnel oversee the facility 24-hours a day, including daily inspections of the chlorine building. The facility houses emergency air and power supply. Self-Contained-Breathing-Apparatus (SCBA) storage occupies locati"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042884,
      "SummaryText": "ons in the office and workroom approximately 100 and 200 feet, respectively, from the chlorination building.\n\n\n\nThe offsite consequence analysis for the Water Filtration Plant includes consideration of two release scenarios for each parameter of concern (chlorine): \n\n1. A Worst-Case Release\n\n2. An Alternative Scenario\n\nThe EPA guidelines define AWorst-Case Release@ resulting from an unspecified failure in which, AThe owner-operator shall assume that the...maximum quantity in the largest vessel...is released as a gas over 10 minutes.@ The same guidelines define an AAlternative Scenario@ as, AMore likely to occur than the worst-case release scenario.@\n\n\n\nPerformance of atmospheric dispersion modeling determines the distance traveled by a parameter of concern before its concentration decreases to the Atoxic endpoint@. The EPA defines Atoxic endpoint@ as 0.0087 mg/L for chlorine. This value corresponds to the Emergency Response Planning Guidelines Level 2 (ERPG-2) concentrations, which the American Industrial Hygiene Association (AIHA) defines as:\n\n\n\nAThe maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one-hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual?s ability to take protection action.@\n\n\n\nThe estimated population potentially affected by the release equals the residential population within the radius of a circle corresponding to the toxic endpoint distance.\n\nThe following conditions define the Worst-Case Release Scenario at the Edinburg Water Filtration Plant:\n\n\n\n?    Failure of two, 1-ton containers resulting in the total release of 4,000 pounds of chlorine;\n\n\n\n?    Release of the entire amount as a gas in 10 minutes;\n\n\n\n?    Use of the one-hour average ERPG-2 as the toxic endpoint;\n\n\n\n?    Consideration of the population residing within a full circle with a radius corresponding to the toxic endpoint distance; and\n\n\n\n?    EPA mandated m"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042884,
      "SummaryText": "eteorological conditions, specifically an F atmospheric stability class, wind speed of 1.5 m/sec., and an air temperature of 77? F.\n\n\n\nA chlorine toxic endpoint of 1.9 miles resulted from atmospheric dispersion modeling for the Worst-Case Release Scenario, potentially affecting a residential population of 34,472. The program, RMP*Comp32 provided by the USEPA, performed the calculations. The USEPA program LandView6 calculated the population estimates.\n\n\n\nThe following conditions defined the Alternative Release Scenario 1 at the Edinburg Water Filtration Plant:\n\n\n\n?    Failure of flexible connections (pigtails) connected to two, 1-ton containers resulting in the total release of 4,000 pounds of chlorine;\n\n\n\n?    Release of the entire amount as a gas in 30 minutes;\n\n\n\n?    Use of the one-hour average ERPG-2 as the toxic endpoint;\n\n\n\n?    Consideration of the population residing within a full circle with a radius corresponding to the toxic endpoint distance; and\n\n\n\n?    EPA mandated meteorological conditions, specifically a D atmospheric stability class, wind speed of 3 m/sec., and an air temperature of 77? F.\n\n\n\nAtmospheric dispersion modeling for the Alternative Release Scenario resulted in a chlorine toxic endpoint distance of 0.2 miles and an estimated residential population potentially affected of 606.\n\n\n\nThe program RMP*Comp32, provided by the USEPA, performed the calculations. The USEPA program LandView6 calculated the population estimates.\n\n\n\nThe following conditions defined the Alternative Release Scenario 2 at the Edinburg Water Filtration Plant:\n\n\n\n?    Failure of a, 1-ton containers resulting in the total release of 2,000 pounds of chlorine;\n\n\n\n?    Release of the entire amount as a gas in 30 minutes;\n\n\n\n?    Use of the one-hour average ERPG-2 as the toxic endpoint;\n\n\n\n?    Consideration of the population residing within a full circle with a radius corresponding to the toxic endpoint distance; and\n\n\n\n?    EPA mandated meteorological conditions, specifically a D atmospheric stability clas"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000042884,
      "SummaryText": "s, wind speed of 3 m/sec., and an air temperature of 77? F.\n\n\n\nAtmospheric dispersion modeling for the Alternative Release Scenario resulted in a chlorine toxic endpoint distance of 0.2 miles and an estimated residential population potentially affected of 606.\n\n\n\nThe program RMP*Comp32, provided by the USEPA, performed the calculations. The USEPA program LandView6 calculated the population estimates.\n\n\n\n\n\n\n\nThe following key elements outline the accidental release prevention program for the Edinburg Water Filtration Plant:\n\n\n\n?    High level of training of the operators;\n\n\n\n?    Preventive maintenance program;\n\n\n\n?    Use of state of the art process and safety equipment;\n\n\n\n?    Use of accurate and effective operating procedures, written with the participation of the operators;\n\n\n\n?    Performance of a hazard review of equipment and procedures;\n\n\n\n?    Implementation of an audit and inspection program.\n\n\n\nChemical specific prevention steps include operator use of available Self-Contained-Breathing-Apparatus (SCBA) during connection/disconnection of the chemical supply, awareness of the hazardous and toxic properties of chlorine and the presence of a chemical detector.\n\n\n\nNo accidental releases of chlorine have occurred at the site in the past five years.\n\n\n\nThe City of Edinburg?s Fire and Police Departments reviewed the facility?s emergency response program. Both departments are members of the Hidalgo County Local Emergency Planning Committee (LEPC). The program includes an emergency response decision tree and a notification plan. Emergency response drills, drill evaluations, and emergency operation and response procedures are reviewed annually."
    }
  ]
}