{
  "FacilityID": 1000100728,
  "FacilityName": "Tanner Industries, Inc.",
  "FacilityStr1": "1159 Wilkes Road",
  "FacilityStr2": null,
  "FacilityCity": "Fayetteville",
  "FacilityState": "NC",
  "FacilityZipCode": "28306",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37051",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "35.025912",
  "FacilityLongDecDegs": "-078.865830",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.tannerind.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 39026802,
  "ParentCompanyName": "Tanner Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Tanner Industries, Inc.",
  "OperatorStr1": "735 Davisville Road",
  "OperatorStr2": null,
  "OperatorCity": "Southampton",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18966",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000201015",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-02-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Fayetteville, NC",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-05-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-05-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-05-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-05-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 35.025912,
  "FRS_Long": -78.86583,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000124716,
      "AltID": "NH3 Distribution",
      "FacilityID": 1000100728,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000155918,
          "ProcessID": 1000124716,
          "ChemicalID": 56,
          "Quantity": 1163682.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000126129,
          "ProcessID": 1000124716,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000107503,
              "Process_NAICS_ID": 1000126129,
              "SafetyReviewDate": "2022-02-25 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-02-25 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-07-30 00:00:00",
              "TrainingReviewDate": "2021-06-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-11-19 00:00:00",
              "EquipmentInspectionDate": "2022-04-22 00:00:00",
              "EquipmentTested": "Compressors, pumps, valves, hoses, storage and transport tanks",
              "ChangeMgmtDate": "2021-11-18 00:00:00",
              "ChangeMgmtReviewDate": "2009-04-29 00:00:00",
              "PreStartupReviewDate": "2012-05-10 00:00:00",
              "ComplianceAuditDate": "2022-01-20 00:00:00",
              "AuditCompletionDate": "2022-01-20 00:00:00",
              "IncidentInvestigationDate": "2012-12-10 00:00:00",
              "InvestigationChangeDate": "2013-01-09 00:00:00",
              "ParticipationPlansReviewDate": "1999-05-15 00:00:00",
              "HotWorkPermitReviewDate": "2019-07-01 00:00:00",
              "ContractorSafetyReviewDate": "2021-10-21 00:00:00",
              "ContractorSafetyEvalDate": "2019-02-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000134702,
                  "PreventionProgram3ID": 1000107503,
                  "ProcessChemicalID": 1000155918
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000100728,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-04-06 00:00:00",
    "ERTrainingDate": "2021-11-22 00:00:00",
    "CoordinatingAgencyName": "Cumberland County LEPC",
    "CoordinatingAgencyPhone": "9197333300",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "OSHA 29 CFR 1910.111& 1200, CGA G-2.1, ASME Boiler & Press. Vess, NEC UBC"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000100728,
      "SummaryText": "ur society associated with a release of this important chemical.  \r\n\r\nWhat Tanner Industries, Inc. Does to Keep Us Safe:\r\n\r\nPrevention Policy Statement:\r\n\r\nThe owners, management and employees of Tanner Industries, Inc. are committed to the prevention of accidental releases of ammonia.  Our company has implemented the standards of the US Occupational Safety and Health Administration (OSHA), 29 CFR 1910.111, Storage and Handling and Anhydrous Ammonia as well as the published provisions of the Compressed Gas Association, CGA G-2.1, Requirements for the Storage and Handling of Anhydrous Ammonia.  Tanner Industries, Inc. has also implemented the standards of OSHA's PSM Program, 29 CFR 1910.119, Process Safety Management of Highly Hazardous Chemicals and the US Environmental Protection Agency (US EPA) Risk Management Program (RMP), 40 CFR 68, Chemical Accident Prevention Provisions.  \r\n\r\nTanner Industries, Inc. is a member of the National Association of Chemical Distributors (NACD) and is committed to Responsible Distribution (RD).  This process is an initiative of the NACD and its member companies designed to provide a system which promotes continuous improvement in the health, safety, security, and environmental performance of all its members.  It is designed to be sensitive and responsive to the public concerns about the chemical industry.  \r\n\r\nAs a member of the NACD, Tanner Industries, Inc. is committed to the continuous improvement in the chemical distribution industries responsible management of chemicals.  We pledge to manage our business according to the Codes of Management Practice of the Responsible Distribution Process.  These codes pertain to:\r\n\r\n1.\tSenior Management Commitment and Risk Management\r\n2.\tCompliance Review and Training\r\n3.\tCarrier Selection and Private Fleet\r\n4.\tHandling and Storage\r\n5.\tJob Procedures and Training\r\n6.\tWaste Management and Resource Conservation\r\n7.\tEmergency Response and Public Preparedness\r\n8.\tCommunity Outreach\r\n9.\tProd"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000100728,
      "SummaryText": "environment, and our employees.  To be prepared for any potential chemical accidents, our company communicates periodically with the Local Emergency Planning Committee (LEPC) and local file departments.  \r\n\r\nThe facility has a written emergency action plan in accordance with US Occupational Health and Safety Administration (OSHA) standard, 29 CFR 1910.38, Emergency Action Plans.  Also, our company has an Emergency Response Plan/Program, in accordance with OSHA standard 29 CFR 1910.120(q), Emergency Response to Hazardous Substance Releases, including pre-emergency planning and employee, customer, and public emergency responder training programs that are specific to anhydrous and aqua ammonia. We have provided state and local authorities the Emergency Planning and Community Right to Know (EPCRA) information as required by the US EPA, SARA Title III standard. \r\n\r\nSheltering in place is considered to be a proven method for protecting people in the event of an accidental release.  To Shelter-In-Place, do the following:\r\n\r\n1.\tMove inside immediately (building or vehicle)\r\n2.\tClose all windows and doors\r\n3.\tTurn off ventilation systems\r\n4.\tGo into and seal a room (use tape, towels etc. to seal doors and windows if possible)\r\n5.\tUse radio, phone, etc. for communications"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000100728,
      "SummaryText": "ing pursuant to all applicable regulatory and corporate guidelines.  \r\n\r\nh)\tInvestigation of any accident or injury with the development and implementation of corrective action plans in order to prevent re-occurrence at any of our facilities.  \r\n\r\ni)\tRoutine audits and inspections are performed by both Tanner Industries, Inc. management and outside agencies to ensure safe and correct procedures are employed, and to identify areas where safety can be improved.  \r\n\r\nj)\tCoordination of planning efforts with Local Emergency Planning Committees (LEPC's), fire departments, and Hazmat Units.\r\nOff-Site Consequence Analysis:\r\n\r\nRelease scenarios were modeled using the Aerial Locations of Hazardous Atmospheres (ALOHA) software developed by the US environmental Protection Agency.  The off-site area impacted by the release could experience ammonia concentrations of 0.14 mg/L as defined in Appendix A to part 68 in CFR Title 40.  Please refer Section 2, Worst Case Release Scenario of the Risk Management Plan and Section 3, Alternative Case Release Scenario of the Risk Management Plan for further information.  \r\n\r\nFive Year Accident History:\r\n\r\nThere have been no unintentional releases of ammonia at the Tanner Industries, Inc., Fayetteville, North Carolina facility in the past five years that meet the US EPA Risk Management Program (RMP) defined reporting requirements.  \r\n\r\nThere have been no unintentional ammonia releases at our facility that have been reported to federal, state and local authorities in the past five years under the requirements of US EPA's Superfund Amendments and Reauthorization Act (SARA) Title III, Emergency Planning and Community Right to Know Act (EPCRA).  \r\n\r\nEmergency Response Procedures:\r\n\r\nEmergency Response Policy Statement:\r\n\r\nThe owners, management and employees of Tanner Industries, Inc. are prepared to cooperate with local emergency responders and other authorities to mitigate any release and minimize the impact of any release to the community, the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000100728,
      "SummaryText": "al Achievement Award for leadership, commitment, and dedication to the National TRANSCAER initiative for 10 consecutive years 2012 - 2021.\r\n\r\nTanner Industries, Inc. uses a variety of safety equipment and specialized procedures to prevent accidental releases of anhydrous ammonia.  In support if our policy, the following is a typical list of safety equipment and systems employed at this facility.\r\n\r\na)\tPneumatically actuated emergency shutoff valves (ESV's) are designed to stop the flow of anhydrous ammonia from all stationary storage vessels and rail cars.  Several emergency shutoff switches have been placed in easily accessible remote locations throughout the facility.  Operation of any one emergency shutoff switch shall activate the closure of all emergency shutoff valves simultaneously.  \r\n\r\nb)\tFixed ammonia detectors equipped with alarm are placed throughout the facility.\r\n\r\nc)\tPressure relief valves are employed on all delivery equipment and storage tanks to handle unexpected increases in pressure.  Per their operational design, these valves will reset after relieving only the excess pressure.  Depending on their situational placement in the process, these valves may be designed to relieve pressures cause from either vapor or liquid.  \r\n\r\nd)\tExcess flow shut off devices are incorporated as prescribed by federal regulation.  These valves are designed to stop flow of liquid material any time their rated flow capacity is exceeded.  These valves are designed to prevent the catastrophic release.  \r\n\r\ne)\tRegular facility and equipment inspections ensure safety and proper operating conditions.  \r\n\r\nf)\tEmployees are trained in start-up, operation, shut-down, and maintenance of all equipment.  The facility has a copy of the Standard Operating Procedures that are required to perform these tasks and employees are required to follow these procedures and encouraged to reference them as needed.  \r\n\r\ng)\tEmployees and contractors receive extensive health care and safety train"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000100728,
      "SummaryText": "uct Stewardship\r\n10.\tInternal Audits\r\n11.\tCorrective and Preventative Action\r\n12.\tDocument and Records Control\r\n13.\tSecurity\r\n\r\nTanner Industries, Inc. was the recipient of the Chemical Education Foundation's 1996 Product Stewardship Award - Chemical Distributor Category, for exhibiting excellence in fostering chemical product stewardship. In 2001, Tanner Industries, Inc. was the recipient of the Facility Leadership Award presented by the Philadelphia Local Emergency Planning Committee (PLEPC). Tanner received the award for its Ammonia Safety & Emergency Response programs that it facilitates. In December 2002, David Binder, Director of Quality, Safety & Regulatory Affairs at Tanner was presented EPA Region III's Partnership Award in recognition of significant efforts towards emergency preparedness, prevention and response programs. In 2009, 2015, and 2016 Tanner Industries, Inc. was presented with the Private Industry Award by the Philadelphia Fire Department, Hazardous Materials Task Force. Tanner was nominated and received the award for its outstanding support, which has included training programs and training materials, in assisting with the development and excellence of the Hazmat unit. In 2010 and 2020, David Binder was awarded the Chairman's Award by TRANSCAER (Transportation Community Awareness and Emergency Response), which is a voluntary national outreach effort that focuses on assisting communities to prepare for and respond to a possible hazardous materials transportation incident. TRANSCAER members consist of volunteer representatives from the chemical manufacturing, transportation, distributor, and emergency response industries, as well as industry associations and government agencies. Mr. Binder was honored for Tanner's active role with the success of the trailblazing anhydrous ammonia training program carried out in cities and states across the nation, including on line Learning Management Systems. Tanner Industries, Inc., has received the Nation"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000100728,
      "SummaryText": "s to retreat from ammonia atmospheres.  High concentrations could have more serious health effects.  These could include convulsive coughing, difficult and painful breathing, eye damage and in extreme cases, death.  Liquid ammonia or ammonia solution contact of the eyes or skin can produce serious chemical burns requiring prompt medical attention.  \r\n\r\nEmployees and contractors who work around ammonia should take the extra precautions of reviewing Safety Data Sheets (SDS's), wearing appropriate safety equipment and participating in special training programs as prescribed by the Occupational Safety and Health Administration and other agencies.\r\n\r\nSafety Improvement Process:\r\n\r\nSafety improvement is a corporate wide philosophy.  Tanner Industries, Inc. continuously searches for ways to improve safety performance.  Each region (North, South and Midwest) has a safety committee comprised of site employees, drivers, sales personnel, and management.  These committees meet on a periodic basis to review safety concerns at our sites as well as at our customer facilities.  The management representatives of the site specific committee report directly to the corporate safety committee.  The corporate safety committee is comprised of upper management, compliance personnel, safety management, field personnel such as plant operators and drivers and headquarters employees that are familiar with plant processes.  This committee meets on a regular basis to review accident and injury investigations, evaluate site specific issues and provide recommendations and implementation guidance.  Also, qualified personnel periodically inspect and evaluate each facility to assess safety and maintenance conditions.  The results of these facility inspections are reported directly to upper management and the operations department.  As a whole, these systems provide Tanner Industries, Inc. with a continuous process for the identification and safety improvement opportunities thus reducing any risk to o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000100728,
      "SummaryText": "y response training for first responders and other industry personnel to enhance the protection of our employees and community neighbors. \r\n\r\nTanner Industries, Inc. is a distributor of anhydrous ammonia.  We are not a manufacturer.  The material is transported to our facility by transport cargo tank for the bulk distribution to the end-users of the material.  \r\n\r\nThe potential maximum quantity of anhydrous ammonia that could be stored at this facility on any particular day is approximately 540,000 pounds.  It would be extremely rare for this potential quantity to be on site on any particular day.  Each ammonia tank is limited by federal regulation to approximately 85% of the maximum volume of the vessel.  \r\n\r\nBenefits and Uses of Ammonia:\r\n\r\nAmmonia is a basic chemical that has many common manufacturing and practical uses.  Throughout the world, the largest users of ammonia are agricultural industries.  Ammonia itself is applied directly by farmers as a fertilizer.  Some agricultural businesses combine ammonia with other chemicals and nutrients to form more complex fertilizers.  Other common products that are made with ammonia include textiles, pharmaceuticals, cleaning solutions, dyes, inks and food packaging products.  Ammonia is also used by some companies in various processes.  Ammonia is recognized as an ozone safe refrigerant.  This means that, unlike other refrigerants, any ammonia releases into the atmosphere will not harm the earth's ozone layer.  Besides refrigeration, ammonia is used in some common processes like drinking water purification, air and water pollution control, waste treatment, and the heat treating or hardening of metal parts.  \r\n\r\nPotential Health Effects of Ammonia:\r\n\r\nEven in small concentrations, ammonia is irritating to the eyes, throat and breathing passages.  Accompanied with a very pungent odor, ammonia can be said to be auto-repulsive.  These characteristics provide us with an early warning of the materials presence and force u"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000100728,
      "SummaryText": "Executive Summary\r\nRisk Management Plan:\r\n  Fayetteville, NC (EPA ID: 100000201015)\r\n\r\nToxic Material:\r\n  Ammonia\r\n\r\nFacility:\r\n  Tanner Industries, Inc.\r\n  1159 Wilkes Road\r\n  Fayetteville, NC 28306\r\n\r\nCorporate Headquarters:\r\n  Tanner Industries, Inc.\r\n  735 Davisville Road\r\n  Third Floor\r\n  Southampton, PA 18966\r\n\r\nCorporate Contact for Further Information:\r\n  David B. Binder\r\n  Director, Quality, Safety & Regulatory Affairs\r\n  Telephone: 215-322-1238\r\n  Fax: 215-322-7791\r\n  Email: dbinder@tannerind.com\r\n  Internet Site: www.tannerind.com\r\n\r\nPlan Revision Date: \r\n  May 8, 2022\r\n\r\nCompany and Facility History:\r\n\r\nTanner Industries, Inc. is a family owned and operated distributor of anhydrous and aqua ammonia, headquartered in Southampton, Pennsylvania.  The Tanner Family started out in the ammonia business in 1955 with the purchase of National Ammonia Company in Philadelphia, Pennsylvania.  The company has grown to its current operations through the acquisition of three other ammonia companies, Bower Ammonia and Chemical Co. in 1971, Northeastern Ammonia Co. in 1985, and Hamler Industries in 1991.  This particular facility was established in 2007.\r\n\r\nThe mission of Tanner Industries, Inc. is to constantly improve our products and services to meet or exceed our customer's needs, to distribute our products in a safe, efficient and environmentally responsible manner, and to generate a reasonable return in order to provide continuity for the business and employment for our employees.  \r\n\r\nTanner Industries, Inc. is firmly committed to a fully effective implementation of the Risk Management Plan (RMP) as it applies to the safe distribution of ammonia.  Our commitment to Responsible Distribution (RD) provides our company with an integrated health and safety, environmental, security, and product stewardship program that is supported by our strong corporate capabilities.  Our dedication to the proper distribution and stewardship of ammonia includes involvement in emergenc"
    }
  ]
}