{
  "FacilityID": 1000000997,
  "FacilityName": "Praxair - Theodore, AL",
  "FacilityStr1": "4200 DeGussa Road",
  "FacilityStr2": null,
  "FacilityCity": "Theodore",
  "FacilityState": "AL",
  "FacilityZipCode": "36582",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.515265",
  "FacilityLongDecDegs": "-088.13461",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.praxair.com",
  "FacilityEmailAddress": "info@praxair.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Praxair, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 197154586,
  "Company2DUNS": 197154586,
  "OperatorName": "Praxair, Inc.",
  "OperatorStr1": "P.O. Box 1099",
  "OperatorStr2": null,
  "OperatorCity": "Theodore",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36590",
  "OperatorZipCodeExt": null,
  "RMPContact": "Timothy Volk",
  "RMPTitle": "Plant Supt",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000151621",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-10-19 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-10-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-05-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-05-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-05-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.51772,
  "FRS_Long": -88.13217,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "55",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001226,
      "AltID": "Hydrogen Storage",
      "FacilityID": 1000000997,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000001310,
          "ProcessID": 1000001226,
          "NAICSCode": "32512",
          "_desc": {
            "NAICS_CODE": "32512",
            "NAICS_DESCRIPTION": "Industrial Gas Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001270,
          "ProcessID": 1000001226,
          "ChemicalID": 149,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 149,
            "ChemicalName": "Hydrogen",
            "CASNumber": "1333-74-0",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000501270,
          "ProcessID": 1000001226,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000997,
      "SummaryText": "Facility Description\n\nThe Praxair facility at Theodore, Alabama is a hydrogen storage location. We deliver liquid hydrogen, primarily from our McIntosh, AL plant, into two cryogenic storage vessels.  The liquid hydrogen is then vaporized (converted to gas)and the hydrogen gas is then transferred via pipeline to three nearby customers.  \n\nRegulated Substances\n\nThis facility uses, manufactures, or stores a chemical listed in part 68 of Title 40 of the Code of Federal Regulations, beyond a threshold quantity, as established by the EPA; \nLiquid Hydrogen is stored on site. The liquid hydrogen is vaporized into gas and supplied to customers via pipeline.\n\n\nAccidental Release Prevention Policy\n\nPraxair is dedicated to being the best performing industrial gas company in all aspects of our business, including safety, health, and environmental affairs. Our safety, health, and environmental policy call for a commitment to protecting the health and safety of our employees, neighbors, and the surrounding environment. This policy is the basis for engineering and construction programs that produce equipment and process systems that minimize the possibility of accidental chemical releases and operational safety programs that ensure safe operation of our facilities. Praxair is committed to the continuous improvement of these programs.\n\nPraxair is an active member of the American Chemistry Council and subscribes to the council's program of Responsible CareA? Employee Health and Safety Code of Management Practices.\n\n\nPrevention Program\n\nIn accordance with OSHA's Process Safety Management standard and EPA's Risk Management Program rule, the Theodore, AL Hydrogen Station has a comprehensive accident prevention program in place. This program is built around process safety concepts such as:\n- Technical documentation of Process Safety Information, describing the physical properties of the hazardous substances, the safety systems in place to control these substances, and the critical operat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000997,
      "SummaryText": "ing parameters of the associated equipment and systems.\n- Procedures and programs to develop, maintain, and control key program elements such as process operations, equipment mechanical integrity, employee training, management of change, hot work permits, incident investigation, and contractor activity. \n- Initial and periodic review of new or modified processes through application of comprehensive design safety and management of change programs that include Process Hazard Analysis study and pre-startup review. \n\nPraxair has an employee participation program that promotes involvement in the process safety program and helps ensure understanding of facility-specific elements of the safety program.\n\nThe prevention program is audited periodically, by our corporate assessment group, to ensure that the process safety concepts and practices are in place and working effectively.\n\n\nChemical-specific Prevention Steps\n\nIn addition to the required prevention program elements, we have implemented safety features specific to the covered process at our facility. Following is a description of some of these safety features.\n\nThe liquid hydrogen storage tanks are equipped with a remote isolation switch that can remotely isolate the tanks in the event of a spill or release.  The tanks are also equipped with a dual relief system which includes bursting disc and pressure relief valves that discharge to a properly designed relief valve vent system.  The hydrogen gas pipeline is protected by a low pressure pipeline alarm and a hydrogen line low temperature protection device.\n\n\nFive-year Accident History\n\nThe Theodore Hydrogen Station facility accident history indicates continuous safe operation of our covered chemical process over the last five years. There were no covered process releases that resulted in an EPA RMP recordable accident.\n\n\nEmergency Response Programs\n\nPraxair has an emergency response program in place to minimize the effects of accidental release of regulated substances o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000997,
      "SummaryText": "n employees, the public, and the environment. The Theodore Hydrogen Station location will be a \"non-responding facility\" as defined in section 8.1 of the CEPPO General Guidance for Risk Management Programs (July 1998), i.e. Praxair employees will respond to minor incidents.\n\nFor other than minor incidents Praxair has in place an emergency response plan in coordination with the Mobile County LEPC and the Mobile fire department.\n\nAll facility employees are trained in their role in the emergency plan and emergency drills are conducted at least annually.\n\n\nPlanned Changes to Improve Safety\n\nPraxair has a commitment to safety that is expressed in a company-wide goal of \"Zero/Zero\", which means zero accidents and zero injuries or illnesses at each and every location. We look to constantly improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees.\n\nThere are currently no major projects for safety improvement that have reached the planning stage."
    }
  ]
}