{
  "FacilityID": 1000081456,
  "FacilityName": "JAIN Farm Fresh Frozen Ingredients Division",
  "FacilityStr1": "2525 Cooper Ave",
  "FacilityStr2": null,
  "FacilityCity": "Merced",
  "FacilityState": "CA",
  "FacilityZipCode": "95348",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06047",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "37.316833",
  "FacilityLongDecDegs": "-120.516479",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "JAIN Farm Fresh Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "JAIN Farm Fresh Foods, Inc.",
  "OperatorStr1": "2525 Cooper Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Merced",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95348",
  "OperatorZipCodeExt": null,
  "FTE": 61,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000242365",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-04-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-08-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-08-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-08-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101799,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000081456,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127652,
          "ProcessID": 1000101799,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000103081,
          "ProcessID": 1000101799,
          "NAICSCode": "311412",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000086006,
              "Process_NAICS_ID": 1000103081,
              "SafetyReviewDate": "2018-08-19 00:00:00",
              "PHA_Date": "2018-08-19 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-06-01 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-09-25 00:00:00",
              "TrainingReviewDate": "2018-09-25 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 0,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-09-25 00:00:00",
              "EquipmentInspectionDate": "2019-07-23 00:00:00",
              "EquipmentTested": "Evaporative Condenser, compressors, vessels",
              "ChangeMgmtDate": "2019-01-17 00:00:00",
              "ChangeMgmtReviewDate": "2018-09-25 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2018-09-25 00:00:00",
              "AuditCompletionDate": "2019-12-01 00:00:00",
              "IncidentInvestigationDate": "2013-07-24 00:00:00",
              "InvestigationChangeDate": "2013-10-01 00:00:00",
              "ParticipationPlansReviewDate": "2018-09-25 00:00:00",
              "HotWorkPermitReviewDate": "2018-09-25 00:00:00",
              "ContractorSafetyReviewDate": "2018-09-25 00:00:00",
              "ContractorSafetyEvalDate": "2019-01-17 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000107345,
                  "PreventionProgram3ID": 1000086006,
                  "ProcessChemicalID": 1000127652
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081456,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Merced County Environmental Health",
    "CoordinatingAgencyPhone": "2093811094",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081456,
      "SummaryText": "Executive Summary \n\n\n\nIntroduction\n\nThe Risk Management Program at  JAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) complies with US EPA and CalARP requirements. International Institute of Ammonia Refrigeration's (IIAR) RMP and PSM Guidelines have been implemented at this facility. Recent changes in operation require additional NH3 inventory for easier start-up. The plant was originally designed for future maximum capacity of 11,550 lbs in the largest vessel. By operating at this level now gives us more flexibility.\n\n\n\nThe procedures for complying with the RM Program regulations are outlined by the following major steps:\n\n1.    Identify Covered Processes\n\n2.    Determine Program Level\n\n3.    Establish a Management System\n\n4.    Conduct a 5 year Accident History\n\n5.    Perform Hazard Assessments\n\n6.    Develop an Accident Prevention Program\n\n7.    Develop an Emergency Response Program and\n\n8.    Prepare a Risk Management Plan (RMP)\n\n\n\nPublication or sharing of OCA portions of RMP materials can be in violation of the Chemical Safety Information, Site Security and Fuels Regulatory Relief Act (PL106-40). \n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\nWe at JAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n2.    The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass Packing and storage of fresh produce..  We have 1 regulated substance present at our facility.  These substance is Ammonia (anhydrous).  Ammonia (anhydrous) is used for Refrigeration.\n\n\n\n3.    The Worst Case Release Scenario(s) and the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081456,
      "SummaryText": "Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\nThe worst-case release scenario mandated by the RMP Rule is a standardized hypothetical situation intended to promote \"dialogue\". According to the International Institute of Ammonia Refrigeration \"The worst-case situation represents an extremely improbable (and for many facilities impossible) set of circumstances rather than a credible accident scenario. Release quantities and hazard distances derived therefrom for the worst-case scenario should not be used as a basis for emergency response planning.\"\n\n\n\nTo evaluate the worst case scenarios, we have used the EPA's RMP Guidance for Ammonia Refrigeration Reference Tables or Equations and Public Domain Software (RMP Comp).  For alternative release scenario analyses, we have employed the EPA's OCA Guidance Reference Tables or Equations.  The following paragraphs provide details of the chosen scenarios.\n\n\n\nThe worst case release scenario submitted for Program 2 and 3 toxic substances as a class involves a catastrophic release from Ammonia Refrigeration System.  In this scenario 11,550 lb. of Ammonia (80% of largest vessel) is released.  The toxic liquid released inside an enclosed space in direct contact with outside is assumed to form a 1 cm deep pool from which evaporation takes place.  The entire pool is estimated to evaporate over 10 minutes.  At Class F atmospheric stability and 1.5 m/s windspeed, the maximum distance of 0.9 miles is obtained corresponding to a toxic endpoint of 0.14 mg/L.\n\n\n\nThe alternative release scenario for Ammonia (anhydrous) involves a release from Ammonia Refrigeration system compressor.  The scenario involves the release of 360 lb. of toxic gas from a compressor shaft seal leak.  It's assumed the system would be manually and/or automatically shut down in no more than 30 minutes Under neutral weather conditions, the maximum distance to the toxic endpoi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081456,
      "SummaryText": "nt of 0.14 mg/L of Ammonia (anhydrous) is 0.1 miles.\n\n\n\n4.    The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with NFPA-58 Standard, and applicable 2007 CA Mechanical Code.  The following sections briefly describe the elements of the release prevention program that is in place at our stationary source.\n\n\n\nProcess Safety Information\n\nJAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodology used to carry out these analyses is What If/Checklist (combined).  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated or replaced if required at a regular interval of 5 years.  Any findings related to the hazard analysis are addressed in a timely manner and not more than 2.5 years.  The most recent PHA/update was performed on 08/19/2018.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, JAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is annually reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nJAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) ha"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081456,
      "SummaryText": "s a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every 3 years and more frequently as needed.\n\n\n\nMechanical Integrity\n\nJAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at JAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at JAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division).  The most recent review was performed at the new system start-up.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nJAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081456,
      "SummaryText": "The most recent Compliance Audit was conducted on 09/25/2018.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nJAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nJAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses in particular.\n\n\n\nHot Work Permit\n\nAt JAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) Hot Work Permit procedures are in place and enforced. Preventing accidents related to welding and cutting while alerting others at the facility that this type of work is occuring are important prevention steps.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  JAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated subs"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000081456,
      "SummaryText": "tance occur.\n\n\n\n5.    Five-year Accident History\n\nJAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) has had an excellent record of preventing accidental releases over the last 5 years.  Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\n6.    Emergency Response Plan\n\nJAIN Farm Fresh Foods, Inc. (Frozen Ingredients Division) carries a written Emergency Action Plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of evaluation, health and safety, mitigation and notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas. We coordinate with the local fire department and CUPA.\n\n\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency actions.\n\n\n\nCounty of Merced is the Local Emergency Planning Committee (LEPC) with which our emergency plan has been coordinated and verified.\n\n\n\n7.    Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  We had 8 recommendations from the most recent Compliance Audit and 10 recommendations from the most recent PHA. These reflect new RAGAGEP recommendations and additional training for new employees. Some specific areas are adding labels for alarms and emergency controls, more frequent calibration of sensors and also adding an additional emergency shower and eye wash are some of the steps we are taking to improve safety at our facility.  \n\n"
    }
  ]
}