{
  "FacilityID": 1000059801,
  "FacilityName": "SEMCO North",
  "FacilityStr1": "20 Harris Place",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.639722",
  "FacilityLongDecDegs": "-121.610833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "steinbeckproduce.com",
  "FacilityEmailAddress": "info@steinbeckproduce.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Steinbeck Country Produce, Inc.",
  "Company2Name": "American Cooling, Inc.",
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "American Cooling, Inc.",
  "OperatorStr1": "20 Harris Place",
  "OperatorStr2": "Suite B",
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000212245",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-05-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-08-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-08-31 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-08-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-08-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.639722,
  "FRS_Long": -121.610833,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074671,
      "AltID": "Basic Inorganic Chemicals",
      "FacilityID": 1000059801,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092318,
          "ProcessID": 1000074671,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000075833,
          "ProcessID": 1000074671,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000062777,
              "Process_NAICS_ID": 1000075833,
              "SafetyReviewDate": "2016-08-17 00:00:00",
              "PHA_Date": "2016-05-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-03-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Operator error, no flow, low level, lack of maintenance, design deficiency, physical damage, & vandalism/terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-06-01 00:00:00",
              "TrainingReviewDate": "2016-08-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Tailgates",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-08-01 00:00:00",
              "EquipmentInspectionDate": "2016-08-11 00:00:00",
              "EquipmentTested": "All refrigeration equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2016-08-01 00:00:00",
              "PreStartupReviewDate": "2016-04-01 00:00:00",
              "ComplianceAuditDate": "2016-08-01 00:00:00",
              "AuditCompletionDate": "2017-06-30 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2016-08-01 00:00:00",
              "HotWorkPermitReviewDate": "2016-08-01 00:00:00",
              "ContractorSafetyReviewDate": "2016-08-01 00:00:00",
              "ContractorSafetyEvalDate": "2016-08-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000076857,
                  "PreventionProgram3ID": 1000062777,
                  "ProcessChemicalID": 1000092318
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000059801,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2016-08-01 00:00:00",
    "ERTrainingDate": "2016-08-01 00:00:00",
    "CoordinatingAgencyName": "Monterey County Health Department",
    "CoordinatingAgencyPhone": "8317554971",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000059801,
      "SummaryText": "nnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059801,
      "SummaryText": "ing the season when they are on site. Facility operates seasonally from approximately April 15 through November 15. The facility pumps down all the ammonia in the system to the high pressure receiver during the off season. All of the portable systems except the ice maker are removed from the site during the off season. Facility does not have refrigeration machinery room and all of the refrigeration equipment except cold room fan coils are located out doors. All compressors have safety switches that would shut down the compressors upon detection of unsafe operating conditions. Visual and audible alarms are installed on the suction accumulator and low pressure receiver in case of high level situation arises in the vessel. Suction accumulator high level float switch also shuts down the compressors when it senses high liquid level in the vessel. Refrigeration control panel inside the electrical room schedules the fan coil defrost times and monitors the ammonia detectors inside the cold rooms. System sends alarms to refrigeration manager in case of ammonia detected in cold rooms. All pressure vessels and compressors are protected against high-pressure situations by safety relief valves. There are assigned responders (refrigeration contractors) experienced with ammonia refrigeration that would respond to and determine specific actions for any incident. The refrigeration systems at the facility were constructed as per applicable codes and industry standards at the time of construction. The total ammonia charge of the refrigeration systems at the facility is approximately 18,000 lb. Refrigeration drawings are located in Appendix A.2-System Drawings in the hardcopy RMP. A list of refrigeration equipment used at this facility can be found in Appendix F of the hardcopy RMP. Fixed and portable refrigeration equipment locations can be found on the plans located on sheets R1.0, R2.0 and R2.1 in the hardcopy RMP. International Institute of Ammonia Refrigeration (IIAR) Ammonia Ref"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059801,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\r\n\r\nSEMCO North conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required. On-site personnel provide initial emergency response. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. Refrigeration contractors would also be on-call to provide emergency response. Emergency response training will be conducted yearly for current employees and as required to for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\r\n\r\n\r\n2. Stationary Source and Regulated Substances Handled\r\n\r\nSEMCO North uses anhydrous ammonia as a refrigerant in their operations. See Appendix A.2 of the hardcopy RMP for the drawings showing the facility location map and site plan. The ammonia system is used for cold storage, vacuum cooling and ice generation. The refrigeration system at the facility is composed of both fixed and portable equipment. Fixed system includes, evaporative condensers, pressure vessels, cold room evaporative cooling coils, ammonia detection, control systems and diffusion tanks. Portable systems are refrigeration high side trailer, compressor skids, ice generator, and three half car vacuum tubes. All of the portable systems are operated as connected to main system dur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059801,
      "SummaryText": "rigeration Safety Inspection Checklists, located in Appendix A.1 of the hardcopy RMP, describe equipment details. The refrigeration systems at this facility are single-stage vapor compression cycles. In general, the process chemistries for these systems are shown in Section V.A.2 in the hardcopy RMP. Anhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See Appendix A.4 for Material Safety Data Sheets (MSDS) for anhydrous ammonia.\r\n\r\n3. General Accidental Release Prevention Program\r\n\r\nSEMCO North maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release, see Appendix J-Incident Investigation in the hardcopy RMP. The ammonia refrigeration system has specific safety procedures to prevent a release. Operators, contractors and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency reporting and monitoring and assisting local emergency responders in the event of an ammonia release. There are emergency shut-off switches in the equipment yard for shutting down the king valve and turn off the pumps. Ammonia detectors are installed in all refrigerated rooms. Personnel will automatically be notified if any detector exceeds its set point. Monitoring is done 24 hours per day. All of the relief valves at the facility are tied into the ammonia dif"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059801,
      "SummaryText": "fusion tanks to prevent high-pressure releases to ambient.\r\n\r\n4. Five-Year Accident History\r\n\r\nAccording to SEMCO North personnel, there has been no releases of anhydrous ammonia in the last 5 years. \r\n\r\n5. Emergency Response Program\r\n\r\nSEMCO North is a Non-Responding facility. Facility is only respond to situations that are within their capabilities. These may include, emergency shutdown, equipment isolation and pumping down the system. No emergency response actions or site clean-up that are beyond the capabilities of the refrigeration personnel will be performed. In case of an emergency, incident will be reported immediately to Safety Coordinator, Facility Managers, and RMP administrator. The Safety Coordinator is responsible in assisting county emergency responders upon arrival on site. This may include contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The Safety Coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required.\r\n\r\n6. Planned Changes to Improve Safety\r\n\r\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed on the tables located in Section VIII in the hardcopy RMP. The table items are a result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, and a Safety Inspection performed by a qualified person. Some corrective items in the recommendation table originate from multiple codes but are listed only once. Specific facility areas and systems categorize recommendations resulting from the Safety Inspection; some of which may repeat general Process Hazard Analysis and Code Compliance Review items. Based on the severity of the hazards identified, implementation deadlines are also recommended. All refrigeration equipment is well maintained and operated in a safe manner by trained perso"
    }
  ]
}