{
  "FacilityID": 1000088868,
  "FacilityName": "Kemira Chemicals, Inc.",
  "FacilityStr1": "1525 Church Street Extension",
  "FacilityStr2": null,
  "FacilityCity": "Marietta",
  "FacilityState": "GA",
  "FacilityZipCode": "30060",
  "Facility4DigitZipExt": "1023",
  "FacilityCountyFIPS": "13067",
  "LEPC": "Cobb County Resource Council",
  "FacilityLatDecDegs": "33.977973",
  "FacilityLongDecDegs": "-084.558388",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.kemira.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 106893048,
  "ParentCompanyName": "Kemira Specialty Chemicals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 33870585,
  "Company2DUNS": 33870585,
  "OperatorName": "Kemira Chemicals, Inc.",
  "OperatorStr1": "1000 Parkwood Circle",
  "OperatorStr2": "Suite 500",
  "OperatorCity": "Atlanta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30339",
  "OperatorZipCodeExt": "2130",
  "RMPContact": "Joseph Garman",
  "RMPTitle": "Plant Manager",
  "FTE": 57,
  "OtherEPAFacilityID": "GAD003268885",
  "EPAFacilityID": "100000051392",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-07-18 00:00:00",
  "SafetyInspectionBy": "U.S. D.O.T. Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-08-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-08-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-08-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-08-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.98006,
  "FRS_Long": -84.56567,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110495,
      "AltID": "Ammonia Neutralized",
      "FacilityID": 1000088868,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000111768,
          "ProcessID": 1000110495,
          "NAICSCode": "32519",
          "_desc": {
            "NAICS_CODE": "32519",
            "NAICS_DESCRIPTION": "Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000137917,
          "ProcessID": 1000110495,
          "ChemicalID": 57,
          "Quantity": 71000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000637917,
          "ProcessID": 1000110495,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000088868,
      "SummaryText": "Kemira Chemicals, Inc. RMP Submission - 2020 Update\n\nMarietta Plant \n\n\n\nExecutive Summary \n\n\n\nKemira Chemicals, Inc. is a chemical manufacturing company with headquarters based in Atlanta, GA.  We produce products for several diverse industries, including the paper manufacturing, mining, paint manufacturing, water treatment, and oil and gas industries.\n\n\n\nThe Marietta plant manufactures products for the paper, paint, mining, and oil and gas markets.  The portion of the plant that is covered by Risk Management makes acrylic polymers that are sold to companies in the above markets.  The polymer production facility has been in operation for 44 years, utilizing process control instrumentation as well as emissions control units including various packed scrubbers and an onsite wastewater pretreatment plant.\n\n\n\nOSHA regulations (Process Safety Management) for several years have required that multiple Layers of Protection be included during design, before startup and to continue through operations and training of all employees.  These Layers of Protection are maintained today as part of our Risk Management Programs.   The polymer plant currently uses one raw material that is covered under Risk Management: ammonia solution.  \n\n\n\nAmmonium Hydroxide Solution:\n\nColorless liquid with a pungent, ammonia odor\n\nLiquid ammonium hydroxide is lighter than water\n\nAmmonia vapor is lighter than air\n\nContact with the eyes can result in severe irritation or blindness\n\nContact with the skin can cause burns or blistering\n\nInhalation of high concentrations can cause respiratory distress\n\n\n\nAs part of Kemira's stewardship and safety programs, we recognize the hazards of handling and processing ammonia.  The design of our ammonia storage and handling systems takes all of the hazards of each material into consideration.  Materials handling, from unloading through process vessels are in closed venting systems or when venting is required, is routed through scrubbers designed to minimize emissions "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000088868,
      "SummaryText": "to the atmosphere.  We receive tank truck shipments of refrigerated ammonium hydroxide solution.  Our storage tank is insulated and temperature controlled.\n\n\n\nThe polymer reaction systems (as well as loading and unloading systems) are monitored by computers and by trained operators.  Interlocks in the computer logic, for example, are designed to prevent a storage tank from being overfilled.  Operator double-checks are in place to assure all valves are in the proper position and that all safety observations and checks are properly completed.\n\n\n\nAll material transfers are through closed systems.  Vapor return lines are used in most unloading procedures to return the displaced vapor to the delivery vehicle.  Additionally, all reaction vessels vent via a series scrubber unit.  Vent lines from the monomer storage tanks and monomer feed tanks are hard piped to the scrubber as well.\n\n\n\nAccident History:  In the past five years, this facility has had no incidents with RMP regulated materials causing an offsite consequence.  We have experienced occasions when citizens have reported objectionable odors coming from the Marietta plant.  There have been no reported offsite consequences.  Regardless, we have an obligation to determine the source(s) of these odors and to take actions to prevent a recurrence.  In each instance of an odor complaint, we have investigated the cause and, as applicable, corrected the problem and/or taken actions to prevent a recurrence.\n\n\n\n\n\nGoals:  The goal at Kemira is to produce quality products and to produce them safely.  We have systems in place that are designed to prevent accidents to safeguard our employees, our community, and our environment.  Following is a partial listing of the Layers of Protection that we employ in our everyday activities.\n\n\n\nDesign: Since the inception of OSHA's Process Safety Management requirements, we used best engineering practices to assure our systems would operate as intended.  All changes or additions to the proce"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000088868,
      "SummaryText": "sses undergo a formal review and approval procedure.  This triggers hazard analysis and design safety reviews as necessary.  We have concrete dikes to catch any spilled materials.\n\n\n\nAll of our valve systems are designed to fail in safe positions.  This means that in the event of a computer failure or loss of electrical or air power, valves will return open or closed as necessary to the \"safe\" position.  In addition, we have both backup battery systems for computers and an auxiliary generator in case of power failure.\n\n\n\nOn a regular schedule, we are required to complete a comprehensive review of the hazards and operability of our entire production system.  If we find a valve, pipe, tank, or pump that might fail and allow a release or an incident, we will correct it immediately.\n\n\n\nMaintenance:  We have formal mechanical integrity and preventative maintenance programs in place.  Tanks and piping undergo thickness testing for assessing life and to determine needs for repair or replacement before failure.  Our operators will recheck equipment before operating it, after maintenance has been performed on it.  Using a combination of safety and quality programs, all of our instruments are calibrated and our storage and transfer systems are tested on a regular basis.\n\n\n\nSafe Operations:  Our employees are essential to the safe operation of our plant.  Their training, their experience, their observations, and their knowledge of how to respond to situations is the basis of safe operations.  These people apply their knowledge and training in their everyday actions.  All activities in the polymer plant - from unloading railcars to filling trucks with finished product - are restricted to trained, designated employees.\n\n\n\nActivities in the polymer plant are computer aided.  This means that some actions taken by an operator are checked against an internal list in the computer's memory as well as with remote sensors to make sure it is the correct action.  On plant operations desig"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000088868,
      "SummaryText": "nated as having high risk potential, we have systems designed to automatically manage emergency interlocks that will shut down selected transfers to some vessels, shut down pumps, or automatically cool vessels.\n\n\n\nThe equipment and systems that contain these materials are closed; that is, the materials are contained in equipment that is designed to prevent materials from reaching the atmosphere or environment.  This extends from the time we unload a railcar of raw materials until we move them through storage tanks to the processing vessels.\n\n\n\nAuditing:  Kemira's Quality System at Marietta is certified according to ISO9001 standards.  While directed at quality, the training and documentation requirements of ISO guidelines are quite similar to those for OSHA and EPA under Process Safety Management and Risk Management.\n\n\n\nIn addition to the audits required by all three of these guidelines, we are regularly visited, inspected and/or audited by regulatory agencies.\n\n\n\nEmergency Response:  Our operators are trained to identify unusual occurrences.  We have Emergency Response Teams in place at the Marietta plant.  These individuals undergo significantly more training than do operators; have cell phone/two-way radio capabilities and a designated and fully equipped Emergency Operations Center from which to operate.\n\n\n\nIn the event of an incident on the plant site, our Emergency Response Plan tells us to take the following actions: An alarm system will notify all employees that an event has occurred.  Monitors include automatic detectors, computer systems, and visual inspection by our operators.\n\nThe Emergency Response Team will assess the magnitude of the incident and determine if it is within our control.  If the incident is within plant control, a response plan will be developed.  If not, the Emergency Response Team will Shelter in Place with the plant population.  Operators will shut down transfer systems as they evacuate the operating portions of our plant.  All employe"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000088868,
      "SummaryText": "es will Shelter in Place in one of two office areas on the site.  Designated employees will call for fire and emergency services via 911.  We will summon our emergency response contractors and will advise emergency responders of the known hazards and follow their guidance.\n\n\n\nTraining and Preparation:  Certainly all of us want to do everything we can to protect the health and well being of our employees and our community.  We have our Layers of Protection in the plant; we use training exercises to further protect our employees and to reduce the impact of any releases on our neighbors.\n\n\n\nTraining is extended to include local Fire and Emergency Services groups that may service our plant.  Through these training exercises, we are developing and maintaining partnerships.  These partnerships allow us to gain confidence in each other's knowledge and abilities to deal appropriately with incidents.  Shared roles in incident response are intended to assure the public, and ourselves, that we can and will react properly and promptly when necessary.\n\n\n\nKemira Chemicals, Inc. is an active current member of the Cobb County Resource Council, a partnership of government and industry designed to share information, technology, equipment, and resources in the event of an incident.\n\n"
    }
  ]
}