{
  "FacilityID": 1000014925,
  "FacilityName": "South Gulfport Wastewater Treatment Plant",
  "FacilityStr1": "13762 Washington Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Gulfport",
  "FacilityState": "MS",
  "FacilityZipCode": "39507",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "28047",
  "LEPC": "Gulfport Fire Department",
  "FacilityLatDecDegs": "30.251400",
  "FacilityLongDecDegs": "-089.034200",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Harrison County Utility Authority",
  "OperatorStr1": "10271 Express Drive, P.O. 2409",
  "OperatorStr2": null,
  "OperatorCity": "Gulfport",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39503",
  "OperatorZipCodeExt": null,
  "RMPContact": "Donald Scharr, PE",
  "RMPTitle": "Executive Director",
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050614",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-01-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-07-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-07-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-07-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.42139,
  "FRS_Long": -89.06222,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018783,
      "AltID": "Chlorine System",
      "FacilityID": 1000014925,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000019126,
          "ProcessID": 1000018783,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000022296,
          "ProcessID": 1000018783,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000522296,
          "ProcessID": 1000018783,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000018784,
      "AltID": "Sulfur Dioxide System",
      "FacilityID": 1000014925,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000019127,
          "ProcessID": 1000018784,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000022297,
          "ProcessID": 1000018784,
          "ChemicalID": 49,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000522297,
          "ProcessID": 1000018784,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014925,
      "SummaryText": "South Gulfport Wastewater Treatment Plant\n\n\n\nRMP Plan Executive Summary\n\n\n\nExecutive Summary\n\n\n\nThis executive summary provides a brief overview of the Risk Management Program (RMP) and the associated policies at the South Gulfport Wastewater Treatment Plant (South Gulfport WWTP), one of several facilities owned by the Harrison County Utility Authority and operated by Utility Partners.\n\n\n\nPrevention and Response Policies\n\n\n\nUtility Partners believes that it is important to provide a safe workplace to its employees and minimize the impact of its operations on the surrounding community and the environment.  Accordingly, Utility Partners has developed proactive safety and environment programs, which are reliant upon active employee participation and management leadership and support.  This same proactive philosophy was employed in the development and implementation of the South Gulfport  WWTP RMP for the chlorine and sulfur dioxide systems.  Utility Partners has determined that the OSHA Process Safety Management standard also applies to the personnel at the South Gulfport  WWTP and therefore has prepared this RMP to comply with the RMP Program 3 requirements.  By doing so, Utility Partners affirms its proactive safety and environmental philosophy and acknowledges the inherent value of full RMP compliance.\n\n\n\nThe RMP prevention program is arguably the most important element of the rule.  Its program elements require the active participation of facility employees and management in conducting activities aimed at preventing accidental releases of requlated chemicals.  If prevention activities could be completely successful, there would be no need for emergency response activities, since no release would occur.  Accoordingly, a well-developed and properly implemented prevention program will lower the possibility of an accidental release and minimize the consequence of a release should on occur.\n\n\n\nUtility Partners takes an active role in preventing accidental releases at al"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014925,
      "SummaryText": "l of the facilities it operates by ensuring that it semployees are well-informed reguarding the hazards associated with the regulated processes (e.g., chlorine and sulfur dioxide at the South Gulfport WWTP) and actively participated in comprehensive process hazard analyses.  The employees that work on the chlorine and sulfur dioxide systems are properly trained in the safe operation of the covered processes and the safe handling of treatment chemicals.  They are aided in this work by complete, understandable system operating procedures.\n\n\n\nUtility Partners management understands its duty to provide a safe working environment and to take measures to prevent accidents that may have an effect on the surrounding community.  This understanding is reflected in procedures described and reference in the South Gulfport WWTP RMP procedures and policies.\n\n\n\nStationary Source and Regulated Substances\n\n\n\nThe South Gulfport  WWTP is located at 13762 Washington Avenue, in Gulfport, Harrison County, Mississippi.  The South Gulfport WWTP treats wastewater through a series of physical and chemical treatment operations.  This 8.23 MGD TF/SC plant uses a two-secondary trickling filters for nitrogen removal and has a peak design capacity of 40aerobic digester, a 2.0 meter belt filter press, and secondary clarification.  Average design flow is 9.0 MGD, with a peak capacity MGD.  The plant uses a two stage anaerobic digestion process, 2.0 meter belt filter presses, and primary and secondary clarifiers with  declorination required.  Effluent is discharged in Gulfport Lake.  The facility wan named Mississippi Plant of the Year in 1992 and received a Second Place O & M Excellence Award from the Region IV of U.S. EPA.\n\n\n\nThe South Gulfport WWTP utilizes chlorine as a biocide in the treatment of wastewater.  The chlorine is stored in one-ton containers with a maximum intended inventory of six containers (12,000 pounds) on site.  In addition, the South Gulfport WWTP utilizes sulfur dioxide for "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014925,
      "SummaryText": "the dechlorination of treated effluent.  The sulfur dioxide is stored in one-ton containers with a maximum intended inventory of five containers (10,000 pounds) on site.  Therefore, the South Gulfport WWTP is regulated under the RMP rule due to the volume of chlorine and sulfur dioxide stored and used at the facility.\n\n\n\nPrevention Steps for Chlorine\n\n\n\nThe prevention program and chemical-specific prevention steps are described in detail in the South Gulfport WWTP RMP manual.  The prevention program includes the following elements:\n\n\n\n* Process safety information, which includes information pertaining to the hazards of chlorine in the process, process technology, and process equipment.\n\n\n\n* Process hazard analysis (PHA), which includes a systematic evaluation (by an employee team) of: the hazards of the chlorine process, identification of previous process incidents, engineering and administrative controls, consequences of failure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure of controls.\n\n\n\n* Operating procedures, which include steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.\n\n\n\n* Training for each South Gulfport WWTP employee involved in operating the chlorine system.\n\n\n\n* Mechanical integrity procedures to maintain the on-going integrity of the chlorine process equipment.\n\n\n\n* Management of change procedures to manage changes (other than \"replacements in kind\") to the chlorine system.\n\n\n\n* Pre-startup safety review for additions or significant modifications to the chlorine process, or any new regulated chemical process.\n\n\n\n* Compliance audits at least every three years form 1999 to evaluate South Gulfport WWTP RMP compliance.\n\n\n\n* Incident investigation, to be conducted and documented for each incident that resulted in, or could have reasonably resulted in, a catastrophic release of chlorine from the South G"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014925,
      "SummaryText": "ulfport WWTP.\n\n\n\n* Employee participation in the development and implementation of the South Gulfport WWTP RMP, and employee access to RMP information.\n\n\n\n* Hot work prohibition policy on or near the chlorine system when chlorine is present in the affected section of the process.\n\n\n\n* Contractor management program, to ensure appropriate evaluation and selection of qualified contractors for work on or near the chlorine system, proper notification of contractors regarding known chlorine system hazards and the South Gulfport WWTP emergency evacuation plan, limited access to the chlorine process, and evaluation of contractor performance.\n\n\n\nIn addition to these elements, the chlorine storage area and chlorine feed room at the South Gulfport WWTP are equipped with chlorine leak detection devices that continuously monitor the air for chlorine gas.  If the chlorine sensor detects a specified level, audio and visual alarms will be activated and a high rate ventilation system can be activated in the chlorine feed room.  The ventilation system withdraws chlorine and air from a low elevation in the storage room to a safe outdoor location.  The alarm systems are maintained and tested on a regular basis to ensure proper operation should there be a chlorine release.  Management of Change procedures will be used for the upgrades to the chlorine system.\n\n\n\nPrevention Steps for Sulfur Dioxide \n\n\n\n* The prevention program and chemical-specific prevention steps are described in detail in the South Gulfport WWTP RMP manual.  The prevention program includes the following elements:\n\n\n\n* Process safety information, which includes information pertaining to the hazards of sulfur dioxide in the process, process technology, and process equipment.\n\n\n\n* Process hazard analysis (PHA), which includes a systematic evaluation (by an employee team) of: the hazards of the sulfur dioxide process, identification of previous process incidents, engineering and administrative controls, consequences of fai"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014925,
      "SummaryText": "lure of the engineering and administrative controls, facility siting, human factors, and possible safety and health effects of failure of controls.\n\n\n\n* Operating procedures, which include steps for each operating phase, operating limits, safety and health considerations, and safety systems and their functions.\n\n\n\n* Training for each South Gulfport WWTP employee involved in operating the sulfur dioxide system.\n\n\n\n* Mechanical integrity procedures to maintain the on-going integrity of the sulfur dioxide process equipment.\n\n\n\n* Management of change procedures to manage changes (other than \"replacements in kind\") to the sulfur dioxide system.\n\n\n\n* Pre-startup safety review for additions or significant modifications to the sulfur dioxide process, or any new regulated chemical process.\n\n\n\n* Compliance audits at least every three years form 1999 to evaluate South Gulfport WWTP RMP compliance.\n\n\n\n* Incident investigation, to be conducted and documented for each incident that resulted in, or could have reasonably resulted in, a catastrophic release of sulfur dioxide from the South Gulfport WWTP.\n\n\n\n* Employee participation in the development and implementation of the South Gulfport WWTP RMP, and employee access to RMP information.\n\n\n\n* Hot work prohibition policy on or near the sulfur dioxide system when sulfur dioxide is present in the affected section of the process.\n\n\n\n* Contractor management program, to ensure appropriate evaluation and selection of qualified contractors for work on or near the sulfur dioxide system, proper notification of contractors regarding known chlorine system hazards and the South Gulfport WWTP emergency plan, limited access to the sulfur dioxide process, and evaluation of contractor performance.\n\n\n\nIn addition to these elements, the sulfur dioxide storage area and chlorine feed room at the South Gulfport WWTP are equipped with sulfur dioxide leak detection devices that continuously monitor the air for sulfur dioxide gas.  If the sulfur dioxide s"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000014925,
      "SummaryText": "ensor detects a specified level, audio and visual alarms will be activated and a high rate ventilation system can be activated in the chlorine feed room.  The ventilation system withdraws sulfur dioxide and air from a low elevation in the storage room to a safe outdoor location.  The alarm systems are maintained and tested on a regular basis to ensure proper operation should there be a sulfur dioxide release.  Management of change procedures will be used for the upgrades to the sulfur dioxide system.\n\n\n\nAccident History\n\n\n\nWithin the five-year period prior to the submittal of the RMP, there were no accidental releases of chlorine or sulfur dioxide meeting the requirements of 40 CFR 68.42.\n\n\n\nEmergency Response Program\n\n\n\nThis facility has established and maintains an emergency response program that is coordinated with local response agencies, including the Gulfport Fire Department.  The program is described in detail in the South Gulfport WWTP RMP manual and meets the requirements of 40 CFR 68.95, which include facility notification of emergency responders and evacuation.  The goals of the program are to protect onsite employees from the hazardous effects of chemical releases and to minimize the effects of releases on the general public.  The program is routinely reviewed and updated to reflect personnel and regulatory changes.\n\n\n\nPlanned Changes for Improved Safety\n\n\n\nIdeas for changes to improve safety are actively sought from employees.  Employee meetings that focus on safety issues are held regularly at the South Gulfport WWTP.  Employees are encouraged and trained to recognize hazard and to present ideas to eliminate them or to minimize the potential consequences of those hazards.\n\n\n\nAs part of the development of the South Gulfport WWTP program, process hazard analyses were conducted with key employees to meet the prevention program requirements.  During these sessions, recommendations were made for the purpose of improving safety and preventing accidental chem"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000014925,
      "SummaryText": "ical releases.  Each recommendation has been or will be considered for implementation.  Though not all recommendations may be implemented, all will be considered.  The exercise has provided all affected employees with a heightened awareness of safety issues related to the covered process."
    }
  ]
}