{
  "FacilityID": 1000034963,
  "FacilityName": "Olympic Sports Complex",
  "FacilityStr1": "220 Bobsled Run Lane",
  "FacilityStr2": null,
  "FacilityCity": "Lake Placid",
  "FacilityState": "NY",
  "FacilityZipCode": "12946",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "36031",
  "LEPC": "Essex County LEPC",
  "FacilityLatDecDegs": "44.216667",
  "FacilityLongDecDegs": "-73.933333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": "www.orda.org",
  "FacilityEmailAddress": "bhammond@orda.org",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Olympic Regional Development Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "OlympicRegionalDevelopmentAuthority",
  "OperatorStr1": "2634 Main Street",
  "OperatorStr2": null,
  "OperatorCity": "Lake Placid",
  "OperatorStateFIPS": "NY",
  "OperatorZipCode": "12946",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tony Carlino",
  "RMPTitle": "Venue Manager",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184169",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-02-07 00:00:00",
  "SafetyInspectionBy": "Public Employer Risk Managment, (EPA 04-12-2010)",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-04-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-04-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-04-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-04-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000042771,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000034963,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000043153,
          "ProcessID": 1000042771,
          "NAICSCode": "71131",
          "_desc": {
            "NAICS_CODE": "71131",
            "NAICS_DESCRIPTION": "Promoters of Performing Arts, Sports, and Similar Events with Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000051345,
          "ProcessID": 1000042771,
          "ChemicalID": 56,
          "Quantity": 169400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000551345,
          "ProcessID": 1000042771,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000034963,
      "SummaryText": "Stationary Source and Regulated Substance\n\n\n\nThe Olympic Regional Development Authority (ORDA) is an agency of the State of New York that manages a bobsled, skeleton and luge facility at the Olympic Sports Complex (OSC) at Mt. Van Hoevenberg, in the Town of North Elba, near Lake Placid, NY. Like the other facilities in and around Lake Placid that ORDA operates and maintains, the facility was mostly constructed for the 1980 Olympic Games. The Olympic Sports Complex includes two tracks; The Combined Track which became operational in February, 2000 and the historic 1980 track, used in the Olympic Games.\n\n\n\nThe Combined Track includes an industrial refrigeration system which utilizes anhydrous ammonia as a refrigerant to create and maintain an ice surface. The ammonia refrigeration system operates on a seasonal basis, typically between October and April.  During the off-season, the refrigeration system is shutdown. During winter operation, the facility is staffed 24/7. \n\n\n\nSince the refrigeration system uses greater than 10,000 lbs. of anhydrous ammonia, the facility is subject to the USEPA's Chemical Accident Prevention Provisions. The Olympic Sports Complex has developed a comprehensive Risk Management Program to ensure the safe use of anhydrous ammonia and fulfill its commitment to the safety of employees, the community and the environment.\n\n\n\nKey components of the Risk Management Program include:\n\n*Management System \n\n*Prevention Program \n\n*5 Year Accident History\n\n*Offsite Consequence Analysis\n\n*Emergency Response\n\n\n\nManagement System\n\n\n\nA management system is in place which designates responsibilities and guides implementation of the Risk Management Program.\n\n\n\nPrevention Program\n\n\n\nA prevention program in compliance with 40 CFR Part 68 Subpart D Program 3 and OSHA's 29 CFR 1910.119 PSM Standard is established and described in section 7 of this Risk Management Plan (RMP). The Prevention Program defines the measures taken to ensure the Olympic Sports Complex's comm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000034963,
      "SummaryText": "itment to safe operations and accident prevention.\n\n\n\nThe Prevention Program encompasses 12 major elements which include:\n\n*Process Safety Information \n\n*Process Hazard Analysis\n\n*Operating Procedures\n\n*Training\n\n*Employee Participation\n\n*Mechanical Integrity \n\n*Management of Change\n\n*Pre-Startup Review\n\n*Compliance Audits\n\n*Incident Investigation Procedures\n\n*Hot Work Procedures\n\n*Contractor Procedures\n\n\n\nFive Year Accident History and Offsite Consequence Analysis\n\n\n\nThe Olympic Sports Complex has not had a release or near miss incident which would have involved public or environmental receptors, caused injury or otherwise required inclusion in the RMP. However, as required by regulations, the OSC has completed an Offsite Consequence Analysis which evaluates both a worst case scenario (WCS) and alternate release scenario (ARS) involving hypothetical ammonia releases.  Both the WCS and ARS identify the potential for impacts to public and environmental receptors. \n\n\n\nWorst Case Scenario\n\n\n\nThe WCS considers a catastrophic failure of the largest vessel resulting in the 48,400 lbs of anhydrous ammonia postulated to release over a period of ten minutes. Scenario parameters factor worst case meteorological conditions. EPA's Risk Management Program Guidance for Ammonia Refrigeration and Appendix E: Supplemental Risk Management Program Guidance for Ammonia Facilities was used in modeling the scenario. The result shows a potential offsite impact distance to endpoint radius of 1.6 miles.\n\n\n\nAlternative Release Scenario\n\n\n\nThe ARS evaluates a release that has more plausible chance of occurring than the WCS. The scenario was computed using EPA's RMP*Comp Program and involves a loss of 275 lbs of ammonia through a pressure safety valve which would potentially impact a .2 mile radius. \n\n\n\nEmergency Response\n\n\n\nThe Olympic Sports Complex has a well developed Emergency Response Plan in place which details how to handle potential emergencies at the facility. The Emergency Response "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000034963,
      "SummaryText": "Plan includes specific procedures for dealing with an accidental release of anhydrous ammonia from the refrigeration system including emergency notification and evacuation procedures. Employees receive training and emergency response is coordinated with local response agencies. Additionally, the offsite consequence analysis findings are shared with the response agencies.\n\n\n\nPlanned Safety Improvements\n\n\n\nAs the Olympic Sports Complex continues to review its regulated process and address recommendations, improvements that are being planned include enhancing inspection procedures for track structures.  Additionally, the OSC is currently working with Essex County Office of Emergency Service to aid an emergency response through coordinated training exercises and improving the facility's building identification.\n\n"
    }
  ]
}