{
  "FacilityID": 1000085988,
  "FacilityName": "Mockingbird Central Facility",
  "FacilityStr1": "Section 34, Block 58, Township 1",
  "FacilityStr2": "T&P Railroad Company Survey",
  "FacilityCity": "Culberson County",
  "FacilityState": "TX",
  "FacilityZipCode": "79847",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48109",
  "LEPC": "Culberson County LEPC",
  "FacilityLatDecDegs": "31.919355",
  "FacilityLongDecDegs": "-104.052216",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.conocophillips.com",
  "FacilityEmailAddress": "vanessa.d.rawlins@conocophillips.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "ConocoPhillips Company",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "ConocoPhillips Company",
  "OperatorStr1": "925 North Eldridge Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77079",
  "OperatorZipCodeExt": null,
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000243792",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-03-21 13:17:31",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-03-21 13:17:31",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-03-21 13:17:31",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-03-21 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107372,
      "AltID": "Oil Stabilization/Water,",
      "FacilityID": 1000085988,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000134238,
          "ProcessID": 1000107372,
          "ChemicalID": 155,
          "Quantity": 38059.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000118792,
              "ProcessChemicalID": 1000134238,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000118793,
              "ProcessChemicalID": 1000134238,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000118794,
              "ProcessChemicalID": 1000134238,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000118795,
              "ProcessChemicalID": 1000134238,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000118796,
              "ProcessChemicalID": 1000134238,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000118797,
              "ProcessChemicalID": 1000134238,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000118798,
              "ProcessChemicalID": 1000134238,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000108645,
          "ProcessID": 1000107372,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000085988,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-07-16 00:00:00",
    "ERTrainingDate": "2019-07-17 00:00:00",
    "CoordinatingAgencyName": "Culberson County LEPC",
    "CoordinatingAgencyPhone": "4322832060",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000085988,
      "SummaryText": "Central Facility evaluates contractor safety programs and performance during the selection of a contractor. Mockingbird Central Facility personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations.\r\nPre-startup Safety Reviews (PSSRs)\r\nThe Mockingbird Central Facility conducts a PSSR for any new facility or facility modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and equipment are appropriately prepared for startup prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready. The PSSR review team uses checklists to verify all aspects of readiness. A PSSR involves field verification of the construction and serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\nMechanical Integrity\r\nThe Mockingbird Central Facility has well-established practices and procedures to maintain pressure vessels, piping systems, relief and vent systems, controls, pumps and compressors, and emergency shutdown systems in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process.\r\nMaintenance personnel receive training on (1) an overview of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their jobs in a safe manner. Written procedures help ensure that work is performed"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000085988,
      "SummaryText": "in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for pressure vessels). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or a management of change team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\r\nAnother integral part of the mechanical integrity program is quality assurance. The Mockingbird Central Facility incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\r\nSafe Work Practices\r\nThe Mockingbird Central Facility has long-standing safe work practices in place to help ensure worker and process safety. Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping or equipment is opened, (4) a permit and procedure to control spark-producing activities (i.e., hot work), and (5) a permit and procedure to ensure that adequate precautions are in place before entry into a confined space. These procedures (and others), along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\r\nManagement of Change\r\nThe Mockingbird Central Facility has a comprehensive system to manage changes to all covered processes. This system requires that changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other facility changes be properly r"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000085988,
      "SummaryText": "eviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change.\r\nIncident Investigation\r\nThe Mockingbird Central Facility promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic Mockingbird Central Facility release, major property damage, environmental loss, or personal injury. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to Mockingbird Central Facility management for resolution. Corrective actions taken in response to the investigation team's findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.\r\nCompliance Audits\r\nTo help ensure that the accident prevention program is functioning properly, the Mockingbird Central Facility periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. Both hourly and staff personnel participate as audit team members. The audit team develops findings that ar"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000085988,
      "SummaryText": "Mockingbird Central Facility Risk Management Plan\r\nExecutive Summary\r\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\r\nThe Mockingbird Central Facility has a standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, Mockingbird Central Facility trained personnel will respond to control and contain the release.\r\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\r\nThe Mockingbird Central Facility located: Section 34, Block 58, Township 1, T&P Railroad Company Survey, Culberson County, Texas, operates a liquid recovery process to produce petroleum products (e.g., natural gas liquids) from natural gas. The Mockingbird Central Facility has regulated flammables, such as propane and butane.\r\nOFFSITE CONSEQUENCE ANALYSIS RESULTS\r\nThe Worst-Case Scenario (WCS) associated with a release of flammable substances at the Mockingbird Central Facility is a vapor cloud explosion (VCE) from a catastrophic vessel failure involving the inventory of the inlet slug catcher natural gas and natural gas liquids. The maximum distance to the 1-psi endpoint for this WCS is 0.3 miles and there are no offsite receptors. Although we have numerous controls to prevent such releases and to manage their consequences, no credit for passive mitigation measures was considered in evaluating this WCS.\r\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\r\nThe following is a summary of the accident prevention program in place at the Mockingbird Central Facility. Because processes at the Mockingbird Central Facility are regulated by the Environmental Protection Agency's (EPA's) risk management program (RMP) regulation are also subject to the Occupational Safety and Healt"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000085988,
      "SummaryText": "h Administration's (OSHA's) process safety management (PSM) standard, this summary addresses each of the OSHA PSM elements and describes the management system in place to implement the accident prevention program.\r\nEmployee Participation\r\nThe Mockingbird Central Facility encourages employees to participate in all facets of process safety management and accident prevention. Examples of employee participation range from updating and compiling technical documents and chemical information to participating as a member of a process hazard analysis (PHA) team. Employees have access to all information created as part of the Mockingbird Central Facility's accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented on the China Draw PSM SharePoint that is maintained at the Loving Field Office and addresses each accident prevention program element. In addition, the Mockingbird Central Facility has several initiatives under way that address process safety and employee safety issues. These initiatives include weekly team meetings to promote both process and personal safety. These meetings include members from various areas of the Mockingbird Central Facility, including operations, maintenance, engineering, safety, and plant management.\r\nProcess Safety Information\r\nThe Mockingbird Central Facility keeps a variety of technical documents that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. The Delaware Process Safety Coordinator for the Mockingbird Central Facility is assigned responsibility for maintaining up-to-date process safety information. A computerized table summarizing the reference documents is readily available as part of the employee participation plan to help employees locate any necessary process safety inf"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000085988,
      "SummaryText": "ormation.\r\nChemical-specific information, including exposure hazards and emergency response/ exposure treatment considerations, is provided in material safety data sheets (SDSs). This information is supplemented by documents that specifically address known corrosion concerns and any known hazards associated with the inadvertent mixing of chemicals. For specific process areas, the Mockingbird Central Facility has documented safety-related limits for specific process parameters (e.g., temperature, level, composition) in the China Draw PSM SharePoint. The Mockingbird Central Facility ensures that the process is maintained within these limits using process controls and monitoring instruments, highly trained personnel, and protective instrument systems (e.g., automated shutdown systems).\r\nThe Mockingbird Central Facility also maintains numerous technical documents that provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the process are not compromised.\r\nProcess Hazard Analysis (PHA)\r\nThe Mockingbird Central Facility has a comprehensive program to help ensure that hazards associated with the various processes are identified and controlled. Within this program, each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\nThe Mockingbird Central Facility primarily uses the HAZOP/LOPA technique to perform these evaluations. HAZOP/LOPA is recognized as one of the most systematic and thorough hazard evaluation techniques. The analyses are conducted using a team of people who have operating and maintenance exp"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000085988,
      "SummaryText": "changes made through the management of change process.\r\nTraining\r\nTo complement the written procedures for process operations, the Mockingbird Central Facility has implemented a comprehensive training program for all employees involved in operating a process. New employees receive basic training in Mockingbird Central Facility operations if they are not already familiar with such operations. After successfully completing this training, a new operator is paired with a senior operator to learn process-specific duties and tasks. After operators demonstrate (e.g., through tests, skills demonstration) having adequate knowledge to perform the duties and tasks in a safe manner on their own, they can work independently. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years. All of this training is documented for each operator, including the means used to verify that the operator understood the training.\r\nContractors\r\nThe Mockingbird Central Facility uses contractors to supplement its work force during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the Mockingbird Central Facility has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their workplace, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform Mockingbird Central Facility personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work. In addition, the Mockingbird"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000085988,
      "SummaryText": "e forwarded to Mockingbird Central Facility management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\nEmergency Response\r\nThe emergency response for our site has been planned for a number of accidental release scenarios, includes information on how to inform the public as necessary and the local emergency planning committee (LEPC) and is communicated to all affected workers.  \r\nCHEMICAL-SPECIFIC PREVENTION STEPS\r\nThe processes at the Mockingbird Central Facility have hazards that must be managed to ensure continued safe operation. The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\r\nUniversal Prevention Activities\r\nThe accident prevention program summarized previously is applied to all RMP-covered processes at the Mockingbird Central Facility. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\r\nSpecialized Safety Features\r\nThe Mockingbird Central Facility has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in the covered processes:\r\nRelease Detection\r\n¿\tProcess relief valves that discharge to a flare to capture and incinerate episodic releases A· Valves to permit isolation of the process (manual or automated)\r\n¿\tAutomated shutdown systems for specific process parameters (e.g., high temperature)\r\n¿\tRedundant equipment and instrumentation (e.g., uninterruptible power supply for process control system, backup)\r\n¿\tAtmospheric relief devices."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000085988,
      "SummaryText": "erience as well as engineering expertise. This team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures, and the team makes suggestions for additional prevention and/or mitigation measures when the team believes such measures are necessary.\r\nThe PHA team findings are forwarded to local and corporate management for resolution. Implementation of mitigation options in response to PHA findings is based on a relative risk ranking assigned by the PHA team. This ranking helps ensure that potential accident scenarios assigned the highest risk receive immediate attention. All approved mitigation options in response to PHA team findings are tracked until they are completed. The final resolution of each finding is documented and retained.\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the Mockingbird Central Facility periodically updates and revalidates the hazard analysis results. These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the process is no longer operating. The results and findings from these updates are documented and retained. Once again, the team findings are forwarded to management for consideration, and the final resolution of the findings is documented and retained.\r\nOperating Procedures\r\nThe Mockingbird Central Facility maintains written procedures that address various modes of process operations, such as (1) unit startup, (2) normal operations, (3) temporary operations, (4) emergency shutdown, (5) normal shutdown, and (6) initial startup of a new process. These procedures can be used as a reference by experienced operators and provide a basis for consistent training of new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are kept current and accurate by revising them as necessary to reflect"
    }
  ]
}