{
  "FacilityID": 1000044832,
  "FacilityName": "Kemin Industries, Inc. - Des Moines Facility",
  "FacilityStr1": "2100 Maury St.",
  "FacilityStr2": null,
  "FacilityCity": "Des Moines",
  "FacilityState": "IA",
  "FacilityZipCode": "50317",
  "Facility4DigitZipExt": "1100",
  "FacilityCountyFIPS": "19153",
  "LEPC": "Polk County LEPC",
  "FacilityLatDecDegs": "41.582222",
  "FacilityLongDecDegs": "-093.580000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "P3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kemin.com",
  "FacilityEmailAddress": "kemin@kemin.com",
  "FacilityDUNS": 5274287,
  "ParentCompanyName": "Kemin Industries, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Kemin Industries, Inc.",
  "OperatorStr1": "2100 Maury St.",
  "OperatorStr2": "P.O. Box 70",
  "OperatorCity": "Des Moines",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50306",
  "OperatorZipCodeExt": "0070",
  "RMPContact": "Brian Standish",
  "RMPTitle": "VP of Operations",
  "FTE": 458,
  "OtherEPAFacilityID": "RAD115274287",
  "EPAFacilityID": "100000050339",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-03-12 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.58103,
  "FRS_Long": -93.58023,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055493,
      "AltID": "pH buffering of acids",
      "FacilityID": 1000044832,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056394,
          "ProcessID": 1000055493,
          "NAICSCode": "311119",
          "_desc": {
            "NAICS_CODE": "311119",
            "NAICS_DESCRIPTION": "Other Animal Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000067647,
          "ProcessID": 1000055493,
          "ChemicalID": 56,
          "Quantity": 75000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000567647,
          "ProcessID": 1000055493,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044832,
      "SummaryText": "This document and accompanying supporting documentation contains information required to meet 40 CFR 68 (Risk management Program) including an Executive Summary and list of RMP Data Elements.  \n\n\n\nEXECUTIVE SUMMARY\n\n\n\n1. Accidental release prevention and emergency response policies:\n\n\n\nBecause our firm has a strong regard for environmental protection, product stewardship and safety concerns, we operate in a manner to be both responsible and responsive in all our efforts to protect the physical environment, our employees, customers and the general public.  We comply with environmental stewardship, safety laws and regulations.  \n\n\n\nWhere our company becomes aware of environmental and product safety risks not covered by existing laws or regulations, we develop our own good faith standards and practices based on comprehensive and relevant scientific data.  We cooperate with the public, government, industry and employees in identifying environmental, product stewardship and safety goals and in developing effective control programs.  Each operating unit of the company is expected to be guided by this policy in forming plans, setting objectives, and conducting their day-to-day activities.\n\n\n\nOur emergency response procedures include notification of the local fire department.  In addition, access to the site is restricted to authorized facility employees, management personnel, and contractors.  The facility is fenced to help keep it secure.\n\n\n\nWe have a strong EHS staff that takes an active role in area safety and environmental leadership of the local LEPC as well as local chapter and regional leadership of the American Society of Safety Engineers.\n\n\n\n2. Stationary source and regulated substances handled\n\n\n\nThe regulated substance handled at this facility is anhydrous ammonia.\n\n\n\nThe primary purpose of this facility is to produce specialty ingredients, nutritional additives, and environmental products for animal agriculture and human foods.  Anhydrous ammonia is received by"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044832,
      "SummaryText": " truck (transports) and is stored in a single tank located in the central portion of the property.  The capacity of the storage tank is 15,000 gallons of anhydrous ammonia.  The tank is designed to store 85% of its capacity; therefore, the maximum amount of anhydrous ammonia that can be stored at our plant is approximately 12,750 gallons, or approximately 75,000 pounds.\n\n\n\n3. The general accidental release prevention program and the specific prevention steps:\n\n \n\nThis facility complies with EPA's Accidental Release Prevention Rule and with applicable state codes and regulations including OSHA's Process Safety Management Standard.  This facility was designed and constructed in accordance with good engineering practices to provide a safe system for our employees as well as our neighbors and environment.  We continue to evaluate and improve our processes for all our equipment and materials.  Delivery drivers have been thoroughly trained regarding anhydrous ammonia hazards and emergency response through their company and on-site emergency action plans.  We take the extra diligence to conduct supplier audits to ensure those sending materials to us have followed proper procedures in product quality and safety. \n\n\n\nOur employees watch the delivery of each truck bringing anhydrous ammonia to our site. We lease our anhydrous ammonia storage vessel from an anhydrous ammonia vendor and require them to periodically inspect components they own of the anhydrous ammonia system, and make any necessary adjustments to either equipment or procedures to continue to ensure safe handling and use of anhydrous ammonia.  Our maintenance staff has an electronic system to remind us of required inspections and replacements.  We follow this up with self-audits, ISO quality audits and food safety compliance reviews.  Refer to our website for a listing of current certifications. \n\n \n\n4. Five-year accident history:\n\n \n\nOver the last five years we have had no reportable releases.  All of our accide"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044832,
      "SummaryText": "nts in the ammonia areas, as well as all other areas of the company are immediately investigated and followed through to ensure closure of corrective action items.\n\n \n\n5. The emergency response program:\n\n \n\nThis facility's emergency response program is based upon the management system we have in place and the appropriate discovery and notification procedures to ensure coordination with our local emergency responders.  We have discussed this program with the Des Moines Fire Department.  We welcome all fire shifts to conduct on-site walkthroughs, especially when there have been station realignments or staffing changes to fire department personnel.  We consider our relationship with the fire department to be a partnership with regular interaction with the fire marshal and the inspector's office.  Because of our close relationship with the fire department, we are also aware of their drills on ammonia systems such as the nearby dairy that contains a larger quantity of ammonia than this site.\n\n\n\nPlease note that the date of our last emergency program update did not require retraining, as this was an administrative change only.\n\n\n\n6. Planned changes to improve safety:\n\n\n\nOne of the outcomes of the last compliance audit was to have an engineering firm re-evaluate our processes and make recommendations for change, as the ammonia process has been in place for several years.  This audit, in addition to the recent process hazard analysis yielded several recommendations for improvement that we will be pursuing.\n\n\n\nRecommendations include:  \n\n\n\n- more separation for vaporizer and maintenance areas\n\n- ventilation improvements in process area and rerouting of vent lines\n\n- staging of personal protective equipment in key areas\n\n- verify eye wash and safety shower access distances when design changes may impact travel distance\n\n\n\nKemin will continue to evaluate the system and make changes to improve employee, product and public safety.\n\n\n\n"
    }
  ]
}