{
  "FacilityID": 1000044258,
  "FacilityName": "Sasol Chemicals (USA) LLC, Oil City Plant",
  "FacilityStr1": "292 State Route 8",
  "FacilityStr2": null,
  "FacilityCity": "Cornplanter TWP",
  "FacilityState": "PA",
  "FacilityZipCode": "16301",
  "Facility4DigitZipExt": "5626",
  "FacilityCountyFIPS": "42121",
  "LEPC": "Venango County LEPC",
  "FacilityLatDecDegs": "41.452778",
  "FacilityLongDecDegs": "-079.690278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PC",
  "FacilityURL": "Sasol.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sasol (USA) Corporation",
  "Company2Name": null,
  "CompanyDUNS": 78780682,
  "Company2DUNS": 0,
  "OperatorName": "Sasol Chemicals (USA) LLC",
  "OperatorStr1": "292 State Route 8",
  "OperatorStr2": null,
  "OperatorCity": "Oil City",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16301",
  "OperatorZipCodeExt": "5626",
  "RMPContact": "Lee E. Wilson",
  "RMPTitle": "Manager - SHES",
  "FTE": 35,
  "OtherEPAFacilityID": "16301NVLLSROUTE",
  "EPAFacilityID": "100000114912",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "61-00011",
  "SafetyInspectionDate": "2014-03-17 00:00:00",
  "SafetyInspectionBy": "Consultant on PA Labor & Industry's Behalf",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-08-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-12 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-12 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-12 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 41.4525,
  "FRS_Long": -79.6897,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054661,
      "AltID": "Isobutylene System",
      "FacilityID": 1000044258,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055466,
          "ProcessID": 1000054661,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066529,
          "ProcessID": 1000054661,
          "ChemicalID": 131,
          "Quantity": 600000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 131,
            "ChemicalName": "2-Methylpropene  [1-Propene, 2-methyl-]",
            "CASNumber": "115-11-7",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000566529,
          "ProcessID": 1000054661,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044258,
      "SummaryText": "Sasol Chemicals (USA) LLC's\n\nIsobutylene (2 methylpropene)\n\nRisk Management Program Executive Summary\n\n\n\nAccident Release Prevention and Emergency Programs\n\n\n\nThe Oil City Plant's Risk Management Plan Program provides a systematic approach to prevent the accidental release of chemicals to the environment. This is accomplished through both engineering and administrative controls. All applicable elements of the U. S. EPA's Prevention Program and OSHA's Process Safety Management standard are adhered to. The Oil City Plant's Emergency Plan is tailored to meet the needs of any foreseeable release and was developed using input from the local emergency response agencies (Cornplanter Twp. Vol. FD, Oil City FD, and Venango County Emergency Management Agency). The plan was submitted and approved by the Venango County, PA Local Emergency Planning Commission (LEPC).\n\n\n\nStationary Source and Regulated Substance Handled\n\n\n\nThe Oil City Plant is a manufacturing facility that produces Butylated Hydroxy Toluene (BHT), a crystalline Phenolic antioxidant and m-cresol, a chemical intermediate. Isobutylene (2-methylpropene) is stored in bulk at the plant, and is used to add the butyl groups onto mixed cresols (methylphenol). The isobutylene storage tanks and associated transfer equipment have several engineered safety features such as:  internal and external excess flow valves; perimeter monitor, alarm, and shutdown interlock systems; pressure relief valves; a flare protected vent system; and administrative procedures to prevent or detect releases. The plant is manned 24 hours a day and the isobutylene system is monitored continuously. There are automated vapor dispersing, fire extinguishing, and associated alarm systems around the isobutylene storage, reactor, compressor, and off-loading areas. All storage and handling equipment as well as all safety and countermeasure equipment are on a rigid testing and inspection program as well as a general preventive maintenance program.\n\n\n\nGenera"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044258,
      "SummaryText": "l Accidental Release Prevention Program and Prevention Steps\n\n\n\nThe general accidental release prevention program includes but is not limited to the following elements.\n\n\n\n1) Safety training for employees who operate, inspect, or repair the isobutylene handling equipment.\n\n\n\n2) Unit specific procedures for operating, trouble shooting, and maintaining the isobutylene handling equipment.\n\n\n\n3) A comprehensive preventive maintenance and mechanical integrity program to insure the safety and\n\nreliability of the isobutylene handling equipment.\n\n\n\n4) A leak detection and repair (LDAR) program to detect leaking valves and pump seals.\n\n\n\n5) Perimeter gas monitoring systems at the storage, reactor, and off-loading areas that are tied into\n\nautomatic alarms, shutdown interlocks, water curtains, and water/foam deluge systems.\n\n\n\n6) A process gas monitoring system at the spent gas compressors and associated equipment that is tied into\n\nautomatic alarms, shutdown interlocks, and a water deluge system.\n\n\n\n7) An emergency vent flare system to relieve any excess pressure that could occur.\n\n\n\n8) A management of change program.\n\n\n\n9) A Process Safety Management (PSM) System developed to be in compliance with OSHA's PSM standard.\n\n(29CFR1910.119)\n\n\n\nFive Year Accident History\n\n\n\nThere have been no accidental releases of isobutylene within the last five years that meet the criteria of reporting in \"Air Programs, Part 68, Subpart B, 68.42\".\n\n\n\nEmergency Response Program\n\n\n\nThe Oil City Plant has a comprehensive emergency contingency program, which has been reviewed by the Venango county EMA and the local responding fire departments (Cornplanter Twp. and Oil City), and has been approved by the Venango County Local Emergency Planning Commission (LEPC). The Oil City Plant does not have an emergency response team for fire response, but all operations and maintenance employees are trained at the 24-hour technician level for hazardous material spills and clean- up. Oil City Plant personnel hav"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044258,
      "SummaryText": "e been trained how to activate countermeasures and notify emergency response agencies. They have been trained how to assess the situation and communicate to emergency response personnel the most prudent course of action to take to safeguard the community. Oil City Plant management personnel will report to work on site with emergency responders as a resource for controlling releases of isobutylene, and for operating counter measure systems. Oil City Plant personnel will assist the Incident Commander on the scene as specialists in handling isobutylene. The emergency plan is reviewed and resubmitted to the Venango County LEPC when updated for its review and approval. Necessary elements of the plan are incorporated into the Venango County Emergency Response Plan.  Periodic tabletop or deployment drills are conducted to keep emergency response personnel familiar with plant materials, emergency systems, and response measures.\n\n\n\nRecent Changes to Improve Safety\n\n\n\nThe Oil City Plant performs periodic process hazard analyses (safety reviews) of all chemical processes, including the isobutylene system. Some of the recently completed changes to improve the safety of the isobutylene storage and transfer system are listed below.\n\n\n\n1)Isobutylene thermal expansion relief valves located at the storage vessels and the unloading area were piped to the flare system instead of to atmosphere;\n\n\n\n2)Isobutylene railcar unloading connections were changed to inherently safer dry-lock fittings;\n\n\n\n3)Internal excess flow valves were installed in the storage vessels on the primary liquid and vapor transfer nozzles;\n\n\n\n4)External excess flow valves and  leak-free thermometer thermowells were installed on small vessel appurtenances on the storage vessels;\n\n\n\n5)Additional LEL detection systems with shutdown interlocks were installed in pipe rack locations that contain isobutylene piping;\n\n\n\n6)Several process area fixed fire extinguishing systems were interlocked to shut down isobutylene equipm"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044258,
      "SummaryText": "ent in the event of fire system activation;\n\n\n\n7)Hot work procedures were upgraded to include continuous LEL monitoring during all hot work performed in Hazardous Locations;\n\n\n\n8)Hazardous Locations were re-evaluated for proper electrical classifications and all electrical equipment for these areas was confirmed to be compliant;\n\n\n\n9)A Building Siting Study was conducted by an external consultant and several corrective action items were implemented based on the findings; and\n\n\n\n10)Layer of Protection Analyses (LOPAs) were performed on critical equipment within the Isobutylene system and additional layers of protection have been added where the analyses did not meet the specified risk criteria.\n\n\n\nThe Oil City Plant has a continuous improvement philosophy in all safety and environment issues.\n\n"
    }
  ]
}