{
  "FacilityID": 1000083048,
  "FacilityName": "ALTIVIA Chemical Complex",
  "FacilityStr1": "1901 W H Street",
  "FacilityStr2": null,
  "FacilityCity": "La Porte",
  "FacilityState": "TX",
  "FacilityZipCode": "77571",
  "Facility4DigitZipExt": "0995",
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County-Deer Park Area L",
  "FacilityLatDecDegs": "29.654833",
  "FacilityLongDecDegs": "-095.036528",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.altivia.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 555853949,
  "ParentCompanyName": "ALTIVIA Specialty Chemicals, LLC.",
  "Company2Name": null,
  "CompanyDUNS": 120957840,
  "Company2DUNS": 0,
  "OperatorName": "ALTIVIA Specialty Chemicals, LLC.",
  "OperatorStr1": "1100 Louisiana St Suite 4800",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "RMPContact": "Derick Meadows",
  "RMPTitle": "Plant Manager",
  "FTE": 88,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000022334",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-01-01 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-10-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-10-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-10-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-10-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 29.65576,
  "FRS_Long": -95.03762,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103801,
      "AltID": "ALTIVIA La Porte",
      "FacilityID": 1000083048,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000105115,
          "ProcessID": 1000103801,
          "NAICSCode": "325199",
          "_desc": {
            "NAICS_CODE": "325199",
            "NAICS_DESCRIPTION": "All Other Basic Organic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129946,
          "ProcessID": 1000103801,
          "ChemicalID": 62,
          "Quantity": 720000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000129947,
          "ProcessID": 1000103801,
          "ChemicalID": 19,
          "Quantity": 246240.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 19,
            "ChemicalName": "Methyl chloroformate  [Carbonochloridic acid, methylester]",
            "CASNumber": "79-22-1",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000129948,
          "ProcessID": 1000103801,
          "ChemicalID": 30,
          "Quantity": 65000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 30,
            "ChemicalName": "Isopropyl chloroformate  [Carbonochloridic acid, 1-methylethy ester]",
            "CASNumber": "108-23-6",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000129949,
          "ProcessID": 1000103801,
          "ChemicalID": 32,
          "Quantity": 60500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 32,
            "ChemicalName": "Propyl chloroformate  [Carbonochloridic acid, propylester]",
            "CASNumber": "109-61-5",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000129950,
          "ProcessID": 1000103801,
          "ChemicalID": 10,
          "Quantity": 15100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 10,
            "ChemicalName": "Phosgene  [Carbonic dichloride]",
            "CASNumber": "75-44-5",
            "Threshold": 500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629946,
          "ProcessID": 1000103801,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629947,
          "ProcessID": 1000103801,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629948,
          "ProcessID": 1000103801,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629949,
          "ProcessID": 1000103801,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629950,
          "ProcessID": 1000103801,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000083048,
      "SummaryText": "EXECUTIVE SUMMARY\n\n10/15/2019\n\nALTIVIA Specialty Chemicals, LLC - La Porte, Tx (ALTIVIA)\n\n\n\nThe Environment, Health and Safety Policy of ALTIVIA Specialty Chemicals, LLC - La Porte, Tx is \"to manufacture, sell, and distribute products worldwide in a manner that is safe and protective of our employees, neighbors, customers and other stakeholders, and the environment.\"  In fulfilling this policy, ALTIVIA Specialty Chemicals, LLC - La Porte, Tx has made a commitment to follow several guiding principles including:\n\n\n\n* providing a safe and healthful workplace for our employees;\n\n* operating our facilities  to prevent harm to public health and the environment;\n\n* assuring that ALTIVIA Specialty Chemicals, LLC products can be produced, distributed, used, and disposed of safely; \n\n* alerting potentially affected persons to known or reasonably foreseeable hazards of our products and activities and informing them about proper protective measures; \n\n* contributing to the public's understanding and management of any significant risks arising from our products or activities;\n\n* training, equipping and supporting all employees in the management and implementation of environment, health, safety and security activities at our facilities; and \n\n* compliance with applicable laws and regulations concerning environment, health and safety.\n\n \n\n ALTIVIA is committed to the Responsible Care voluntary initiative for safe management of chemicals.  ALTIVIA follows the Responsible Care Codes of Management Practice, which are integral to the implementation of the ALTIVIA's  Environment, Health & Safety Policy.   The Responsible Care Community Awareness Code of Management Practice and ALTIVIA's Community Awareness and Emergency Response (CAER) Policy are designed to assure emergency preparedness and to foster community right-to-know.  CAER Policy requires the La Porte plant to have a pro-active community awareness and emergency response program to handle emergencies that might happen in that f"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000083048,
      "SummaryText": "acility.   Our community awareness programs include: emergency response plans; making Safety Data Sheets available to the appropriate police department, fire department, hospital emergency medical services and other appropriate services; open house programs; periodic  drills to test the emergency response plans; and an annual review and test of the plans.\n\nThe La Porte facility complies with corporate goals and maintains a safe work place and environment.  This is accomplished by developing site specific programs that address EHS&S issues.  These issues are addressed in management accountabilities to assure their effectiveness.  The environmental , health, safety and security leadership team is one example of this commitment.\n\n\n\nRegulated substances handled\n\nALTIVIA's La Porte plant produces and stores alkyl chloroformates, organic acid chlorides and various specialty chemicals.  The facility produces phosgene on demand for use as a raw material in its' manufacturing processes and stores chlorine on-site in railcars.\n\n\n\nGeneral accidental release prevention program and chemical specific prevention steps.\n\nThe ALTIVIA La Porte plant complies with OSHA's Process Safety Management Rule (29 CFR 1910.119), as well as applicable TCEQ, USEPA and DOT Requirements.  In addition to the above referenced programs there are several pro-active facility specific activities designed to reduce the number and severity of incidents at the plant.\n\nThe facility has installed multi-point gas release detectors, capable of detecting phosgene and our chlororformate products, in the various production units and 24 fence line monitors with similar capability. This network of fenceline monitors has been upgraded on two occasions the most recent completed in 2013.  In addition, the site monitors more than 20,000 connections each quarter to detect and quantify fugitive emission sources. The facility phosgene header is monitored on a monthly basis to comply with USEPA regulations found in NSPS Su"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000083048,
      "SummaryText": "bpart VV.\n\n\n\nTrained personnel and environment, health and safety measures are included in all phases of the La Porte operation. Detailed engineering and design standards are used.  These standards include national codes and standards, quality assurance inspections, over pressure protection systems, toxic gas detectors, emergency shutdown systems, a fire water system, and computer controls for the processes.  Due to the nature of the raw materials and final products managed at this facility ALTIVIA internal standards for materials of construction, testing and inspection methods, among others, exceed published industry standards. Every individual in the facility receives training commensurate with their job responsibilities.  Training may consist of an overview of the plant safety signals given to visitors, a process and hazards overview for contractors before they begin working in a unit, or job-related training and testing for an operator or supervisor prior to assuming their duties. All new All new employees participate in a week of onboarding training,  a primary focus of which are EHS&S procedures and best management practices, prior to  reporting to their work location.   Training is an ongoing process that includes periodic retraining, as necessary.  \n\n Safety, environmental, operating, and training procedures are subject to periodic reviews and updates, as appropriate.  Additional systems are in place to review proposed changes and assure that any new training requirements are met.  Another system assures a detailed review for hazards in each operating unit on a prescribed frequency.  Training and updating procedures are monitored with multiple systems.  \n\n\n\nThe La Porte facility has a comprehensive maintenance and inspection program that minimize the possibility of equipment or piping failures.  Routine inspections of equipment are done in the same manner as the initial quality assurance inspections completed prior to installation.  Equipment inspections uti"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000083048,
      "SummaryText": "lize procedures such as proof testing, where safeguard systems are forced to function in a controlled manner.  This assures that the safeguards will function if they are ever needed.  Preventive and predictive maintenance programs are utilized including, vibration monitoring, infrared imaging, inspections by insurance specialists and root-cause analysis procedures.  Piping is inspected and tested according to best management practices prior to installation. The piping is monitored by methods such as visual inspections by the operators or maintenance personnel, emissions monitoring and thickness measurements. Each of these individuals is properly trained in the application of these testing procedures.  \n\n\n\n\n\nFive-year accident history.\n\nThe La Porte plant has had no incidents that meet the EPA's reporting guidelines in the past five years. \n\n\n\nEmergency response program\n\nThe La Porte plant has a written emergency response plan.  The plan includes procedures for informing the public and emergency response organizations of an emergency condition; documentation of proper first aid and emergency medical treatment; and procedures and measures for emergency response.  The plant's emergency response plan has been reviewed and coordinated with the City of La Porte's emergency response program.  In addition, the plan is coordinated with the Channel Industries Mutual Aid plans.  \n\n\n\nIn addition to the written plan, La Porte's emergency response program includes a permanently installed fire protection system; mobile firefighting equipment; a SAFER computer-based gas dispersion modeling program; membership in the local area-wide industrial emergency response organization; participation with the La Porte Local Emergency Planning Committee in coordinating emergency response plans and in planning and practicing emergency response drills.  The La Porte plant piloted the implementation of a notification system designed to communicate ongoing incidents at the plant to our industrial a"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000083048,
      "SummaryText": "nd community neighbors.  This system does not rely on cumbersome Fax or telephone ringdown systems to communicate to the potentially affected off-site individuals.  All notifications are completed within one system and can be completed in under 10 minutes.  After piloting the system, the entire La Porte LEPC adopted it for each of its member companies. \n\n\n\nPlanned/Completed changes to improve safety\n\nALTIVIA  is committed to the process of continuous improvement.  This commitment extends beyond production issues into the environmental and safety aspects of all operations. Changes in control instruments are made on an ongoing basis, as necessary, to assure that the most reliable and effective controls are used.  \n\n A fugitive emission collection system has been installed to reduce the possibility of a gas release leaving the plant site. \n\nInstallation of a chlorine vaporizer, a design that is highly recommended by the Chlorine Institute, which mitigated the potential for a reaction between hexane and chlorine.\n\nInstallation of our \"cold vents\" unit. The purpose of this unit is to divert the phosgene-rich vent stream into the unit and condense the phosgene from the vent stream. The recovered phosgene is then returned to the production process.\n\n  \n\nFor additional plant information, contact Derick Meadows, Plant Manager, at 281-867-2700.  \n\n"
    }
  ]
}