{
  "FacilityID": 1000005716,
  "FacilityName": "Clarksburg Water Board",
  "FacilityStr1": "1001 South Chestnut Street",
  "FacilityStr2": null,
  "FacilityCity": "Clarksburg",
  "FacilityState": "WV",
  "FacilityZipCode": "26301",
  "Facility4DigitZipExt": "4254",
  "FacilityCountyFIPS": "54033",
  "LEPC": "Harrison County LEPC",
  "FacilityLatDecDegs": "39.269167",
  "FacilityLongDecDegs": "-080.352778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.clarksburgwater.com",
  "FacilityEmailAddress": "rwelch@clarksburgwater.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Clarksburg Water Board",
  "OperatorStr1": "1001 South Chestnut Street",
  "OperatorStr2": null,
  "OperatorCity": "Clarksburg",
  "OperatorStateFIPS": "WV",
  "OperatorZipCode": "26301",
  "OperatorZipCodeExt": "4254",
  "RMPContact": "Mr. Don Summers",
  "RMPTitle": "Plant Superintendent",
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000019874",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-07-22 00:00:00",
  "SafetyInspectionBy": "State Health Department   Philippi District Office",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.26955,
  "FRS_Long": -80.35229,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000006779,
      "AltID": "Water treatment",
      "FacilityID": 1000005716,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000006918,
          "ProcessID": 1000006779,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000007619,
          "ProcessID": 1000006779,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000507619,
          "ProcessID": 1000006779,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000005716,
      "SummaryText": "The Clarksburg water treatment system utilizes chlorine gas for disinfection purposes.  The facility utilizes one ton cylinders of chlorine gas which are received at the facility on a once-per-month basis.  Up to eight cylinders are maintained on-site at any one time.  All eight cylinders are stored inside the water treatment plant chlorine cylinder storage building.  The process utilizes one cylinder on-line at any one time.  One additional cylinder is connected to an automatic transfer system.  The automatic transfer system allows the second cylinder to go on-line as soon as the chlorine from the first cylinder has been totally utilized.  The average chlorine usage rate at this facility is 500 lbs per day.  The Clarksburg water system utilizes a Siemens Water Technologies (SWT) chlorinator system.  This system operates such that the chlorine transfer from the cylinder to the chlorinators is under vacuum versus pressure.  This type of arrangement provides for minimal potential for leaks of chlorine through the piping.  The facility has a preventive maintenance program which is designed to maintain the equipment that handles chlorine gas in a good operating mode.  Chlorine cylinders are received from the vendor and the transfer of the cylinders from the truck to the chlorine storage building is always performed during daylight hours, and is attended by the truck driver and a Clarksburg water treatment plant operator.  The Clarksburg water treatment plant is continuously manned.  There are two chlorine sensor systems located at the facility.  These sensors are designed to detect any chlorine release within either the chlorine cylinder storage area or the chlorinator room.  Both the chlorinator room and chlorine storage building are designed with exhaust fans that automatically start if a chlorine release is identified by either of the sensors.\n\nThe alternative scenario identified for this facility would be for a failure of the yoke piping which connects to the cylind"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000005716,
      "SummaryText": "er.  If this piping and related regulator valve failed, a maximum of 10 lbs per hour of chlorine gas could be released from one cylinder.\n\nEMERGENCY RESPONSE PROCEDURES\n\nIn the event of a severe chlorine release, CWTP employees are instructed to call 911 and request assistance from the Clarksburg Fire Department.  The Clarksburg Fire Department personnel can respond within 5 minutes and have the adequate personal protective equipment to isolate valves in the event of such an incident.  Regarding lower volume incidents involving minor leaks, CWTP has a contract with UNIVAR of Pittsburgh, PA.  UNIVAR provides emergency response to any chlorine releases.  UNIVAR personnel can be on-site within 2.0 hours of notification of a need.  Once the chlorine usage area has been adequately ventilated and the release of chlorine stopped, CWTP personnel will enter into the area to perform the repair work necessary.  CWTP personnel have been instructed to never enter into a chlorine usage area in the event of an alarm situation.  The facility is covered under a generic emergency response implemented by the Harrison County Office of Emergency Services.  The facility also maintains an emergency response plan for evacuation of employees in the event of an emergency and shut down of critical equipment.\n\nTRAINING\n\nCWTP personnel receive annual chlorine awareness training from the current supplier.  This training is performed to insure that personnel understand the hazards of dealing with chlorine gas and are familiar with the routine tasks associated with their jobs, as well as aware of the emergency response procedures necessary to be followed in the event of a chlorine release. CWTP personnel will also be subjected to unannounced drills to insure that all personnel are familiar with the procedures to be followed in the event of a release of chlorine.  \n\nAFFECTED AREA\n\nIn the event of a catastrophic release of chlorine gas, one school, one nursing home, two hospitals, several residences"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000005716,
      "SummaryText": ", several business, and one recreational area would be affected.  For an alternative scenario release, several adjacent residences would be affected."
    }
  ]
}