{
  "FacilityID": 1000047538,
  "FacilityName": "Lopez Foods, Inc.",
  "FacilityStr1": "9500 Northwest 4th Street",
  "FacilityStr2": null,
  "FacilityCity": "Oklahoma City",
  "FacilityState": "OK",
  "FacilityZipCode": "73127",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40017",
  "LEPC": "Canadian County LEPC",
  "FacilityLatDecDegs": "35.474167",
  "FacilityLongDecDegs": "-097.688333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 94768702,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Officers of Lopez Foods, Inc.",
  "OperatorStr1": "9500 North West 4th Street",
  "OperatorStr2": null,
  "OperatorCity": "Oklahoma City",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "73127",
  "OperatorZipCodeExt": null,
  "FTE": 500,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000157545",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-11-12 00:00:00",
  "SafetyInspectionBy": "Austain Risk",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-06-01 00:00:00",
  "ErrorReportDate": "2004-07-27 00:00:00",
  "ReceiptDate": "2015-06-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-06-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-06-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.1",
  "FRS_Lat": 35.47217,
  "FRS_Long": -97.68477,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "5.2",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000059346,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000047538,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000072610,
          "ProcessID": 1000059346,
          "ChemicalID": 56,
          "Quantity": 71951.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000060408,
          "ProcessID": 1000059346,
          "NAICSCode": "31199",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000049418,
              "Process_NAICS_ID": 1000060408,
              "SafetyReviewDate": "2014-07-06 00:00:00",
              "PHA_Date": "2013-03-06 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-05-08 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 0,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 1,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-09-09 00:00:00",
              "TrainingReviewDate": "2014-04-12 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-04-12 00:00:00",
              "EquipmentInspectionDate": "2014-10-31 00:00:00",
              "EquipmentTested": "pressure vessels, storage tanks, piping systems, relief and vent valves, emergency shoutdown systems, and pumps",
              "ChangeMgmtDate": "2014-03-01 00:00:00",
              "ChangeMgmtReviewDate": "2014-03-01 00:00:00",
              "PreStartupReviewDate": "2014-03-01 00:00:00",
              "ComplianceAuditDate": "2013-05-09 00:00:00",
              "AuditCompletionDate": "2014-03-07 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-12-03 00:00:00",
              "HotWorkPermitReviewDate": "2012-08-01 00:00:00",
              "ContractorSafetyReviewDate": "2014-10-14 00:00:00",
              "ContractorSafetyEvalDate": "2014-10-14 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000060262,
                  "PreventionProgram3ID": 1000049418,
                  "ProcessChemicalID": 1000072610
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000047538,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-03-12 00:00:00",
    "ERTrainingDate": "2014-01-15 00:00:00",
    "CoordinatingAgencyName": "Oklahomc City Fire Department",
    "CoordinatingAgencyPhone": "4052973439",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000047538,
      "SummaryText": "This is to inform all interested persons, including employees that Lopez Foods, Inc. is complying with OSHA's Process Safety Management Standard (called Process Safety Management or PSM), Title 29 Code of Federal Regulations (CFR) 1910.119, and EPA's Risk Management Program regulations (called RM program), Title 40 CFR Part 68, have developed policies, to deal with the risks involved with the storage, handling, and processing of hazardous chemicals.  In this way we promote overall plant, worker, and public safety.  These programs enable our facility to prevent the occurrence, and minimize the consequences, of significant releases of toxic substances as well as fires, explosion, and other types of catastrophic accidents.  Overall, these programs prevent accidental fatalities, injuries, illnesses and avoid physical property damage.\n\n\n\nOur safety program is applied to any activity involving hazardous chemicals including any use, storage, handling or the on-site movement of such chemicals, or combination of these activities.\n\n\n\nAny group of vessels which are interconnected and separated vessels which are located such that a hazardous chemical could be involved in a potential release shall be considered a single process.\n\n\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices which govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary.  They are also communicated to and accepted by all employees at the facility.\n\n\n\nThe refrigeration required is provided by mechanical equipment which uses anhydrous ammonia as the thermodynamic working fluid in a closed circulatory system.  Ammonia has been the principal working fluid for mechanical refrigeration systems for the food processing industry.  The total refrigeration capacity installed in the facility is approximately 69,436 pounds of ammonia.\n\n\n\nThe plant's process entails processing of raw meat products is such a way as "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000047538,
      "SummaryText": "to prepare pre-formed and uncooked meat products for the fast food industry.  Meat products require refrigeration and freezing to preserve the products against spoilage during manufacturing, transportation and in retail stores.\n\n\n\nThe worst case scenario would involve a forklift striking a storage vessel causing a puncture or other related damage.  This would cause a high pressure liquid release of approximately 4,440 pounds of ammonia resulting in a ten minute release.  Under the worst case weather conditions, ammonia could travel .8 miles before dispersing enough to no longer pose a hazard to the public.  This scenario is unlikely for the following reasons:  worst case weather conditions are uncommon, procedures are in place to prevent unauthorized entry of forklifts, safety procedures are in effect to address the safe operation of equipment in this location, and training is conducted to all forklift operators to insure safe-operating procedures and as needed to insure employee awareness.\n\n\n\nThe alternative release scenario would involve failure of a transfer hose during unloading resulting in a release of 8,000 pounds over time period of 33 minutes.  Under common weather conditions, ammonia could travel .1 of a mile before dispersing enough to no longer pose a hazard to the public.  Transfer hose failure was chosen as the alternative release scenario because it is a temporary connection and constructed of material other than steel.  This scenario is unlikely for the following reasons: emergency equipment such as an excess flow valve on the tank truck and valves to isolate the transfer hose, the vessel has automatic shut off, the facility accident prevention program in place at the facility including operating procedures to have personnel present at all times during unloading, and the mechanical integrity program for regular maintenance, inspection and testing, and replacement of equipment.\n\n\n\nThe general accidental release prevention program and chemical-specific"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000047538,
      "SummaryText": " prevention steps are found in the process safety management program.  The PSM program places necessary checks and balances for maintaining a safe operating refrigeration system.  Training procedures are in place to insure that all maintenance employees responsible for maintaining the system receive recertification training every three years and any new employee receives training before conducting operations on the ammonia system.\n\n\n\nControls and equipment go through an intense check list to insure safe operation of the equipment by qualified maintenance engineers on a daily basis.  The system is maintained 24 hours a day seven days a week by qualified maintenance engineers.\n\n\n\nThe emergency action plan utilized is OSHA's regulation 29 CFR 1910.38.  This plan is in place for the safe evacuation of employees.  Training is given to all affected employees annually and before their duty assignment begins.  Evacuation exercises are conducted as needed to promote training and additional understanding of the program.\n\n\n\nThe emergency response team is designated to the Oklahoma City Fire Department.  The Oklahoma City Fire Department participates in the overall program and coordinates with management in areas of planning for emergencies and emergency operations.\n\n\n\nUnder the emergency planning and community right to know act (EPCRA) and under section 303 of EPCRA, local emergency planning committees (LEPCs) must prepare an emergency response plan for facilities in their planning district having toxic substance listed under EPCRA section 302 in excess of the threshold planning quantity established under that section.\n\n\n\nThe Oklahoma City LEPC has been furnished a copy of this company's \"Emergency Action Plan.\"  This plan includes toxic end points of the worst case scenario for this facility.  The management of Lopez Foods, Inc. will continue to coordinate response and evacuation procedures with the committee to insure the public sector is protected.\n\n\n\nIf a toxic release occ"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000047538,
      "SummaryText": "urs, Lopez Foods, Inc. has in its EAP plan, all necessary procedures in place to promote an effective response if the need arises.  The emergency response procedures include all necessary persons and agencies to contact to insure the utmost protection to the public, environment and employees.\n\n\n\nThe planned changes to improve safety are to improve awareness in training programs concerning the safe operation of equipment when operating in the vicinity of ammonia or vessels."
    }
  ]
}