{
  "FacilityID": 1000035004,
  "FacilityName": "Starbucks Manufacturing Corp",
  "FacilityStr1": "11 Valencia Way",
  "FacilityStr2": null,
  "FacilityCity": "Augusta",
  "FacilityState": "GA",
  "FacilityZipCode": "30906",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13245",
  "LEPC": "Richmond County LEPC",
  "FacilityLatDecDegs": "33.28424",
  "FacilityLongDecDegs": "-81.95590",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Starbucks Manufacturing Corporation",
  "OperatorStr1": "11 Valencia Way",
  "OperatorStr2": null,
  "OperatorCity": "Augusta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30906",
  "OperatorZipCodeExt": null,
  "RMPContact": "James Demons",
  "RMPTitle": "Safety Manager",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000222109",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "21735",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-01-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-01-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-01-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-01-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000043358,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000035004,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000043740,
          "ProcessID": 1000043358,
          "NAICSCode": "31192",
          "_desc": {
            "NAICS_CODE": "31192",
            "NAICS_DESCRIPTION": "Coffee and Tea Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000052125,
          "ProcessID": 1000043358,
          "ChemicalID": 56,
          "Quantity": 14700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000552125,
          "ProcessID": 1000043358,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000035004,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n- Accidental Release Prevention and Emergency Response Policies\n\n\n\nStarbucks Manufacturing Corporation- Augusta is strongly committed to employee, public, and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated process. It is our policy to implement appropriate controls to prevent possible accidental releases of regulated substances. However, if such an accidental release does occur, we are coordinated with the Augusta Fire Department and the Richmond County Local Emergency Planning Committee for emergency response support.\n\n\n\n\n\n- The Stationary Source and the Regulated Substances Handled\n\n\n\nPresently Anhydrous Ammonia is the only RMP regulated substance present at this facility above a threshold quantity.  Ammonia is utilized as the primary cooling media in our closed-loop refrigeration system. The system's purpose is to provide refrigeration and cold storage capabilities for Starbucks operations.  Due to the  and characteristics of our ammonia refrigeration systems, as well as Process Safety Management (PSM) applicability, Starbucks is covered under Program 3 of the RMP regulations.\n\n\n\n- Offsite Consequence Analysis \n\n\n\nThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario have been completed as stated in Sections 2 and 3 of the RMP*eSubmit document..\n\n\n\nTo evaluate both the worst case, and alternative release off site consequence analysis, EPA's RMP Comp Hazardous Release software was utilized exclusively. As specified in the RMP Guidance, the worst case and alternate case release scenarios have been calculated and the results of the calculations are documented in the Starbucks RMP Plan on file at the facility.  Public and env"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000035004,
      "SummaryText": "ironmental receptors that could possibly be affected by the release scenarios were determined through the use of data from the 2010 US Census Bureau in CAPS, Circular Area Profiling System and Microsoft Streets mapping system software.\n\n\n\n- General Accidental Release Prevention Program \n\n\n\nStarbucks has taken all necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR Part 68.  To meet these necessary requirements Starbucks has implemented their Process Safety Management program through the written guidelines stated in the OSHA PSM Standard, 29 CFR 1910.119. \n\n\n\n- Accident History\n\n\n\nThis is a new production facility therefore there have been no ammonia related incidents at the Starbucks facility. \n\n \n\n\n\n- Emergency Action Plan\n\n\n\nStarbucks current Emergency Action Plan focuses on evacuation and response of the facility in the event of an ammonia emergency, with the assistance from local emergency response agencies performing rescue, firefighting, first-aid, medical treatment, and other response functions. The facility maintains a written Emergency Response Plan to document specific procedures to be implemented in the event of various emergencies, including ammonia release. The plan includes procedures for facility evacuation and response as well as for notification to the local emergency response agencies, which are responsible for notifying the public. The plan is promptly updated to reflect any pertinent changes taking place within the facility that would require modified procedures.\n\n\n\n- Planned Changes to Improve Safety:\n\n\n\nStarbucks currently has no changes planned for the ammonia refrigeration processes at this time.   However, the processes will be subjected to periodic process hazard analysis reviews for the purpose of identifying potential hazards and implementing the necessary improvement to provide a safer system. Starbucks personnel will also periodically review all potential opportunities to improve the safety "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000035004,
      "SummaryText": "of our personnel, the surrounding community, and the ammonia refrigeration processes.\n\n"
    }
  ]
}