{
  "FacilityID": 1000012272,
  "FacilityName": "ALDI, Inc",
  "FacilityStr1": "2700 Saucon Valley Road",
  "FacilityStr2": null,
  "FacilityCity": "Center Valley",
  "FacilityState": "PA",
  "FacilityZipCode": "18034",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42077",
  "LEPC": "Lehigh County LEPC",
  "FacilityLatDecDegs": "40.554067",
  "FacilityLongDecDegs": "-075.399883",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "CE",
  "FacilityURL": "www.aldi.com",
  "FacilityEmailAddress": "ctv@aldi.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "ALDI, Inc.",
  "OperatorStr1": "2700 Saucon Valley Road",
  "OperatorStr2": null,
  "OperatorCity": "Center Valley",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "18034",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kara Benson Harvey",
  "RMPTitle": "Director of Warehousing and Transpo",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000053096",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-03-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-03-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-03-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-03-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.55749,
  "FRS_Long": -75.40014,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "110",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000015161,
      "AltID": "Main Refrigeration System",
      "FacilityID": 1000012272,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000015482,
          "ProcessID": 1000015161,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000017750,
          "ProcessID": 1000015161,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000517750,
          "ProcessID": 1000015161,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012272,
      "SummaryText": "General\n\nAldi, Inc. Center Valley Facility is a distribution facility that stores various perishable products. Therefore, a refrigeration system is required to maintain product temperatures. The refrigerant chosen to accomplish this is anhydrous ammonia. While recognizing the hazards of ammonia, ALDI, Inc. Center Valley Facility strives to maintain the safest refrigeration system possible in order to protect employees, neighbors and the environment. \n\n1.0    Identification of Covered Process - ALDI, Inc. Center Valley Facility employs anhydrous ammonia as the refrigerant to maintain temperatures in the cold storage section of the warehouse. The overall plant charge is in excess of 10,000 Lbs., therefore, the OSHA Process Safety Management and EPA List Rule Applies.\n\n2.0    Program Level - The ammonia refrigeration system falls under the Program 3 guidelines.\n\n3.0    Management of Change - The management personnel with overall responsibility for the program is the Director of Warehousing and Transportation.\n\n4.0    Hazard Assessment - A hazard analysis has been performed on the Ammonia Refrigeration system. Three portions are included in this assessment.\n4.1   Worst Case Scenario The worst Case Scenario, as defined by the EPA; the owner/operator shall assume that the maximum quantity in the largest vessel is released as a gas over 10 minutes, due to an unspecified failure.  Atmospheric dispersion modeling has been performed to determine the distance traveled by the anhydrous ammonia before its concentration decreases to the toxic end point of 3 ppm. This level is defined by the American Industrial Hygiene Association (AIHA) as the concentration at which all individuals could be exposed without irreversible or serious health effects that would prevent protective action. As a result of the worst case evaluation, a radius of 0.9 miles has been determined and an affected population of 654. Please refer to the worse case section for specific details.\n4.2   Alternative Case Scenario T"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012272,
      "SummaryText": "he alternative case scenario was performed as above with the exception that the alternative case evaluates the release over 60 minutes. The result of this evaluation was a radius of 0.1 miles with an affected population of 7. Please refer to the alternative case section for specific details.\n4.3   Five Year Accident History  The ALDI, Inc. Center Valley Facility has not experienced a release over the past five years meeting the requirements for a reportable accident.\n\n5.0    Accident Prevention Program  ALDI, Inc.  Center Valley Facility is in full compliance with OSHA Process Safety  Management guidelines for the method of Accident Prevention. The Accident Prevention and PSM Programs emphasize: operator training, preventative maintenance, state of the art equipment, use of accurate operating procedures, hazard reviews of the system, ammonia awareness, proper auditing program and inspection programs.\n\n6.0  Emergency Response Program ALDI, Inc. Center Valley Facility utilizes a unified approach in handling emergencies that may arise in regard to the ammonia refrigeration system. All OSHA and EPA guidelines are adhered to and the Local Emergency Planning Commission has been consulted and a comprehensive response plan developed. ALDI, Inc. Center Valley Facility does not play an active role in the emergency response, however, personnel have been trained to cooperate with local authorities who are responding to an incident. The emergency response plan is reviewed annually and all parties are to be informed of any facility changes."
    }
  ]
}