{
  "FacilityID": 1000101173,
  "FacilityName": "Air Products, Sacramento",
  "FacilityStr1": "5025 83rd Street",
  "FacilityStr2": null,
  "FacilityCity": "Sacramento",
  "FacilityState": "CA",
  "FacilityZipCode": "95826",
  "Facility4DigitZipExt": "4743",
  "FacilityCountyFIPS": "06067",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.529722",
  "FacilityLongDecDegs": "-121.398889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PG",
  "FacilityURL": "www.airproducts.com",
  "FacilityEmailAddress": "whitera@airproducts.com",
  "FacilityDUNS": 188587349,
  "ParentCompanyName": "Air Products and Chemicals, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 3001070,
  "Company2DUNS": null,
  "OperatorName": "Air Products & Chemicals,Inc.",
  "OperatorStr1": "5025 83rd Street",
  "OperatorStr2": null,
  "OperatorCity": "Sacramento",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95826",
  "OperatorZipCodeExt": "4743",
  "FTE": 9,
  "OtherEPAFacilityID": "CAD982023665",
  "EPAFacilityID": "100000001972",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-11-30 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-06-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-06-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-06-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-06-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.529722,
  "FRS_Long": -121.398889,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000125500,
      "AltID": "LH2 Plant",
      "FacilityID": 1000101173,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000156863,
          "ProcessID": 1000125500,
          "ChemicalID": 155,
          "Quantity": 152958.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000138727,
              "ProcessChemicalID": 1000156863,
              "ChemicalID": 149
            },
            {
              "FlamMixChemID": 1000138728,
              "ProcessChemicalID": 1000156863,
              "ChemicalID": 93
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000126893,
          "ProcessID": 1000125500,
          "NAICSCode": "32512",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000108150,
              "Process_NAICS_ID": 1000126893,
              "SafetyReviewDate": "2022-05-18 00:00:00",
              "PHA_Date": "2024-11-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-05-18 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Water Monitors",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2022-05-12 00:00:00",
              "TrainingReviewDate": "2022-05-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer based training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": "Computer Based Testing",
              "MaintenanceReviewDate": "2022-05-14 00:00:00",
              "EquipmentInspectionDate": "2022-05-14 00:00:00",
              "EquipmentTested": "01.50 Feed Gas Compressor Installation",
              "ChangeMgmtDate": "2022-05-12 00:00:00",
              "ChangeMgmtReviewDate": "2022-05-13 00:00:00",
              "PreStartupReviewDate": "2022-04-07 00:00:00",
              "ComplianceAuditDate": "2021-11-30 00:00:00",
              "AuditCompletionDate": "2022-05-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-10-20 00:00:00",
              "HotWorkPermitReviewDate": "2022-03-27 00:00:00",
              "ContractorSafetyReviewDate": "2022-03-18 00:00:00",
              "ContractorSafetyEvalDate": "2022-03-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000135490,
                  "PreventionProgram3ID": 1000108150,
                  "ProcessChemicalID": 1000156863
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000101173,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-06-25 00:00:00",
    "ERTrainingDate": "2022-01-01 00:00:00",
    "CoordinatingAgencyName": "City of Sacramento Fire Department",
    "CoordinatingAgencyPhone": "9162283000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000101173,
      "SummaryText": "l readiness inspections are carried out as part of that process. Currently there are no planned facility changes that would affect facility safety."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000101173,
      "SummaryText": "operations management.  All operations employees are engaged directly and continuously through the company's Basic Safety Process.  Hot work permits are controlled under Section 5 A Safe Systems of Work, in the Air Products Global EH&S standards.  All contractor firms are evaluated prior to employment both in terms of technical competence and safety performance.  All contract workers participate in safety indoctrination training before being allowed to work on-site.\r\n\r\n4.  Five-year accident history:\r\n\r\nThere have been no accidents involving or accidental releases of flammable mixture or hydrogen that resulted in any deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage in the past five years.\r\n\r\n5.  The emergency response program:\r\n\r\nThe facility's emergency response program is based upon OSHA's HAZWOPER standard.  At this site, employees are trained to recognize emergencies and initiate emergency response from outside agencies.  They have been trained to OSHAA's First Responder Awareness Level.  The employees receive annual refresher training in their role in the emergency plan.  Emergency response activities have also been coordinated with the City of Sacramento Fire Department Haz Mat Team for emergencies related to the hydrogen process.  Periodic reviews are requested with the fire department to evaluate the effectiveness of our emergency procedures. The Site Emergency Procedure plan is reviewed and updated annually. Refresher training for site personnel is conducted annually. \r\n\r\n6.  Planned changes to improve safety:\r\n\r\nThe facility resolves recommendations from PHAs and Incident Investigations, some of which\r\nmay result in modifications to the plant design and operating procedures. All plant changes are covered in our Management of Change program which requires appropriate safety reviews with documentation. Safety recommendations and operationa"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000101173,
      "SummaryText": "essurization, corrosion, overfilling, process contamination, equipment failure, loss of cooling, heating, electrical, power, and instrument air, and earthquakes. All PHA and pre-start-up recommendations were identified and have been addressed since the initial Federal EPA and CalARP programs were put into place. \r\n\r\nDesign and operations process controls used to control potential process related incidents include vents, relief valves, check valves, manual shutoffs, automatic shutoffs, interlocks, alarms and procedures, grounding equipment, rupture disks and excess flow devices.  Mitigation systems include the firewater monitors and deluge systems.  Process area detectors are employed to monitor system operations.  Design features employed to prevent and/or mitigate possible release events include bullards (bump posts) to protect process and storage equipment and structural design to meet Seismic Zone 4 standards.\r\n\r\nThe Sacramento facility employs both company wide and site-specific operating procedures to assure safe and proper plant operations.  In addition to plant operation's training, all personnel complete the company's Environmental, Health, and Safety training and maintain competence through regularly scheduled refresher courses and program updates.  A mechanical integrity program has been developed and is in place for the Sacramento facility for all RMP covered process systems.  The Sacramento facility participates in the Management of Change program assuring the proper level of technical review for all proposed facility changes.  Compliance audits of RMP systems and all EH&S systems by our Corporate Assurance Group.  All incidents that could have a safety and/or environmental impact are entered into the Corporate Incident Tracking System and evaluated both by plant and corporate personnel.  Apollo Root Cause Analyses are performed on any serious incidents or near misses and are reviewed by the Global Operations Incident Review Committee comprised of senior"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000101173,
      "SummaryText": "ydrogen sent to P&G is pure hydrogen. \r\n\r\nLiquid hydrogen is also produced from the hydrogen gas taken from the reformer process. Liquid hydrogen is produced by putting hydrogen gas through a series of compression, cooling and expansion steps. The liquid hydrogen is stored in two 70,000 gallon liquid hydrogen tanks and the backup 20,000 gallon tank.  Liquid hydrogen is loaded into highway tankers and shipped to various off-site customers. Liquid hydrogen stored on site is pure hydrogen. \r\n\r\nREFORMER PROCESS: Hydrocarbon based gases (natural gas or methane) are received by our plant via pipeline and used as our feedstock.  The feed stock is then compressed and cracked in our reformer (furnace).  By exposing the feedstock to a catalyst in the presence of heat (approximately 1,500 degrees F.) and steam, a chemical reaction takes place that converts the feedstock into hydrogen, carbon monoxide and carbon dioxide.  The carbon monoxide and carbon dioxide is then separated from the hydrogen in adsorbers.  The pure hydrogen is then compressed and delivered to customers or the hydrogen liquifier via pipe. \r\n\r\nThe regulated substance handled at this facility is the flammable mixture (hydrogen and methane). \r\n\r\nThe site stores liquid hydrogen in two 70,000 gallon tanks and one 20,000 gallon tank. The site also has a small amount of gaseous hydrogen/ methane contained in the operating process equipment and lines. \r\n\r\n3.  The general accidental release prevention program and specific prevention steps:\r\n\r\nThe facility developed prevention program elements based on the Federal EPA's Accidental Release Prevention Plan, the California Accidental Release Prevention Program (CalARP), and OSHA's Process Safety Management (PSM) regulation.  This facility was designed and constructed to comply with applicable state and industry codes.\r\n\r\nAs part of the basic prevention plan a formal HAZOP was performed considering hazards such as toxic release, fire, explosion, runaway reactions, over pr"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000101173,
      "SummaryText": "1.  Accidental release prevention and emergency response policies:\r\n\r\nAt this facility, we manufacture gaseous and liquid hydrogen.  Hydrogen and methane, in the amounts handled by our facility, is considered hazardous by the EPA.  It is our policy to adhere to all applicable Federal and state rules and regulations.  Air Products manages the safety of the regulated processes by means of operating procedures, equipment testing and inspections,  safety devices (e.g., alarms, shutdowns, instrumentation, relief devices) inherent in the design of this facility and other controls and systems designed to prevent accidental releases of hazardous chemicals.  Safe work practices and training of our personnel supplement the inherent safe design of the plant.\r\n\r\nOur emergency response program is based upon OSHAA's HAZWOPER regulation.  The emergency response plan includes procedures for the notification of the local fire authority and Hazardous Materials unit so that appropriate measures can be taken by local emergency responders to control accidental releases.\r\n\r\nThis document has been prepared in accordance with the EPAA¿s Risk Management Plan regulation (40 CFR, Part 68). The substances and processes considered during the preparation of this RMP and the scenarios described were selected based on criteria established in the regulation.\r\n\r\n2.  The stationary source and regulated substances handled:\r\n\r\nThe primary purpose of this facility is the manufacturing of gaseous and liquid hydrogen. Gaseous hydrogen is used by our customer in their manufacturing process. Gaseous hydrogen is produced in the reformer process (See Reformer Process below) and transmitted to the customer via pipeline. The pipeline is connected to a 20,000 gallon liquid hydrogen backup tank that supplies the pipeline when the reformer is off-line. Gaseous hydrogen exists in various stages of purity at the Sacramento plant, depending on where it is in the manufacturing process. Ultimately the product gaseous h"
    }
  ]
}