{
  "FacilityID": 1000029801,
  "FacilityName": "Cedar Water Treatment Facility",
  "FacilityStr1": "16207 SE Old Petrovitsky Road",
  "FacilityStr2": null,
  "FacilityCity": "Renton",
  "FacilityState": "WA",
  "FacilityZipCode": "98058",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53033",
  "LEPC": "King County LEPC",
  "FacilityLatDecDegs": "47.432500",
  "FacilityLongDecDegs": "-122.132583",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cityofseattle.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 117353730,
  "ParentCompanyName": "Seattle Public Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CH2M HILL  - Operator",
  "OperatorStr1": "16207 SE Old Petrovitsky Road",
  "OperatorStr2": null,
  "OperatorCity": "Renton",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98058",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Wesely",
  "RMPTitle": "Project Manager",
  "FTE": 8,
  "OtherEPAFacilityID": "WAD988499596",
  "EPAFacilityID": "100000199769",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2001-07-01 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-08-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-08-09 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-08-09 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-08-09 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036352,
      "AltID": "Drinking Water Treatment",
      "FacilityID": 1000029801,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000036734,
          "ProcessID": 1000036352,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000043978,
          "ProcessID": 1000036352,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000543978,
          "ProcessID": 1000036352,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029801,
      "SummaryText": "Seattle Public Utilities (SPU) and CH2M HILL (Operator) provides retail municipal and industrial water supply to its direct service area within the corporate boundaries of the City of Seattle, and on a wholesale basis to wholesale water purveyors throughout King County.  SPU and CH2M HILL operates the Cedar Water Treatment Facility orginally (Lake Youngs Water Treatment Plant).  This facility use's chlorine gas for water disinfection in excess of the RMP threshold of 2500 pounds.  The Cedar Water Treatmnet Plant is located in the suburb of Renton, southeast of Seattle.  It is located within a1200 acre reservation that is closed to the public.  The plant stores up to 24 tons of chlorine gas in one-ton cylinders, in an enclosed treatment building equiped with a scrubber system, a sump, and gas detectors.  The plant is staffed 24 hours a day by one Water Treatment Operator.  During normal business hours there may be other SPU and CH2M HILL employees and or consultants engaged in work on the Cedar Water Treatment Plant, sometimes near the plant process site.  They do not enter the plant or the chlorine process area without direct supervision.  SPU and CH2M HILL management is committed to protecting employees, the public, and the environment and to preventing injury or death that could result from chlorine gas releases.  To do this, SPU and CH2M HILL has a variety of safety and emergency resoponse policies in place to guide employees in general workplace safety, storage and handling of chlorine gas, fire prevention and suppression, and emergency response actions.  The only worst-case release scenario, as specifided by EPA, would involve the release of the entire contents of a one-ton cylinder in a 10 minute period.  Based on modeling with EPA's RMP*COMP model, this could impact an area within a radius of 0.9 miles of the plant.  Any release from this plant would be mitigated by the fact that all the chlorine is stored inside a sealed building that is equipped with a scru"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029801,
      "SummaryText": "bber system.  The worst case scenario is made even more unlikely by the fact that in order for the entire contents of a ton cylinder to be released with 10 minutes the cylinder would have to be split open.  Given the extreme strength of the cylinder design and the extremely safe industry wide record for this technology, only the most direct and sever trauma to the cylinder would be capable of creating such conditions.   The LANDVIEW software package has estimated a population of approximately 7,900 within the area of concern generated by the worst case release scenario.  SPU and CH2M HILL believes this figure to be a substantial overestimate.  However, for the pupose of compliance with the regulations SPU and CH2M HILL has included this figure in the RMP for the Cedar Water Treatment Plant.  The alternative case release scenario involves the potential rupture of a 5/16\" valve or transfer line during a cylinder maintenance or replacement operation.  This scenario estimates the impacts of the release of approximately 320 pounds of chlorine over a 60 minute period, with the same mitigation measures of indoor containment and scrubber system being in place.  When modeled with RMP*COMP, this could impact an area within 0.1 miles radius of the plant.   This area of concern would be entirely within SPU and CH2M HILL plant operations."
    }
  ]
}