{
  "FacilityID": 1000045502,
  "FacilityName": "South Fresh Processors",
  "FacilityStr1": "1231 US Hwy 43 South",
  "FacilityStr2": "PO Box 191",
  "FacilityCity": "Eutaw",
  "FacilityState": "AL",
  "FacilityZipCode": "35462",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01063",
  "LEPC": "Green County LEPC",
  "FacilityLatDecDegs": "32.8176989",
  "FacilityLongDecDegs": "-87.8851081",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": "www.southfresh.com",
  "FacilityEmailAddress": "info@southfresh.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "SouthFresh Aquaculture LLC",
  "OperatorStr1": "Route 2 Box 80-A Highway 43 South",
  "OperatorStr2": null,
  "OperatorCity": "Eutaw",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35462",
  "OperatorZipCodeExt": null,
  "FTE": 207,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000226365",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-07-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-07-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-07-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 32.817699,
  "FRS_Long": -87.885108,
  "FRS_Description": "OTHER",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000056468,
      "AltID": "Anhydrous Ammonia",
      "FacilityID": 1000045502,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068852,
          "ProcessID": 1000056468,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000057412,
          "ProcessID": 1000056468,
          "NAICSCode": "11251",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000047122,
              "Process_NAICS_ID": 1000057412,
              "SafetyReviewDate": "2013-08-20 00:00:00",
              "PHA_Date": "2013-08-21 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-08-20 00:00:00",
              "TrainingReviewDate": "2013-08-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-08-20 00:00:00",
              "EquipmentInspectionDate": "2013-10-03 00:00:00",
              "EquipmentTested": "PR1 - Air Unit in Processing Room",
              "ChangeMgmtDate": "2013-07-09 00:00:00",
              "ChangeMgmtReviewDate": "2013-07-09 00:00:00",
              "PreStartupReviewDate": "2013-07-09 00:00:00",
              "ComplianceAuditDate": "2013-08-20 00:00:00",
              "AuditCompletionDate": "2013-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2013-08-20 00:00:00",
              "HotWorkPermitReviewDate": "2013-08-20 00:00:00",
              "ContractorSafetyReviewDate": "2013-08-20 00:00:00",
              "ContractorSafetyEvalDate": "2013-08-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000057208,
                  "PreventionProgram3ID": 1000047122,
                  "ProcessChemicalID": 1000068852
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000045502,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Demolopis Fire Department",
    "CoordinatingAgencyPhone": "3342891212",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000045502,
      "SummaryText": "begin assessing its PSM and RMP program every 3 years.  Ammonia awareness training has been given to all current employees and will be embedded within new hire orientation as well."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045502,
      "SummaryText": "th the process operations are systematically identified and controlled effectively.  Recommendations are addressed in a timely manner. These studies are conducted every five years, at minimum. \r\n C. Operating procedures are maintained to address various modes of process operations, such as (1) unit start up, (2) normal operations, (3) temporary operations, (4) emergency operations, (5) emergency shutdown, (6) normal shutdown, and (7) initial start-up of a new process. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are maintained current and accurate by revising them as necessary to reflect changes made through the management of change process.  \r\nD. Training for all employees involved in operating the process complements the written procedures for process operations.   SOUTHFRESH AQUACULTURE LLC has implemented a comprehensive training program for all employees involved in operating the process.  New operators receive basic training in site operations. In addition, all operators periodically receive refresher training on the operating procedures to ensure that their skills and knowledge are maintained at an acceptable level. This refresher training is conducted at least every 3 years. All of this training is documented for each operator, including the means used to verify that the operator understood the training.\r\nE. Mechanical Integrity is a program that is in place at the SOUTHFRESH AQUACULTURE LLC facility that includes practices and procedures to maintain process equipment in a safe operating condition. The basic aspects of this program include: (1) conducting training, (2) developing written procedures and plans, (3) performing inspections and tests, (4) correcting identified deficiencies, and (5) applying quality assurance measures. In combination, these activities form a system that maintains the mechanical integrity of the process equipment.\r\nMaintenance personnel receive training on (1) an overview"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045502,
      "SummaryText": "of the process, (2) safety and health hazards, (3) applicable maintenance procedures, (4) emergency response plans, and (5) applicable safe work practices to help ensure that they can perform their job in a safe manner. Written procedures help ensure that work is performed in a consistent manner and provide a basis for training. Inspections and tests are performed to help ensure that equipment functions as intended, and to verify that equipment is within acceptable limits (e.g., adequate wall thickness for containment systems). If a deficiency is identified, employees will correct the deficiency before placing the equipment back into service (if possible), or an MOC team will review the use of the equipment and determine what actions are necessary to ensure the safe operation of the equipment.\r\nAnother integral part of the mechanical integrity program is quality assurance. The SOUTHFRESH AQUACULTURE LLC facility incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.  \r\nF. Management of Change is a comprehensive system utilized at the SOUTHFRESH AQUACULTURE LLC facility to manage changes to process.  This system requires changes to items such as process equipment, chemicals, technology (including process operating conditions), procedures, and other site changes be properly reviewed and authorized before being implemented. Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change. Affected chemical hazard information, process operating limits, and equipment information, as well as procedures, are updated to incorporate these changes. In addition, operating and maintenance personnel are provided any necessary training on the change. The system ensures that all documentation is updated and"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045502,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\nThe SOUTHFRESH AQUACULTURE LLC catfish processing facility employs 207 people at its Eutaw, Alabama location.  The facility utilizes approximately 13,000 pounds of anhydrous ammonia in its refrigeration process.  The SOUTHFRESH AQUACULURE LLC team is committed to safety and the implementation of safety procedures and programs.  \r\nFACILITY AND THE REGULATED SUBSTANCES HANDLED\r\nSOUTHFRESH AQUACULTURE LLC has implemented a PSM program to provide employee information regarding the risks involved with the storage, handling and processing of anhydrous ammonia, a highly hazardous material. The program emphas the application of management controls and standard operating procedures when addressing the risks associated with handling or working near anhydrous ammonia. SOUTHFRESH AQUACULTURE LLC has also implemented this RMP. \r\nThe SOUTHFRESH AQUACULTURE LLC facility is subject to the NPDES permitting regulation and operates under permit ID: AL0073377.\r\nIn accordance with the 2004 amendment to the RMP regulations, the off-site consequence analyses (OCA) are not included in this executive summary.\r\n\r\nGENERAL ACCIDENTAL RELEASEE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\r\nThe SOUTHFRESH AQUACULTURE LLC facility maintains compliance with the requirements of OSHAs Process Safety Management standard, and EPAs Risk Management Program regulations. The following elements provide layers of protection in the prevention of accidental releases:\r\nA. Process safety information is utilized to maintain safe operation of the process.  These up to date technical documents address chemical properties and associated hazards, limits for key process parameters and specific chemical inventories, and equipment design basis/configuration information. \r\nB. Process hazard analyses are comprehensive studies of the process conducted by personnel with engineering and operating expertise.  These studies ensure hazards associated wi"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045502,
      "SummaryText": "training completed prior to the commissioning of the change and that temporary changes are in effect only for the required period of time. \r\nG. Pre start-up reviews are conducted for any new site or site modification that requires a change in the process safety information. The purpose of the PSSR is to ensure that safety features, procedures, personnel, and the equipment are appropriately prepared for start-up prior to placing the equipment into service. This review provides one additional check to make sure construction is in accordance with the design specifications and that all supporting systems are operationally ready.  A PSSR serves a quality assurance function by requiring verification that accident prevention program requirements are properly implemented.\r\n H. Compliance audits ensure that the accident prevention program is functioning properly at the SOUTHFRESH AQUACULTURE LLC facility. The facility periodically conducts an audit to determine whether the procedures and practices required by the accident prevention program are being implemented. Compliance audits are conducted at least every 3 years. The audit team develops findings that are forwarded to site management for resolution. Corrective actions taken in response to the audit team's findings are tracked until they are complete. The final resolution of each finding is documented, and the two most recent audit reports are retained.\r\n I. Incident investigations are conducted for all incidents that resulted in, or reasonably could have resulted in a catastrophic release of a regulated substance at the SOUTHFRESH AQUACULTURE LLC facility. The goal of each investigation is to determine the facts and develop corrective actions to prevent a recurrence of the incident or a similar incident. The investigation team documents its findings, develops recommendations to prevent a recurrence, and forwards these results to site management for resolution. Corrective actions taken in response to the investigation tea"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000045502,
      "SummaryText": "m's findings and recommendations are tracked until they are complete. The final resolution of each finding or recommendation is documented, and the investigation results are reviewed with all employees (including contractors) who could be affected by the findings. Incident investigation reports are retained for at least 5 years so that the reports can be reviewed during future PHAs and PHA revalidations.  \r\nJ. Employee participation is highly encouraged at the SOUTHFRESH AQUACULTURE LLC facility. Employees participate in all facets of process safety management and accident prevention. Employees have access to all information created as part of the site accident prevention program. Specific ways that employees can be involved in the accident prevention program are documented in an employee participation plan. \r\n K. Contractors are utilized at the SOUTHFRESH AQUACULTURE LLC facility to supplement its work force during periods of increased maintenance or construction activities. Because some contractors work on or near process equipment, the site has procedures in place to ensure that contractors (1) perform their work in a safe manner, (2) have the appropriate knowledge and skills, (3) are aware of the hazards in their work place, (4) understand what they should do in the event of an emergency, (5) understand and follow site safety rules, and (6) inform site personnel of any hazards that they find during their work. This is accomplished by providing contractors with (1) a process overview, (2) information about safety and health hazards, (3) emergency response plan requirements, and (4) safe work practices prior to their beginning work. In addition, the SOUTHFRESH AQUACULTURE LLC evaluates contractor safety programs and performance during the selection of a contractor. Site personnel periodically monitor contractor performance to ensure that contractors are fulfilling their safety obligations. \r\nL. Hot work or spark producing activities are controlled at the SOUTHFRES"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000045502,
      "SummaryText": "H AQUACULTURE LLC facility using a hot work permit program.  Procedures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.  The facility has a hot work permit program to ensure that OSHA's fire protection precautions, specified in 29 CFR 1910.252(a), are in place before hot work (work involving electric or gas welding, cutting, brazing, or similar flame or spark-producing operation) begins on or near a covered process. SOUTHFRESH AQUACULTURE LLC has a procedure that addresses the requirements of 29 CFR 1910.252(a), and there is a Hot Work Permit Form to document job requirements, the dates for the hot work, and the object on which the work is to be performed. Employees are trained on the hot work permit procedure and Hot Work Permit Forms are audited to ensure than any errors in preparation or approval are identified and brought to the attention of those involved to prevent recurrence.\r\nM. Emergency Response is a program in place at the SOUTHFRESH AQUACULTURE LLC to protect worker and public safety as well as the environment. This detailed program includes procedures and plans for handling an emergency.  The response plan details the role of employees and management in an emergency situation.  Ammonia drills have been conducted at the facility and employees have received Ammonia Awareness training.  The public will be notified of ammonia emergencies via the Greene County Emergency Management Association.  The plan outlines specific procedures for evacuations for plant personnel. SOUTHFRESH AQUACULTURE LLC has coordinated its Emergency Response plan with the Demolopis Fire Department and the Greene County Emergency Management Agency.  \r\nTHE FIVE YEAR ACCIDENT HISTORY\r\nThere has been no reportable release as defined by 40 CFR 68.42(a) at the SOUTHFRESH AQUACULTURE LLC facility in the last five years. \r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nThe SOUTHFRESH AQUACULTURE LLC facility will"
    }
  ]
}