{
  "FacilityID": 1000009805,
  "FacilityName": "Bonita Packing Refrigeration Facility",
  "FacilityStr1": "1850 W. Stowell Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Santa Maria",
  "FacilityState": "CA",
  "FacilityZipCode": "93456",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06083",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.937332",
  "FacilityLongDecDegs": "-120.483815",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bonipak.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 29406386,
  "ParentCompanyName": "Bonita Packing Company",
  "Company2Name": "Betteravia Farms",
  "CompanyDUNS": 56436751,
  "Company2DUNS": 0,
  "OperatorName": "Betteravia Farms",
  "OperatorStr1": "POBox 5845",
  "OperatorStr2": null,
  "OperatorCity": "Santa Maria",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93456",
  "OperatorZipCodeExt": "5845",
  "RMPContact": "Joe Leonard",
  "RMPTitle": "CEO",
  "FTE": 27,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000165518",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-03-24 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-07-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-14 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-14 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-14 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.93824,
  "FRS_Long": -120.47918,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000011531,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000009805,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011912,
          "ProcessID": 1000011531,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000013216,
          "ProcessID": 1000011531,
          "ChemicalID": 56,
          "Quantity": 23150.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000513216,
          "ProcessID": 1000011531,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009805,
      "SummaryText": "Bonita Packing Refrigeration Facility in Santa Maria, California is covered by the California Accidental Release Prevention (Cal-ARP) program and the EPA's Risk Management Plan (RMP) regulations. Anhydrous ammonia is used in a refrigeration system with a maximum quantity that exceeds 10,000 pounds.\n\nIt is the policy of Bonita Packing Company (Bonipack) to comply with the regulatory requirements of the RMP and Cal-ARP regulations. Bonipack employees, supervisors and managers are all responsible for complying with the regulations, and they are provided training to help them implement their various responsibilities. \n\nBonipack has developed a process safety and risk management program that documents the policies pertaining to the prevention of accidental releases. In addition, Bonipack has conducted technical studies such as the Process Hazards Analysis and the Offsite Consequence Analysis to identify and evaluate potential hazards associated with the use of anhydrous ammonia. Bonita Refrigeration Facility has an Emergency Response Plan (ERP) which is coordinated with the Santa Barbara County response agencies. \n\nA management system is in place for implementing the RMP and Cal-ARP regulations. This system defines the scope and purpose for each program element, procedures for implementation, roles and responsibilities, and the record-keeping requirements. The person with overall responsibility for implementing the risk management program is the General Manager. Delegated responsibilities are outlined in Bonipack's written programs. \n\nAmmonia from the main receiver vessel flows to the penthouse chillers, vacuum tubes pressure coolers, and icemakers via two recirculator tanks and pumps. Evaporation of the ammonia causes the ice making process and air cooling necessary to keep produce cold during warehousing and shipping. Ammonia vapor from these units is returned to the compressors where it is compressed. Vapor and liquid condensate from the penthouse units and icemakers "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009805,
      "SummaryText": "is returned to the two accumulators and evaporated. The vaporized liquid ammonia from these units is also delivered to the compressors. Compressed ammonia vapor from the compressors is delivered to the condensers where it is cooled to the liquid state by heat transfer from evaporated water and returned to the receiver vessel. A small amount of liquid ammonia is delivered from the evaporative condensers and main receiver vessel to the thermosyphon receiver and distributed to the oil cooler vessels for cooling compressors. Computerized control system minimizes operator/maintenance personnel intervention. The ammonia system is equipped with a wide range of safety features:\n\n- The system is designed to meet industry standards and regulatory requirements.\n- The system components meet industry standard specifications, and they are made of materials compatible with the process chemicals.\n- Emergency refrigeration cutdown switch is located at the refrigeration control panel. The emergency switch\nshuts down the refrigeration system but allows the lighting and ventilation fans to remain active. In the event of\npower failure, all pumps shut down and the system pressure equalizes.\n\n- Ammonia detector sensors are located in each of the penthouses to detect any release of ammonia, and are\nprotected by a battery power back-up for four hours.\n\n- The exhaust ventilation of the Machinery room is accomplished by ventilation fans and prevents ammonia\naccumulation in case of a leak.\n\n- Ammonia may be vented from the high presser receiver vessel and the liquid accumulators to a diffusion/flare\ndevice in case of overpressurization.\n\nThe ammonia refrigeration system is a closed-loop, recirculating process. The system is automatically controlled by an M&M Refrigeration Control System, which minimizes potential for human error. Under normal conditions, the operator's primary role is to monitor process parameters such as pressure and temperature and check for deviations. The operators also ch"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009805,
      "SummaryText": "eck the system periodically to inspect primary system components, record critical process parameters, and note any abnormal conditions (e.g., leaks, excessive equipment vibration, etc.). These formal inspections are documented using log sheets, and they are performed during their daily rounds. \n\nIn developing the Offsite Consequence Analysis (OCA), the approach taken was to follow EPA's RMP Guidance for Ammonia Refrigeration facilities and their RMP OCA Guidance document. These publications were used to evaluate the hazard distances for the worst-case and alternative release scenarios, as well as EPA RMPComp software. \n\nDuring the last five years, there have been no accidents involving ammonia that resulted in any offsite impacts, and there have been no injuries or fatalities onsite.\n\nBonipack has implemented a comprehensive prevention program to minimize the potential for a catastrophic release of ammonia. Process safety information is available to employees, and a Process Hazards Analysis (PHA) has been conducted. External events (including earthquakes) were considered in the PHA. Recommendations made by the PHA team to improve safety are being addressed. Pre-startup safety reviews are conducted prior to startup. A management of change procedure has been implemented. \n\nOperations and Maintenance (O&M) manuals provide written operating instructions for the ammonia refrigeration system, including the control system. Equipment inspections, testing and maintenance activities are performed on a routine basis. Annual training for ammonia is provided to the mechanics who operate the system. \n\nA compliance audit procedure has been developed for the risk management program, and this is used every three years to verify compliance with the Cal-ARP and RMP regulations. The recent OSHA audit and internal audits were well received by public inspection agencies (OSHA). Bonipack investigates any incident or accident that results in the release of a reportable quantity of ammonia."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009805,
      "SummaryText": " Incident investigation procedures include root cause analysis. \n\nBonipack mechanics are trained as first responders under the HAZWOPER standard for emergency response. For an ammonia emergency, the procedures are to shut down the system, notify the response agencies, evacuation routes, and assess the cause of the release, if this can be done safely. Guidance is provided to employees to distinguish between an incidental release and an emergency. The emergency response plan has been coordinated with the local County agencies, and Bonipack will cooperate with these agencies to coordinate any offsite response that may be required in an emergency. Annual emergency response drills are conducted. \n\nIn summary, the design of the refrigeration system at Bonipack Refrigeration Facility, and the implementation of the safety and risk management programs provide a high level of assurance that the risks associated with the use of ammonia are effectively managed.\n"
    }
  ]
}