{
  "FacilityID": 1000095342,
  "FacilityName": "Nelson Road WaterTreatment  Plant",
  "FacilityStr1": "26108 Nelson Road",
  "FacilityStr2": null,
  "FacilityCity": "San Benito",
  "FacilityState": "TX",
  "FacilityZipCode": "78586",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48061",
  "LEPC": "Cameron County LEPC",
  "FacilityLatDecDegs": "26.246408",
  "FacilityLongDecDegs": "-97.565728",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": "www.erhwsc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 96386610,
  "ParentCompanyName": "East Rio Hondo Water Supply Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "East Rio Hondo Water Supply Corp.",
  "OperatorStr1": "P.O Box 621",
  "OperatorStr2": "206 Industrial Parkway",
  "OperatorCity": "Rio Hondo",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78583",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Macmanus",
  "RMPTitle": "General Manager",
  "FTE": 26,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185195",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-01-23 00:00:00",
  "SafetyInspectionBy": "Texas Commission on Environmental Quality",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-09-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-09-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-09-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-09-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000118289,
      "AltID": "Chlorine",
      "FacilityID": 1000095342,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000119622,
          "ProcessID": 1000118289,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000147871,
          "ProcessID": 1000118289,
          "ChemicalID": 62,
          "Quantity": 6300.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000647871,
          "ProcessID": 1000118289,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000095342,
      "SummaryText": "The Risk Management Plan (RMP) update has been prepared relating to the storage, handling and use of chlorine at the East Rio Hondo Water Supply Corporation's (ERHWSC) Nelson Road Water Treatment Facility (\"facility\") located at the intersection of Nelson Rd and Line 20 Rd, approximately four miles to the south-southeast of downtown Rio Hondo in Cameron County, Texas.  The RMP meets the U.S. Environmental Protection Agency (EPA) requirements for Prevention Program Level 3 (40 CFR 68) facilities and the Process Safety Management (PSM) requirements of the Occupational Safety and Health Administration (29 CFR 1910.119). \n\n\n\nThe facility is located in a primarily rural area of Cameron County, Texas.  Properties adjacent to the plant include agricultural lands to the west, east and south.  Surrounding properties are primarily agricultural; however, four (4) residences are located adjacent to and immediately north of the plant, and one residence is located to the east of the plant, beyond Nelson Rd and an irrigation canal.  The approximate coordinates of the chlorine storage area are: \n\n\n\nLatitude:    N 26.179319\n\nLongitude:    W -97.566667\n\n  \n\nThe facility is stationary and maintains an inventory of chlorine that exceeds 2,500 pounds.\n\n\n\nGeneral information includes the following:\n\n\n\nProcess chemical:            Chlorine \n\nCAS number:                7782-50-5\n\nTotal inventory:            6,000 pounds\n\nNAICS code:                22131:   Water Supply and Irrigation Systems\n\nStorage:                Three one-ton containers in a sheltered area (i.e., enclosed space in direct contact with outside air)\n\n\n\nMr. Eric Haydon, Operations Manager and Safety Director, is responsible for the implementation of the Risk Management Plan and the Process Safety Management.\n\n\n\nThe facility's accidental release prevention policy integrates technologies, procedures, and good management practices. Its emergency response policy involves the preparation of a response plan tailored to the facility and to the emergency response services available in the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000095342,
      "SummaryText": "community.  The policy adheres to Environmental Protection Agency (EPA) 40 CFR 68 Prevention Program procedures and Occupational Safety and Health Administration (OSHA) 29 CFR 1910.119 Process Safety Management procedures where applicable, and complies with EPA and OSHA Emergency Response Program regulations.\n\n\n\nRMP regulations for Program Level 3 processes require the performance of a consequence analysis for one worst-case release scenario estimated to create the greatest distance in any direction to a toxic endpoint. The worst-case release scenario selected involved the complete loss of chlorine to the air from the largest container stored on site (2000 pounds). The worst-case chlorine release rate estimated at 200 pounds per minute.  The modeling results indicate that the maximum distance needed for the concentration of chlorine to reach the toxic endpoint (0.0087 ppm), due to a 10-minute release of 2,000 pounds of chlorine, is 2.2 miles. \n\n\n\nClean Air Act regulations require that the alternative release scenario selection is more probable than the worst-case scenario. The scenario selected involves a seal failure or vessel puncture. This could be the result of a mechanical failure, operator error or severe weather conditions such as a hurricane or tornado. This failure results in the release of the entire container's contents over a period of 30 minutes. The modeling results indicate that the maximum distance needed for the concentration of chlorine to reach the toxic endpoint (0.0087 ppm), because of a 40-minute release of 2,000 pounds of chlorine, is 0.3 miles. \n\n\n\nThe facility must prepare a five-year accident history in its RMP to assist in the prevention of future accidents. There have been no reportable accidents at the facility in the last five years.\n\n\n\nThe Accidental Release Prevention Policy involves an approach that integrates technologies, procedures, and management practices in compliance with all applicable EPA Prevention Program Level 3 requireme"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000095342,
      "SummaryText": "nts and OSHA Process Safety Management requirements. Chemical-specific prevention steps include availability of PPE that operators wear during connection/disconnection of chlorine, and staff awareness of the hazardous and toxic properties of chlorine.\n\n\n\nThe facility maintains safety information on its equipment used in the chlorine process. This written information allows the facility and its employees to accurately conduct a process hazard analysis.\n\n\n\nThe facility established a Process Hazard Analysis (PHA) team to identify equipment, operating procedures, and conditions where the potential exists for employee exposure and environmental hazards associated with chlorine handling and storage at the facility.  In addition, the facility has prepared written procedures that provide clear instructions or steps for safely conducting activities associated with the chlorine process. \n\n\n\nThe facility maintains Standard Operating Procedures (SOPs) and the manufacturers' equipment manuals in binders in the plant office. Operating employees, maintenance employees, contractor employees, and regulatory representatives have access to the SOPs and equipment manuals.\n\n\n\nThe facility ensures that each employee presently operating the chlorine process, including each newly assigned employee, has been successfully trained or tested in the operating procedures. The facility maintains employee training documentation files for each employee assigned to operate the chlorine process. The files contain records verifying that the employee has the required knowledge, skills, and abilities to carry out the duties and responsibilities safely as provided in the operating procedures.\n\n\n\nAll employees are responsible for reporting chemical release incidents and near misses to their supervisor. The Safety Director, Mr. Eric Haydon, is responsible for initiating and coordinating investigations, keeping investigation records, and communicating the results of investigations to affected employees and "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000095342,
      "SummaryText": "the corporate office.\n\n\n\nThe facility's Mechanical Integrity Program sets the standards for equipment inspections, testing, system preventative maintenance, maintenance quality assurance, and documentation. The program applies to the covered process and to employees who operate and maintain the process.\n\n\n\nThe facility complies with the Management of Change requirements outlined in 40 CFR 68.75. This rule requires owners or operators to implement written procedures to manage any change in their process.\n\n\n\nThe facility maintains a written emergency response plan that includes specific instructions in the event of a release of chlorine. The plan is in conformance with 40 CFR 68.180 and outlines public notification protocols and emergency health care.\n\n"
    }
  ]
}