{
  "FacilityID": 1000043471,
  "FacilityName": "Hyperion Treatment Plant",
  "FacilityStr1": "12000 Vista Del Mar",
  "FacilityStr2": null,
  "FacilityCity": "Playa Del Rey",
  "FacilityState": "CA",
  "FacilityZipCode": "90293",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.925278",
  "FacilityLongDecDegs": "-118.430556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "AB",
  "FacilityURL": "http://www.lacitysan.org/lasewers/treatment_plants/hyperion/index.htm",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 106520265,
  "ParentCompanyName": "City of Los Angeles",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Los Angeles, Bureau of Sani",
  "OperatorStr1": "12000 Vista Del Mar",
  "OperatorStr2": null,
  "OperatorCity": "Playa Del Rey",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90293",
  "OperatorZipCodeExt": null,
  "RMPContact": "Timeyin Dafeta",
  "RMPTitle": "Plant Manager",
  "FTE": 603,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000149038",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "800214",
  "SafetyInspectionDate": "2009-06-10 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-05-22 00:00:00",
  "DeRegistrationEffectiveDate": "2019-05-15 00:00:00",
  "AnniversaryDate": "2019-06-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.92944,
  "FRS_Long": -118.46555,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Covered process burned onsite as fuel & therefore qualifies for exemption",
  "_processes": [
    {
      "ProcessID": 1000053636,
      "AltID": "Digester Gas",
      "FacilityID": 1000043471,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054407,
          "ProcessID": 1000053636,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065283,
          "ProcessID": 1000053636,
          "ChemicalID": 93,
          "Quantity": 90000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 93,
            "ChemicalName": "Methane",
            "CASNumber": "74-82-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565283,
          "ProcessID": 1000053636,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043471,
      "SummaryText": "Executive Summary (A?68.155)\n\n\n\nIntroduction \n\n\n\nThe Hyperion Treatment Plant treats municipal wastewater from the City of Los Angeles prior to its discharge into Santa Monica Bay.  Digester gas is a byproduct that is generated when the solids extracted from the wastewater are stabilized in a biological treatment process.  Hyperion Treatment Plant sends this gas to the City's Scattergood Steam Generating Plant, immediately south of Hyperion, where it is used to help fuel their power generators.  Storing large quantities of digester gas can be a hazard.  As the agency responsible for operating Hyperion Treatment Plant, the City of Los Angeles' Bureau of Sanitation takes our safety obligations in storing and using digester gas as seriously as we take our responsibility to protect the environment from untreated wastewater.  Our Risk Management Plan for digester gas describes what could happen if there were to be an accident, the steps we take every day to ensure safety, and what actions we would take in the event of an emergency.\n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nThe Hyperion Treatment Plant accidental release prevention program involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices.  All applicable procedures of the State of California and U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\n\n\nThis document complies with the EPA Risk Management Program (RMP) under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68, and the California Accidental Release Prevention (Cal/ARP) Program under California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5.  The Hyperion Treatment Plant has a system that generates, stores, conveys, treats and burns digester"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043471,
      "SummaryText": " gas.  This document summarizes our existing health and safety programs; our internal management response procedures; and ongoing actions that are designed to prevent or minimize impacts of accidental releases of digester gas to the environment.  The Hyperion Treatment Plant has prepared an emergency action plan to handle any potential accidental releases.  To date, we have an excellent record in preventing accidents from occurring.\n\n\n\nGeneral Facility and Regulated Substances Information\n\n\n\nThe Hyperion Treatment Plant, operating since 1925, is located at 12000 Vista del Mar, Playa del Rey, Los Angeles County, California.  The plant, located on a 144-acre property, is adjacent to LAX airport at the intersection of Imperial Highway and Vista Del Mar.  Wastewater from the Los Angeles Bureau of Sanitation service area is treated at the Hyperion Treatment Plant and discharged into an outfall extending five miles into the ocean.   There is an additional one mile long gravity fed outfall used only for emergencies.   The wastewater treatment at Hyperion Treatment Plant includes preliminary treatment, advanced primary treatment, and secondary (biological) treatment before final discharge.  The Hyperion Treatment Plant is capable of handling wastewater flows up to 450 million gallons per day (mgd), and has an average flow of 287 mgd.\n\n\n\nThe facility currently generates and stores digester gas (containing 64 percent methane), a flammable substance regulated under RMP and Cal/ARP.  Digester gas is stored in 20 digesters, a low-pressure gas holder, and can also be found in the digester gas pipelines.  The digester gas process contains approximately 107,000 pounds of digester gas including approximately 43,000 pounds of methane.  (The quantity of methane in Section 1.17c.3 of RMP*Submit is reported as digester gas because digester gas is used for applicability determinations).  This digester gas storage exceeds the state and federal threshold quantities, which makes the digeste"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043471,
      "SummaryText": "r gas system subject to the RMP and Cal/ARP rules.  The digester gas process at the Hyperion Treatment Plant is categorized as a Program 1 process under the Cal/ARP regulation.\n\n\n\nDigester Gas Safety Systems \n\n\n\nFire Protection System\n\n\n\nDigester systems are provided with a separate, automatic wet-pipe fire extinguishing system with overhead sprinklers where needed.  Smoke detectors, heat detectors, and manual pull stations are located throughout the facility and linked to a fire alarm control panel (FACP).  In the event of a fire, the system operates automatically by setting off audible and visual alarms, initiating the pre-action fire water sprinkler system, shutting down the interlocked fans and air conditioning units, and releasing any electromagnetically held doors installed in the area.\n\n\n\nLeak Detection System\n\n\n\nA combustible gas detection system is installed throughout the digester tunnel complex to sense levels of methane gas.  If levels of methane exceed 10 percent LEL, local alarm horns and flashing warning lights will be activated within the area.  Because methane is lighter than air, the sensors are installed near the ceiling of the tunnels.  Methane levels above 10 percent LEL are considered unsafe and require that all personnel evacuate the area immediately.\n\n\n\nPressure Relief Valves\n\n\n\nTwo pressure/vacuum relief valves are provided on the domes of the digesters.  Each pressure/vacuum relief valve assembly in the gas domes is designed to safely vent gas from the digester at three times the monthly gas production rate; thus if one assembly fails, the second one can safely handle all the gas produced in the digester.  The relief valves are set to release gas if the pressure exceeds 5 inches of water column above the normal digester battery gas main pressure or approximately 11 inches of water column.\n\n\n\nPressure Switches\n\n\n\nThe low pressure gas (LPG) line from each digester contains a pressure gauge with local readout, a high pressure switch that close"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043471,
      "SummaryText": "s at high pressures, a low pressure switch that closes at low pressures, and an orifice type differential pressure flow indicator with readout at the battery control panel.\n\n\n\nPipeline\n\n\n\nThe pipeline from the Hyperion Treatment System to the Scattergood Generating Station is equipped with manual shutoff valves that can be closed in the event of a significant pressure decrease in the pipeline.\n\n\n\nFlame Arrestor\n\n\n\nFlame arrestors are located immediately before the pressure relief valves on digesters.  Flame arrestors are baffled metal heat exchangers that prevent flames from entering the digester.  \n\n\n\nFlares\n\n\n\nFlares are used to burn excess digester gas.  Each digester is connected through a common line to a flare that is activated when the gas level in the low pressure gas holder reaches 80 percent capacity or when the gas line to Scattergood exceeds 43 pounds per square inch (psi).\n\n\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\n\n\nA prevention program is not required for Program 1 processes under Cal/ARP regulations.  Chemical-specific prevention steps include staff awareness of the hazardous properties of digester gas and the presence of methane detectors and alarms.\n\n\n\nHyperion Treatment Plant accidental release prevention program is based on the following key elements:\n\n    Commitment to safety by the Bureau of Sanitation facility management and staff\n\n    Comprehensive process safety information that is readily available to staff, emergency responders, and contractors\n\n    Comprehensive corrective and preventive maintenance program\n\n    A process hazard analysis of equipment and procedures with operation and maintenance staff participation and review\n\n    Use of state-of-the-art process and safety equipment\n\n    Use of accurate and effective operating procedures, written with operations and maintenance staff participation\n\n    High level of training of operators and maintenance staff\n\n    Implementation of an incident investigation, "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043471,
      "SummaryText": "inspection, and auditing programs by qualified staff\n\n \n\nFive Year Accident History\n\n\n\nEPA RMP regulations require reporting details of the 5-year accident history of the covered process.  However, such reporting is required only for releases that have caused one of the following:\n\n    Onsite deaths, injuries, or significant property damage\n\n    Known offsite deaths, injuries, property damage, environmental damage, evacuations or sheltering in place\n\n\n\nHyperion has experienced no accidental releases involving digester gas in the categories listed since at least June 1, 1994.\n\n\n\nEmergency Response Program\n\n\n\nHyperion is not a responding facility, and therefore does not have a written Emergency Response Plan.  However, the plant has an Emergency Action Plan covering digester gas.  As a part of the Emergency Action Plan described below, Hyperion employees are trained to take emergency actions by notifying emergency responders when there is a need for a response.\n\n\n\nHyperion Treatment Plant Emergency Action Plan\n\n\n\nThe Emergency Action Plan contains procedures for informing local and public agencies that will respond to an accidental release.  This plan also contains information on emergency health care.  The Emergency Action Plan was most recently updated in September, 2013.  Hyperion employees were most recently trained on its Emergency Action Plan in January, 2014.  The City of Los Angeles Fire Department is the emergency response agency with which the Emergency Action Plan is coordinated.  A training session on the potential response scenarios was presented to the responding station (Fire Station #51) on 5/27/14.  The City of El Segundo Fire Department is notified if the City of Los Angeles Fire Department cannot respond.\n\n\n\nRecent Changes to Improve Safety\n\n\n\nHyperion Treatment Plant has incorporated some additional changes to improve safety since the last submittal of the RMP five years ago.  These changes include: 1) installing a stationary flammable gas detector in th"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000043471,
      "SummaryText": "e upper chamber of the low pressure gas holder to provide warning in the event the seals in the lower chamber fail; 2) updating and improving the lockout tagout and general work permit program; 3) tied in elevator re-call system to fire alarm system to limit elevator use in the event of a fire and 5) enhanced fire alarm system to annunciate in control room and clarify the location and nature of the emergency and 6) Overhauled hydrogen sulfide removal (lowcat) facility and connected it to the distributed control system . \n\n"
    }
  ]
}