{
  "FacilityID": 1000011705,
  "FacilityName": "Iochem Corporation",
  "FacilityStr1": "3.5 Miles Hwy 60 East",
  "FacilityStr2": null,
  "FacilityCity": "Vici",
  "FacilityState": "OK",
  "FacilityZipCode": "73859",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40043",
  "LEPC": "Dewey County LEPC",
  "FacilityLatDecDegs": "36.143611",
  "FacilityLongDecDegs": "-099.242222",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 177012945,
  "ParentCompanyName": "Iochem Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Iochem Corporation",
  "OperatorStr1": "PO Box 550",
  "OperatorStr2": null,
  "OperatorCity": "Vici",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "73859",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bruce Vaverka",
  "RMPTitle": "Plant Manager",
  "FTE": 23,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000167927",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2007-08-08 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-12-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-12-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-12-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-12-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.14444,
  "FRS_Long": -99.24139,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014071,
      "AltID": "Iodine Manufacturing",
      "FacilityID": 1000011705,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000014432,
          "ProcessID": 1000014071,
          "NAICSCode": "325188",
          "_desc": {
            "NAICS_CODE": "325188",
            "NAICS_DESCRIPTION": "All Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000016199,
          "ProcessID": 1000014071,
          "ChemicalID": 62,
          "Quantity": 87098.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000016200,
          "ProcessID": 1000014071,
          "ChemicalID": 49,
          "Quantity": 70400.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000516199,
          "ProcessID": 1000014071,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000516200,
          "ProcessID": 1000014071,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011705,
      "SummaryText": "IOCHEM CORPORATION, VICI, OKLAHOMA\n\nEXECUTIVE SUMMARY\n\n\nNovember 16, 2009\n\nStationary Source and Process\nIochem Corporation produces technical and clinical grade iodine from sodium iodide at a facility located three and one-half (3 A?) miles east of Vici, OK.  Sodium iodide is extracted from brine production wells. Brine flows from the wells to the facility where the iodide enriched brines are oxidized with chlorine thereby converting the iodides to elemental iodine vapor.  Iodine vapor is stripped and reabsorbed into a more concentrated iodide solution with the addition of sulfur dioxide.  This solution is again oxidized to solid elemental iodine that is melted, flaked, and packaged into fiber drums.  \n\nEPA regulated substances in this multi-stage process are toxic chemicals chlorine and sulfur dioxide. These substances are stored in adjacent tanks under pressure in the liquid state. The liquids are vaporized and piped to the processing units. \n\nMaximum inventory is 91,536 pounds of chlorine and 73,790 pounds of sulfur dioxide, which exceeds EPAA?s threshold quantities of 2,500 and 5,000 pounds respectively. \n\nOffsite Hazard Assessment\nIn the event that the regulated substance is released into the atmosphere, EPA requires that the facility provide an offsite hazard assessment and consequence analysis.  This must include analyzing two release scenarios (Worse Case and Alternate Case) to determine the toxic end point.  \n\nToxic end point is based on ERPG-2 concentrations developed by the American Industrial Hygiene Association (AIHA).  The ERPG-2 is a maximum airborne concentration in which is believed that almost all individuals could be exposed for up to one hour without developing serious irreversible health effects or other symptoms that could impair an individualA?s ability to take protective action. AIHA has identified the toxic end point for chlorine and sulfur dioxide as .0087 mg/l and .0078 mg/l respectively.\n\nThe Worst Case scenario is releasing in ten minut"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011705,
      "SummaryText": "es the entire contents of pressurized sulfur dioxide from the storage tank into the partially open building. The partial enclosure is a passive mitigating factor. The toxic end point as modeled by EPAA?s RMP*Comp software is 17 miles.  Modeling does not include the effects of fires, chemical reactions, and other factors.  \n\nThe Alternate Case is more likely to occur than the Worse Case.  An alternate case is required for each toxic chemical.  For chlorine and sulfur dioxide, the scenario is A?A? leak from ruptured tubing or pipe. OperatorA?s response time to stop the leak is estimated at 60 minutes. Release rates are A?8.2 and 3.4 pounds/min respectively. Toxic end points are 0.1 mile radius from each storage tank. \n\nManagement System\nThe owner/operator of the Iochem Corporation facility has assigned overall responsibility for the development, implementation, and integration of the Risk Management Plan program (40 CFR Part 68) to the Plant Manager.  In addition, the names and positions of persons responsible for implementing specific requirements of the program will be documented and lines of authority will be defined through an organizational chart or similar document. \n\nManagement of the program will be accomplished through a coordinated effort incorporating employee participation, continual assessment and review of existing procedures, equipment and process inspections.   Compliance with regulations imposed by the various regulatory agencies associated with the program will act as the guideline for program achievement and improvement.\n\nPrevention of Release\nThe process is designed in compliance with recognized and generally accepted good engineering practices as shown in the Process Safety Information according to the OSHA Process Safety Management (PSM) standard (29CFR 1910.119).  It is Iochem CorporationA?s policy to adhere to all applicable Federal and state rules and regulations.  Safety depends upon the manner in which we handle sulfur dioxide and chlorine, "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011705,
      "SummaryText": "safety devices inherent in the design of this facility, safe handling and operating procedures, and training of our personnel. By emphasizing at Iochem Corporation well-maintained equipment, proper procedures, and well-trained staff, the likelihood of a release will be reduced.  Recommendations for addressing the process hazards that are generated in the PHA, compliance audits, incident investigations, and management of change are used to improve the process safety.  \n\nPSM is a set of procedures that have been established in thirteen management areas and are designed to protect worker health and safety in case of accidental toxic or flammable chemical releases.  Similar to EPAA?s RMP rule, OSHA PSM applies to a range of facilities that have a threshold quantity of a listed substance in a process.  Compliance with PSM will meet the requirements for a RMP Prevention Program 3 as established and defined in 40 CFR Part 68.  Prevention Program 3 is followed to accomplish these goals and will minimize the potential for an unplanned release of the regulated substances into the environment.  \n\nFive Year Accident History\nThere have been no accidental releases in the last five years.\n\nEmergency Action (Response) Program\nIochem Corporation is a non-responding facility to an accidental release of hazardous substances.  The employees will not conduct a full-fledged response to the release.  Instead, they will evacuate and coordinate with the Vici Volunteer Fire Department. Iochem Corporation has prepared an emergency action plan that includes evacuation procedures.  Iochem Corporation has ensured that the Fire Department is prepared to respond to an emergency. The Vici Voluntary Fire Department is suitably trained and drilled in emergency response for the regulated substances, and a number of employees are present or past members of the Vici Voluntary Fire Department. \n\n"
    }
  ]
}