{
  "FacilityID": 1000094826,
  "FacilityName": "Anderson United Terminal",
  "FacilityStr1": "6683 Eastside Rd",
  "FacilityStr2": null,
  "FacilityCity": "Anderson",
  "FacilityState": "CA",
  "FacilityZipCode": "96007",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06089",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "40.480607",
  "FacilityLongDecDegs": "-122.343534",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "https://www.unitedpacificenergy.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "United Pacific Energy",
  "Company2Name": null,
  "CompanyDUNS": 780824652,
  "Company2DUNS": 0,
  "OperatorName": "United Pacific Energy",
  "OperatorStr1": "425 West Plumb Lane",
  "OperatorStr2": null,
  "OperatorCity": "Reno",
  "OperatorStateFIPS": "NV",
  "OperatorZipCode": "89509",
  "OperatorZipCodeExt": null,
  "RMPContact": "Don Williams",
  "RMPTitle": "Terminal Manager",
  "FTE": 1,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000247146",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-02-12 00:00:00",
  "SafetyInspectionBy": "Federal Railroad Administration",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-11-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-11-29 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-11-29 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-11-29 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117698,
      "AltID": "Bulk Propane Storage",
      "FacilityID": 1000094826,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000119031,
          "ProcessID": 1000117698,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000147161,
          "ProcessID": 1000117698,
          "ChemicalID": 98,
          "Quantity": 820000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000647161,
          "ProcessID": 1000117698,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094826,
      "SummaryText": "The Anderson United Terminal Facility is located in Anderson, California. Anderson United Terminal has developed a Risk Management Plan (RMP) to address the California Accidental Release Prevention (CalARP) Program requirements (California Code of Regulations, Title 19, Division 2, Chapter 4.5, Sections 2735-2785). The facility is extremely diligent in the handling of all regulated substances and is dedicated to the safety of its employees and the neighboring community. The facility's staff is trained and utilizes modern equipment to monitor the facility and provide safeguards, while effectively and safely using the flammable substance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nPropane is the regulated substance at Anderson United Terminal and it is received, stored, and distributed from the Anderson United Terminal Facility as a fuel source. This regulated substance is stored in four (4) 30,000 gallon storage tanks and can be stored in three (3) 30,000 gallon storage rail cars at the Anderson United Terminal facility. The maximum intended inventory for the facility is 820,000 lbs. of propane.\n\n\n\nACCIDENTAL RELEASE PREVENTION POLICIES\n\n\n\nAnderson United Terminal has a long standing commitment to worker and public safety. This commitment is demonstrated by the resources invested in accident prevention, such as personnel training and consideration of safety in the design, operation, and maintenance of the Propane Storage and Transfer System. Anderson United Terminal's policy is to implement reasonable controls to prevent foreseeable releases of the regulated flammable substance.\n\n\n\nHAZARD ASSESSMENT SUMMARY/OFFSITE CONSEQUENCE ANALYSIS\n\n\n\nWorst-Case Release Scenario Results Summary Scenario Description: Per the RMP/PSM/CalARP Regulations, one worst-case release scenario has been defined for the facility. All meteorological conditions are consistent with regulatory requirements and were input into RMP*Comp to generate the distance to the endpoint. The distance to"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094826,
      "SummaryText": " endpoint is used to generate a radius of concern for the worst case release, which is then input into MARPLOT, which uses 2010 census data to estimate the population within the vulnerability zone. \n\nAlternative Release Scenarios Results Summary\n\nScenario Description: Per the RMP/PSM/CalARP Regulations, one alternative release scenario has been defined for the facility. The alternative release case considered the most likely cause of release at the facility based on knowledge of industry events and facility operating experience/history. All meteorological conditions are consistent with regulatory requirements and were input into RMP*Comp to generate the distance to the endpoint. The distance to endpoint is used to generate a radius of concern for the alternative case release, which is then input into MARPLOT, which uses 2010 census data to estimate the population within the vulnerability zone.\n\nRisk Considerations\n\nAlthough the storage and transfer of the regulated flammable substance has inherent potential risks, Anderson United Terminal has recognized these potential risks and structured its safety programs to make the worst-case scenario non-credible. In addition to the safety practices of the facility and plant personnel to make the worst-case scenario non-credible, it should also be recognized that there are inherent analysis assumptions that make the results of the atmospheric dispersion analysis appear worse than what would actually be expected during such an event. In addition to the use of conservative analysis assumptions that over-predict the effects of a potential release, other characteristics of the facility and site serve to minimize the potential risks associated with a release. These characteristics are described below:\n\n- Systems are in place to keep the quantity of each regulated substance to a minimum in each covered process. \n\n- There are process valves to permit isolation of any leaks in place. \n\n- The system undergoes scheduled maintenance to "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094826,
      "SummaryText": "reduce the likelihood of catastrophic failures. \n\n- Personal Protective Equipment (PPE) is used by facility personnel, as necessary. \n\n- A well designed relief system.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\n\n\nAs part of the implementation of this RMP/PSM/CalARP Program, key Prevention Program elements were documented and implemented by Anderson United Terminal to manage process safety issues associated with the use of the flammable substance, propane. In addition, common industry standards, policies, and procedures are currently utilized to ensure safe practices are being followed.\n\nThe Prevention Program 3 elements applied to the propane process include:\n\n- Process Safety Information (PSI)\n\n- Process Hazard Analysis (PHA)\n\n- Operating Procedures (OP)\n\n- Training (TRN)\n\n- Mechanical Integrity (MI)\n\n- Management of Change (MOC)\n\n- Pre-Startup Review (PSSR)\n\n- Compliance Audits (CA)\n\n- Incident Investigation (II)\n\n- Employee Participation (EP)\n\n- Hot Work Permit (HWP)\n\n- Contractors (CON)\n\n- Emergency Planning & Response (EP&R)\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere have not been any reportable accidents in the past 5 years. If a release were to occur, the\n\nAnderson Fire Department and Shasta County Sheriff's Office Dispatch would be\n\ncontacted for support and would respond to mitigate the release.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nAnderson United Terminal has implemented an Emergency Action Plan and does not assume the role of first responder during an emergency. Anderson United Terminal has filed a Consolidated Emergency Response/Contingency Plan via the California Environmental Reporting System (CERS) and this plan includes:\n\n- Internal Response\n\n- Emergency Communications, Phone Numbers and Notifications\n\n- Emergency Containment and Cleanup Procedures\n\n- Facility Evacuation Procedures\n\n- Arrangements for Emergency Services\n\n- Emergency Equipment\n\n- Safety and Health Considerations\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nSeveral studies have been conducted to exa"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094826,
      "SummaryText": "mine mitigation measures to improve safety at the facility. These studies include both the Process Hazard Analysis and the Hazard Assessment, both\n\ncompleted in 2021. Any outstanding recommendations from these studies will be completed in a timely manner. These technical documents can be located in the RMP/PSM/CalARP Compliance Workbook.\n\n\n\nEXTERNAL EVENTS ASSESSMENT\n\n\n\nPursuant to the requirements of California Code of Regulations, Title 19, Division 2, Chapter 4.5, Section 2745.7(q), general events external to the plant that can conceivably cause a release were addressed by the 2021 Process Hazard Analysis. This technical document can be located in the RMP/PSM/CalARP Compliance Workbook.\n\n\n\nSEISMIC ASSESSMENTS\n\n\n\nA seismic assessment is scheduled to be performed to ensure the appropriate seismic restraints were provided as per the design drawings and calculations. The subsequent seismic assessment will be updated within the 5-year timeframe. The seismic assessment reports are to be maintained in the RMP/PSM/CalARP Compliance Workbook.\n\n"
    }
  ]
}