{
  "FacilityID": 1000042754,
  "FacilityName": "Tempur Production USA, Inc. Albuquerque",
  "FacilityStr1": "12907 Tempurpedic Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Albuquerque",
  "FacilityState": "NM",
  "FacilityZipCode": "87121",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35001",
  "LEPC": "Bernalillo LEPC",
  "FacilityLatDecDegs": "35.041200",
  "FacilityLongDecDegs": "-106.473500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 57416963,
  "ParentCompanyName": "Tempur-Pedic International",
  "Company2Name": null,
  "CompanyDUNS": 57416963,
  "Company2DUNS": 0,
  "OperatorName": "Tempur Production USA, Inc",
  "OperatorStr1": "12907 Tempurpedic Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Albuquerque",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "87121",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Cododdington",
  "RMPTitle": "Facilities Manager",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000194782",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.6",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000052747,
      "AltID": "manfacture foam",
      "FacilityID": 1000042754,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000053455,
          "ProcessID": 1000052747,
          "NAICSCode": "33791",
          "_desc": {
            "NAICS_CODE": "33791",
            "NAICS_DESCRIPTION": "Mattress Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064020,
          "ProcessID": 1000052747,
          "ChemicalID": 77,
          "Quantity": 1189188.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000564020,
          "ProcessID": 1000052747,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000042754,
      "SummaryText": "Tempur Production USA, Inc. Albuquerque, NM Plant\n\n\n\nEXECUTIVE SUMMARY\n\n\n\nAccidental release prevention and emergency response policies:\n\n\n\nAt the Tempur Production Albuquerque, New Mexico Plant, we handle toluene diisocyanate (TDI), which is considered hazardous and regulated by the EPA.  The same properties that make TDI valuable for use at our facility also make it necessary to observe certain safety precautions in the handling of the substance.  Safety precautions have been implemented to prevent unnecessary human exposure, to reduce the threat to our own personal health as well as our co-workers, and to reduce the threat to nearby members of our community.  \n\n\n\nWe are committed to the safety of our employees and the public, and to the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Successful implementation of our accidental prevention program will help ensure that a release of TDI to the environment is unlikely.  \n\n\n\nDescription of the facility and the regulated substances handled:\n\n\n\nThe primary purpose of this facility is to manufacture flexible polyurethane foam and fabricate foam mattresses for retail distribution.  TDI is one of the reactants required to produce polyurethane foam.  TDI is received by tank truck and is stored in 18 indoor storage tanks that are surrounded with a secondary containment wall.  The maximum quantity of TDI stored is 1,189,188 lbs.  The TDI is piped to metering units where it is mixed with other reactants to produce slabstock polyurethane foam.\n\nTDI is the only substance handled at our plant that is regulated by EPA's risk management program (RMP) rule.  TDI is covered because the maximum quantity stored on-site exceeds EPA's threshold quantity (TQ) of 10,000 pounds.\n\n\n\nThe general accidental release prevention program and specific prevention steps:\n\n\n\nThe plant has implemented programs and procedures that comply with EPA's Level 1 Accidental Release Prevention Program Rul"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000042754,
      "SummaryText": "e.  Our facility qualifies for Level 1 coverage because (1) our worst case release scenarios for TDI does not impact persons across the property boundary or the nearest public receptor, (2) TDI is not a substance covered by OSHA's process safety management standard (PSM), (3) The plant has had no release or accidents within the last five years  related to a regulated substance, and (4) Tempur Production Albuquerque has coordinated it's emergency response activities with the local responders.\n\n\n\nThe TDI process at our plant has hazards that are carefully managed to ensure continued safe operation.  Our plant has safety features on many units to help (1) contain or control a release, (2) quickly detect a release, and (3) reduce the consequences of or mitigate a release.  The following types of safety features are used in various units of the TDI process:\n\nRelease detection:\n\n-Process Alarms\n\n-TDI Sensors\n\n-Operator Surveillance Activities\n\n\n\nRelease Containment/Control:\n\n-Secondary containment to contain TDI liquid releases\n\n-TDI storage tanks located inside an enclosed building\n\n-Automated shutdown systems for critical process parameters (e.g. high level, high pressure)\n\n-Pressure/vacuum relief devices on vessels to prevent rupture or collapse\n\n-Remote shutdown of unloading and transfer pumps\n\n-Valves to permit isolation of the process\n\n-Vapor from storage tank is piped to the unloading vessel\n\n\n\nRelease Mitigation:\n\n-Fire suppression and extinguishing systems\n\n-Trained emergency response personnel\n\n-Personal protective equipment (e.g., protective clothing, self-contained breathing apparatus, breathing air stations)\n\n\n\nTen-year accident history:\n\nThe facility was constructed in 2006 and has not had a release of a regulated substance since it opened.\n\n\n\nEmergency Response Program:\n\n\n\nOur emergency response program is based on the requirements in OSHA's emergency action and fire prevention plan regulation, OSHA's hazardous waste and emergency operations regulation (Haz"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000042754,
      "SummaryText": "woper), and EPA's emergency response program requirements in its RMP rule.  \n\n\n\nOur program consists of procedures for responding to a release of TDI.  The procedures address all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after and evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements.  In addition, the plant has procedures that address maintenance, inspection and testing of emergency response equipment.  Employees receive training in these procedures as necessary to perform their specific emergency response duties.  \n\n\n\nThe emergency response program is updated when necessary, based on modifications made to the plant processes.  Personnel affected by changes in the program are informed and trained on those changes.\n\n\n\nThe overall emergency response program for the plant is coordinated with the Local Emergency Planning Committee (LEPC).  The plant has around-the-clock communication capability with the appropriate LEPC officials and emergency response organizations such as the Bernalillo County Fire Department and the City of Albuquerque Fire Department.  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response."
    }
  ]
}