{
  "FacilityID": 1000014439,
  "FacilityName": "Poquonock Water Pollution Control Facility",
  "FacilityStr1": "1222 Poquonock Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Windsor",
  "FacilityState": "CT",
  "FacilityZipCode": "06095",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09003",
  "LEPC": "CREPC",
  "FacilityLatDecDegs": "41.890556",
  "FacilityLongDecDegs": "-72.669722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.themdc.com",
  "FacilityEmailAddress": "snyren@themdc.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "The Metropolitan District",
  "Company2Name": null,
  "CompanyDUNS": 49182751,
  "Company2DUNS": 0,
  "OperatorName": "The Metropolitan District",
  "OperatorStr1": "555 Main Street",
  "OperatorStr2": "P.O. Box 0800",
  "OperatorCity": "Hartford",
  "OperatorStateFIPS": "CT",
  "OperatorZipCode": "06142",
  "OperatorZipCodeExt": "0800",
  "RMPContact": "Richard Ludwig",
  "RMPTitle": "Manager of Water Pollution Control",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000211781",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-03-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-23 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2011-10-24 00:00:00",
  "DeRegistrationEffectiveDate": "2011-05-01 00:00:00",
  "AnniversaryDate": "2015-06-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018077,
      "AltID": "Chlorination",
      "FacilityID": 1000014439,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018401,
          "ProcessID": 1000018077,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021408,
          "ProcessID": 1000018077,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521408,
          "ProcessID": 1000018077,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014439,
      "SummaryText": "Poquonock Water Pollution Control Facility\nExecutive Summary\n\nIntroduction\n\nThe Metropolitan DistrictA?s (MDC) Poquonock Water Pollution Control Facility (PWPCF), operating since 1962, is located at 1222 Poquonock Avenue in Windsor, CT.  Wastewater from Windsor and several surrounding communities is treated at the PWPCF, and final effluent is discharged into the Farmington River.  The wastewater treatment process includes preliminary screening, primary settling and treatment, secondary treatment and clarification, and anaerobic digestion of process sludge.  Chlorination and de-chlorination of the final effluent is done prior to discharge.  Facility improvements in 1979 and 1990 increased the design capacity to the current 5,000,000 gallons per day.\n\nThe PWPCF uses chlorine to disinfect treated wastewater prior to discharge to the Farmington River.  The PWPCF takes safety obligations in handling chemicals seriously.  MDC has used chlorine at the PWPCF for over 30 years without a reportable release.  MDC employees receive extensive on-going chlorine safety training annually.\n\nThis document summarizes the safety systems, policies, procedures, and on-going actions that are designed to prevent or minimize impacts of accidental releases of chlorine to the environment.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe PWPCF Risk Management Plan (RMP) complies with the U.S. Environmental Protection AgencyA?s (EPAA?s) Risk Management Program, under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68.  The Risk Management Program requires facilities that use certain substances to develop a plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment.\n\nThe PWPCF has a chlorination system that uses chlorine gas fed from chlorine one-ton containers.  Due to concerns about not being able to receive time"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014439,
      "SummaryText": "ly chlorine shipments, chlorine will now be stored in a quantity above the regulatory threshold (2,500 lbs.) at which an RMP is required.  The PWPCF has prepared a detailed and comprehensive Emergency Action Plan to handle any potential releases.  The Emergency Action Plan, along with the RMP program, describes what actions to take in the event of a release and how to prevent any releases from occurring.\n\nMDC is committed to protecting its employees, the public, and the environment from any release of hazardous materials used at its facilities.  Throughout its history, MDC has had an excellent record in accident prevention.\n\nChlorine\n\nChlorine is used to disinfect the treated wastewater prior to discharging it to the Farmington River.  The PWPCF effluent discharge permit, administered by Connecticut Department of Environmental Protection, requires the plant to chlorinate the wastewater effluent from May 1st through September 30th.  Other than the few weeks prior to, during and the few weeks after chlorine season, no chlorine is on-site.  The objective of chlorinating the wastewater is to destroy pathogenic microorganisms contained in the wastewater.  Wastewater disinfection prevents the spread of diseases and protects surface waters used for recreation and as a habitat for aquatic life.\n\nChlorine is non-explosive and non-flammable, but, like other chemicals, it is capable of combustion under certain circumstances.  It is also a respiratory irritant.  Exposure through inhalation or eye or skin contact can cause severe health problems.  The PWPCF has several safety systems that are a part of the chlorine system.  These safety systems, along with the Prevention Program described below, greatly reduce the possibility of a leak occurring.\n\nA chemical distributor delivers chlorine containers to the facility.  Chlorine is withdrawn from the one-ton containers and delivered to the chlorination process.  Chlorine leak detectors continuously monitor for leaks.  An audible ala"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014439,
      "SummaryText": "rm is activated throughout the facility and an alarm light in the monitoring room on the control panel.  Other examples of safety systems include high and low vacuum alarms.  The chlorine gas feed piping is under a vacuum.  If a leak were to occur in this piping, outside air would be drawn in to the piping rather than chlorine gas leaking out of the piping.\n\nThe chlorine containers are located inside the locked chlorine building.  MDC owns and keeps the following equipment on-site: self-contained breathing apparatuses (SCBA), response suits and a ton container repair kit.  All four employees who work at this facility are trained in proper operation of the chlorine system.  They also receive extensive initial and annual safety training.  Drills are held annually, with the operators wearing SCBA and response suits.   The training for chlorine emergency response is in compliance with 29 CFR 1910.120 (q).  A complete preventative maintenance program is administered on all chlorine piping and equipment.\n\nRMP Requirements\n\nThe RMP consists of three major parts.  The first part is the Hazard Assessment.  The Hazard Assessment is performed to determine the effects that a release of a regulated substance could have on the public.  The second part is a Prevention Program that consists of 12 elements designed to improve the system safety and decrease the likelihood of a release.  The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur.  Because the regulations are very similar, the Prevention Program and the Emergency Response Program also serve as the OSHA Process Safety Management (PSM) plan.  This document is therefore referred to as the RMP/PSM plan.\n\nHazard Assessment\n\nA Hazard Assessment was performed to determine the effects a release could have on the public.  For chlorine, the distance chlorine could travel to a set endpoint concentration was determined.  In addition, an estimate of "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014439,
      "SummaryText": "the population that could be affected by the release of chlorine was determined, and sensitive receptors such as hospitals, parks, and schools were identified.  The Hazard Assessment considers two release scenarios A? a A?worst caseA? and an A?alternative case.A?\n\nWorst Case Scenario\n\nThe regulations require the development of a worst-case scenario based on conservative assumptions.  For example, it is required to assume that the entire contents of the largest single container of chlorine will be released over ten minutes.  This is unlikely to occur since the properties of chlorine would cause a freeze and thaw cycle to occur at the leak, which would slow the release.  In many scenarios, mitigating the release by isolating the process could significantly reduce the amount released.  The worst-case scenario requires that conservative atmospheric conditions be assumed which results in a large area of impact.  These conservative assumptions were set by EPA to ensure public notification and local emergency response planning takes into account the greatest possible impacted area surrounding the release point.\n\nThe worst-case scenario used for chlorine at the PWPCF is the rupture of a one-ton container, resulting in a release of 2,000 pounds of chemical over a ten-minute duration.  The container rupture resulting in a chlorine release could be caused by catastrophic events, such as a tornado.  This type of a catastrophic release is unlikely to occur.  The released liquid is assumed to quickly volatize and to disperse as a vapor cloud.  The hazard assessment requires a determination of the A?toxic endpointA?, or distance from the point of release to a location at which the chemical concentration equals a certain concentration.  The distance to the toxic endpoint was estimated using the EPA-approved RMP-Comp version 1.07 software.\n\nThe RMP regulations define the toxic endpoint of a release of chlorine as the farthest distance at which a receptor would experience a chlorine "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000014439,
      "SummaryText": "concentration of 3 parts per million (ppm).  The concentration at the circle surrounding the plant defines the boundary of the area that would be impacted by a release, and the concentration at the circle is 3 ppm.  If a leak were actually to occur, the vapor cloud would only travel in the direction of the prevailing wind, not in all directions around the facility.  The 3 ppm endpoint concentration is the Emergency Response Planning Guideline Level 2 (ERPG-2) concentration defined as the maximum concentration at which most individuals could be exposed for up to one hour without experiencing irreversible or serous health effects.  Because the cloud from a leak of chlorine would disperse relatively quickly, an individual located at the toxic endpoint would be exposed to a chlorine concentration for much less than one hour.\n\nAlternative Scenario\n\nThe RMP rule also requires that at least one alternative release scenario be evaluated for chlorine.  The alternative scenarios reflect a type of release that is more likely to occur compared to the worst-case scenario.  Unlike the worst-case scenario, the alternative release scenario may consider A?activeA? mitigation such as shutoff valves and a more realistic release quantity and release rate.  Active mitigation is defined as requiring mechanical, electrical or human input.  It assumes local, typical meteorology, which is more realistic than the conservative meteorological conditions that must be assumed for the worst-case scenario.  The alternative release scenario for chlorine modeled, using the EPA approved RMP-Comp model, is a release through a 5/16-inch diameter vapor valve in the top of a horizontal tank and considered passive mitigation of an enclosure or building.  Under this scenario, the amount of chlorine released was calculated to be 2000 pounds.  For the alternative release scenario, the same modeling approach was used as for the worst-case scenario, except meteorological conditions were adjusted to represent m"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000014439,
      "SummaryText": "ore realistic conditions.  The results of the dispersion modeling analysis for the alternative release scenario indicate a small offsite impact.\n\nPrevention Program\n\nThe Prevention Program together with the Emergency Response Program make up the RMP/PSM.  The Prevention Program consists of 12 elements designed to improve system safety and decrease the likelihood of a release.  The elements are as follows.\n\nEmployee Participation\n\nThe participation of the PWPCF staff in preparing the RMP/PSM program was critical to the programA?s successful implementation.  Employee participation is valuable because it increases the safety awareness of the staff and it allows the staffA?s experience in operating and maintaining the processes to be incorporated into the plan.  PWPCF staff participated in the development of the Prevention Program through a series of meetings and workshops as well as the Process Hazard Analysis.  PWPCF staff received RMP/PSM awareness training that instructed staff on how the RMP/PSM requirements may impact their jobs.  Staff who operate and maintain the chlorination system were trained in how to safely maintain and operate the processes.\n\nProcess Safety Information\n\nThe RMP regulations require that information concerning process chemicals, technology and equipment be compiled as part of a RMP program.  Emergency response planners can use such information to develop training programs and procedures, or as a general resource.  The information is supplied to contractors who will work in the chlorine process areas as part of the requirement outlined in the Contractor Safety element.  All the required process safety information was compiled as required by the RMP regulations.  The information meets or exceeds the minimum required by the regulations.\n\nProcess Hazard Analysis\n\nA Process Hazard Analysis (PHA) was conducted systemically to evaluate potential causes and consequences of accidental releases.  This information was used by PWPCF staff to improve saf"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000014439,
      "SummaryText": "ety and reduce the consequences of accidental releases.  Equipment, instrumentation, utilities, human actions, and external factors that might affect the process were included in the PHA that was performed for the chlorine process.  The chlorine PHA was conducted by an interdisciplinary team of PWPCF staff familiar with the process, operation and maintenance and plant management.  The PHA was done using the A?What-IfA? and A?ChecklistA? methods.  Based on the results of the original PHA, several minor changes in the operating, maintenance and other process safety management procedures that would improve the overall safety of the PWPCF were identified and addressed. A complete review of the PHA was completed in 2009.\n\nOperating Procedures\n\nWritten operating procedures for the chlorination process have been developed as part of the RMP/PSM.  Written operating procedures assure continuous, efficient and safe operation of the facility.  The goal of the operating procedures is to provide clear instruction to safely operate the process.  Operating procedures are also used to train new employees and to provide refresher training for existing staff.  The detailed operating procedures include startup, shutdown and emergency operating procedures.  The procedures describe how the system should be operated in order to minimize the chances of an accidental release.  The procedures emphasize safety considerations during operating and address hazardous situations that can occur and how to correct them.\n\nTraining\n\nAn effective RMP/PSM training program can significantly reduce the number and severity of accidental release incidences.  Training emphasizes safety and health hazards and safe work practices.  Annually, all PWPCF staff receives training on: the hazards of chlorine, the operation and maintenance of the regulated process, an overview of each of the RMP/PSM plan elements, emergency planning, emergency response procedures, responding to an accidental release, air monitoring "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000014439,
      "SummaryText": "equipment and a review of the personal protective equipment.\n\nContractors\n\nThe PWPCF must make contractors aware of the known hazards of the chlorine process related to the contractorsA? work.  In addition, the PWPCF must make contractors aware of the applicable elements of its emergency response plan.  All contractorsA? employees working on or around the PWPCF chlorination facilities must successfully complete contractor training prior to the start of work.  The PWPCF screens contractors for those who can perform work on or adjacent to the chlorine process without compromising the safety and health of their staff, the employees who work at the facility, and the community.\n\nPre-startup Review\n\nA pre-startup safety review shall be conducted for any new covered process or for significant modifications to the existing chlorine process that necessitate a change in the process safety information.  No new of or significantly modified process will start up and no acutely hazardous chemicals will be introduced into such a process prior to the pre-startup safety review.  The purpose of the pre-startup safety review is to ensure that the facility is ready to operate new and modified regulated processes safely.\n\nMechanical Integrity\n\nThe PWPCF maintenance staff uses a Critical Equipment List and a Maintenance, Inspection and Testing schedule to store equipment information, generate and prioritize work orders, schedule preventative maintenance (PM), provide safety procedures for work orders, and maintain an inventory of parts and materials.  The Plant Supervisor maintains records of all critical equipment maintenance activities and maintenance schedules, including inspection and testing.  The PWPCF Maintenance, Inspection and Testing schedule is referenced to generate work orders for preventative maintenance.  In addition to preventative maintenance, the PWPCF staff performs corrective maintenance in the event of equipment malfunction or breakdown.  The PWPCF mechanical integri"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000014439,
      "SummaryText": "ty program indicates that safety precautions must be followed, including lockout/tag out when applicable.  The staff that carry out maintenance are all trained as part of the RMP/PSM program.\n\nHot Work Permits\n\nRMP/PSM regulations require employees and contractors to employ safe work practices when performing A?hot workA? in, on, or around the chlorine process.  To ensure that hot work is done safely, the Hot Work Permit Program requires a permit to be issued before hot work is performed.  Hot work is defined as the use of oxyacetylene torches, welding equipment, grinders, cutting, brazing, or similar flame or spark-producing operations.  The process of completing the Hot Work Permit makes it necessary to identify the hazard, recognize what safeguards are appropriate, and then initiate the safeguards necessary to ensure a fire-safe workplace.\n\nManagement of Change\n\nIf a modification covered under RMP/PSM is made, its effects must be evaluated and addressed, employees must be informed, and the written procedures must be updated.  The intent is to require that all modifications to equipment, procedures, and processing conditions other than A?replacement in kindA? be managed by identifying and reviewing them before implementation.  All chlorine operators and maintenance personnel are responsible for understanding what a change is, and will not make a change without implementing a Management of Change procedure and completing a Management of Change Form.  The Maintenance Supervisor or Plant Supervisor will evaluate any modifications that are covered under RMP/PSM.  The Management of Change Form must be completed and submitted in order for the Maintenance Supervisor or Plant Supervisor to review and authorize prior to initiation of a covered change.\n\nIncident Investigation\n\nEach incident that resulted in or could reasonably have resulted in a release of chlorine must be investigated.  A process to identify the underlying causes of incidents and to implement procedures fo"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000014439,
      "SummaryText": "r preventing similar events has been developed.  To investigate an incident, an investigation team will be established.  As part of the investigation, an incident report will be prepared to recommend system changes.\n\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and was the leak due to a faulty container or valve from the chlorine supplier.  As part of the incident review, staff actions that may have contributed to the incident will also be reviewed.  A determination will be made as to whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future.  On the incident report form, the Plant Supervisor (or, in his/her absence, the Senior Crew Leader) identifies which of the recommended system changes are approved for implementation.  The incident investigation report, completed by the Plant Supervisor or designee, and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system.\n\nCompliance Audit\n\nCompliance audits are performed according to the requirements of 40 CFR 68.79 (EPA Chemical Accident Prevention Provisions, Subpart D) and 29 CFR 1910.119(o) (OSHA PSM), which require that an audit be performed at least every three (3) years to verify that procedures and practices developed under the Prevention Program are adequate and are being followed.  The compliance audit involves internal evaluation and verification of the effectiveness of PWPCFA?s current PSM/RMP program.  Items requiring improvement and recommended corrective actions are identified.  A checklist used to conduct the audit was based on the EPA Chemical and Emergency Preparedness and Prevention Office (CEPPO) A?Guidance for Auditing Risk Management Plans/Programs under Clean Air Act Section 112(r)A? (EPA 550-B99-008, August 1999).  The audit checklist details requirements of each RMP/PSM element and contains questions that assi"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000014439,
      "SummaryText": "st with the auditing process.  \n\nA team that has a minimum of three members including: (1) the Plant Supervisor, (2) Crew Leader or other person knowledgeable in the covered processes, and (3) the Occupational Health & Safety Analyst or designee to serve as the audit leader knowledgeable in RMP/PSM requirements and audit techniques.  Consultants may also be hired to assist with audits.  The audit team will promptly determine an appropriate corrective action for each deficiency identified during an audit.  The audit team will prepare an audit report documenting all findings and the corrective actions and the dates by which they must be addressed.\n\nEmergency Response Program\n\nThe OSHA PSM PSM regulation, 29 CFR 1910.119(n), and the EPA RMP regulation, 40 CFR 68 Subpart E, require that an accidental release Emergency Response Plan be prepared.  The plan must be prepared in accordance with the provisions of another overlapping OSHA regulation Emergency Action Plans (29 CFR 1910.38(a)).  In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120(q) must be considered.  MDCA?s Emergency Action Plan described in this section complies with the requirement of 29 CFR 1910.119(n), 40 CFR 68.95, 29 CFR 1910.38(a), and 29 CFR 1910.120 (q).\n\nThe Metropolitan District A?Emergency Action Plan for Water Pollution Control FacilitiesA? (EAP) provides specific emergency response procedures for chlorine emergencies and potential release situations at the PWPCF.  These emergency response procedures cover a release from the initial alarm stage through either leak stoppage or HAZMAT assistance.  As part of the emergency response procedures, there are plans for leak investigation, leak mitigation, and communication with additional support agencies.  In addition, critical plan operations are identified to insure that, if possible, these critical functions are kept operational.  The EAP also indicates the level of training needed to carry out the emer"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000014439,
      "SummaryText": "gency response procedures.  Only personnel trained at the Responder Level can attempt to stop a leak.\n"
    }
  ]
}