{
  "FacilityID": 1000081835,
  "FacilityName": "Kansas City Foam",
  "FacilityStr1": "555 NW Platte Valley Dr",
  "FacilityStr2": null,
  "FacilityCity": "Riverside",
  "FacilityState": "MO",
  "FacilityZipCode": "64150",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29165",
  "LEPC": "Mid-America LEPC",
  "FacilityLatDecDegs": "39.170791",
  "FacilityLongDecDegs": "-094.631290",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "LC",
  "FacilityURL": "www.woodbridgegroup.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 173702150,
  "ParentCompanyName": "Woodbridge Corporation",
  "Company2Name": null,
  "CompanyDUNS": 161659883,
  "Company2DUNS": 161659883,
  "OperatorName": "Woodbridge Corporation",
  "OperatorStr1": "555 NW Platte Valley Dr",
  "OperatorStr2": null,
  "OperatorCity": "Riverside",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64150",
  "OperatorZipCodeExt": null,
  "FTE": 164,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063511",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "OP2016-017",
  "SafetyInspectionDate": "2018-03-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-08-22 14:16:36",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-08-22 14:16:36",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-08-22 14:16:36",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-08-22 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.17147,
  "FRS_Long": -94.63123,
  "FRS_Description": null,
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000102255,
      "AltID": "Molded Foam Operation",
      "FacilityID": 1000081835,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000128152,
          "ProcessID": 1000102255,
          "ChemicalID": 77,
          "Quantity": 430000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000103557,
          "ProcessID": 1000102255,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000063494,
              "Process_NAICS_ID": 1000103557,
              "SafetyReviewDate": "2019-08-19 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2019-07-02 00:00:00",
              "ChangeCompletionDate": "2019-09-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Storage area monitored",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2019-08-14 00:00:00",
              "TrainingReviewDate": "2019-08-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Hazwoper",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-08-13 00:00:00",
              "EquipmentInspectionDate": "2019-01-28 00:00:00",
              "EquipmentTested": "TDI Tank High Level Alarm Tested 28 Jan 2019, TDI Monitors are checked daily.  The preventative maintenance program has the specific schedules for each piece of equipment.",
              "ComplianceAuditDate": "2019-08-15 00:00:00",
              "AuditCompletionDate": "2019-09-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000064282,
                  "PreventionProgram2ID": 1000063494,
                  "ProcessChemicalID": 1000128152
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000081835,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-08-08 00:00:00",
    "ERTrainingDate": "2019-05-22 00:00:00",
    "CoordinatingAgencyName": "Riverside Fire Department",
    "CoordinatingAgencyPhone": "8163729024",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081835,
      "SummaryText": "emicals immediately prior to pouring the mixture into a mold that is attached by carrier to a continuously moving line.  The mold moves through a curing oven.  Upon exiting the oven, the foam pads are removed from the mold, crushed, trimmed and prepared for shipment to customers.  Toluene Diisocyanate (TDI), which is regulated by EPA's risk management program rule, is one of the reactants required to manufacture polyurethane foam.  TDI is received at the plant by rail car and tanker truck.  It is stored in two bulk tanks located in the contained bulk storage tank farm.  The TDI is then transferred to the process by an automated system.  Access to the tank farm is restricted to authorized employees, management personnel, and contractors.  All personnel must use the buddy system when entering the tank farm area.  The maximum amount of TDI that can be stored at the facility is approximately 430,000 lbs.\r\n\r\nC.)  Off-site consequence analysis scenarios\r\n\r\nEPA's RMP rule requires that we provide information about the worst-case release and alternative release scenarios for our facility.  The following are brief summaries of these scenarios, including information about the key administrative controls and mitigation measures to limit the exposure distances for each scenario.\r\n\r\nThe methodology used to determine the distance to the toxic endpoint was the EPA*Comp program recommended by the EPA.  Atmospheric conditions were obtained from the NCDC for the Kansas City International airport located approximately 15 miles north west of our facility.  Parameters used for the model were 100 degrees Fahrenheit air temperature, 54% relative humidity, 1.5 m/s winds from the north east, and class B stability.\r\n\r\nWorst-case Release Scenario\r\nCatastrophic failure of a rail car full of TDI at the rail siding, discharging its entire contents of 190,000 pounds in 10 minutes, as is stipulated in the RMP rule.  It is assumed that the maximum temperature the TDI could reach during an unload is"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081835,
      "SummaryText": "WoodBridge Corporation\r\nKansas City Foam\r\n\r\nA.)  Accidental release prevention and emergency response policies at the stationary source\r\n\r\nThe Kansas City Foam plant, as part of the Woodbridge Group of companies, believes the health and safety of its employees and the protection of the natural environment, should be of the utmost concern in the operation of its business.  We are committed to operating and maintaining all of our processes in a safe and responsible manner.\r\n\r\nIt is our policy to:\r\n     -  Comply with all applicable laws, regulations, and standards.\r\n     -  Review and assess our operations for the purpose of making health, safety and environmental   \r\n        improvements\r\n\r\nOur complete Health Safety and Environmental policy statement, signed by our plant manager, is posted in the lobby of our facility.\r\n\r\nWe use a combination of prevention programs and emergency response planning, which are described later in the document, to help ensure the safety of our employees and the public as well as protection of the environment.  Our plant manager has the overall responsibility for ensuring that our facility operates in a safe and reliable manner.  This responsibility includes overseeing the implementation of the elements of our risk management program.  To ensure that our risk management program is appropriately developed and implemented, our plant manager has assigned the role of RMP coordinator to the process manager who has the background, training, and experience necessary to manage the program.  The RMP coordinator, acting with the authority delegated by the plant manager, is responsible for coordinating the development, implementation and integration of the RMP elements as is required under Section 68.15 of the RMP rule.\r\n\r\nB.) The stationary source and regulated substances handled.\r\n\r\nThe primary purpose of the Kansas City plant is to produce polyurethane foam seat cushions for the automotive industry.  The foam is made by high pressure mixing of ch"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081835,
      "SummaryText": "110 degrees F.  There is no containment at the rail unloading area.  Using the EPA*Comp model, the impact zone is 0.7 miles from the unloading area.  Within this endpoint distance there is a residential population to the NW (approximately 354 people), a to the NE there is a high school and a nursing / rehabilitation center.  The Kansas City Plant is located in the Platte Valley Industrial Park which is also within the endpoint distance.  Total Park working population is approximately 1500 people.\r\n\r\nAtlernative Release Scenario\r\nCatastrophic failure of an unloading hose is assumed for the alternate release scenario.  In the event that a hose ruptures or valve fails while unloading a TDI car, it is estimated that there would be a lose of approximately 20,000 lbs. of TDI. This loss is based on the following assumptions:\r\n- Rail car contains 190,000 lbs. \r\n- A hose blow off would be detected within 5 minutes at which point the emergency stop would be activated.\r\n- The emergency stop will immediately attempt to shut off flow via the automatic valve. Assume this fails to stop flow.\r\n- The emergency stop will immediately attempt to bleed the pressure off the railcar. This will take approximately 20 minutes to bleed down based on bleed down after normal unloading. \r\n- Unloading the car generally takes 240 minutes under normal circumstances, giving a flow rate of 791.67 lbs/minute.\r\n- In this scenario we would have TDI flow for 25 minutes for a total loss of 19,791.75 lbs.\r\nIf this were to occur, once the pressure is released from the car, the remaining contents would remain in the rail car. Using RMP*Comp modeling program, the impact radius would be 0.1 miles from the unloading area, with off-site consequences being limited to the adjacent industrial facilities to the east and south.\r\n\r\nD.)  The general accidental release prevention program and the specific prevention steps\r\n\r\nWe take a systematic approach to preventing accidental releases of chemicals.  Our management sy"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081835,
      "SummaryText": "ide Fire Department.  We have also given local hospitals information regarding medical treatment for exposure to TDI.\r\n\r\nG.)  Planned changes to improve safety\r\n\r\nAt this time we are continuing to maintain our current safety management systems, and periodically investigating new technologies, techniques and methods to improve the process and handling control systems for TDI."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081835,
      "SummaryText": "stems for our TDI process address each of the key features of successful prevention programs including:\r\nSafety information\r\nHazard reviews of our processes\r\nOperating procedures\r\nTraining\r\nEquipment Maintenance Program\r\nRMP Compliance Audits\r\nAccident/Incident Investigation\r\nMonthly physical safety audits\r\n\r\nIn addition, we have an established Isocyante Control Program which outlines the hazards of handling toluene diisocyanate and the controls which are in place to reduce the hazards of isocyanate exposure to the employees, the community and the environment.  Monitors are used in the process and storage areas to constantly check for any leaks, and a visual system is in place that allows remote inspection of tanks.  As well, a buddy system is used in the unloading and tank farm areas to aid in accident prevention.\r\nThese listed individual elements of our prevention program work together to prevent accidental chemical releases.  Our company and our employees are committed to the standard that these management systems set for the way we conduct business, and we have specific accountabilities and controls to ensure that we are meeting our own high standards for accident prevention.\r\n\r\nE.) Five-year accident history\r\n\r\nWe has never been any TDI releases that qualify for listing in the EPA's accident history report, therefore there has not been any TDI releases in the past 5 years.\r\n\r\nF.) The emergency response program\r\n\r\nWe maintain an integrated contingency plan which consolidates the various federal, state, and local regulatory requirements for emergency response planning.  The emergency response program was developed with the aid of Management Strategies Group, Inc., and was designed to meet OSHA 29 CFR 1910.120 (q) requirements.  Our program provides essential planning and training for effectively protecting workers, the public and the environment during emergency situations.  We have coordinated our program with the Mid America Regional Council LEPC and the Rivers"
    }
  ]
}