{
  "FacilityID": 1000049296,
  "FacilityName": "J. Milicic & Son",
  "FacilityStr1": "33398 Woollomes Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Delano",
  "FacilityState": "CA",
  "FacilityZipCode": "93215",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.7481",
  "FacilityLongDecDegs": "-119.1441",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "J. Milicic & Son",
  "OperatorStr1": "P.O. Box 277",
  "OperatorStr2": null,
  "OperatorCity": "Delano",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93215",
  "OperatorZipCodeExt": null,
  "RMPContact": "Neil Mendrin",
  "RMPTitle": "Manager",
  "FTE": 9,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168178",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-02-04 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-05-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-04-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-04-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-04-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.74698,
  "FRS_Long": -119.14764,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000061804,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000049296,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000062966,
          "ProcessID": 1000061804,
          "NAICSCode": "115114",
          "_desc": {
            "NAICS_CODE": "115114",
            "NAICS_DESCRIPTION": "Postharvest Crop Activities (except Cotton Ginning)"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000075908,
          "ProcessID": 1000061804,
          "ChemicalID": 56,
          "Quantity": 53000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000575908,
          "ProcessID": 1000061804,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000049296,
      "SummaryText": "Executive Summary\n\n\n\nThis program is intended to meet the spirit and intent of the following regulations:\n\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n- California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, J. Milicic & Son has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 J. Milicic & Son, Risk and Process Safety Management Program\n\n\n\nThis is to inform all interested persons, including employees, that J. Milicic & Son has updated/developed their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following process which has the presence of hazardous chemicals above threshold quantities: \n\n\n\nProcess Name           | Process Chemical      | Process Quantity(lbs.)   \n\nAmmonia Refrigeration    Anhydrous Ammonia       53,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries, illnesses, and physical property damage.\n\n\n\nOur company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n1. Prepared a unified program based on the PSM regulation to meet CalARP and RMP obligations as"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000049296,
      "SummaryText": " well\n\n2. Organized the program so that it meshes closely with general business practices\n\n3. Utilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures, and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Descriptions\n\n\n\nJ. Milicic operates a commercial cold storage for table grapes. \n\n\n\nThe systems operate as follows. High pressure liquid from our high pressure receivers is piped to each cold room, where it passes through a liquid control valve into low temperature & pressure accumulator vessels. From the accumulators, cold liquid ammonia is circulated through evaporator coils. As heat is absorbed, the liquid ammonia vaporizes to form low temperature & pressure gas which is returned to the accumulator vessel. The ammonia vapor is returned from the accumulator vessels through a suction return line to our engine room, where it passes through the main suction accumulator and then to the compressors. The high pressure discharge from the compressor is sent to the water cooled condenser where the high pressure gas ammonia is cooled, liquefied and returned to our receiver.\n\n\n\nThe facility was originally named Dan Tudor and Sons, but the name was changed to J. Milicic & Son in 2010.  In 2011, Industrial Refrigeration Services supplied and installed the refrigeration equipment for a new cold storage room and staging/dock area.  Also in 2011, Sandy Schultz renovated the computer control system as a subcontractor of Power It Solutions.\n\n\n\nThe system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to the adsorption tank if the pressure in the system exceeds their set point.  Lastly, an emergency \"dump box\" contains switches and valves to turn off equipment and vent ammon"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000049296,
      "SummaryText": "ia if necessary. \n\n\n\nThe ammonia system at our facility consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels that are not directly connected. Therefore, we are treating the system as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nJ. Milicic & Son has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 Anhydrous Ammonia\n\n\n\nThe ammonia refrigeration process at the J. Milicic & Son facility is an integral part of the overall business and operates most of the year. It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep records of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. \n\n\n\n1.4 Five Year Accident History\n\n\n\nJ. Milicic & Son has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\n\n\nJ. Milicic & Son's emergency action and response program has been developed to satisfy the following requirements:\n\n\n\n- California \"Emergency Action Plan\" - Title 8 CCR ?3220\n\n- Federal \"Emergency Action Plan\" - Title 29 "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000049296,
      "SummaryText": "CFR ?1910.38\n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\n\n\nJ. Milicic & Son has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, J. Milicic & Son continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved J. Milicic & Son's ability to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that J. Milicic & Son's management team can ensure that the RMP-PSM program is being implemented.\n\n\n\nJ. Milicic & Son has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, J. Milicic & Son has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\n\n\nFor the future, J. Milicic & Son now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for J. Milicic & Son employees, but allows for "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000049296,
      "SummaryText": "feedback and continual improvement. Through the RMP-PSM program J. Milicic & Son will continue to maintain overall plant worker and public safety."
    }
  ]
}