{
  "FacilityID": 1000095424,
  "FacilityName": "Kenosha Regional Distribution Center",
  "FacilityStr1": "9800 72nd Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Pleasant Prairie",
  "FacilityState": "WI",
  "FacilityZipCode": "53158",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55059",
  "LEPC": "Kenosha LEPC",
  "FacilityLatDecDegs": "42.530139",
  "FacilityLongDecDegs": "-087.896111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P2",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "SC Johnson & Son",
  "Company2Name": null,
  "CompanyDUNS": 6091417,
  "Company2DUNS": null,
  "OperatorName": "Ryder System, Inc.",
  "OperatorStr1": "9800 72nd Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Pleasant Prairie",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "53158",
  "OperatorZipCodeExt": null,
  "FTE": 165,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177391",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-09-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-08-16 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-08-16 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-08-16 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 42.53092,
  "FRS_Long": -87.8942,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000118371,
      "AltID": "Aerosol Product Storage",
      "FacilityID": 1000095424,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000147953,
          "ProcessID": 1000118371,
          "ChemicalID": 155,
          "Quantity": 55423288.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000130807,
              "ProcessChemicalID": 1000147953,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000130806,
              "ProcessChemicalID": 1000147953,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000130805,
              "ProcessChemicalID": 1000147953,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000119704,
          "ProcessID": 1000118371,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000095424,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2019-10-29 00:00:00",
    "ERTrainingDate": "2021-02-10 00:00:00",
    "CoordinatingAgencyName": "Kenosha County Emergency Services",
    "CoordinatingAgencyPhone": "2626536595",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000095424,
      "SummaryText": "ntire mixture is calculated to increase to 60,396,880 lbs. \n\nThe fourth item is expected to result in a more refined approximation of the worst-case amount of flammable mixture in individual containers for use in calculating the worst case release scenario, given it is realistic to expect that when the above-noted Raid products are present onsite, there will be at least one case that may contribute to release.  For continuity, this refinement was then conservatively extrapolated to estimate the maximum aggregate amount of flammable mixture that may be present onsite for the purpose of assessing applicability relative to whether the 10,000 lb TQ is exceeded.  To this end, we estimated that 7,445 pallets of Level 1 aerosols would all be as Raid Max Flying Insect Killer, and that 23,134 pallets (i.e., 12,979 pallet capacity of added aerosol room + 2021 Total  of 10,155 pallets) of Level 2/3 aerosols would all be as Raid Max Concentrated Deep Reach Fogger.  While such is expected to provide a conservative worst-case aggregate amount for applicability assessment purposes, such is not reasonable to expect in practice because at any given time, there will be more than one type of Level 1 aerosol product, and more than one type of Level 2/3 aerosol product onsite - each with varying amounts of flammable mixtures (expected to be less than or equal to that which is noted under Item 4, above).  The relative mix of products at any given time depends on numerous variables (e.g., market demand, distribution needs).  Regardless of the actual mix of products, the TQ is expected to be triggered - whether using the historic estimate or the conservatively refined 2023 estimate.  In practice, the estimate maintained prior to the 2021 submittal may provide a more realistic approximation of a maximum aggregate amount of flammable mixture that may reasonably be expected at any given time given the variability in the relative amounts of products and the flammable mixture content thereof."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000095424,
      "SummaryText": "h had historically been reported dating back to at least 2002, which was based on the best information available at the time it was prepared.  In the course of preparing the 5-year resubmission in 2021, the historic information was reviewed and conservatively refined as follows, as amended herewith on 08-08-2023 to reflect the above-noted increased storage capacity for Level 2/3 aerosol cans [Except as otherwise noted, the information listed below is consistent with the 2021 resubmission]:   \n\n1. As of the 2021 resubmission, the number of pallets of aerosol products remained the same at 17,600 pallets; however, the relative distribution for use with Level 1 vs. Level 2/3 aerosols was refined, as discussed below.   As reflected below, the number of Level 2/3 aerosol pallets has since increased by 12,979 pallets with the addition of an aerosol storage room\n2. The number of cases per pallet was increased from 110 to 205 cases per pallet, as a worst-case; however, the actual number of cases per pallet generally varies by product depending on packaging & transportations requirements.\n3. The number of cans per case (i.e., 12 cans/case) remained the same.\n4. The worst-case amount of propellant per can was increased from 0.33 lb/can to 0.73 lb/can for Level 1 aerosols (as Raid Max Flying Insect Killer) and 0.74 lb/can for Level 2/3 aerosols (as Raid Max Concentrated Deep Reach Fogger).\n5. The worst-case release has been increased from one can to a full-case of 12-cans.\n6. For continuity with the original reporting approach, the flammable mixture mass reported in Sec. 1.17.c (31,873,277 lbs) is the total of the reportable flammable chemicals, while the total mass of the entire mixture is calculated at 36,846,868 lbs.  Since the 2021 resubmission, an aerosol storage room was added, which increased the storage capacity for pallets of Level 2/3 aerosols by 12,979 pallets.  Consequently, the total reported in Sec. 1.17.c increased to 55,423,288 lbs, while the total mass of the e"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000095424,
      "SummaryText": "Kenosha Regional Distribution Center \nUpdated 08-08-2023 to reflect expanded Level 2/3 aerosol can storage with the addition of a aerosol storage room with a capacity to hold up to 12,979 pallets of such aerosol products.  This is not expected to increase the worst-case offsite consequence analysis.\n\nA Risk Management Plan has been implemented at the Kenosha facility for the prevention of accidental releases of flammable materials. The facility is located at 9800 72nd Avenue in Pleasant Prairie (Kenosha County) Wisconsin. The facility is a storage and distribution warehouse that houses consumer products, packaged in aerosol cans, manufactured by SC Johnson & Son. SC Johnson is a privately held, family-managed company, with worldwide headquarters located in Racine, Wisconsin. \n                                                                                                                                                                          \nLiquefied Petroleum Gas (LPG) propellant used in aerosol products contains several components that are classified as flammable materials under EPA's RMP regulations. Specifically, the propellants consist of propane, butane and isobutane blends. The maximum projected quantities (cases) of aerosol products stored in the warehouse and product propellant weights were used to estimate maximum quantities of RMP-regulated chemicals in the warehouse storage process. \n\nThe worst case scenario performed, based on EPA's Offsite Consequence Analysis Guidance, indicates that the distance to the 1 psi overpressure endpoint will not extend beyond plant property. No offsite receptors are impacted. There have also been no prior accidents at the facility resulting in any offsite environmental impacts.\n\nEmergency response activities at the Kenosha Facility are coordinated with the Kenosha County LEPC and the Kenosha County Emergency Services.\n\nThe maximum number of pallets storing flammable mixture-containing products was expanded over that whic"
    }
  ]
}