{
  "FacilityID": 1000063038,
  "FacilityName": "Grain Craft - Pendleton",
  "FacilityStr1": "501 SE Emigrant Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Pendleton",
  "FacilityState": "OR",
  "FacilityZipCode": "97801",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41059",
  "LEPC": "Umatilla County LEPC",
  "FacilityLatDecDegs": "45.672306",
  "FacilityLongDecDegs": "-118.781556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Grain Craft",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Grain Craft",
  "OperatorStr1": "501 SE Emigrant Ave.",
  "OperatorStr2": null,
  "OperatorCity": "Pendleton",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97801",
  "OperatorZipCodeExt": null,
  "RMPContact": "Tim Byam",
  "RMPTitle": "Plant Manager",
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000177239",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-06-25 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-04-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-04-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 45.67218,
  "FRS_Long": -118.78055,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000079103,
      "AltID": "311211",
      "FacilityID": 1000063038,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000080261,
          "ProcessID": 1000079103,
          "NAICSCode": "311211",
          "_desc": {
            "NAICS_CODE": "311211",
            "NAICS_DESCRIPTION": "Flour Milling"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098538,
          "ProcessID": 1000079103,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598538,
          "ProcessID": 1000079103,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000063038,
      "SummaryText": "Executive Summary\n\n\n\nGrain Craft\n\nPendleton, OR 97801\n\n\n\nACCIDENT RELEASE PREVENTION PROGRAM AND EMERGENCY RESPONSE POLICY\n\n\n\nIt is the policy of the Grain Craft, Pendleton, Oregon, facility management to implement the requirements of the Risk Management Program, (RMP) in accordance with the Environmental Protection Agency, (EPA) Regulation under 40 CFR Part 68 and with the corresponding regulations under OSHA's Process Safety Management (PSM) Program. The objective is to minimize the risk of a release of a hazardous material and if a release occurs, to minimize the potential impact to Grain Craft employees, the public and the environment. This objective will be accomplished by utilizing general good operating procedures, providing appropriate training to all employees and coordinating response activities, as necessary, with the local emergency response providers. Management is committed to providing the resources necessary to implement this policy. The key concepts in our release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees.\n\n\n\n\n\nFACILITY DESCRIPTION\n\n\n\nThe Grain Craft operates a flour mill in Pendleton, Oregon that processes wheat into different grades of flour. Several of the grades involve a process in which chlorine is added to the milled flour to age and bleach the flour as well as reducing the microbial impact of the water used in tempering the wheat prior to milling. The system uses four one-ton chlorine cylinders on line to dispense the chlorine into an educator vacuum system. This vacuum system allows for the feed of chlorine from the containers into the piping system on to our agitators. If a chlorine line downstream of the vacuum regulator is broken or develops a leak, the vacuum is interrupted and the vacuum regulator automatically closes, preventing the discharge of chlorine gas.  Four additional one-ton cylinders are located within the same enclosure as either"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000063038,
      "SummaryText": " empty containers or full containers in standby valved off from the delivery system. The current system uses industry standard equipment, schedule 80 CPVC pipe well routed for safety, and is regularly inspected and maintained for integrity. The location of the current chlorine room is in the front corner of the flour mill complex.\n\n\n\nCaravan Ingredients, the company's contractor, regularly visits the flour mill to inspect the chlorine delivery system, perform routine maintenance, make adjustments to the chlorine delivery system, and other tasks as required to allow for efficient operation. Grain Craft`s personnel receive the chlorine containers from the chemical supplier, transfer the containers into the chlorine room and hook up the piping to the containers.  Caravan Ingredients personnel are the only people making changes to the operating system with the exception of hooking up and unhooking the chlorine tanks, which is done by Grain Craft's personnel. \n\n\n\n  \n\nWORST CASE AND ALTERNATIVE RELEASE SCENARIOS\n\n\n\nChlorine\n\n\n\nThe worst-case release scenario for a chlorine release of all the contents of one of the 2,000-pound chlorine cylinders in a 10-minute period (per EPA guidelines). This release translates to a release of 2,000-pounds of chlorine in 10 minutes or 200 pounds/min. Other assumptions included in the worst-case assessment are: the chlorine is a liquefied gas; the cylinder is not diked. The wind speed is 1.5 meters/sec, and the atmospheric stability is classified as F (stable). The results of the worst-case assessment for chlorine show that the plume must travel 1.3 miles before dispersing to the endpoint concentration of 3.0 parts per million (PPM).\n\n\n\nThe selected alternative-release scenario for the chlorine system is a release resulting from damage or rupture of the chlorine vapor line (pigtail) from the ton cylinder to the chlorine manifold. The pigtail has an inside diameter of 3/8 inch. The operating pressure of the cylinder is 86 psig. Based on RMP"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000063038,
      "SummaryText": " COMP, the plume must travel 0.2 miles before dispersing to the endpoint concentration.\n\n\n\nThe meteorological data used for this alternative release scenario was a wind speed of 1.5 meter/sec, an atmospheric stability classification B neutral stability, and urban dispersion environment in the near field.\n\n\n\nThe Grain Craft facility is governed by a set of OSHA and USEPA regulations that require planned and facility activities intended to prevent a release of hazardous material, or if a release inadvertently occurs, to minimize the consequence of a release to the employees of the facility, the public, and to the environment.  These regulations include:\n\n\n\n40 CFR Part 68, Accidental Release Prevention\n\n40 CFR Part 112, Spill Prevention, Control and Countermeasure.\n\n40 CFR Part 264 Hazardous Waste Contingency Plan\n\n29 CFR Part 119, Process Safety Management\n\n\n\nThe key concepts in Grain Craft release prevention program are employee participation, appropriate design and maintenance of equipment, and appropriate training of all employees.\n\n\n\nEmployee participation in the release prevention program is encouraged and supported by Grain Craft's management. Key personnel are responsible for conducting and implementing the findings from Process Hazard Analysis (PHA) for the chlorine system. Grain Craft employees are also members of the facility emergency response team. They are trained in advanced 1st Aid, Medical (911 Emergency Service), Evacuations of buildings, Plant security, Communications (Chain of Command), Power outages, and Facility inspections and inventories.\n\n\n\nGrain Craft's policy is to construct all new equipment, systems, and facilities in accordance with the most current building and safety codes. This ensures the appropriate safety and release prevention systems are included from the beginning of each project.\n\n\n\nGrain Craft is committed to providing appropriate training to all employees regarding safety procedures. New employees are provided comprehensive saf"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000063038,
      "SummaryText": "ety training during their initial orientation for the facility.  In addition, Grain Craft conducts regularly scheduled safety training for all employees each year.  Additional training is provided to maintenance personnel for the systems they are responsible for.  Members of Grain Craft emergency response team receive annual training to ensure that response action are promptly and safely completed.\n\n\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere has been no accidents/releases of chlorine at Grain Craft that meet specific EPA criteria for the Five Year Accident History.\n\n\n\n\n\nPREVENTION PROGRAM\n\n\n\nProcess Safety Management (PSM) is made up of the following 13 elements:\n\n\n\n1) Employee Participation\n\n2) Process Safety Information\n\n3) Process Hazard Analysis\n\n4) Operating Procedures\n\n5) Training\n\n6) Contractors\n\n7) Pre-Startup Safety Review\n\n8) Mechanical Integrity\n\n9) Hot Work Permit\n\n10) Management of Change\n\n11) Incident Investigation\n\n12) Emergency Planning and Response\n\n13) Compliance Safety Audits\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nGrain Craft will conduct training of all affected operating personnel in the areas of material transfer, background on chlorine, emergency procedures involved with the chlorine delivery system, and community emergency response as needed.  Enhanced relations with the Pendleton Fire Department, City and State Police, and the Media.\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nGrain Craft and Caravan Ingredients complete a thorough review of the chlorine systems each time a design change is implemented. The system is also evaluated each time the PHA is revised.  Grain Craft is committed to using these methods to identify and implement ways to improve the safety of these systems.\n\n"
    }
  ]
}