{
  "FacilityID": 1000044505,
  "FacilityName": "Anacortes Water Treatment Plant",
  "FacilityStr1": "14489 Riverbend Road",
  "FacilityStr2": null,
  "FacilityCity": "Mount Vernon",
  "FacilityState": "WA",
  "FacilityZipCode": "98273",
  "Facility4DigitZipExt": "9686",
  "FacilityCountyFIPS": "53057",
  "LEPC": "Skagit County LEPC",
  "FacilityLatDecDegs": "48.437778",
  "FacilityLongDecDegs": "-122.371601",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cityofanacortes.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Anacortes",
  "Company2Name": null,
  "CompanyDUNS": 37993714,
  "Company2DUNS": 0,
  "OperatorName": "Jamie LeBlanc",
  "OperatorStr1": "14489 Riverbend Road",
  "OperatorStr2": null,
  "OperatorCity": "Mount Vernon",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98273",
  "OperatorZipCodeExt": "9686",
  "RMPContact": "Jamie LeBlanc",
  "RMPTitle": "Division Manger",
  "FTE": 12,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000099118",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-09-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-13 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-03-01 00:00:00",
  "DeRegistrationEffectiveDate": "2019-02-14 00:00:00",
  "AnniversaryDate": "2019-06-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 48.43748,
  "FRS_Long": -122.37128,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054964,
      "AltID": "Water Treatment Plant",
      "FacilityID": 1000044505,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055803,
          "ProcessID": 1000054964,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000066934,
          "ProcessID": 1000054964,
          "ChemicalID": 62,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000566934,
          "ProcessID": 1000054964,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000044505,
      "SummaryText": "Risk Management (RM) Program Executive Summary\n\n1    Description of Source and Regulated Chemicals Handled\n\nThe City of Anacortes owns and operates a water treatment plant (WTP) that provides potable water to over 50,000 people in Skagit and Island Counties.  The WTP is located approximately 2 miles west of Mount Vernon, WA directly adjacent to the Skagit River.  The WTP operates continuously 24 hours per day, 7 days per week.  A key treatment process at the WTP is water disinfection using chlorine.  Chlorine is the chemical used at the WTP that is subject to federal Risk Management Program (RMP) regulations.\n\nThe form of chlorine used is liquefied gaseous chlorine that is stored and fed on-site from 1-ton cylinders.  The chlorine system is housed in a dedicated room within the WTP Chemical Building that is used for chlorine storage and feed only.  Up to 18 cylinders can be stored within the room.  Chlorine cylinder deliveries typically occur about once per week. The feed system consists of two banks of 3 on-line cylinders each, from which gas chlorine is withdrawn under vacuum to up to 4 vacuum chlorinators which control the rate of gas chlorine feed to up to 4 injection points into carrier water streams that convey the chlorine to the feed points for the disinfection process.  \n\nThe chlorine room is an H-3 Occupancy area per the International Building Code (IBC) and therefore has appropriate ventilation and conditioning, fire-rated walls and assemblies, and fire sprinkler system.  There are 4 chlorine gas detectors in the room that are continuously monitored.  An emergency dry-type chlorine scrubber unit is located directly adjacent to the chlorine room that is designed to neutralize up to 2000 lbs. of chlorine gas.  All 6 on-line cylinders have emergency shut-off valves that are activated when chlorine gas is detected anywhere in the chlorine room. \n\n2    Accidental Release Prevention and Emergency Response Policy\n\nThe City of Anacortes is fully committed to the lowest"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000044505,
      "SummaryText": " risk feasibly possible to City employees, City contractors, and the public of possible injury or death as a result of an accidental release of chlorine at the WTP. This includes aggressively identifying potential hazardous conditions and practices that could result in chlorine releases, taking immediate action to eliminate or minimize any hazardous conditions once found, and having in-place well-defined emergency response procedures should a release occur. \n\n3    Chlorine Release Scenarios\n\nFive chlorine release scenarios were evaluated using the USEPA offsite consequences analysis guidelines, calculation methods, and applicable constants.  Two of the release scenarios are worst-case and three are alternative scenarios.  Short summaries of the scenarios are below.\n\nWorst-Case Release Scenarios\n\nWorst-Case Scenario #1:  Up to 2000 lbs. (contents of one full chlorine cylinder) is released over 10 minutes either outside the chlorine room or inside the chlorine room with the roll-up access door open.  The calculated distance of travel until falling below the toxic endpoint concentration of 0.0087 mg/L for this scenario is 3.0 miles. \n\nWorst-Case Scenario #2:  Up to 2000 lbs. (contents of one full chlorine cylinder) is released over 10 minutes inside the chlorine room with all access doors to the room closed (passive mitigation).  The calculated distance of travel until falling below the toxic endpoint concentration of 0.0087 mg/L for this scenario is 2.25 miles.\n\nAlternative Scenario #1:  Up to 2000 lbs. (contents of one full chlorine cylinder) is released either outside the chlorine room or inside the chlorine room with the roll-up access door open. The release rate is based on an assumed orifice  in the vapor space of the cylinder. The calculated distance of travel until falling below the toxic endpoint concentration of 0.0087 mg/L for this scenario is 0.54 miles.\n\nAlternative Scenario #2:  Up to 2000 lbs. (contents of one full chlorine cylinder) is released inside the "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000044505,
      "SummaryText": "chlorine room with all access doors to the room closed (passive mitigation) and the dry scrubber system fails. The release rate is based on an assumed orifice  in the vapor space of the cylinder. The calculated distance of travel until falling below the toxic endpoint concentration of 0.0087 mg/L for this scenario is 0.41 miles.\n\nAlternative Scenario #3:  Up to 2000 lbs. (contents of one full chlorine cylinder) is released inside the chlorine room with all access doors to the room closed (passive mitigation).  The dry scrubber system operates as designed (active mitigation). The release rate is based on an assumed orifice  in the vapor space of the cylinder. The calculated distance of travel until falling below the toxic endpoint concentration of 0.0087 mg/L for this scenario is 0.35 miles.  This scenario reflects conditions under which a release would be more likely to occur.\n\n4    Five-Year Accident History \n\nPer the RMP regulations, an accidental release is defined as the release of a regulated substance that \"resulted in deaths, injuries, or significant property damage on-site, or known off-site deaths, injuries, evacuations, sheltering in-place, property damage, or environmental damage\".  There have been no chlorine release events at the Anacortes WTP in the past five years that meet any of these criteria.\n\n5    Prevention Program Elements\n\nProgram Management.  Roles and responsibilities for implementing and carrying-out the RM Program for the City's WTP are defined within the City's organization.  The Public Works Director has overall responsibility for the development, implementation, and integration of the RM Program, including the assignment of the specific RM Program roles and responsibilities for the Assistant City Engineer for Water and the WTP staff.  The WTP Manager is responsible for the integration, execution, and enforcement of the RM Program at the WTP.  \n\nProcess Safety Information.  All WTP personnel receive training annually to remain current with chl"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000044505,
      "SummaryText": "orine safety and first aid procedures. The primary hazards associated with the chlorine handling system are:\n\n1.    Fire\n\n2.    Flexible connection failure\n\n3.    Fusible plug failure\n\n4.    Valve packing failure\n\n5.    Gasket failure\n\n6.    Piping failure\n\n7.    Equipment failure\n\n8.    Collision accidents causing physical damage to containers\n\nProcess Hazard Analysis (PHA).  A PHA was performed for the WTP chlorine system using the What-If Checklist Method in accordance with 40 CFR Part 68.67.  The hazards analysis scenarios were divided into the following categories:\n\n1.    O&M Hazards\n\n2.    Equipment Failure / Malfunction Hazards\n\n3.    External / Environmental Hazards\n\nIssues identified in the PHA were documented and have been addressed.  The PHA will be reevaluated and updated as necessary once every five years or more often if new hazards are identified.\n\nOperating Procedures.  Operating procedures for the chlorine system are documented in the WTP electronic O&M Manual.  These procedures are reviewed annually and updated as necessary. \n\nTraining.  All new operators at the WTP receive initial training in chlorine system operations, safety, and emergency response.  All WTP operators receive refresher training annually.\n\nMechanical Integrity.  The mechanical integrity program for the WTP chlorine system includes the following:\n\n&#9679;    Identification of critical equipment and instrumentation.\n\n&#9679;    Written maintenance, testing, and inspection schedules and procedures.\n\n&#9679;    Maintenance personnel training.\n\n&#9679;    Maintenance, testing, and inspection completion and documentation.\n\n&#9679;    Correction of equipment deficiencies.\n\n&#9679;    Quality assurance of new equipment.\n\nManagement of Change.  A Management of Change (MOC) procedure has been prepared for the WTP chlorine system.  The purpose of the MOC is to ensure that changes to the chlorine system are properly reviewed against original system design specifications and can be accomplished safely, and that the system is ready to operate "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000044505,
      "SummaryText": "safely in accordance with original system design intent following implementation of the change.\n\nPre-Startup Safety Review.  A Pre-startup Safety Review (PSSR) will be performed if and when modifications to the existing chlorine process at the WTP are made that are significant enough to require a change in the process safety information. The purpose of the PSSR is to ensure that the modified chlorine system is ready to safely operate.\n\nCompliance Safety Audits.  RMProgram compliance will be confirmed by compliance safety audits performed at least once every 3 years in accordance with 40 CFR Part 68.81.  Documentation of the audit findings is included in the compliance audit report.  All deficiencies and/or recommendations noted in the audit are addressed and the resolutions of them are also documented.  The two most recent compliance audit reports are maintained electronically in City files.\n\nIncident Investigation.  A procedure for chlorine release incident investigation, reporting, and documentation has been prepared in accordance with 40 CFR Part 68.81.  This procedure applies to all incidents that result in and all near-miss incidents that could have resulted in catastrophic chlorine releases.  A catastrophic release is one that injures or endangers employees, the public, or the environment.  A near-miss is an incident that could have resulted in a catastrophic release but was averted either due to rapid observation and response actions or good fortune (e.g., favorable wind conditions, operators being out of the area, etc.) which cannot routinely be counted on in the future.  This procedure does not replace the City of Anacortes Department of Public Works and Utilities Safety Manual that must also be followed in the event of any injury and chemical release.\n\nEmployee Participation.  An RMP Employee Involvement Plan has been prepared in accordance with 40 CFR Part 68.83.  This plan describes employee participation in conducting a process hazard analysis (PHA) and"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000044505,
      "SummaryText": " in implementing all other key elements of the RMProgram.  All WTP employees have access to the PHA.\n\nHot Work Permit.  A Hot Work Permit procedure has been developed for hot work conducted on or near the chlorine system in accordance with 40 CFR Part 68.85.  Hot work is defined as any work that may generate a source of ignition and includes but is not limited to welding, torch cutting, and use of spark-producing equipment.  This procedure does not apply to work performed in established maintenance shops or areas at the WTP that are designated for hot work.\n\nContractor Safety.  A Contractor Safety procedure has been developed in accordance with 40 CFR Part 68.85.  This procedure covers evaluating contractor's health and safety information before selection and evaluating contractor safety performance while working at the WTP. This procedure is specific to those contractors who perform work (e.g., maintenance or repair, renovation, or specialty work) on and around the chlorine system in the WTP Chemical Building.\n\n6    Emergency Response\n\nEmergency response procedures for chlorine releases at the WTP are documented in the Emergency Response Plan.  The Plan addresses the key responsibilities and actions for: 1) emergency response preparation, and 2) immediate response and mitigation of a serious chlorine gas release that may result in a risk to human life and health safety.  Typically, a serious chlorine release is defined as that which releases or has the potential to release 10 lbs. or more of chlorine.  It is not intended to address small incidental chlorine releases that can occur as part of routine operations at the WTP that are easily mitigated without any life and health safety risk.\n\nEmergency Response Planning.  A key element of emergency response preparation is the WTP Chlorine Emergency Response Team (CERT).  The CERT consists of WTP employees who meet the following requirements:\n\n1.    Pass a self-contained breathing apparatus (SCBA) fitness test\n\n2.    Trained in t"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000044505,
      "SummaryText": "he use of SCBA\n\n3.    Trained in the requirements and use of an ABA level chemical suit and proper personal protective equipment.\n\n4.    Trained in the use of the chlorine leak Class B repair kit\n\n5.    Have a valid first aid card\n\n6.    Are physically able to perform the necessary response work\n\n7.    Are able to function under stress\n\nThe current CERT members are:\n\n&#9679;    Jamie LeBlanc\n\n&#9679;    George Atkinson\n\n&#9679;    Jeff Marrs\n\n&#9679;    Karl Frantz\n\nThe responsibilities of the CERT personnel for emergency response preparation are:\n\n&#9679;    Maintain CERT qualifications.\n\n&#9679;    Be on-call 24 hours a day, unless out on scheduled vacation time.\n\n&#9679;    Assist the WTP Manager with the following:\n\n&#61616;    Training of WTP and contractor personnel on chlorine system hazards and emergency response.\n\n&#61616;    Maintenance of appropriate personal protective equipment (PPE) for work around the chlorine system.\n\n&#61616;    Conduct monthly safety inspections of the chlorine system area.\n\n&#61616;    Maintenance of the emergency response facilities and equipment associated with the chlorine system.\n\nEmergency Response.  In an emergency response to a chlorine release event, the overall priority of actions for safety are:\n\n1.    Operator safety\n\n2.    Public safety\n\n3.    Treatment process integrity - sanitary potable water\n\n4.    Environmental safety\n\nFor key actions to be taken by WTP personnel for emergency response in the event of a significant chlorine gas release are grouped into three phases and are outlined in the table below.\n\nEmergency Response Phase    Characteristics    Key Actions\n\nPhase 1    Possible chlorine gas release based on detection/alarm\n\n    ?    Remove all on-site personnel away from chlorine system area.\n\n?    Immediate release containment - chlorine room doors closed.\n\n?    Secure access to the WTP site.\n\n?    Initial determination of seriousness of release.\n\n?    Notifications:\n\no    If any personnel are injured, call 911\n\no    Lead shift operator and/or WTP Manager\n\no    CERT members\n\nPhase 2    Confirmed chlorine ga"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000044505,
      "SummaryText": "s release\n\n    ?    Confirm the source of the alarm.\n\n?    Check that containment measures are activated:\n\no    All chlorine room doors closed \n\no    Cylinder emergency valves closed \n\no    Dry scrubber activated\n\n?    Stop WTP operation\n\n?    Notifications:\n\no    Fire department\n\no    County sheriff / police\n\no    Public Works director\n\n?    CERT takes appropriate measures to control or stop the release.\n\n?    CERT assists fire department with identifying the release source and any other necessary measures to stop the release.\n\nPhase 3    Assessment and mitigation\n\n    ?    CERT assists fire department with verifying the release source and that further release has been safely stopped.\n\n?    Initial damage assessment to determine:\n\no    Potential for further releases / hazards\n\no    Extent of equipment damage\n\no    If WTP operations can be resumed within 24 hours or not\n\n?    Notifications:\n\no    Wholesale customers (depending upon the estimated time that WTP operation will be suspended)\n\n\n\nIn the event of a confirmed chlorine release (Phase 2), the WTP employee that makes the 911 call shall provide the following information:\n\n&#9679;    Location of the WTP and staging area\n\n&#9679;    Severity of release\n\n&#9679;    Wind direction and speed\n\n&#9679;    Extent of any injuries on-site\n\n&#9679;    The need (or not) to evacuate neighbors near the WTP site\n\n\n\n"
    }
  ]
}