{
  "FacilityID": 1000114512,
  "FacilityName": "Ruiz Food Products, Inc. - Dinuba",
  "FacilityStr1": "501 South Alta Avenue",
  "FacilityStr2": "P.O. BOX 37",
  "FacilityCity": "Dinuba",
  "FacilityState": "CA",
  "FacilityZipCode": "93618",
  "Facility4DigitZipExt": "0037",
  "FacilityCountyFIPS": "06107",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "36.539713",
  "FacilityLongDecDegs": "-119.398232",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.elmonterrey.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 9476938,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Ruiz Food Products, Inc.",
  "OperatorStr1": "501 South Alta Avenue",
  "OperatorStr2": "P.O. Box 37",
  "OperatorCity": "Dinuba",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93618",
  "OperatorZipCodeExt": "0037",
  "FTE": 1400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000056011",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2024-01-04 00:00:00",
  "SafetyInspectionBy": "City of Dinuba Fire Marshall",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-05-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-05-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-05-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-05-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.584557,
  "FRS_Long": -119.39505,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000142665,
      "AltID": "Ammonia refrigeration.",
      "FacilityID": 1000114512,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000178428,
          "ProcessID": 1000142665,
          "ChemicalID": 56,
          "Quantity": 75000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000144177,
          "ProcessID": 1000142665,
          "NAICSCode": "31141",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000122041,
              "Process_NAICS_ID": 1000144177,
              "SafetyReviewDate": "2024-05-09 00:00:00",
              "PHA_Date": "2024-05-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "Process Inspection (walkthrough)",
              "PHACompletionDate": "2026-05-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "24/7 on-site security",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "ammonia leak detector added to PRV vent line, upgrades to electronic badge control system",
              "OpProceduresReviewDate": "2022-07-18 00:00:00",
              "TrainingReviewDate": "2023-10-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2024-02-19 00:00:00",
              "EquipmentInspectionDate": "2023-12-21 00:00:00",
              "EquipmentTested": "compressor annual safety inspections + tests",
              "ChangeMgmtDate": "2024-05-04 00:00:00",
              "ChangeMgmtReviewDate": "2018-05-21 00:00:00",
              "PreStartupReviewDate": "2018-09-14 00:00:00",
              "ComplianceAuditDate": "2022-06-16 00:00:00",
              "AuditCompletionDate": "2023-05-31 00:00:00",
              "IncidentInvestigationDate": "2023-07-01 00:00:00",
              "InvestigationChangeDate": "2023-07-01 00:00:00",
              "ParticipationPlansReviewDate": "2018-07-17 00:00:00",
              "HotWorkPermitReviewDate": "2023-05-30 00:00:00",
              "ContractorSafetyReviewDate": "2024-04-12 00:00:00",
              "ContractorSafetyEvalDate": "2019-03-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000153081,
                  "PreventionProgram3ID": 1000122041,
                  "ProcessChemicalID": 1000178428
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000114512,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-04-01 00:00:00",
    "ERTrainingDate": "2023-11-25 00:00:00",
    "CoordinatingAgencyName": "City of Dinuba Fire Department",
    "CoordinatingAgencyPhone": "5595915931",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000114512,
      "SummaryText": "power outages, etc.  This policy has been coordinated with the local emergency service agencies including:  the Dinuba Fire Department, and the Tulare County Environmental Health Division.\n\nThe facility\u0092s Emergency Action / Response Policy includes the following elements:\n\n  --  Key Facility Personnel and Responsibilities\n  --  Outside Agency Notification Contact Information\n  --  Detailed Action Plans for Internal Departments\n  --  First Aid Procedures\n  --  Emergency Medical Treatment Procedures\n  --  Evacuation Plans + Assembly Areas\n  --  Description for Handling Small Ammonia Releases\n  --  Details of Outside Assistance Available \n  --  Incident Command System\n  --  Initial and Refresher Training\n\nEvacuation drills are also organized and conducted annually by the Safety Department to supplement the training received by all employees at the facility.  As facility management strives to improve safety at the facility, evaluations are documented with suggested improvements, and other observations from the drills.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nRuiz Food Products has worked to address safety issues as they arise in a continued effort to ensure a safe working environment.  Compliance Audits, PHA studies, Mechanical Integrity Inspections, in addition to routine PSM/RMP Meetings have generated recommendations to improve safety and compliance at the facility.  These include enhancing employee training policies, revising standard operating procedures, improving documentation and recordkeeping, and updating preventative maintenance policies, as well as ammonia equipment repairs.\n\nRuiz Food Products, with support from contractors and consultants entrenched in the ammonia refrigeration industry, strives to ensure a safe working environment at the facility for all employees, guests, and visitors.  The facility also plans to improve safety as follows:\n\n  --  Continued involvement of refrigeration and safety personnel in the ongoing development and implementation of the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000114512,
      "SummaryText": "y in the process. The release must have caused at least one of the following: \n\n  --  On-site deaths, injuries, or significant property damage (§68.42(a)); or\n  --  Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\u0094\n\nAn investigation into the facility\u0092s accident history revealed that there have been no significant ammonia releases over the past five years (May 2019 \u0096 May 2024) that exceeded the Federal Reportable Quantity of 100 pounds or the California state requirement mandating immediate reporting of any release or threatened release of a hazardous material.  In addition, there have been no injuries resulting from an ammonia release at the facility.\n\n\nEMERGENCY RESPONSE PROGRAM  \n\nAn emergency planning and response policy has been developed at the Ruiz Food Products facility and is maintained by the Safety department.  It is based on Cal-OSHA\u0092s requirements for Emergency Action Plan (CCR Title 8, Section 3220), as well as EPA\u0092s Emergency Response Plan.\n\nFacility personnel receive annual training regarding the emergency response procedures and the evacuation plan.  In the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger, maintenance personnel, and/or their supervisor.  Maintenance personnel will determine what procedures and personnel are necessary to remedy the problem.  All employees evacuate to the evacuation assembly areas.  Notifications of response agencies as well the Local Emergency Planning Committee (LEPC) is also detailed the Emergency Response policy.  The Ruiz Foods facility also has an established relationship with the local Fire Department who may be called in to assist depending on the scope of an emergency situation.\n\nThe Emergency Plan policy contains procedures detailing how the facility will react to accidental ammonia releases and other emergencies such as fires, earthquakes,"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000114512,
      "SummaryText": "risk management policies.\n  --  Participation of key personnel in industry recommended training classes to ensure the facility is aware of evolving industry standards and techniques used to encourage a safety culture at the facility.\n  --  Conducting routine RMP / PSM meetings to ensure any issues identified by facility personnel, refrigeration contractors, or consultants are discussed and addressed.\n  --  Conducting a Minimum System Safety Evaluation gap assessment associated with the industry recognized standard (IIAR Standard 9) for existing ammonia refrigeration systems.\n  --  Reviewing and auditing the risk management and prevention policies to ensure they are maximizing the facility\u0092s efforts at limiting the risks associated with handling anhydrous ammonia."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000114512,
      "SummaryText": "tion contractor if any conditions are out of range.  The ammonia contractor is also assigned the duties for monthly, semi-annual, and annual preventative maintenance tasks and service.\n\nThe Ruiz Food Products ammonia refrigeration system has many safety design features including ammonia leak detectors, microprocessor controlled compressors with automatic safety cutouts, ASME certified pressure vessels, emergency stop controls, and an Emergency Refrigerant Control Box.  In addition, all pressure-rated vessels are equipped with mechanical pressure relief valves that automatically engage in case of a high pressure situation to ensure the integrity of the vessel and associated piping is protected.  Any ammonia that vents from a pressure relief valve is neutralized in the Water Diffusion Tank.\n\nMuch of the safety of the refrigeration system is inherent in the policies and procedures that govern the operation of the system.  In addition to routine patrols and inspections at the facility by the security company, the facility has Maintenance / Refrigeration personnel on-site 24/7 who monitor for any abnormal conditions.  The Ruiz Food Products ammonia refrigeration system was designed and constructed in accordance with the recognized industry codes and standards, which specifically detail requirements for safety features.\n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the system are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to the refrigerant in a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks / unanticipated ammonia odors are noted and repaired immediately.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nEPA\u0092s RMP regulation defines \u0093accident\u0094 as the following: \n\n\u0093The release must be from a covered process and involve a regulated substance held above its threshold quantit"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000114512,
      "SummaryText": "onia Refrigeration Contractor, and a Risk Management Consultant) help to ensure the appropriate and ongoing implementation (with recordkeeping) of the various elements of the programs.  PSM Team Meetings include discussions regarding outstanding corrective action items, planned design changes to the ammonia system (if any), changes in personnel, reviewing evacuation drill results, etc.  Any significant issues that are identified are brought to plant leadership to ensure appropriate resources are allocated for timely resolutions.\n\nThe ultimate goal for Ruiz Food\u0092s PSM/RMP plan is to prevent accidental releases of ammonia, injuries / illnesses, and to avoid adverse impacts to the environment.  These programs enable our facility to operate the refrigeration system safely because they are based on the rules, procedures, and guidelines that govern our ammonia refrigeration system, as well as the broader ammonia refrigeration industry throughout the country.  In the event of an ammonia release, the emergency response plan is coordinated with the local Fire Departments and Hazardous Materials Response teams.\n\nThe ammonia refrigeration system and the associated safety features were designed in accordance with contemporary codes and standards.  The RMP responsible personnel (with guidance from contractors and consultants) also routinely review Recognized and Generally Accepted Good Engineering Practices (RAGAGEP) for the ammonia refrigeration industry to ensure that the facility is properly maintained, and appropriate adjustments are made based on evolving industry standards.\n\nOne of the primary policies within the RMP & PSM programs is the Mechanical Integrity program that details the prescribed inspections / testing / and maintenance tasks that are conducted on all refrigeration system components + auxiliary systems.  The facility utilizes in-house Refrigeration Mechanics for Daily Ammonia System Rounds (w/ log sheet) to monitor system parameters and to alert the refrigera"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000114512,
      "SummaryText": "atmosphere.  When heat is absorbed by the liquid ammonia, it vaporizes (changes phase), and is then compressed by the compressors.  The resulting high pressure ammonia vapor is routed to the condensers (outside), where fans and sprayed water are used to reject latent heat in the ammonia vapor to the atmosphere, causing the ammonia to condense to a high pressure liquid, which drains back into the high pressure vessels.\n\nMultiple auxiliary systems are in place to support the operational and safety requirements of the ammonia refrigeration system including:  ammonia leak detection, pressure relief system w/ water diffusion tank, emergency refrigerant control box, auto purger to remove non-condensible gasses, and a refrigeration control system.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nTo deal with the risks involved with ammonia refrigeration, policies and programs have been developed for the Ruiz Food Products facility to limit the risks of an accidental ammonia release and/or minimize the consequences of a significant ammonia release, fires, explosions, and other types of catastrophic accidents.\n\nPolicies developed for the PSM and RMP programs include employee participation, process safety information, process hazard analysis, standard operating procedures, training, management of change + pre-startup safety review, mechanical integrity (inspections / testing / maintenance), hot work permit, contractor management, and incident investigation.  To help coordinate the various elements of the program, a management system has been established that defines responsible parties for the facility to ensure upkeep and implementation of each policy within the RMP and PSM programs.  Compliance Audits are also conducted every 3 years that can identify potential gaps in compliance and recommend actions to achieve full compliance.\n\nSeveral departments within the facility (Refrigeration, Maintenance, and Safety) as well as outside resources (Amm"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000114512,
      "SummaryText": "ARP) program (CCR Title 19, Division 5, Chapter 2).  The Safety + Refrigeration / Maintenance Departments have the primary responsibilities for implementation of the RMP and PSM policies aimed at reducing the hazards associated with the ammonia refrigeration system.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Ruiz Food Products facility is located at 501 South Alta Avenue, in Dinuba, California, and opened in the early 1990s as a food manufacturing plant.  The facility is located southwest of downtown Dinuba.  The area to the northeast of the facility is urban with a mixture of commercial and residential zones, and the land to the southwest of the facility is mostly rural farmland.\n\nThe regulated substance onsite at Ruiz Food Products is anhydrous ammonia with a maximum intended inventory of approximately 75,000 pounds.   The ammonia refrigeration system is a closed-loop cycle with no planned or anticipated emissions of ammonia, and is used for refrigeration associated with the production and cold storage of Mexican food products.\n\nThe accidental release prevention program starts with good operating and manufacturing practices.  All ammonia process equipment, piping, and valves are inspected and maintained on a regular schedule in accordance with manufacturer and industry recommendations.\n\nRefrigeration process equipment at the plant operates continuously based on operational + temperature demands.  One machinery room + refrigeration annex (outdoor) equipment area house the primary equipment including compressors, recirculator packages, accumulator vessels, and auxiliary components, while the condensers are located outside the machinery room.  The evaporators, freezers, and chillers are located throughout the facility at / near each refrigerated zone (independently temperature controlled).\n\nAmmonia is used as the primary refrigerant, which means it is used as a vehicle to move heat from product, secondary coolants (glycol), and cold storage rooms to the outside"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000114512,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nRuiz Food Products, Inc. recognizes the company\u0092s responsibility in ensuring the safety of the public, its employees, the environment, equipment, and property.  This commitment is reflected in a comprehensive accidental release prevention program that addresses the design, installation, operation, maintenance, and employee training associated with the ammonia refrigeration system at the Ruiz Food Products facility in Dinuba, California.\n\nIt is the policy of Ruiz Food Products to ensure that controls are in place to limit the risks of potential ammonia releases.  To accomplish the company\u0092s goal in minimizing accidental losses, the company has established safety programs that enable facility personnel to: maximize safety performance, reduce risks of handling ammonia and other potentially hazardous substances, and prepare facility personnel to address emergency situations as they might arise.\n\nRuiz Food Products draws from several sources and decades of experience + expertise to ensure that the appropriate mitigation measures have been identified and are implemented.  Internal facility personnel with decades of collective experience, the resources of a professional refrigeration contractor, in addition to external risk management consultants all provide guidance to limit the risks of handling ammonia.  The commitment to safety shows in the minimal accident history at the facility.\n\nOne of the activities associated with the facility\u0092s safety program has been the development and implementation of accidental release prevention and emergency response programs which are designed to comply with Cal-OSHA\u0092s Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, CCR Title 8 5189), EPA\u0092s Risk Management Program (RM program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68), and the California Accidental Release Prevention (Cal"
    }
  ]
}