{
  "FacilityID": 1000004719,
  "FacilityName": "Wastewater Treatment Plant",
  "FacilityStr1": "401 Grant Lane",
  "FacilityStr2": null,
  "FacilityCity": "Paragould",
  "FacilityState": "AR",
  "FacilityZipCode": "72450",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05055",
  "LEPC": "Greene LEPC",
  "FacilityLatDecDegs": "36.033056",
  "FacilityLongDecDegs": "-090.492778",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.paragould.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Paragould Light and Water Commission",
  "Company2Name": null,
  "CompanyDUNS": 83273995,
  "Company2DUNS": 83273995,
  "OperatorName": "Paragould Light & Water Commission",
  "OperatorStr1": "PO Box 9",
  "OperatorStr2": "1901 Jones Road",
  "OperatorCity": "Paragould",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72451",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bill Fisher",
  "RMPTitle": "General Manager & CEO",
  "FTE": 8,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000078364",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-09-16 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-09-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2016-07-01 00:00:00",
  "DeRegistrationEffectiveDate": "2016-06-23 00:00:00",
  "AnniversaryDate": "2014-06-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.03806,
  "FRS_Long": -90.48972,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000005727,
      "AltID": "Effluent Disinfection",
      "FacilityID": 1000004719,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000005954,
          "ProcessID": 1000005727,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000006410,
          "ProcessID": 1000005727,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000506410,
          "ProcessID": 1000005727,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000005728,
      "AltID": "Effluent De-chlorination",
      "FacilityID": 1000004719,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000005955,
          "ProcessID": 1000005728,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000006411,
          "ProcessID": 1000005728,
          "ChemicalID": 49,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000506411,
          "ProcessID": 1000005728,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000004719,
      "SummaryText": "Paragould Light, Water, and Cable\nWastewater TREATMENT PLANT\nRISK MANAGEMENT PROGRAM\nEXECUTIVE SUMMARY\n\n\n1.0    Accidental Release Prevention and Emergency Response Policies\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant is committed to the safety of our workers, the public, and the environment.  The resources invested in the prevention of accidental releases of hazardous substances demonstrate this commitment.  The Paragould Light, Water, and Cable Wastewater Treatment Plant implements reasonable controls, such as training of personnel and the safe design, installation, operation and maintenance of our processes.  Our policy is to make every effort to prevent the release of hazardous substances but in the event of a release, our trained personnel and local emergency response agencies will respond to control and contain the release in a manner that will be safe for workers and will help prevent injuries to the public or the environment.\n\n\n2.0    Description of the Paragould Light, Water, and Cable Wastewater Treatment Plant and Regulated Substances\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant handles two substances regulated by the Risk Management Plan Rule (RMP Rule) in quantities above the Threshold Quantity.  These substances are:\n\n* Chlorine - stored in 1 ton cylinders and used for disinfection of the wastewater prior to release into the receiving stream.\n* Sulfur dioxide (anhydrous) - stored in 1 ton cylinders and used to remove the chlorine from the treated wastewater before release into the receiving stream\n\n\n3.0    Hazard Assessment\n \nThe RMP Rule requires The Paragould Light, Water, and Cable Wastewater Treatment Plant to perform a Hazard Assessment of the regulated substances stored and used in the covered processes at the facility.  This Hazard Assessment includes an offsite consequence analysis for the following scenarios:\n \n* One worst-case and one alternative release scenario for the toxic substance chlorine for the chlor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000004719,
      "SummaryText": "ination process unit at the facility.\n* One worst-case and one alternative release scenario for the toxic substance sulfur dioxide for the sulfonation process unit at the facility.\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant completed a Hazard Assessment for the covered processes and the results have been appropriately communicated to the local emergency response agencies. The Hazard Assessment has been recently updated to reflect changes in population.\n\n\n4.0    Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nThe RMP Rule requires that a prevention program be established for the Paragould Light, Water, and Cable Wastewater Treatment Plant chlorination and sulfonation processes.  The following details the prevention program elements at the Paragould Light, Water, and Cable Wastewater Treatment Plant that apply to these processes.\n\n4.1    Safety Information\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant maintains a variety of technical documents that are used to help ensure safe operation of the Paragould Light, Water, and Cable Wastewater Treatment Plant processes.  Material safety data sheets (MSDSs) document the physical and chemical properties of hazardous substances handled at the Paragould Light, Water, and Cable Wastewater Treatment Plant, including the chlorine and sulfur dioxide in the covered processes.  The engineering design documents include the operating parameters, the design basis and configuration of the equipment in each covered process, and references to applicable codes and standards.\n\n\n4.2    Hazard Review\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant performs and periodically updates hazard reviews of the covered processes to help identify and control process hazards.  Checklists are used to guide the hazard review.  These checklists include items to help ensure the Paragould Light, Water, and Cable Wastewater Treatment Plant operates and maintains the equipment in "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000004719,
      "SummaryText": "a manner consistent with the applicable design specifications, codes, standards, and regulations.\n\n4.3    Operating Procedures\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant develops and maintains operating procedures to define how tasks related to process operations should be performed.  The operating procedures are used to:\n\n1. train employees and contractors, and\n2. serve as reference guides for appropriate actions to take during both normal and abnormal process conditions.\n\n4.4    Training\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant trains personnel in the operating procedures to help ensure safe and effective performance of their assigned tasks. A record of all training is maintained to help ensure new and refresher training is provided on a timely basis.\n\n4.5    Maintenance\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant properly maintains the equipment in our processes.  The Paragould Light, Water, and Cable Wastewater Treatment Plant maintenance program includes:\n\n1. procedures to safely guide workers in their maintenance tasks,\n2. worker training in the maintenance procedures, and\n3. inspection and testing program to help identify equipment deterioration and damage before equipment fails.\n\n4.6    Compliance Audits\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant performs periodic (at least every three years) audits of covered processes to verify the processes are operating in compliance with the requirements of the RMP Rule.  A compliance audit report is prepared after each audit, and any deficiencies noted by the audit are corrected in a timely manner.\n\n\n4.7    Incident Investigations\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment.  The Paragould Light, Water, and Cable Wastewater Treatment Plant trains employees to identify and report any and all inci"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000004719,
      "SummaryText": "dents requiring investigation.  An investigation team is assembled and the investigation is initiated within 48 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n4.8    Chemical-specific Prevention Steps - Chlorine and Sulfur Dioxide\n\nIndustry standards are followed at the Paragould Light, Water, and Cable Wastewater Treatment Plant to help ensure safe handling of chlorine and sulfur dioxide.  The vendor supplies chlorine and sulfur dioxide via a Department of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, Compressed Gas Association, American Water Works Association, ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to the guidelines required by the Paragould Light, Water, and Cable Wastewater Treatment Plant.\n\n\n5.0    Five Year Accident History\n\nThere has been no accidents or incidents that resulted in injuries to employee, the public, or the environment The Paragould Light, Water, and Cable Wastewater Treatment Plant in the past five years.\n\n\n6.0    Emergency Response Programs\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant has prepared a written emergency response plan that complies with the RMP Rule, other federal standards and industry guidelines.  This plan has been communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  The Paragould Light, Water, and Cable Wastewater Treatment Plant periodically conducts emergency drills to test our emergency plan and coordinate these drills with the local fire department.\n\n\n7.0    Planned Changes to Improve Safety\n\nThe Paragould Light, Water, and Cable Wastewater Treatment Plant continuous"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000004719,
      "SummaryText": "ly attempts to improve the safety of our processes to protect our employees, the public and the environment.  The Paragould Light, Water, and Cable Wastewater Treatment Plant incident investigations, employee suggestions and improvements in technology are utilized to update the safety aspects of the processes.  The following changes to improve process safety are planned or have recently been completed.\n\n1. Implement a chlorine and sulfur dioxide shipment Quality Assurance Program to aid in the inspection of chlorine and sulfur dioxide cylinders when received, and\n2. Implement a preventive maintenance program for the hoists and gas detectors used in the processes.\n\n\n\n\n\n\n"
    }
  ]
}