{
  "FacilityID": 1000097365,
  "FacilityName": "CTI Foods",
  "FacilityStr1": "504 Sansom Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Saginaw",
  "FacilityState": "TX",
  "FacilityZipCode": "76179",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.852948",
  "FacilityLongDecDegs": "-97.354016",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PU",
  "FacilityURL": "www.ctifoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "CTI Foods Holding Company",
  "OperatorStr1": "504 Sansom Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Saginaw",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76179",
  "OperatorZipCodeExt": null,
  "FTE": 475,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000212548",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-04-21 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-04-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-11-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-11-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-11-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 32.85539,
  "FRS_Long": -97.354521,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000120573,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000097365,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000150835,
          "ProcessID": 1000120573,
          "ChemicalID": 56,
          "Quantity": 52000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000121946,
          "ProcessID": 1000120573,
          "NAICSCode": "311991",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000103500,
              "Process_NAICS_ID": 1000121946,
              "SafetyReviewDate": "2021-02-23 00:00:00",
              "PHA_Date": "2022-05-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-01-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": "Emergency Pressure Control System (EPCS) - Equalizes system pressures",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Refrigeration control system closes zones to limit ammonia loss; EPCS - Equalizes system pressures",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Ammonia detectors in the pressure relief vent piping",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Enhancement of preventative maintenance & training policies; updates to emergency action plan",
              "OpProceduresReviewDate": "2020-12-01 00:00:00",
              "TrainingReviewDate": "2017-03-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-05-06 00:00:00",
              "EquipmentInspectionDate": "2021-05-08 00:00:00",
              "EquipmentTested": "Testing of all compressor safeties and all vessel level cutouts",
              "ChangeMgmtDate": "2018-01-24 00:00:00",
              "ChangeMgmtReviewDate": "2020-11-16 00:00:00",
              "PreStartupReviewDate": "2018-01-24 00:00:00",
              "ComplianceAuditDate": "2019-11-14 00:00:00",
              "AuditCompletionDate": "2021-12-31 00:00:00",
              "IncidentInvestigationDate": "2020-10-06 00:00:00",
              "InvestigationChangeDate": "2020-10-08 00:00:00",
              "ParticipationPlansReviewDate": "2019-11-14 00:00:00",
              "HotWorkPermitReviewDate": "2019-11-14 00:00:00",
              "ContractorSafetyReviewDate": "2021-05-08 00:00:00",
              "ContractorSafetyEvalDate": "2020-11-16 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000129899,
                  "PreventionProgram3ID": 1000103500,
                  "ProcessChemicalID": 1000150835
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000097365,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-08-18 00:00:00",
    "ERTrainingDate": "2019-11-14 00:00:00",
    "CoordinatingAgencyName": "Saginaw Fire Department",
    "CoordinatingAgencyPhone": "8172324640",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000097365,
      "SummaryText": "tment are discussed and addressed.\r\n -- Reviewing and auditing the risk management and prevention policies to ensure they are maximizing the facility's efforts at limiting the risks associated with handling anhydrous ammonia."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000097365,
      "SummaryText": "This program has been coordinated with the local emergency services including: Saginaw Fire Department, Fort Worth Fire Department + HazMat Team, and the local county emergency management services agency.\r\n\r\nThe facility's Emergency Action / Response Policy includes the following elements:\r\n\r\n -- Key Plant Personnel and Responsibilities\r\n -- Outside Agency Notification Contact Information\r\n -- Detailed Action Plans for Internal Departments\r\n -- First Aid Procedures\r\n -- Emergency Medical Treatment Procedures\r\n -- Evacuation Plans + Assembly Areas\r\n -- Description for Handling Small Ammonia Releases\r\n -- Details of Outside Assistance Available \r\n -- Incident Command System\r\n -- Initial and Refresher Training\r\n\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe facility has worked to address safety issues as they arise in a continued effort to ensure a safe work environment. Compliance Audits, PHA studies, and Mechanical Integrity Inspections have generated recommendations to improve safety and compliance at the facility.  These include enhancing employee training policies, revising standard operating procedures, improving documentation and recordkeeping, and updating preventative maintenance policies, as well as equipment repairs.\r\n\r\nCorporate CTI Foods representatives also provide guidance and assistance for the facility personnel to ensure outstanding issues are resolved, and that the facility remains in compliance.  CTI Foods also plans to improve safety as follows:\r\n \r\n -- Continued involvement of refrigeration and safety personnel in the ongoing development and implementation of the risk management policies.\r\n -- Participation of key personnel in industry recommended training from organizations to ensure the facility is aware of evolving industry standards and techniques used to encourage a safety culture at the facility.\r\n -- Conducting routine RMP and PSM meetings to ensure any issues identified by refrigeration personnel, contractors, consultants, or the EHS depar"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000097365,
      "SummaryText": "as ammonia is cycled through various stages of liquid and vapor, similar to the refrigerant in a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\r\n\r\n\r\nFIVE-YEAR ACCIDENT HISTORY\r\n\r\nEPA's RMP regulation defines accident as the following: \r\n\r\nThe release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. The release must have caused at least one of the following: \r\n\r\n--  On-site deaths, injuries, or significant property damage (§68.42(a)); or\r\n--  Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\r\n\r\nAn investigation into the facility's accident history revealed that there have been no releases of ammonia over the past five years (November 2016 - November 2021) that meet the EPA reporting criteria for the Five-Year Accident History as specified above.  In addition, there have been no injuries resulting from a release of ammonia.\r\n\r\nContinued safety improvement for the ammonia refrigeration system is a top priority for CTI Foods.  The management plan, internal audits, Process Hazard Analysis studies, as well as our prevention programs are monitored and updated as appropriate to ensure that all elements of our PSM/RMP policy remain accurate and complete.\r\n\r\n\r\nEMERGENCY RESPONSE PROGRAM  \r\n\r\nAn emergency planning and response policy has been developed at the CTI Foods facility and is maintained by the EHS Manager.  It is based on OSHA requirements for Emergency Action Plan (29 CFR 1910.38 and 1910.119) and HAZWOPER (29 CFR 1910.120).  The Emergency Action Plan is detailed in the Emergency Planning and Response section of the PSM/RMP document which is maintained by the EHS Manager at the facility.\r\n\r\nThis program contains procedures detailing how the facility will respond to accidental ammonia releases and other emergencies."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000097365,
      "SummaryText": "us elements of the program, a management system has been established that defines responsible parties at the plant for each element of the facility's PSM / RMP program.  Compliance Audits are also conducted every 3 years that can identify potential compliance issues and recommend actions to achieve full compliance.\r\n\r\nIn the event of an ammonia release, the emergency response plan is coordinated with the local emergency planning commission (LEPC) and the local Fire Department.  The ultimate goal for CTI Foods' PSM/RMP plan is to prevent accidental releases of ammonia, injuries / illnesses, and to avoid physical damage to the environment.  These programs enable our facility to operate a refrigeration system safely because they are based on the rules, procedures, and guidelines that govern our network of ammonia refrigeration facilities, as well as the ammonia refrigeration industry.\r\n\r\nThe CTI Foods ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  The CTI Foods facility, including the ammonia system, was designed and constructed in accordance with the recognized industry codes and standards, which specifically outline requirements for the design and operation of ammonia refrigeration systems.  Safety features include ammonia leak detectors in the machinery room, continuous automated ventilation, microprocessor controlled compressors with automatic safety cutouts, ASME certified pressure vessels, and emergency stop controls.  The majority of the ammonia inventory is centrally located inside the machine room.  All pressure-rated vessels are equipped with pressure relief valves that automatically engage in case of a high pressure situation to protect the vessel's integrity.\r\n\r\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes,"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000097365,
      "SummaryText": "ycle on and off to address system heat load demands during operation.  The machinery room houses the compressors, recirculator packages, and auxiliary components, while the condensers are located on the roof along with evaporator valve groups and air handling units.\r\n\r\nAmmonia is used as the primary refrigerant, which means it is used as a vehicle to move heat from cold storage zones, product freezers, and secondary coolants (glycol) to the outside atmosphere.  When heat is absorbed by the liquid ammonia, it vaporizes (changes phase), and is then compressed by the compressors.  The resulting high pressure ammonia vapor is routed to the condensers, where fans and sprayed water are used to reject latent heat in the ammonia vapor, causing it to condense to a liquid.\r\n\r\nMultiple pump recirculator packages at different temperatures / pressures are utilized for the various refrigerated zones at the facility that include spiral freezers for product, and cold storage evaporators ranging from freezer storage rooms to dock applications.\r\n\r\nMultiple auxiliary systems are in place to support the operational and safety requirements of the ammonia system including:  ammonia leak detection, auto purger to remove non-condensible gasses, pressure relief system, and refrigeration control system.\r\n\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nTo deal with the risks involved with ammonia refrigeration, policies and programs have been developed to limit the risks of an accidental ammonia release and/or minimize the consequences of a significant release, fires, explosions, and other types of catastrophic accidents.\r\n\r\nPrograms developed for the PSM/RMP programs include employee participation, process safety information, process hazard analysis, pre-startup safety review, standard operating procedures, training, management of change, mechanical integrity, hot work permit, contractor management, and incident investigation.  To help coordinate the vario"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000097365,
      "SummaryText": "LATED SUBSTANCE\r\n\r\nThe CTI Foods - Texas Soups facility was commissioned in October 2010 and is located approximately 1 mile north of the Interstate 820 freeway and 2.5 miles east of the Interstate 35W freeway.\r\n\r\nCTI Foods manufactures, packages, and distributes food products and uses the anhydrous ammonia refrigeration system (closed-loop process) for cold storage, plant cooling, and product freezers.  The maximum intended inventory of ammonia at the facility is approximately 50,800 pounds.\r\n\r\nThe accidental release prevention program starts with good operating and manufacturing practices.  All ammonia process equipment, piping, and valves are inspected on a regular schedule in accordance with manufacturer and industry recommendations.\r\n\r\nFor example, all compressors are routinely inspected for oil leaks, pressure and temperature gauge calibrations, vibration analysis, oil pressure, and amp reading for motors;  alignment of compressor motors and bearings, filter changes, vibration readings and sensor calibrations are performed every 6 months;  the condensers are inspected weekly (this includes checking and cleaning nozzles and strainers), motors are greased, fans are checked for cracks, and piping is inspected for leaks;  low and intermediate pressure receiver oil pots are drained, pump pressures are recorded and pumps and valves are defrosted for excessive ice build-up;  visual inspection for equipment and vessel operating limit conditions, piping and valves are assessed for leaks, integrity, and other potential abnormalities on daily basis;  pressure relief valves are replaced on a five year frequency.  Ammonia leak detectors are calibrated semi-annually and trigger local audible and visual alarms for plant operators.  Machinery room ventilation systems operate continuously and are designed for exhaust rates which exceed the emergency exhaust requirements.\r\n\r\nRefrigeration process equipment at the facility operates continuously.  The compressors and condensers c"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000097365,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nCTI Foods recognizes the facility's responsibility in protecting the public, its employees, the environment, equipment, and property.  CTI Foods is strongly committed to employee, public and environmental safety.  This commitment is reflected in a comprehensive accidental release prevention program.  This program addresses the design, installation, operation, maintenance, and employee training associated with the ammonia refrigeration equipment at CTI Foods. \r\n\r\nIt is CTI Foods' policy to ensure that controls are in place to limit the risks of potential ammonia releases.  To accomplish the company's goal in controlling accidental losses, the facility has established safety programs that enable plant personnel to: maximize safety performance, reduce risks of handling ammonia and other potentially hazardous substances, and prepare plant personnel to address emergency situations as they might arise.\r\n\r\nThe CTI Foods facility draws from decades of internal experience and expertise, as well as resources of our parent company, CTI Foods, to ensure that the appropriate mitigation measures have been identified and are implemented.  The commitment to safety shows in the minimal accident history at the facility.\r\n\r\nOne of the activities associated with the plant's safety program has been the development and implementation of accidental release prevention and emergency response programs which are designed to comply with OSHA's Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals, 29 CFR 1910.119), and EPA's Risk Management Program (RM program) regulation (Risk Management Programs for Chemical Accidental Release Prevention, 40 CFR Part 68).  The Corporate PSM Environmental Manager and the EHS Manager are responsible for implementation of the PSM and RMP policies aimed at reducing the risks associated with the ammonia refrigeration system.\r\n\r\n\r\nSTATIONARY SOURCE AND REGU"
    }
  ]
}