{
  "FacilityID": 1000089428,
  "FacilityName": "Flint Hills Resources Houston Chemical Plant",
  "FacilityStr1": "9822 La Porte Freeway",
  "FacilityStr2": null,
  "FacilityCity": "Houston",
  "FacilityState": "TX",
  "FacilityZipCode": "77017",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Harris County/Houston LEPC",
  "FacilityLatDecDegs": "29.706022",
  "FacilityLongDecDegs": "-95.251033",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": "deanna.altenhoff@kochps.com",
  "FacilityDUNS": 827445292,
  "ParentCompanyName": "Flint Hills Resources Houston Chemical, LLC",
  "Company2Name": null,
  "CompanyDUNS": 102756447,
  "Company2DUNS": 0,
  "OperatorName": "FHR Houston Chemical, LLC",
  "OperatorStr1": "9822 La Porte Freeway",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77017",
  "OperatorZipCodeExt": null,
  "RMPContact": "Richard A. Wood",
  "RMPTitle": "Health, Safety and Security Manager",
  "FTE": 100,
  "OtherEPAFacilityID": "77017MBLCH9822L",
  "EPAFacilityID": "100000211825",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "O1251",
  "SafetyInspectionDate": "2018-10-15 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-08-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-08-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-08-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-08-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000111197,
      "AltID": "Propane Dehydrogenation",
      "FacilityID": 1000089428,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000112488,
          "ProcessID": 1000111197,
          "NAICSCode": "32511",
          "_desc": {
            "NAICS_CODE": "32511",
            "NAICS_DESCRIPTION": "Petrochemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000138880,
          "ProcessID": 1000111197,
          "ChemicalID": 57,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000138936,
          "ProcessID": 1000111197,
          "ChemicalID": 155,
          "Quantity": 2052000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000122745,
              "ProcessChemicalID": 1000138936,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000122746,
              "ProcessChemicalID": 1000138936,
              "ChemicalID": 129,
              "_chemical": {
                "ChemicalID": 129,
                "ChemicalName": "Propylene  [1-Propene]",
                "CASNumber": "115-07-1",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000122747,
              "ProcessChemicalID": 1000138936,
              "ChemicalID": 131,
              "_chemical": {
                "ChemicalID": 131,
                "ChemicalName": "2-Methylpropene  [1-Propene, 2-methyl-]",
                "CASNumber": "115-11-7",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000122748,
              "ProcessChemicalID": 1000138936,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000638880,
          "ProcessID": 1000111197,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000638936,
          "ProcessID": 1000111197,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000089428,
      "SummaryText": "INTRODUCTION\n\n\n\nFlint Hills Resources (FHR) Houston Chemical, LLC operates the FHR Houston Chemical Plant in Houston, Texas. The plant converts propane into propylene using propane dehydrogenation technology. Located on the Houston Ship channel, the plant is in close proximity to one third of the U.S. propylene consumption and the largest global exchange point of propylene.\n\n\n\nRISK MANAGEMENT PROGRAM\n\n\n\nFlint Hills Resources Houston Chemical Plant maximum inventory of the RMP regulated flammable substances, and the RMP regulated toxic substance are above the RMP threshold quantities. Therefore, this site is required to maintain a Risk Management Plan (RMP) (Program Level 3). These RMP regulated substances are consumed, used, or manufactured in the dehydrogenation of propane to propylene. At any one time, the maximum amounts of the RMP regulated substances are: flammable mixture - 2,052,000 lbs., and aqueous ammonia (30%) - 130,000 lbs. The flammable mixture contains the following substances above 1 wt.%: Propane, Propylene, I-butane and I-butylene.\n\n\n\nIn updating its RMP, FHR Houston Chemical Plant has conducted an analysis of potential offsite consequences of accidental releases of both RMP regulated flammable and RMP regulated toxic substances present above threshold quantities. This includes a worst-case and alternative case release scenario for regulated toxic and regulated flammable substances. This RMP update is based on the current operating conditions and process equipment and uses current census data available for impact to public and environmental receptors.\n\n\n\nPREVENTION PROGRAMS\n\n\n\nThe FHR Houston Chemical Plant is covered by the OSHA PSM rule, and the EPA RMP rule. In RMP Section 7: Prevention Programs, the relevant dates were updated as of 08/15/2020 when the RMP update was prepared. The site has a number of prevention programs to ensure the safety of its workers and the community it operates in: \n\n\n\nProcess Safety Information - The site maintains safe"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000089428,
      "SummaryText": "ty information including piping and instrument drawings, SDS/HSDS's, maximum inventories of equipment, safe operating limits, and equipment specifications. This information allows any employee involved with the process to understand the hazards associated with operating the process.\n\n\n\nHazard Reviews - The site performs process hazard analysis using HAZOP and LOPA methodologies for the covered process within a 5-year time frame, and for changes affecting the process.\n\n\n\nOperating Procedures - The site maintains operating procedures for applicable operating phases, which include safe upper and lower operating limits as well as consequences of deviation.\n\n\n\nMaintenance/Mechanical Integrity - Procedures are in place and are updated to ensure the mechanical integrity of process equipment. Employees and contractors are trained in the potential hazards of the process. Testing and inspections are performed in a timely manner and follow RAGAGEP principles. FHR Houston Chemical plant follows applicable recommendations of API, as well as generally accepted engineering practices for design, installation, inspection and operation of process equipment and piping.\n\n\n\nWork Permit Safety Procedures - Cold Work, Hot Work, Line Breaking, Confined Space Entry and Soil Excavation/Penetration. These procedures contain a requirement for periodic field audits to verify the practice in the field meets procedure requirements. These procedures also have a review cycle.\n\n\n\nIncident Reporting/Investigation - The site has a process for reporting incidents. Incidents are reviewed with staff and supervisors daily. Root cause investigations are conducted for significant incidents (i.e. OSHA recordable injury, mechanical failures resulting in equipment damage or possible loss of containment of process materials/chemicals) and significant near miss incidents to prevent the incident from reoccurring.\n\n\n\nTraining - Training processes are in place to ensure operations personnel are adequately trained a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000089428,
      "SummaryText": "nd qualified/certified for the jobs they perform. Periodic refresher training is required. Maintenance of certification is required.\n\n\n\nInspection - The plant has a Facilities Inspection/Housekeeping Safety Procedure. The procedure contains checklists for various areas, i.e. Process and Storage Areas, Maintenance Shops, Roads and Grounds, Laboratory, Control room and Offices. Representatives from the functional groups are required to participate in the inspections. Action items/findings are tracked to completion.\n\n\n\nManagement of Change- The plant has an MOC process that manages changes to the process, equipment, piping, staffing, training, etc. The plant uses a document/information management system to control the MOC documentation, approval, and change implementation process.\n\n\n\nSafety Policy - The plant has a Safety Policy whereby the management states their commitment to providing a safe and healthy workplace. The safety policy also defines the responsibilities of supervisors, company employees and contractors regarding safety performance, behaviors, and non-compliance consequences.\n\n\n\nAccident Prevention Program - The plant has an accident prevention program. The program establishes responsibilities for accident prevention through fundamental Health & Safety Management. The program defines responsibilities of supervisors, company employees and the Health and Safety Staff.\n\n\n\nEMERGENCY RESPONSE\n\n\n\nEmergency response plans are in place to contain or mitigate hazardous substances should an accidental release occur. The emergency response activities are in coordination with the Greater Houston Local Emergency Planning Committee.\n\n\n\nCOMMITMENT TO SAFETY AND OUR COMMUNITY\n\n\n\nFlint Hills Resources Houston Chemical, LLC is an active member of the Houston Community Advisory Panel (HCAP). The HCAP is comprised of community residents, business people, teachers, etc. The HCAP meets monthly and participating industry representatives provide safety performance information, e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000089428,
      "SummaryText": "nvironmental information, facility operating conditions, business updates, etc. to the HCAP. Participating companies are committed to open, frank dialogue with the community members. Flint Hills Resources Houston Chemical plant follows applicable recommendations of API, as well as generally accepted engineering practices for process equipment and piping mechanical integrity inspections to ensure safety of its personnel and community. Flint Hills Resources integrates environmental, health and safety initiatives into its employee culture through a clear vision for excellence and principles of operation that demand safe and environmentally responsible decisions and actions. That dedication extends outside its facility as well. Flint Hills Resources' commitment to performance and EH&S excellence means working to prevent.\n\n"
    }
  ]
}