{
  "FacilityID": 1000043003,
  "FacilityName": "Target FDC T3899",
  "FacilityStr1": "2245 W Renaissance Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Rialto",
  "FacilityState": "CA",
  "FacilityZipCode": "92376",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06071",
  "LEPC": "San Bernardino County Fire Dep",
  "FacilityLatDecDegs": "34.13437",
  "FacilityLongDecDegs": "-117.41663",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Target",
  "OperatorStr1": "1000 Nicollet Mall",
  "OperatorStr2": null,
  "OperatorCity": "Minneapolis",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "55403",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": "CAR000239343",
  "EPAFacilityID": "100000224125",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-12-31 00:00:00",
  "SafetyInspectionBy": "Safety Compliance Company",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-05-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-05-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053020,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000043003,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000064345,
          "ProcessID": 1000053020,
          "ChemicalID": 56,
          "Quantity": 44000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000053780,
          "ProcessID": 1000053020,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000044613,
              "Process_NAICS_ID": 1000053780,
              "SafetyReviewDate": "2014-05-20 00:00:00",
              "PHA_Date": "2014-04-03 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-05-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-05-27 00:00:00",
              "TrainingReviewDate": "2014-03-21 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": "Discussion",
              "MaintenanceReviewDate": "2014-04-03 00:00:00",
              "EquipmentInspectionDate": "2014-04-25 00:00:00",
              "EquipmentTested": "all refrigeration equipment",
              "ChangeMgmtDate": "2014-05-27 00:00:00",
              "ChangeMgmtReviewDate": "2014-03-26 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-05-12 00:00:00",
              "HotWorkPermitReviewDate": "2014-04-02 00:00:00",
              "ContractorSafetyReviewDate": "2014-03-10 00:00:00",
              "ContractorSafetyEvalDate": "2014-05-21 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000053657,
                  "PreventionProgram3ID": 1000044613,
                  "ProcessChemicalID": 1000064345
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043003,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-05-15 00:00:00",
    "ERTrainingDate": "2014-05-20 00:00:00",
    "CoordinatingAgencyName": "San Bernardino County Fire Dept.",
    "CoordinatingAgencyPhone": "9093868401",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043003,
      "SummaryText": "Executive Summary\n\nLast Revision Date: May 27, 2014\n\n\n\nTarget Food Distribution Center T3899\n\n2245 W. Renaissance Pkwy, Rialto, CA 92376\n\n\n\nThis facility is a refrigerated warehousing facility owned and operated by Target Corporation for the storage and distribution of perishable and frozen food products. It was constructed for Target Corporation; Target assumed responsibility for the building June 2, 2014. Prior to that date, Ryan Companies managed the construction, startup, daily maintenance, and operation of the facility, including all PSM responsibilities.\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies \n\nTarget is committed to employee, public, and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program, covering design, installation, operating procedures, maintenance, and employee training associated with our regulated process. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Unforeseeably, if such a release does occur, Target has proactively partnered with the Fire Departments of Rialto and San Bernardino County to ensure that properly trained and equipped hazmat responders are available to control and mitigate the effects of a release.  The Process Safety Management Plan is written and executed in accordance to all federal, local, and state regulations.\n\n\n\n2. Stationary Source and Regulated Substances Handled\n\nThis facility is a refrigerated warehouse facility. The vast majority of products stored are refrigerated foods for human consumption and inherently pose no known environmental or safety risks. The RMP regulated substance present at the facility is anhydrous ammonia, utilized as refrigerant in closed-loop refrigeration systems. The entire ammonia inventory is attributed to its use as a refrigerant. \n\n\n\n3. Worst Case Scenario and Alternate Case Scenario \n\nIn a worst case release scenario involving the entire site, release of t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043003,
      "SummaryText": "otal charge from both refrigeration systems needs to be considered for the purposes of this RMP. Information relating to the off-site consequences is located within the Risk Management Program.\n\n\n\n4. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\nNecessary processes to comply with the accidental release prevention requirements set out under 40 CFR Part 68 has been implemented and are ongoing. The facility is also subject to OSHA's PSM standard under 29 CFR 1910.119 and California Title 8, Chapter 4, Section 5189, as well as the EPCRA Section 302 and 311/312 notification/reporting requirements. The following sections briefly describe elements and status for accidental release prevention programs in place at the facility.\n\nProcess Safety Information (PSI):\n\nThe Process Safety Information Guideline and inventory list of necessary documents are in place. This data contains detailed safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the ammonia refrigeration system. Construction documents have been consolidated along with P&IDs, drawings and specifications, ammonia safety data, and equipment manuals. This information will be revised as the ammonia refrigeration system is updated or altered. \n\nProcess Hazard Analysis (PHA):\n\nThe Process Hazard Analysis PSM Guideline and full PHA study was been completed as part of operational transition from Ryan Companies to Target. The methodology used was the What If Scenarios. Representatives from both Target and Ryan Companies, with expertise in refrigeration engineering and operations participated in the studies. The adopted PHA Guideline calls for studies to be reevaluated at a minimum of every five (5) years and any findings related to process hazard analysis studies to be addressed in a timely manner.\n\n\n\nOperating Procedures:\n\nTarget maintains processes for drafting, validating, and maintaining written operating procedures, in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043003,
      "SummaryText": "cluding annual reviews. Safe Operating Procedures are in place that addresses necessary modes of operation including startup, normal operations, emergency operations, normal shutdown, emergency shutdown, and pump out. The information is reviewed and readily accessible to operators involved with the process.\n\n\n\nTraining:\n\nTarget trains all team members working with the ammonia refrigeration systems to increase competence in all relevant operating procedures. Refresher training occurs at a minimum of every three (3) years or more frequently as needed. Additional training is provided to team members responsible for overseeing or executing components of the risk management plan.\n\n\n\nMechanical Integrity:\n\nDocumented maintenance checks are carried out on process equipment to ensure proper operations. Equipment examinations and maintenance operations are being carried out by qualified personnel with previous training in ammonia refrigeration system maintenance practices. Any equipment deficiencies identified by ongoing maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change:\n\nTarget maintains procedures to manage changes in process chemicals, technology, equipment, and procedures. Contractors, maintenance personnel, or any other team member whose job tasks are affected by a system modification are promptly made aware of the change and offered training to understand or handle the change(s).\n\n\n\nPre-Startup Reviews:\n\nPre-start up safety reviews are conducted any time the ammonia refrigeration system or any of its components are opened to atmosphere for repairs, tie-ins, or modifications. These reviews are conducted to confirm that construction complete, documentation accurate, operating procedures in place, training complete, and safety pre-cautions suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits:\n\nCompliance audits are to be conducted out at least every three (3) years and any corrective actions required"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043003,
      "SummaryText": " as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation:\n\nAny incident that has resulted in, or could reasonably result in an unintentional release of ammonia is promptly investigated. These investigations are to identify causal factors leading to incidents, as well as corrective actions implemented to prevent reoccurring or future releases, with reports retained for a minimum of five (5) years.\n\n\n\nEmployee Participation:\n\nTarget believes PSM and accident prevention is team effort. Target encourages team members to express their views concerning accident prevention and recommend improvements. All team members have access to information collected in compliance with the RMP Rule and PSM guideline. \n\n\n\nContractors:\n\nContractors who have the potential to impact the system or its components are evaluated for safety performance. Those contractors are also informed of work rules and hazards that may exist at the Target FDC.  \n\n\n\n5. Five-year Accident History\n\nThere have been no releases, accidents, or near misses that could've resulted in a catastrophic failure or unplanned release of ammonia.\n\n\n\n6. Emergency Action Plan\n\nThe written Emergency Action Plan identifies specific procedures to deal with accidental releases of ammonia. The Emergency Action Plan addresses adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident investigation. The emergency plan has been written in coordination with the San Bernardino County Fire Department.\n\n"
    }
  ]
}