{
  "FacilityID": 1000043633,
  "FacilityName": "SABIC Innovative Plastics - Bay St. Louis",
  "FacilityStr1": "3531 Port & Harbor Dr.",
  "FacilityStr2": "[Port Bienville Industrial Park]",
  "FacilityCity": "Bay St. Louis",
  "FacilityState": "MS",
  "FacilityZipCode": "39520",
  "Facility4DigitZipExt": "3531",
  "FacilityCountyFIPS": "28045",
  "LEPC": "Hancock County LEPC",
  "FacilityLatDecDegs": "30.236944",
  "FacilityLongDecDegs": "-089.511111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sabic.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 614318806,
  "ParentCompanyName": "SABIC US Holdings LP",
  "Company2Name": null,
  "CompanyDUNS": 78612482,
  "Company2DUNS": 0,
  "OperatorName": "SABIC Innovative Plastics US LLC",
  "OperatorStr1": "3531 Port & Harbor Dr.",
  "OperatorStr2": "[Port Bienville Industrial Park]",
  "OperatorCity": "Bay St. Louis",
  "OperatorStateFIPS": "MS",
  "OperatorZipCode": "39520",
  "OperatorZipCodeExt": "3531",
  "RMPContact": "Albert Ragas",
  "RMPTitle": "EHSS Manager",
  "FTE": 99,
  "OtherEPAFacilityID": "39521BRGWRPORTB",
  "EPAFacilityID": "100000046041",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "1000-00007",
  "SafetyInspectionDate": "2012-04-05 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.2369,
  "FRS_Long": -89.5111,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053894,
      "AltID": "SAN Reactor",
      "FacilityID": 1000043633,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054675,
          "ProcessID": 1000053894,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065589,
          "ProcessID": 1000053894,
          "ChemicalID": 25,
          "Quantity": 4100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565589,
          "ProcessID": 1000053894,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000053895,
      "AltID": "SAN Production Lines",
      "FacilityID": 1000043633,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054676,
          "ProcessID": 1000053895,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065590,
          "ProcessID": 1000053895,
          "ChemicalID": 25,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565590,
          "ProcessID": 1000053895,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000053896,
      "AltID": "ABS Production Lines",
      "FacilityID": 1000043633,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054677,
          "ProcessID": 1000053896,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065591,
          "ProcessID": 1000053896,
          "ChemicalID": 25,
          "Quantity": 31000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 25,
            "ChemicalName": "Acrylonitrile  [2-Propenenitrile]",
            "CASNumber": "107-13-1",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565591,
          "ProcessID": 1000053896,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043633,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\n0.1 INTRODUCTION\n\n\n\nThe SABIC Innovative Plastics US LLC (SABIC) facility at Bay St. Louis, Mississippi, which began operations in 1981, is principally engaged in the production of plastic resins. Our products are used in automotive, medical, electronic, computer, and appliance industries, to name a few. In order to ensure quality products, quality service and quality of life, SABIC regularly invests in safety and environmental protection.\n\n\n\nOur company is committed to operating safe and environmentally sound chemical and plastics production facilities everywhere we do business. Protection of our neighbors and workers is the highest priority. This ongoing commitment to worker and public safety is demonstrated through resources invested for safe design, operation, and maintenance of our facilities.\n\n\n\nThis Risk Management Plan is part of SABIC's continuing commitment to minimize the potential impact from our facility on our workers, our community neighbors, and the environment. It is the stated policy of SABIC to safely manage our site operations. In addition, we have prepared contingency plans to be used in the unlikely event that a major accident should occur. The efforts at our Bay St. Louis facility have been recognized by the US Occupational Safety and Health Administration (OSHA), which oversees our programs, as among the best in the nation for worker safety.\n\n\n\nWe believe it is important for all interested parties to have access to information that can help them better understand our business and our facility. If you have any questions regarding this document, or any other aspect of our company, please contact our Community Relations Representative at (228) 466-3047.\n\n\n\n0.2 ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nIn order to provide top-quality products for our customers, the Bay St. Louis facility uses in its manufacturing process a raw material that is classified under the RMP regulation as toxic. We are committ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043633,
      "SummaryText": "ed to complying with governing laws, regulations, and engineering standards, as well as performing systematic assessments to manage and maintain a safe operation. Our operating practices and procedures ensure that numerous controls are implemented to prevent an accidental release of a chemical. However, if a major release does occur, our trained on-site emergency response organization will be activated. This organization includes medical and chemical emergency response teams.\n\n\n\nThe outstanding safety programs at the Bay St. Louis facility have earned OSHA Voluntary Protection Program (VPP) STAR status, presented by the Occupational Safety and Health Administration for exemplary safety management. This is OSHA's highest recognition for safety performance. This OSHA program includes agency revalidation audits every 3-5 years. The Bay St. Louis facility has been an OSHA VPP Star site since 1993 and our most recent OSHA program review was completed in April 2012.\n\n\n\n0.3 DESCRIPTION OF THE FACILITY AND REGULATED SUBSTANCES\n\n\n\nThe Bay St. Louis plant is located in the Port Bienville Industrial Park. The site is on a 530-acre tract on the northern shores of Lake Borgne, about 3 miles southeast of the town of Pearlington, Mississippi. The Bay St. Louis facility uses one chemical that is regulated under the EPA's Risk Management Program (RMP) rule. The chemical is acrylonitrile, a regulated toxic substance. Acrylonitrile is used as a raw material to manufacture our products.\n\n\n\n0.4 GENERAL ACCIDENTAL RELEASE PREVENTION / CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nSABIC has implemented a comprehensive program to prevent accidental releases of highly hazardous chemicals, known as Process Safety Management (PSM). PSM is an integral part of working safely at SABIC facilities. PSM ensures that proper safety information is in place; operating procedures are followed; chemical hazards are identified; employees and contractors are trained; and, critical equipment is properly inspected a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043633,
      "SummaryText": "nd maintained. PSM satisfies the accidental release prevention requirements of the RMP.\n\n\n\nSome of the many, specific safety features to prevent a chemical accident include:\n\n\n\n- Computer-controlled safety systems on our chemical reaction vessels to ensure that any deviations from the intended operating conditions are immediately identified and corrected;\n\n\n\n- Safety procedures that reduce the potential for human error which could lead to a storage tank overfill;\n\n\n\n- Secondary containment dikes around storage tanks to contain a spill;\n\n\n\n- Spill containment around unloading stations to mitigate the impact of a leak;\n\n\n\n- Acrylonitrile barge unloading operations are continuously attended by operators who have received specialized training in US Department of Transportation (DOT) requirements;\n\n\n\n- Extensive safety information about the processes available to employees;\n\n\n\n- Written operating procedures that include emergency response actions;\n\n\n\n- Comprehensive employee and contractor training programs to promote consistently safe work practices;\n\n\n\n- Maintenance programs to ensure ongoing equipment reliability - includes equipment testing and inspection;\n\n\n\n- Safety procedure to review proposed plant modifications before they are implemented for possible hazards (this is called \"Management of Change\");\n\n\n\n- Safety pre-qualification for all contractors;\n\n\n\n- Safety reviews prior to startup of our processes; and,\n\n\n\n- Safety permitting procedures that control hazards during special operations such as welding (Hot Work) and other maintenance activities\n\n\n\n0.5 FIVE YEAR ACCIDENT HISTORY\n\n\n\nThe Bay St. Louis site has an outstanding record of accident prevention, which demonstrates its commitment to public and worker safety. Even minor incidents are investigated to identify what went wrong and to learn how to prevent future occurrences.\n\n\n\nEPA requires that all incidents involving regulated chemicals that resulted in any off-site impact or significant on-site impacts be "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043633,
      "SummaryText": "reported in this document. During the previous five-year period, no such incident occurred at the plant site.\n\n\n\n0.6 EMERGENCY RESPONSE PROGRAM\n\n\n\nThe Bay St. Louis site maintains a written emergency response program designed to protect workers, the public, and the environment in the event of a major accidental release. All of our employees are trained in the proper response to an incident. We also invest in the equipment needed to respond to emergencies, both on-site and off-site. Our trained emergency, medical and chemical response teams work closely with area hospitals, industries, and other response organizations in Hancock County.\n\n\n\nExamples of some of the emergency drills that have been conducted by the site's emergency teams are:\n\n\n\n-  simulated barge incident conducted with site medical, emergency, rescue and Hazmat teams;\n\n\n\n-  simulated chemical tanker truck incident at the plant.\n\n\n\n-  simulated chemical/industrial accident with Hancock Medical Center emergency room and chemical emergency response teams.\n\n\n\n-  simulated response to leaking barges in the waterway where equipment was used to contain the chemical.\n\n\n\nOngoing training exercises are important to the company's emergency response organization and help better prepare our partners in the community for emergency response necessary in the unlikely event of a major industrial incident.\n\n\n\nSABIC personnel have helped develop emergency preparedness plans for Hancock County and surrounding areas. In addition, they are members of local emergency planning and emergency preparedness groups. As is consistent with the Hancock County Emergency Plan, SABIC will work through the Hancock County Sheriff's Department to communicate any appropriate actions to be taken by the public in the event of a chemical emergency.\n\n\n\n0.7 PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nSABIC is committed to continuously improving the overall safety and environmental performance record at the Bay St. Louis facility. Some of the specific p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043633,
      "SummaryText": "lanned changes aimed at improving safety are:\n\n\n\n- Continuing development of best management practices under OSHA's Voluntary Protection Program;\n\n\n\n- Conduct a third-party audit of our Process Safety Management system;\n\n\n\n- Continue using safety risk assessment tools in an effort to reduce human error leading to a workplace injury or an accidental release;\n\n\n\n- Continuing an employee exposure monitoring program for acrylonitrile;\n\n\n\n- Continuing on-site emergency responder drills; and,\n\n\n\n- Continuing to work with the LEPC to develop and drill emergency response scenarios.\n\n"
    }
  ]
}