{
  "FacilityID": 1000055485,
  "FacilityName": "BGMU Water Treatment Plant",
  "FacilityStr1": "16 Chestnut Street",
  "FacilityStr2": "P.O. Box 10300",
  "FacilityCity": "Bowling Green",
  "FacilityState": "KY",
  "FacilityZipCode": "42102",
  "Facility4DigitZipExt": "7300",
  "FacilityCountyFIPS": "21227",
  "LEPC": "Warren County LEPC",
  "FacilityLatDecDegs": "36.999472",
  "FacilityLongDecDegs": "-086.426556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A5",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bgmu.com",
  "FacilityEmailAddress": "mgardner@bgmu.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Bowling Green Municipal Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Bowling Green Municipal Utilities",
  "OperatorStr1": "16 Chestnut Street",
  "OperatorStr2": "P.O. Box 10300",
  "OperatorCity": "Bowling Green",
  "OperatorStateFIPS": "KY",
  "OperatorZipCode": "42102",
  "OperatorZipCodeExt": "7300",
  "FTE": 11,
  "OtherEPAFacilityID": "KY0064513",
  "EPAFacilityID": "100000048539",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-09-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-02-01 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-02-01 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-05-07 00:00:00",
  "DeRegistrationEffectiveDate": "2018-04-27 00:00:00",
  "AnniversaryDate": "2021-02-01 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.99914,
  "FRS_Long": -86.42794,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000069383,
      "AltID": null,
      "FacilityID": 1000055485,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000085640,
          "ProcessID": 1000069383,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000070566,
          "ProcessID": 1000069383,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000058043,
              "Process_NAICS_ID": 1000070566,
              "SafetyReviewDate": "2014-01-29 00:00:00",
              "PHA_Date": "2016-01-26 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-01-26 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": "Fixed and Portable Chlorine Monitors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-12-17 00:00:00",
              "TrainingReviewDate": "2009-01-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-12-17 00:00:00",
              "EquipmentInspectionDate": "2015-08-11 00:00:00",
              "EquipmentTested": "Chlorine Monitors and Chlorinators inspected by outside vendor",
              "ChangeMgmtDate": "2009-01-01 00:00:00",
              "ChangeMgmtReviewDate": "2015-03-10 00:00:00",
              "PreStartupReviewDate": "2009-01-01 00:00:00",
              "ComplianceAuditDate": "2014-11-25 00:00:00",
              "AuditCompletionDate": "2015-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-03-10 00:00:00",
              "HotWorkPermitReviewDate": "2009-06-01 00:00:00",
              "ContractorSafetyReviewDate": "2009-06-01 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000071134,
                  "PreventionProgram3ID": 1000058043,
                  "ProcessChemicalID": 1000085640
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000055485,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2015-08-31 00:00:00",
    "ERTrainingDate": "2015-10-13 00:00:00",
    "CoordinatingAgencyName": "Bowling Green Fire Department",
    "CoordinatingAgencyPhone": "2703924702",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055485,
      "SummaryText": "OVERVIEW OF BGMU SAFETY PROGRAM\n\n\n\nPERSONNEL\n\nBowling Green Municipal Utilities employees a full time Safety Director, Safety Coordinator and two part-time Safety Officers at the Treatment Plants.\n\nThe Safety Director and Safety Coordinator is responsible for the overall development, administration and supervision of activities required by OSHA, EPA, DOT and other federal and state agencies, to safeguard all BGMU employees. The Safety Officers at the Treatment Plants have a primary job consisting in Plant Operations and then secondary as Safety, in which they coordinate all inspections, safety equipment and employee assistance in Safety at the Treatment Plants.\n\n\n\nPROGRAM ADMINISTRATION\n\nBowling Green Municipal Utilities on April 27, 1989 hired a full-time Safety Director so that BGMU could develop and implement a written Safety Program. With that hiring, the major obstacle was achieving compliance in the OSHA, EPA and DOT regulations so that BGMU and all the employees would have a safe and healthful work environment. On March 3, 2008 Bowling Green Municipal Utilities hired a Safety Coordinator to assist the Safety Director with all health and safety issues within the company. To this date the Safety Department now handles all of the compliance programs in the Electric, Water/Wastewater and General Services Divisions, with the only exception being environmental issues that directly involve the Industrial Wastewater Pretreatment Program, which the Industrial Pretreatment Director handles. Bowling Green Municipal Utilities initialized a Accident/Safety Committee on October 26, 1994 starting with a member from each work area for a total of 10 members. This committee reviews accidents/incidents and makes recommendations to submit for the BGMU Managers for their interpretation and implementation.  Bowling Green Municipal Utilities insures that each employee upon being hired has access to the employee handbook through our internal intranet system, in which this book expla"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055485,
      "SummaryText": "ins many benefits, employment rules, insurance plans, work hours and policies.\n\n\n\nTRAINING\n\nBowling Green Municipal Utilities Safety Department develops and conducts monthly safety meetings, which are coordinated with department supervisors, so that employees can attend. The safety meetings that are conducted with the employees range from Hazard Communication, Pole Top/Bucket Rescue, First Aid/CPR to Confined Space training to name a few. A complete list of monthly training is sent to each System Manager three months prior to the beginning of the New Year. The training for each employee is recorded and filed.\n\nBowling Green Municipal Utilities also conducts training sessions with other agencies which include the local Fire Departments, Local Emergency Planning Committees, Emergency Medical Services, local Universities and other Utilities. The training with these agencies proves that BGMU has a good community service orientated background for safety training. These sessions include but are not limited to Electrical Safety, Hazardous Materials, Confined Spaces, Inspections, etc.\n\n\n\nEQUIPMENT\n\nBowling Green Municipal Utilities has established a policy to ensure that the employees and their workplace are in a safe and healthful work environment. BGMU is committed to each employee by providing the employee with certain safety equipment, with a brief list of: safety glasses, hard hats, rain gear, hearing protection, respiratory protection, fall arresting equipment, etc. The Safety Department is constantly reviewing each job function (Hazard Assessments), to ensure that all aspects of health and safety are being provided to BGMU employees.\n\n\n\nREPORTING INJURIES\n\nBowling Green Municipal Utilities is committed to employee health and safety, but due to working conditions that sometimes cannot be controlled, accidents occur. If you should suffer any work-related injury, no matter how minor, it shall be reported to your supervisor immediately. This First Report of Injury should"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055485,
      "SummaryText": " also be reported to the Human Resources Director or Coordinator so the appropriate accident reports can be filled out.\n\nEach employee will also be responsible to fill out Safety Report and Investigation Report to submit to their immediate Supervisor and then it will be submitted to the Department Head.  After they have finished it the report is submitted to the General Manager and then it is routed to the Safety/Accident Committee for their review and recommendation back to BGMU Managers.\n\nGENERAL OVERVIEW\n\nWATER/WASTEWATER DIVISION\n\n\n\nBowling Green Municipal Utilities (BGMU) is a combined municipal utility with water, wastewater, electric and fiber services.  The accompanying organizational chart illustrates the general structure of BGMU's Water/Wastewater Division.  This Emergency Response Plan is prepared by the Water/Wastewater Division for use in the event of a crisis.\n\n\n\nBGMU's Water Treatment Plant serves the potable water supply needs of the city of Bowling Green, KY (KY Permit-PWSID-1140038) and a large portion of Warren County, KY.  BGMU has over 23,315 water service connections (19,928 residential and 3,387 commercial) serving approximately 61,000 people within the city limits of Bowling Green and an addition estimated 80,000 people via master meters.\n\n\n\nThe Water Treatment Plant is located north of downtown Bowling Green, KY at 16 Chestnut Street.  BGMU uses the Big Barren River as their raw water source.  BGMU's Water Treatment Plant provides flocculation, sedimentation, disinfection, filtration and fluoridation processes with a capacity of 30mgd.  The finished product is pumped from the clearwell's to the distribution system.  The average flow per year is 18 million gallons per day.\n\n\n\nThe distribution system consists of 103 miles or 546,603 feet of distribution water mains, 187 miles or 987,213 feet of transmission water mains, over 2300 fire hydrants, over 5,800 water valves, four (4) pumping stations and five (5) above ground level storage tanks.  "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000055485,
      "SummaryText": "The storage tanks have a total capacity of eleven (11) million gallons of water.  The distribution system is designed to provide adequate flow for domestic, industrial and firefighting needs.  The average household uses an estimated 250 gallons a day.\n\n\n\nBGMU's Wastewater Treatment Plant serves the sanitary and industrial wastewater treatment needs of the city of Bowling Green, KY (KY Permit - 0022403) and portions of Warren County, KY.  BGMU has approximately 18,000 wastewater service connections serving approximately 61,000 people within the city limits.  Outside the city limits, various industries and other services in portions of Warren County account for another estimated 38,000 people.\n\n\n\nThe Wastewater Treatment Plant is located northwest of downtown Bowling Green, KY at 1189 Preston Street, adjacent to Hobson Grove Park and Golf Course.  BGMU's Wastewater Treatment Plant utilizes an sequencing batch reactor system.  Discharge goes into the Big Barren River, flowing approximately 800 feet to the rear of the facility.  The average daily flow through the facility is 8 million gallons per day.\n\n\n\nThe wastewater collection system consists of approximately 267 miles of gravity wastewater, 23 miles of force mains, 65 wastewater lift stations and thousands of wastewater manholes.\n\n\n\nThe Water/Wastewater Division has 73 employees with varied and numerous skills.  Many of the supervisors and all stand-by employees have radio-equipped vehicles and/or a portable radio with them at all times.  On a rotating basis, crews, and supervisors are \"subject to call\" for services needed after hours.  In the event of a major emergency involving loss of telephone or radio communications, designated employees have been instructed to report to their normal work area for assignment to the emergency response activities.\n\n\n\nWhile the following Emergency Response Plan is designated to provide detailed resource information to those responding to emergency conditions, it does not give exte"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000055485,
      "SummaryText": "nsive details on exact responses to specific events.  Individual events have infinite variability and plans that are too specific may be useless in response to the event.  The Emergency Response Plan serves as a list of available resources/information and contains general instructions related to select types of emergency events.  More detailed information and instruction for responding to an emergency condition will be provided by Supervision and those directly in charge.\n\n\n\n08/31/2015\n\n\n\n\n\nGENERAL OVERVIEW\n\nELECTRIC DIVISION\n\n\n\nBowling Green Municipal Utilities (BGMU) is a combined municipal utility with electric, water, sewer and fiber services.  The accompanying organizational chart illustrates the general structure of BGMU's Electric Division located in downtown Bowling Green, KY at 801 Center Street.  This Emergency Response Plan is specifically written for use by the Electric Division in the event of a crisis.\n\n\n\nBGMU's Electric Division serves the electrical needs of the city of Bowling Green, KY and a portion of Warren County, KY thru the Kentucky Revised Statutes and the Little TVA Act.  BGMU has approximately 29,000 service connections serving approximately 61,000 people.  This includes approximately 24,400 residential meters and 4,600 commercial institutions.  BGMU is a Tennessee Valley Authority (TVA) Distributor, receiving wholesale power from TVA at 161 KV at three delivery point substations.\n\n\n\nThe distribution system consists of over 267 miles of overhead electrical lines, 78 miles of underground lines.  BGMU also has 13 substations of which three also serve as delivery points and two are dedicated to WKU:\n\n\n\nNo.1        Bowling Green Primary, a 161/69/13 KV station (Delivery Point)\n\nNo.2        South Bowling Green, a 161/69/13 KV station (Delivery Point)\n\nNo.3        North Mill, a 161/69/13 KV station (Delivery Point)\n\nNo.4        Shive Lane, a 69/13 KV station\n\nNo.5        Lover's Lane, a 69/13 KV station\n\nNo.6        Kroger, a 69/13 KV station\n\nNo.7        South Industrial, a 69/13 KV sta"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000055485,
      "SummaryText": "tion\n\nNo.8        Cabell Drive, a 69/13 KV station\n\nNo.9        Forrest Drive, a 69/13 KV station\n\nNo.10        Cave Mill Road, a 69/13 KV station\n\nNo.11        5th and High, a 69/13 KV station\n\nNo.12        Jonesville, a 13/4 KV station (WKU)\n\nNo.13        Campbell Lane, a 69/13 KV station\n\n\n\nThere is one additional 69/13 KV customer owned substation served from BGMU's transmission lines on Industrial Drive.\n\n\n\nThe average daily residential household electrical usage is approximately 45 Kilowatt-hours (KWh's).  Actual use varies from day to day depending on the weather and other usage factors.  The total BGMU system annual electrical usage is approximately 960 million KWh's.  Small Businesses and Residential Customers use approximately 400 million KWh's annually and large commercial industries usage approximately 560 million KWh's.\n\n\n\nThe Electric Division has 109 employees with varied and numerous skills.  Many of the supervisors and all stand-by employees have a radio-equipped vehicle and/or a portable radio with them at all times.  On a rotation basis, crews, and the supervisors are \"subject to call\" for services needed after hours.  In the event of a major emergency involving loss of telephone or radio communications, designated employees have been instructed to report to their normal work areas for assignment to the emergency response activities.\n\n\n\nWhile the following Emergency Response Plan is designated to provide detailed resource information to those responding to emergency conditions, it does not give extensive detail on exact responses to specific events.  Individual events have infinite variability and plans that are too specific may be useless in response to the event.  The Emergency Response Plan serves as a list of available resources/information and contains general instructions related to select type of emergency events.  More detailed information and instruction for responding to an emergency condition will be provided by Supervision and those directly in charge.\n\n\n\n08/31/2015\n\nWAT"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000055485,
      "SummaryText": "ER - WASTEWATER JOB CLASSIFICATIONS\n\n\n\nScott Alexander        Instrumentation/Control Specialist\n\nScot Avery        System Services Foreman\n\nPresley Ayers        Heavy Equipment Operator\n\nKimberly Baez        Administrative Secretary - Treatment Plants\n\nTyler Bailey        Water Treatment Plant Class III\n\nTodd Baize    Pretreatment Assistant Coordinator - W/W Class IV - Class III Water\n\nMitch Blair        Maintenance Technician II\n\nMichael Blankenship    Large Meter Coordinator - Class II Distribution\n\nCasey Brindley        Wastewater Plant Attendant\n\nBecky Brown        GIS Specialist\n\nCharles Bryant        Utility Worker - Class I W/WW - CSE Team\n\nJeff Bullock        Maintenance Technician III - Class II Distribution - Haz Mat Team - CSE Team\n\nBrandon Byard        Maintenance Technician II - Class I Distribution\n\nChad Chaffin        Customer Service Technician - Class IV Distribution\n\nTina Conner        Senior Accountant\n\nSteven Creek        Maintenance Technician III - Safety Team\n\nVictor Davis        Water Treatment Plant Class III\n\nKenneth Denham    Water Treatment Assistant Chief Operator - Class IV\n\nJames Dillon        Water Treatment Plant Class IV - Haz Mat Team\n\nJason Duckett        Safety Coordinator - Safety Team - Haz Mat Team - CSE Team\n\nTony Elrod        Wastewater Treatment Plant - Class II\n\nBrittany Forshee    Administrative Secretary - Engineering\n\nMike Gardner        System Manager - Class IV Water\n\nMichelle Glenn        Payroll Technician\n\nDanny Goad        Warehouse Coordinator\n\nJohn Gott        Water Treatment Plant Chief Chemist - Class III Distribution\n\nEd Grayson        Instrumentation/Control Specialist\n\nBarbara Gray        Customer Service Associate\n\nJeffrey Green        Utility Worker - Class II Distribution - Haz Mat Team - CSE Team\n\nMason Hamilton    Industrial Pretreatment Coordinator - Safety Team - Haz Mat Team - CSE Team\n\nJill Hartley        Human Resources Director\n\nJohnnie Hendrick    Meter Shop Technician\n\nTerry Hendrick    WTP Chief Operator - Class IV Water - Class II Wastewater - Haz Mat Team\n\nDwayne Hines        Collections Systems Maintenance Foreman\n\nPhilip Hunt        GIS Coordinator\n\nAllen Hunter        Wastewater"
    },
    {
      "ESSeqNum": 24,
      "FacilityID": 1000055485,
      "SummaryText": " is a typical fire brigade a HAZMAT team.  A HAZMAT team, however, may be separate component of a fire brigade or fire department.\n\n\n\nThe BGMU Hazardous Materials Team will be responding at a Hazardous Materials Technician Level and Chlorine Specialist Level with an On Scene Incident Commander.  \n\n\n\nThere are several employees that are trained at First Responder Awareness and they include outside employees, water and wastewater operations personnel, office and engineering personnel.\n\n\n\n***ENVIRONMENTAL ACTIVITIES***\n\n\n\nTreatment facility Operator(s) on duty shall monitor and determine the severity of any leak or spill that could result in a hazardous/emergency incident.  All leaks or spills shall be reported to the Chief Operator and Safety Department immediately.  The facilities are occupied and monitored 24 hours a day and 7 days a week.\n\n\n\n***SAFETY/SECURITY***\n\n\n\nIt shall be the responsibility of the BGMU to ensure safety at the site of any emergency.  BGMU shall have the responsibility to ensure total site security.  BGMU Employees, who will not be specifically assigned for HAZMAT, may be utilized as needed for security purposes after non-contaminated areas have been established.  Each facility is fully enclosed with fencing and secured with electric gates that require identification of the entrant.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n***RESERVE TECHNICAL GROUP ***\n\n\n\nMEDICAL:\n\n\n\nMedical Center Ambulance Services        Medical Center of Bowling Green\n\n250 Park Street                    250 Park Street\n\nBowling Green, Kentucky 42101        Bowling Green, Kentucky 42101\n\nPhone:  745-1204 or 911            Emergency Room: 745-1626\n\nContact: Steve Ramsey                Contact: Katrina Wood\n\n\n\nGreenview Hospital of Bowling Green        Urgent Care or Corp Care\n\n1801 Ashley Circle                1225 Fairway Street\n\nBowling Green, Kentucky 42101        Bowling Green, Kentucky 42103\n\nPhone: 793-2185                Phone: 781-3910\n\nContact: Keith Cassady                Contact: Donna Witten\n\n\n\nENGINEERING:\n\nBGMU staff engineers are available as needed as well as beyond BGMU"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000055485,
      "SummaryText": " Treatment Plant Class III\n\nTaylor Hutchinson    Engineering Aide\n\nMark Iverson        General Manager\n\nAndy Johnson        Fire Hydrant Maintenance Technician - Class III Distribution\n\nLisa Johnson        Accounts Payable Technician\n\nWilliam Johnson    Utility Worker - CSE Team\n\nBrett Jones        Project Designer\n\nEddie Jones        Water Treatment Class IV - Class III Dist. - Safety Team - Haz Mat Team\n\nDoug Kimbler        Treatment Plants Superintendent - Class II Wastewater - Haz Mat Team\n\nKevin Kirby        Wastewater Treatment Plant Asst. Chief Operator - Class IV\n\nKevin Lockwood    Electrician - Haz Mat Team - CSE Team\n\nAmila Mahmutovic    Water Treatment Plant Assistant Chief Chemist\n\nHarold Mann        Sewer Services Crew Foreman - Class I Distribution\n\nJody Mann        Human Resources Coordinator\n\nLee McCoy        Water Treatment Plant Class IV - Class III Distribution\n\nChad Morris        Utility Worker\n\nJason Murphy        INI Coordinator - Class IV Dist. - Class IV Collection - Haz Mat Team - CSE Team\n\nScott Neighbors        Project Technician\n\nChad Oliver        Wastewater Treatment Plant - Class III\n\nTrevor Riddle        Wastewater Treatment Plant - Class I\n\nCraig Peay        Safety Director - Safety Team - Haz Mat Team - CSE Team\n\nDoug Roberts        Maintenance Coordinator III -Class III Wastewater-Class II Dist. - Haz Mat Team\n\nTerry Russell        Heavy Equipment Operator\n\nZach Shuffett        Water Treatment Plant Attendant\n\nKyle Skaggs        Heavy Equipment Operator - Class II Distribution\n\nDarren Sledge        New Services Crew Foreman - Class IV Distribution\n\nEric Smith        Utility Worker\n\nJamison Smith        Utility Worker - Class III Distribution\n\nMatt Steele        Heavy Equipment Operator - Class I Dist. - Class I Wastewater - Haz Mat Team\n\nHeather Stringfield    Wastewater Treatment Plant Chief Operator - Class IV W/WW - Class IV Water\n\nRodney Sullivan     Engineering Technician\n\nTonissa Sweat        Managerial Assistant\n\nBenzie Timberlake    Wastewater Treatment Plant Chief Chemist - Class IV\n\nAndrew White        Wastewater Treatment Plant Attendant\n\nDusty White        Water Services Crew Foreman\n\nKeith Williams"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000055485,
      "SummaryText": "        Purchasing Agent\n\nRon Wolf        Crew Superintendent - Class III W/W - Class IV Dist. - Class IV Collection\n\nEmmett Wood        Engineering Superintendent\n\nSteve Wood        Facilities Locator\n\nDaniel Young        Crew Superintendent - Class IV Distribution - Class IV Collection\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAs of 08/31/2015\n\n\n\n\n\n\n\n\n\nBGMU WATER-SEWER DIVISION\n\nEMERGENCY NOTIFICATION PROCEDURES (INTERNAL)\n\n\n\nBGMU Dispatch is responsible for notification of appropriate Supervisors in response to an emergency condition during normal business hours, after hours, and on weekends. In either case, the Dispatcher shall make every attempt to notify the highest-ranking member of the Bowling Green Municipal Utilities Management.  The following list is to be utilized when emergency conditions exist:\n\n\n\nGeneral Manager\n\nMark Iverson\n\nSystems Manager\n\nMike Gardner\n\n\n\nSuperintendent of Treatment Plants\n\nDoug Kimbler\n\n\n\nSafety Director\n\nCraig Peay\n\n\n\nDistribution System                   Wastewater Treatment            Water Treatment\n\n                    \n\nRon Wolf, Crew Supt.            Heather Stringfield, Chief Operator        Terry Hendrick, Chief Operator         \n\n\n\nDaniel Young, Asst. Crew Supt.        Kevin Kirby, Asst. Chief             Kenneth Denham, Asst. Chief\n\n\n\nEmmett Wood, Eng. Supt.        Kevin Lockwood, Maint. Coord.         Kevin Lockwood, Maint. Coord.\n\n\n\nKevin Lockwood, Maint. Coord.    Mason Hamilton, Pretreatment Coord.     John Gott, Chief Chemist\n\n\n\n\n\n\n\nNOTE:  If communication lines (telephone and radios) are inoperable ALL employees furnished with a BGMU vehicle should report to their respective normal work stations for possible assignments and immediately check in with Dispatch.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEMERGENCY NOTIFICATION PROCEDURES (EXTERNAL)\n\n\n\nThe use of external organizations, personnel or consultants shall be at the discretion of the highest ranking member of Bowling Green Municipal Utilities management who is available.  The following listings may be utilized when emergency condit"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000055485,
      "SummaryText": "ions exist.\n\n\n\n    A.    CHEMICAL SUPPLIERS\n\n        \n\n          1.    Brenntag                1-800-950-1727\n\n          2.    S4Water (Brandt Cashion)        (270) 779-9198\n\n          3.    Mississippi Lime Company        1-800-437-5463\n\n          4.    Harcros                          1-800-283-8636\n\n          5.    Carus Chemical                1-800-435-6856\n\n          6.    Hexagon Chemical            (502) 429-8990\n\n          7.    Norit Americas                 1-800-641-9245\n\n          8.    Hercules                          1-800-848-7659\n\n          9.    Airgas                    (270) 842-9486\n\n        10.    Jones Chemical                1-800-245-6637\n\n        \n\n    B.    CONTRACTORS\n\n        \n\n          1.    Scotty's Contracting, Inc.        (270) 781-3998\n\n          2.    Scott & Ritter, Inc.            (270) 781-9988\n\n          3.    Scott & Murphy, Inc.            (270) 781-9944\n\n          4.    Charles Lanphear            (270) 842-7257\n\n          5.    Crossroads Paving            (270) 904-6768\n\n          6.    Charles Deweese Construction        (270) 586-8560\n\n          7.    Judy's Construction            (502) 282-2059\n\n          8.    Chlorine Services (Steve Akers)        (502) 396-6660\n\n\n\n    C.    CONTRACTOR SUPPLIES    \n\n        \n\n          1.    United Rental                (270) 746-3737\n\n          2.    Whayne Supply Company        (270) 843-3275\n\n          3.    E-Z Rent-It Inc.                (270) 782-9462\n\n          4.    Green River Rentals            (270) 782-0121\n\n\n\n    D.    ELECTRICAL CONTRACTORS & SUPPLIERS\n\n        \n\n          1.    CED Inc.                (270) 781-2229\n\n          2.    M & L Electrical, Inc.            (270) 781-0123\n\n          3.    Rexel Electric Supply            (270) 842-1694\n\n          4.    Randolph, Hale, & Meredith        (270) 781-1460\n\n          5.    Bray Electric                (270) 842-2465\n\n          6.    Wholesale Electric Supply        (270) 842-0156\n\n          7.    Nick Lawson                (270) 842-3622\n\n          8.    D&M Electric                (270) 782-0555\n\n          9.    I.E.C. Electric                (270) 393-8466\n\n        10.    B&R Electric                (270) 793-5698\n\n        11.    D.E.I. Electric                (270) 842-8666\n\n\n\n\n\n\n\n\n\n    E.    ELECTRIC MOTORS\n\n        \n\n        1.    Covington Electrical Sales        (270) 842-7147\n\n        2.    Applied Industrial Technologies        (270) 781-7262\n\n        3.    Albert Crush                (270) 796-4188\n\n        4.    Motion Industries            (270) 842-6195\n\n    \n\nF.    PUMP REPAIR\n\n\n\n        1.    Covington Electric            (270) 842-7147\n\n3.    H.P. Thompson                (502) 363-0577\n\n4.    Sulzer Pumps                          (502) 244-3370\n\n5.    Brooks                    (270) 286-0336\n\n6.    Power Electric (W"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000055485,
      "SummaryText": "hayne Neely)        (615) 254-0066\n\n7.    Southern Sales                1-800-468-0160\n\n8.    Xylem (Flyght)                (513) 831-7867\n\n9.    Southern Electric Motor Sales        (270) 726-4045\n\n\n\n    G.    LABORATORY SERVICES\n\n\n\n        1.    WKU Water Lab            (270)  745-5287\n\n        2.    McCoy & McCoy Laboratories        (270)  821-7375\n\n        3.    CH Diagnostics                (970)  532-2078\n\n        4.    UL Drinking Water Laboratory         1-800-332-4345\n\n        5.    Beckman Laboratory            (502)  266-6533\n\n\n\n    H.    CONSULTING ENGINEERS\n\n\n\n        1.    GRW Engineers, Inc.            1-859-223-3999\n\n        2.    C.D.M.                    (502)  339-0988\n\n\n\n    I.    OTHER UTILITIES & KNOWLEDGEABLE PERSONS\n\n\n\n        1.    Warren County Water Districts        (270) 842-0052\n\n        2.    Warren Rural Electric Co-Op        (270) 842-6541\n\n        3.    Bill Baker (D.O.W.)            (270) 746-7475\n\n        4.    Kentucky Division of Water        (502) 564-3410\n\n        5.    Kentucky Rural Water Association    (270) 843-2291\n\n        6.    KWWOA (Melissa Brothers)        (502) 226-8149\n\n        7.    Atmos Energy                (270) 901-1720\n\n\n\n    Telephone Numbers of other information sources are included in this section.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHAZARDOUS MATERIALS AND RELATED INFORMATION SOURCES\n\n(SELECTED LISTINGS)\n\n\n\n        AGENCY                          TELEPHONE\n\nLocal Emergency Planning Committee    270-846-2488\n\nKentucky Department of Environmental Protection    270-746-7465\n\nKentucky Fire Marshal's Office    800-255-2587 (502)573-0320\n\nCHEMTREC    800-424-9300\n\nFederal Bureau of Investigations (Louisville Office)    502-263-6000\n\nNational Response Center (USCG & EPA)    800-424-8802\n\nPoison Control Center    800-222-1222\n\nChlorine Institute    202-775-2790\n\nCompressed Gas Association    703-788-2700\n\nDow Chemical Company    800-258-2436\n\nU.S. Department of Transportation    202-366-4000\n\nNational Transportation and Safety Board    202-314-6000\n\nU.S. Coast Guard    800-253-7465\n\nU.S. Corps of Engineers\n\nU.S. Corps of Engineers Environmental    202-761-0008\n\n202-528-4285\n\nFederal Emergency Management Agency (FEMA)    770-220-5200\n\nKentucky Fish and Wildlife Services    1-800-858-1549\n\nNational Response Center    800-424-8802\n\nKentucky Department of Transportation    1-859-257-4513\n\nNational "
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000055485,
      "SummaryText": "Transportation Safety Board (Railroad)    630-377-8177\n\nNational Transportation Safety Board (Highway)    404-562-1655\n\nKentucky Division of Water    502-564-3410\n\nKentucky Department of Environmental Protection    502-564-2150\n\nKY Natural Resources & Environmental Protection Cab.    502-564-5525\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBOWLING GREEN MUNICIPAL UTILITIES\n\nHAZARD COMMUNICATION PROGRAM\n\n\n\nGENERAL\n\n\n\nThe following written hazard communication program has been established for the Bowling Green Municipal Utilities, Electric, Water/Wastewater and General Services Division.  It is the intention of the program to provide each employee with information pertaining to potential hazards on the job site and a means of reducing and/or elimination such potential hazards, when possible.\n\n\n\n(Section 1A) Container Labeling\n\n\n\nThe supervisor on each site will verify that all containers received for use, by personnel under his/her direction, will:\n\n\n\n?    Be clearly labeled as to the contents,\n\n?    Note the appropriate hazard warnings,\n\n?    List the name and address of the manufacturer,\n\n?    Verify SDS arrives with or before containers\n\n\n\nNo containers will be released for use until the above data is verified.\n\n\n\n(Section 1B) Safety Data Sheets\n\n\n\nSafety Data Sheets are available on-line through the BGMU website as well as available on all BGMU computers.  Hard copies of the SDS's are available at the Safety Department's Office if requested.\n\n\n\nIndexes of SDS's for all chemicals to which departmental employees may be exposed will be kept in a designated area within the appropriate departments marked \"RIGHT TO KNOW\" COMPLIANCE CENTER.\n\n\n\nIt will be the responsibility of each department's purchasing agents to ensure SDS's are supplied at the time of purchase for any chemical.  Before chemicals are released out to the employee the SDS should be on site.\n\n\n\nSDS's will be available for review to all employees during each work shift by the on-line system.  Copies will be made available "
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000055485,
      "SummaryText": "upon request to the Department Supervisors or Safety Department.\n\n\n\n(Section 1C) Employee Training and Information\n\n\n\nIt will be the responsibility of each Department Supervisor to ensure that each new employee will attend a safety training session and be given training on Hazardous Materials Handling before starting work.  The training will consist of:\n\n\n\n?    Chemicals and their hazards in their work areas;\n\n?    How to lessen or prevent exposure to these hazardous chemicals;\n\n?    What BGMU has done to lessen or prevent worker's exposure to these chemicals;\n\n?    Procedures to follow if they are exposed to these chemicals.\n\n\n\nBefore any new hazardous chemical is introduced into any department in BGMU, each employee will be given information in the same manner as the safety training.  The Department Supervisor will be responsible for seeing that SDS's on the new chemical are available.  All SDS's that arrive in each department that is new to the company, the original should be sent to the Safety Department as soon as possible.\n\n\n\n\n\nSafety Meetings are held throughout the year and Hazardous Materials used by personnel will be discussed if employees have any questions.  Notices will be posted on the employee bulletin boards that provide an explanation of our container labeling system and the locations of the written Hazard Communication Program in the various work sites within BGMU.  Also the Safety Officer within each department will also provide the necessary information if the employee needs information between Safety Meetings.\n\n\n\nLIST OF HAZARDOUS CHEMICALS\n\n\n\nA complete list of Hazardous chemicals used in each division is accessible to the employee in the \"RIGHT TO KNOW\" COMPLIANCE CENTERS.\n\n\n\nHAZARDOUS NONROUTINE TASKS (HNT's)\n\n\n\nAt various times employees will be required to perform Hazardous non-routine tasks.  HNT's are defined as those tasks, involving hazards, which are performed on an unscheduled or random basis.  Listed are several types of HNT's normally performed"
    },
    {
      "ESSeqNum": 13,
      "FacilityID": 1000055485,
      "SummaryText": " within the work scope of BGMU, Electric, General Services or Water-Wastewater Division:\n\n\n\n?    Cleaning filters a WTP\n\n?    Cleaning sewage lift stations, manholes;\n\n?    Misc. pump maintenance in submersible pump vaults;\n\n?    Manual sludge removal from tanks at the WTP and the WWTP;\n\n?    Cleaning or dredging of wet wells in Raw Water Intake at the WTP;\n\n?    SCBA work;\n\n?    Chemical spraying for weed or pest control;\n\n?    Cleaning and repairing electrical equipment;\n\n?    Responding and cleaning spills;\n\n?    Other identified by on site supervisors or safety officials.\n\n\n\nPrior to starting work on any HNT the Department Supervisor will provide information to all workers involved concerning the hazards involved in such tasks.\n\n\n\nThis information will include:\n\n\n\n?    Specific chemical hazardous;\n\n?    Protective/Safety measures the employee can take;\n\n?    Measures BGMU has taken to lessen the hazards, including ventilation, respirators, presence of another employee and emergency procedures.\n\n\n\nIt is department policy that no employee will begin work on any Hazardous Non-routine Task without first receiving a safety briefing from the Department Supervisor or a designated Safety Officer.\n\n\n\nCHEMICALS IN UNLABELED CONTAINERS\n\n\n\nStoring or transporting hazardous materials in unlabeled containers is strictly prohibited; when there is the possibility that anyone other than the person who is knowledgeable of the content could come into contact with said containers.\n\n\n\nIt is the responsibility of the department supervisors to ensure proper labeling is on hazardous material containers.\n\n\n\n\n\n\n\n\n\nINFORMING CONTRACTORS\n\n\n\nIt is the responsibility of the department supervisor to provide the contractors and their employees with the following information:\n\n\n\n?    Hazardous chemicals to which they may be exposed while on the job site;\n\n?    Measures the employees may take to lessen the possibility of exposure;\n\n?    Steps BGMU has taken to lessen the risks;\n\n?    SDS's for all non-hazardous and hazardous chemicals are on fil"
    },
    {
      "ESSeqNum": 14,
      "FacilityID": 1000055485,
      "SummaryText": "e in the specific areas, and copies are available;\n\n?    Procedures to follow if they are exposed.\n\n\n\nAll Department Supervisors will coordinate the supplying of this information to said contractors and their respective employees, prior to their entering the work site.\n\n\n\nThis Hazard Communication Program was established in accordance with the requirements of CFR 1910.200 (e).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRevised June 1, 2015\n\n\n\n\n\n\n\nCHLORINE\n\n\n\n  Chlorine is used, on a regular basis, at Bowling Green Municipal Utilities' Water Treatment Plants.  The Commonwealth of Kentucky mandates the use of a disinfectant Chlorine in Public Water Supplies.  Chlorine is used as a primary and secondary disinfectant at the Water Treatment Plant.  The average amount of Chlorine used is 550 pounds per day.\n\n\n\n  The Water Treatment Plant feed system consists of seven (7) W & T V-Notch type chlorinators.  During normal operation at the Water Treatment Plant, ten (10) cylinders (1 ton each) are connected in parallel to the manifold system.  The manifolds are a split type with automatic switchover systems allowing selected amounts of cylinders to be used at a given time.\n\n\n\n  Storage room maximum capacity at the Water Treatment Plant is fifteen (one) 1 ton cylinders.  Normal operation at the Water Treatment Plant would be five (5) cylinders in service with five (5) cylinders ready to switch over for use.  The other five (5) cylinders are stored on cradles at floor level.\n\n\n\n  Within this section are schematics of the chlorine feed and storage areas for the Water Treatment facility.  Additionally, equipment information, \"Kit B\" emergency repair kit location, and SDS data and chlorine information are included.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBGMU CHLORINE INFORMATON AND RESPONSE PROCEDURES\n\n\n\nGeneral Operations and Maintenance\n\n\n\nI.    Plant Operators with assistance from other Operators or Maintenance Technicians shall unload and/or load, switch over "
    },
    {
      "ESSeqNum": 15,
      "FacilityID": 1000055485,
      "SummaryText": "and transfer cylinders within the cradles with a minimum of 2 personnel using the buddy system with proper radio and/or hand signal communications at all times.\n\n\n\nII.    While any work is being performed inside the Chlorine Room a hand-held Chlorine Monitor shall be turned on and carried while work is being performed which will provide personal safety in conjunction with the stationary units.\n\n\n\nIII.    Communications shall be maintained at all times during the general operations and maintenance of cylinders.  A Safety person shall be standing by outside the room and shall have a radio and monitor all actions being performed in the room.\n\n\n\nIV.    The 2nd and 3rd Shift Operators shall never enter the Chlorine Room upon a confirmation of a leak.  These personnel shall notify the Dispatcher and they shall immediately notify the emergency contacts which include the on-call Maintenance Technician, on-call Supervisor and on-call Safety Department personnel.  This can include the Hazardous Materials Team if deemed necessary.\n\n\n\nV.    When the 2nd and 3rd Shift Operators are working alone during their shift they shall notify the Dispatcher that the Chlorine alarm has activated and they shall evacuate to the initial staging area.  Personnel called in will also respond will go to the initial staging area to meet the Operator.\n\n\n\nVI.    Self-Contained Breathing Apparatus (SCBA) shall be worn during all maintenance and leak responses along with appropriate personal protective equipment.\n\n\n\nVII.    While general operations and maintenance are being performed there are times the monitors will alert the presence of Chlorine inside the room. This activation occurs when:\n\na.    Fixed Chlorine monitors will activate at 0.5 ppm with a visual and audible alarm will be present and will continue alarming after 1.0 ppm.\n\nb.    Portable Chlorine monitors will activate at 0.5 ppm and are carried on the employee while inside the room which will give a visual and audible alarm.  The Water Treatment Plant Chlorine "
    },
    {
      "ESSeqNum": 16,
      "FacilityID": 1000055485,
      "SummaryText": "Scrubber will activate at 1.0 ppm.\n\n\n\nResponse to a Chlorine Leak\n\n\n\nI.        At times when only one Operator is on duty he/she will don an SCBA and take the personal portable   \n\n            Chlorine meter to the Chlorine Room doorway to determine if it is a false alarm or an actual leak.  After this  \n\n            is performed he/she shall then proceed to the initial staging area.   NEVER MAKE ENTRY ALONE!\n\n\n\nII.    Upon determining that there is a confirmed leak the personal portable Chlorine monitor shall remain activated and taken to the appropriate staging area to help determine the Cold Zone.\n\n\n\n\n\n\n\n\n\n\n\n\n\nIII.    When a confirmed Chlorine alarm system activation has occurred the internal BGMU Hazardous Materials Team shall be immediately contacted and these personnel include:\n\n\n\n          Employee             Training Level                Phone Number(s)        \n\nCraig Peay        Technician        (C) 202-4911 or (H) 563-9201\n\nJason Duckett        Technician        (C) 202-8500\n\nDoug Roberts         Technician        (C) 783-1056 or (H) 843-0290\n\nJeff Bullock         Technician        (C) 779-9760 or (H)\n\nJames Dillon        Technician        (C) 799-5507 or (H) 781-7958\n\nDoug Kimbler        Technician        (C) 792-9941 or (H) 782-2723\n\nTerry Hendrick        Technician        (C) 535-1832 or (H) 781-2567\n\nJason Murphy        Technician        (C) 202-2039\n\nMatt Steele        Technician        (C) 282-3668\n\nJeffrey Green        Technician        (C) 792-9877\n\nAndy Hughes        Technician        (C) 202-7866\n\nMason Hamilton    Technician        (C) 791-1894\n\nJohn Scott        Technician        (C) 535-5249 or (H) 782-8836\n\nKevin Lockwood    Technician        (C) 991-7211\n\nDavid Holmes        Technician        (C) 535-4012 or (H) 842-1523\n\nJon Runner        Technician        (C) 779-5806\n\nJay Parrish        Technician        (C) 791-2933 or (H) 777-1119\n\n\n\nIV.    All employees shall evacuate the facility and gather at the designated initial staging area as determined by wind direction according to the facility wind socks:\n\n\n\nWTP     -    Front access Gate on Chestnut Street (150 feet from Chlorine Room)\n\n\n\nIf the wind is blowing in the direction of the access gates then the following location"
    },
    {
      "ESSeqNum": 17,
      "FacilityID": 1000055485,
      "SummaryText": " shall be used for the staging area:\n\n\n\nWTP -        State Street and 31-W ByPass (Parking lot)\n\n\n\nV.    Only BGMU Haz Mat Technicians and BGMU Maintenance personnel will assess the severity and source of any suspected leaks.\n\n\n\nVI.    Only BGMU Haz Mat Technicians and Maintenance personnel will make all repairs or upgrades in these situations.  A request to the BG Fire Department to assist will be determined by personnel on the scene.\n\n\n\nV.    The BG Fire Department will be contacted to provide assistance with manpower and decontamination when requested by on-scene personnel.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRespective Response Procedures and Leak Classifications\n\n    \n\nI.    Small leak or spill -- Response by BGMU Haz Mat Technicians /BGMU Maintenance personnel only:\n\n\n\n1.    Loose packing gland\n\n2.    Valve intact but not seating properly\n\n3.    Pin-hole leaks in manifolds\n\n4.    Connector lines or feeder equipment in which the amount of leakage has not created an environment in which cannot be controlled for proper response by means of shutting down supply and ventilating area\n\n\n\nI.    Cylinder valve packing gland is discharging or leaking:\n\n\n\na.    Close off all discharge valves by turning the stem clockwise and then tighten the packing gland nut by turning the nut clockwise\n\nb.    Replace the lead washer and tighten the adapter connection at the valve discharge outlet\n\nc.    Install Chlorine Kit B immediately if leak is still occurring\n\n\n\nII.    Flexible connector lines, manifold assembly or feed equipment leaks:\n\n\n\na.    Close off discharge valves immediately and draw-off gas within the equipment by means of the vacuum operated chlorinators\n\nb.    Replace the lead waster and tighten the adapter connection at manifold or feed line\n\nc.    Install Chlorine Kit B immediately if leak is still occurring\n\n\n\n\"CONCENTRATIONS ABOVE 25 ppm CONSTITUTES AN EMERGENCY\"\n\n\n\nII.    Large leak or spill -- Response by BGMU Haz Mat Technicians /BGMU Maintenance personnel only:\n\n\n\nI.    Chlorine cylinder (fusible plug , valve or hole in tank)\n\nII.    Fixed "
    },
    {
      "ESSeqNum": 18,
      "FacilityID": 1000055485,
      "SummaryText": "Piping\n\nIII.    Feeder systems\n\nIV.    Other areas that cannot be controlled by shutting down the supply, and ventilating area\n\nV.    When the amount of chlorine at 25 ppm or greater (determined by the Cl2 monitors)\n\nVI.    Request can be made for assistance by BG Fire Department (as noted above)\n\n\n\nI.    Cylinder valve packing gland is discharging or leaking:\n\n\n\na.    Close off all discharge valves by turning the stem clockwise and then tighten the packing gland nut by turning the nut clockwise\n\nb.    Replace the lead washer and tighten the adapter connection at the valve discharge outlet\n\nc.    Install Chlorine Kit B immediately if leak is still occurring\n\n\n\nII.    Flexible connector lines, manifold assembly or feeder equipment leaks:\n\n\n\na.    Close off discharge valves immediately and draw-off gas within the equipment by means of the vacuum operated chlorinators\n\nb.    Replace the lead waster and tighten the adapter connection at manifold or feeder line\n\nc.    Install Chlorine Kit B immediately if leak is still occurring\n\n\n\n\n\n    III.    Other Cylinder leaks:\n\n\n\na.    Check both vapor and liquid valves for leaks and tighten packing\n\n            b.    Inspect all three fusible plugs for leaks\n\n            c.    Install Chlorine Kit B immediately if leak is still occurring\n\n\n\nDO NOT SPRAY WATER ON ANY CHLORINE LEAK\n\n\n\nDisposal of Chlorine Remaining in Container\n\n\n\nStopping a Chlorine leak with the Chlorine Kit B is one interim measure to ensure that the leak is slowed down or stopped.  The one ton container must be emptied as soon as possible by either drawing off the gas or have the Chlorine supplier remove as soon as possible (within 24 hours) of leak.\n\n\n\nThe Chlorine will need to be drawn off if possible using the emergency draw-down valve on the Kit B.\n\n\n\nFirst Aid for Chlorine Exposure\n\n\n\nALWAYS CALL 911 FOR SOMEONE THAT HAS EXPOSED TO CHLORINE!!\n\n\n\nGeneral\n\n\n\n        A.    Be cautious, do not become a casualty yourself.\n\nB.    Prompt treatment is essential.  Firmness and assurance to exposed persons will assist in alleviating anxiety.\n\n        "
    },
    {
      "ESSeqNum": 19,
      "FacilityID": 1000055485,
      "SummaryText": "C.    Immediately remove exposed person to an uncontaminated area.\n\nD.    Remove any contaminated clothing and wash contaminated parts of the body.\n\n        E.    Never give anything by mouth to an unconscious person.\n\n        F.    Call a physician, obtain medical assistance.\n\n\n\nInhalation of Chlorine Gas\n\n\n\n        A.    If breathing has ceased\n\n\n\n            1.    Commence artificial respiration immediately.\n\n2.    Administer oxygen as soon as possible.  The SCBA will be efficient enough on free-flow until the ambulance arrives.\n\n\n\n        B.    If breathing has not ceased\n\n\n\n            1.    Place patient into a comfortable position if possible.\n\n2.    Administer oxygen as soon as possible or get the patient to \n\n            3.    Keep patient warm and at rest.\n\n            4.    Render any other necessary first aid.\n\n\n\nContact of Liquid Chlorine in the Eye\n\n\n\nA.    Flush eyes immediately with copious amounts of running water for 20 (twenty) minutes.\n\nB.    Forcibly hold eyelids apart to ensure complete irrigation of all eye and lid tissues.\n\n        C.    Do not attempt chemical neutralization of any kind.\n\n\n\n\n\n\n\n\n\nContact of Liquid Chlorine on the Skin\n\n\n\n        A.    Emergency Shower, removing clothes in shower.\n\n        B.    Wash well with copious amounts of soap and water.\n\n        C.    Apply nothing to skin.\n\n\n\nProtective Equipment and Clothing\n\n\n\nI.    Normal operations require specific equipment and shall include:\n\n\n\na.    Respiratory protection shall be the highest priority.  The highest respiratory and eye protection shall only be achieved by using an SCBA with a full-face mask.\n\nb.    Protection of the skin shall be achieved by using latex gloves, Tyvex suit or long sleeve shirt.\n\nc.    A full-face mask and Chlorine cartridge can be used for connecting, disconnecting, loading/unloading of cylinders under normal conditions.\n\n\n\nII.    Emergency operations shall require specific equipment and will include:\n\na.    An SCBA with a full-face mask shall be worn during any maintenance procedures or when a leak is present.\n\nb.    Protection from Chlorine for the body shall be Level C or Tyvex Suit.\n\nc.    Protective"
    },
    {
      "ESSeqNum": 20,
      "FacilityID": 1000055485,
      "SummaryText": " clothing for over 25ppm responses shall be a Level A or Level B suit.\n\nd.    Latex or Nitrile gloves shall be used always when working with Chlorine.\n\n\n\nIII.    Protection against gaseous Chlorine is especially important and will include:\n\n\n\na.    When gaseous Chlorine combines with water (including perspiration) it will form and produce Hypochlorous Acid.  When Chlorine gas dissolves in water or on the skin this acid creates mild skin burns and proper PPE shall be used.\n\nb.    When gaseous Chlorine has been determined to be over 25ppm all employees shall use a Level A or Level B suit.\n\n\n\nEmergency Response\n\n\n\nProtective clothing for rescue, emergency repairs and maintenance shall be required.  Protective clothing for rescue employees, such as Level A, B or C suits will provide the necessary protection and shall be used to prevent exposure which can cause damage to your skin.\n\n\n\nWhen an emergency occurs, the BGMU Haz Mat Technicians will donn special protective clothing that is available in the BGMU Hazardous Materials Trailer which is located at the Water Treatment Plant at 16 Chestnut Street.  Scott SCBA with full-face masks shall be used to ensure the highest respiratory protection for all employees.\n\n\n\nOnce a chlorine leak has occurred a decision will be made by the BGMU Safety Department to ensure that all personnel have the appropriate personal protective equipment and shall be used throughout the incident.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPERSONAL PROTECTIVE EQUIPMENT\n\n\n\nI.    Personal Protective Equipment for a Chlorine response will be housed in the BGMU Hazardous Materials Trailer which is located at the Water Treatment Plant at 16 Chestnut Street and will be used in conjunction with equipment already stored at the facilities which includes:\n\n\n\na.    The Hazardous Materials Trailer has thirteen (13) Scott 60-minute Self Contained Breathing Apparatus (SCBA) ten (10) spare cylinders and each employee has a personal full-face piece mask.\n\n\n\nb.    The Water Treatment Plant has four (4) Scott 45-"
    },
    {
      "ESSeqNum": 21,
      "FacilityID": 1000055485,
      "SummaryText": "minute Self Contained Breathing Apparatus (SCBA), spare cylinders and each employee has a personal full-face piece masks.\n\n\n\nc.    A Kit B Chlorine Emergency Repair Kit is immediately available at the Water Treatment Plant Chlorine storage area and another kit is carried in the BGMU Hazardous Materials Trailer.\n\n        \n\nd.    One Portable Chlorine Monitor is immediately available at the Water Treatment Plant and a spare monitor is located inside the BGMU Hazardous Materials Trailer.\n\n\n\ne.    Boxes of Level A, B and C suits are stored in the BGMU Hazardous Materials Trailer for each BGMU Haz Mat Technician.\n\n\n\nf.    Gloves, boots, personal clothing and other materials are immediately available in the BGMU Hazardous Materials Trailer.\n\n\n\nSUMMARY AND CONCLUSIONS\n\n\n\nWhen a chlorine leak occurs, each case must be handled on its own merits.  Decisions must be made which will minimize the amount of Chlorine that is released while at the same time ensuring our employees provide warning and proper rescue to other employees.\n\n\n\nNormal work clothing will provide all the protection that is required for a short period of time it takes to escape from an emergency.  Such clothing, in combination with proper respiratory equipment can be satisfactory for very brief periods required for rescue or emergency valve closing.\n\n\n\nExtended exposure to Chlorine will be handled by the BGMU Haz Mat Technicians with assistance from the Bowling Green Fire Department and/or Medical Center Ambulance Service when requested.  The BGFD and MED Center Ambulance Service will have specific duties which will be handled by the Incident Commander and included within the Joint Unified Command, Decon or Rescue services.\n\n\n\nJudgment must be used when there are high concentrations of Chlorine gas or prolonged exposure is required.  There may be times when persons may not have the option of moving out of the Chlorine gas and other arrangements may be advised to those persons.\n\n\n\n\n\n\n\n\n\n\n\n\n\nTEAM ACTIVATION MATRIX\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
      "ESSeqNum": 22,
      "FacilityID": 1000055485,
      "SummaryText": "\n\n\n\n\nSUMMARY AND CONCLUSIONS\n\n\n\nWhen a Chlorine leak occurs, each case must be handled on its own merits.  Decisions must be made which will minimize the amount of Chlorine that is released while at the same time having others provide warning or rescue to persons who are in danger.\n\n\n\nNormal work clothing will provide all the protection that is required for the period of time it takes to escape from an emergency.  Such clothing, in combination with respiratory equipment, can be satisfactory for very brief periods.\n\n\n\nExtended exposure to Chlorine gas will be handled by the BGMU Haz-Mat Team and the Bowling Green Fire Department with essential duties being performed in compliance with their Standard Operating Procedures which will be confirmed by Unified Command.\n\n\n\nJudgment must be used when high concentrations of Chlorine gas or a prolonged exposure is required.   This also should be made when persons may not have the option of moving out of the Chlorine gas.  When the maximum level of protections will be used the Incident Commander will make the determination.\n\n\n\n\n\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\nHAZ MAT ACTIVATION\n\n\n\n\n\nThe activation of the 18 (eighteen) person Bowling Green Hazardous Materials Team is necessary in the event of a Chlorine release, spill or other chemical emergencies in which a result in contaminant levels can reach a point where Level A or Level B personal protective equipment (PPE) must be used.  \n\n\n\nIf the leak is a Chlorine leak and the Chlorine monitor unit reads 25ppm or greater this will constitute an emergency response in accordance with the BGMU Emergency Response Plan.\n\n\n\nAs stated in the Bowling Green Municipal Utility overview, the Bowling Green Municipal Utilities Hazardous Materials Team will be the primary response to a Chlorine Emergency.  If additional personnel are required, the Bowling Green Fire Department will be contacted as well as the Medical Center Ambulance Service.  BGMU will have pe"
    },
    {
      "ESSeqNum": 23,
      "FacilityID": 1000055485,
      "SummaryText": "rsons designated as Incident Commanders and Incident Advisors if the incident is expanded to include other agencies.  These personnel are competently trained in Chlorine Response as Specialists and they will remain \"on-site\" of all BGMU facilities during such an event.\n\n\n\nIt is highly probable that a HAZMAT response will involve a one-ton Chlorine cylinder,\n\nand it will be in either gas or liquid form.\n\n\n\nIt is the responsibility of the Supervisor or Senior Operator to determine when any emergency situation exists or has expanded to, a HAZMAT situation.\n\n\n\nIn either event, all person(s) should exit the facilities traveling toward exits opposite the wind direction.  Wind direction can be determined by observing the windsock located at the treatment facilities and then traveling to designated response locations.  If possible, SCBA's stored in the operator's office of the treatment facility and should be brought as you exit the facility if feasible.  \n\n\n\nThere shall be NO RE-ENTRY to the facility until the supervisor has advised that all is clear.\n\n\n\n\n\nNOT ALL EMERGENCIES ARE HAZMAT IN NATURE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBOWLING GREEN MUNICIPAL UTILITIES\n\nWATER-WASTEWATER DIVISION\n\nBOWLING GREEN, KENTUCKY\n\n\n\nHAZARDOUS MATERIAL RELEASE RESPONSE\n\n\n\nOVERVIEW - HAZMAT - 29 CFR 1910.120\n\n\n\nNOTE:  The explanations, definitions, and information contained herein are limited to the requirements for emergency response at other than hazardous waste clean-up sites.\n\n\n\n\n\n(1)    APPLICATION\n\n\n\n    HAZARDOUS MATERIALS (HAZMAT) TEAM\n\n\n\nHazardous materials response (HAZMAT) team means an organized group, designated by the employers, who are expected to perform work to handle and control actual or potential leaks or spills of hazardous substances requiring possible close approach to the substance.  These team members perform responses to releases or potential releases of hazardous substances for the purpose of control or stabilization of the incident. A HAZMAT team is not a fire brigade nor"
    },
    {
      "ESSeqNum": 25,
      "FacilityID": 1000055485,
      "SummaryText": "'S staff.\n\n\n\nWater-Sewer Supt. of Engineering        GRW Engineers\n\nEmmett Wood                    801 Corporate Park\n\nPhone:    782-4371 (work)            Lexington, KY \n\nCell:  392-4725                    1-800-432-9537\n\nRadio Unit #29\n\n\n\nBGMU MANAGEMENT:\n\n\n\nW-S System Manager        General Manager        Chief Financial Officer\n\nMike Gardner            Mark Iverson            Gary Bridges\n\nPhone: 781-6369 (H)        Phone: 842-4403 (H)        Phone: 782-4366 (W)\n\nPhone: 782-4366 (W)        Phone: 782-4336 (W)        Cell: 535-4357\n\nCell: 535-4366            Cell: 535-4338            \n\nRadio Unit # 4            Radio Unit # 36            \n\n\n\nTreatment Plant Supt.        Chief Operator - WWTP    Chief Operator - WTP\n\nDoug Kimbler            Heather Stringfield        Terry Hendrick\n\nPhone:    782-2723 (H)        Phone: 782-4389 (W)        Phone: 781-2567 (H)\n\nPhone:    782-4548 (W)        Cell: 784-5568            Phone: 782-4369 (W)\n\nCell: 792-9941            Radio Unit # 1            Cell: 535-1832\n\nRadio Unit # 30                            Radio Unit # 3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEMERGENCY RESPONSE PLAN\n\n                     \n\n- Must be developed and implemented by all employers to handle emergencies\n\n\n\n- Be in writing and available for inspection and copying by:\n\n\n\n    1)    Employees or their representatives\n\n    2)    OSHA personnel\n\n    3)    Any regulatory agency or its representatives\n\n    4)    Suppliers of potentially hazardous materials.\n\n\n\n- Employers who evacuate the workplace in an emergency and do not allow any employee to respond are exempt from this requirement which is provided in the BGMU Emergency Response Plan in accordance with 29 CFR 1910.38 (a).\n\n\n\n- ELEMENTS OF THE EMERGENCY RESPONSE PLAN\n\n\n\n   (A)    Pre-emergency planning (Refer to BGMU ERP).\n\n\n\n   (B)    Personnel roles, lines of authority, training and communication (Refer to BGMU ERP).\n\n\n\n   (C)    Emergency recognition and prevention (Refer to BGMU ERP).\n\n\n\n   (D)    Procedures for handling emergency response (Refer to BGMU ERP).\n\n\n\n(i)    The BGMU highest ranking employee on the scene shall become the individual in charge and be the site-specific Incident Commander.  All emergency personnel and their communications shall be coordinated and contr"
    },
    {
      "ESSeqNum": 26,
      "FacilityID": 1000055485,
      "SummaryText": "olled through the individual in charge of the ICS, and be assisted by other senior agency officials.\n\n\n\n(ii)    The individual in charge of ICS shall be in charge of the BGMU Hazardous Materials Team and all on-scene emergency responders.\n\n\n\n(iii)    The ICS shall limit the number of emergency response personnel at the emergency site, in those areas of potential or actual exposure to incident or site hazards, to those who are actively performing emergency operations, with BGMU assisting in the Site Security.\n\n\n\n(iv)    The Bowling Green Fire Department and Medical Center Ambulance Service will operate at the incident site per Standard Operating Procedures established by their agencies for responses.\n\n\n\n(v)    The Medical Center Emergency Medical Services (EMS), as a minimum, shall also stand by with medical equipment and transportation capability.\n\n\n\n(E)    SKILLED SUPPORT PERSONNEL: Personnel, not necessarily BGMU employees, who are skilled in the operation of certain equipment, such as mechanized earth moving or digging equipment or crane equipment are such listed.  These personnel who are needed temporarily to perform immediate emergency support work and who will be or may be exposed to the hazards at an emergency response scene, are not required to meet the training required in this paragraph.\n\n\n\n\n\n\n\n\n\nHowever, these personnel shall be given an initial briefing at the site prior to their participation in any emergency response. The initial briefing shall include instruction in the wearing of appropriate personal protective equipment, what chemical hazards are involved, and what duties are to be performed.  All other appropriate safety and health precautions provided to BGMU employees shall be used to assure the safety and health of these personnel.\n\n\n\n(F)    ADVISORY EMPLOYEES: Employees who, in the course of their regular job duties, work with and are trained in the hazards of specific hazardous substances will be called Specialists in their field.  They will be called upon to p"
    },
    {
      "ESSeqNum": 27,
      "FacilityID": 1000055485,
      "SummaryText": "rovide technical advice or assistance at a hazardous substance release incident to the individual in charge and shall receive training and demonstrate competency in the area of their specialization annually.\n\n\n\n(G)    FIRST RESPONDER AWARENESS LEVEL: First responders at the awareness level are individuals who are likely to witness or discover a hazardous substance release and who have been trained to initiate an emergency response sequence by notifying the proper authorities of the release.  They would take no further action beyond notifying the proper authorities of the release.  First responders at the awareness level shall have sufficient training to have had sufficient experience to objectively demonstrate competency in the following areas:\n\n\n\n    (a)     Understanding of hazardous materials and associated risks\n\n    (b)     Understand the potential outcome when hazardous materials are present\n\n    (c)    Ability to identify hazardous materials\n\n    (d)    Ability to recognize hazardous materials in an emergency\n\n(e)    Understanding the First Responder Awareness Level's role in a hazardous material emergency\n\n(f)    Understand site security and control and the Emergency Response Guidebook\n\n(g)    Ability to recognize the need for additional resources and to make appropriate notifications\n\n\n\n(H)      HAZARDOUS MATERIALS TECHNICIAN:  Hazardous Materials Technicians are individuals who respond to releases or potential releases for the purpose of stopping the release.  They assume a more aggressive role than the Operations Level in that they will approach the point of release in order to plug, patch or otherwise stop the release of a hazardous substance.  Hazardous Materials Technicians shall have received at least 72 hours of training including Awareness and Operations Level training.  They must have competency in the following areas and the employer shall certify them in:\n\n\n\n    (a)    Recognition of health and safety hazards\n\n    (b)    Methods to minimize risk from safety and health hazards\n\n    (c)    Safe use of co"
    },
    {
      "ESSeqNum": 28,
      "FacilityID": 1000055485,
      "SummaryText": "ntrol equipment\n\n    (d)    Selection and use of appropriate PPE\n\n    (e)    Safe operating procedures to be used at the incident scene\n\n    (f)    Techniques of coordination with other employees to minimize risks\n\n(g)    Appropriate response to overexposure from health hazards or injury to themselves and other employees\n\n    (h)    Recognition of subsequent symptoms which may result from over-exposures\n\n\n\n(I)    ON SCENE INCIDENT COMMANDER: Incident Commanders, who will assume control of the incident scene beyond the First Responder Awareness Level, shall receive at least an additional 24 hours of training and in addition to the Technician Level.  They must have competency in the following areas and the employer shall so certify.\n\n\n\n    (a)    Know and be able to implement the employer's Incident Command center\n\n    (b)    Know how to implement the employer's emergency response plan\n\n\n\n(c)    Know and understand the hazards and risks associated with employees working in chemical protective suits\n\n    (d)    Know how to implement the local emergency response plan\n\n(e)    Know of the state emergency response team and of the Federal & Regional Response Team\n\n    (f)    Know and understand the importance of decontamination procedures\n\n(g)    Safe distances and places of refuge: Refer to North American Emergency Response Guidebook, \"Initial Isolation/Evacuation table for Selected Hazardous Materials\"\n\n    (h)    Site security and control\n\n(a)    Site security will remain the responsibility of the IC or his/her designee\n\n(b)    In the event of an emergency, the Medical Center EMS will be allowed on site only with the approval of the IC or his/her designee.  All Emergency Medical Services will respond to the predetermined staging area unless otherwise instructed\n\n    (i)    Evacuation routes and procedures: Refer to BGMU \"Disaster Plan\"\n\n    (j)    Decontamination: Refer to BGMU SOG's\n\n(k)    Emergency medical treatment and first aid: Refer to BGMU \"Emergency Care for Hazardous Material Exposures\"\n\n(l)    Emergency alerting and response procedures:\n\n(a)    Emergency"
    },
    {
      "ESSeqNum": 29,
      "FacilityID": 1000055485,
      "SummaryText": " Alerting - Audible alarm signifies a general emergency but does not identify the nature of emergency.  All personnel shall report to designated areas for further instructions.  Personnel in vehicles shall be alerted when necessary via radio communications by the Dispatcher.\n\n (b)    Response procedures - The WTP Operators (First Responders) will contact the BGMU Dispatch and request the BGMU Hazardous Materials Team with information concerning the incident, including the location.\n\n (c)    Secondary Response will be performed as required using the Incident Command System.  This would be in the form of the Bowling Green Fire Department, Medical Center Ambulance Service and Bowling Green Warren County Emergency Management, etc.\n\n    (m)    Critique of response and follow-up:\n\n(a)    A written report on the BGMU Haz-Mat Team Response shall be completed by the IC and be submitted to the following for review and follow-up within 2 working days:\n\n            (1)    General Manager\n\n            (2)    Systems Manager\n\n            (3)    Treatment Plant Superintendent\n\n            (4)    Safety Department\n\n    (n)    PPE and emergency equipment: Refer to BGMU SOG's\n\n(vi)    MONITORING: The following monitoring shall be conducted during initial site entry when the site evaluation produces information that shows the potential for IDLH conditions, or when the site information is not sufficient reasonably to eliminate these possible conditions:\n\n            (1)    Monitoring with direct reading instruments for hazardous levels\n\n(2)    Monitoring the air with appropriate direct reading test equipment (which are stationed at each plant and with the Safety Department) for IDLH and other conditions that may cause death of serious harm (combustible or explosive atmospheres, oxygen deficiency, toxic substances)\n\n(3)    Visually observing for signs of actual or potential IDLH or other                     dangerous conditions\n\n(4)    An ongoing air-monitoring program in accordance with paragraph (h) of this section shall be implemented after site characterization has determined the site is "
    },
    {
      "ESSeqNum": 30,
      "FacilityID": 1000055485,
      "SummaryText": "safe for the start-up of operations.\n\n\n\n\n\n(v)    RISK IDENTIFICATION: Once the presence and concentrations of the specific\n\nhazardous substances and health hazards have been established, the risks associated with these substances shall be identified.  Employees who will be working on the site shall be informed of any risks that have been identified.  In situations covered by the Hazard Communication Standard, 29 CFR 1910.120, training required by that standard need not be duplicated.\n\n\n\nNOTE: Risks to consider include, but are not limited to:\n\n(1)    Exposures exceeding the permissible exposure limits and published exposure levels\n\n    (2)    IDLH concentrations\n\n        (3)    Potential skin absorption and irritation sources\n\n    (4)    Potential eye irritation sources\n\n        (5)    Explosion sensitivity and flammability ranges\n\n    (6)    Oxygen deficiency\n\n\n\n(vi)    LEVEL A - The highest level of respiratory and skin protection is necessary.\n\n\n\nThe following constitutes LEVEL A protection:  Refer to BGMU Hazardous Materials Team SOGs.\n\n\n\n        LEVEL A - The highest respiratory and skin protection shall be used when:\n\n\n\n(a)    Chlorine concentration is determined to be equal to or greater than the \"IDLH\" (OSHA limits 30 ppm) then Level A suits will be mandated for use while performing emergency repairs such as a fusible plug, broken or punctured cylinder, valve broken off with no scrubber or multiple cylinders.\n\n(b)    PPE may be of a lower level after monitoring or determining there any listed above has not occurred.\n\n\n\n(vii)    LEVEL B - The highest respiratory protection is necessary but a lesser level of skin protection is needed.\n\n\n\n        The following constitutes LEVEL B protection: Refer to BGMU PPE SOG's.\n\n\n\nLEVEL B protection should be used when:\n\n\n\n(a)    Chlorine concentration is determined to be equal to or greater than the \"IDLH\" (OSHA limits 30 ppm) then Level B suits will be mandated for use while performing emergency repairs.\n\n        (b)    The atmosphere contains less than 19.5 percent oxygen; or\n\n(c)    The presence of"
    },
    {
      "ESSeqNum": 31,
      "FacilityID": 1000055485,
      "SummaryText": " incompletely identified vapors or gases is indicated by a direct-reading organic vapor detection instrument, but vapors and gases are not suspected of containing high levels of chemicals harmful to skin or capable of being absorbed through the skin.\n\n\n\nNOTE:  This involves atmospheres with \"IDLH\" concentrations of specific substances that present severe inhalation hazards and that do not represent a severe skin hazard; or that do not meet the criteria for use of air purifying respirators.\n\n\n\n\n\n\n\n\n\n\n\n(viii)    LEVEL C - The concentration(s) and type(s) of airborne substance(s) is known and the criteria for using air-purifying respirators are met.\n\n\n\n        The following constitute LEVEL C protection: Refer to BGMU PPE SOG's.\n\n\n\n        LEVEL C protection should be used when:\n\n\n\n(a)    The atmospheric contaminants, liquid splashes, or other direct contact will not adversely affect or be absorbed through any exposed skin and a Tyvex Suit is needed;\n\n        (b)    All criteria for the use of air-purifying respirators are met.\n\n\n\n(ix)    LEVEL D protection should be used when:\n\n\n\n        (a)    The atmosphere contains no known hazard; and  \n\n(b)    Work functions preclude splashes, immersion, or the potential for unexpected inhalation of or contact with hazardous levels of any chemicals. \n\n\n\nTRAINING REQUIREMENTS:\n\n\n\nInitial training requirements shall be accomplished by using OSHA 1910.120 or EPA165 Standards.  The training will be provided by an OAI Inc. or by the Kentucky Emergency Management program which are approved by the State of Kentucky.  The BGMU Hazardous Materials Team will train on a quarterly basis no less than 4 hours per quarter with have an 8 hour Technician refresher every other year.\n\n\n\nPROCEDURE FOR HANDLING EMERGENCY RESPONSE:\n\n\n\nThe BGMU senior official at the scene will:\n\n\n\n    (a)    Establish and become the individual in charge of a site-specific                 Incident Command System (ICS).\n\n\n\n(b)    Shall be the individual in charge of ICS and shall identify hazardous substances and conditions present"
    },
    {
      "ESSeqNum": 32,
      "FacilityID": 1000055485,
      "SummaryText": " and shall address site analysis, engineering controls, maximum exposure levels, hazardous substances handling procedures, and use of NEW technology.\n\n\n\n(c)    Based on the hazardous substances or conditions present, the individual in charge of the ICS shall implement emergency operations, and assure that the PPE worn is appropriate.  Minimum protection shall be met.\n\n\n\n(d)    Individual in charge of the ICS shall limit the number of personnel at the scene to those actively involved in performing the Hazardous Materials Response.\n\n\n\n(e)    Back-up personnel shall stand by with rescue equipment.  Basic life support personnel shall stand by with medical equipment and transportation.\n\n\n\n(f)    Individual in charge shall designate a Safety Officer who shall identify and evaluate hazards and provide direction with respect to the safety of operations.\n\n\n\n(g)    If an IDLH or imminent danger condition exists, the Safety Officer shall have authority to alter, suspend, or terminate activities.\n\n\n\n(h)    After emergency is terminated, individual in charge shall implement decontamination procedures.\n\nHAZARDOUS MATERIALS (HAZMAT) TEAMS\n\n\n\nThe Bowling Green Fire Department Hazardous Materials Team will be notified if manpower, extra equipment or decontamination is required and there are an insufficient number of BGMU Hazardous Materials Personnel available.  This shall be accomplished by the BGMU Dispatcher contacting 911.\n\n\n\nCONTRACTORS AND SUB-CONTRACTORS\n\n\n\nAn employer who retains contractors or subcontractor services for work in hazardous waste operations shall inform those contractors, sub-contractors, or their representative of the site emergency response procedures.  They shall at least include potential fire, explosion, health, safety and other hazards dealing with the hazardous waste operations that have been identified in the employer's information program.  No contractor or sub-contractor shall perform hot-work around any hazardous material with in the treatment plants.  The Chlorine B"
    },
    {
      "ESSeqNum": 33,
      "FacilityID": 1000055485,
      "SummaryText": "uilding is a NO hot-work facility.\n\n\n\nPROGRAM AVAILABILITY\n\n\n\nThe written safety and health program shall be made available to any contractor or subcontractor or their representative who will be involved with the hazardous waste operation.   This shall be given to employees and their designated representatives, OSHA personnel and to personnel of other Federal, State or local agencies with regulatory authority over the site.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n"
    }
  ]
}