{
  "FacilityID": 1000015565,
  "FacilityName": "Bidart Bros. Apple Packing Facility",
  "FacilityStr1": "5055 E. Lerdo Hwy",
  "FacilityStr2": null,
  "FacilityCity": "Shafter",
  "FacilityState": "CA",
  "FacilityZipCode": "93263",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06029",
  "LEPC": null,
  "FacilityLatDecDegs": "35.497106",
  "FacilityLongDecDegs": "-119.186106",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Bidart Bros. Apple Packing Facility",
  "OperatorStr1": "4805 Centennial Plaza Way",
  "OperatorStr2": "Suite 100",
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93312",
  "OperatorZipCodeExt": null,
  "FTE": 65,
  "OtherEPAFacilityID": "CAL000116248",
  "EPAFacilityID": "100000163976",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-22 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2014-05-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-05-19 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-05-19 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-05-19 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.497106,
  "FRS_Long": -119.186106,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000019505,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000015565,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000023212,
          "ProcessID": 1000019505,
          "ChemicalID": 56,
          "Quantity": 27000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000052598,
          "ProcessID": 1000019505,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000043979,
              "Process_NAICS_ID": 1000052598,
              "SafetyReviewDate": "2014-04-28 00:00:00",
              "PHA_Date": "2014-05-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-05-06 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-12-30 00:00:00",
              "TrainingReviewDate": "2013-01-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-01-03 00:00:00",
              "EquipmentInspectionDate": "2014-05-01 00:00:00",
              "EquipmentTested": "PRV Annual Inspection",
              "ChangeMgmtDate": "2013-12-18 00:00:00",
              "ChangeMgmtReviewDate": "2013-01-03 00:00:00",
              "PreStartupReviewDate": "2013-12-18 00:00:00",
              "ComplianceAuditDate": "2011-08-22 00:00:00",
              "AuditCompletionDate": "2011-12-09 00:00:00",
              "IncidentInvestigationDate": "2013-03-08 00:00:00",
              "InvestigationChangeDate": "2013-03-11 00:00:00",
              "ParticipationPlansReviewDate": "2013-01-03 00:00:00",
              "HotWorkPermitReviewDate": "2013-01-03 00:00:00",
              "ContractorSafetyReviewDate": "2013-07-17 00:00:00",
              "ContractorSafetyEvalDate": "2013-01-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000052792,
                  "PreventionProgram3ID": 1000043979,
                  "ProcessChemicalID": 1000023212
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000015565,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kern Co. Environmental Health Dept.",
    "CoordinatingAgencyPhone": "6618628740",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000015565,
      "SummaryText": "3.2\tANHYDROUS AMMONIA\r\n\r\nThe ammonia refrigeration process at the Bidart Bros facility is an integral part of the overall business and operates most of the year.   The ammonia process contains a total charge of approximately 27,000 lbs. It is extremely important that this process is maintained and operated in a safe and efficient manner.  Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\r\n\r\nOur refrigeration personnel monitor the ammonia refrigeration process and keep an active log book of all procedures and transactions that pertain to ammonia.  In addition, the system/process is checked frequently by one of the outside refrigeration contractors that we use.  These contractors also assist in performing the annual mechanical integrity review of our ammonia equipment.\r\n\r\n1.4\tFIVE YEAR ACCIDENT HISTORY\r\n\r\nBidart Bros has had no accidental releases within the last five (5) years. \r\n\r\n1.5\tEMERGENCY ACTION PLAN\r\n\r\nThis facility's emergency response program is based on the Cal/OSHA requirements for Emergency Action Plans (in California CCR Title 8, Section 3220, Emergency Action Plans) Federally, Title 29 CFR 1910.38 and 1910.119, HAZWOPER (standard in California CCR Title 8, Section 5192, Hazardous Waste Operations and Emergency Response, and Title 29 CFR 1910.120). \r\n\r\nStrategically, we will respond minimally to a release.  Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team.\r\n\r\nEvery year at the beginning of the season we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release. \r\n\r\n1.6\tPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nOur company has an outstanding safety record, one that we are quite proud of.  Many policies and procedures have been implemented to promote overall plant, worker and p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000015565,
      "SummaryText": "ublic safety.  Nevertheless, Bidart Bros continually strives to improve in all areas, including safety.  The overhaul of this Risk & Process Safety Management Program has been the primary recent improvement, and implementation of the program is our plan for improved safety in the near future.\r\n\r\nThe Risk & Process Safety Management Program has been written so that program elements are aligned with Bidart Bros business practices rather than the order presented in the law.  Thus, Safe Operating Procedures are grouped together for the benefit of our system operator.  Safe Operating Policies are grouped together so that appropriate office staff may administer them.  The Emergency Action Plan is now separated out and distributed widely through the plant for easy reference.  \r\n\r\nThe Risk & Process Safety Management Program documentation forms and company policy forms pertaining to employee, contractor, and community safety have been carefully reviewed so as to prevent unnecessary complexity and redundancy.  Bidart Bros will be utilizing PSMWriter&copy; to document, schedule, and assign tasks.\r\n\r\nFor the future, Bidart Bros now thinks of the Risk & Process Safety Management Program as a living document.  It is an interactive framework that guides safe action for Bidart Bros employees, but allows for feedback and continual improvement.  Through the Risk & Process Safety Management Program Bidart Bros will continue to maintain overall plant, worker and public safety."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000015565,
      "SummaryText": "fessional refrigeration engineers in accordance with industry standards at the time. The following expansions have occurred since the facility was originally built:\r\n¿\t2013 - California Controlled Atmosphere supplied and installed one (1) screw compressor, one (1) evaporative condenser, and one (1) auto-purger\r\n\r\nIt was also built in compliance with the Uniform Mechanical Code and Uniform Building Code applicable at the time of construction. The system contains numerous safety devices including sensors which stop the compressors if temperatures or pressures exceed or drop below established limits, and safety relief valves which vent ammonia gas to the atmosphere if the pressure in the system exceeds their set point. In addition, ammonia detectors are located in selected areas of the facility, and will shut down equipment if ammonia is detected. Lastly, an emergency dump box contains switches and valves to turn off equipment and vent ammonia if necessary.\r\n\r\nThe ammonia system at our facility consists of vessels which are interconnected, or which are co-located such that a release of ammonia could impact the ability to operate vessels that are not directly connected. Therefore, we are treating the system as a single process.\r\n\r\n1.3\tGENERAL ACCIDENT RELEASE & CHEMICAL SPECIFIC PREVENTION STEPS\r\n\r\n1.3.1\tGENERAL\r\n\r\nWe inform our employees engaged in process operations of the dangers of an accidental release of any one of the regulated chemicals in annual safety meetings.  These employees are made aware of the potential risks of the process chemicals involved.  During these meetings we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\r\nBidart Bros has also conducted an off-site impact analysis of worst-case and alternate-case release scenarios for each process.  These are for the purposes of informing the public in the event of an accidental release.  The results of the analyses are reported in the body of the program.\r\n\r\n1."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000015565,
      "SummaryText": "1\tEXECUTIVE SUMMARY \r\n\r\nLiving Document Approach To Regulatory Compliance\r\n\r\nThis program is intended to meet the spirit and intent of the California Accidental Release Prevention Program (CalARP), CCR Title 19, Chapter 4.5, the Federal EPA Risk Management Plan, 40 CFR, Part 68, the California Process Safety Management Program, CCR Title 8, Section 5189, and Federal Process Safety Management Program, 29 CFR, Part 1910.119, as enforced by the local Certified Unified Program Agency, Federal EPA, Cal-OSHA, and Federal OSHA.\r\n  \r\nThis program is intended to be a living document.  As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Bidart Bros has chosen to use the software package, PSMWriter&copy;, software developed and distributed by ResourceCompliance, Inc.  This software will assist us with compliance and provide a more efficient method to manage our CalARP and RMP-PSM program elements and keep them up to date.\r\n\r\n1.1\tBIDART BROS, RISK & PROCESS SAFETY MANAGEMENT PROGRAM\r\n\r\nThis is to inform all interested persons, including employees, that Bidart Bros has updated their unified Risk & Process Safety Management Program.  The program is in compliance with California's Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements.  At the Federal level, Title 40 CFR Part 68, and California OSHA's Process Safety Management (PSM) of Acutely Hazardous Materials standard (in California CCR Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials, and Federally Title 29 Code of Federal Regulations (CFR) 1910.119).  This program has been prepared to address the risks involved in the following processes which have the presence of hazardous chemicals above threshold quantities:\r\n\r\nProcess Name\t           Process Chemical(s)\t   Process Quantity (lbs)\r\nAmmonia Refrigeration\t   Anhydr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000015565,
      "SummaryText": "ous Ammonia\t   27,000 lbs\r\n\r\nOur program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. Overall, the program is designed to prevent accidental fatalities, injuries and illnesses and avoid physical property damage.\r\n\r\nBidart Bros has an exemplary safety record, one that we are quite proud of. Our company has many policies and procedures in place to promote overall plant, worker and public safety.  We have: (1) prepared a unified program based on the PSM plan to meet CalARP and RMP obligations as well; (2) reorganized the program so that it meshes more closely with general Bidart Bros business practices; and (3) reviewed plan documentation forms and responsibilities.  The unified Risk & Process Safety Management Plan sets forth rules, procedures and practices that will help our employees protect themselves and our neighbors.\r\n1.2\tPROCESS DESCRIPTION\r\nBidart Bros operates a commercial cold storage for apples and table grapes. The ammonia system provides refrigerating capacity to (4) storage room, (1) precool room, (18) controlled atmosphere rooms, and (1) segregation room.\r\n\r\nThe systems operate as follows. High pressure liquid from our main receiver is piped to each cold room, where it passes through an expansion valve into low temperature & pressure accumulator vessels. From the accumulators, cold liquid ammonia is circulated through evaporator coils. As heat is absorbed, the liquid ammonia vaporizes to form low temperature & pressure gas which is returned to the accumulator vessel. The ammonia vapor is returned from the accumulator vessels through a suction return line to our engine room, where it passes through a compressor. The high pressure discharge from the compressor is sent to a water cooled condenser where the high pressure gas ammonia is cooled, liquefied and returned to our receiver.\r\n\r\nThe facility was built by pro"
    }
  ]
}