{
  "FacilityID": 1000008775,
  "FacilityName": "Southside WWTP",
  "FacilityStr1": "10011 Log Cabin Road",
  "FacilityStr2": null,
  "FacilityCity": "Dallas",
  "FacilityState": "TX",
  "FacilityZipCode": "75253",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48113",
  "LEPC": "Dallas County LEPC",
  "FacilityLatDecDegs": "32.641333",
  "FacilityLongDecDegs": "-096.646867",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G6",
  "LatLongDescription": "PC",
  "FacilityURL": "http://www.dallascityhall.com/dallas/eng/html/water_utilities.html",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Dallas Water Utilities",
  "Company2Name": "City of Dallas",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Dallas Water Utilities",
  "OperatorStr1": "Dallas City Hall",
  "OperatorStr2": "1500 Marilla Street, Room 4A North",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75201",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chris Kaakaty, P.E.",
  "RMPTitle": "Assistant Director of Wastewater",
  "FTE": 120,
  "OtherEPAFacilityID": "TXD980798409",
  "EPAFacilityID": "100000129513",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-09-01 00:00:00",
  "SafetyInspectionBy": "Dallas Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-08-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 32.6425,
  "FRS_Long": -96.64333,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010183,
      "AltID": "Southside Cl2 System",
      "FacilityID": 1000008775,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010531,
          "ProcessID": 1000010183,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011613,
          "ProcessID": 1000010183,
          "ChemicalID": 62,
          "Quantity": 240000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000511613,
          "ProcessID": 1000010183,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000010184,
      "AltID": "Southside SO2 System",
      "FacilityID": 1000008775,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000010532,
          "ProcessID": 1000010184,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000011614,
          "ProcessID": 1000010184,
          "ChemicalID": 49,
          "Quantity": 150000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000511614,
          "ProcessID": 1000010184,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000008775,
      "SummaryText": ".INTRODUCTION\nThe City of Dallas Water Utilities maintains a policy of safe water and wastewater treatment plant operation, reducing to the greatest extent possible any hazards associated with the treatment processes, and reducing any subsequent risk to the surrounding community, their employees, and the environment. They cooperate with the surrounding community and local emergency response agencies to promote effective contingency planning in the unlikely event that a process incident occurs.\n\nAs part of this policy, Dallas Water Utilities maintains compliance with the U.S. Environmental Protection Agency??A?s (USEPA) regulations for the prevention and mitigation of accidental releases of extremely hazardous substances under section 112(r) of the Clean Air Act.   Facilities covered by the regulations (40 CFR 68) are required to implement a risk management program and submit a description of the program (called a risk management plan, or RMP) to USEPA.  \n\nThe Southside Wastewater Treatment Plant (WWTP) falls under this regulation because of the onsite storage and use of chlorine and sulfur dioxide.  The amounts stored for both chemicals exceed the threshold limits specified by the USEPA, thereby making the facility subject to compliance with the regulation.  \n\nDallas Water Utilities first submitted a RMP for the Southside WWTP to USEPA in 1999, and resubmitted in 2004..   RMPs must be updated and resubmitted to USEPA every five (5) years.  The following information summarizes the Southside WWTP 2009 update and resubmission:\n\nREGULATED SUBSTANCES\nThe Southside WWTP uses chlorine as a disinfectant in the wastewater treatment process.  Sulfur dioxide is used at the plant in the de-chlorination process to remove residual chlorine from the treated wastewater prior to discharge into the Trinity River.   \n1. Chlorine\nThe Southside WWTP regularly has a maximum storage quantity of 120 tons of chlorine at its facility.  The chlorine is stored in three 30-ton tanks, each fille"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000008775,
      "SummaryText": "d with a maximum capacity of 26 tons set by administrative controls.  A fourth tank is always kept empty in case an emergency transfer is necessary.  The total amount of chlorine exceeds the threshold limit of 2,500 pounds set by the USEPA.  \n\nChlorine is delivered to the Southside WWTP by tanker truck and is stored in the three 30-ton tanks, located inside the Chlorine Building.  \n\nThe existing chlorine feed facilities at the Southside WWTP consist of the four inside storage tanks, liquid feed piping and miscellaneous valves, two evaporators, gas piping and miscellaneous valves, four chlorinators, and a scrubber system.  A release of chlorine gas could potentially occur at the chlorine storage area or at the chlorine process areas.\n\n2. Sulfur dioxide\nThe Southside WWTP stores sulfur dioxide in two 25-ton stationary tanks.  As an administrative control, these tanks are only filled with a maximum of 42,000 pounds for a maximum amount of 42 tons of sulfur dioxide stored onsite at one time.  The total amount exceeds the threshold limit of 5,000 pounds set by EPA.\n\nSulfur dioxide is delivered to the Southside WWTP by a tanker truck and is stored in the tanks located inside the Sulfur Dioxide Building.  \n\nThe existing sulfur dioxide facilities at the Southside WWTP consist of the two 25-ton stationary tanks, liquid feed piping and miscellaneous valves, two evaporators, gas piping and miscellaneous valves, and feeders.  A release of sulfur dioxide gas could potentially occur at the sulfur dioxide storage area or at the sulfur dioxide process areas.\n\nHAZARD ASSESSMENT\nMalcolm Pirnie, Inc. reviewed and updated the offsite consequence analyses at Southside WWTP by identifying and documenting a worse case scenario (sulfur dioxide) and one alternate release scenario each for chlorine and sulfur dioxide.   EPA??A?s RMP*Comp was used as the model for the resubmission.  \n\nThe results of this review are documented and are maintained as part of the RMP records.\n\nFIVE YEAR ACCIDENT "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000008775,
      "SummaryText": "HISTORY\nThe accident history for the Southside WWTP was reviewed for the period from June 2004 through June 2009.  During this period of time, no accidental releases of chlorine occurred that resulted in deaths, injuries, or significant property damage on-site, or off-site deaths, injuries, evacuations, sheltering in place, property damage or any environmental impact.\n\nPREVENTION PROGRAM\nThe Dallas Water Utilities maintains a consistent accidental release prevention program to eliminate or minimize releases of chlorine and sulfur dioxide at Southside WWTP.  The program consists of seven elements:\n\n1. Safety Information\nDallas Water Utilities has maintained information concerning process chemicals, technology, and equipment as part of their risk management program at Southside WWTP.  The information is made available to employees and contractors at Southside WWTP who will work in the chlorine and sulfur dioxide process area.  Emergency response planners can also use the information to develop training programs and procedures.\n\n2. Hazard Review\nA hazard review of chlorine and sulfur dioxide processes and procedures is conducted at least every five (5) years to evaluate potential causes and consequences of accidental releases.  A chlorine and sulfur dioxide process hazard analysis using the ??A?What-If??A? method was conducted by Malcolm Pirnie, Inc. with the assistance of Southside WWTP plant management and staff familiar with the process??A? operation and maintenance in June, 2004.  Existing precautions were reviewed and determined to be adequate.  Potential changes in operating, maintenance, and other process safety management procedures that could further improve the overall safety of the chlorine and ammonia systems were identified.\n\nThe results of this review are documented and are maintained as part of the RMP records.  \n\n3. Operating procedures\nDallas Water Utilities have developed and implemented written operating procedures that provide instructions and step "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000008775,
      "SummaryText": "for conducting activities associated with the chlorine and sulfur dioxide processes at Southside WWTP consistent with the safety information. Southside WWTP operating procedures include startup, shutdown, and emergency operating procedures, and describe how the system should be operated in order to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.\n\n4. Training\nAll Southside WWTP staff currently involved in chlorine and sulfur dioxide processes have been trained in the classroom and/or during on-the-job training in an overview of the processes and in the operating procedures, as is new staff assigned to the processes.  Training includes emphasis on safety and health, hazards, emergency operations including shutdown, and safe work practices.  Refresher training is provided at least every three years to ensure Southside WWTP staff understands and adheres to current operating procedures.  \n\n5. Maintenance\nSouthside WWTP has developed and implemented a preventive and corrective maintenance program to ensure equipment used to process, store, or handle chlorine and sulfur dioxide is functioning properly and installed to minimize the risk of releases.   The program addresses equipment testing, inspection, and preventive maintenance schedules, and documentation of equipment testing, inspection, and preventive and corrective maintenance activities. \n\n6. Compliance audits\nUSEPA??A?s risk management rule requires that Southside WWTP complete a compliance audit for it??A?s risk management program at least once every 3 years. The primary goals of conducting a compliance audit are to verify compliance with risk management rule requirements and good process safety practices, identify process safety or program deficiencies and develop corrective actions, and increase safety awareness among Southside WWTP staff. The risk management rule also requi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000008775,
      "SummaryText": "res that copies of the last 2 audits are maintained as part of the written program.\n\nMalcolm Pirnie, Inc., with the assistance of Southside WWTP plant management and staff familiar with the processes operation and maintenance, conducted an audit in March 2009. The results of this both audits, in addition to recommendations made, are documented and are maintained as part of the RMP records. Copies of audits performed in 2004 and 2007 are also available. \n\n7. Incident Investigation\nSouthside WWTP management investigates each incident that resulted in or could reasonably have resulted in a catastrophic release of chlorine or sulfur dioxide. A process to identify the underlying causes of incidents and implement procedures for preventing similar events has been developed. \n\nAn incident investigation team will be established following criteria established in the Southside WWTP risk management program.  As part of the investigation, an incident report will be prepared to recommend system changes (i.e., operational modifications, additional training and competency requirements), to prevent a similar incident from occurring in the future. The incident investigation report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system.\n\nNo incidents were reported between 2004 and 2009\n\nEMERGENCY RESPONSE PLAN\nAn Emergency Response Plan (ERP) has been developed for Southside WWTP, which provides specific emergency response procedures for accidental releases of chlorine and sulfur dioxide to ensure that emergency response coverage is available 24 hours per day, 7 days per week.  These procedures include leak investigation, operational-level response activities, and communications to coordinate response activities with outside agencies, such as the City of Dallas Fire Department HAZMAT Team, in the event of an emergency. \n\nDallas Water Utilities updated and incorporated the ERP, as well as sections of the risk man"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000008775,
      "SummaryText": "agement program, into an all-hazard integrated contingency plan (ICP) in 2007.  The ICP format minimizes duplication in the preparation and use of emergency response and risk management plans for various regulatory requirements, and eliminates confusion for Southside WWTP staff that would have had to decide which plan applies to a particular emergency.\n\nSouthside WWTP staff are also participating in DWU-wide ongoing emergency response preparation and training consisting of training and drills at the awareness, performance (operational and technician) and National Incident Management System (NIMS) / Incident Command System (ICS) levels.\n\nRECOMMENDED CHANGES TO IMPROVE SAFETY\n- Connect automatic shutoff wiring for chlorine and sulfur dioxide.\n\n"
    }
  ]
}