{
  "FacilityID": 1000081300,
  "FacilityName": "United Dairy Farmers Production Facility",
  "FacilityStr1": "3955 Montgomery Road",
  "FacilityStr2": null,
  "FacilityCity": "Norwood",
  "FacilityState": "OH",
  "FacilityZipCode": "45212",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39061",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "39.152222",
  "FacilityLongDecDegs": "-084.463056",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 17653528,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "United Dairy Farmers, Inc.",
  "OperatorStr1": "3955 Montgomery Road",
  "OperatorStr2": null,
  "OperatorCity": "Norwood",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "45212",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis Fitch",
  "RMPTitle": "Engineering Manager",
  "FTE": 150,
  "OtherEPAFacilityID": "45212NTDDR3955M",
  "EPAFacilityID": "100000088727",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-10-10 00:00:00",
  "SafetyInspectionBy": "Norwood Fire Department (5/29/2019)",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.15161,
  "FRS_Long": -84.46249,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101597,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000081300,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102859,
          "ProcessID": 1000101597,
          "NAICSCode": "31152",
          "_desc": {
            "NAICS_CODE": "31152",
            "NAICS_DESCRIPTION": "Ice Cream and Frozen Dessert Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000127347,
          "ProcessID": 1000101597,
          "ChemicalID": 56,
          "Quantity": 38000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000627347,
          "ProcessID": 1000101597,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081300,
      "SummaryText": "United Dairy Farmers - Norwood, OH\n\nExecutive Summary\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nUnited Dairy Farmers, Inc. is strongly committed to employee, public, and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operation, maintenance, and employee training associated with our ammonia refrigeration systems. It is our policy to implement appropriate controls to prevent possible releases of ammonia. Unforeseeably, if such a release does occur, our safety systems are designed to protect and mitgate the impacts associated, as well as a highly trained emergency response personnel are available to control and mitigate the effects of the release. We are also coordinated with the City of Norwood Fire Department and the Hamilton County LEPC for emergency response support.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\n\n\nOur facility facility is primarily used for production of ice cream products. The only RMP regulated substance present at the facility is anhydrous ammonia which is utilized as the primary cooling media in our closed-loop refrigeration system. Refrigeration is a critical part of our business, providing cold storage capabilities for products per Food and Drug Administration (FDA) regulations. Due to the  and characteristics of our refrigeration Process, as well as Process Safety Management (PSM) applicability, this facility is covered under Program 3 of the RMP regulations.\n\n\n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n\n\nOur facility has taken the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  Our facility is also subject to 29 CFR 1910.119, as well as the EPCRA Section 302 and 311/312 notification/reporting requirements. The following sections briefly describe the elements of the accid"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081300,
      "SummaryText": "ental release prevention program that are in place at our facility.\n\n\n\nProcess Safety Information\n\n\n\nOur facility maintains a record of process safety information that describes the information pertaining to the hazards of Anhydrous Ammonia, information pertaining to the technology of the refrigeration process, and information pertaining to the equipment in the refrigeration process.\n\n\n\nProcess Hazard Analysis\n\n\n\nOur facility conducts process hazards analyzes so that hazards associated with the ammonia refrigeration process are identified and controlled efficiently. The methodology used to carry out these analyses is What-If Scenarios and Checklist provided by the IIAR. The studies are undertaken by a team of qualified personnel with expertise in refrigeration engineering and process operations and maintenance, and are validated at a minimum of every five (5) years. Any recommendations related to the process hazard analyzes are addressed in a timely manner.\n\n\n\nOperating Procedures\n\n\n\nFor the purposes of safely conducting activities related to the refrigeration system, our facility maintains written operating procedures. These procedures address various modes of operation including startup, normal operations, emergency operations, normal shutdown, and emergency shutdown. The procedures are reviewed and certified annually and are readily accessible to all personnel who work on, in and adjacent to the ammonia refrigeration process.\n\n\n\nTraining\n\n\n\nOur facility has a comprehensive training program in place so that employees who are working with the ammonia refrigeration system are competent in all relevant operating procedures. Refresher training is provided at least every three (3) years and more frequently as needed.  United Dairy Farmers, Inc. utilizes RETA certifications to supplement training for ammonia refrigeration personnel.\n\n\n\nMechanical Integrity\n\n\n\nUnited Dairy Farmers, Inc. carries out maintenance inspections/tests on ammonia refrigeration equipment to ensur"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081300,
      "SummaryText": "e the integrity of the equipment. Process equipment examined by these inspections/tests includes among others: pressure vessels, piping systems, pressure relief valves, emergency shutdown systems, controls and pumps.  Maintenance tasks are carried out by qualified personnel with previous training in applicable maintenance practices. Furthermore, these personnel are offered specialized training as needed. Any equipment deficiencies identified by the maintenance inspections/tests are corrected in a timely manner.\n\n\n\nManagement of Change\n\n\n\nWritten procedures are in place to manage changes made to the refrigeration technology, equipment, and/or procedures. Refrigeration Technicians or any other employee whose job tasks are affected by a modification to the refrigeration process are promptly made aware of and trained on the change(s).\n\n\n\nPre-startup Reviews\n\n\n\nPre-start up safety reviews are conducted any time the refrigeration process is opened for repairs, tie-ins, or modifications and when the modification is significant enough to require a change in the process safety information. These reviews are conducted to confirm that construction, equipment, operating procedures, maintenance procedures, and emergency response procedures are suitable for safe startup prior to the introduction of ammonia to the modified or new equipment.\n\n\n\nCompliance Audits\n\n\n\nUnited Dairy Farmers, Inc. conducts audits at least every three (3) years to determine whether the provisions set out under the RMP rule are being implemented. Any corrective actions identified during these audits are addressed in a timely manner.\n\n\n\nIncident Investigation\n\n\n\nUnited Dairy Farmers, Inc. promptly investigates any incident that has resulted in, or could reasonably result in, an unintentional release of ammonia. These investigations are undertaken to identify the situation leading to the incident, as well as any necessary corrective actions to prevent the release from reoccurring. All reports are retained fo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081300,
      "SummaryText": "r a minimum of five (5) years.\n\n\n\nEmployee Participation\n\n\n\nUnited Dairy Farmers, Inc. truly believes that Process Safety Management (PSM) and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information related to PSM and RMP implementation, including Process Hazard Analyses (PHA) information.\n\n\n\nContractors\n\n\n\nOn occasion, our company hires contractors to conduct specialized maintenance and/or construction activities related to the ammonia refrigeration process. Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out. United Dairy Farmers, Inc. has a strict policy of informing the contractors of known potential hazards related to the contractor's work with the ammonia process. Contractors are also informed of all the procedures for emergency response should an accidental release of ammonia occur.\n\n\n\n4. Five-year Accident History\n\n\n\nUnited Dairy Farmers, Inc. has had an excellent record of preventing accidental releases over the last 5 years, no accidental releases have occurred during this period.\n\n\n\n5. Emergency Action Plan\n\n\n\nUnited Dairy Farmers, Inc. maintains an Emergency Action Plan to document specific procedures to be implemented in the event of various emergencies, including an ammonia release. The Emergency Action Plan addresses evacuations and notification of local emergency response agencies. The plan is promptly updated to reflect any pertinent changes taking place within the facility that would require modified procedures.  The Hamilton County LEPC is the Local Emergency Planning Committee (LEPC) with which our Emergency Action Plan has been coordinated and verified. The City of Norwood Fire Department is the primary emergency response agency for all facility emergencies, including an ammonia release.\n\n\n\n6. Planned Changes to Impro"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000081300,
      "SummaryText": "ve Safety\n\n\n\nThe facility is currently undertaking a major project to improve written procedures, safe work practices, and training programs associated with the ammonia refrigeration process."
    }
  ]
}