{
  "FacilityID": 1000030330,
  "FacilityName": "Leprino Foods, Greeley",
  "FacilityStr1": "1302 1st Ave",
  "FacilityStr2": null,
  "FacilityCity": "Greeley",
  "FacilityState": "CO",
  "FacilityZipCode": "80631",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08123",
  "LEPC": "Weld County LEPC",
  "FacilityLatDecDegs": "40.416952",
  "FacilityLongDecDegs": "-104.675853",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Leprino Foods Company",
  "Company2Name": null,
  "CompanyDUNS": 7076664,
  "Company2DUNS": 0,
  "OperatorName": "Leprino Foods Company",
  "OperatorStr1": "1830 W. 38th Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Denver",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80211",
  "OperatorZipCodeExt": null,
  "RMPContact": "Michael Graham",
  "RMPTitle": "Plant Engineering Manager",
  "FTE": 400,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215377",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-08-01 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-09-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-09-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-09-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-09-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036970,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000030330,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000037335,
          "ProcessID": 1000036970,
          "NAICSCode": "311513",
          "_desc": {
            "NAICS_CODE": "311513",
            "NAICS_DESCRIPTION": "Cheese Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044598,
          "ProcessID": 1000036970,
          "ChemicalID": 56,
          "Quantity": 50500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000544598,
          "ProcessID": 1000036970,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000030330,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe Leprino Foods Company - Greeley facility complies with all applicable federal, state, and local regulations.   All employees are informed of hazards in the workplace. Employees who work with potentially hazardous substances receive proper training in the handling of those substances. This facility has a comprehensive accidental release prevention program in place that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances.  There are also procedures in place to safely remove employees from areas in the unlikely event that a hazardous substance release were to occur, and to put in place emergency notification and response procedures.   \n\n\n\n\n\n2. Facility and Regulated Substances\n\n\n\nThe Leprino Foods Company - Greeley plant's primary activities encompass cheese manufacturing, non-fat dry milk, and whey proteins. The plant is located in Greeley, CO. The sole regulated substance at this facility, anhydrous ammonia (CAS #7664-41-7), is used in a closed-loop refrigeration system for product cooling and human comfort (HVAC).  In order to protect its employees, the public and the environment, Leprino Foods has an integrated safety management program to prevent ammonia releases and mitigate the consequences of a release, should one occur. \n\n\n\n\n\n3. Worst Case and Alternative Case Release Scenarios\n\n\n\nOff Site Consequence (OCA) data is available for review onsite at the Leprino Foods Company - Greeley facility.\n\n\n\n\n\n4. General Accidental Release Prevention Program and Ammonia Specific Prevention\n\n\n\nLeprino Foods has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA. The Anhydrous Ammonia refrigeration system is also subject to the OSH"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000030330,
      "SummaryText": "A PSM standard under 29 CFR 1910.119. The facility is also subject to EPCRA Section 302 notification requirements.  The Leprino Foods Company - Greeley facility also has an emergency plan that addresses the response necessary for a release of ammonia from the refrigeration system. Because of the pungent odor of ammonia, any leak is easily detected. The engine room is also provided with ammonia detectors that sound an alarm if ammonia is detected. The refrigeration system is designed so that major components can be isolated by closing selected valves. Further, refrigeration system operators have been trained and are knowledgeable in the safe operation of the refrigeration system.  In case of a release that could travel off the plant property, calls would be made to the Greeley Fire Department and the Weld County disaster services coordinator(s) or representatives to assist in the response. Other state and federal notifications would be made as required.\n\n\n\n\n\n5. Five Year Accident History\n\n\n\nThis facility is a new design/build facility and this RMP submission is a first time submission, therefore there have been no reportable releases of ammonia.  \n\n\n\n\n\n6. Emergency Planning and Response Program\n\n\n\nThis facility has procedures in place to respond to the release of a hazardous substance. Employees are trained according to their responsibilites (HAZMAT team onsite).  Coordination with the local fire department and/or local responding agencies is initiated during an emergency situation.\n\n\n\n\n\n7. Planned Changes to Improve Safety\n\n\n\nLeprino Foods Company - Greeley plant expects to improve safety performance by emphasizing all elements of the PSM/RMP program.  All recommendations during the Process Hazard Analysis were designed to improve the safety performance of the ammonia refrigeration process.  The PSM/RMP team expects to evaluate each recommendation in a timely manner and implement, as soon as possible, those recommendations that will reduce the possibility of a relea"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000030330,
      "SummaryText": "se and/or mitigate the consequences of an unintentional release.  \n\n"
    }
  ]
}