{
  "FacilityID": 1000067817,
  "FacilityName": "Monogram Gourmet Foods, LLC",
  "FacilityStr1": "330 Ballardvale Street",
  "FacilityStr2": null,
  "FacilityCity": "Wilmington",
  "FacilityState": "MA",
  "FacilityZipCode": "01887",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25017",
  "LEPC": "Wilmington LEPC",
  "FacilityLatDecDegs": "42.600770",
  "FacilityLongDecDegs": "-71.163622",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "A5",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Monogram Gourmet Foods",
  "OperatorStr1": "330 Ballardvale Street",
  "OperatorStr2": null,
  "OperatorCity": "Wilmington,",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01887",
  "OperatorZipCodeExt": null,
  "RMPContact": "Lynn Buldhaupt",
  "RMPTitle": "Sr Director Environmental Complianc",
  "FTE": 418,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000237843",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Consultant",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-01-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-03-05 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-03-05 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-03-05 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "9",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085101,
      "AltID": "Prepared Food Manufacturi",
      "FacilityID": 1000067817,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000086295,
          "ProcessID": 1000085101,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106181,
          "ProcessID": 1000085101,
          "ChemicalID": 56,
          "Quantity": 22020.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606181,
          "ProcessID": 1000085101,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067817,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies:\n\nMonogram Gourmet Foods has implemented all the elements of an EPA 40 CFR Part 68 Accidental Release Prevention Requirements, Program 3 Risk Management Plan (RMP) and all of the elements of OSHA 29 CFR Part 1910.119 Process Safety Management (PSM) of Highly Hazardous Chemicals regulation. It is Monogram company policy to adhere to all applicable federal, state, and local laws. If an emergency were to occur, it is company policy to notify the Wilmington, MA Fire Department and request that they respond to the emergency. Fire suppression equipment and training has also been provided to the operations personnel at the facility.\n\n\n\nThe Stationary Source and Regulated Substances:\n\nMonogram Gourmet Foods is a standard Ammonia refrigeration facility containing anhydrous ammonia gas liquefied under pressure. The ammonia changes state from a liquid to a gas and back to a liquid. It does not chemically change; it is not consumed and does not wear out. It continuously circulates throughout the system.\n\n\n\n\n\nWorst Case Release and Alternate Release Scenarios:\n\nThe worst case release scenario modeled/estimated is the release of 22,020 pounds (the entire system capacity). The duration of the release would be 10 minutes, occurring within the machine/engine room, in contact with outside air. The estimated distance to toxic endpoint is about 1.8 miles in all directions. The terrain is rural and generally flat/unobstructed.\n\n\n\n\n\nThe alternate release scenario modeled/estimated is a 5-minute release of ammonia from a small pipe hole area of approximately 0.2 square inches on the rooftop. The release rate is 4,680 pounds per minute. The estimated distance to toxic endpoint in this scenario is about 1.3 miles in all directions.\n\n\n\n\n\nGeneral Accidental Release Prevention Program:\n\nThe Monogram Gourmet Foods facility has developed and implemented all of the elements of the EPA 40 CFR Part 68 Accidental Release Prevention Requir"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067817,
      "SummaryText": "ements, Program 3 Risk Management Plan (RMP) and the OSHA 29 CFR Part 1910.119 Process Safety Management (PSM) of Highly Hazardous Chemicals regulations, including implementing Standard Operating Procedures, completing Process Hazard Analysis, and employee training.\n\n\n\n\n\nFive-year Accident History:\n\nThere have been no releases of a regulated substance in the last 5 years. \n\n\n\nProcess Safety Information (PSI):\n\nThe Monogram facility has compiled written process safety information for all PSM covered processes. The PSI also incorporates information provided by the International Institute of Ammonia Refrigeration (IIAR) standards/guidance. The PSI includes the hazards of ammonia used in the refrigeration process and process equipment data. The process safety information will be updated whenever process changes are made using management of changes and pre-startup safety reviews.\n\n\n\nAccurate and complete process safety information enables the Monogram employees involved in operating and maintaining the food processing facility to identify and understand the hazards of the refrigeration system. Process safety information is used to conduct process hazard analysis on the existing system.\n\n\n\nProcess Hazard Analysis (PHA):\n\nMonogram Gourmet Foods is committed to performing a detailed hazard analysis of its refrigeration system to identify, evaluate, and control hazards involved in the processes. The entire process is systematically examined to identify potential hazards, controls in place to manage these hazards, and recommend additional controls, as appropriate.\n\n\n\nThe Monogram Facility uses the What-if-Checklist PHA methodologies, which are conducted by a team of people who have operating and maintenance experience, engineering expertise and PHA facilitator training. The PHA team identifies and evaluates potential hazards of the process as well as accident prevention and mitigation measures, and makes suggestions for additional prevention and/or mitigation measures.\n\n\n\nAs "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067817,
      "SummaryText": "a minimum the Monogram Facility will perform periodic PHA reviews or revalidations every 5 years as long as the process is operating. PHA findings and recommendations and their resolution are documented. Monogram has implemented a system to address and resolve all PHA findings and recommendations in a timely manner through a written schedule. PHA findings and recommendation resolutions are communicated to all affected employees. All recommendations must be resolved and documented by management.\n\n\n\nOperating Procedures (OP):\n\nMonogram has developed and implemented written operating procedures that describe the tasks that the refrigeration system operators perform, the safe process operating parameters to be maintained,\n\nand safety precautions for operations and maintenance activities. The Monogram Gourmet Foods PSM Plan and written operating procedures address steps for each operating phase, including, initial start-up, normal operations, emergency shutdown, emergency operations, and normal shutdown. The written operating procedures describe ammonia safety systems and their functions. The operating procedures state the operating limits including the consequences of deviation and the steps required to correct or avoid the deviation and are reviewed and certified annually for current practices and accuracy.\n\n\n\nSafe Work Practices and Procedures:\n\nMonogram has developed and implemented safe work practices in accordance with the OSHA 29 CFR Part 1910 requirements that include methods for controlling facility entry, presence and exit of\n\nsupport personnel, lockout/ tagout procedures to ensure isolation of energy sources for equipment undergoing maintenance, personal protective equipment, fire protection, electrical safety, hot work\n\nprocedures and permits for work with the potential for generating ignition sources in the presence of flammable or combustible material.\n\n\n\nTraining:\n\nMongoram has developed and implemented formal operator and maintenance training programs.\n\nI"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000067817,
      "SummaryText": "nitial training insures that new or reassigned personnel are trained in an overview of the process\n\nand operating procedures. Refresher training is performed at least every three (3) years to ensure\n\nthat the operator understands and adheres to the current operating procedures of the process.\n\nEmployees are tested to demonstrate their understanding of the training and competency.\n\n\n\nContractors:\n\nMonogram has developed and implemented a program to ensure that contractors used to supplement its workforce to perform maintenance, renovation or specialty work on or near RMP/PSM covered processes are qualified to perform the work and are informed of the potential\n\nhazards. Monogram personnel monitor the contractor activities throughout maintenance, renovation or specialty work on or new RMP / PSM covered processes.\n\n\n\nPre-startup Safety Reviews (PSSR):\n\nThe Monogram facility requires a pre-startup safety review (PSSR) to be performed and documented for any physical modification in the PSM covered processes. Additionally, any new units added at the Monogram facility, which is considered PSM covered processes, will also require a PSSR to be performed and documented.\n\n\n\nMechanical Integrity:\n\nMonogram has developed and implemented procedures to maintain the on-going mechanical integrity of critical refrigeration process equipment in accordance with OSHA Standard 1910.119, Process Safety Management (PSM), as outlined in the facility PSM Plan. Inspections/audits and tests are documented and deficiencies outside of the acceptable limits are corrected before further use or in a safe and timely manner.\n\n\n\nHot Work Permits:\n\nThe Monogram Facility has developed and implemented a Hot Work Permit system in accordance with the OSHA 29 CFR Part 1910 requirements for hot work operations conducted on or near a covered process.\n\n\n\nManagement of Change (MOC):\n\nThe Monogram facility requires that a Management of Change (MOC) be performed for any modification to equipment, procedures, produ"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000067817,
      "SummaryText": "cts and process parameters of a PSM covered process.\n\n\n\nIncident Investigation:\n\nThe Monogram Facility requires that any incidents that resulted in the release of regulated substances, or a near miss, must be investigated as soon as possible, but no later than 48-hours following the incident. The facility has established a system to promptly address and resolve incident investigation findings and recommendations.\n\n\n\nCompliance Audits:\n\nCompliance audits will be conducted on a regular basis to ensure that the facility is in compliance with applicable elements of the EPA 40 CFR Part 68 Accidental Release Prevention Requirements, Program 3 Risk Management Plan (RMP), all the elements of OSHA 29 CFR Part 1910.119 Process Safety Management (PSM) of Highly Hazardous Chemicals regulation. The next compliance audit will be due in three years (2021).\n\n\n\nEmergency Response Program Information:\n\nThe Monogram Facility Emergency Response Plan is site-specific. It includes required actions by facility employees as well as required notification and coordination with local responders and agencies. All employees are trained in the execution of the Emergency Response Plan and drills are conducted. Emergency response program changes are administered through the MOC process.\n\n\n\nTrade Secrets:\n\nThere are no trade secrets applicable to the Monogram facility operations/processes.\n\n\n\nPlanned Changes to Improve Safety:\n\nThere are no planned changes to the ammonia refrigeration system at the Monogram facility at this time.\n\n"
    }
  ]
}