{
  "FacilityID": 1000114902,
  "FacilityName": "City of Jacksonville Land Treatment System",
  "FacilityStr1": "716 Firetower Road",
  "FacilityStr2": null,
  "FacilityCity": "Jacksonville",
  "FacilityState": "NC",
  "FacilityZipCode": "28541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37133",
  "LEPC": "Onslow  County LEPC",
  "FacilityLatDecDegs": "34.772500",
  "FacilityLongDecDegs": "-077.555833",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Jacksonville",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Jacksonville",
  "OperatorStr1": "P.O. Box 128",
  "OperatorStr2": null,
  "OperatorCity": "Jacksonville",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28541",
  "OperatorZipCodeExt": null,
  "FTE": 18,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000018713",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-01-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-06-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-06-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-06-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.779267,
  "FRS_Long": -77.545275,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000143289,
      "AltID": "Wastewater Treatment",
      "FacilityID": 1000114902,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000179151,
          "ProcessID": 1000143289,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000144822,
          "ProcessID": 1000143289,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000122518,
              "Process_NAICS_ID": 1000144822,
              "SafetyReviewDate": "2023-10-03 00:00:00",
              "PHA_Date": "2021-09-21 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-11-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Ice Storm",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Caustic Scrubber",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Live Video Feed",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Missions online remote monitoring system was added as second monitoring system for the chlorine scrubber.  Also, chlorine scrubber was replaced like for like in June 2023.",
              "OpProceduresReviewDate": "2023-10-03 00:00:00",
              "TrainingReviewDate": "2023-10-03 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Additional online training added via NEOGOV cloud based system.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": "Additional online training added via NEOGOV cloud based system.",
              "MaintenanceReviewDate": "2023-10-03 00:00:00",
              "EquipmentInspectionDate": "2024-06-03 00:00:00",
              "EquipmentTested": "Chlorine alarm, scrubber, sensors, actuators, cutoff valves",
              "ChangeMgmtDate": "2010-03-01 00:00:00",
              "ChangeMgmtReviewDate": "2023-10-03 00:00:00",
              "PreStartupReviewDate": "2023-10-03 00:00:00",
              "ComplianceAuditDate": "2023-10-03 00:00:00",
              "AuditCompletionDate": "2023-11-01 00:00:00",
              "IncidentInvestigationDate": "2011-10-05 00:00:00",
              "InvestigationChangeDate": "2011-11-01 00:00:00",
              "ParticipationPlansReviewDate": "2023-10-03 00:00:00",
              "HotWorkPermitReviewDate": "2023-10-03 00:00:00",
              "ContractorSafetyReviewDate": "2023-10-03 00:00:00",
              "ContractorSafetyEvalDate": "2023-10-03 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000153637,
                  "PreventionProgram3ID": 1000122518,
                  "ProcessChemicalID": 1000179151
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000114902,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-10-03 00:00:00",
    "ERTrainingDate": "2023-10-03 00:00:00",
    "CoordinatingAgencyName": "Jacksonville Fire Department",
    "CoordinatingAgencyPhone": "9109385252",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000114902,
      "SummaryText": "via email to facilitate continued review by staff members.  The state of emergency in North Carolina was lifted on August 15, 2022.  The City of Jacksonville resumed quarterly RMP staff meetings in October 2022.\n\nThe City of Jacksonville\u0092s Risk Management Plan was developed in accordance with the 1990 Clean Air Act Amendments.  The Plan utilizes process safety management and chemical accident prevention to ensure that chlorine is safely managed at the Land Treatment Facility."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000114902,
      "SummaryText": "wer failure, change to generator power and scrubber activation.  Live video of the interior building is also available through the City\u0092s computer network.  In June 2023, a second monitoring system was added to the chlorine scrubber via the online Missions system.  The Missions system is programmed to call and text the listed personnel if the chlorine scrubber is activated.\n\nThe facility has an excellent safety record.  The Land Treatment Facility has not had any chlorine accidents or incidents in the last ten years.  If an incident were to occur, the City of Jacksonville Land Treatment Site is a non-responding facility.  Employees are trained to call the Fire Department at (910) 455-0122 in the case of a chlorine incident. Signs are posted in multiple locations as a reminder.  The covered process is included in the Onslow County Local Emergency Planning Committee\u0092s response plan. The local fire departments (Southwest Volunteer Fire Department and the City of Jacksonville\u0092s Fire Department) are familiar with the covered process.  In the case of an emergency, the HAZMAT Team from the City of Jacksonville\u0092s Fire Department will respond.\n\nAs part of the RMP, meetings are held every quarter to discuss safety concerns, topics and standard operating procedures.  As a result, RMP operating procedures are reviewed and updated annually.  The discussions include all levels of personnel including managers, supervisors and general staff.  Safety training is provided throughout the year on various topics.  In addition, all City staff members receive monthly training on safety topics such as PPE, Hazard Communications and Site Security.  \n\nOn March 10, 2020, under Executive Order No. 116, Governor Roy Cooper of North Carolina declared a state of emergency to coordinate response and protective actions to prevent the spread of COVID-19.  Consequently, all staff meetings for the City of Jacksonville were suspended.  During this hiatus, standard operating procedures were disseminated"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000114902,
      "SummaryText": "e process falls under the Program 3 eligibility requirements as it does not meet the requirements of Program 1 and is subject to the OSHA Process Safety Management Standard.\n\nThe safety of City employees and local residents is protected in several ways.  First, the building itself acts as buffer for the surrounding atmosphere.  Second, the chlorine delivery system is a vacuum process.  This process has proven to greatly reduce chlorine leaks by reducing the amount of equipment that is exposed to pressurized chlorine.  Each chlorine cylinder has an emergency cutoff valve that is triggered by the chlorine gas detector.  In addition to the mitigation provided by the building and appurtenances within, there is a scrubber designed to minimize the effects of an accidental release of chlorine gas.  The emergency vapor scrubber system is a 'once-through three stage chemical absorption system, consisting of three horizontal crossflow packed bed sections.  The scrubber absorber is located on top of the caustic storage tank, which is an integral part of the system.  The recirculation pump drains caustic solution from the bottom of the caustic storage tank and circulates it through the three stages.  Each header has chemical distribution nozzles, which distribute caustic solution over the packing media. As the chlorine-laden gas passes through each of the three stages, chlorine is absorbed and reacts with the caustic solution and chlorine-free air is exhausted through the stack. A mist eliminator is placed at the end of the third stage to remove any residual liquid prior to the discharge of gas.  The chlorine scrubber was replaced \u0093like for like\u0094 in June 2023.  Multiple monitoring devices are used to notify personnel if a chlorine related incident were to occur.  The building interior has a sensor that detects the chlorine level in the air.  The level is accessible and monitored 24 hours a day via SCADA.  SCADA will also notify personnel in the event of chlorine detection, po"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000114902,
      "SummaryText": "s are harvested and used for pulp wood.  Young seedlings are planted to repeat the cycle.  \n\nChlorine (CAS#7782-50-5, SIC #4952) is added to disinfect wastewater prior to irrigation to protect the health of City personnel, contractors and others who may enter the spray fields.   Chlorine is delivered to the plant in one-ton cylinders, which remain on site until emptied. The chlorine gas flows from one set of four cylinders to a vacuum regulator and then to the chlorinator, which regulates the flow of chlorine (measured in lbs/day) to the point of application.  A chlorine solution rather than gaseous chlorine is applied at the point of application. The solution is created in an injector downstream of the chlorinator, where treated wastewater from the effluent main mixes with and dissolves the chlorine. The water flow through the injector creates a vacuum to draw the chlorine from the chlorinator.  The maximum intended chlorine inventory on site is 24,999 lbs. This is stored in one-ton cylinders and 150-pound cylinders. The cylinders are stored inside the chlorine feed system building which provides an acceptable environment for use and storage.\n\nSection 112r of the 1990 Clean Air Act Amendment requires that a site with a listed hazardous substance above a stated threshold quantity must develop a Risk Management Plan (RMP).  The OSHA Process Safety Management Standard (29 CFR 1910.119) is applicable to the Land Treatment Facility because the disinfecting process involves a toxic and reactive highly hazardous chemical (chlorine) at or above the specified threshold quantity listed in Appendix A of § 1910.119 (1,500 lbs.).  The EPA Chemical Accident Prevention Provisions (40 CFR 68) are applicable to the Land Treatment Facility as an owner or operator of a stationary source that has more than the threshold quantity of a regulated substance (chlorine) as determined under § 68.115 (2,500 lbs.). The LTS regulated process is the addition of Chlorine Dioxide to wastewater. Th"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000114902,
      "SummaryText": "City of Jacksonville\nLand Treatment Facility\nJacksonville, NC\nEPA ID: 100000018713\n\nExecutive summary \u0096 2024\n\nThe City of Jacksonville continues to implement a comprehensive program to safely manage chlorine at the Land Treatment Facility. The physical location of the facility is 716 Firetower Road, located east of Jacksonville, North Carolina.  Section 112r of the 1990 Clean Air Act Amendment requires that a site with a listed hazardous substance above a stated threshold quantity must develop a Risk Management Plan (RMP).  Chlorine (CAS#7782-50-5, SIC #4952) is the only listed hazardous substance at the facility.\n \nThe Land Treatment Facility is responsible for the treatment and land application of the City of Jacksonville\u0092s wastewater.  The system is designed to treat up to 9.0 million gallons of wastewater daily and spray irrigates 2,300 acres of pine forest.  Wastewater is transported 8 miles from Jacksonville to the facility by a 36-inch diameter force main.  First, the wastewater is treated with hydrogen peroxide for the removal of odors before flowing into the headworks facility.  At the headworks facility, the influent (raw wastewater) passes through a Huber Step Screen where material greater than 1/8 inch in size is removed.  The wastewater then flows into an aerated grit and grease removal system where inorganic material and floating materials are removed.  Wastewater then flows into a series of aerated lagoons where biological treatment of the waste occurs.  Secondary treated wastewater then flows into storage lagoons.  The storage lagoons have a capacity of 690 million gallons and provide storage of treated wastewater during periods of inclement weather and when spray irrigation of wastewater is not feasible.  The treated wastewater is chlorinated to eliminate harmful pathogens.  Then, the treated wastewater is used to irrigate 2,300 acres of pine forest on the property.  As the pines mature and their ability to store nutrients decreases, the mature tree"
    }
  ]
}