{
  "FacilityID": 1000062890,
  "FacilityName": "Baldwin Energy Complex",
  "FacilityStr1": "10901 Baldwin Road",
  "FacilityStr2": null,
  "FacilityCity": "Baldwin",
  "FacilityState": "IL",
  "FacilityZipCode": "62217",
  "Facility4DigitZipExt": "0146",
  "FacilityCountyFIPS": "17157",
  "LEPC": "Randolph County EMA",
  "FacilityLatDecDegs": "38.202800",
  "FacilityLongDecDegs": "-89.853667",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.vistracorp.com",
  "FacilityEmailAddress": "kim.edmiaston@vistraenergy.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Vistra Corp",
  "Company2Name": null,
  "CompanyDUNS": 80457910,
  "Company2DUNS": 0,
  "OperatorName": "Dynegy Midwest Generation, LLC.",
  "OperatorStr1": "10901 Baldwin Road",
  "OperatorStr2": null,
  "OperatorCity": "Baldwin",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "62217",
  "OperatorZipCodeExt": "0146",
  "RMPContact": "Kim Edmiaston",
  "RMPTitle": "Manager Environmental and Chemistry",
  "FTE": 182,
  "OtherEPAFacilityID": "NPDES IL0000043",
  "EPAFacilityID": "100000048423",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "157851AAA",
  "SafetyInspectionDate": "2009-09-16 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-03 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-04-03 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-03 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 38.21013,
  "FRS_Long": -89.84753,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078843,
      "AltID": "Anhydrous Ammonia System",
      "FacilityID": 1000062890,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000080024,
          "ProcessID": 1000078843,
          "NAICSCode": "221112",
          "_desc": {
            "NAICS_CODE": "221112",
            "NAICS_DESCRIPTION": "Fossil Fuel Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098224,
          "ProcessID": 1000078843,
          "ChemicalID": 56,
          "Quantity": 780000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000598224,
          "ProcessID": 1000078843,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062890,
      "SummaryText": "Dynegy Midwest Generation, Inc\n\nBaldwin Energy Complex\n\nBaldwin, Illinois\n\n\n\n\n\nRISK MANAGEMENT PLAN\n\nEXECUTIVE SUMMARY\n\n\n\n\n\nThe following executive summary addresses Baldwin Energy Complex's (E.C.'s) compliance with Section 112 & reg; of the Clean Air Act administered by the U.S Environmental Protection Agency (EPA).  This Risk Management Plan (RMP) is submitted in accordance with 40 CFR Part 68, EPA's Chemical Accident Prevention Program.  \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCES\n\n\n\nBaldwin E.C., located 1 mile north of the town of Baldwin, Illinois (approximately 35 miles southeast of the St. Louis Metro area).  Baldwin E.C. consists of three major fossil fuel-fired units; two Babcock & Wilcox cyclone-fired once-through boilers supplying steam to their respective Westinghouse turbine-generators and one Combustion Engineering forced circulation drum boiler supplying steam to a General Electric turbine-generator.  Unit 1 went into commercial service on July 12, 1970; Unit 2 on May 21, 1973; and Unit 3 on June 20, 1975.  Together these units can produce approximately 1,800 net megawatts.\n\n\n\nThe electric output of each generator is directed to an associated main transformer, which steps up the voltage to 345,000 volts for long-range transmission.  The electricity flows to the switchyard where it is then routed to one of five 345 kV transmission lines or to a step down transformer that provides 138 kV power for transmission lines to relatively nearby substations.\n\n\n\nCooling water for the main and auxiliary condensers of the three units is provided by a 2,000-acre, man-made, cooling pond.  Baldwin Lake is approximately 1.5 miles wide and 2.5 miles long and normally holds about seven billion gallons of water.  Three pumps on the Kaskaskia River are used to pump makeup water into the lake as needed.  The circulating water system provides over one million gallons of water each minute to the plant's main and auxiliary condensers (all three units running at full load)."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062890,
      "SummaryText": "  \n\n\n\nBaldwin E.C. also has an ammonia supply terminal with ammonia held in two 90,000 gallon tanks, with administrative controls limiting the amount in either tank to 85% tank volume.  This allows for a total amount of ammonia stored on site of 153,000 gallons or 780,000 pounds.  The ammonia is used in selective catalytic reduction.  Flue gas containing nitrogen oxide emissions from the combustion process is mixed with ammonia.  The mixed gases travel through a series of catalyst layers, which cause the nitrogen oxide to react with the ammonia.  The reaction converts the nitrogen oxide to pure nitrogen, a benign chemical that makes up 80 percent of the air we breathe, and water vapor.  Both elements are returned to the environment through the plant stacks. \n\n\n\nBaldwin E.C. employs 182 full-time persons.  A number of contractors are also on site at any given time.  Most of these employees live nearby in surrounding counties.\n\n\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nAs an RMP Program Level 3 facility, Baldwin E.C. is in compliance with the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Program requirements.  These requirements include conducting regular Process Hazard Analyses (PHAs) to identify and understand hazards; preparing, following, and auditing Operating Procedures, conducting initial and refresher Training of employees, performing regular Mechanical Integrity reviews of process equipment, developing and implementing written Management of Change procedures, and conducting Pre-Startup reviews, Compliance Audits, and Incident Investigations.  These requirements form the framework of our accident prevention program, and it is the policy of Dynegy to meet or exceed these requirements.\n\n\n\nBaldwin E.C. has a written Emergency Response Program that addresses the manpower and equipment necessary to handle onsite emergencies.  In complying with this RMP regulation our Emergency Response Plan has been "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062890,
      "SummaryText": "updated to include offsite notification procedures, if necessary.  Dynegy is a participant in the Randolph County LEPC.  It is the policy of Dynegy's Baldwin E.C. to handle any onsite emergencies with our own manpower and equipment.  We would rely on outside emergency response assistance for any offsite emergencies.  No incident with offsite impacts has occurred since power generation began in 1970.\n\n\n\n\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere have been no RMP-defined accidents at Baldwin E.C. in the last 5 years. Likewise, there has never been an offsite impact caused by an accident at the facility.\n\n\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nBaldwin E.C. has a written Emergency Response Program.  This program addresses hazardous waste operations and emergency response procedures at the plant, responsibilities of employees during an emergency, reports required for an emergency, emergency recognition and prevention, safe distance requirements, evacuation plans, security and site control procedures, notification procedures and phone numbers, and personnel protective equipment.\n\n\n\nIn case of an accident or emergency, there is a nearby ambulance service in Red Bud, Illinois.  Volunteer Fire Departments are available in the towns of Baldwin, Sparta, and Red Bud.  Baldwin E.C. also actively coordinates with the Randolph County LEPC, known as the Randolph County Emergency Management Agency (EMA).\n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nAs a result of evaluating our release scenarios, Baldwin E.C. will implement the following safety measures:  \n\n\n\n1.    Coordination with the Randolph County Emergency Management Agency will continue to help ensure that warnings and precautionary instructions are provided to emergency responders so that potential public receptors can be alerted.\n\n2.    An on-site Emergency Action Committee has been created to hold drills and exercises.\n\n\n\nThis Risk Management Plan is presented as an example and testament of Dynegy Midwest Generation's commitment to acciden"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062890,
      "SummaryText": "t prevention.  This commitment is supported by the fact that no accidents with offsite consequences have occurred at this facility.  We will continue to strive for excellence in our accident prevention program and will continue to improve our emergency response program and safety programs.\n\n"
    }
  ]
}