{
  "FacilityID": 1000097004,
  "FacilityName": "JCI Jones Chemicals Inc. - Torrance",
  "FacilityStr1": "1401 W. Del Amo Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Torrance",
  "FacilityState": "CA",
  "FacilityZipCode": "90501",
  "Facility4DigitZipExt": "1630",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.847534",
  "FacilityLongDecDegs": "-118.301613",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.jcichem.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2216091,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "JCI Jones Chemicals Inc. - Torrance",
  "OperatorStr1": "1401 W. Del Amo Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Torrance",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90501",
  "OperatorZipCodeExt": "1630",
  "RMPContact": "Tim Ross",
  "RMPTitle": "West Coast VP and Branch Manager",
  "FTE": 19,
  "OtherEPAFacilityID": "90507JNSCH1401W",
  "EPAFacilityID": "100000141394",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-04-22 00:00:00",
  "SafetyInspectionBy": "City of Los Angeles Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-11-19 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-11-19 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 1,
  "PostmarkDate": "2021-11-19 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-11-19 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 33.84712,
  "FRS_Long": -118.29973,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "150",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000120232,
      "AltID": null,
      "FacilityID": 1000097004,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000121605,
          "ProcessID": 1000120232,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000150494,
          "ProcessID": 1000120232,
          "ChemicalID": 62,
          "Quantity": 1916000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000650494,
          "ProcessID": 1000120232,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000120233,
      "AltID": null,
      "FacilityID": 1000097004,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000121606,
          "ProcessID": 1000120233,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000150495,
          "ProcessID": 1000120233,
          "ChemicalID": 49,
          "Quantity": 188600.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000650495,
          "ProcessID": 1000120233,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000097004,
      "SummaryText": "EXECUTIVE SUMMARY\n\nJCI JONES CHEMICALS, INC.\n\nTORRANCE, CA\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies\n\n\n\nJCI is committed to being a responsible member of any community in which it has operations by giving top priority to operating in a safe and environmentally sound manner. As part of this commitment, JCI has obtained Responsible Care &reg; Management System certification.  Corporate policy dictates that facilities continuously identify methods to provide the safest working environment possible to its employees and to reduce the risk to the community and environment. This commitment to safe and environmentally sound operations is documented in the corporate policy and compliance/procedure manuals, which are available to all employees. This facility stresses safe and environmentally sound operations in employee training programs, and in written materials available at the facility. This facility's safety and environmental programs include monthly safety meetings of all employees. JCI has an environmental manual and a safety manual that cover general environmental and safety best practices and compliance topics. Each employee at this facility has access to the environmental and safety manuals that cover topics specific to this facility. There are regularly scheduled safety and environmental audits conducted by facility management, and periodic safety and environmental audits of the facility conducted by JCI corporate personnel. This risk management program document has been prepared to meet the requirements of the U.S. Environmental Protection Agency's Risk Management Program regulations as stated in 40 CFR Part 68 (Appendix A), as well as the California Accidental Release Prevention (CalARP) program regulations.\n\n\n\n2.    The JCI Facility and the Regulated Substances Handled\n\n\n\nThe primary function of this facility is to protect public health by supplying chemicals including chlorine and sodium hypochlorite to disinfect bulk water systems. The pr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000097004,
      "SummaryText": "imary operations conducted at this facility include the distribution of inorganic chemicals and repackaging of inorganic gases. Chemicals are brought on site in bulk quantities (railcars, tank trucks, etc.), repackaged into smaller containers, and then transported to customers on an as-needed basis. Any residual compressed gas is absorbed in an appropriate solution and sold as product.  The regulated substances handled by this facility are chlorine and sulfur dioxide.\n\n\n\n3.    The General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nThe prevention programs described in this facility's Safety and Safety Training Manuals represent integrated administrative controls intended to ensure the safety of workers, the public, and the environment. Many of these prevention programs (e.g., PHAs, compliance audits, incident investigations) result in the development and implementation of additional safeguards (administrative and engineering controls). All covered processes have control systems designed to maintain operating parameters (temperature, pressures, flow, and level) within allowable limits. The covered processes are also equipped with alarms to alert personnel when the operating parameters exceed the allowable limits. This facility developed procedures and conducted training of personnel to familiarize them with the consequences of exceeding allowable limits (safety and operability) to ensure the correct response to the alarms. Safeguards to prevent, detect, or mitigate accidental releases of regulated substances are described in the facility's Safety and Safety Training Manuals.\n\n\n\nIn addition, a seismic evaluation of the facility was conducted on September 28, 1992.  A follow-up seismic evaluation of the facility, which included a walk down review, was conducted on June 2, 1999 in accordance with the 1997 uniform building code.  An updated CalARP Seismic Assessment, including a walk down review, was conducted on October 4, 2006 by Olweny"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000097004,
      "SummaryText": " & Associates, Inc.  The seismic assessment was conducted in accordance with the guidance document for CalARP seismic assessments (January 2004) approved by the Region I Local Emergency Planning Committee (LEPC).  Another updated CalARP Seismic Assessment, including a walk down review, was subsequently conducted on September 19, 2011 by Olweny & Associates, Inc.  This seismic assessment was conducted in accordance with the guidance document for CalARP seismic assessments (September 2009) approved by the Region I LEPC.  Another updated CalARP Seismic Assessment, including a walk down review, was subsequently conducted on October 3, 2016 by Olweny & Associates, Inc.  This seismic assessment was conducted in accordance with the guidance document for CalARP seismic assessments (March 2014) approved by the Region I LEPC.  Another updated CalARP Seismic Assessment, including a walk down review, was subsequently conducted on September 20, 2021 by Olweny & Associates, Inc.  This seismic assessment was conducted in accordance with the guidance document for CalARP seismic assessments (January 2019) approved by the Region I LEPC.\n\n\n\nA seismic monitoring system is installed to the present mitigation system.  This system will activate/engage at 0.147 Gs (Earth Acceleration) and completely shut down the production process.\n\n\n\n4.    The Five-Year Accident History\n\n\n\nThis facility compiled a five-year accident history (January 1, 2016 to the present) for all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage as required by the RMP regulations. The five-year accident history allows the facility to explain to the community the factors causing or contributing to accidental releases, the on-site and off-site impacts of accidental releases, and the procedural and technological changes made to minimize the likelihoo"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000097004,
      "SummaryText": "d that these accidental releases will ever occur again. The intent of this information exchange is to create an informed community, while also documenting that accidental releases are investigated, and concrete changes are made to protect against recurrence.\n\n\n\nPersonnel at the facility reviewed all incident investigation reports from January 1, 2016 to the present to identify accidental releases of extremely hazardous substances that resulted in deaths, injuries, or significant property damage on site, or known off-site deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  No accidental releases were identified.\n\n\n\n5.    The Emergency Response Plan\n\n\n\nThe facility does not have its own written emergency response plan.  Instead, the facility is included in the written community emergency response plan.  These activities are coordinated through the Los Angeles City Fire Department.\n\n\n\nThe facility does though have a detailed Emergency Action Plan to cover minor incidents at the facility.  The facility's Contingency Plan Manual covers these activities.\n\n\n\n6.    Planned Changes to Improve Safety\n\n\n\nStudies associated with prevention program elements such as PHAs, incident investigations, management of change, and compliance audits are regularly conducted at this facility to verify designs and to identify potential hazards. Recommendations may be developed as a result of those studies and as a result of equipment inspections, safety meetings, review of industry experience, technology improvements, and employee suggestions. Once formulated, recommendations are reviewed, and corresponding action items are developed to implement each recommendation.\n\n\n\nJCI facility personnel reviewed the following documents to identify all action items that were formulated to reduce the risk (severity or likelihood) of an incident that could have plausibly resulted in an off-site consequence (i.e., the emergency response planning guideline level 2 [ERPG-2"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000097004,
      "SummaryText": "] developed by the American Industrial Hygiene Association for toxic gases):\n\n\n\nAccident Investigation Reports\n\nProcess Hazard Analysis\n\nStandard Operating Procedures\n\n\n\nIn early 2020, the facility implemented a 12-camera system that records continuously and maintains these recordings for at least two weeks. The system's cameras have state-of-the-art night vision with motion detection. The cameras cover several areas of the railcars, the plant, and the gate. One camera at the gate is focused to capture license plates. In addition to the gate cameras, there are two door phones used at two heights for drivers to call the office for access to the facility. Each door phone has a high-quality camera which provides a clear, close-up view of the driver and the side of the truck. The door phones are also tied into a paging system that will alert all plant and office personnel of incoming requests for entry into the facility. Another door phone placed on the guard shack, which also has a camera, is used for outbound access, and requires a call to the staff to allow exiting the facility.\n\n\n\n7.    Worst Case and Alternative Case Release Scenarios\n\n\n\nWorst Case Release Scenario: Entire contents of 180,000-pound railcar of Sulfur Dioxide.\n\n\n\nAlternative Case Release Scenario #1: A chlorine container begins leaking at the filling station at any time during the repackaging process, to include immediately before or after the connection or disconnection process, for any reason to include employee error.\n\n\n\nAlternative Case Release Scenario #2: A sulfur dioxide container begins leaking at the filling station at any time during the repackaging process, to include immediately before or after the connection or disconnection process, for any reason to include employee error.\n\n"
    }
  ]
}