{
  "FacilityID": 1000024303,
  "FacilityName": "Westech Aerosol Corporation",
  "FacilityStr1": "5405 Constance Dr. SW",
  "FacilityStr2": null,
  "FacilityCity": "Bremerton",
  "FacilityState": "WA",
  "FacilityZipCode": "98312",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53035",
  "LEPC": "Kitsap County LEPC",
  "FacilityLatDecDegs": "47.501069",
  "FacilityLongDecDegs": "-122.776086",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 128679326,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "David Carnahan",
  "OperatorStr1": "5405 Constance Drive S.W.",
  "OperatorStr2": null,
  "OperatorCity": "Bremerton",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98312",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jim Manlove",
  "RMPTitle": "Vice President, Operations",
  "FTE": 25,
  "OtherEPAFacilityID": "98367WSTCH545CN",
  "EPAFacilityID": "100000208615",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-11-03 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-09-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-11-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-11-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2012-11-13 00:00:00",
  "DeRegistrationEffectiveDate": "2012-11-05 00:00:00",
  "AnniversaryDate": "2016-11-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029715,
      "AltID": "Storage",
      "FacilityID": 1000024303,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000030016,
          "ProcessID": 1000029715,
          "NAICSCode": "32552",
          "_desc": {
            "NAICS_CODE": "32552",
            "NAICS_DESCRIPTION": "Adhesive Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035708,
          "ProcessID": 1000029715,
          "ChemicalID": 155,
          "Quantity": 38000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000030198,
              "ProcessChemicalID": 1000035708,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000030199,
              "ProcessChemicalID": 1000035708,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000035709,
          "ProcessID": 1000029715,
          "ChemicalID": 130,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 130,
            "ChemicalName": "Methyl ether  [Methane, oxybis-]",
            "CASNumber": "115-10-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000535708,
          "ProcessID": 1000029715,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000535709,
          "ProcessID": 1000029715,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024303,
      "SummaryText": "Westech Aerosol Corporation is located in Bremerton, Washington within an industrial park owned by the Port of Bremerton.  The facility manufactures high quality industrial strength adhesives used in a variety of industries such as furniture, upholstery, and marine manufacturing; automotive finishing; manufactured housing and recreational vehicle construction; and woodworking.  Many of Westech's adhesives are low-VOC and meet stringent California regulations regarding VOC content and also qualify for LEED credits under Credits 5.1/5.2, Credit 4.1, and Credit 4.4 (all products).  There are 25 employees at Westech covering research and development, production, marketing, and administration departments.\n\n\n\nWestech management is committed to providing and maintaining a working environment that is free of hazardous or unsafe conditions in accordance with the written Safety Policy and Accident Prevention Program.  Department managers and supervisors are responsible for implementation and enforcement of safety standards and laws.  Employee safety meetings are held on a monthly basis.   \n\n\n\nWestech products are made by dissolving proprietary ingredients in solvents in large mix-tanks.  The resultant adhesive is then moved to one of two production centers where it is packaged into either aerosol cans or high pressure canisters.  All containers are pressurized using one of the two regulated flammable gases that are stored in large tanks in the facility's parking lot.  These gases, methyl ether (methane, oxybis-) and isobutane/propane mixture, serve as propellants for many of Westech's products. \n\n\n\nSeveral specially trained, experienced employees are authorized to transfer the flammable gases from the large tanks into the portable tanks in accordance with a written Standard Operating Procedure.  The employee observes the entire transfer process to ensure that there is no release of flammable gas.  Hoses, valves, and nozzles are inspected monthly for wear and/or malfunction.  "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024303,
      "SummaryText": "\n\n\n\nWestech's emergency response activities are coordinated with local emergency responders and the facility is included in the written Kitsap County Department of Emergency Management Community Response Plan.  Employees have been instructed to notify 911 in the event of a release of a regulated substance.  Manual fire alarms are connected directly to the Fire Department for immediate response.  The most recent response training was conducted in 2009 and also covered spill response and notification procedures for releases occurring within the production area.  Westech has had no accidental release of a regulated substance wihin the past five years.\n\n\n\nAs a result of significant turnover of employees and recent company reorganization, much of the training, maintenance, and planning documentation has been difficult to locate.  \n\n\n\nFollowing an inspection by the local Fire Department (initally conducted in June of 2011, with a follow-up on October 3, 2011), Westech has established a Compliance Agreement with that Department.  The following represents a list of required actions with time lines for completion:\n\n   Phase 1\n\n      1.  Provide flammable gas detection, to be tied in with gas valves from all sources to automatically close upon fire alarm activation or levels >25% of the LEL.   Completion:  December 1, 2011 (Gas detector will be installed by November 23, 2011.) \n\n      2.  Complete all electrical improvements as discussed in Fire Department report.  Completion:  December 1, 2011 \n\n      3.  Install panic and emergency lighting.  Completed October 3, 2011\n\n      4.  Discontinue indoor open spray operations until spray booth is intalled.  Completion October 3, 2011 (Spraying was discontinued immediately following the inspection.)\n\n   Phase 2\n\n      1.  Install mandatory ventilation and spray booth.  Completion:  March 1, 2012  (Spray booth has been ordered, will be delivered the week of 11/14/2011)\n\n      2.  Complete engineering analyses regarding explosion con"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024303,
      "SummaryText": "trol provisions.  Completion:  March 1, 2012\n\n      3.  Replace heating units and forklifts.  Completion:  March 1, 2012\n\n   Phase 3\n\n      1.  Make all necessary adjustments to sprinkler system including emergency power and fire pump.  Completion:  June 4, 2012\n\n      2.  Define and adjust all storage areas as discussed in Fire Department report.  Completion:  June 4, 2012\n\n   Phase 4\n\n      1.  Install secondary containment and spill control.  September 3, 2012\n\n      2.  Implement a Hazardous Material Plan and an Emergency Reponse Plan, remove wiring from sprinkler piping, obtain additional operation approval.  Completion:  September 3, 2012\n\n\n\nIn addition to these actions mandated by the Fire Department, no later than February 1, 2012, Westech will also develop written plans of action regarding implementation of Employee Participation, Management of Change, and Compliance Programs; and will establish and implement written procedures to maintain the integrity of process equipment.  A revised Training Program that includes a method for maintaining proper documentation will be initiated no later that February 2, 1012, as will revised Safety and Health, Emergency Action, Fire Prevention, Hot Work Permit, and Contractor Safety Plans as necessary. \n\n\n\nThe Washington State Department of Labor and Industries has conducted several assist visits during October, 2011.  The Safety Division suggested six corrective actions which have all been addressed by Westech.  The Industrial Hygiene Division made several verbal recommendations but has not submitted a written report as of November 7, 2011.  Any corrective actions identified will be addressed as soon as possible after receiving this report.   \n\n\n\nUpdate as of May 17, 2012:  The State of Washington Department of Labor and Industries conducted a site consultation on November 3, 2011 and identified twelve process safety hazards in their report of February 9, 2012.  As of this date, Westech has corrected all of these hazards "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024303,
      "SummaryText": "and has no open findings. \n\n\n\nProcess area flammable gas detectors were installed in July of 2012.  Awaiting final connection to alarms system.       \n\n  "
    }
  ]
}