{
  "FacilityID": 1000106037,
  "FacilityName": "Freeport LNG Pretreatment Facility",
  "FacilityStr1": "2363 CR 690",
  "FacilityStr2": null,
  "FacilityCity": "Freeport",
  "FacilityState": "TX",
  "FacilityZipCode": "77541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48039",
  "LEPC": "Freeport CAP",
  "FacilityLatDecDegs": "28.984942",
  "FacilityLongDecDegs": "-95.308669",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.freeportlng.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 140787743,
  "ParentCompanyName": "Freeport Liquid Natural Gas Development, LP",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Freeport Liquid Natural Gas Develop",
  "OperatorStr1": "333 Clay Street",
  "OperatorStr2": "Suite 5050",
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": "4173",
  "FTE": 102,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000238094",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "03958",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-08-03 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-08-03 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-08-03 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 28.980267,
  "FRS_Long": -95.305262,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132435,
      "AltID": "PTF - NGL Condensate",
      "FacilityID": 1000106037,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000165885,
          "ProcessID": 1000132435,
          "ChemicalID": 155,
          "Quantity": 35769.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000148410,
              "ProcessChemicalID": 1000165885,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000148411,
              "ProcessChemicalID": 1000165885,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000148412,
              "ProcessChemicalID": 1000165885,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000148413,
              "ProcessChemicalID": 1000165885,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000148414,
              "ProcessChemicalID": 1000165885,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000133867,
          "ProcessID": 1000132435,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106037,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-03-08 00:00:00",
    "ERTrainingDate": "2023-02-01 00:00:00",
    "CoordinatingAgencyName": "CAER",
    "CoordinatingAgencyPhone": "9792382237",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106037,
      "SummaryText": "ess changes at the facility.  The plan also provides a means to ensure that employees are informed of changes to the facility's Emergency Response Plan.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nChemical safety has been a part of the working culture at the facility during the pre-start up activities such as training and procedure development. Chemical exposure risks to employees and the public have been emphasized through ongoing internal risk reduction efforts as well as adherence to regulatory requirements. Ongoing improvements to the safety program will include implementation of behavior based safety. Facility improvements addressing newly recognized safety issues will be incorporated into the existing safety program through the use of the facility's Management of Change Program.\n\nREASON FOR PROGRAM LEVEL CHANGE\nThe worst-case scenario for PTF was the release of 35,769 lbs of a flammable mixture (butane, ethane, methane, pentane and propane) with an endpoint of .3 miles. The endpoint was determined using EPA's RMP*Comp(TM).  The worst-case consequence modeling showed no public or environmental receptors within the .3 miles endpoint.  The process/site has not had any accidental releases in the past 5 years with offsite impact since its last RMP submission.  By definition, the PTF should now be classified as a Program Level 1 RMP process even though it is covered by PSM."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106037,
      "SummaryText": "eum Institute (API) Standards;\n\nCritical equipment is inspected on a planned, periodic basis to ensure proper operating condition;\n\nOperators are trained to monitor level indicators and metering devices to prevent overfilling of storage tanks;\n\nRelief valves and administrative controls are designed to prevent vessel and tank over-pressure;\n\nAccess to the facility is restricted through security barriers and trained security personnel, thereby minimizing the risk to tanks and vessels by vehicular damage or sabotage;\n\nA safety permitting system is used to ensure routine and non-routine work is carried out after identification and implementation of safe work practices.\nA written employee participation plan is in place; employees participate in development of process hazard analysis and on the development of the process safety management plans;\n\nEmployees also have access to process hazards analysis and to all other required information.\n\n\nFIVE-YEAR ACCIDENT HISTORY\nThe Freeport LNG Pretreatment facility has never had an accident or incident involving a release of a flammable mixture resulting in deaths, injuries, property/environmental damage, evacuations, or sheltering-in-place in the past 5 years.\n \nEMERGENCY RESPONSE PROGRAM\nA written Emergency Response plan is maintained at the facility. The plan was developed in cooperation with civil authorities and was coordinated with the community emergency response plan. The emergency response plan includes procedures for notifying civil authorities and the public in the event of an incident. The plan includes documentation of proper first aid and medical treatment necessary to treat accidental human exposure; procedures for the use of emergency response equipment and for its inspection and testing. The plan also includes a description of the training program for all employees in relevant emergency response procedures as well as procedures for review and update of the Freeport LNG Emergency Response Plan as appropriate to addr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106037,
      "SummaryText": "mixture of hydrocarbons. The NGL is present at or above the minimum threshold for RMP applicability. NGL is comprised of varying percentages of methane, ethane, propane, pentane, hexane, heptane, octane and nonane, each of which are flammable substances. \n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe Freeport LNG Oyster Creek facility has an accidental release prevention program in place to minimize the risk of hazardous chemical releases. This program is designed to address the requirements of 29 CFR 1910.119, - OSHA's Process Safety management (PSM) and 40 CFR 68 - EPA's Risk Management Program. This prevention program addresses management systems which handle the regulated substances. The accidental release prevention program includes the following components and activities:\n\nIn depth hazard analyses are completed every five years by qualified personnel;\n\nWritten operating procedures are used for training and directing the work of operators, who receive refresher training every three years;\n\nOperators, mechanics and contractor personnel are qualified and trained in the general hazards in the facility, and informed of any temporary situations affecting safety;\n\nA management of change system is in place to ensure that process-operating changes are managed safely;\n\nPre-start up reviews are performed to ensure that conditions for safe operation have been satisfied prior to starting new or modified equipment;\n\nIncidents are investigated and actions taken as part of a continuous improvement effort; Routine audits are conducted to ensure that safe practices are being followed;\n\nStorage vessels are designed and constructed in accordance with American Society of Mechanical Engineers (ASME) pressure vessel standards using industry-standard practices of construction. As part of the Mechanical Integrity program, pressure vessels and transfer lines are inspected and tested according to applicable sections of the American Petrol"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106037,
      "SummaryText": "EXECUTIVE SUMMARY 2018 RISK MANAGEMENT PROGRAM UPDATE\nA Risk Management Program has been implemented at the Freeport Liquid Natural Gas (LNG), Oyster Creek, Texas natural gas Pretreatment Facility (PTF) to reduce the risk of accidental releases of hazardous materials. This Risk Management Plan summarizes the management, administrative, procedural and technological controls that work together to minimize the risk of hazardous chemical releases to the community.\n\nFREEPORT LNG POLICIES FOR ENVIRONMENT, HEALTH AND SAFETY\nRisk management and safety are core principles at Freeport LNG. Freeport LNG is committed to conducting its operations in a safe, responsible manner and to reduce risks to health and the environment. Commitment to environment, health and safety (EHS) starts with the CEO. Senior management routinely dedicates time to review EHS matters. Emphasis on safety is carried through to the facility level, where the Production Manager and the Safety Department regularly review safety performance, take corrective actions and strive for continuous improvement. Freeport LNG's EHS programs include policies, procedures, standards, and guidance materials designed to fulfill Freeport LNG's commitment to environment, health and safety. These materials include Risk Management Program guidance to assist our facilities to prevent and/or reduce the risk of accidents. Should an accidental hazardous substance release occur, we also have implemented a comprehensive Emergency Response Program to promptly respond, address, and minimize the consequences of the release.\n\nFACILITY IDENTIFICATION AND REGULATED SUBSTANCES IN COVERED PROCESSES\nThe Freeport LNG natural gas pretreatment facility is located at 2363 CR 690, Oyster Creek, Texas. The facility pretreats natural gas to remove carbon dioxide (CO2), sulfur compounds, water, mercury, and heavy hydrocarbons. The regulated substance under 40 CFR 68, the EPA Risk management Program (RMP) rule is Natural Gas Liquid (NGL), a flammable"
    }
  ]
}