{
  "FacilityID": 1000014543,
  "FacilityName": "VWR International LLC",
  "FacilityStr1": "2039 Center Square Road",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeport",
  "FacilityState": "NJ",
  "FacilityZipCode": "08014",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34015",
  "LEPC": "Gloucester County OEM",
  "FacilityLatDecDegs": "39.765550",
  "FacilityLongDecDegs": "-075.365430",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "S1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.vwrsp.com",
  "FacilityEmailAddress": "wc_regulatory_affairs@vwr.com",
  "FacilityDUNS": 150982189,
  "ParentCompanyName": "VWR International LLC",
  "Company2Name": null,
  "CompanyDUNS": 150982189,
  "Company2DUNS": 0,
  "OperatorName": "VWR International LLC",
  "OperatorStr1": "2039 Center Square Road",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeport",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08014",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kyle Rebstock",
  "RMPTitle": "Director of Distribution",
  "FTE": 210,
  "OtherEPAFacilityID": "NJD086435070",
  "EPAFacilityID": "100000078373",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-03-24 00:00:00",
  "SafetyInspectionBy": "DOT",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-06-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-06-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2010-12-22 00:00:00",
  "DeRegistrationEffectiveDate": "2010-11-17 00:00:00",
  "AnniversaryDate": "2015-06-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.80083,
  "FRS_Long": -75.34778,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "CLASSICAL SURVEYING TECHNIQUES",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018223,
      "AltID": "Chemical Storage",
      "FacilityID": 1000014543,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018543,
          "ProcessID": 1000018223,
          "NAICSCode": "49311",
          "_desc": {
            "NAICS_CODE": "49311",
            "NAICS_DESCRIPTION": "General Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021600,
          "ProcessID": 1000018223,
          "ChemicalID": 4,
          "Quantity": 35000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 4,
            "ChemicalName": "Chloroform  [Methane, trichloro-]",
            "CASNumber": "67-66-3",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521600,
          "ProcessID": 1000018223,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014543,
      "SummaryText": "VWR International (VWR) is a distributor of high-quality chemicals and laboratory supplies.  The chemical products sold by VWR are received from manufacturers in U.S. Department of Transportation (DOT) approved containers (typically ranging from 1 pint to 55 gallons in volume).  VWR does not manufacture, formulate or otherwise engage in direct handling of chemicals outside of the containers in which the chemicals are received.  VWR operations consist of warehousing and distribution activities, and the risk of a serious chemical-related emergency is low.  However, VWR has a strong commitment to the safety and well being of its employees, the environment and the surrounding community.  The company has established a management system, consisting of policies, procedures, training, inspection, maintenance and other elements that are designed to prevent incidents from occurring.  In the event a minor or major emergency does occur, facility personnel have been trained to effectively manage the incident.\n\nAll warehousing operating involving regulated chemicals are considered a single A?covered processA? for regulatory purposes.  The VWR facility is considered to be covered under the Program 2 eligibility requirements (per 68.10A?) because VWR is not covered by one of the SIC codes listed under Program 3 nor OSHAA?s Process Safety Management requirements.\n\nAt the present time, chloroform in stock and anticipates that it may exceed the Threshold Quantity (TQ) for that substance under the revised New Jersey Toxic Catastrophe Prevention Act (NJ TCPA).  \n\nThe worst case release scenario is based on a hypothetical incident in which the single largest container stored at the site, a 200 liter (55 gallon)  drum, is pierced by a forklift and the contents are otherwise spilled on the floor of the distribution center.  The U.S. Environmental Protection Agency (EPA) Risk Management Program Guidance For Chemical Distributors was used to determine the farthest distance from the facility "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014543,
      "SummaryText": "that toxic effects may be anticipated, following the chemical release.   \n\nAdministrative controls and active mitigation measures were not included as a factor of consideration during the worst case or alternative release scenarios.  However, both release scenarios considered indoor releases using building mitigation.\nVWRA?s prevention program consists of several key elements, including:\n\n\nA?    Safety Information A? includes detailed information about the hazards of the regulated chemicals, maximum intended inventory, facility design features, applicable standards, equipment use and maintenance.\n\nA?    Hazard Review A? a process of evaluating facility operations, using warehouse industry checklists, to identify and control potential hazards.\n\nA?    Standard Operating Procedures A? written SOPA?s to guide employees in safety conducting normal, temporary and non-routine/emergency operations.\n\nA?    Training A? includes training commensurate with the types of activities employees are expected to perform during normal and emergency situations.\n\nA?    Maintenance A? required maintenance activities are performed by trained employees or qualified workers.\n\nA?    Compliance Audits A? conducted at least once every three years to verify compliance with regulatory requirements for Accidental Release Prevention.\n\nA?    Incident Investigation A? conducted whenever an incident occurs that results in, or could have resulted in, a catastrophic release (i.e., a release that presents an imminent and substantial endangerment to public health and the environment).\n\nThe need for chemical specific prevention steps is very limited because chemicals are contained within sealed DOT-approved containers, and the containers are not opened during handling.  Additionally, all chemicals are segregated and stored by hazard class to ensure that incompatible chemicals are not stored together.\n\nThe cross functional Safety Committee meets monthly to review progress on projects, close completed items and recommend changes"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014543,
      "SummaryText": " to improve the facility.\n\nThere have been no accidents in the previous five years that have resulted in any deaths or significant property damage on-site, or any off-site deaths, injuries, property damage, environmental damage, evacuations, or in-place sheltering from regulated substances or otherwise.  However, VWR has developed a comprehensive emergency response program, the site Integrated Prevention and Response Plan,  that addresses small and large-scale incidents, including coordination with outside agencies and responders.  This plan has been approved by the State of New Jersey Department of Environmental Protection under its Discharge Prevention, Containment and Countermeasures (DPCC) and Discharge Cleanup & Removal (DCR) Plan requirements."
    }
  ]
}