{
  "FacilityID": 1000023845,
  "FacilityName": "Coachella Cold Storage Facility",
  "FacilityStr1": "64-225 Highway 111",
  "FacilityStr2": null,
  "FacilityCity": "Mecca",
  "FacilityState": "CA",
  "FacilityZipCode": "92254",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06065",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "33.583090",
  "FacilityLongDecDegs": "-116.091998",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Grimmway Enterprises, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 33560509,
  "Company2DUNS": 0,
  "OperatorName": "Grimmway Enterprises, Inc.",
  "OperatorStr1": "P.O. Box 81498",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93380",
  "OperatorZipCodeExt": "1498",
  "FTE": 50,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197146",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-08-02 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-09-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-09-21 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-09-21 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-09-21 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029119,
      "AltID": "Refrigeration",
      "FacilityID": 1000023845,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034841,
          "ProcessID": 1000029119,
          "ChemicalID": 56,
          "Quantity": 12650.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000029379,
          "ProcessID": 1000029119,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000025166,
              "Process_NAICS_ID": 1000029379,
              "SafetyReviewDate": "2011-05-16 00:00:00",
              "PHA_Date": "2011-06-06 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-06-11 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": "Ammonia Dump Tank",
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Ammonia Dump Tank",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": "Hand-held monitors",
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 1,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 1,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-05-13 00:00:00",
              "TrainingReviewDate": "2011-05-13 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "RETA Certification",
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-05-13 00:00:00",
              "EquipmentInspectionDate": "2011-09-01 00:00:00",
              "EquipmentTested": "Compressors, condensors, piping, LRU, and seismic walk-through.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2011-04-28 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2011-05-26 00:00:00",
              "AuditCompletionDate": "2012-05-24 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2011-02-07 00:00:00",
              "HotWorkPermitReviewDate": "2011-03-10 00:00:00",
              "ContractorSafetyReviewDate": "2010-12-16 00:00:00",
              "ContractorSafetyEvalDate": "2010-12-17 00:00:00",
              "CBI_Flag": 0,
              "Description": "Refrigeration",
              "_chemicals": [
                {
                  "PrimaryKey": 1000029949,
                  "PreventionProgram3ID": 1000025166,
                  "ProcessChemicalID": 1000034841
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000023845,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2010-10-05 00:00:00",
    "ERTrainingDate": "2010-11-04 00:00:00",
    "CoordinatingAgencyName": "Fire Department",
    "CoordinatingAgencyPhone": "7603962173",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 0,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023845,
      "SummaryText": "I.  Executive Summary\n\nGrimmway Enterprises Inc.\nCoachella Cold Storage Facility, Mecca, CA\n\nExecutive Summary for Ammonia Refrigeration System\n\n1.  Accidental Release Prevention and Emergency Response Policies:\n\nWe at the Grimmway Enterprises, Inc., Coachella Cold Storage Facility are strongly committed to employee, public, and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program and our process safety management program that addresses such critical safety issues as design, installation, operation procedures, maintenance, and employee training associated with the hazardous processes at our facility.  It is our goal to implement appropriate control measures to prevent accidental releases of regulated substances.\n\n2.  The Stationary Source and Regulated Substances Handled:\n\nOur facilityA?s primary activities encompass vegetable processing and storage.  We have one (1) regulated substance present at our facility.  This regulated substance is Ammonia (anhydrous) and is used as a refrigerant in our plant.\n\nThe maximum inventory of Ammonia (anhydrous) at our facility is 12,650 lbs. (Maximum Operating Capacity).\n\n\nII.  Worst-Case Release Analysis\n\nTo evaluate the worst case scenarios, we have used the EPAA?s calculation software program RMP*Comp version 1.07.  Specific information regarding the exact parameters of our worst case scenario are available at the facility or at the Grimmway Enterprises Safety Department.\n\n\nIII.  Alternative Release Analysis\n\nTo evaluate the worst case scenarios, we have used the EPAA?s calculation software program RMP*Comp version 1.07.  Specific information regarding the exact parameters of our alternate case scenario are available at the facility or at the Grimmway Enterprises Safety Department.\n\n\nIV.  Five-Year Accident History\n\nThe Grimmway Enterprises, Inc., Coachella Cold Storage Facility has had an excellent record of preventing accidental releases during its operation.  There"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023845,
      "SummaryText": " have been no accidental releases during the past five years.\n\n\nV.  Document Management System\n\nGrimmway Enterprises Inc. has established an Ammonia Refrigeration System PSM/RMP program at all its company facilities in order to protect company and contract personnel, surrounding community and property by preventing or minimizing the consequences of catastrophic releases of hazardous chemicals.\nThis goal is accomplished by implementing a comprehensive management program that integrates engineering controls, administrative procedures, and employee participation.  The program contains all of the elements necessary to comply with the accidental release prevention requirements set out under 40 CFR, Part 68 of the EPA.\nThe responsibility for the management of the Process Safety Management and Risk Management Programs rests with the Facility General Manager supported and assisted by the GEI Safety Director and Facility Department Managers.\n\nGEI has assigned the overall responsibility for the development and implementation of the Process Safety Management Program and the Risk Management Program to the Safety Director.\n\nThe Safety Director has delegated specific program responsibilities as follows:\nProgram Element                 Assigned Responsibility\nSafety Information:              Safety Director\nHazard Review:                   Safety Director\nOperating Procedures:         Refrigeration Engineer\nTraining:                             Department Manager\nMaintenance:                      Maintenance Manager\nCompliance Audits:              Safety Director\nAccident Investigation:         Safety Director\n\n\n\nVI.  Process Safety Information\n\nThe Grimmway Enterprises, Inc., Coachella Cold Storage Facility maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all covered processes.  This information can be found in the Facility Information Manual kept on site at all times.  This informati"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023845,
      "SummaryText": "on is reviewed periodically as changes and regulation require.\n\n\nVII.  Process Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our covered processes are identified and controlled efficiently.  The methodology used to carry out these analyses is HAZOP.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at regular intervals (as dictated by facility changes or regulation).\n\n\nVIII.  Operating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, the Grimmway Enterprises, Inc., Coachella Cold Storage Facility maintains a written standard operating procedures.  These procedures address various modes of operation such as initial start up, emergency shutdown, or machine specific operational steps.  These procedures are regularly reviewed and are readily accessible to operators involved in the covered process.\n\n\nIX.  Training\n\nThe Grimmway Enterprises, Inc., Coachella Cold Storage Facility has a comprehensive training program in place to ensure that employees who are operating process equipment are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three (3) years or more frequently as necessary.  Training documentation is maintained for all process operators.\n\n\nX.  Mechanical Integrity\n\nThe Grimmway Enterprises, Inc., Coachella Cold Storage Facility employs a highly documented system of maintenance checks for process equipment to ensure proper operation and safety.  Process equipment examined by these checks and includes (among other items): pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, and pumps.  The timing of these inspections follow the recommended guidelines available from the manufacturer and the International Institute of Ammonia Refrigeration.  Maintenance operations"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000023845,
      "SummaryText": " are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are provided specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\nXI.  Incident Investigation\n\nThe Grimmway Enterprises, Inc., Coachella Cold Storage Facility has a system in place to promptly investigate any incident resulting in, or that could reasonably have resulted in a catastrophic release of a regulated substance.  These investigations are to be undertaken to identify the situation leading into the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of five years.  As of the date of this report, there have been no incidents to investigate at this facility.\n\n\nXII.  Compliance Audits\n\nThe Grimmway enterprises safety department conducts audits of all Grimmway enterprises facilities on a regular basis to determine whether the provisions is set out under the are RMP rule are being implemented.  These audits are carried out at least every three years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  The next audit scheduled for this facility will take place in July of 2007.\n\n\nXIII.  Management of Change\n\nWritten procedures are in place at the Grimmway Enterprises, Inc., Coachella Cold Storage Facility to manage changes in process chemicals, technology, equipment and procedures.  The most recent a review/revision of management of change procedures was performed on 7/3/06.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and provided training to deal with the modification.  The written materials and management program are also updated accordingly.\n\n\nXIV.  Pre-Startup Safety Review\n\nPre-start up safety reviews related to new pro"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000023845,
      "SummaryText": "cesses and two modifications and established processes are conducted as a regular practice at the Grimmway Enterprises, Inc., Coachella Cold Storage Facility.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe start up prior to placing equipment into operation.\n\n\nXV.  Contractors\n\nOn occasion our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough and evaluation of safety performance of the contractor is carried out.  The Grimmway Enterprises, Inc., Coachella Cold Storage Facility has a strict policy of informing the contractorA?s of known potential hazards related to the contractorA?s work and the processes involved.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\nXVI.  Employee Participation\n\nThe Grimmway Enterprises, Inc., Coachella Cold Storage Facility truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facilityA?s implementation of the RMP rule, including information from process hazard analyses in particular.\n\n\nXVII.  Hot Work Permits\n\nIn order to prevent accidental fires or explosions throughout the Grimmway Enterprises, Inc., Coachella Cold Storage Facility, and especially to prevent explosions and fires associated with all covered processes, the company has established a comprehensive Hot Work Permit program.  This Hot Work Permit Program is designed to prevent ignition of combustible and flammable materials from occurring during the course of welding, flame cutting, soldering, hot tapping, or similar activities which may produce flames or sparks. These guidel"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000023845,
      "SummaryText": "ines follow the prescribed method outlined in ANSI Z49.1-1973 and fulfill the requirements of Title 8 A?4848 enforced by Cal/OSHA.\n\n\nXVIII.  Emergency Response Plan\n\nThe Grimmway Enterprises, Inc., Coachella Cold Storage Facility has established a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuation procedures, notification of local emergency response agencies and the public, as well as past incident decontamination of affected areas.\n\n\nXIX.  Planned Changes to Improve Safety\n\nAs the result of implementing the elements of the RMP/PSM program at the Grimmway Enterprises, Inc., Coachella Cold Storage Facility several issues have been identified for investigation regarding potential improvements to safety.  Some of these elements include the installation of impact barriers around the high-pressure receivers, the provision of hand held ammonia monitors for maintenance personnel, and additional signage at various locations in the plant.  These elements and others will be thoroughly investigated and implemented as warranted.  It is anticipated that these issues will have been addressed by 7/1/07."
    }
  ]
}