{
  "FacilityID": 1000027920,
  "FacilityName": "Coastal Cooling, LLC",
  "FacilityStr1": "11296 Blackie Road",
  "FacilityStr2": null,
  "FacilityCity": "Castroville",
  "FacilityState": "CA",
  "FacilityZipCode": "95012",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.756944",
  "FacilityLongDecDegs": "-121.744722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Coastal Cooling, LLC",
  "OperatorStr1": "11296 Blackie Road",
  "OperatorStr2": null,
  "OperatorCity": "Castroville",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95012",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000063414",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-12-06 00:00:00",
  "SafetyInspectionBy": "Cal/OSHA PSM Unit",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-04-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-04-17 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-04-17 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2017-04-17 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.756944,
  "FRS_Long": -121.744722,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034048,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000027920,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000041152,
          "ProcessID": 1000034048,
          "ChemicalID": 56,
          "Quantity": 13513.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000034310,
          "ProcessID": 1000034048,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000029739,
              "Process_NAICS_ID": 1000034310,
              "SafetyReviewDate": "2012-03-12 00:00:00",
              "PHA_Date": "2012-01-27 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Ammonia-Water Diffusion",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-01-12 00:00:00",
              "TrainingReviewDate": "2011-12-31 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Online",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-03-02 00:00:00",
              "EquipmentInspectionDate": "2012-01-27 00:00:00",
              "EquipmentTested": "PHA Walk-Through System 3",
              "ChangeMgmtDate": "2012-03-01 00:00:00",
              "ChangeMgmtReviewDate": "2010-03-02 00:00:00",
              "PreStartupReviewDate": "2012-03-30 00:00:00",
              "ComplianceAuditDate": "2010-03-02 00:00:00",
              "AuditCompletionDate": "2010-12-31 00:00:00",
              "IncidentInvestigationDate": "2011-07-23 00:00:00",
              "InvestigationChangeDate": "2011-08-03 00:00:00",
              "ParticipationPlansReviewDate": "2010-03-02 00:00:00",
              "HotWorkPermitReviewDate": "2010-03-02 00:00:00",
              "ContractorSafetyReviewDate": "2011-12-28 00:00:00",
              "ContractorSafetyEvalDate": "2010-03-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000035443,
                  "PreventionProgram3ID": 1000029739,
                  "ProcessChemicalID": 1000041152
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000027920,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2012-01-02 00:00:00",
    "ERTrainingDate": "2012-04-07 00:00:00",
    "CoordinatingAgencyName": "CUPA/Monterey County Health Dept",
    "CoordinatingAgencyPhone": "8317554511",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "Calif. Chapter 6.95 Article 1 Section 25500",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000027920,
      "SummaryText": "Coastal Cooling, LLC\r\n\r\nINTRODUCTION - RMP eSubmit Executive Summary April 2012\r\n\r\nCalifornia has adopted the Federal RMP Program with additional state-specific requirements; the State Program is known as the California Accidental Release Prevention Program or Cal/ARP (collectively; Cal-ARP RMP/PSM).  In the Program Level 3 designation, Cal/ARP includes CA Title 8, Section 5189 Process Safety Management as the basis for the Prevention Program component of the Plan.  Coastal Cooling is updating its RMP (and the associated submittal) due to a modification to its ammonia refrigeration process.  While the process modification is a closed-loop refrigeration system containing less than 10,000 lb. Anhydrous Ammonia, it is considered \"co-located\" due to its proximity to the Main System. As such the modification is being added to Coastal's RMP/PSM Program in the Level 3 designation.  The RMP is also being updated to correct errors in the previously developed Offsite Consequence Analysis.    \r\n\r\nA.\tRMP EXECUTIVE SUMMARY \t\r\n1.\tAccidental Release Prevention and Emergency Response Policies\r\n\r\nThe Coastal Cooling Accidental Release Prevention and Emergency Response Policies are simply not to have accidental releases or emergencies.  The Company endeavors to execute these policies through the daily implementation of its Safety Programs.  Company safety programs include, but are not limited to the Process Safety Management Program (PSM) for its Program Level III Process.  The PSM Program is an integrated, holistic approach to the safe operation of processes using Regulated Substances.  The design of the Process in use and the PSM Program are specifically intended to prevent accidental releases, and to deal safely with emergencies if and when they do happen.  It is the primary goal of Coastal Cooling to protect its employees, visitors and neighbors from harm due to Company operations.  With this in mind, the priorities of protection of life, the environment, and then property have b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000027920,
      "SummaryText": "een established.\r\n   \r\nThe Company also recognizes the need to be prepared for accidental releases that could occur should established prevention programs fail. In addition to a Fire Alarm and Sprinkler System, the site's main ammonia refrigeration process is equipped with an ammonia monitoring, control and alarm system, including the recent modification.  The monitoring system is supervised on-site and remotely by a third party alarm company.  If and when an ammonia leak is detected, notifications and alarms are triggered.  Our policy is to regularly test and maintain emergency safety systems per our Mechanical Integrity Program, which is intended to ensure proper operation, actuation and function of the refrigeration-related systems and components.  The Plant is also equipped with Ammonia-Water Diffusion Tank Systems (ADT).  The function of an ADT system is to prevent ammonia from venting to atmosphere should a Pressure Relief Valve lift. \r\n \r\nThe Company has adopted a \"Non-responding Facility Emergency Response Policy\".  The Plant's California Hazardous Material Business Plan was developed to be consistent with Emergency Action Plan requirements (i.e. notify and evacuate).  Emergency response pre-planning is coordinated through the local Certified Unified Program Agency (Monterey County Health Department/CUPA). The CUPA inspects the plant and receives copies of the Business Plan which is routinely updated.  It is our policy to maintain RMP/PSM compliance, a good working relationship with the Monterey County Health Department/CUPA, and other Public Emergency Responders that are part of the Monterey County Emergency Response Mutual Aid Agreement.\r\n\r\nCoastal Cooling's ammonia refrigeration process is supported by Western Precooling Systems (WPS), which is a stakeholder in the operation.  WPS is a well-known and reputable supplier of portable ammonia refrigeration equipment and services.  WPS has a Regional Service Center in Castroville within two miles of the Coasta"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000027920,
      "SummaryText": "l Cooling facility.  WPS employs experienced ammonia technicians that are trained beyond 1910.120 \"Awareness\" level.  WPS supports training and certifications for its technicians via the Refrigerating Engineers and Technicians Association (RETA).  WPS technicians are \"on call\" to the facility 24/7/365.  WPS assists Coastal Cooling with implementation of its RMP/PSM Accidental Release Prevention Program elements, and would serve as a technical resource in an emergency situation.\r\n\r\nIt is through these measures, policies and pre-planning that Coastal Cooling endeavors to maintain effective Accidental Release Prevention and Emergency Response.\r\n    \r\n2.\tGeneral Description of the Stationary Source and Regulated Substances\r\n\r\nCoastal Cooling, LLC is a California Limited Liability Company made up of Western Cooling and Logistics, LLC-50% and Western Precooling Systems-50%.  The facility is an ammonia refrigeration plant located in Castroville, CA, in a commercial/industrial area on the SE side of the city.  Coastal Cooling leases the property and refrigerating equipment from Western Precooling Systems (WPS).  The ammonia refrigeration process was built in 1985 with expansions in 1994 and 1998, and modifications in 2011.  From 1999 to 2006, this facility was registered under the D'Arrigo Bros. Company.  In December 2006 the facility closed and D'Arrigo Bros. de-registered from the RMP Program.  The facility was re-opened by Dole Fresh Vegetables (Dole) in 2008.  The Dole RMP Plan was Certified on 03/18/2008.  The local CUPA was involved in its development including participation in the 2008 Process Hazard Analysis (PHA).  Dole stopped operating at the facility and moved out at the end of the 2008/2009 season.  Coastal Cooling, LLC started leasing the facility in early 2010, notified the local CUPA Agency, and took responsibility for ongoing development and implementation of the RMP Program.  Coastal filed an RMP update with EPA and the local CUPA on 3/2/2010.  RMP changes"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000027920,
      "SummaryText": "not affecting the Federal RMP eSubmit Report were completed in June, 2010, but were filed with the local CUPA Agency.  Western Precooling Systems purchased the facility from D'Arrigo Brothers in early 2011, but Coastal Cooling LLC remains the Lessee.  Ice-making equipment has been removed and pressure cooling capabilities expanded.  This RMP update is intended to address those changes.\r\n\r\nThe refrigeration process is used for pre-cooling and short-term refrigerated storage of fresh produce, primarily strawberries.  The facility is open year-around with a busy season picking up in early March and continuing through the summer months.  Remaining months may see little in the way of fresh produce; however the refrigeration equipment is still operative.  Annual refrigeration equipment maintenance is performed during low-season winter months. \r\n\r\nThe Regulated Substance in use is anhydrous ammonia (NH3) CAS #7664-41-7, which is used as the refrigerant in three mechanical refrigeration systems.  These three systems are collectively considered one \"Process\" as defined by RMP/PSM Rules.  Refrigerating process equipment overall consists of Pressure Vessels, Compressors, Evaporative Condensers, Room-Unit Evaporators, Pressure Cooler Units and associated valves, instrumentation and piping.  Pressure and temperature controls are installed in accordance with appropriate codes & standards, including isolation and overpressure relief valves.  Pressure relief valves are piped to headers that terminate at one of three ammonia-water diffusion tanks.  In addition to automated monitoring, pre-qualified personnel regularly check the refrigeration system for proper operating parameters.\r\n\r\nAs noted above, there are three systems that comprise the ammonia refrigeration process.  System 1 consists of a complete high (compression) and low (evaporators) side refrigeration system that supports pressure cooling within the main cold storage building.   System 2 consists of a complete high and l"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000027920,
      "SummaryText": "ow side refrigeration system that supports room evaporators which are located inside the main cold storage building.  System 3 consists of a portable high-side compression skid that supports two portable pressure cooling units located inside the main cold storage building.  Systems 1 & 2 are interconnected via cross-over valves, but operate independently of each other.  System 3 is located in close proximity to the other two systems.\r\n\r\n3.\tGeneral Accidental Release Prevention Program and Chemical Specific Prevention Steps\r\n\r\nAccidental Release Prevention Program\r\n\r\nAs noted above a PSM (CCR 8, 5189) Plan has been established within the existing RMP.  The PSM Program is specifically intended to promote the safe operation of the ammonia-handling equipment and to prevent accidental releases.  Coastal Cooling strives to make the PSM Program an integral part of daily Plant operation.  Other safety programs are integrated with the PSM Program, to the extent practicable, appropriate and/or required (such as the California Injury and Illness Prevention Program/IIPP).  \r\n\r\nWPS is the company that inspects and performs mechanical maintenance of the ammonia refrigeration equipment.  Schedules and written procedures for the operation and maintenance of ammonia-handling equipment, including the steps to be taken in the event of a release or threatened release, have been developed.  Written procedures include necessary safety precautions for operations, inspection, maintenance, and moving of portable equipment (Pressure Coolers & Compressor Skids).  In addition to existing equipment technical documentation and procedures, WPS also maintains an extensive library of refrigeration equipment technical documentation including written manufacturer reference manuals and technical bulletins.  As maintenance needs are determined, the need is expressed at the WPS workload meetings conducted by the WPS Area Manager.  The specific task for the expressed need is decided by the WPS Area Manag"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000027920,
      "SummaryText": "er and entered into the WPS service call system. Tasks are then tracked to completion through the service call system.  Through this regular routine of inspect, discuss, assign and confirmation of completion, Coastal Cooling and WPS reduce equipment operational problems and potential for releases.\r\n\r\nWPS actively encourages its ammonia technicians to seek Certification through the Refrigerating Engineers and Technicians Association (RETA).  Technicians only perform tasks for which they have been pre-qualified.\r\n\t\r\nChemical-Specific Prevention Steps\r\nHistorically it has become apparent in the industry that a mishap while draining oil from a system was one of the most common ammonia release incidents to occur.  To correct this issue special self-closing valves are installed as a permissive for oil drain flow.  If a release were to develop during the oil-draining task, the mechanic simply releases the handle of the self-closing valve and flow is terminated.  These types of valves are installed at the Plant's oil drain points.\r\n\r\nOther release prevention steps taken at the Plant:\r\n\r\n-  Management has acknowledged and has taken ownership of the RMP/PSM Program.  \r\n-  Continuing implementation of the Prevention Program elements.  The Prevention Program is equivalent to PSM including Process Safety Information, Process Hazard Analysis, Written Procedures, Training, Mechanical Integrity, Management of Change, Pre-startup Safety Review, Employee Participation, Incident Investigation, Compliance Audits, Contractor Safety, and Employee Injury and Illness Prevention.\r\n-  Refrigerated space is protected against fire by a fire sprinkler system.  \r\n-  The refrigerating systems are equipped with automated monitoring and alarms that are supervised by a third-party alarm company.  The monitoring system is configured to make notifications based on pre-determined parameters. Technicians are notified if out-of-tolerance parameters are being approached, so potential problems can be remed"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000027920,
      "SummaryText": "ied before they escalate to a release situation.\r\n-  Pressure Relief Valves are installed to protect vessels from operating above their ratings. \r\n-  Pressure Relief Valves (PRV) are piped to headers that terminate at one of three Ammonia-Water Diffusion tanks.  Discharge from a PRV would be absorbed into water containment, thereby preventing an ammonia release to atmosphere.  \r\n-  The facility is protected by fencing and gates to limit access by potential \"wrong-do-ers\".\r\n-  A Cooler sign-in/sign-out program is enforced.\r\n-  Employees are trained for ammonia awareness and hazard communication (discovery and communicating) for un-authorized personnel, suspicious activity, fires, releases or other hazardous/suspicious condition.\r\n-  Coastal Cooling strives to maintain a good working relationship with the local implementing agency (Monterey County Health Department/CUPA).  Coastal Cooling and WPS personnel have worked closely with this CUPA at other locations within its jurisdiction.  \r\n-  Staff is trained in the fire and accident prevention benefits of good housekeeping.  The general appearance of the facility is maintained on a day-to-day basis.\r\n\r\n\r\n4.\t  Five-Year Accident History\r\n\r\nThere is no data to report. \r\n\r\n5.\t Emergency Response Program\r\n\r\nThis plant is engineered to provide for life safety and effective emergency response.  Building space is equipped with fire-alarm stations & fire-sprinklers.  Cold Rooms are equipped with ammonia sensors and associated alarm system.  The refrigeration process' Control, Monitoring and Alarm System (described above) includes manual backup systems (kill switches).  Currently, authorized personnel can access critical process system controls via the Plant's Electrical Rooms.  This may be enhanced in the future via remote wireless access.  Portions of the refrigeration process are equipped with a Fire Department Emergency Control Box and a KNOX BOX has been installed.  The KNOX is kept up-to-date per the North County Fire & Ci"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000027920,
      "SummaryText": "ty of Castroville Police Departments.  Automated systems and safety cut-outs are regularly inspected, tested and maintained at pre-determined intervals. Personnel are experienced in ammonia awareness, manual discovery, emergency shutdown, evacuation and notification procedures in the event of a failure of the engineered safety and emergency systems.  \r\n\r\nThe Plant does not require its employees to participate in conducting offensive-type emergency response activities under the HAZWOPER standard; a \"Non-responding Facility Policy\" has been adopted for the Plant as a whole.  In the event of an ammonia emergency, the response is to follow the procedures in the Equipment SOP's and the California Hazardous Material Business Plan.  The overall procedure is to shutdown if it can be done safely by qualified personnel, evacuate, and notify the local response agencies and WPS (technical support).  Plant employees are to implement hazard communications, provide for the safety of visitors and report to the established Evacuation Staging Area(s) for a head count.  Emergency response is coordinated with the City of Monterey County Health Department/CUPA and local Fire Department.  Coastal Cooling has verified it is included in the Monterey County Area Emergency Plan. \r\n   \r\n6.\tPlanned changes to improve safety\r\n\r\nThe primary mechanisms to identify and plan safety improvements include (but are not limited to):\r\n-  Process Hazard Analysis review;\r\n-  Compliance Audits;\r\n-  Routine inspections, tests & maintenance (Mechanical Integrity Program);\r\n-  IIAR Bulletin 109 Inspections (IIAR Minimum Safety Criteria For The Safe Operation Of Ammonia Refrigeration Process);\r\n-  Coastal Cooling and WPS Internal Inspection Protocols\r\n-  Incident Investigation\r\n\r\nThe Programs above may result in recommendations ranging from capital improvements to routine maintenance of the plant.  Service calls are established in parallel to identified needs.  \r\n\r\nCurrent planned changes to improve safety incl"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000027920,
      "SummaryText": "ude the recommendations identified in the most recent Process Hazard Analysis which was conducted by an experienced team on 1/27/2012.  A summary of improvements includes engineering, mechanical, electrical and administrative changes or upgrades.  Coastal has prepared a written itemized list of the improvements which are to be implemented.  The last of the 1/27/2012 PHA improvements is expected to be completed by 6/01/2012."
    }
  ]
}