{
  "FacilityID": 1000073840,
  "FacilityName": "Alex C. Fergusson, LLC",
  "FacilityStr1": "800 Development Ave",
  "FacilityStr2": null,
  "FacilityCity": "Chambersburg",
  "FacilityState": "PA",
  "FacilityZipCode": "17201",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "42055",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "40.005610",
  "FacilityLongDecDegs": "-77.649956",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 2268456,
  "ParentCompanyName": "Zep, Inc",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Alex C. Fergusson, LLC",
  "OperatorStr1": "5121 Coffey Ave",
  "OperatorStr2": null,
  "OperatorCity": "Chambersburg",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "17201",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brent Roberts",
  "RMPTitle": "Site Manager",
  "FTE": 30,
  "OtherEPAFacilityID": "17201LXCFR8DEVE",
  "EPAFacilityID": "100000240312",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-10-10 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-11-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-11-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-11-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-11-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000092098,
      "AltID": "PAA",
      "FacilityID": 1000073840,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000093320,
          "ProcessID": 1000092098,
          "NAICSCode": "325611",
          "_desc": {
            "NAICS_CODE": "325611",
            "NAICS_DESCRIPTION": "Soap and Other Detergent Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000115008,
          "ProcessID": 1000092098,
          "ChemicalID": 18,
          "Quantity": 110000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 18,
            "ChemicalName": "Peracetic acid  [Ethaneperoxoic acid]",
            "CASNumber": "79-21-0",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000615008,
          "ProcessID": 1000092098,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000073840,
      "SummaryText": "CHAMBERSBURG EXECUTIVE SUMMARY \n\n\n\nSince 1855, AFCO has been delivering chemical, process, training, equipment and distribution solutions to leaders in the food, beverage, and hospitality indus?tries that help them operate at the best and highest levels of sanitation, productivity and profitability. \n\nAFCO is a full-service partner through?out all areas of the client facilities and their process management. Working alongside our clients AFCO delivers expertise and hands-on support to help meet sanitation, compliance and operational needs efficiently and cost-effectively.\n\n\n\nThe 55,000 square foot Chambersburg facility serves as a site for the manufacture of cleaning, sanitation and maintenance products.  Many of these products are manufactured under strict quality control procedures since these products are utilized in industries making consumer products, food and beverages.  AFCO provides a full range of services connected with our products, including consultation, training, equipment designed to deliver our products, and customer site service. \n\n\n\nThe peracetic acid products which are produced on site are packaged in various containers, including 330-gallon totes, 55 gallon drums, and smaller (1-5 gallon) containers.  The warehouse section of the facility stores and ships these products to customers.  Peracetic acid manufacturing and product packaging are conducted in a 2,000 square foot room in the facility that can be isolated from the general plant manufacturing and warehousing facilities.  \n\n\n\nAFCO implements an accidental release prevention policy to ensure compliance with the EPA RMP regulation.  The accidental release prevention program includes:\n\n?    Process Safety Information, which includes:\n\no    SDS sheets for products containing peracetic acid, \n\no    safety information for the peracetic acid system and process chemistry; \n\no    inventory which is an ongoing update of quantities products containing peracetic acid on hand; \n\no    piping and instrumentation diagrams "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000073840,
      "SummaryText": "-  these are detailed drawings of the piping, instrumentation and process flows from raw materials to pack-out of finished products\n\no    equipment design information and specifications,\n\no    design codes and standards utilized in construction and project engineering,\n\n?    Process Hazard Analysis (PHA)/Risk Assessment, this includes a process hazard analysis for the peracetic acid system.  The PHA analyzes scenarios that represent deviations from normal operation, the causes and consequences of these deviations, the safeguards in place to prevent or mitigate releases of hazardous materials, a qualitative assessment of the risk of these scenarios (using a risk matrix for scenario severity and likelihood) and the identification of any recommendations to prevent or mitigate risk; \n\n?    Standard Operating Procedures and batch sheets, which include  instructions on handling raw materials, the peracetic acid manufacturing process, and peracetic acid blend packaging,\n\n?    Training - including training for operators handling raw materials, the peracetic acid process, and packaging, in addition to emergency response training, and OSHA-required safety training, such as hazard communications, personal protective equipment, hearing protection, etc.\n\n?    Incident Investigations and Procedures - which is a list of all incidents or near miss occurrences, the results of investigation into those incidents, and follow-up documentation of corrective actions; \n\n?    Mechanical Integrity/Maintenance program - inspection, testing and preventive maintenance for the equipment and instrumentation utilized in the peracetic acid process\n\n?    Compliance Audits - which documents the findings and corrective actions from internal and external site audits, including insurance company audits.\n\n\n\nFive-year accident history - there have been no accidents in the previous five years that meet the RMP requirements for inclusion in the RMP submittal.\n\n\n\nEmergency response - the Chambersburg site maintains an up-to-date em"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000073840,
      "SummaryText": "ergency action plan.  The plan details the actions plant employees would take in the event of a release of peracetic acid, incidents involving other substances, fires, and health emergencies.  The plan details the means to notify all workers of incidents and actions to be taken, such as site evacuation and headcount; and includes contact information for local emergency response organizations, including the Franklin County Fire and EMS. Evacuation plans are available and evacuation escape plan maps can be found throughout the facility.  The site maintains inventories of emergency equipment and supplies on site.  The response plan has been reviewed with the local emergency response organizations and the Franklin County Local Emergency Planning Committee (LEPC).\n\n\n\nPlanned changes to improve safety - AFCO is currently working on several projects to improve site safety.  The key projects are:\n\n?    Improvements to the ventilation of the peracetic acid processing room and the addition of a scrubber for acid vapors.\n\n?    Improvements for venting and handling glacial acetic acid\n\n"
    }
  ]
}