{
  "FacilityID": 1000001069,
  "FacilityName": "Pactiv Corporation - Bakersfield",
  "FacilityStr1": "2024 Norris Rd",
  "FacilityStr2": null,
  "FacilityCity": "Bakersfield",
  "FacilityState": "CA",
  "FacilityZipCode": "93308",
  "Facility4DigitZipExt": "2297",
  "FacilityCountyFIPS": "06029",
  "LEPC": "Region 5 LEPC Inland South",
  "FacilityLatDecDegs": "35.423364",
  "FacilityLongDecDegs": "-119.058344",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.pactiv.com",
  "FacilityEmailAddress": "lfoss@pactiv.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "Pactiv Corporation",
  "Company2Name": null,
  "CompanyDUNS": 5211768,
  "Company2DUNS": null,
  "OperatorName": "Pactiv Corporation",
  "OperatorStr1": "2024 Norris Rd",
  "OperatorStr2": null,
  "OperatorCity": "Bakersfield",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93308",
  "OperatorZipCodeExt": "2297",
  "FTE": 275,
  "OtherEPAFacilityID": "CAD041231945",
  "EPAFacilityID": "100000068366",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "S-892",
  "SafetyInspectionDate": "2006-02-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "Yes",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-06-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-02 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-06-02 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-02 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 35.42031,
  "FRS_Long": -119.05832,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000001366,
      "AltID": "UST Unload System",
      "FacilityID": 1000001069,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000001443,
          "ProcessID": 1000001366,
          "ChemicalID": 115,
          "Quantity": 350000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000001452,
          "ProcessID": 1000001366,
          "NAICSCode": "32614",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000837,
              "Process_NAICS_ID": 1000001452,
              "SafetyReviewDate": "2008-06-30 00:00:00",
              "PHA_Date": "2007-01-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2007-11-14 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-11-05 00:00:00",
              "TrainingReviewDate": "2008-11-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-11-05 00:00:00",
              "EquipmentInspectionDate": "2008-10-30 00:00:00",
              "EquipmentTested": "annual leak test of entire blowing agent system with BHT additive",
              "ChangeMgmtDate": "2009-05-21 00:00:00",
              "ChangeMgmtReviewDate": "2008-11-05 00:00:00",
              "PreStartupReviewDate": "2008-05-27 00:00:00",
              "ComplianceAuditDate": "2008-07-29 00:00:00",
              "AuditCompletionDate": "2008-09-01 00:00:00",
              "IncidentInvestigationDate": "2002-05-28 00:00:00",
              "InvestigationChangeDate": "2002-05-30 00:00:00",
              "ParticipationPlansReviewDate": "2008-11-05 00:00:00",
              "HotWorkPermitReviewDate": "2008-11-05 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-18 00:00:00",
              "ContractorSafetyEvalDate": "2008-11-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000000960,
                  "PreventionProgram3ID": 1000000837,
                  "ProcessChemicalID": 1000001443
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000001069,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Kern County Health Department",
    "CoordinatingAgencyPhone": "6613917000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001069,
      "SummaryText": "ocedures.  These procedures address various modes of operation such as startup, shutdown, normal operations, temporary operations, emergency shutdown and emergency operations.  The information is reviewed and is readily accessible to operators involved in the covered process.\n\nTraining\nPactiv Corporation utilizes a detailed training program to ensure that employees who are operating processes using regulated substances are skilled in the handling, operation, and maintenance procedures associated with the covered process.  Training is provided when the employee is hired or promoted into position within the covered process.  Refresher training is provided at least every 3 years and more frequently if needed.  Training records are maintained with a certification record of the date, employee trained and instructor.\n\nMechanical Integrity\nPactiv Corporation carries out routine, periodic maintenance inspections and preventative maintenance on process equipment to ensure proper operations. Covered process equipment examined by these inspections includes but is not limited to pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps. Qualified personnel carry out maintenance operations with training in maintenance practices.  These personnel are provided specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. \n\nManagement of Change\nWritten procedures at Pactiv Corporation are in place to manage changes in covered process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and provided training, as needed, to deal with the modification.\n\nPre-startup Reviews\nPre-start up safety reviews related to new processes and modifications to established processes are conducted as a regular"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001069,
      "SummaryText": "Executive Summary\nPactiv Corporation\nRisk Management Plan\nBakersfield, CA\n\n1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nWe at Pactiv Corporation are strongly committed to employee, public and environmental safety.  This commitment is inherent to a comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances and to train employees regarding the safe operation of processes involving regulated substances.  Although such an event is unlikely, employees are trained to react to unplanned releases of regulated substances.  In addition, the plant has coordinated with local and other emergency response organizations which provide highly trained emergency response personnel to help control and lessen the effects of any unplanned release.\n\n\n2. THE STATIONARY SOURCE AND THE REGULATED SUBSTANCES HANDLED\n\nThe primary manufacturing activity at this plant involves the production of plastic consumer products such as polystyrene foam plates, bowls, food containers.  We have one substance present at our facility that is regulated by United States Environmental Protection Agency (USEPA) under the Risk Management Program.  This substance is iso-pentane (2-methyl-butane); and is referenced in this document by the term regulated substance.  The regulated substance at our facility is used as a foaming agents in the production of the polystyrene foam.  The foaming agents are often referred to as blowing agents or expansion agents.\n\n3. THE WORST CASE RELEASE SCENARIO AND THE ALTERNATIVE RELEASE SCENARIO, INCLUDING ADMINISTRATIVE CONTROLS AND MITIGATION MEASURES TO LIMIT THE DISTANCES FOR EACH REPORTED SCENARIO\n\nInformation on worst-case release scenario and alternative release scenario can be found in the relevant section of the RMP.  This information has been remo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001069,
      "SummaryText": "ved from the executive summary in accordance with April 9, 2004 revisions to the Chemical Accident Release Prevention Rule (Risk Management Program). \n\n4. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE CHEMICAL SPECIFIC PREVENTION STEPS\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirement set out under 40 CFR part 68.  This facility was designed and constructed in accordance with NFPA-58 Standard.  In addition, we have processes at our facility that are subject to the Occupational Safety & Health Administration  (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.  We also have an air operating permit under Title V of the Clean Air Act.  This facility has received a Star ranking under OSHA's Voluntary Protection Program (VPP) for over 15 years.  The following sections briefly describe the elements of the accidental release prevention program that are in place at our stationary source.  \n\nProcess Safety Information\nPactiv Corporation maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the covered process.  \n\nProcess Hazard Analysis\nOur facility conducts extensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The approach used to carry out these analyses is a HAZOP process.  These studies are undertaken by a team of qualified personnel with expertise in engineering, process operations and safety.  The hazard analysis is revalidated at a regular interval of 5 years and when major changes are made to the covered process.  Seismic activity consequences and prevention activities are considered during HAZOP studies.  Any findings related to the hazard analysis are addressed in a timely manner.\n\nOperating Procedures\nFor the purposes of safely conducting activities within the covered process, Pactiv Corporation maintains written operating pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000001069,
      "SummaryText": "practice at Pactiv Corporation.  These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\nCompliance Audits\nPactiv Corporation conducts audits on a regular basis to determine whether the requirements under the RMP rule are being implemented.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner. \n\nIncident Investigation\nPactiv Corporation promptly investigates any incident that results in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the circumstances leading to the incident as well as any corrective actions to prevent a potential release from reoccurring.  All reports are retained at our facility for a minimum of 5 years.\n\nEmployee Participation\nPactiv Corporation truly believes that process safety management and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analyses.\n\nContractors\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.  Prior to selecting a contractor, a thorough evaluation of the contractorÂ¿s safety performance and program is carried out.  Pactiv Corporation has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the covered process.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\nHot Work\nThe facility maintains a hot work program and issues a hot work"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000001069,
      "SummaryText": "permit for hot work conducted on or near the covered process.  Hot work is performed by qualified personnel who complete each permit and fulfill its requirements prior to the start of a hot work operation.  These permits are kept on file until the conclusion of the hot work operation.\n\n5. FIVE-YEAR ACCIDENT HISTORY\n\nPactiv Corporation has an excellent record of preventing accidental releases over the last 5 years.  There have been no accidental releases that caused injuries or damage to property during this period.\n\n6. EMERGENCY RESPONSE PLAN\n\nPactiv's primary emergency response asset is the local Fire Department.  Pactiv Corporation has developed a written emergency action plan to deal with minor fires and incidental releases of hazardous materials.  The plan includes limited emergency response activities, mainly focusing on prompt notification of local emergency response agencies and the public; emergency evacuations, if necessary; adequate first aid and medical treatment should any be necessary.  The plan is promptly updated to reflect any pertinent changes taking place within our processes.  Releases of regulated substances are only responded to by on-site Pactiv personnel if incidental.  In addition, emergency response equipment (fire extinguishers, etc) is regularly inspected and serviced.\n\n7. PLANNED CHANGES TO IMPROVE SAFETY\n\nOSHA has certified our facility for over twenty years as a STAR site in their Voluntary Protection Program (VPP).  To achieve this status, our facility has exemplary occupational safety and health programs which encompass employee involvement, recognition for safe work, partnership with OSHA and continuous hazard identification activities.\n\nTo enhance our continuous improvement in occupational safety and health, we conduct quarterly safety meetings and provide safety statistics to employees during shift change meetings."
    }
  ]
}