{
  "FacilityID": 1000065881,
  "FacilityName": "Hasa Inc. - Longview",
  "FacilityStr1": "3401 Industrial Way",
  "FacilityStr2": "Gate 10, Area 42",
  "FacilityCity": "Longview",
  "FacilityState": "WA",
  "FacilityZipCode": "98632",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53015",
  "LEPC": "Cowlitz County LEPC",
  "FacilityLatDecDegs": "46.130000",
  "FacilityLongDecDegs": "-122.990833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Hasa Inc.",
  "OperatorStr1": "23119 Drayton St",
  "OperatorStr2": null,
  "OperatorCity": "Saugus",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91350",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Musso",
  "RMPTitle": "Site Manager",
  "FTE": 43,
  "OtherEPAFacilityID": "98632HSNCX341IN",
  "EPAFacilityID": "100000192427",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-03-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-03 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-09-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-09-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-09-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000082493,
      "AltID": "Sodium Hypochlorite Mfg",
      "FacilityID": 1000065881,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000083695,
          "ProcessID": 1000082493,
          "NAICSCode": "32518",
          "_desc": {
            "NAICS_CODE": "32518",
            "NAICS_DESCRIPTION": "Other Basic Inorganic Chemical Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000102582,
          "ProcessID": 1000082493,
          "ChemicalID": 62,
          "Quantity": 540000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000602582,
          "ProcessID": 1000082493,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000065881,
      "SummaryText": "Executive Summary - Risk Management Program (RMP)\n\n\n\nLongview Facility\n\n\n\nHasa manufactures sodium hypochlorite and distributes other chlorine-based disinfectants for protection of potable and waste water facilities; disinfection of sewage and waste water; disinfection of dairy premises and meat processing plants; bleaching and disinfection of laundry; disinfection of hospital operating rooms and related areas; egg cleaning and sanitization; washing solutions for fresh fruits and vegetables; and disinfection of water contained in swimming pools, spas, hydrotherapy tubs, and recreational water.  \"Recreational water\" is a relatively new term and includes water systems in amusement parks with water slides.  Sodium hypochlorite, commonly known as \"bleach\", is manufactured by reacting liquefied chlorine with dilute caustic solution under controlled conditions of temperature and pressure.\n\n\n\nAlong with many other segments of the American economy, Hasa recognizes there is a new reality, which requires a heightened level of vigilance and increased communication with law enforcement and security agencies.  Hasa has taken proactive measures to upgrade its security so that its products will continue to be manufactured, stored and transported in a manner that protects the public's health and safeguards our environment.\n\n\n\nChlorine has been part of our country's public health defenses for over 100 years.  As such, chlorine chemistry is part of the nation's first line of defense against terrorism.  Chlorine-based disinfectants are used by 98% of modern water purification plants to kill bacteria and viruses.  This is an essential factor in delivering safe water to homes for drinking, cooking, and bathing.  On top of the everyday protection, chlorine also effectively kills many potential biological warfare agents.  \n\n\n\nIn the event of a terrorist attack using an airborne biological warfare agent, bleach can be used to decontaminate surfaces subject to such attacks.  Chlorine chemis"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000065881,
      "SummaryText": "try is also indispensable to the manufacture of vinyl bags, which contain donated, bullet proof vests, and gas masks that are used by police officers and our troops in the field, as well as the safety gear that is employed daily by firefighters throughout the nation.\n\n\n\nHasa remains committed to the safe manufacture and distribution of its products that are essential to our economy, our way of life, and our national security needs.  Hasa supports policies designed to ensure that America's roads, skies, railways, and shipping remain as secure thoroughfares for commerce and travel.  Hasa is committed to doing its part to promote public safety and security, and we are working cooperatively with other industries and government agencies on these issues of critical importance.\n\n\n\nAs mentioned above, Hasa manufactures commercial, institutional, industrial, and household \"bleach\", also known by the chemical name \"sodium hypochlorite\" by reacting liquefied chlorine with dilute caustic solution under controlled conditions.  Liquefied chlorine is the only material on-site, which is regulated under the Environmental Protection Agency Risk Management Plan (EPA RMP) and Occupational and Safety Health Administration Process Safety Management (OSHA PSM) programs. Hasa also repackages and distributes a variety of compounds for disinfection and treatment of potable and recreational water, wastewater, and sewage. \n\n\n\nPolicy\n\n\n\nHasa continuously evaluates its operations to ensure that the highest levels of safety, protection of human health, and protection of the environment have been attained. Hasa maintains a scientific and technical staff to meet these public and environmental needs. The facility has been constructed in accordance with nationally recognized standards of good practice.\n\n\n\nHistory of the Facility\n\n\n\nThe Hasa site in Longview, Washington is property that Hasa Inc. leases from Axiall (formerly Equa-Chlor), a chemical manufacturer and distributor of a variety of chemical"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000065881,
      "SummaryText": "s including chlorine and sodium hydroxide (caustic soda).  Axiall in turn leases from the property owner, Nippon Dynawave Packaging (Nippon, formerly Weyerhaeuser), a pulp mill manufacturing facility.  The pulp mill opened for business in 1931.  The mill produces a wide range of paper products, including paperboard, corrugating medium, newsprint, and fine papers.  The Axiall and Hasa Inc. facility are co-located on Nippon's previously shutdown Chlor-Alkali manufacturing plant location.  \n\n\n\nHasa's first manufacturing facility opened in 1964 at the Saugus, California location.  Subsequently, Hasa expanded the business through acquisitions and construction of additional plants. Hasa acquired the swimming pool sodium hypochlorite manufacturing and distribution division of Purex and all operations of the GPS Division of All Pure Chemical Company, itself a division of Pioneer Chemical Company. The Purex and GPS operations were consolidated at the Saugus plant. Three new plants were constructed: one in Eloy in 1982 (Phoenix area), Arizona; one in Pittsburg, CA in 1997, and this one in Longview, Washington in 2005. The manufacture and unloading processes at all plants are essentially identical.  \n\n\n\nThe liquefied chlorine unloading system and bleach manufacturing module at Saugus survived two major earthquakes with no structural damage or loss of contents: the one in Sylmar in 1972; the other with an epicenter in Northridge in 1994. The unloading system and bleach-manufacturing module survived the earthquakes without damage, and manufacture of sodium hypochlorite solutions was restarted without any system repair or modification after appropriate safety reviews.\n\n\n\nLongview Facility\n\n\n\nThe unloading system and bleach-manufacturing module at the Longview facility are state-of-the-art installations with redundant active and passive mitigation safety controls in place. There are chlorine gas sensors located strategically throughout the facility. If chlorine gas is detected, an"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000065881,
      "SummaryText": " automatic fail-safe-to-close valve system immediately closes the valves on the railroad tank car. Hasa safely unloads millions of pounds of liquefied chlorine annually at the four sodium hypochlorite solutions manufacturing facilities. \n\n\n\n\n\nPrevention Program\n\n\n\nHasa is subject to the Occupational Safety and Health Administration's Process Safety Management (PSM) Prevention Program level 3.  The program consists of sections on Employee Participation, Process Safety Information \"PSI\", Process Hazard Analysis \"PHA\", Operating Procedures, Training, Outside Contractor Requirements, Pre-Start up Review \"PSR\", Mechanical Integrity, Hot Work Permits, Management of Change, Incident Investigation, Emergency Planning and Response, and Compliance Audits.\n\n\n\nEmergency Response\n\n\n\nHasa has in place an emergency response program in the event of a release of chlorine. Hasa HAZMAT employees are trained to respond to leakage in accordance with Department of Transportation requirements. Hasa has on site a Chlorine Institute Emergency Kit C, which contains fittings, hoods and devices to respond to and mitigate unlikely leaks from tank cars.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nHasa continually monitors and evaluates safety equipment and procedures.  At the present time there are no planned changes to improve the safety or to change procedures, since the chlorine unloading system and bleach manufacturing module at the Longview facility are already state-of-art installations with redundant active and passive mitigation safety controls in place.  Hasa may periodically replace pipe, piping, valves, motors, and related items with pipe, piping, valves, motors, and related items, which meet the original design specifications, i.e., are identical with the original items.  \n\n\n\nFive-Year Accident History\n\n\n\nHasa has experienced no reportable quantity or Risk Management Plan releases of chlorine at the facility since production commenced in July 2005."
    }
  ]
}