{
  "FacilityID": 1000067100,
  "FacilityName": "Benbrook Water Authority Water Treatment Plant",
  "FacilityStr1": "1112 Shady River Court",
  "FacilityStr2": null,
  "FacilityCity": "Benbrook",
  "FacilityState": "TX",
  "FacilityZipCode": "76126",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48439",
  "LEPC": "Tarrant County LEPC",
  "FacilityLatDecDegs": "32.672344",
  "FacilityLongDecDegs": "-097.436622",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.bwsa.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 61381265,
  "ParentCompanyName": "Benbrook Water Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Benbrook Water Authority",
  "OperatorStr1": "1121 Mercedes Street",
  "OperatorStr2": "P.O. Box 26929",
  "OperatorCity": "Benbrook",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76126",
  "OperatorZipCodeExt": null,
  "RMPContact": "David Smith",
  "RMPTitle": "General Manager",
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000144596",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-02-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-11-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-12-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-12-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-12-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 32.67475,
  "FRS_Long": -97.43528,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "39.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000084244,
      "AltID": "Chlorination",
      "FacilityID": 1000067100,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000085446,
          "ProcessID": 1000084244,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000105184,
          "ProcessID": 1000084244,
          "ChemicalID": 62,
          "Quantity": 11000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000605184,
          "ProcessID": 1000084244,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000067100,
      "SummaryText": "INTRODUCTION\n\nThe Benbrook Water Authority (BWA) owns and operates a water treatment plant (WTP) located in Benbrook, Texas.  The physical location of the WTP is in the southside of Benbrook at 1211 Shady River Court.  The WTP treats raw water from Benbrook Lake and produces drinking water that is supplied to the residents of Benbrook.  It has a current treatment capacity of 12 million gallons per day (MGD).  Among the chemicals used in the treatment process, chlorine is the only chemical stored in quantities greater than the threshold level specified by the Environmental Protection Agency (EPA).\n\n\n\nChlorine is a disinfectant chemical used to destroy pathogenic organisms during the treatment process.  It is stored at the WTP site as a gas that is liquefied by pressure.  The maximum amount of chlorine stored at the WTP site is 11,000 pounds contained in one-ton containers and 150-lb cylinders.\n\n\n\nThe BWA policy regarding safety is to adhere to standard guidelines established for the water industry by equipment manufacturers, chemical suppliers and professional organizations, and written standard operating procedures established specifically for the Benbrook WTP.  BWA coordinates appropriate aspects of its safety program with the City of Benbrook Fire Department. \n\n\n\nOFFSITE CONSEQUENCE ANALYSIS\n\nThe offsite consequence analysis determined the offsite impact of a release of chlorine gas.  Two different scenarios were considered regarding the release of chlorine gas from the WTP site: worst-case release and alternative release.\n\n\n\nThe worst-case release scenario used the meteorological conditions specified by the EPA, a release of the largest chlorine gas container (2,000 pounds) in 10 minutes, and EPA issued RMP Comp was used to determine the impact of the area surrounding the WTP site.  The following EPA specified parameters were used in determining the impact of the worst-case release scenario:\n\n\n\n     1.  Wind speed of 1.5 meters per second\n\n     2.  Atmosphere sta"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000067100,
      "SummaryText": "bility class F\n\n     3.  Urban topography\n\n\n\nThe alternative release scenario assumed more realistic meteorological conditions deemed appropriate for the BWA plant site, and a release of chlorine gas with active and passive mitigation measures in place.  EPA's RMP Comp software was used to determine the impact of the area surrounding the WTP site.  The following parameters were used in determining the impact of the alternative release scenario:\n\n\n\n     1.  Wind speed of 3.0 meters per second\n\n     2.  Atmosphere stability class D\n\n     3.  Urban Topography\n\n\n\nThe offsite impacts of the worst-case and alternative release scenarios are summarized in the Offsite Consequence Analysis section of the report.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\nDuring the past five years there have been no accidents involving the release of chlorine gas at the WTP.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe operations and equipment at the WTP comply with several industry codes and standards regarding safety that are specific to the water industry.  They include: American Society of Testing Materials (ASTM) Standards, American Society of Mechanical Engineers (ASME) Standards, the Chlorine Manual of the Chlorine Institute, and the Texas Commission on Environmental Quality (TCEQ) Rules and Regulations for Public Water Systems.\n\n\n\nThe Plant Operations and Maintenance (O&M) Manual includes the equipment manufacturer's instructions for operating and maintaining equipment used for the storage and application of chlorine gas.  The O&M Manual also contains safety procedures concerning the handling of chlorine gas.\n\n\n\nSafety related equipment installed at the WTP include:\n\n     \n\n     1.  Vacuum regulators on one-ton chlorine containers. \n\n     2.  Emergency vents for the failure of automatic shutoff valves.\n\n     3.  Manual chlorine gas shutoffs.   \n\n     4.  Relief valves to prevent overpressurization of the chlorine gas system.\n\n     5.  Chlorine gas detectors and alarms to detect gas leaks.\n\n     "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000067100,
      "SummaryText": "6.  Gas scrubber system.\n\n\n\nThe chlorine gas scrubbers are fully automatic and are designed to neutralize the entire contents of an overfilled one-ton chlorine container containing 2,350 pounds of chlorine.\n\n\n\nThe ongoing BWA training program for its operations staff includes regular safety training sessions.  Required TCEQ operator certification courses also include safety training.\n\n\n\nEMERGENCY RESPONSE PLAN\n\nThe WTP emergency response for an accidental chlorine gas release is addressed by the plant's standard procedures and the City of Benbrook Emergency Management Plan.  The WTP operations staff notifies the Benbrook Fire Department of any accidental release of chlorine gas that cannot be contained onsite.  The Benbrook Fire Department, as described in the City's Emergency Management Plan, is the first responder to any toxic material emergency and will assume responsibility for the gas release from the WTP operations staff."
    }
  ]
}