{
  "FacilityID": 1000038706,
  "FacilityName": "City of Red Bluff Wastewater Reclamation Plant",
  "FacilityStr1": "700 Messer Drive",
  "FacilityStr2": null,
  "FacilityCity": "Red Bluff",
  "FacilityState": "CA",
  "FacilityZipCode": "96080",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06103",
  "LEPC": "Region III LEPC",
  "FacilityLatDecDegs": "40.162275",
  "FacilityLongDecDegs": "-122.221378",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.cityofredbluff.org",
  "FacilityEmailAddress": "rkampmann@cityofredbluff.org",
  "FacilityDUNS": null,
  "ParentCompanyName": "City of Red Bluff",
  "Company2Name": null,
  "CompanyDUNS": 4953162,
  "Company2DUNS": null,
  "OperatorName": "City of Red Bluff",
  "OperatorStr1": "555 Washington Street",
  "OperatorStr2": null,
  "OperatorCity": "Red Bluff",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "96080",
  "OperatorZipCodeExt": null,
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000178112",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-11-18 00:00:00",
  "SafetyInspectionBy": "Dept. of Environmental Health",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-01-23 12:42:20",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-02-11 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-02-11 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-02-11 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 40.162275,
  "FRS_Long": -122.221378,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000047559,
      "AltID": null,
      "FacilityID": 1000038706,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000057692,
          "ProcessID": 1000047559,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000047965,
          "ProcessID": 1000047559,
          "NAICSCode": "56221",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000041312,
              "Process_NAICS_ID": 1000047965,
              "SafetyReviewDate": "2018-12-11 00:00:00",
              "PHA_Date": "2018-12-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-12-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "automatic shutoff valves",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-12-12 00:00:00",
              "TrainingReviewDate": "2017-05-03 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-12-12 00:00:00",
              "EquipmentInspectionDate": "2014-01-13 00:00:00",
              "EquipmentTested": "vacuum",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2014-01-22 00:00:00",
              "PreStartupReviewDate": "2001-08-28 00:00:00",
              "ComplianceAuditDate": "2018-01-22 00:00:00",
              "AuditCompletionDate": "2018-01-22 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2014-01-24 00:00:00",
              "HotWorkPermitReviewDate": "2014-01-24 00:00:00",
              "ContractorSafetyReviewDate": "2014-01-22 00:00:00",
              "ContractorSafetyEvalDate": "2014-01-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000049292,
                  "PreventionProgram3ID": 1000041312,
                  "ProcessChemicalID": 1000057692
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000038706,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-07-09 00:00:00",
    "ERTrainingDate": "2014-01-24 00:00:00",
    "CoordinatingAgencyName": "Red Bluff Fire Department",
    "CoordinatingAgencyPhone": "5305271125",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "CCR, Title 8, Section 3220",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 1000038706,
      "SummaryText": "audits will be kept.\r\n9.  Incident Investigation - Red Bluff WWTP will investigate any incident, which results or could result in a catastrophic release of chlorine gas.  The investigation will be conducted within 48 hours of the incident.  All key factors will be addressed and recommendations for correction will result.  Affected personnel will review the findings of the investigation.  The report will be kept for 5 years.\r\n10.  Employee Participation - Managers and operators of Red Bluff WWTP water treatment plants participated in the process hazard analysis.  The PHA has been made available to all affected employees and is kept at the facilities.\r\n11.  Hot Work Permit - A hot work permit process has been developed and implemented for hot work operations conducted on or near the chlorination process.  The permit documents the fire and accident prevention requirements and is implemented prior to beginning any hot work operations.  The permit is kept on file until the completion of any hot work.\r\n12.  Contractors - Contractors working on or near the water treatment plant are required to comply with the regulatory provisions of the OSHA process safety management standard.  A form has been developed to address the following: contractor safety program; informing contractor employees of the hazards on the site; review of the emergency evacuation plans; record contractor meetings of the plans; and require contractors to train their employees on the hazards of the process. \r\n13.  Injury and Illness Prevention Program - The WWTP has an active IIPP meeting the requirements of Cal/OSHA Section 3203 that addresses the following;\r\no\tAssignment of safety responsibilities\r\no\tPrograms designed to gain employee involvement such as safety reward and recognition, safety suggestion incentives, and safety rule infraction disciplinary programs.\r\no\tAn active safety training program\r\no\tA hazard identification and corrective action program.\r\no\tIncident and accident investigation process."
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000038706,
      "SummaryText": "o\tSafety committee made up of union and management personnel.\r\n\r\n\r\nD.\tEMERGENCY RESPONSE PROGRAM\r\n\r\nThe City of Red Bluff WWTP has developed and implemented an Emergency Response Program.  The Emergency Response Program includes interaction and communication with Local and State response agencies.  The Tehama County Department of Environmental Health, as part of their business plan program, is notified immediately if there is a hazardous material release.  The City of Red Bluff Fire Department will be the incident commander in the case of a chlorine release and will coordinate evacuation procedures in a worst-case scenario.  The California State Office of Emergency Services and Tehama County Office of Emergency Services are also notified in a worst-case scenario.  The WWTP's chlorine manufacturer is also notified.\r\n\r\nA copy of the Emergency Response Plan is maintained in the WWTP Risk Management office."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000038706,
      "SummaryText": "Federal Environmental Protection Agency - Risk Management Plan (RMP)\r\nCalifornia Accidental Release Plan (Cal/ARP)\r\nCity of Red Bluff Wastewater Treatment Plant\r\nSUPPORT DOCUMENTS for Chlorine Use\r\n\r\n\r\n\r\n\r\nINTRODUCTION\r\n\r\nThe City of Red Bluff Wastewater Treatment Plant (WWTP) is owned and operated by the City of Red Bluff.  The Wastewater Plant is staffed by approximately 4 regular employees.  This plant is located adjacent to open land and a residential area.  It processes wastewater from the City of Red Bluff.\r\n\r\nThese EPA Risk Management Plan (RMP) Support Documents satisfy the requirements of 40 CFR 68.\r\n\r\n\r\nA.\tMANAGEMENT SYSTEM\r\n\r\nThe Red Bluff WWTP Accidental Release Prevention Policy involves a unified approach that integrates technologies, procedures, and management practices.  The WWTP adheres to all applicable procedures of the Federal EPA Risk Management Program (EPA-RMP).  The WWTP Emergency Response Policy involves the preparation of response plans, which are tailored to this facility and to the emergency response of the community and local responding agencies.  It is in compliance with the EPA Emergency Response Program requirements.\r\n\r\nThe RED BLUFF Accidental Release Prevention Program is in compliance with the Federal and State OSHA Process Safety Management (PSM) rule and is based upon the following key elements:\r\no\tA high level of training or our State Certified Plant Operators.\r\no\tA Preventive Maintenance Program with strict adherence.\r\no\tUse of state of the art process and safety equipment.\r\no\tThe use of an accurate and effective operating procedure written with participation of the operators.\r\no\tPerformance of hazard review of equipment and procedures.\r\no\tAssignment of the WWTP Risk Manager with overall responsibility of the RMP and Cal/ARP\r\no\tImplementation of an auditing and inspection program under the direction of the Water Operations Superintendent and the Risk Manager.\r\n\r\nThese policies and procedures are described in the RED BLUFF Chlor"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000038706,
      "SummaryText": "ine Process Safety Management Manual.  This manual, as required by State and Local regulatory agencies, also contains information and procedures relating to chlorine processing equipment, handling, leak response and repair procedures, education and safety training.  It contains a Process Hazard Analysis (PHA) and various report forms.\r\n \r\nB.  HAZARD ASSESSMENT\r\n\r\nThis Hazard Assessment was prepared in compliance with Subpart B of 40 CRF 68.  This is described in sections B1 through B9.\r\n\r\nB1.\tApplicability\r\n\r\nThe Red Bluff WWTP handles chlorine, an EPA-regulated substance, in amounts exceeding the regulatory threshold of 2,500 lbs.  This process of chlorination is subject to OSHA Process Safety management (PSM) requirements.  This qualified the Plant as a Program 3 process.\r\n\r\nB2.\tOffsite Consequence Analysis Parameters\r\n\r\nThe offsite consequence analysis parameters are listed below.\r\n\r\n(a) Endpoint\r\n\r\nChlorine - As required by EPA, the chlorine toxic endpoint used is 0.0087 mg/L.   This corresponds to 3 parts per million by volume (PPM), and represents the American Industrial Hygiene Association (AIHA) Emergency Response Planning Guideline (ERPG) - 2, which is defined as \"the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\r\n\r\n(b) Wind speed/atmospheric stability class\r\n\r\nAs required by EPA, a wind speed of 1.5 meters per second (m/s), and an atmospheric stability class F were used for performing the offsite consequence analysis for the worst-case release scenario.\r\n\r\n(c) Ambient temperature/humidity\r\n\r\nEPA RMP regulations for the worst-case release analysis assume 25-degree C. (77 degree F.) and 50% humidity for the dispersion analysis of the worst-case scenario.\r\n\r\n(d) Height of release\r\n\r\nThe RMP regulations require that, for the w"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000038706,
      "SummaryText": "orst-case release analysis, the release should be assumed to occur at ground level (0 feet).  Accordingly, the worst-case release analysis was performed at this level.\r\n\r\n(e) Surface roughness\r\n\r\nRMP regulations require that either urban or rural topography should be used for performing the air dispersion analysis for the identified release scenarios.  The rural and urban topographical conditions are characterized in the air dispersion models in terms of surface roughness.  The rural condition, defined by EPA as \"no buildings in the immediate area and the terrain is generally flat and unobstructed\", is characterized by a surface roughness of 0.03 meter, whereas the urban condition is characterized by a surface roughness of 1.0 meter.\r\n \r\n(f) Dense or neutrally buoyant gases\r\n\r\nRMP regulations require that the models used for dispersion analysis should appropriately account for the density of the released gas.  Since the chlorine gas released during the identified accidental release scenarios would be denser-than-air-, the Dense Gas Air Dispersion model was used for performing the air dispersion modeling.\r\n\r\n(g) Temperature of released substance\r\n\r\nThe facility process temperature coincides with the ambient temperature.  Therefore, the temperature of any released chlorine is the same as the ambient temperature.\r\n\r\nB3.\tWorst-Case Release Scenario Analysis\r\n\r\nRMP regulations require that a worst-case release scenario analysis be performed in compliance with specified conditions, as detailed below.\r\n\r\n(a) Number of release scenarios\r\n\r\nRMP regulations for Program 3 processes require the performance of a consequence analysis for one worst-case release scenario for each chemical, estimated to create the greatest distance in any direction to a toxic endpoint.  The worst-case release scenario selected was the complete release of the following:\r\no\tA one-ton chlorine container (2,000 lbs.)\r\n\r\n(b) Worst-case release quantity\r\n\r\nThe one-ton (2,000 lbs.) worst-case release quant"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000038706,
      "SummaryText": "ity selected represents the greatest amount held by a single vessel.  The container is provided with a negative pressure regulator on the manifold and an automatic valve shutoff system that is activated in the event of gas release.\r\n\r\n\r\n(c) Worst case release scenario for toxic gases\r\n\r\nAccording to the RMP regulations, it should be assumed that, for toxic substances that are normally gases at ambient temperature and handled as a gas or as a liquid under pressure, the quantity present in a vessel will be released as a gas over 10 minutes.  The release rate is assumed to be the total quantity divided by 10.  The boiling point temperature for chlorine is -31 degrees F; thus, chlorine is a gas at ambient temperature.  In addition, there are no passive mitigation systems in place.  The worst-case chlorine release rate was therefore estimated at 200 lb. /min.\r\n\r\nA summary of all the parameters selected for the dispersion modeling is presented in Table B-1.\r\n \r\nTable B-1\r\nDispersion Model Summary Sheet for the\r\nChlorine Worst-Case Release Scenario\r\n\r\n\r\nInput Parameter\tRelease Scenario:\r\nTank Release\r\nRelease Quantity (lb.)\t2,000\r\nRelease Rate (lb./min)\t200\r\nRelease Time (minutes)\t10 minutes\r\nPhysical State\tGas\r\nRelease Direction\tGround\r\nRelease Temperature (degrees C)\t25\r\nRelease Pressure (atm)\t1\r\nAmbient Temperature (degrees C)\t25\r\nAmbient Pressure (atm)\t1\r\nStability Class\tF\r\nWind Speed (m/s)\t1.5\r\nConcentration Averaging Time\t600 seconds\r\nEPA Level of Concern for Chlorine\t3 ppm\r\nTerrain\tUrban\r\n  Dispersion Modeling Results -\tThe chlorine concentrations at endpoint predicted by the atmospheric dispersion analysis for the worst-case scenario are summarized in Table B-2:\r\n\r\nThe maximum distance to toxic endpoint (3 ppm) reached by chlorine concentrations generated by a 10-minute release of 2,000 lbs. of chlorine is 1.3 miles.\r\n\r\nB4.\tAlternative Release Scenario Analysis\r\n\r\nRMP regulations require that at least one alternative scenario be identified and analyzed for each reg"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000038706,
      "SummaryText": "ulated toxic substance.  However, if systems are in place showing that no reasonable scenario could lead to offsite consequences, a scenario that has no offsite impacts can be used for the alternative scenario.\r\n\r\n(a) Scenarios to consider\r\n\r\nRMP regulations require that a scenario, which is more likely to occur than the worst-case scenario, be selected as the alternative release.  The scenario selected involves the rupture of the flexible connections (pigtails) connected to the one-ton containers.\r\n\r\nUpon release of the chlorine gas from the line, the leak detection system (with battery backup) would activate the emergency shut off system for the chlorine cylinder.  The emergency chlorine valve actuator will terminate a leak within 1.5 seconds automatically using the detection system or it can be initiated manually by means of locally mounted panic buttons.\r\n\r\n(b) Parameters to be applied\r\n\r\nNone Applicable with this scenario.\r\n\r\n(c) Consideration of mitigation\r\n\r\nThe active mitigation system considered is the actuation of a chlorine detector connected to an automatic valve shut off system.  This is intended to shut off the supply of chlorine at the source valve.  This system will allow for immediate notification of chlorine leaks to facility operators who will then initiate the Emergency Response Plan.\r\n\r\nThe amount of chlorine released will be less than the EPA reportable amount of 10 pounds.  Emergency responders will allow this to disperse before entering the facility to conduct repairs.\r\n\r\n(d) Factors in selecting scenarios\r\n\r\nThe rationale for selection of this scenario, which is more likely to occur than the EPA worst-case release discussed in Section B3, is based on performance of a hazard review.\r\n\r\nB5.\tOffsite Impacts - Population\r\n\r\nEPA RMP regulations require the determination of the potentially affected residential population within a circle with its center at the point of the release and a radius determined by the distance to the endpoint estimated to"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000038706,
      "SummaryText": "two significant digits.\r\n\r\nConsidering the worst-case release scenario, it is estimated that approximately 5000 people live within the endpoint circle and 2000 people within the plume footprint.\r\n\r\nDue to the active mitigation system in place, we believe there is no reasonable alternative release scenario that could lead to offsite consequence to population.\r\n\r\nB6.\tOffsite Impacts - Environment\r\n\r\nEnvironmental receptors to be identified include natural areas such as national or state parks, forests, or monuments; officially designated wildlife sanctuaries, preserves, refuges, or areas, and Federal wilderness areas.\r\n\r\nConsidering the worst-case release scenario, there are no environmental receptors within distance to endpoint.\r\n\r\nDue to the active mitigation system in place, we believe there is no reasonable alternative release scenario that could lead to offsite consequence to environment.\r\n\r\nB7.\tReview and Update\r\n\r\n(a) The Red Bluff Risk Management Department will review and update the offsite consequence analysis at least once every five years.\r\n(b) If changes in processes, quantities stored or handled, or any other aspect of the facility might reasonably be expected to increase or decrease the distance to the endpoint by a factor of two or more, the City of Red Bluff will complete a revised analysis within six months of the change and submit a revised risk management plan.\r\n\r\nB8.\tDocumentation\r\n\r\nThe required records for the offsite consequence analyses are provided above in Sections B2 through B6.\r\nB9.\tFive-Year Accident History\r\n\r\nNo accidental chlorine releases have occurred at this facility.  Accident definitions and accident investigation procedures are provided in the Process Safety Management Plan.\r\n\r\n\r\nTable B-2\r\nDistances to Toxic Endpoint for Chlorine\r\nF Stability, Wind Speed 1.5 Meters per Second\r\n\r\n\r\nRelease\r\nRate\r\n(lbs/min)\tDistance to End Point (miles)\r\n\tRural\tUrban\r\n1\t0.2\t0.1\r\n2\t0.3\t0.1\r\n5\t0.5\t0.2\r\n10\t0.7\t0.3\r\n15\t0.8\t1.4\r\n20\t1.0\t1.4\r\n30\t1.2\t0.5"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000038706,
      "SummaryText": "40\t1.4\t0.6\r\n50\t1.5\t0.6\r\n60\t1.7\t0.7\r\n70\t1.8\t0.8\r\n80\t1.9\t0.8\r\n90\t2.0\t0.9\r\n100\t2.2\t1.9\r\n150\t2.6\t1.2\r\n200\t3.0\t1.3\r\n250\t3.4\t1.5\r\n300\t3.7\t1.6\r\n400\t4.2\t1.9\r\n500\t4.7\t2.1\r\n600\t5.2\t2.3\r\n700\t5.6\t2.5\r\nRelease\r\nRate\r\n(lbs/min)\tDistance to End Point (miles)\r\n\tRural\tUrban\r\n750\t5.8\t2.6\r\n800\t5.9\t2.7\r\n900\t6.3\t2.9\r\n1000\t6.6\t3.0\r\n1500\t8.1\t3.8\r\n2000\t9.3\t4.4\r\n2500\t10\t4.9\r\n3000\t11\t5.4\r\n4000\t13\t6.2\r\n5000\t14\t7.0\r\n6000\t16\t7.6\r\n7000\t17\t8.3\r\n7500\t18\t8.6\r\n8000\t18\t8.9\r\n9000\t19\t9.4\r\n10000\t20\t9.9\r\n15000\t25\t12\r\n20000\t*\t14\r\n25000\t*\t16\r\n30000\t*\t18\r\n40000\t*\t20\r\n50000\t*\t*\r\n\r\n*More than 25 miles\r\n \r\nTable B-3\r\nEstimates of Residential Population\r\nPotentially affected by a Worst-Case Scenario of Chlorine\r\n\r\n\r\nConditions\tEndpoint\r\nDistance (miles)\tWithin the\r\nFull Circle\r\n(No. of people)\tWithin the\r\nPlume Footprint\r\n(No. of people)\r\nEPA Defined\t1.3\t500\t200\r\n \r\nNote:  Source of Release Rate Data obtained from EPA Document 550-B-98-010, Risk Management Program Guidance for Wastewater Treatment Plants (40 CFR Part 68)\r\n\r\n\r\nC.\tPROGRAM 3 PREVENTION PROGRAM\r\n\r\nRisk Management Program - Prevention Program Description\r\n\r\nThe City of Red Bluff WWTP Accidental Release Prevention Program involves a unified approach that integrates technologies, policy, and management practices.  It is in compliance with all EPA Prevention Program Requirements.\r\n\r\n1.  Process Safety Information - Red Bluff WWTP has developed and maintains written safety information about the chlorination process and the technology of process equipment used.  The operation of this facility adheres to the guidelines of the Chlorine Institute and to the OSHA regulations regarding Process Safety Management.\r\n2.  Process Hazard Analysis (PHA) - A PHA has been conducted appropriate to the complexity of the chlorination process that identified, evaluated, and controlled potential hazards using the What-if/ Checklist process.  This process includes the analysis of hazards due to equipment malfunction and human error.  It describes steps used to detect and"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000038706,
      "SummaryText": "monitor releases.  This PHA will be updated every three years and the WWTP will conduct reviews whenever major changes occur to the process.\r\n3.  Operating Procedures - WWTP has prepared written procedures that provide clear instructions for the safe operational activities associated with the process.  These procedures are included in the facility operations manual and the Process Safety Management manual.  The manual includes procedures for operation of all phases of the processes, and normal and emergency shutdown of the process.\r\n4.  Employee Training: - All existing and newly assigned employees are trained and tested competent in all operation procedures.  Training documentation is maintained on all applicable employees, refresher training is provided quarterly.\r\n5.  Mechanical Integrity - WWTP has a preventive maintenance program that insures the mechanical integrity of its chlorination processing equipment, which includes periodic inspection, testing and an annual overhaul of critical processing equipment.\r\n6.  Management of Change - WWTP has implemented written procedures to manage changes (except changes in-kind) to process chemical technology, equipment and procedures.  Employees affected by a change in a process are informed of and trained in the change prior to start up of the process or affected part of the process.  Safety information and operation procedures are updated accordingly.\r\n7.  Pre-Startup Review - Written procedures have been developed to allow operators to perform a pre-startup safety review for new and modified chlorination equipment, or where modification to the process is significant enough to require a change in the process safety information.\r\n8.  Compliance Audits - Compliance audits will be performed every three years to verify that the procedures and practices are adequate and are being followed.  Water treatment supervisors will perform the audit.  A report will be developed and deficiencies will be corrected.  The two most recent"
    }
  ]
}