{
  "FacilityID": 1000012268,
  "FacilityName": "Clackamas Distribution Center - Freezer Warehouse",
  "FacilityStr1": "9810 SE Mangan Way",
  "FacilityStr2": null,
  "FacilityCity": "Clackamas",
  "FacilityState": "OR",
  "FacilityZipCode": "97015",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "41005",
  "LEPC": "Oregon LEPC",
  "FacilityLatDecDegs": "45.401267",
  "FacilityLongDecDegs": "-122.564308",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.safeway.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Safeway, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 9137209,
  "Company2DUNS": 9137209,
  "OperatorName": "Safeway,Inc (Environmental Affairs)",
  "OperatorStr1": "5918 Stoneridge Mall Road",
  "OperatorStr2": null,
  "OperatorCity": "Pleasanton",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "94588",
  "OperatorZipCodeExt": "3229",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000190624",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-12-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-12-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-01-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-01-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-01-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 45.401267,
  "FRS_Long": -122.564308,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000015155,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 1000012268,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000017743,
          "ProcessID": 1000015155,
          "ChemicalID": 56,
          "Quantity": 20000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000015476,
          "ProcessID": 1000015155,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000012409,
              "Process_NAICS_ID": 1000015476,
              "SafetyReviewDate": "2009-04-15 00:00:00",
              "PHA_Date": "2009-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2008-05-13 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Implementation of procedures and policies to promote a safe and more efficient work environment",
              "OpProceduresReviewDate": "2009-04-15 00:00:00",
              "TrainingReviewDate": "2009-04-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-04-15 00:00:00",
              "EquipmentInspectionDate": "2009-10-02 00:00:00",
              "EquipmentTested": "Ammonia Refrigeration Sensors",
              "ChangeMgmtDate": "2008-07-27 00:00:00",
              "ChangeMgmtReviewDate": "2009-04-15 00:00:00",
              "PreStartupReviewDate": "2009-04-15 00:00:00",
              "ComplianceAuditDate": "2009-04-15 00:00:00",
              "AuditCompletionDate": "2010-04-15 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-04-15 00:00:00",
              "HotWorkPermitReviewDate": "2009-04-15 00:00:00",
              "ContractorSafetyReviewDate": "2009-04-15 00:00:00",
              "ContractorSafetyEvalDate": "2009-04-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000014739,
                  "PreventionProgram3ID": 1000012409,
                  "ProcessChemicalID": 1000017743
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000012268,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Clackamas Fire Department",
    "CoordinatingAgencyPhone": "5033786377",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012268,
      "SummaryText": "A.ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe management and staff of the Clackamas Distribution Center - Freezer Warehouse are committed to operating their facility with the highest regard for the safety of the public, Clackamas Distribution Center - Freezer Warehouse personnel, and the environment.  To ensure the safety of the public, Clackamas Distribution Center - Freezer Warehouse personnel, and the environment, the plant has implemented a management system that integrates the elements of OSHA's Process Safety Management (PSM) standard, 29 CFR 1910.119 and EPA's Risk Management Program (RMP) rule, 40 CFR part 68.  The policies and procedures integrated under the Clackamas Distribution Center - Freezer Warehouse's management system specifically address prevention of the release of anhydrous ammonia, and emergency response to an accidental release of ammonia.\n\nB. STATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Clackamas Distribution Center - Freezer Warehouse operates one refrigerated warehouse and freezer.  Anhydrous ammonia is used as a refrigerant in the mechanical compression refrigeration system at the facility.  Ammonia is handled in a closed-loop process that consists of the following general stages: liquid storage; expansion; evaporation; compression; and condensation.\n\nRefrigeration process equipment at the facility operates continuously.  Compressors and condensers cycle on and off to comply with system demand during operation.  The ammonia refrigeration system provides cooling for dock operations and freezers.  \n\nThe ammonia refrigeration system is the only process at the Clackamas Distribution Center - Freezer Warehouse which is subject to the EPA RMP rule (and the OSHA PSM standard).  Anhydrous ammonia is the only regulated substance handled in the ammonia refrigeration system.\n\nThe refrigeration cycle begins with the transfer of high pressure liquid ammonia from the Thermosyphon Receiver to the 65 psig Controlled Pressure Recei"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000012268,
      "SummaryText": "of Oregon Department of Environmental Quality at 800-452-0311, and the Clackamas County LEPC at 503-229-5263.\n\n3 If additional help is required for an ammonia spill or leak, the facility can call Chemtrec - Manufacturing Chemists Association 800-424-9300.\n\n4 If an employee ingests ammonia, the Poison Control Center can be reached 24 hours per day at 800-342-9293.\n\n5 If an ammonia release spills into the sewer system, storm drain or any type of waterway, contact the Molalla Sewer Treatment Plant 503-829-5407.\n\n6 If there is an accident that involves a fatality or if three or more people are hospitalized for injuries, call the local Portland OSHA Office at 503-326-2251.\n\n7 In the event of any acute employee exposure, emergency medical assistance/ambulance shall be requested.  In the event of lesser exposure without immediate serious medical symptoms, the exposed individuals shall be transported to:\nKaiser Permanente, Sunnyside Medical Center\n10180 S.E. Sunnyside Rd.\nClackamas\n\n8. Safeway Contacts - The following individuals should be contacted if a release occurs: Jeff Brown (925-226-5845), Corporate Environmental & Safety Compliance Manager, and Larry Lancaster, Loss Control Manager at (503) 657-6457.\n\nG. PLANNED CHANGES TO IMPROVE SAFETY\n\nThe initial Process Hazard Analysis (PHA), which was completed May,2008,  included a Hazard and Operability (HAZOP) study as well as a Facility What If Walkthrough.  The PHA provided mitigation measures to improve safety at the Clackamas Distribution Center - Freezer Warehouse located at 16800 South Evelyn Street, in Clackamas, Oregon. \n\nThe recommendations from the initial PHA were completed by March 2009."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012268,
      "SummaryText": "gin the cycle again.\n\nThe system is also equipped with an Automatic Purger and a Glycol Heat Exchanger.  The Auto Purger removes non-condensables (i.e., air and water) from the system.  There are four purge points located at the Condenser, and one at the Thermosyphon Receiver.  The Glycol Heat Exchanger uses high stage discharge to reheat glycol chilled in the freezer underfloor heating system.\n\nThe relief valves are set at 250 psig on the high pressure vessels, the compressors, the heat exchanger, the purger, and the condensers and 150 psig on the low pressure vessels.  The relief valves vent to an Ammonia Dump Tank located outside the equipment room.\n\nD.  ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe Clackamas Distribution Center - Freezer Warehouse has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Oregon OSHA's Process Safety Management (PSM), and Federal EPA's Risk Management Program (RMP), Program 3 requirements.\n\nThe ammonia refrigeration system at the Clackamas Distribution Center - Freezer Warehouse was designed and constructed in accordance with the Uniform Mechanical Code, which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include ammonia sensors throughout the plant, pressure relief valves to protects vessels' integrity, and automatic shut down systems that prevent equipment damage and ammonia releases.  In the event of ammonia detection, audible and visual alarms are triggered throughout the facility. \n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition changes that occur within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000012268,
      "SummaryText": "a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\n\nIn addition to the Uniform Mechanical Code, the facility will operate in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines.\n\nE. FIVE YEAR ACCIDENT HISTORY\n\nThe Clackamas Distribution Center - Freezer Warehouse began operation in July 2003. The facility has not had any ammonia releases that resulted in deaths, injuries, property damage, environmental damage, or offsite evacuations.\n\nF. EMERGENCY RESPONSE PROGRAM\n\nThe Clackamas Distribution Center - Freezer Warehouse facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of the PSM/RMP document, which is maintained at the facility.  Emergency response activities are coordinated with the Clackamas Fire Department and the local fire houses.  If necessary, the facility will call 9-1-1 to alert the local Police and Fire Departments.\n\nOther responders will be called as needed, including the Clackamas Fire Department.  If a release exceeds the federal reporting quantity of 100 pounds for ammonia, the National Response Center will be called.\n\nThe Clackamas Distribution Center - Freezer Warehouse will be responsible for evacuating and ensuring the safety of its employees in case of an emergency evacuation.  Evacuation drills are performed at least annually.  Other training received by employees includes: ammonia awareness, what to do in case of emergency, and where to go when an evacuation is called. \n\nThe following summarizes the notification procedures at the facility:\n\n1. First call Clackamas Fire Department at 911 from an internal/landline phone.  You can directly contact the Oregon Emergency Response Commission c/o State Fire Marshall at 503-378-6377.\n\n2 If an ammonia release exceeds 100 pounds (Federal Reportable Quantity CERCLA), call the National Response Center 800-424-8802, the State"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012268,
      "SummaryText": "ver (CPR-2).  In addition, liquid ammonia is routed to the compressors for thermosyphon oil cooling.  The 65 psig Controlled Pressure Receiver sends liquid ammonia to the Dock Area Evaporators and the 25 psig Controlled Pressure Receiver (CPR-1).  At the Dock Evaporators, the liquid ammonia is partially vaporized as it absorbs heat from the product and room.  The resultant vapor/liquid mix is drawn back to the +15Â°F Suction Accumulator (ACC-2).\n\nThe 25 psig Controlled Pressure Receiver sends liquid ammonia to the Freezer Penthouse Evaporators.  At the Freezer Penthouse Evaporators, the liquid ammonia is partially vaporized as it absorbs heat from the product and room.  The resultant vapor/liquid mix is drawn back to the -25Â°F Suction Accumulator (ACC-1).\n\nAt the Suction Accumulators, the wet suction from the evaporators is separated.  The liquid falls to the bottom and the vapor is drawn from the top by the Compressors.  The Booster Compressors and High Stage Compressors draw from the -25Â°F Suction Accumulator and +15Â°F Suction Accumulator, respectively.   Liquid is returned to the respective Controlled Pressure Receiver via two Drum Traps associated with each accumulator (PD-1, 2, 3, & 4).\n\nThe Swing Compressor may operate as either a Two Stage or High Stage Compressor, depending on system demand.  The Booster Compressors discharge vapor to the +15Â°F Suction Accumulator and the High Stage Compressors discharge vapor to the Condensers.  High stage discharge from the Compressors is also used in i) the hot gas defrost cycle of the evaporators, ii) pressurizing the Drum Traps during the liquid transfer process, and iii) maintaining pressure in the Controlled Pressure Receivers.\n\nThe high stage discharge from the Compressors is condensed back into high pressure liquid at the Condensers.  Latent heat is rejected by spraying water and blowing air over coils filled with ammonia.  The resultant high pressure ammonia liquid is returned to the Thermosyphon Receiver to be"
    }
  ]
}