{
  "FacilityID": 1000118443,
  "FacilityName": "Enterprise Whiting Terminal & Storage",
  "FacilityStr1": "16653 Iowa Highway K45",
  "FacilityStr2": null,
  "FacilityCity": "Whiting",
  "FacilityState": "IA",
  "FacilityZipCode": "51063",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19133",
  "LEPC": "Monona County LEPC",
  "FacilityLatDecDegs": "42.117711",
  "FacilityLongDecDegs": "-096.142350",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 48210686,
  "ParentCompanyName": "Enterprise Terminal & Storage, L.L.C.",
  "Company2Name": null,
  "CompanyDUNS": 49563984,
  "Company2DUNS": null,
  "OperatorName": "Enterprise Products Operating, LLC",
  "OperatorStr1": "P. O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 3,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000191384",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-09-12 00:00:00",
  "SafetyInspectionBy": "Baker Risk Consultants",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "2008 Re-submission to remove ammonia facilities",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-11-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2024-11-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2024-11-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2029-11-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 42.1172,
  "FRS_Long": -96.1416,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R02",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000147870,
      "AltID": "Propane Storage & loading",
      "FacilityID": 1000118443,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000184812,
          "ProcessID": 1000147870,
          "ChemicalID": 98,
          "Quantity": 320000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000184813,
          "ProcessID": 1000147870,
          "ChemicalID": 105,
          "Quantity": 11000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000149483,
          "ProcessID": 1000147870,
          "NAICSCode": "42471",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000118443,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Whiting Volunteer Fire Department",
    "CoordinatingAgencyPhone": "7124232525",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000118443,
      "SummaryText": "Enterprise Whiting Terminal & Storage\nEnterprise Products Operating LLC.\nExecutive Summary\nRisk Management Plan\nEPA Identifier: 1000 0019 1384\n\nAccidental Release Prevention and Response\n\nEnterprise Products Operating LLC, operator of the Whiting Terminal & Storage, is committed to operating and maintaining all of our processes (especially those using hazardous substances) in a safe and responsible manner.  We use a combination of accidental release prevention programs and emergency response planning programs to help ensure the safety of our employees and the public as well as protection of the environment.  This document provides a brief overview of the comprehensive risk management activities that we have designed and implemented, including:\n\n* A description of our facility and use of substances regulated by EPA's RMP regulation\n* An overview of our accidental release prevention programs\n* A five-year accident history for accidental releases of chemicals regulated by EPA's RMP rule\n* An overview of our emergency response program\n* An overview of planned improvements at the facility to help prevent accidental chemical releases from occurring and adversely affecting our employees, the public, and the environment\n\nDescription of the Stationary Source and Regulated Substances\n\nThe Whiting Terminal & Storage is a liquefied petroleum gas (LPG) pipeline and propane storage/loading facility. The process is regulated by Federal OSHA 29 CFR 1910.119 and 40 CFR Part 68.  We have registered the facility as an RMP Program Level 1 facility.\n\nThe Whiting Terminal & Storage has two pipelines that are routed through the facility and are regulated by the Department of Transportation. These two pipelines are a mixed product line (natural gasoline, naphtha, normal butane, iso-butane and propane) and a dedicated propane pipeline. The facility receives propane from either pipeline (primarily from the dedicated propane pipeline) into a propane storage tank. This tank is used for distrib"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000118443,
      "SummaryText": "ution to the truck transport loading docks which also have the capability to stench the propane with ethyl mercaptan for retail sales companies.\n\nAll of the propane and ethyl mercaptan storage tanks are administratively controlled to hold and not exceed a maximum 80% of full capacity.\n\nIn our process we use the following chemicals that the EPA has identified as having the potential to cause significant offsite consequence in the event of a substantial accidental release:\n\nToxics\n\nThere are no toxic materials contained on site above the threshold limits. \n\nFlammables\n\nPropane is a finished product which can be delivered into the storage tank via the dedicated propane pipeline, or from a batch of propane in the mixed product pipeline. This material is routed from the tank to the truck transport loading docks for wholesale shipment to propane retailers.\n\nEthyl mercaptan is used for propane odorization at the truck transport.\n\nOffsite Consequence Analysis Results\n\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site and no toxic substances above the threshold quantity.\n\nGeneral Accidental Release Prevention Program\n\nThe following is a summary of the accidental release prevention program in place at Whiting Terminal & Storage.  The process at the facility is regulated by the Environmental Protection Agency (EPA) Risk Management Program (RMP) regulation (Program 1).  Release prevention is provided through the use of written operating procedures, employee training in written procedures, including normal operation and emergency release procedures, and in the design of safety and release prevention equipment installed at the terminal site.  In addition, a written safety program designed to comply with all applicable OSHA safety performance regulations is strictly enforced at all Enterprise facilities, including the Whiting Terminal & Storage facility.  As part o"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000118443,
      "SummaryText": "f the Enterprise safety program, the facility utilizes procedures that are included in the Enterprise program, but may not specifically be required at non-PSM and/or RMP Program 1 facilities (e.g. Safe work practice training; safe work permitting and hot work permitting).\n\nUniversal Prevention Activities\n\nThe accident prevention program summarized previously is applied to all RMP covered processes at Whiting Terminal & Storage facility Whiting Terminal & Storage.  Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors.\n\nSpecialized Safety Features\n\nThe Whiting Terminal & Storage has safety features on many units to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\nRelease Detection\n\n* Hydrocarbon (hazardous gas) detectors and alarms\n* Plant video surveillance system\n\nRelease Containment and Control\n\n* Valves to permit isolation of the process (manual or automated).\n* Automatic shutdown systems for specific process parameters (e.g., high pressure).\n* Secondary containment (curbs and dikes) to contain any release of liquid chemicals\n* Redundant equipment and instrumentation where advisable\n* Seal failure alarms installed on hydrocarbon liquid pumps.\n* Terminal fire detection system\n* Terminal emergency shutdown (ESD) system with multiple activation points\n* Atmospheric relief devices\n\nRelease Mitigation\n\n* Hand-held fire extinguishers\n* Personnel trained in emergency response and procedures.\n* Personnel protective equipment (e.g., chemical protective clothing, hard hats, safety glasses, etc.)\n\nFive Year Accident History\n\nRecords are kept for all significant accidental chemical releases that occur at our facility.  The following is a brief summary of accidental chemical releases involving materials covered under EPA's RMP rule during the past five y"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000118443,
      "SummaryText": "ears:\nThis facility has not had an accidental release in the last five years which meets the criteria set forth in 40 CFR 68.10, \n\nEmergency Procedures Information\n\nThe Whiting Terminal & Storage maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.\n\nThe overall emergency procedure program for the Enterprise Whiting Terminal & Storage is coordinated with the Monona County Local Emergency Planning Committee (LEPC). This coordination includes periodic meetings of the committee, which includes local emergency response officials, local government officials and industry representatives. The Enterprise Whiting Terminal & Storage has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\n\nPlanned Changes to Improve Safety\n\nThe Whiting Terminal & Storage resolves all findings from PHAs, some of which result in modifications to the process.  Other recommendations for possible changes to improve safety come from periodic accident prevention program audits, incident investigations, or employee suggestions and recommendations.  The following changes are planned for implementation at the Whiting Terminal & Storage.\n\n* No changes are planned."
    }
  ]
}