{
  "FacilityID": 1000070096,
  "FacilityName": "Raven Butene-1, LLC",
  "FacilityStr1": "9520 East Freeway",
  "FacilityStr2": null,
  "FacilityCity": "Baytown",
  "FacilityState": "TX",
  "FacilityZipCode": "77521",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Greater Baytown-Chambers Count",
  "FacilityLatDecDegs": "29.818345",
  "FacilityLongDecDegs": "-94.916095",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I4",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": "ted.pettijohn@arcanumchem.com",
  "FacilityDUNS": 80298804,
  "ParentCompanyName": "Arcanum Infrastructure, LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Arcanum Infrastructure, LLC",
  "OperatorStr1": "2800 Post Oak Blvd Suite 1950",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77056",
  "OperatorZipCodeExt": null,
  "FTE": 29,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000238959",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-05-14 10:30:31",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-14 10:30:31",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-05-14 10:30:31",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-05-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 29.821732,
  "FRS_Long": -94.915387,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000088157,
      "AltID": "Butene-1 Production Facil",
      "FacilityID": 1000070096,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000110401,
          "ProcessID": 1000088157,
          "ChemicalID": 119,
          "Quantity": 7250000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000110405,
          "ProcessID": 1000088157,
          "ChemicalID": 95,
          "Quantity": 11000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000089379,
          "ProcessID": 1000088157,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000074518,
              "Process_NAICS_ID": 1000089379,
              "SafetyReviewDate": "2019-04-01 00:00:00",
              "PHA_Date": "2019-04-08 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-06-20 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "Yes",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "Yes",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Process unit sloped to prevent accumulation of pooled liquids, remote impoundement for containment of released products, blast resistant buildings",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "hydrocarbon detectors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "This is the initial submission of RMP",
              "OpProceduresReviewDate": "2019-05-08 00:00:00",
              "TrainingReviewDate": "2019-05-08 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Involvement in construction, commissioning and final check out of process.  Also involved in licensor training.",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2019-05-08 00:00:00",
              "EquipmentInspectionDate": "2019-05-09 00:00:00",
              "EquipmentTested": "Cathodic protection on underground piping",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2019-04-01 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": null,
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2018-12-05 00:00:00",
              "InvestigationChangeDate": "2019-02-05 00:00:00",
              "ParticipationPlansReviewDate": "2019-04-01 00:00:00",
              "HotWorkPermitReviewDate": "2019-01-22 00:00:00",
              "ContractorSafetyReviewDate": "2018-04-10 00:00:00",
              "ContractorSafetyEvalDate": "2019-04-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000092841,
                  "PreventionProgram3ID": 1000074518,
                  "ProcessChemicalID": 1000110405
                },
                {
                  "PrimaryKey": 1000092840,
                  "PreventionProgram3ID": 1000074518,
                  "ProcessChemicalID": 1000110401
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000070096,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Greater Baytown-Chambers County LEP",
    "CoordinatingAgencyPhone": "4092672445",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000070096,
      "SummaryText": "he reactor effluent, containing unreacted ethylene, butene-1, C6+ and deactivated catalyst is routed to the separation system where it is segregated into four individual streams using vaporizers, thin film evaporators and simple distillation.  The ethylene is routed back to the reactor where it is reused in the process.  The hexene and deactivated catalyst streams are stored in separate vessels and transported to customers via tanker truck or, in the future, rail. The butene-1 is stored in a pressurized sphere for transport to customers via pipeline and tanker truck or, in the future, rail.\r\n\r\nUtilities for the process include steam production, nitrogen, plant and instrument air, firewater, plant water, potable water and cooling water.  Overpressure protection is provided using a relief system vented to a ground flare designed to be smoke free.\r\n\r\nThe general accidental release prevention program and chemical-specific prevention steps \r\nThe Raven Facility complies with all applicable Federal, State and Local Government requirements to ensure safe and environmentally friendly operation.   \r\n\r\nRaven is a state of the art facility aimed at preventing accidental releases of material.  It has been automated and controlled to reduce reliance on human input thereby reducing human error.  The process parameters (pressure, temperature, flow, level, etc.) are monitored utilizing modern control system that alerts the operator to certain process changes.  Additionally, it is interlocked with the process to place the facility in a safe state if predefined operational limits are reached.  The Raven employees are equipped with intrinsically safe equipment such as radios, gas detectors, etc. to help facilitate the safe operations and maintenance of the facility.  \r\n\r\nRaven has developed a Process Safety program utilizing the industry experience of its employees and modern software from a service provider that provides similar solutions to other production facilities.  Raven's Proce"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000070096,
      "SummaryText": "The accidental release prevention and emergency response policies at your facility \r\nIt is the policy of Raven to provide a safe and healthy place of employment for employees, contractors, and visitors by following Federal, State, and Local Government requirements, as well as safe work and industry best practices. The Raven employees and management are committed to operating a safe, efficient and technologically advanced facility.  Our operation will strive to protect plant personnel and equipment, which in turn will protect the community and the environment.  \r\n\r\nOperational excellence will be achieved through strict adherence to policies and procedures, which are available electronically to all employees.  Our employees are encouraged and empowered to identify potential hazards in the workplace and take prompt action to mitigate and/or resolve the issue.  In addition to traditional paper-based systems, Raven may equip its operators with intrinsically safe equipment to help facilitate the documentation of the issues identified and actions taken.  Raven is utilizing a software package (BasicSafe) that is used by a number of similar facilities to help track, monitor and manage process safety.  Please see https://www.basicsafe.us/ for additional information regarding BasicSafe.  As such, Raven is leveraging the modern computer programs with its traditional operator training programs.  Documentation in the software systems as well as other documentation collected is reviewed by management to ensure no additional actions are required.  The use of technology in addition to traditional programs also ensures that operators and maintenance employees have access to procedures and operating information thereby reducing errors that may lead to unsafe conditions, accidents and releases.  Additionally, routine audits by management and HSE employee(s) are performed to identify opportunities for improvement.  Audits and subsequent actions are tracked to completion using the audit"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000070096,
      "SummaryText": "and action item electronic system.  All items reported from audits and observations are discussed with employees during the routine safety meetings. All employees, contractors, and visitors are encouraged to seek assistance from Raven Supervision should they have any questions or concerns.\r\n\r\nRaven facility has developed an Emergency Action Plan and is a nonresponse facility which means that Raven will not actively respond to some situations but will instead let trained experts do so.  During operations, we will have an agreement with Channel Industries Mutual Aid (CIMA) to respond to plant emergencies requiring mitigation of uncontrolled releases or fires involving hazardous substances.  Raven attends the Greater Baytown - Chambers County LEPC meetings and holds open communications with city managers and officials.  The Raven employees are trained to the First Responder Operations Level to allow the ability to perform basic control, containment and/or confinement within their capabilities until the arrival of the emergency response organizations.  \r\n\r\n\r\nYour facility and the regulated substances handled \r\nThe Raven Facility operates one 1/4th mile natural gas pipeline and two 2.5-mile pipelines for Ethylene and Butene-1 respectively as well as an 100,000 ton/yr nameplate butene-1 production facility in Baytown, Texas.  The 100,000 ton/yr butene-1 facility is based on a proven design from a technology licensor that is used in a number of similar facilities globally.  The butene-1 facility is designed and built based on a lump sum turn key EPC contract with a third-party service provider.  The ethylene raw material is supplied to the facility via one of the two 2.5 mile pipelines.  If required, the ethylene is dried to remove excess contaminants and then mixed in one of two reactor trains with alkyl catalyst to produce butene-1, a comonomer primarily used in the production of polyethylene.  A byproduct of the reaction produces hexenes and heavier components (C6+).  T"
    },
    {
      "ESSeqNum": 12,
      "FacilityID": 1000070096,
      "SummaryText": "lity, Raven will go through the multi-year process of obtaining Responsible Care certification from the American Chemical Council.  This certification embeds continuous improvement in the management systems that are currently utilized by a facility.\r\n\r\nAdditionally, Raven will begin preparing for the first PSM compliance audit by performing a self-audit.  This audit will be performed in 2020 and will be used to review the effectiveness of the PSM program prior to the compliance audit in late 2022.\r\n\r\nThe Raven team will also work with the BasicSafe software provider to implement improvements to the software platform used to document, track and manage Raven's PSM functions ."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000070096,
      "SummaryText": "ss Safety program has been developed and implemented by leveraging practices and procedures learned from the refining, chemical manufacturing and pipeline industries.  The highlights of the program are listed below:\r\n\r\nEmployee Participation:\r\nEmployee participation is vitally important for a successful process safety program.  Employee participation ensures that employees' views and opinions are considered during the development and implementation of the process safety program as required by the PSM/RMP Manual.  Through employee participation, employees are provided ready, easy access to all information required to be developed.\r\nThe employee participation policy applies to all hourly and salaried employees, including resident contractors, working in and/or adjacent to the covered process, whose activities can influence process safety.  The PSM/RMP program has been developed and implemented with direct participation and involvement from all levels of the organization.  All employees are encouraged to raise process safety concerns, make suggestions for improvement, and request additional information and/or training by contacting their immediate supervisor or any manager, officer or Board member of Raven.\r\nEmployee participation has been encouraged and rewarded through the construction phase of Raven and will continue to be encouraged by periodically reminding employees to raise process safety concerns and questions, suggest improvements, and request additional information/training in needed areas.  The following guidelines have been implemented to obtain employee input and participation:\r\n\r\n¿\tEncouragement of reporting of potentially unsafe conditions.\r\n¿\tEncouragement and support of employees to directly participate in PSM Process such as PHA, Operating Procedure development and implementation, PSSR, construction inspections, etc.,\r\n¿\tRequirement for the employees to attend regularly scheduled safety meetings.  These meetings continue to provide an ongoing mechanis"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000070096,
      "SummaryText": "m for employees to receive training and provide feedback.  When suitable the attendance and the topics discussed are recorded.\r\n¿\tPlant management has and will continue to meet periodically with employees to talk about safety and to solicit employee input,\r\n¿\tPromote participation through safety meetings, letters from plant management, bulletin board postings and electronic mail, \r\n¿\tAdvise employees and contractors through these methods that their process safety concerns, questions, and suggestions are welcome,\r\n¿\tRespond to concerns and document both the question/concern and the response as appropriate.\r\n \r\nProcess Safety Information:\r\nComplete and accurate written process safety information (PSI) enables employees involved in operations of the facility the ability to effectively identify and understand the hazards posed by the process. Complete and accurate process safety information is essential for an effective PSM/RMP program and for conducting Process Hazard Analyses (PHA).  The PSI will be updated to reflect all changes to the covered facility.  Any change to existing PSI requires the execution of a management of change (MOC). \r\nProcess Safety Information will be compiled and maintained with up-to-date information pertaining to:\r\n¿\tProperties of the highly hazardous chemicals (regulated substances) used or produced.\r\n¿\tTechnology of the process.\r\n¿\tEquipment used in the process.\r\n\r\nAll process safety information is available electronically for each employee.  \r\n\r\nProcess Hazard Analysis:\r\nRaven has conducted an initial process hazard analysis (PHA) as well as a follow-up PHA toward the end of the construction of the facility.  The follow-up PHA was conducted to make sure that changes since the initial PHA had been considered adequately.  \r\n\r\nIt is commonly understood in the industry that a PHA is one of the most important elements of a process safety management program.  A PHA is an organized and systematic effort to identify and analyze the significance of"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000070096,
      "SummaryText": "potential hazards associated with storage, handling, and processing of highly hazardous chemicals (HHC).  The PHA policy and procedure provides a guideline for conducting and documenting PHAs to assist employees in making decisions for improving safety and reducing the consequences of unwanted or unplanned releases of HHC.   \r\nA PHA is directed toward analyzing potential causes and consequences of fires, explosions, releases of toxic of flammable chemicals, and major spills of hazardous chemicals.  The PHA focuses on equipment, instrumentation, utilities, human actions (routine and non-routine), and external factors that might impact the process.  These considerations assist in determining the hazards and potential failure points or failure modes in the process.\r\nThe procedure applies to the covered processes within the facility. It governs the means and requirements for:\r\n\r\n¿\tConducting PHAs according to the required schedule.\r\n¿\tSelection and use of the appropriate PHA methodology.\r\n¿\tPHA documentation.\r\n¿\tPHA team composition.\r\n¿\tSystem for promptly addressing PHA findings and recommendations; completing corrective actions in a timely manner; and communicating actions to affected personnel;\r\n¿\tUpdating and revalidating PHAs.\r\n¿\tRetaining PHA documentation.\r\n\r\nAs stated above, an initial PHA as well as a follow-up PHA has been completed for the Raven facility in accordance with the established protocol.  All actions required to mitigate potential hazards have been tracked to completion and/or close out recorded in the BasicSafe system.\r\n\r\nOperating Procedures:\r\nWritten operating procedures have been developed and implemented that provide clear instructions for safely operating processes.  These procedures utilized, among other things, information provided by the process technology provider that has licensed a substantial number of similar plants world-wide.  Operating procedures have been developed for:\r\n¿\tInitial Startup\r\n¿\tNormal Operation\r\n¿\tTemporary Operation"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000070096,
      "SummaryText": "¿\tEmergency Shutdown\r\n¿\tNormal Shutdown\r\n¿\tStartup following shutdown\r\n\r\nThe operating procedures address steps for each operating phase, normal and safe operating limits, safety and health considerations, and safety systems and their functions.  Operating procedures are readily accessible to employees who work in or maintain a process using intrinsically safe tablets. The operating procedures are reviewed as often as necessary to ensure that they reflect current operating practices, including changes in process chemicals, technology, equipment, and facilities. To guard against outdated or inaccurate operating procedures, the procedures are certified annually to validate that these operating procedures are updated, current and accurate.\r\nTraining:\r\nTraining provides employees, including contractor employees, with an understanding of the nature and causes of problems arising from process operations and increases employee awareness with respect to the hazards particular to the process.  An effective training program significantly reduces the likelihood and severity of incidents arising from process operations and is instrumental in preventing small problems from leading to a catastrophic release, accidents or events.  Employees receive initial training on the process and will receive refresher training every 3 years.  All training is documented in the training module of the BasicSafe system.\r\nAll employees, including contractor employees, involved in operating the process are covered by this policy and procedure.  This part identifies the minimum training requirements for personnel involved in operating the process.  Training for maintenance personnel is addressed in the Mechanical Integrity section of the manual.  \r\nContractors:\r\nContractors will play a role in the facility and the work that occurs.  There is an application, review, and monitoring process for all contractors whose activities have potential to impact process safety.  The process will involve both re"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000070096,
      "SummaryText": "gular Raven employees and contractor personnel working together to ensure safety performance, safety programs, notification, and training are adequate to facilitate a safe working environment.  The company will also periodically evaluate contractor performance and will maintain training and injury documentation.  Additionally, there is specific training for the contractors to ensure they are knowledgeable in the hazards and appropriate action plans associated with the work they will be executing.  \r\nPre-Startup Safety Review\r\nA Pre-Startup Safety Review will be completed for permanent and temporary changes prior to placing these changes in service and starting the facility.  The PSSR will be documented inside the MOC in the BasicSafe system.  The PSSR checks to ensure that all the required changes were implemented as designed, all required PSI has been updated and all required training has been completed. The PSSR will be completed prior to the commissioning and startup of Raven.   In addition, PSSR will also be implemented if required in relation to future MOC before the equipment/process impacted by the change is restarted.\r\nAdditionally, a PSSR will be performed prior to initial startup or startup following a shut down for maintenance of the facility.  The PSSRs after the initial startup will typically only be performed only for the portions of the system that have had maintenance performed.  If the entire facility is shut down and cooled down in relation to a maintenance / MOC, a complete PSSR will be performed.  The PSSRs for Raven will be executed as an operating procedure and there will be a verification that all instrumentation and critical equipment are functional prior to re-introducing highly hazardous chemicals into the process if the relevant hazardous chemicals where removed.  \r\n\r\nMechanical Integrity\r\nThe Mechanical Integrity (MI) program describes the policies, plans, and procedures for maintaining the ongoing mechanical integrity of equipment at the"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000070096,
      "SummaryText": "facility.  The purpose of the MI program is to assure that equipment used in the processing, storage, and handling of highly hazardous chemicals is designed, constructed, installed, and maintained to minimize the risk of releases, accidents and unplanned events.  The MI program provides written procedures, training, inspection and testing, and quality assurance measures aimed at minimizing the risk of a hazardous release.\r\nA list of process equipment covered by the MI program is available in the Computerized Maintenance Management System, eMaint that is provided by a service provider to a number of similar petrochemical facilities.  Please see https://www.emaint.com/ for additional information regarding eMaint.  Any piece of equipment that meets the criteria to be included in the MI program will be designated as such.\r\nHot Work\r\nHot work permitting is used to establish safe work practices for control of ignition sources to reduce the likelihood of fires and/or explosions resulting from improper hot work operations. Hot work is defined as any work or use of equipment that may introduce a source of ignition in an area where flammable materials or vapors may be present. The Hot Work Permit is found in the Permit Tool section of BasicSafe.\r\nA permit must be issued prior to hot work operations in or near any process areas. The permit will be issued for a specific task on specific equipment. The employee or contractor conducting any type of hot work must request a Hot Work Permit in the control room. If Hot Work can be moved to a non-process area, such as the workshop, this should be considered first.  Note that Raven will take over the responsibility for Safety in regards to hot work at Mechanical Completion and that there are no plants to bring in large amounts of ethylene or butene-1 to the facility prior to Mechanical Completion.\r\n\r\nManagement of Change:\r\nAll modifications or changes (other than replacement in kind) to the process is managed through a module in Bas"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000070096,
      "SummaryText": "icSafe.  The system defines responsibilities, steps for assessing risks and approving changes, requirements for reviewing designs for temporary and permanent changes, steps needed to verify that modifications have been made as designed, time limit authorizations for temporary changes, and steps for organizational and emergency changes.  A Change is any modification or alteration of equipment, materials, process conditions, procedures or organizational structure at the facility.\r\nEmployees who operate a process and maintenance and contract employees whose job tasks will be affected by a change in the process must be informed of, and trained in, the change prior to startup of the process or startup of the affected part of the process. If a change covered by these procedures results in a change in the required process safety information, such information also must be updated accordingly. If a change covered by these procedures changes the required operating procedures or practices, they also must be updated.\r\nIncident Investigation:\r\nIncident investigation is the process of identifying the underlying causes of incidents and implementing the steps and lessons learned' to prevent similar events from occurring in the future. The desired outcomes of an incident investigation are: the identification of the contributing factors and root causes of the incident; recommendations for changes in practices and/or facilities to mitigate the likelihood of future occurrence; and, communication of incident reports and resulting changes to affected personnel.  \r\n\r\nAll personnel are responsible for the timely reporting of any incident observed, including near misses. This includes contractors, temporary workers and visitors to the site. Training material is provided for all new employees at time of arrival on site. The training for new employees provides a comprehensive overview of the Incident Tool located in BasicSafe. The Incident tool is used for all incident investigation repo"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000070096,
      "SummaryText": "rting.  A system to promptly address and resolve the incident findings and recommendations has been established including documenting resolutions and corrective actions. The report is shared with all affected personnel whose job tasks are relevant to the incident findings (including contract employees when applicable). \r\n\r\nCompliance Audit:\r\nTo ensure the effectiveness of the Process Safety Management (PSM) program, periodic evaluations are performed to identify deficiencies or areas for improvement.  This includes ascertaining whether the internal procedures and practices are adequate and are being followed to ensure process safety.\r\nThe audit is a self-evaluation of the facility relative to regulatory requirements to verify their suitability and effective implementation. The focus is on PSM systems and the policies, procedures and practices developed to implement the systems.  \r\nFollowing each audit, management will promptly review audit findings.  For each finding a corrective action is determined and responsibility to complete is assigned.  These corrective actions are entered into BasicSafe for tracking.   \r\nTrade Secrets:\r\nRAVEN does not have own any proprietary processes that are deemed as a trade secret but have obligations to their party technology providers to protect the technology they licensed to Raven.  All pertinent information, including trade secrets and third party licensed technology, is and will be made available to persons, developing operating procedures, compiling process safety information, conducting hazard analysis and incident investigations.\r\n Raven has contractual obligations to protect the dissemination of some of the technology used in the facility. In case the information could be considered a trade secret or a contractual obligation require that it is protected from dissemination, Raven may require that confidentiality agreements are put in place that cover employees or contractors having access to trade secret and protected informat"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000070096,
      "SummaryText": "ion. Employees and contractors working in trade secret and protected processes has access to all information contained in PHAs and other PSM related documents.\r\nThe five-year accident history \r\nThe Raven facility is expecting to start production of butene-1 form ethylene in the summer of 2019.  To date, Raven have had no accidents to report.\r\n\r\nThe emergency response program \r\nRaven facility has developed an Emergency Action Plan and is considered a non-response facility under current regulation meaning that the employees will not directly respond to emergencies of a certain severity.  Instead, Raven will rely on trained experts to manage these emergencies. During operations, including during commissioning and start-up activities, Raven will have an agreement with Channel Industries Mutual Aid (CIMA) to respond to plant emergencies requiring mitigation of uncontrolled releases or fires involving hazardous substances. \r\nAll Raven employees have received portable fire extinguisher training to respond to incipient stage fires. Raven Operations and Maintenance Employees have been trained, and will respond to any spills or releases as First Responder Operations Level individuals. \r\nEmergency notification drills are planned quarterly for the site commencing at Mechanical Completion when Raven takes over the responsibility for safety of the facility from the EPC Contractor. This emergency notification drills are performed to ensure employees are efficient in the actions necessary for response to emergency situations. Raven has ensured that municipal dispatch for public notifications of emergency situations is in the Emergency Action Plan. Additionally, employees are trained on the steps necessary to make timely and accurate communications to the City of Baytown, Texas should the need for outside assistance be deemed necessary.\r\nPlanned changes to improve safety \r\nRaven management is dedicated to improving the existing programs currently in place.  After startup of the faci"
    }
  ]
}