{
  "FacilityID": 1000069360,
  "FacilityName": "Mahoning Valley Sanitary District",
  "FacilityStr1": "1181 Ohltown McDonald Road",
  "FacilityStr2": null,
  "FacilityCity": "Mineral Ridge",
  "FacilityState": "OH",
  "FacilityZipCode": "44440",
  "Facility4DigitZipExt": "0124",
  "FacilityCountyFIPS": "39155",
  "LEPC": "Trumbull County LEPC",
  "FacilityLatDecDegs": "41.153879",
  "FacilityLongDecDegs": "-080.777290",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PU",
  "FacilityURL": "www.meanderwater.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 77751105,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ramesh Kashinkunti",
  "OperatorStr1": "1181 Ohltown McDonald Road",
  "OperatorStr2": null,
  "OperatorCity": "Mineral Ridge",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "44440",
  "OperatorZipCodeExt": "0124",
  "RMPContact": "Keith D. Rees",
  "RMPTitle": "Chief of Operations",
  "FTE": 49,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000028579",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-05-26 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-05-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-05-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-05-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-05-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 41.15035,
  "FRS_Long": -80.77573,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "39.7",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000086916,
      "AltID": "Chlorination",
      "FacilityID": 1000069360,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000088138,
          "ProcessID": 1000086916,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000108384,
          "ProcessID": 1000086916,
          "ChemicalID": 62,
          "Quantity": 48000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000608384,
          "ProcessID": 1000086916,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000069360,
      "SummaryText": "The Mahoning Valley Sanitary District (MVSD) owns and operates a water Treatment Plant (WTP) which produces potable water from the Meander Creek Reservoir.  MVSD furnishes potable water to the Cities of Youngstown and Niles, and it acts as an agent for these cities in supplying the Village of McDonald. These cities then supply water to the surrounding metropolitan areas including Girard, Canfield, Mineral Ridge, and portions of eight townships.  MVSD presently serves 220,000 people and produces an average flow of 22 million gallons per day.\n\n\n\nMVSD conducts periodic audits of the Chlorination Process to ensure MVSD's Prevention Program has been effectively implemented and addresses the safety issues of our operations.  Compliance audits are conducted at least every three years by a team of hourly and management personnel who are knowledgeable of the Risk Management Program (RMP) Rule and the Chlorination Process.  The team evaluates MVSD's Prevention Program and other aspects of MVSD's RMP.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the Prevention Program are implemented.  MVSD maintains records of at least the last two audits conducted.\n\n \n\n*Incident Investigation\n\n \n\nThe MVSD promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n\n\n*Employee Participation\n\n \n\nMVSD developed a written employee participation program for the Chlorination Process and other aspects of our operations to ensure that the safety concerns are addressed.  MVSD encourages the active participation of our employees in th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000069360,
      "SummaryText": "e Prevention Program for all processes and tasks at our facility.  Employees are consulted on and informed of all aspects of the MVSD RMP and participate on PHA and Compliance Audit teams.\n\n\n\n*Hot Work Permits\n\n \n\nMVSD established a Safe Work Permit program to control spark or flame producing activities that could result in fires or explosions in the processes at our facility.  MVSD utilizes a Safe Work Permit form designed after the OSHA fire prevention and protection requirements found in 29 CFR 1910.252(a).  Personnel who are to perform the Hot Work are required to complete the form which is reviewed by the area supervisor.  The form must be approved before work can proceed.  Training in the use of the Safe Work Permit form is provided to all affected personnel.\n\n \n\n*Contractors\n\n \n\nMVSD established a program to help ensure that contractors who are used to supplement the workforce during periods of increased maintenance or construction conduct their work in a safe manner.  Under the program, the record of all contractors is reviewed to ensure that MVSD hires contractors who can safely perform work on or near covered process equipment.  Our program ensures that contractors:\n\n \n\n* perform their work in a safe manner,\n\n* have the appropriate knowledge and skills,\n\n* are aware of the hazards in the workplace,\n\n* understand what to do in the event of an emergency,\n\n* understand and follow MVSD safety rules, and\n\n* inform MVSD personnel of any hazards identified during their work.\n\n \n\n*Program efforts are accomplished by providing contractors with:\n\n \n\n* a process overview,\n\n* information about safety and health hazards,\n\n* emergency response plan requirements, and\n\n* safe work practices prior to beginning work.\n\n\n\n*Chemical Specific Prevention Steps\n\n \n\nIndustry standards are followed at the MVSD to help ensure safe handling of chlorine.  The vendor supplies chlorine via a Department of Transportation (DOT) approved truck and in DOT approved 1-ton cylinders.  The chlo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000069360,
      "SummaryText": "rination process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works Association, ASME, ANSI, and other applicable standards and codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to the guidelines required by MVSD. \n\n\n\n*Emergency Response Programs\n\n \n\nMVSD has prepared a written emergency action plan that complies with the RMP Rule, other federal standards and industry guidelines.  This plan has been communicated to the Local Emergency Planning Committee (LEPC) and local fire department.  MVSD periodically conducts emergency drills to test our emergency plan and coordinate these drills with the local fire department.\n\n\n\n*Five Year Accident History\n\n\n\nThere has been no accidents or incidents that resulted in injuries to employee, the public, or the environment at MVSD in the past five years.\n\n\n\n*Planned Changes to Improve Safety\n\n\n\nMVSD continuously strives to improve the safety of our processes through incident investigation, Process Hazard Analysis, and employee suggestions.  Our engineering and technical personnel stay abreast of technology advancements which may improve the safety of our processes.  \n\n\n\n\n\n"
    }
  ]
}