{
  "FacilityID": 1000060422,
  "FacilityName": "Minnesota Freezer Whse. Co. Albert Lea",
  "FacilityStr1": "820 E 13th St,",
  "FacilityStr2": null,
  "FacilityCity": "Albert Lea",
  "FacilityState": "MN",
  "FacilityZipCode": "56007",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "27047",
  "LEPC": null,
  "FacilityLatDecDegs": "43.626111",
  "FacilityLongDecDegs": "-93.356667",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7790751,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Minnesota Freezer Warehouse Co",
  "OperatorStr1": "820 E. 13th St",
  "OperatorStr2": null,
  "OperatorCity": "Albert Lea",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56007",
  "OperatorZipCodeExt": null,
  "RMPContact": "CHARLES THOMAS NEWELL",
  "RMPTitle": "President",
  "FTE": 32,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000215242",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-11-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-10-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-10-27 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-10-27 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-10-27 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075472,
      "AltID": "Ammonia Refrigeration Sys",
      "FacilityID": 1000060422,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000076653,
          "ProcessID": 1000075472,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000093325,
          "ProcessID": 1000075472,
          "ChemicalID": 56,
          "Quantity": 13000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000593325,
          "ProcessID": 1000075472,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060422,
      "SummaryText": "Minnesota Freezer Warehouse Company RMP Executive Summary\n\n\n\nThe Minnesota Freezer Warehouse facility, located in Albert Lea, Minnesota is a provider of refrigerated and freezer warehouse services for various types of products mainly from food producers.  This plant has a closed loop refrigeration system containing ammonia for maintaining cooler and freezer temperatures for the handling and storage of the products. \n\n\n\nRegulated substance handled: \n\n\n\nAmmonia is the only covered chemical at the facility and is used at the warehouse to refrigerate rooms to maintain a correct temperature as required by the food products being stored.  Ammonia is a valuable chemical used in the plant refrigeration system, providing the means to maintain specified temperature and / or remove heat from the products being handled.  Ammonia is contained in equipment in the plant and is compressed, condensed and evaporated to remove heat from rooms within the facility.\n\n\n\nSince ammonia is classified by EPA as a toxic chemical, it is necessary to observe certain safety precautions in handling the chemical to prevent unnecessary human exposure, to reduce the health threat to our own workers, and reduce the threat to nearby members of the community.  Safety depends upon the manner in which we handle ammonia combined with the safety devices inherent in the design of this plant.  \n\n\n\nAccidental release prevention and emergency response policies:\n\n\n\nIt is the intent of this facility to comply with OSHA's Process Safety Management and EPA's Accidental Release Prevention Rule and with all applicable state codes and regulations. \n\n\n\nThe plant ammonia refrigeration operators are trained using various methods such as on the job training and contractor explanation and training (refrigeration contractors are members of IIAR).  This program consists of having an effective preventative maintenance program and employee training to insure adequate response to equipment integrity.  Employees are initially tr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060422,
      "SummaryText": "ained and have refresher training in the operation of the ammonia refrigeration system and have received refresher training at least every three years.  \n\n\n\nThe ammonia refrigeration system is mainly operated by compressor microprocessors.  An ammonia detection system within the compressor room is in place which alarms if ammonia is sensed.  The ammonia refrigeration system is also protected by specific safety systems/hardware and safety cutouts including pressure, temperature and level control.  Safety relief valves protect the compressor discharge and vessels from the hazards associated with overpressure.  \n\n\n\nAccidental release prevention program:  \n\n\n\nAll elements of the PSM/RMP are followed and the process has numerous safe guards including:  \n\n?    Ammonia is not corrosive in this service.    \n\n?    In areas where forklifts are utilized, all ammonia lines are elevated to eliminate any contact.    \n\n?    The plant has an overall safety program that includes employee awareness and training to minimize the potential for an accident or incident involving the ammonia refrigeration equipment.  \n\n?    A process hazard analysis (PHA) was conducted in 2016.  A team with expertise in engineering, operations, maintenance, and safety evaluated the existing refrigeration system in depth and developed recommendations to improve the safety and operability of the system.  The PHA addressed: (1) process hazards; (2) previous incidents (none reportable); (3) engineering and administrative controls applicable to the hazards; (4) the consequence of control failure; (5) facility siting; (6) human factors; and (7) a qualitative evaluation of possible safety and health effects of control system failures.  \n\n?    Written Standard Operating Procedures (SOPs) were prepared to provide the basis for proper and safe operation of the ammonia refrigeration system.  The SOPs include procedures for normal operations, startup, shutdown, emergency operations, and emergency shutdown.  \n\n?    For plant projects, a"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060422,
      "SummaryText": " management of change procedure and a pre-startup safety review are in place to ensure that system changes or expansions are safe and that the changes are consistent with the engineering design and in condition to be operated prior to startup.  \n\n?    Contractors that are used to work on, or adjacent to, the refrigeration system are \"pre-qualified\" based upon their knowledge of ammonia refrigeration, understanding of applicable codes and standards, and their demonstrated ability to work safely.  Each of these contractors is evaluated from a safety perspective.  \n\n?    The plant has a program for replacement of all pressure relief valves every five years.\n\n \n\nFive year accident history: \n\n\n\nThe plant has had no reportable RMP qualifying releases in the past five year history.  \n\n \n\n\n\nEmergency response program:  \n\n\n\nThe plant has an emergency response program based upon federal guidelines as they apply to this facility.  The emergency response plan ERP) includes in-house response capabilities in the event of a release, procedures for notification of the local fire authority, local emergency response agencies, and notification of any potentially affected neighbors. The plant emergency response plan is based on known applicable regulations and requirements and responders are trained as required.  \n\n\n\nPlanned changes to improve safety:  \n\n\n\nIdentification of opportunities and changes to improve safety is part of the culture of this plant.  In addition to the plant programs mentioned above, the following changes are planned: Upgrade machinery room ventilation alignment, improve ammonia detection control over machinery room ventilation"
    }
  ]
}