{
  "FacilityID": 1000041780,
  "FacilityName": "The Dow Chemical Company",
  "FacilityStr1": "1881 West Oak Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Marietta",
  "FacilityState": "GA",
  "FacilityZipCode": "30062",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13067",
  "LEPC": "Cobb County Resource Council",
  "FacilityLatDecDegs": "33.993067",
  "FacilityLongDecDegs": "-084.526175",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A6",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 1381581,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "The Dow Chemical Company",
  "OperatorStr1": "1881 West Oak Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Marietta",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30062",
  "OperatorZipCodeExt": null,
  "RMPContact": "Troy DeHoff",
  "RMPTitle": "RCO, Marietta",
  "FTE": 160,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000184472",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-11-14 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-06-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-30 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-30 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-30 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.99583,
  "FRS_Long": -84.525,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "ADDRESS MATCHING-DIGITIZED",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000051468,
      "AltID": "TDI Storage",
      "FacilityID": 1000041780,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000054856,
          "ProcessID": 1000051468,
          "NAICSCode": "325211",
          "_desc": {
            "NAICS_CODE": "325211",
            "NAICS_DESCRIPTION": "Plastics Material and Resin Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000062452,
          "ProcessID": 1000051468,
          "ChemicalID": 77,
          "Quantity": 130000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 77,
            "ChemicalName": "Toluene diisocyanate (unspecified isomer)  [Benzene, 1,3-diisocyanatomethyl-]",
            "CASNumber": "26471-62-5",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000562452,
          "ProcessID": 1000051468,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000041780,
      "SummaryText": "                        Executive Summary\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nWe at The Dow Chemical Company are strongly committed to employee, public and environmental safety.  This commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with the processes at our facility.  It is our policy to implement appropriate controls to prevent possible releases of regulated substances.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities encompass production of polyurethane systems.  We have one regulated substance present at our facility, Toluene Diisocyanate (unspecified isomer) [Benzene, 1,3-diisocyanatomethyl-] [CAS 26471-62-5] (TDI).  The liquid is stored in a single tank at the facility, and is used in the production polyurethane systems.\n\n\n\n3. The Worst Case and the Alternative Case Scenarios\n\nThe Worst Case Scenario and the Alternative Case Scenario were completed using RMP*Comp, Version 2.01, the version available on line at the time of submittal. These scenarios are described in the data supplied with this submission. \n\nThe Worst Case Scenario considers total loss of containment of the site's single bulk storage tank.  Material is contained in the concrete dike surrounding the tank, though we also modeled loss of the dike to understand the effect that might have. \n\nThe storage tank is assumed to be full to the high limit (116,273 lbs) and to be held at the upper limit for storage temperature, 92 degrees Fahrenheit. \n\nThe resulting potential affected radius is the same in both scenarios, .4 mile using Worst Case modeling (.1 miles with Alternative Case modeling for these scenarios). Placement of the tank and dike behind sheltering structures, and the heavy construction of the dike walls make loss of containment with an intact dike the more cr"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000041780,
      "SummaryText": "edible scenario. \n\nThe Alternative Case Scenario considers loss of integrity of the hose connecting a delivering TDI tanker truck to the plant offload pump. No credit is taken for the operating discipline practice of being in attendance during unloading, or for the process control system which would stop the pump and alarm if a \"no weight increase\" was detected from the storage tank, or if a \"no pressure\" condition was detected at the pump. It is assumed these safeguards have failed and that intervention would not occur until the entire tanker load was lost.   \n\nThe loss is assumed to be full load of 45,000 lbs at the maximum delivery temperature of 120 degrees Fahrenheit.  Credit is taken for the construction of the unload area, which has a dike. The resulting potential affected radius is .1 mile. \n\nChanges in scenario selection and consideration from the last submission of 2009 were due to the wish to better document the effects of a possible loss of containment of the bulk storage tank.  \n\nDue to a change in applicable NAICS code to 325211 (Plastics material and resin manufacturing) the Marietta site now falls under Program 3.  The Dow internal procedures and requirements followed by our site were already structured to comply with Program 3, as this is the predominant Program requirement for plants subject to RMP elsewhere in the company.   Moving from Program 2 to Program 3 will have a nil effect on site practices and procedures. \n\n\n\n4. General Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA.  This facility was designed and constructed in accordance with applicable API / ASME Specifications, Southern Building Code, and Corporate Standards.    The following sections briefly describe the elements of the release prevention program that are in place at our facility.\n\n\n\nProcess Safety Inform"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000041780,
      "SummaryText": "ation\n\nThe Dow Chemical Company maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with all processes.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are identified and controlled efficiently.  The methodologies used to carry out these analyses are Reactive Chemical/Process Hazard Analysis Reviews, Layer of Protection Analysis Reviews, and other reviews such as annual Management System Reviews.  The studies are undertaken by a team of qualified personnel with expertise in engineering and process operations, and are revalidated at a regular interval of three years.  Production personnel are integral team members in these reviews.  Any findings related to the hazard analysis are addressed in a timely manner.  The most recent PHA/update was performed on 9/11/2013.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, The Dow Chemical Company maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  The information is regularly reviewed and is readily accessible to operators involved in the processes.\n\n\n\nTraining\n\nThe Dow Chemical Company has a comprehensive training program in place to ensure that employees who are operating processes are competent in the operating procedures associated with these processes.  Refresher training is provided at least every three years and more frequently as needed.\n\n\n\nMechanical Integrity\n\nThe Dow Chemical Company carries out highly documented maintenance checks on process equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, storage tanks, piping systems, relief and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000041780,
      "SummaryText": " vent systems, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWritten procedures are in place at The Dow Chemical Company to manage changes in process chemicals, technology, equipment and procedures.  The most recent review/revision of operating procedures was performed on 5/8/2014.  Process operators, maintenance personnel or any other employee whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at The Dow Chemical Company.  The most recent review was performed on 5/23/14.\n\n\n\nCompliance Audits\n\nThe Dow Chemical Company conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The most recent compliance audit was completed on 5/7/2014.  These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nThe Dow Chemical Company promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance.  These investigations are undertaken to identify the root cause of the incident as well as any corrective actions to prevent the release from reoccurring.  All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nThe Dow Chemical Company truly believes that process safety management and accident prevention is a team effort.  Company employees are "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000041780,
      "SummaryText": "strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to all information created as part of the facility's implementation of the RMP rule, including information resulting from process hazard analysis.\n\n\n\nContractors\n\nOur company hires contractors to conduct Logistics, Administrative, Operations, specialized Maintenance and Construction activities.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  The Dow Chemical Company has a strict policy of informing the contractors of known potential hazards related the contractor's work and the processes.  Contractors are also informed of all the procedures for emergency response should an accidental release of a regulated substance occur.\n\n\n\n5. Five-year Accident History\n\nAs with prior submissions, The Dow Chemical Company has had an excellent record of preventing accidental releases.  Due to our stringent release prevention policies, there has been no accidental release during the last 5 years.\n\n\n\n6. Emergency Response Plan\n\nThe Dow Chemical Company carries a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public, as well as post-incident decontamination of affected areas.\n\nTo ensure proper functioning, our emergency response equipment is regularly inspected and serviced.  In addition, the plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\n7. Planned Changes to Improve Safety\n\nSeveral developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  On an ongoing basis, elements of our accidenta"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000041780,
      "SummaryText": "l release prevention program are reviewed with qualified personnel from our corporate process safety function.   \n\n "
    }
  ]
}