{
  "FacilityID": 1000104510,
  "FacilityName": "Benedum Gas Plant",
  "FacilityStr1": "8900 FM 1555",
  "FacilityStr2": null,
  "FacilityCity": "Rankin",
  "FacilityState": "TX",
  "FacilityZipCode": "79778",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48461",
  "LEPC": "Upton County LEPC",
  "FacilityLatDecDegs": "31.346847",
  "FacilityLongDecDegs": "-101.797834",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Targa Resources Corp.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Targa Pipeline MidContinent WestTex",
  "OperatorStr1": "110 W 7th Street",
  "OperatorStr2": "Suite 2300",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74119",
  "OperatorZipCodeExt": null,
  "FTE": 20,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000131993",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "SOP O-3111",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-03-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-03-08 00:00:00",
  "GraphicsIndicator": "Yes",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-03-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-03-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 31.362088,
  "FRS_Long": -101.77962,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000130220,
      "AltID": "211112",
      "FacilityID": 1000104510,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000163304,
          "ProcessID": 1000130220,
          "ChemicalID": 155,
          "Quantity": 3505854.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000144627,
              "ProcessChemicalID": 1000163304,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000144628,
              "ProcessChemicalID": 1000163304,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000144629,
              "ProcessChemicalID": 1000163304,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000144630,
              "ProcessChemicalID": 1000163304,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000144631,
              "ProcessChemicalID": 1000163304,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000144632,
              "ProcessChemicalID": 1000163304,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000144633,
              "ProcessChemicalID": 1000163304,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000131673,
          "ProcessID": 1000130220,
          "NAICSCode": "21111",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000104510,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Rankin Fire Department",
    "CoordinatingAgencyPhone": "4326932422",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 2,
      "FacilityID": 1000104510,
      "SummaryText": "non-incipient stage, accidental releases.  As a non-responding facility, the RMP emergency response program and emergency response plan requirements (40 CFR 68.95) are not applicable at this facility.  However, the facility does maintain an emergency action plan that serves as guidance for facility employees to notify first responders, secure critical operations before evacuation, evacuate the facility, and account for personnel, among other items.  Facility personnel are trained in procedures and use of equipment appropriate to their role in response to small incipient accidental releases.\n\nMANAGEMENT SYSTEM\nThe Area Manager has overall responsibility for the development, implementation, and integration of the risk management program at this facility.  Specific responsibilities are summarized in the backup documentation associated with this RMP plan.\n\nPLANNED CHANGES TO IMPROVE SAFETY\nThe plant personnel are continually developing new ways to improve the safety of the facility.  This is done through responsibility matrices and training which is a vital part of any safety program.  Training is conducted according to a systematic schedule.  All new and modified equipment is designed with appropriate safety controls and devices."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000104510,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nThe Joyce, Edward and Benedum Complex is committed to protecting the health and safety of company personnel, contractors working in the facility, our neighbors in the surrounding community and the environment.  This commitment is strongly supported by senior management and is demonstrated by the resources invested in accident prevention, such as employee training and in considering safety in the design, installation, operation, and maintenance of our facility. The facility does not anticipate having any type of uncontrolled release.  However if an uncontrolled release does occur, the personnel at the facility will evaluate the situation, take actions within the capabilities of the plant, and notify the necessary outside agencies.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\nThe complex is comprised of three facilities, which receive field natural gas from third-party producers.   The field natural gas is treated to remove impurities and further processed to produce condensate, natural gas liquids and residue gas for sale to customers.  These sales products are flammable mixtures which can contain regulated flammable substances including methane, ethane, propane, butanes and pentanes.  There are no listed toxic substances which exceed their respective threshold quantities stored at this facility.\nOFFSITE CONSEQUENCE ANALYSIS\nSeveral pressure vessels within the facility process were evaluated for the worst case release scenarios.  Results of the worst case release scenario indicate that the process is subject to RMP Program Level 1 requirements.  Details of the release scenarios are included with the backup documentation associated with this RMP plan.\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\nThis facility is regulated by 29 CFR 1910.119 (Process Safety Management of Highly Hazardous Chemicals - PSM), 1910.38 (Employee Emergency Plans), as well as other federal, state and local regulations wh"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000104510,
      "SummaryText": "ich are in place to reduce the potential for the release of Highly Hazardous Chemicals.\n\nThis facility has implemented the PSM elements to facilitate accidental release prevention.  Process safety information, consisting of technical standards, specifications and levels, promotes safe process design and operation.  Process hazard analysis evaluates hazards against safeguards needed to mitigate likelihood of an accidental release. Process changes are managed through the management of change procedure, by considering the impact that a change will have on the rest of the process.  For new or significantly changed processes, a pre-startup safety review is conducted as a final check to enable safe start up.  \n\nThe employee participation program promotes the development of necessary expertise, experiences, judgment, and proactive initiative within the workforce.  A comprehensive training program ensures that employees are knowledgeable about the processes they are responsible to operate and control.  Operating procedures explain correct startup, operation and shutdown procedures for various equipment in the process.  The hot work program is in place to promote safety of jobs involving potential ignition sources.  The mechanical integrity program ensures that equipment is maintained inspected and tested for ongoing safety.  A contractor safety evaluation program is in place to ensure hire of contractors that will not compromise job or facility safety.   \n\nThe facility has a policy of investigating every incident, which may have possibly resulted in a release, in order to prevent a similar accident from recurring.  The facility has established an audit procedure to assure the continued integrity of the prevention program.  \n5 YEAR ACCIDENT HISTORY\nThe JEB Complex has not had any RMP-reportable accidents within the last five years.\n\nEMERGENCY RESPONSE PROGRAM\nThis facility is a non-responding facility and has coordinated with the local fire department for response to large,"
    }
  ]
}