{
  "FacilityID": 1000036499,
  "FacilityName": "Motiva Baltimore Terminal",
  "FacilityStr1": "2400 Petrolia Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Baltimore",
  "FacilityState": "MD",
  "FacilityZipCode": "21226",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24005",
  "LEPC": "Baltimore County",
  "FacilityLatDecDegs": "39.234488",
  "FacilityLongDecDegs": "-76.566871",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "www.motiva.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 23838670,
  "ParentCompanyName": "Motiva Enterprises LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Motiva Enterprises LLC",
  "OperatorStr1": "2400 Petrolia Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Baltimore",
  "OperatorStateFIPS": "MD",
  "OperatorZipCode": "21226",
  "OperatorZipCodeExt": null,
  "FTE": 12,
  "OtherEPAFacilityID": "110008432650",
  "EPAFacilityID": "100000209295",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "2451000728",
  "SafetyInspectionDate": "2013-08-21 00:00:00",
  "SafetyInspectionBy": "Baltimore City Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-12-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-09-26 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-09-26 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-09-26 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.23548,
  "FRS_Long": -76.5648,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000044728,
      "AltID": null,
      "FacilityID": 1000036499,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054104,
          "ProcessID": 1000044728,
          "ChemicalID": 118,
          "Quantity": 250000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000045129,
          "ProcessID": 1000044728,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000038919,
              "Process_NAICS_ID": 1000045129,
              "SafetyReviewDate": "2013-08-27 00:00:00",
              "PHA_Date": "2013-08-27 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-11-30 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": "Terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Fill alarm at 80% with auto. shutoff at 85%, min. Class 1 Div. 1 electric w/in 5 ft. of all transfer (truck offloading) points w/Class 1 Div. 2 from 5-15 ft., Class 1 Div. 2 w/in 15 ft. of remainder",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Thermal activated (>250 degrees F) auto and emergency shut-off system",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Hydrocarbon and oxygen detectors, flow monitoring, temperature, pressure, and liquid level indicators",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2013-08-28 00:00:00",
              "TrainingReviewDate": "2012-08-14 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2013-03-21 00:00:00",
              "EquipmentInspectionDate": "2013-03-26 00:00:00",
              "EquipmentTested": "Butane/Sample Pump, Analyzer Unit, ESDs, Valves, Detection System",
              "ChangeMgmtDate": "2013-01-20 00:00:00",
              "ChangeMgmtReviewDate": "2008-06-30 00:00:00",
              "PreStartupReviewDate": "2012-08-28 00:00:00",
              "ComplianceAuditDate": "2012-10-18 00:00:00",
              "AuditCompletionDate": "2014-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-09-08 00:00:00",
              "HotWorkPermitReviewDate": "2007-11-05 00:00:00",
              "ContractorSafetyReviewDate": "2008-11-13 00:00:00",
              "ContractorSafetyEvalDate": "2008-02-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000046283,
                  "PreventionProgram3ID": 1000038919,
                  "ProcessChemicalID": 1000054104
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000036499,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2013-04-30 00:00:00",
    "ERTrainingDate": "2012-10-08 00:00:00",
    "CoordinatingAgencyName": "Baltimore County LEPC",
    "CoordinatingAgencyPhone": "4108875996",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000036499,
      "SummaryText": "tinely scheduled safety inspections and audits\r\n-Frequent unit surveillance by operators\r\n\r\nGeneral Release Mitigation\r\n\r\n-Automatic and remotely operated shut-offs to limit release quantity\r\n-Strategically located valves to isolate leaks\r\n-Hydrocarbon detectors at key areas to warn of a chemical release\r\n\r\nGeneral Emergency Response\r\n\r\n-Emergency alert system\r\n-Periodic emergency training for employees\r\n-Communication systems with local emergency responders and regulatory agencies\r\n-Emergency drills with plant personnel, regulatory agencies, and community emergency responders to enhance response skills and coordination among agencies\r\n\r\nFurther, the Baltimore Terminal complies with the National Fire Protection Association's (NFPA's) Liquefied Petroleum Gas (LPG) Code (NFPA-58 [2008 at time of construction]) requirements for LP Gas storage. In addition to the presence of appropriate controls to prevent possible releases of butane, if a release does occur, a Facility Response Plan (FRP) is in place for the Facility and response activities are coordinated with the Baltimore City Fire Department and Baltimore City/County Emergency Management Agency.\r\n\r\nC. FIVE YEAR ACCIDENT HISTORY\r\n\r\nThe Baltimore Terminal has an excellent record of accident prevention. The terminal keeps records for all significant accidental chemical releases that occur at our facility. There have been no accidents within the past five (5) years resulting from the chemical release of materials covered under the EPA RMP regulation.\r\n\r\nD. EMERGENCY RESPONSE PROGRAM\r\n\r\nResponse actions are coordinated with the Baltimore City Fire Department. A Facility Response Plan (FRP) is in place to inform employees what to do in case of a release, fire, and to notify emergency responders when there is a need for a response.\r\n\r\nMotiva - Baltimore Terminal complies with the U.S. Environmental Protection Agency's (EPA) Accident Prevention Rules (40 CFR Part 68 Subpart D), the Occupational Safety and Health Administra"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000036499,
      "SummaryText": "tion (OSHA) Process Safety Management (PSM) standard and associated 14 elements (29 CFR Part 1910.119), and all applicable state and local laws and regulations. The butane blending system is designed, constructed, and maintained in accordance with NFPA #58 and the manufacturer's (Sunoco Partners Marketing & Terminals, L.P.), instructions and recommendations.\r\n\r\nIn the event of an emergency involving the Baltimore Terminal butane blending system, it is the policy of the Facility to initially contact the Baltimore City Fire Department and request their assistance. The Facility maintains a trained (annually) incipient fire capability. The Facility's emergency response plans are coordinated with the Baltimore City Fire Department and Baltimore City/County Emergency Management Agency. The Baltimore City Fire Department has participated in the initial PSM/RMP training session for this system.\r\n\r\nWe also maintain a relationship with the Baltimore City Fire Department. Tours and drills with members of local emergency response organizations are held routinely. These tours and drills enable the public emergency responders to become familiar with the hazards, equipment, resources and personnel in the terminal.\r\n\r\nE. PLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nWe are continually striving to make the Motiva - Baltimore Terminal the safest and most reliable workplace possible for our employees, our neighbors and our community.\r\n\r\nIn an effort to improve and promote system safety, Motiva looks for, and seeks employee input, on process safety improvements. The Baltimore City Fire Department is contacted regarding participation in site emergency response drills. Additionally, Motiva will work cooperatively with the community to address any concerns."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036499,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RELEASE POLICIES\r\n\r\nMotiva Enterprises LLC - Baltimore Terminal is a refined petroleum product distributor. The Baltimore Terminal is an onshore, light products, bulk petroleum storage terminal used in the storage and distribution of petroleum products to retail and commercial end-users in the vicinity of Baltimore, MD. The Terminal handles and stores various grades of unleaded gasoline, low-sulfur diesel, No. 2 fuel oil, butane, ethanol, and various other petroleum based additives.\r\n\r\nMotiva Enterprises LLC (Motiva) - Baltimore Terminal in Baltimore, MD is committed to operating and maintaining processes in a safe, reliable and environmentally sound manner. Motiva believes that excellent performance in health, safety, and the environment goes hand in hand with operating reliably, and that outstanding HES performance is of paramount importance.\r\n\r\nThe Baltimore Terminal is designed, operated and maintained in a manner that protects the environment, as well as the health and safety of our employees, contractors and the community. Motiva promotes health, safety, and the environment through programs of awareness, compliance, prevention and protection. These programs include a combination of accidental release prevention and emergency response planning. This document provides a brief overview of the comprehensive risk management activities that Motiva has designed and implemented, including:\r\n\r\nA. A description of the facility and the use of regulated substances\r\nB. An overview of the accidental release prevention programs\r\nC. A five-year accident history for accidental releases of regulated chemicals\r\nD. An overview of the emergency response program\r\nE. An overview of planned changes to improve safety\r\n\r\nA. STATIONARY SOURCE AND REGULATED SUBSTANCES\r\n\r\nThe primary function of the Baltimore Terminal, located in Baltimore, Maryland is to act as a refined petroleum distribution facility. The butane blending process has been clas"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036499,
      "SummaryText": "sified as Program Level 3. No Program 1 or 2 processes containing regulated substances were identified. By virtue of the flammable effects associated with butane, it is necessary to observe certain safety precautions in handling butane to prevent unnecessary human exposure, to reduce the threat to employee health, and to minimize the threat and impact to nearby members of the community. Motiva Enterprises LLC - Baltimore Terminal is strongly committed to employee, public, and environmental safety and health. Safety at the Facility depends upon the manner in which butane is handled as well as the various safety devices incorporated into the design of the process.  Furthermore, comprehensive training is provided to employees, which reinforces the safety policies and procedures of the Baltimore Terminal.\r\n\r\nThe facility has fixed inventories of butane. Butane is received by truck (transports) and stored in one (1) storage vessel. Specifically, liquefied butane is off-loaded by truck for storage under pressure (pressure reliefs set at 250 psi on the storage vessel). The butane is pumped to a blending skid for direct injection into regular and premium unleaded gasoline lines feeding the site gasoline truck-loading rack. Injection quantities are controlled via the blending skid and Bartec-Benke Analyzer. Process safety controls include excess flow valves, low-melting point (<250 degrees fahrenheit) feeds to pneumatic valves (fail closed), 85% fill shutoff on the vessel, emergency shut-off devices on the system and video display terminal, line thermal (pressure) reliefs, and grounding/interlock devices. Access to the Baltimore Terminal is restricted to authorized employees, management personnel and authorized contractors/visitors.\r\n\r\nB. GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION MEASURES\r\n\r\nOur accidental release prevention programs and emergency planning and response programs help us effectively manage the hazards posed by our regulated"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036499,
      "SummaryText": "substances to our employees, the public, and the environment. The covered process is regulated by the EPA RMP regulation 40 CFR Part 68, as well as the OSHA Process Safety Management standard 29 CFR 1910.119. The following accident prevention program elements are in place at the Baltimore Terminal:\r\n\r\n1) Employee Participation\r\n2) Process Safety Information\r\n3) Process Hazard Analysis (PHA) with Risk Assessments\r\n4) Standard Operating Procedures\r\n5) EHS Operator Training\r\n6) Contractors\r\n7) Pre-startup Safety Review\r\n8) Mechanical Integrity with Preventive Maintenance\r\n9) Work Permits\r\n10) Management of Change\r\n11) EHS Accident or Potential Catastrophic Event Investigation\r\n12) Emergency Response\r\n13) Compliance Audits\r\n14) Trade Secrets\r\n\r\nThese fourteen (14) individual elements of our prevention program work together to prevent accidental chemical releases. Our company and our employees are committed to the standards required by these management programs. In addition to the above elements, we also have specific prevention measures that are employed as part of our operating procedures and engineering and administrative controls to help contain/control a release, quickly detect a release, and reduce the consequences of a release. These are briefly summarized as follows:\r\n\r\nGeneral Risk Reduction and Safety Measures\r\n\r\n-Engineered and constructed in accordance with recognized industry and company standards\r\n-Equipment properly designed with protection from overpressure (pressure safety relief valves, etc.)\r\n-Updated technical drawings, Piping & Instrument Diagrams and Process Flow Diagrams\r\n-Operating systems monitored and controlled by trained Operators\r\n-Computerized monitoring and control of process operation\r\n-Redundant control systems \r\n-Automatic and manual shutdown devices for critical systems\r\n-Scheduled inspection and testing of instruments, analyzers, and safety devices\r\n-Limited facility access\r\n-Regular safety meetings and safety awareness programs\r\n-Rou"
    }
  ]
}