{
  "FacilityID": 1000091485,
  "FacilityName": "Multi Chem Group , LLC - Denver City",
  "FacilityStr1": "1656 CR 390",
  "FacilityStr2": null,
  "FacilityCity": "Denver City",
  "FacilityState": "TX",
  "FacilityZipCode": "79323",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48501",
  "LEPC": "Yoakum County LEPC",
  "FacilityLatDecDegs": "32.963964",
  "FacilityLongDecDegs": "-102.788878",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 964798508,
  "ParentCompanyName": "Halliburton",
  "Company2Name": null,
  "CompanyDUNS": 43296920,
  "Company2DUNS": 0,
  "OperatorName": "Multi-Chem Group, LLC",
  "OperatorStr1": "3000 N Sam Houston Parkway E",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77032",
  "OperatorZipCodeExt": null,
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000208429",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-09-22 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-12-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-12-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-12-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-12-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000113671,
      "AltID": "Acrolein Transfer Ops",
      "FacilityID": 1000091485,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000141993,
          "ProcessID": 1000113671,
          "ChemicalID": 22,
          "Quantity": 278623.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000115044,
          "ProcessID": 1000113671,
          "NAICSCode": "42469",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000097099,
              "Process_NAICS_ID": 1000115044,
              "SafetyReviewDate": "2020-12-17 00:00:00",
              "PHA_Date": "2017-05-12 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-03-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 1,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 1,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-11-16 00:00:00",
              "TrainingReviewDate": "2020-10-14 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": "Computer based training",
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-12-17 00:00:00",
              "EquipmentInspectionDate": "2020-12-16 00:00:00",
              "EquipmentTested": "Deluge system",
              "ChangeMgmtDate": "2017-04-06 00:00:00",
              "ChangeMgmtReviewDate": "2020-02-20 00:00:00",
              "PreStartupReviewDate": "2018-12-19 00:00:00",
              "ComplianceAuditDate": "2020-12-17 00:00:00",
              "AuditCompletionDate": "2021-03-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2020-09-15 00:00:00",
              "HotWorkPermitReviewDate": "2020-11-19 00:00:00",
              "ContractorSafetyReviewDate": "2020-12-17 00:00:00",
              "ContractorSafetyEvalDate": "2020-12-17 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000121078,
                  "PreventionProgram3ID": 1000097099,
                  "ProcessChemicalID": 1000141993
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000091485,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2020-07-24 00:00:00",
    "ERTrainingDate": "2020-09-22 00:00:00",
    "CoordinatingAgencyName": "Denver City Fire Dept.",
    "CoordinatingAgencyPhone": "8065923516",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000091485,
      "SummaryText": "MULTI-CHEM, LLC - DENVER CITY, TX: EXECUTIVE SUMMARY\n\n\n\n1    Introduction and Policies\n\nMulti-Chem Group, LLC (Multi-Chem), a subsidiary of Halliburton Energy Services, Inc., is committed to being a responsible member of the community in which it operates in a safe and environmentally sound manner.   Multi-Chem personnel identify hazards and manage risks to the community and environment through continuous improvement approaches such as improvements to technology and procedures.  This commitment to safe and environmentally sound operations is one of Multi-Chem's core values as documented in policy and compliance manuals, and in its mission statement, which are available to all employees. \n\n\n\n2    Stationary Source and Regulated Substances\n\nAcrolein, also known as 2-propenal, is an aldehyde.  It is present between 92-96% pure in the product received in the acrolein tanks.  It is inhibited by hydroquinone (0.35%) and covered with a nitrogen blanket to prevent hazardous polymerization.  Acrolein is acutely toxic, as well as an inhalation and fire hazard.  Some of the typical physical and chemical properties are listed below:\n\n     ? CAS #107-02-8\n\n     ? Clear, colorless liquid\n\n     ? Acid and pungent odor, extremely irritating\n\n     ? pH 7 \n\n     ? Flashpoint of 13?F (TCC)\n\n     ? Heavier than air \n\n     ? Can produce exothermic hazardous polymerization reaction\n\n     ? Can be neutralized with soda ash or sodium bisulfite (increasing the pH results in decreased half-life)\n\n     ? OSHA permissible exposure limit (PEL), 0.1 ppm\n\n     ? OSHA short term exposure limit (STEL), 0.3 ppm\n\n\n\n3    Offsite Consequence Analysis Reporting\n\nThe EPA RMP rule requires that Multi-Chem provides information to the EPA and emergency responders about the worst-case and the alternative release scenarios for the RMP regulated chemicals at the Multi-Chem Denver City facility.  Note that the RMP definition of a potential worst-case scenario results in a scenario that is not generally considered credib"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000091485,
      "SummaryText": "le.  The alternative release scenarios represent more credible events; however, they are not as likely to occur with the risk reduction measures implemented by Multi-Chem.  The Multi-Chem RMP includes both worst-case and alternative release scenarios for the toxic chemical present above the threshold quantity on the site.\n\n\n\n4    Accidental Release Prevention and Emergency Response Policies\n\nMulti-Chem has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.\n\n\n\nProcess Information\n\nAcrolein is trucked onto the site in ISO tanks - each ISO tank contains 4,970 gallons (34,783 lbs) of acrolein.  The ISO tanks are detached from motive transport prior to transfer into pressurized skids called \"field containers\".  Each field container can contain a maximum of 399 gallons (2,797 lbs) of inhibited acrolein.  Inhibited acrolein indicates that hydroquinone is added to slow oxygen catalyzed polymerization.  The head space at the top of the field container is also filled with pure nitrogen.  The maximum intended inventory of acrolein at the Multi-Chem facility is 278,623 lbs (twenty-five 2,797 lb acrolein field containers plus six 34,783 lb ISO tanks).  There are no acrolein chemical processes involved at the Multi-Chem facility. \n\n\n\nProcess Safety Information\n\nMulti-Chem has a program in place to ensure that information is available regarding the hazards of the regulated chemicals, the processes that handle these chemicals, and the equipment in the process.  This information is used to identify and understand hazards associated with these chemicals and processes.\n\n\n\nProcess Hazard Analysis\n\nThe HAZOP methodology is used by Multi-Chem personnel to systematically identify, analyze, and correct potential hazards associated with the storage, handling, and movement of acrolein at the facility.  After completion of the initial process hazard analysis, the HAZOP has been reviewed and finalized.  The process hazard anal"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000091485,
      "SummaryText": "ysis worksheets were used to document the findings, recommendations, corrective actions, and completion dates.  These worksheets were also used to document that the affected employees have been informed of the recommendations or actions.  The Manufacturing Manager and Denver City Facility Manager are responsible for ensuring that HAZOP recommendations are resolved in a timely manner and that the resolution is documented.  The Denver City Facility Manager ensures that the affected employees are informed of any changes.  The HAZOP study is revalidated every five (5) years to ensure that the process hazard analysis is consistent with the current process and handling procedures.  \n\n\n\nOperating Procedures\n\nMulti-Chem maintains written operating procedures for the purposes of safely conducting operational tasks within the covered processes.  These procedures address various modes of operation such as filling, storage, and emergency operations.  The information is regularly reviewed and readily accessible to operators involved in the processes. \n\n\n\nTraining\n\nEach employee presently involved in operating the process and new employees, are trained in an overview of the process and in the operating procedures for acrolein prior to handling acrolein.  The training includes emphasis on the health and safety hazards, and emergency operations including shutdown and safe work practices.  Forklift training and certification is conducted as required by OSHA requirements.  Hazard awareness and container storage and handling training is given to Material Handlers who may have occasion to on or off-load the containers.  Awareness training is given to all employees to provide information on the hazards of the product, to identify the containers, and to avoid potential exposure to the material. \n\n\n\nRefresher training is provided at least every three years or more often if necessary.  The training assures that the employee understands and adheres to the current operating procedures.  The "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000091485,
      "SummaryText": "Facility Manager or designated supervisor discusses and determines with each employees the frequency of the refresher training.  Forklift drivers receive refresher training and recertification every three years as required by OSHA. \n\n\n\nMechanical Integrity\n\nIn accordance with 29 CFR 1910.119, a maintenance equipment program involving documented inspections and testing of equipment has been implemented.  The following equipment is included in the maintenance program: \n\n     ? Acrolein tanks (including all valves attached to tank)\n\n     ? Forklifts \n\n     ? Safety system testing\n\n\n\nStringent Federal Department of Transportation (DOT) design, inspection and testing specifications govern the fabrication, charging, and transportation of acrolein containers.  Upon request by regulatory agencies, documentation will be provided by Multi-Chem personnel on the various tests and inspections performed on these containers.  The DOT tests and inspections performed by an independent inspection agency include the following:\n\n \n\n     ? Verify chemical analysis of material(s) of construction\n\n     ? Inspect welds and fabrication\n\n     ? Verify container markings\n\n     ? Internal condition of container\n\n     ? Verify threads meet specifications\n\n     ? Verify heat treatment of materials \n\n     ? Witness pressure tests\n\n     ? Verify wall thickness requirements\n\n     ? Verify column and weight of container\n\n     ? Pressure test each container and certify every five years\n\n     ? Safety relief valve testing\n\n     ? Furnish complete tests results to purchase upon request \n\n\n\nUpon receipt of acrolein containers Multi-Chem personnel conduct visual checks for bulging, corrosion, or significant cuts or gouges.  Also checked are the container shut-off and safety valves for visual defects.  Containers showing significant defects will be rejected and returned to the supplier, and the serial number documented.  In addition, Multi-Chem personnel check the container to ensure that the weight is in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000091485,
      "SummaryText": "dicated.\n\n\n\nUpon handling acrolein containers Multi-Chem personnel visually check containers for defects and document abnormalities of a given container taking down the serial number of the container and describing the abnormality.  Any abnormalities will be immediately reported and acted upon. \n\n\n\nManagement of Change\n\nPrior to any change or modification in technology, equipment, standard operating procedures, or the facility, the Facility Manager or other competent technical personnel reviews the change.  Where appropriate, other departments may be called upon to review the change.  This would not include replacements-in-kind.\n\n\n\nThe review considers the following:\n\n     ? Technical basis for the proposed change\n\n     ? Impact of change on safety and health\n\n     ? Modifications to operating procedures\n\n     ? Necessary time period for the change, and\n\n     ? Authorization requirements for the proposed change\n\n\n\nEmployees involved in handling acrolein are informed and trained in the change prior to startup.  Process safety information and operating procedures are updated accordingly, as needed. \n\n\n\nPre-Startup Safety Review\n\nA pre-startup safety review (PSSR) is conducted when any modification is significant enough to require change in the process safety information.  The review is conducted by appropriate personnel and other support groups when appropriate. \n\n\n\nThe PSSR consists of at least the following: equipment specifications; safety, operating, maintenance, and emergency procedures are adequate; and a process hazard analysis has been performed for the new or modified system as a whole.  The employees are trained on the new or modified system.\n\n\n\nCompliance Audits\n\nAn audit is conducted on the process safety management program for acrolein by Multi-Chem at least once every three years to verify that the procedures and practices developed under the program standard are adequate and are being followed.  The audit team includes personnel from Regional HSE Manage"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000091485,
      "SummaryText": "r and Facility Manager, and others as deemed appropriate by both parties. \n\nA report is developed with findings, recommendations, and a corrective action plan.  The EHS/DOT Director is responsible for developing and implementing the corrective action.  The last two audit reports are retained by the Facility Manager, Regional HSE Manager, and Multi-Chem Risk Manager. \n\n\n\nIncident Investigation\n\nEach incident, which results in, or could reasonably have resulted in a catastrophic release of acrolein, is investigated promptly - no longer than 24 hours following the incident.  The Regional HSE Manager establishes the incident investigation team consisting of at least one person knowledgeable in the acrolein process, including a contract employee if the incident involved work of the contractor, and other persons with appropriate knowledge and experience to thoroughly investigate and analyze the incident. \n\n\n\nA report is prepared by the Facility Manager at the conclusion of the investigation and will include at a minimum the following:\n\n     ? Date of the incident\n\n     ? Date investigation began\n\n     ? Description of the incident\n\n     ? Factors that contributed to the incident, and\n\n     ? Any recommendations resulting from the investigation\n\n\n\nThe report also establishes a corrective action plant, completion dates and documentation of the corrective actions.  All affected employees review the report.  The incident report is maintained in files for at least five years.\n\n\n\nHot Work Permit\n\nMulti-Chem has a written procedure and permit for hot work operations conducted on or near a covered process.  The procedure and permit are intended to ensure that the hot work is adequately reviewed prior to starting the operation and is monitored throughout.\n\n\n\nContractors\n\nContractors or visitors working on the acrolein storage area or adjacent to it are informed of the potential safety and health hazards associated with the process.  The contractors are also informed of the emergen"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000091485,
      "SummaryText": "cy action plan and its contents.  The contractor's entrance and exit from the facility is controlled.  The contractor is responsible for complying with the requirements of the OSHA regulation, 29 CFR 1910.119.\n\n\n\nEmployee Participation\n\nMulti-Chem encourages all employees to actively participate in the development and use of Multi-Chem accidental release prevention programs.\n\n\n\n5    Prevention Program\n\nMulti-Chem has implemented the following prevention program release mitigation steps:\n\n     ? Dikes around chemical storage tanks;\n\n     ? Foam/Water sprinkler systems throughout the production buildings;\n\n     ? Sprinkler systems;\n\n     ? Deluge systems;\n\n     ? Neutralization;\n\n     ? Emergency communication and alarm system; and\n\n     ? Perimeter monitors\n\n\n\nIn addition, the following chemical-specific steps have been implemented:\n\n     ? Control emissions from production operations that handle acrolein.\n\n\n\nThese individual elements of the Multi-Chem prevention program work together to help prevent accidental chemical releases.\n\n\n\n6    Five-Year Accident History\n\nMulti-Chem has no history of accidents in the past five years. \n\n\n\n7    Emergency Response Program\n\nMulti-Chem maintains a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public.  To ensure proper functioning, all emergency response equipment are regularly inspected and serviced.  In addition, the plan is updated to reflect any pertinent changes taking place with Multi-Chem's processes that would require a modified emergency response. \n\n\n\n8    Planned Changes to Improve Safety\n\nMulti-Chem reviews and updates procedures and plans, as required, with a maximum interval of three years.  Multi-Chem trains all personnel in the use of safety procedures and qualified and experienced personnel are used for reviewi"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000091485,
      "SummaryText": "ng all changes to procedures. \n\n"
    }
  ]
}