{
  "FacilityID": 1000093888,
  "FacilityName": "Durez Corporation - Kenton Facility",
  "FacilityStr1": "13717 US Highway Route 68 S.",
  "FacilityStr2": null,
  "FacilityCity": "Kenton",
  "FacilityState": "OH",
  "FacilityZipCode": "43326",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39065",
  "LEPC": "Hardin County LEPC",
  "FacilityLatDecDegs": "40.621111",
  "FacilityLongDecDegs": "-083.619722",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "CO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.sbna-inc.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 21239616,
  "ParentCompanyName": "Durez Corporation",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Durez Corporation",
  "OperatorStr1": "46820 Magellan Drive",
  "OperatorStr2": "Suite C",
  "OperatorCity": "Novi",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "48377",
  "OperatorZipCodeExt": "5454",
  "FTE": 60,
  "OtherEPAFacilityID": "43326CCDNT1371",
  "EPAFacilityID": "100000102505",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-01-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-05-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-05-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-05-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-05-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.60636,
  "FRS_Long": -83.63151,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "200",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116491,
      "AltID": "Resin Manufacturing",
      "FacilityID": 1000093888,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145653,
          "ProcessID": 1000116491,
          "ChemicalID": 1,
          "Quantity": 188600.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000117906,
          "ProcessID": 1000116491,
          "NAICSCode": "325211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000099656,
              "Process_NAICS_ID": 1000117906,
              "SafetyReviewDate": "2020-08-06 00:00:00",
              "PHA_Date": "2020-08-06 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2020-08-18 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 1,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-04-29 00:00:00",
              "TrainingReviewDate": "2020-08-24 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-12-11 00:00:00",
              "EquipmentInspectionDate": "2021-03-04 00:00:00",
              "EquipmentTested": "Formalin Unload Pump",
              "ChangeMgmtDate": "2020-08-11 00:00:00",
              "ChangeMgmtReviewDate": "2019-06-27 00:00:00",
              "PreStartupReviewDate": "2020-10-21 00:00:00",
              "ComplianceAuditDate": "2020-09-03 00:00:00",
              "AuditCompletionDate": "2021-01-29 00:00:00",
              "IncidentInvestigationDate": "2018-11-26 00:00:00",
              "InvestigationChangeDate": "2018-12-21 00:00:00",
              "ParticipationPlansReviewDate": "2020-01-10 00:00:00",
              "HotWorkPermitReviewDate": "2020-01-06 00:00:00",
              "ContractorSafetyReviewDate": "2020-01-16 00:00:00",
              "ContractorSafetyEvalDate": "2021-02-02 00:00:00",
              "CBI_Flag": 0,
              "Description": "We define the process as those sections of the plant that handle formaldehyde solution to produce resin in reactors, associated piping and storage tanks.  The PHA information and prevention information herein applies to these defined plant areas.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000124934,
                  "PreventionProgram3ID": 1000099656,
                  "ProcessChemicalID": 1000145653
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000093888,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2021-01-15 00:00:00",
    "ERTrainingDate": "2020-01-31 00:00:00",
    "CoordinatingAgencyName": "Hardin County LEPC",
    "CoordinatingAgencyPhone": "4196742276",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093888,
      "SummaryText": "Executive Summary\n\n\n\n     \n\n\n\nDurez Corporation, a wholly owned subsidiary of Sumitomo Bakelite-Durez, owns and operates a synthetic resin manufacturing facility in Kenton, Ohio.  This facility is known as the Kenton Plant and is located on US Highway Route 68 South.  The facility consists of one unit that manufactures phenolic resins.  The facility also conducts warehousing and shipping operations to support manufacturing.  The facility was originally constructed in 1954 and employs approximately 60 full-time employees.\n\n\n\n1.    Accidental Release Prevention and Emergency Response Policies at the Stationary Source ( 68.155(a)):\n\n\n\nDurez is committed to operating the Kenton facility in a manner that is safe for its workers, the public, and the environment.  It is our policy to adhere to all applicable Federal, State and local rules and regulations, industry standards and best management practices.  As part of this commitment Durez has established a system to help ensure safe operation of the processes at this facility, which includes the prevention of accidental releases of hazardous substances.  One component of this system is a risk management program (RMP) that helps manage the risks at the Kenton facility and complies with the requirements of the Environmental Protection AgencyA?s (EPAA?s) regulation 40CFRpart 68, Accidental Release Prevention Requirement Risk Management Programs (the RMP rule).  This document is intended to satisfy the RMP Plan requirement of the RMP rule.  This also provides the public with a description of the risk management program at the Kenton facility.  \n\n\n\nThe RMP at the Kenton facility consists of the following three elements:\n\n\n\nA?    A hazard assessment program to help understand: (a) the potential off-site consequences of hypothetical accidental releases and (b) accidents that have occurred during the last five years associated with the use of substances regulated by the RMP rule (regulated substances). The hazard assessment program includes"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093888,
      "SummaryText": " Process Hazard Reviews (PHRs), PreStart-up Safety Reviews (PSSRs) and Management of Change (MOCs).\n\nA?    A prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes). The prevention programs includes our Mechanical Integrity (MI), hot works, operating procedures, incident investigation and training (including contractors).\n\nA?    An emergency response program to help respond to accidental releases of substances including material from the covered processes.\n\n\n\nInformation further describing these elements is provided in this RMP Plan.\n\n\n\nAlthough the Risk Management Program at the Kenton facility helps provide assurance that the facility is maintained and operated in an environmentally sound and safe manner, it is only one component of the environmental program at the Kenton facility.  In fact, the Kenton facility has a comprehensive environmental program in place, establishing many levels of safeguards against release of a hazardous substance, as well as injuries and damage from such a release.\n\n\n\nDurez limits the use of hazardous substances. Before using a hazardous substance at the Kenton facility, less hazardous alternatives are always considered.  When a hazardous substance is used at the Kenton facility, Durez reviews the potential for an accidental release of this substance which could adversely affect plant workers, the public and the environment.  Steps are taken to prevent any such effects through the facilityA?s Chemical Pre-approval, MOC and PHR procedures, which are followed for all new process or modifications of existing processes.\n\n \n\n\n\nDurez strives to prevent accidental releases of the hazardous substances used at the facility.  Durez implements reasonable controls to prevent foreseeable releases of hazardous substances.  When a hazardous substance is used at the Kenton facility, the equipment is carefully designed, installed, operated and maintained to red"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093888,
      "SummaryText": "uce the likelihood of an accidental release.  Industry and government standards are closely followed in the design, construction and operation of the equipment.  Each project is thoroughly reviewed in an MOC or PSSR (for all changes or new systems) before approval. These reviews include HES, engineering, operations, maintenance and management personnel.  In addition, Durez requires the documentation of standard operating procedures and training of affected employees (including call-ins) with regard to these procedures as part of the MOC procedure. The Mechanical Integrity program provides an ongoing process to verify the mechanical integrity of the equipment piping, and instruments to prevent the release of hazardous substances.\n\n\n\nDurez goal is to minimize impacts from an accidental release.  In the event of an accidental release, the Kenton facility controls and contains the release in a manner that will be safe for workers and will prevent impact to the public and the environment. Durez utilizes emergency response plans as required by government regulation. Durez trains its workers to respond to an accidental release, reducing the consequences of a release if it occurs.  The facility also maintains an active Emergency Response Team which is on call 24 hours a day to respond to an accidental release.  In addition, Durez works with the Kenton City Fire Dept., 911, BKP Ambulance Service, Kenton City Police Dept., and the Local Emergency Planning Commission (LEPC) to help prevent injuries and/or environmental damage if a release does occur.  Durez assisted in helping the LEPC write and implement the Hardin County Emergency Response Plan. \n\n\n\nThe Kenton FacilityA?s Emergency Response Plan has been developed to meet the emergency planning, response and notification requirements of all applicable regulations and Durez policies.  This plan outlines the responsibilities and actions required to control an emergency. If the emergency extends beyond the facility boundaries a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000093888,
      "SummaryText": "nd affects the surrounding community, the Hardin County Emergency Response Plan is initiated by a call to 911 and a statement of the type of emergency.\n\n\n\nDurez is an active participant in the community. Durez is an active participant in plant and community programs which promote education, safety and environmental awareness.  We support or have supported over the years activities of Keep Hardin County Beautiful, Household Hazardous Waste Collection, Arbor Day, Wildlife Federation and Earth Day.  This is conducted by employees volunteering, cash donations and presentation to the community. \n\n\n\nAlthough the Risk Management Program at the Kenton facility helps provide assurance that the facility is maintained and operated in a safe manner, it is only one component of the environmental and safety programs. In fact the Kenton facility has a comprehensive environmental and safety program in place establishing many levels of safeguards against release of a hazardous substance.  In order to implement these policies effectively, Durez established a management system headed by the Health, Environmental and Safety (HES) Department to oversee safety and environmental-related activities.  This RMP Plan is primarily intended to describe those parts of the environmental and safety programs at the Kenton facility that are required by the RMP rule. The Kenton Plant is OHSAS 18001 registered.\n\n\n\n\n\n2.    The Stationary Source and Regulated Substance Handled ( 68.155(b))\n\n\n\nThe Kenton facility handles one regulated substance that are covered by the RMP rule, as shown in the following list of RMP-covered Program Level 3 processes at the plant.\n\n\n\nRegulated Substances: \n\n\n\nFormalin (50% aqueous solution), Process: Storage Tanks Quantity, lb.:188,600 solution\n\nRMP Threshold, lb.*: 10,000.\n\n\n\n*Threshold quantity is the quantity of A?pureA? chemical, not the solution\n\n\n\nFormalin is one of the major raw materials used at this facility.  It is a solution of formaldehyde dissolved in water.  No "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000093888,
      "SummaryText": "pressurized formaldehyde gas or liquefied formaldehyde is used on site. Formalin is stored in a 100,000 gallon aboveground storage tank with a re-circulating distribution system to four reactors in one operating unit. The finished material from the reactors only contain residual concentrations of formaldehyde, therefore, the storage tank, the re-circulation loop and the reactors are the only RMP covered processes on-site.  The facility complies with the Department of Transportation (DOT) regulations in the loading, unloading, and shipment of materials.\n\n\n\n\n\n\n\n2.1 Program 3 Processes-Flammable Substances\n\n\n\nThere are no regulated flammable substances in quantities above the threshold quantities at the plant.  Propane is stored on-site in 30 lb cylinders; however, the total quantity is less than the threshold quantity of 10,000 pounds.\n\n\n\n3.    The General Accidental Release Prevention Program and the Chemical Specific - Prevention Steps (68.155(d)):\n\n\n\nSince 1994, the Kenton facility has used a prevention program to help prevent accidental releases of hazardous substances.  Beginning in 1994, the facility revised this prevention program to comply with the 14 elements of the OSHA Process Safety Management (PSM) prevention program.  In 1996, the EPA RMP rule established two levels of prevention requirements.  Of these, the Kenton facility falls under A?Program Level 3A?.\n\n\n\nProgram 3 is essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the environment outside the plantA?s fence line;\n\n\n\nThe following sections briefly describe the elements of the Kenton facilityA?s Program 3 prevention program that address EPSA?s RMP rule prevention program requirements.\n\n\n\n3.1    Program 3  Prevention Program\n\n\n\nThe Kenton facilityA?s Program Level 3 prevention program consists of the following 14 elements:\n\n\n\n3.1.1    Process Safety Information\n\n\n\nThe Kenton facility maintains technical documents which are used to help ensure safe operation of "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000093888,
      "SummaryText": "the facility.  These documents address: (1) physical properties of hazardous substances handled at the plant, (2) operating parameters of the equipment used at the plant and (3) design basis and configuration of the equipment at the plant.  Durez ensures that this process safety information is available to all employees.\n\n\n\nSafety Data Sheets (SDSs) document the physical properties of the hazardous materials handled at the plant, including regulated substances in covered processes.  The information available for each hazardous substance typically includes: \n\nA?    Toxicity information and permissible exposure limits\n\nA?    Physical data (e.g. boiling point, melting point, flash point)\n\nA?    Reactivity and corrosivity data\n\nA?    Thermal and chemical stability data\n\nA?    Hazards of mixing substances in the process\n\n\n\nSDSs for hazardous substances handled in each process are available electronically from the plants server with hard copy back-up in the HES Department. Effective June 1, 2015, safety data sheets of for all shipped products must be OSHA's revised HAZCOM rule.\n\n\n\nThe engineering design documents include the operating parameters, the design basis and the configuration of the equipment in each covered process. The available information includes:\n\nA?    Operating parameters\n\nA?    Process flow diagrams\n\nA?    Process chemistry\n\nA?    Maximum intended inventories\n\nA?    Safe upper and lower limits for parameters such as temperature, pressure, or flow\n\nA?    Design basis and configuration of equipment\n\nA?    Piping and instrumentation diagrams, including materials of construction\n\nA?    Electrical classification\n\nA?    Safety System\n\nA?    Applicable design codes and standards\n\nA?    Design basis for relief and ventilation systems\n\n\n\nOperating manuals contain the process objectives, process chemistry, overview of the process operations, critical process variables with consequences of deviations, equipment and instrument descriptions, troubleshooting guidelines, start up and shut down procedures.\n\n\n\nThese d"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000093888,
      "SummaryText": "ocuments are used to: (1) train employees, (2) perform process hazards analysis. (3) operate the processes and (4) help maintain equipment.\n\n\n\n3.1.2    Process Hazard Review\n\n\n\nThe Kenton facility performs and upgrades process hazard reviews (PHRs) once every five years for each covered process.  And, conducted new process hazard analysis for the facility in May 2006 and a re-validation May 2011. This helps identify process hazards, corrective actions to improve the safe operation of the process.  A team composed of personnel with safety, environmental, engineering, process operation and maintenance experience and a leader with process hazard review experience is assembled to analysis the hazards of the process.  The plant primarily uses the A?HAZOPA? technique to perform this analysis.  \n\n\n\nThe PHR team prepares a written report describing the results of the analysis, including a list of recommendations which are all closed or of low priority that requires no action..  Responsibility to resolve the recommendations is assigned to unit personnel and, when appropriate, changes to enhance the safety of the process are implemented.\n\n\n\n3.1.3    Operating Procedures\n\n\n\nKenton facility process engineers, operators and supervisors work together to develop and maintain operating procedures to define how tasks related to process operations should be safely performed.  The operating procedures: (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and process upsets.  Operating procedures include:\n\n\n\nA?    Steps for safely conducting activities\n\nA?    Applicable process safety information, such as safe operating limits and consequences of process deviations\n\nA?    Safety and health considerations, such as chemical hazards, personal protective equipment requirements and actions to take if exposure to a hazardous substance occurs.\n\n\n\nPlant personnel develop and maintain operating procedures that cover all phases of opera"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000093888,
      "SummaryText": "tions, including initial startup, normal operations, normal shutdown, emergency shutdown, startup following a turnaround or emergency shutdown and temporary operations.  The operating procedures are used both to help in operating the plantA?s processes and as a training guide. \n\n\n\n3.1.4    Training\n\n\n\nThe Kenton facility trains its workers to safely and effectively perform their assigned tasks.  The training program includes both initial and refresher training that covers: (1) a general overview of the process, (2) the properties and hazards of the substances in the process and (3) a detailed review of the process operating procedures and safe work practices.  Oral reviews and written tests are used to verify that an employee understands the training material before the employee can work in the process.  The operators are consulted regularly to evaluate the effectiveness and frequency of the training.  Recommendations from operators are reviewed and changes to the training program are implemented as appropriate.\n\n\n\n3.1.5    Mechanical Integrity\n\n\n\nThe Kenton facility maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public or the environment.  The major aspects of the mechanical integrity program include: (1) an inspection and testing program for critical equipment to help identify deterioration and repair items before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meets the design standards required for service in the plantA?s processes. \n\n\n\nThe details of the mechanical integrity program include:\n\nA?    Specifications for inspection and testing of process equipment\n\nA?    Specifications for replacement parts and equipment\n\nA?    Procedures for inspecting, testing and maintaining process equipment\n\nA?    Procedures for safe work practices such as Lock, Tag and Try, Hot Work, Confined Space Entry, and Line Breaking\n\nA?    Training of maintenance personnel\n"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000093888,
      "SummaryText": "\nA?    Documentation of maintenance activities\n\n\n\n3.1.6    Management of Change\n\n\n\nThe Kenton facilityA?s management of change program evaluates and approves all proposed changes to chemicals, equipment and procedures for a covered process to help ensure that the change does not negatively affect safe operations.  Process changes that are determined to be a replacement in kind (e.g. replacing a valve with an identical valve) are allowed without completing a full management of change program.  All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n\n\n\n3.1.7    Pre-startup Review\n\n\n\nThe Kenton facility performs a pre-start-up safety review (PSSR) of a new process before the process is placed into service to help ensure that the process has been prepared to operate safely.  \n\n\n\nThis review confirms that:\n\nA?    Construction and equipment are in accordance with design specifications\n\nA?    Adequate environmental, safety, operating, maintenance and emergency procedures are in place.\n\nA?    Employee training has been completed.\n\nA?    For a covered process, a PHR has been performed if the process is new or management of change requirements have been completed if an existing process has been modified.\n\n\n\nA PSSR checklist is completed for new processes to ensure that appropriate issues have been addressed.\n\n\n\n3.1.8    Compliance Audit\n\n\n\nQualified third party consultants perform audits of the facility programs, process and documentation at regular intervals.  The facility is required to address all action items within 6 months of notification.\n\n\n\n3.1.9    Incident Investigation\n\n\n\nThe Kenton facility investigates incidents, including near miss type incidents that could reasonably have resulted in an injury to personnel, the public, the en"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000093888,
      "SummaryText": "vironment or property so that similar incidents can be prevented in the future.  The plant trains employees to identify and report any incident. An investigation team is assembled and the investigation is initiated within 24 hours of the incident. The results of the investigation are documented in the Durez Incident reporting System (DIRA?s), recommendations are resolved and appropriate process enhancements are implemented.\n\n\n\nDurez has a formal program, including training for incident investigations and report generation.\n\n\n\n3.1.10    Employee Participation\n\n\n\nEmployees from production and maintenance participate in technical analysis and PHRA?a for all covered processes to help ensure that the environmental and safety concerns of the plantA?s workers are addressed.  The plant encourages active participation of personnel in the prevention program activities of all processes at the plant. Employees are consulted on, and informed about, all aspects of the RMP rule prevention program, including PHRs, MOCs, PSSRs and operating procedures.\n\n\n\n3.1.11    Hot Work Permits\n\n\n\nThe Kenton facility established a hot work permit program to control spark or flame-producing activities that could result in fires or explosions in covered processes at the plant.  The plant reviewed OSHAA?s fire prevention and protection requirements in 29 CFR1910.252(a) and created a Hot Work Permit Form.  The Shift Supervisor reviews the completed form before work can begin. Training in the use of the Hot Work Permit Form is included in the plants safe work practices orientation and contractor orientation.\n\n\n\n3.1.12    Contractors\n\n\n\nThe Kenton facility established a program to help ensure that contractor activities at the plant are performed in an environmentally sound and safe manner.  The program reviews the safety record of all contractors to help ensure that the plant only hires contractors who can safely perform the desired job tasks.  The plant explains to the contract supervisors the hazards of the "
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000093888,
      "SummaryText": "process on which they and their employees will work, the plants safe work practices, and the plants emergency response procedures.  The plant requires that the contractor supervisor trains each of their employees who will work at the plant before that worker begins work at the plant site.  The plant periodically reviews contractors training documents.\n\n\n\n3.2    Chemical-specific Prevention Steps\n\n\n\nIn addition to the required prevention program elements, the Kenton facility has implemented safety features specific to the hazardous substances used at the site.\n\n\n\nIndustry standards are followed for formalin and hydrochloric acid to help ensure responsible material use and handling. Formalin and hydrochloric acid are supplied in DOT approved tank trucks.  DOT standards are followed when unloading both chemicals into its storage tank. The storage tanks are designed in accordance with ANSI standards.  Workers who perform operations involving formalin and hydrochloric acid receive training emphasizing safe handling procedures, which are specific to the site. Concrete dikes large enough to contain all of the tanks contents and storm water surrounds the formalin and hydrochloric acid storage tanks.\n\n\n\n4    Five Year Accident History (68.155(e)):\n\n\n\nThere have been no releases in the past five years that had an off-site impact.\n\n\n\n5    The emergency response program (68.155(f)):\n\n\n\nThe Kenton facility has established a written emergency response plan and maintains an emergency response team trained in these emergency response procedures. All plant personnel are trained in evacuation procedures.  \n\n\n\nThe written emergency response plan complies with the following federal regulations (and parallel state regulations):\n\nA?    OSHA 29 CFR 1910.38(a)- Employee Emergency Action Plans\n\nA?    OSHA 29 CFR 1910.119(n) A?Process Safety Management of Highly Hazardous Chemicals\n\nA?    OSHA 29 CFR 1910.120(p) and (q)- Hazardous Waste Operations and Emergency Response (HAZWOPER)\n\nA?    OSHA 29 CFR 1910.Subpart"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000093888,
      "SummaryText": " L- Fire Protection\n\nA?    EPA 40 CFR 68 A?Risk Management Programs for Chemical Accidental Release Prevention\n\nA?    EPA 40 CFR 112 A? Spill Prevention, Control and Countermeasures Plan\n\nA?    EPA 40 CFR 265 Subpart D A? Contingency Plan and Emergency Procedures (Referenced by 40 CFR 262)\n\nA?    EPA 40 CFR 302.6 A? Notification Requirements\n\nA?    EPA 40 CFR 355.30 A? Facility Coordinator and Emergency Response Plan\n\nA?    EPA 40 CFR 355.40 A?Emergency Planning and Release Notifications\n\n\n\n        The Kenton facility has an Emergency Response Team (ERT) available 24 hours per day to respond to in-plant              chemical emergencies.  The team maintains an Incident Command Center (for response operations and\n\n              planning) and emergency operations center (for logistical support).  Each center is equipped with the necessary             equipment and information to respond to chemical emergencies.\n\n\n\n    The Kenton facility has an on-site alarm system and coordinates public notification through the local 911\n\nsystem and police department.  \n\n        \n\n6    Planned Changes  to Improve Safety (68.155(g)):\n\n\n\nThe Kenton facility constantly tries to improve the safety of the processes through annual reviews of out plant procedures, near misses and incident investigation programs, and a program soliciting safety and environmental suggestions from plant employees.\n\n\n\n"
    }
  ]
}