{
  "FacilityID": 1000043867,
  "FacilityName": "Wilbur-Ellis Company, Yuba City",
  "FacilityStr1": "900 N. George Washington Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Yuba City",
  "FacilityState": "CA",
  "FacilityZipCode": "95991",
  "Facility4DigitZipExt": "8400",
  "FacilityCountyFIPS": "06101",
  "LEPC": null,
  "FacilityLatDecDegs": "39.140278",
  "FacilityLongDecDegs": "-121.671944",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 128191681,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Wilbur-Ellis Company",
  "OperatorStr1": "900 N. George Washington Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Yuba City",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95991",
  "OperatorZipCodeExt": "8400",
  "RMPContact": "Sara Hill",
  "RMPTitle": "Branch Manager",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000045747",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Sutter County Env Health",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-10-16 00:00:00",
  "ErrorReportDate": "2009-06-16 00:00:00",
  "ReceiptDate": "2014-06-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-06-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 39.13814,
  "FRS_Long": -121.67178,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000054194,
      "AltID": "Farm Supplies Retail",
      "FacilityID": 1000043867,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000055410,
          "ProcessID": 1000054194,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065958,
          "ProcessID": 1000054194,
          "ChemicalID": 57,
          "Quantity": 66900.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000565958,
          "ProcessID": 1000054194,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043867,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION POLICIES\n\nThe facility has a long standing commitment to worker and public safety. This commitment is demonstrated\n\nby the resources invested in accident prevention, such as personnel training and consideration of safety in\n\nthe design, operation, and maintenance of the aqueous ammonia system. The facility's policy is to implement reasonable controls to prevent foreseeable releases of regulated substance.\n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe primary activity at the facility is the storage, and sale of fertilizers, in addition to, the sale of prepackaged\n\nagricultural chemicals to farmers, including the regulated substance, aqueous ammonia. \n\n\n\n\n\nAqueous ammonia (20% of ammonia by weight) is stored in two 25,000-gallon above ground tanks at the site.\n\nThe total quantity of ammonia present in the aqueous ammonia, based on 20% ammonia by weight and the specific gravity of ammonia (0.682), is approximately 56,900 pounds.\n\n\n\nBased on the facility's NAICS code (115112 Farm Supply Retail and Wholesale), the facility is required to follow the EPA RMP and the CalARP Program 2 for aqueous ammonia as required by the local Certified Unified Program Agency (CUPA, the Sutter County's Environmental Health Division.\n\n\n\nHAZARD ASSESSMENT SUMMARY/OFFSITE CONSEQUENCE ANALYSIS\n\nThe Facility's 04/23/2009 Hazard Assessment is in the process of being reviewed and updated. Section 8.a. of this RMP will be corrected when the Hazard Assessment review and updates are completed (targeted completion by 6/30/2014).\n\nThe Offsite Consequence Analysis part of the Hazard Assessment was reviewed and revised June 2014 and is summarized as follows:\n\n\n\nWorst-Case Release Scenario\n\nBased on the EPA RMP guidance, the worst-case release scenarios is defined as a release from the largest storage vessel at the facility. The anhydrous ammonia worst-case scenario is a release of 56,000 pounds from the anhydrous ammonia bullet tank. The aqueous ammonia worst-case scena"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043867,
      "SummaryText": "rio is a release of\n\napproximately 33,500 pounds of ammonia from one of the aqueous ammonia storage tanks.\n\n\n\nAlternative Release Scenario\n\nBased on the EPA RMP guidance, the alternative-case release scenarios is defined as a release scenario that is more likely than the worst-case release scenario. The anhydrous ammonia alternative case scenario is a release during the transfer of ammonia from the bullet tank to a nurse tank. The aqueous ammonia the alternative-case scenario is a release from a 4-inch hose during the transfer between a storage tank and the delivery truck.\n\n\n\nRisk Considerations\n\nAmmonia is a toxic inhalational hazard; and thus, the use of aqueous ammonia has inherent potential risks to potentially reach sensitive populations within the community. The facility's identified potential risks for an ammonia release from its process are included in the off-site consequence analysis,Hazard Assessment, and Process Hazard Analysis (PHA). Facility RMP elements and other safety programs are structured to minimize the potential of a release from the identified risks.\n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe facility employs a regional Environmental, Health and Safety Specialist to facilitate training and RMP implementation. As part of the implementation of CalARP Program 2 for aqueous ammonia, key Prevention Program elements were documented and implemented by the facility to manage process safety issues associated with the use of aqueous ammonia. Prevention elements for Program 2 are listed below:\n\n\n\n- Safety Information (SI)\n\n- Hazard Assessment (HA)\n\n- Operating Procedures (OP)\n\n- Training (TRN)\n\n- Mechanical Integrity (MI)\n\n- Incident Investigation (II)\n\n- Compliance Audits (CA)\n\n\n\nAlthough not required, the facility implements the following Program 3 RMP elements to further minimize the potential for accidental releases:\n\n\n\n- Management of Change (MOC) \n\n- Pre-Startup Review (PSSR) \n\n- Employee Participation (EP) \n\n- Contractors (CON) \n\n\n\nThe facility"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043867,
      "SummaryText": " is completely fenced and the gate is closed and locked when the facility is closed. A security guard completes visual inspections of the ammonia systems three times per night.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThere have been no CalARP-applicable releases of aqueous ammonia at the facility in at least the past five (5) years.\n\n\n\nFLAMMABLES: WORST CASE\n\nThe use of flammable materials at the Wilbur-Ellis Yuba City facility is not encompassed by either the federal or state RMP requirements. Therefore, this section is not applicable.\n\n\n\nFLAMMABLES: ALTERNATIVE RELEASE\n\nThe use of flammable materials at the Wilbur-Ellis Yuba City facility is not encompassed by either the federal or state RMP requirements. Therefore, this section is not applicable.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\nWilbur Ellis - Yuba City is exempt from the emergency response requirement; however, there is an emergency plan in place covering response to releases, and it is presented in annual emergency response training for all involved personnel.  The facility does meets the following criteria:\n\n\n\n- Annually filing of the Hazardous Materials Business Plan is completed for Sutter County. This filing is\n\nhandled by the SSRE Technician and includes the facility in the community emergency response plan.\n\n\n\n- Coordination with the local Fire Department. The last visit from the Yuba City Fire Department was in 2011. It was an annual inspection.\n\n\n\n- Established procedures to notify emergency responders as part of the \"Pre-Fire Plan/ Emergency Procedures.\" All Yuba City employees are trained in these procedures. \n\n\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nWilbur-Ellis is committed to continuously making safety improvements. To improve the safety of the aqueous ammonia system, Wilbur-Ellis is in the process of implementing non-destructive tests to evaluate the mechanical integrity of the tanks. At a minimum, inspection frequencies will follow industry standards.\n\nWilbur-Ellis is also implementing a facility-wide compre"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043867,
      "SummaryText": "hensive corrective action/preventative action (CAPA) log to track and facilitate completion of listed CAs on a timely basis. Recommended improvements and identified deficiencies from the inspection checklists, compliance audits, and PHA studies will be included on the facility CAPA log along with the priority, employee responsible, and targeted completion dates.\n\n"
    }
  ]
}