{
  "FacilityID": 1000013120,
  "FacilityName": "Gallade Chemical, Inc. - Santa Ana (Fed Filing)",
  "FacilityStr1": "1230 East St. Gertrude Place",
  "FacilityStr2": null,
  "FacilityCity": "Santa Ana",
  "FacilityState": "CA",
  "FacilityZipCode": "92707",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06059",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "33.816694",
  "FacilityLongDecDegs": "-117.855000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "IO",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Gallade Chemical, Inc.",
  "OperatorStr1": "1230 E. St. Gertrude Place",
  "OperatorStr2": null,
  "OperatorCity": "Santa Ana",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92707",
  "OperatorZipCodeExt": null,
  "RMPContact": "J'on Rider",
  "RMPTitle": "Corporate Quality Assurance Manager",
  "FTE": 39,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000192757",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-02-23 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-04-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-04-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-04-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-04-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "20",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000016387,
      "AltID": "Chemical Distribution",
      "FacilityID": 1000013120,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000016768,
          "ProcessID": 1000016387,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000019452,
          "ProcessID": 1000016387,
          "ChemicalID": 1,
          "Quantity": 15500.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 1,
            "ChemicalName": "Formaldehyde (solution)",
            "CASNumber": "50-00-0",
            "Threshold": 15000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000019453,
          "ProcessID": 1000016387,
          "ChemicalID": 55,
          "Quantity": 2100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 55,
            "ChemicalName": "Hydrogen fluoride/Hydrofluoric acid (conc 50% or greater) [Hydrofluoric acid]",
            "CASNumber": "7664-39-3",
            "Threshold": 1000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519452,
          "ProcessID": 1000016387,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000519453,
          "ProcessID": 1000016387,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000013120,
      "SummaryText": "This document comprises the Federal RMP for the Gallade Chemical facility located in Santa Ana, California (hereinafter referred to as the site or the subject site).  The site is owned and operated by Gallade Chemical, Inc.\n\nThe purpose of this document is to comply with the risk management planning and update requirements as set forth in the Code of Federal, Title 40 Part 68 (also known as the Federal RMP Regulations).  The scope of the RMP includes all operations conducted at the subject site that involve the storage and handling of regulated substances.  Regulated substances stored and handled at the facility include:\n\n    Hydrofluoric acid (70-percent concentration); and\n    Formaldehyde (37-percent concentration).\n\nEach of these materials is handled in varying container sizes.  \n\n1.1    DESCRIPTIONS OF STATIONARY SOURCES AND REGULATED SUBSTANCES\nThe primary operation conducted by Gallade Chemical, Inc. at the Santa Ana Facility is Chemical Distribution (NAICS Code 42489 A? Other Chemical and Allied Products Merchant Wholesalers).\n  \n1.1.1    FACILITY LOCATION\nThe Gallade Chemical Facility is located at 1230 East St. Gertrude Place in Santa Ana, California 92707.  The Facility is located in an area that is primarily industrial and bounded by East St. Gertrude Place to the north and industrial facilities to the east, south and west.  Figure 2-1 presents a General Facility Location Map for the site.\n\n1.1.2    FACILITY DESCRIPTION\nGallade ChemicalA?s Santa Ana Facility was constructed in 1973 to distribute industrial chemicals to retail operators and wholesale distributors.  \n\n1.1.3    DESCRIPTION OF REGULATED SUBSTANCE STORAGE AND HANDLING\nGallade ChemicalA?s Santa Ana Facility is a chemical distribution facility.  As part of normal operations, the Facility purchases, receives and stores onsite a number of regulated substances either in bulk or in various pre-packaged container types and sizes.  These operations are described below:\n\n70-Percent Concentrated Hydrofluoric Acid\nHydrof"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000013120,
      "SummaryText": "luoric Acid (70-percent concentrated) is received at the Facility in a 55-Gallon Drum and stored onsite in an enclosed building.  Operators then repack the 70-percent concentrated Hydrofluoric Acid into 1-Gallon bottles.  These bottles are then stored onsite in an enclosed building until they can be delivered to the various customer sites.  \n\n37-Percent Concentrated Formaldehyde\nFormaldehyde (37-percent concentrated) is received at the Facility in container sizes of 500-mL, 1-Gallon, 5-Gallons, and 55-Gallons and are stored onsite in an enclosed building.  As orders are received, the containers of Formaldehyde are shipped out to the various customer sites.\n\n1.2    GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\nThe Accidental Release Prevention Program at the facility consists of a series of programs, procedures and policies designed to minimize the risk of accidental releases involving regulated substances.  These programs include design and operating controls such as compliance with specified codes (i.e. compliance with building codes and fire codes, conformance to the Chemical ManufacturerA?s AssociationA?s Responsible Care Program, Corporate policies for segregation of classes of hazardous substances such as strong acids, strong bases, weak acids, weak bases, etc.), the CompanyA?s OSHA Hazard Communication Program, the CompanyA?s Injury and Illness Prevention Program, numerous standard operating procedures, the equipment inspection and maintenance program (including a mechanical integrity and preventive maintenance program for forklifts, etc.), fire protection, accident/incident investigation procedures (as contained in the CompanyA?s Injury and Illness Prevention Program), emergency response plan, the CalARP RMP Program compliance auditing program, and a variety of personnel training programs.  Details of each of these components of the CompanyA?s Accidental Release Prevention Program are provided in the remainder of this docum"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000013120,
      "SummaryText": "ent.  \n\n1.3    FIVE YEAR ACCIDENT HISTORY\nDuring the five years preceding the submittal of the CalARP RMP (i.e., from February 21, 2005 to the present), the subject site has NOT had any releases of regulated substances (i.e., 70-percent concentrated hydrofluoric acid, and 37-percent solution of formaldehyde) that have resulted in:\n\nA?    Onsite deaths, injuries, or \nA?    Significant property damage; or\nA?    Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place.\n\n1.4    EMERGENCY RESPONSE PROGRAM\nGallade Chemical recognizes that emergency planning and emergency response are an integral component of risk management.   As such, the Company, as part of its hazardous materials business plan (HMBP) for the Santa Ana Facility, has currently developed and implemented an emergency response plan and an emergency evacuation plan.  However, as an added measure to improve safety, the Company is evaluating the feasibility of developing specific emergency response options for emergencies involving various classes of hazardous substances handled at the facility (including regulated substances).  \n\n1.5    PLANNED CHANGES TO IMPROVE SAFETY\nA detailed process hazards analysis was performed for the facility on ALL operations involving regulated substances stored and handled at the facility in order to enhance the safety of the site and to evaluate the potential for accidental releases.  As a result of the process hazards analysis performed, a number of recommendations were made.  Gallade Chemical has already completed and implemented a number of the recommended actions.  \n\n1.6    COMPANY CONTACT INFORMATION\nGallade Chemicals, Inc. recognizes that some individuals may be interested in obtaining more detailed information regarding the CalARP RMP and various Prevention Program components not discussed herein.  Interested parties that have additional questions regarding the Santa Ana FacilityA?s Risk Management Plan and/or Prevention Program are directed t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000013120,
      "SummaryText": "o contact:\n\n    \n        JA?on Rider\n    Corporate Quality Assurance Manager\n    Gallade Chemicals, Inc.\n    1230 East St Gertrude Place\n    Santa Ana, California 92707\n"
    }
  ]
}