{
  "FacilityID": 1000057302,
  "FacilityName": "Kraft Heinz Foods Company",
  "FacilityStr1": "1701 West Bradley Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Champaign",
  "FacilityState": "IL",
  "FacilityZipCode": "61821",
  "Facility4DigitZipExt": "2200",
  "FacilityCountyFIPS": "17019",
  "LEPC": "Champaign County LEPC",
  "FacilityLatDecDegs": "40.125833",
  "FacilityLongDecDegs": "-088.271667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4318846,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Kraft Heinz Foods Company",
  "OperatorStr1": "1701 West Bradley Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Champaign",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61821",
  "OperatorZipCodeExt": "2200",
  "FTE": 1300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000064734",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-04-30 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-06-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-06-29 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-06-29 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-06-29 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.10.1",
  "FRS_Lat": 40.125922,
  "FRS_Long": -88.271951,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000071670,
      "AltID": "Food Manufacturing",
      "FacilityID": 1000057302,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000090174,
          "ProcessID": 1000071670,
          "ChemicalID": 56,
          "Quantity": 135000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000072872,
          "ProcessID": 1000071670,
          "NAICSCode": "311824",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000072873,
          "ProcessID": 1000071670,
          "NAICSCode": "311513",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        },
        {
          "Process_NAICS_ID": 1000072874,
          "ProcessID": 1000071670,
          "NAICSCode": "311941",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000060129,
              "Process_NAICS_ID": 1000072874,
              "SafetyReviewDate": "2016-01-22 00:00:00",
              "PHA_Date": "2014-11-11 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-06-30 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Various mechanical hazards",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-01-07 00:00:00",
              "TrainingReviewDate": "2015-12-09 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Video training - computer testing Internet based training provided by IRC",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-05-05 00:00:00",
              "EquipmentInspectionDate": "2015-03-09 00:00:00",
              "EquipmentTested": "Ammonia detector",
              "ChangeMgmtDate": "2015-12-27 00:00:00",
              "ChangeMgmtReviewDate": "2016-03-09 00:00:00",
              "PreStartupReviewDate": "2015-12-27 00:00:00",
              "ComplianceAuditDate": "2016-06-10 00:00:00",
              "AuditCompletionDate": "2018-06-10 00:00:00",
              "IncidentInvestigationDate": "2015-03-13 00:00:00",
              "InvestigationChangeDate": "2015-07-24 00:00:00",
              "ParticipationPlansReviewDate": "2016-03-11 00:00:00",
              "HotWorkPermitReviewDate": "2016-02-02 00:00:00",
              "ContractorSafetyReviewDate": "2015-12-11 00:00:00",
              "ContractorSafetyEvalDate": "2015-12-11 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000074873,
                  "PreventionProgram3ID": 1000060129,
                  "ProcessChemicalID": 1000090174
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000057302,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Champaign Fire Department",
    "CoordinatingAgencyPhone": "2173514522",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "CAA",
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000057302,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\n1.0\tRelease Prevention and Emergency Action Policies\r\n\r\nThe Kraft Heinz facility in Champaign, Illinois has an excellent record in preventing and minimizing releases of anhydrous* ammonia.  This facility has implemented an electronic preventive maintenance system.  This is a system that uses a real time data base to track training and inspection dates and issue reminders to responsible groups.\r\n\r\nThe emergency action policies at this facility ensure that there is ammonia release response coverage, 24 hours - 7 days per week.  There are also adequate provisions for coordination with outside agencies, such as with the Champaign Fire Department, in the event of an emergency.\r\n\r\n*From this point in the Executive Summary, anhydrous ammonia will be synonymous with ammonia.\r\n\r\n\r\n2.0\tProcess Description and Regulated Substances\r\n\r\nAt this location, Kraft Heinz manufactures processed cheese, pourable and spoonable salad dressings, and pasta dinners.  The SIC codes for the primary processes at this facility are 2022, 2035 and 2098.  The facility is divided into east and west side production units.  The east side consists of two production units, one vacant and the other for processed cheese (single slices, etc.).  The west side consists of four (4) production units with three working units - 1) pourable salad dressings, 2) spoonable salad dressings, and, 3) pasta dinners.  Many areas of the plant are refrigerated to preserve the ingredients and finished products.  Some of these areas include: receiving, processing, and other storage areas. \r\n\r\nKraft Heinz has one regulated substances under 40 CFR 68: i.e., ammonia, at this location.  Ammonia is used as a refrigerant in the refrigeration of the products in the various areas described above.\r\n\r\nThe ammonia threshold for triggering applicability to 40 CFR 68 is 10,000 pounds. The quantity of ammonia stored on-site is approximately 135,000 pounds. Thus, 40 CFR 68 is applicable to Kraft Heinz in Champaign, IL"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000057302,
      "SummaryText": "3.0\tWorst-case and Alternative Release Scenarios\r\nThe ammonia refrigeration system has associated hazards that can potentially affect on-site employees and the general public off-site if there is a release from either system. Although the alternative release scenario is more probable, the US EPA requires that one worst-case and one alternative release scenario be reported for each regulated chemical. Described below are the associated hazards and the worst-case and alternative release scenarios for each regulated chemical.\r\n\r\nAmmonia \r\n\r\nAmmonia is classified as a Group B2L Refrigerant per ASHRAE Standard 34-2013.  The dominant characteristic of this chemical is its toxicity.  It is a self-alarming chemical by its distinctive pungent odor.  Due to this odor, persons exposed to ammonia vapor will not voluntarily stay in areas of even small concentrations.  Ammonia is flammable in a very narrow and high range of concentration with a high ignition temperature.  Poisoning may occur if you breath in ammonia.  Ammonia is also corrosive to human tissue.  Ammonia is readily absorbed into the moisture of the skin and, at high concentrations, can cause severe burns.\r\n\r\nThe risks to persons in an accidental release of ammonia include:\r\n\r\n1.\tIrritation of respiratory tract,\r\n2.\tCorrosive attack of skin and other tissue,\r\n3.\tFreezing of skin and other body tissue when contacted by liquid ammonia.\r\n\r\nBelow is a description of the release scenarios for ammonia and their off-site consequences:\r\n\r\n \tWorst-case scenario - Taking the specific definition of the worst-case from 40 CFR 68.25, the largest quantity of ammonia that can be stored in a vessel is in the high pressure receiver during a pump-out situation (located outside the west compressor room).  The total quantity of ammonia that can be stored in the high pressure receiver is 41,893 pounds without administrative controls.\r\n\r\nUnder Section 68.25(c)(1), a regulated toxic substance such as ammonia, which is normally a gas"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000057302,
      "SummaryText": "at ambient temperature and handled as a liquid under pressure, shall be considered to be released as a gas over a 10 minute period.  Thus, ammonia's physical state in the worst-case release is a gas.\r\n\r\n \tThe ammonia worst case release scenario was modeled using RMP*Comp to obtain the distance to endpoint.  The endpoint is defined by the US EPA as the Emergency Response Planning Guideline, Level - 2 (ERPG-2) which was calculated to be 2.3 miles.  The ERPG-2, has been developed by the American Industrial Hygiene Association and is the maximum airborne concentration below which it is believed that nearly all individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects or symptoms which could impair an individual's ability to take protective action.\r\n\r\nRMP*Comp is a computer program sponsored by the EPA.  RMP*Comp allows owners and operators of facilities subject to the EPA's RMP rule to perform an offsite consequence analysis to check whether their process puts nearby populations or receptors at risk.  This program implements the RMP offsite consequence analysis procedures recommended by the EPA taking in account threat type, physical state of the chemical, release rate, wind speed, surface roughness, and other impacting factors.\r\n\r\nUrban dispersion coefficients (0.9 m surface roughness) were used during modeling runs for the Champaign facility in accordance with Appendix W to Part 51- Guidelines on Air Quality Models Section 8.2.8.\r\n\r\n\tThe estimated affected residential population is 50,859 people.  The types of affected receptors are listed in the Data Elements section.\r\n\r\n \tAlternative Release Scenario - The worst-case release is less likely to occur than \tthe following scenario: \r\n\r\n\tAlternative Release Scenario Description \r\n\r\n \tThe alternative release scenario that meets both selection criteria is an ammonia release from the PRV's on the compressors (HC1, HC2, HC3 and HC4) in the east compressor ro"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000057302,
      "SummaryText": "om.  This produces a horizontal jet release.  The compressors are located indoors in the east engine room and the PRV's on these compressors all release at the same time through the same line (1 line) on the roof. There are no applicable administrative controls or passive mitigation. Active mitigation of the release is human intervention (PRVs' shutdown at 10 minutes from the start of the release).  \r\n\r\n \tOur calculations showed that the ammonia vapor release rate is 230.8 lb/min (combined - for HC1, HC2, HC3 and HC4 releasing at the same time).\r\n\r\n \tThe alternative release scenario was modeled using RMP*Comp to obtain the distance to the endpoint. The endpoint distance for this alternative release scenario is 0.1 miles.\r\n\r\n \tMARPLOT indicates that this scenario does not impact any residences or environmental receptors.  However, a visual survey of the impact area indicates that the area include six residences.  Based on average estimated population of four persons per residence, the estimated affected residential population is 24 people.\r\n\r\n\r\n4.0\tGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\r\n\r\nThis facility has developed an OSHA PSM program for their ammonia refrigeration system.  Ammonia falls under the RMP Program 3 prevention program which is identical to the OSHA PSM program.  EPA has said that if the process is in compliance with OSHA PSM, then it is in compliance with RMP Program 3.  Thus, Kraft Heinz's ammonia PSM has been reviewed and determined to be complete for the RMP document. \r\n\r\nThere are several aspects of the prevention program that are key:\r\n\r\n1.\tSince most of the pipe work is out of the way of people and the machinery, there is less of a chance of an ammonia release.\r\n\r\n2.\tThe plant maintains good training, certification and employee awareness of operating procedures).\r\n\r\n\r\n5.0\tFive-year Accident History\r\n\r\nDue to the most recent process change, an additional five-year accident history includes the followin"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000057302,
      "SummaryText": "g date range: June 21, 2011 - June 21, 2016.  According to 40 CFR Part 68.42(a), there have been no accidental releases at this facility.\r\n\r\n\r\n6.0\tEmergency Action Program\r\n\r\nAs mentioned earlier, this facility has developed an emergency action program which complies with the OSHA standard and contains procedures for:\r\n\r\n¿\tEmergency escape\r\n¿\tEmployees and accounting of all employees\r\n¿\tRescue and medical duties\r\n¿\tReporting\r\n¿\tEmergency notification (Champaign Fire Department)\r\n¿\tAlarm systems\r\n¿\tEvacuation, and\r\n¿\tTraining\r\n\r\nAs part of the emergency notification procedures, the Champaign Fire Department will be called to provide first emergency responders, equipment, and service.  The Champaign Fire Department will be called for all fire related emergencies.  In all cases where the fire department is called, an ambulance will also be called to the scene.\r\n\r\nThis HAZWOPER and Emergency Action plan addresses all the above mentioned procedures in detail.  This level of detail makes the emergency response program at Kraft Heinz Champaign a thorough and comprehensive program.\r\n\r\n\r\n7.0\tPlanned Changes to Improve Safety\r\n\r\nBased on the \"what-if/checklist combined\" PHA completed for ammonia a list of action items was developed and are being monitored to determine if implementation was accomplished. For example, in the ammonia system, a potential for unknown leaks on older units was identified. Ammonia detection was added to the identified older units and all new control or air handling unit upgrades will be equipped with detection. Additionally it was recommended to add sight glass oil level as part of round sheets and this was completed as well."
    }
  ]
}