{
  "FacilityID": 1000088763,
  "FacilityName": "FXI, Inc. - East Rutherford",
  "FacilityStr1": "13 Manor Road",
  "FacilityStr2": null,
  "FacilityCity": "East Rutherford",
  "FacilityState": "NJ",
  "FacilityZipCode": "07073",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "34003",
  "LEPC": "East Rutherford Boro LEPC",
  "FacilityLatDecDegs": "40.825833",
  "FacilityLongDecDegs": "-074.090556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.fxi.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 51656424,
  "ParentCompanyName": "FXI, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 829462535,
  "Company2DUNS": 619971039,
  "OperatorName": "FXI, Inc.",
  "OperatorStr1": "100 W Matsonford Road",
  "OperatorStr2": "Suite 300",
  "OperatorCity": "Radnor",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "19087",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ray Ghigliotty",
  "RMPTitle": "Plant  Manager",
  "FTE": 59,
  "OtherEPAFacilityID": "07073GNRLF13MA",
  "EPAFacilityID": "100000072208",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-07-07 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-07-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-07-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-07-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.82558,
  "FRS_Long": -74.08856,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) DIFFERENTIAL",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000110412,
      "AltID": "Foam Production",
      "FacilityID": 1000088763,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000111685,
          "ProcessID": 1000110412,
          "NAICSCode": "32615",
          "_desc": {
            "NAICS_CODE": "32615",
            "NAICS_DESCRIPTION": "Urethane and Other Foam Product (except Polystyrene) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000137871,
          "ProcessID": 1000110412,
          "ChemicalID": 44,
          "Quantity": 320000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 44,
            "ChemicalName": "Toluene 2,4-diisocyanate  [Benzene, 2,4-diisocyanato-1-methyl-]",
            "CASNumber": "584-84-9",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000637871,
          "ProcessID": 1000110412,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000088763,
      "SummaryText": "FXI strives to conduct its business in a socially responsible and ethical manner with a positive commitment to protect people and the environment. Our management team and employees are responsible for maintaining an awareness of applicable environmental, safety and health laws and regulations with the assistance of our Corporate Environmental, Health and Safety Department and conducting day-to-day activities required for compliance with these laws and regulations.\n\n\n\nFXI believes that it's policies and principles can be most effectively implemented by using a risk management approach to identify and prioritize problems, determine the probability of problems occurring, exploring alternate solutions and taking action where appropriate.\n\n\n\nThis FXI facility manufacturers flexible polyurethane foam by mechanical mixing of polyol resins with toluene diisocyanate (TDI mixed isomers) along with water, catalysts, surfactants, pigments, and other chemical compounds. The facility stores TDI in 3 secured indoor diked above-ground storage tanks in a separate tank room. TDI is delivered via railcar and stored in an attached indoor railcar unloading building and occasionally by tank truck and unloaded in a designated diked area just outside the tank room.\n\n\n\nThis FXI facility has implemented an accidental release prevention programs which includes process safety information according to documented plans as regulated by the NJ DEP TCPA and DPCC/DCR Programs.\n\n\n\nProcess hazard analyses are conducted on a five year schedule or as required by a process hazard analysis team. The team is organized by a process risk management consultant and is typically composed of a team leader, process engineer, EHS Manager, and any other employees that may contribute to the analysis. Results and recommendations are recorded in a documented program.\n\n\n\nStandard operating procedures (SOPs) and Job Hazard Analysis (JHAS) are written by the EHS Manager using the technical process description in cooperat"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000088763,
      "SummaryText": "ion with the production managers, Maintenance and their management staffs. All existing SOPs and JHAs are checked and verified for correctness once a year by these staff members. The SOPs and JHAs are available throughout the plant via postings, manuals, and on the plant server computer network.\n\n\n\nTraining is formulated, tracked, and documented by the EHS Manager and HR according to a training matrix individualized for each department's requirements. Understanding the training is assured by on the job observation, written tests, oral exams and demonstration of a person's performance skills.\n\n\n\nThe Preventive Maintenance/Mechanical Integrity Program is delegated to the Plant Engineer and/or Maintenance Manager. The program consists of equipment lists and specifications, instrument lists and specifications, pipeline lists and specifications, equipment history of repair and replacement, preventive maintenance procedures and demand work order procedures. Job hazard analysis, work permits, hot work permits, and lockout/tagout are used in conjunction with the program.\n\n\n\nThe Management of Change Program is quality assured by the facility's department managers. It is composed of a written program with elements to assure that repairs and replacements are documented and completed according to corporate guidelines.\n\n\n\nRisk Management Program compliance audits are conducted annually by the EHS Manager in cooperation with the facility managers and supervisors. Deficiencies are documented, scheduled for improvement and monitored by the EHS Manager.\n\n\n\nThe Incident Investigation Program follows guidelines for fact determination, root cause analysis, and recommendation review, implementation and documentation. The program is monitored by the EHS Manager.\n\n\n\nThe Contractor Safety Program follows corporate policy and is implemented by the facility management staff as needed.\n\n\n\nEmployee participation is required in each element program description.\n\n\n\nThree hundred sixty thousand p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000088763,
      "SummaryText": "ounds of toluene diisocyanate mixed isomers (TDI) is inventoried for the manufacture of flexible polyurethane foam on one round block foam production line.\n\n\n\nRelease prevention and chemical specific prevention used at the facility are relief valves, check valves, manual and automatic shutoffs, scrubbers, interlocks, audible and visual alarms, TDI handling SOPs, JHAs, bypass piping system, emergency self-contained and supplied air breathing apparatus, grounding equipment, rupture disks, relief valves and blowout containers. Mitigation systems used are sprinkler systems, firewalls, and chemical neutralization. The process and unloading areas can be monitored by portable TDI monitors and two permanently mounted continuous read TDI monitors located at the storage tanks and pourline head. Operator training and refresher training are conducted as needed or on a yearly basis.\n\n\n\nThe facility has not had an accidental EHS-related release in the last five years plus.\n\n\n\nThe facility's Emergency Response Program was designed and updated according to the EPA Integrated Contingency Plan Guidance document. The plan defines the response organization, coordination with city, county, state, and contracted emergency response organizations, equipment available on-site, response procedures, training, notification procedures, emergency scenarios, and drills. The plan is updated periodically according to our requirements or from deficiencies uncovered from periodic tabletop and actual drills and evacuations. The plan was distributed to the LEPC, local police and fire departments\n\n\n\nThe facility plans no major safety improvements at this time since all current state-of-the-art for design and operation is implemented.\n\n"
    }
  ]
}