{
  "FacilityID": 1000021723,
  "FacilityName": "Walnut Energy Center",
  "FacilityStr1": "600 South Washington Road",
  "FacilityStr2": null,
  "FacilityCity": "Turlock",
  "FacilityState": "CA",
  "FacilityZipCode": "95380",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06099",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "37.488056",
  "FacilityLongDecDegs": "-120.896389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.tid.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 46004933,
  "ParentCompanyName": "Walnut Energy Center Authority",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Turlock Irrigation District",
  "OperatorStr1": "600 South Washington Road",
  "OperatorStr2": null,
  "OperatorCity": "Turlock",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95380",
  "OperatorZipCodeExt": null,
  "FTE": 21,
  "OtherEPAFacilityID": "981367691",
  "EPAFacilityID": "100000192301",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "N-7172",
  "SafetyInspectionDate": "2011-04-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-05-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-05-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-05-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-05-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 37.4877,
  "FRS_Long": -120.8955,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000026395,
      "AltID": "Anhydrous Ammonia for SCR",
      "FacilityID": 1000021723,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000031381,
          "ProcessID": 1000026395,
          "ChemicalID": 56,
          "Quantity": 52530.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000026756,
          "ProcessID": 1000026395,
          "NAICSCode": "221112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000022659,
              "Process_NAICS_ID": 1000026756,
              "SafetyReviewDate": "2011-04-15 00:00:00",
              "PHA_Date": "2011-04-19 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-04-15 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Containment Area",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Revise/confirm procedures",
              "OpProceduresReviewDate": "2011-04-18 00:00:00",
              "TrainingReviewDate": "2011-04-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-04-19 00:00:00",
              "EquipmentInspectionDate": "2011-03-03 00:00:00",
              "EquipmentTested": "ammonia tank and piping",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2011-04-19 00:00:00",
              "PreStartupReviewDate": "2005-11-01 00:00:00",
              "ComplianceAuditDate": "2011-04-19 00:00:00",
              "AuditCompletionDate": "2011-12-01 00:00:00",
              "IncidentInvestigationDate": "2011-04-20 00:00:00",
              "InvestigationChangeDate": "2011-12-01 00:00:00",
              "ParticipationPlansReviewDate": "2011-04-20 00:00:00",
              "HotWorkPermitReviewDate": "2010-12-20 00:00:00",
              "ContractorSafetyReviewDate": "2005-11-01 00:00:00",
              "ContractorSafetyEvalDate": "2009-02-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000026788,
                  "PreventionProgram3ID": 1000022659,
                  "ProcessChemicalID": 1000031381
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000021723,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Turlock City Fire Department",
    "CoordinatingAgencyPhone": "2096685580",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021723,
      "SummaryText": "l completion of every project undertaken by the Turlock Irrigation District. The District requires active injury and illness prevention as an important element of production on a daily basis.\n\nThis document complies with the EPA Risk Management Program under Section 112 (r) of the Clean Air Act (CAA) Amendments of 1990, 40 Code of Federal Regulations (CFR) Part 68, and the California Accidental Release Prevention (CalARP) Program under California Code of Regulations (CCR) Title 19, Division 2, Chapter 4.5.  This document summarizes the Turlock Irrigation DistrictÂ¿s existing health and safety programs, its internal management response procedures, and ongoing actions that are designed to prevent or minimize impacts of accidental releases of ammonia to the environment. The Walnut Energy Center Authority  has prepared an emergency action plan to handle any potential accidental releases.\n\nFacility Description and Regulated Substances Information\n\nThe Walnut Energy Center is a nominal 250-megawatt (MW), natural-gas-fired, combined-cycle generating facility consisting of two natural-gas-fired combustion turbines and one condensing steam turbine.  The Walnut Energy Center is owned by the Walnut Energy Center Authority and is operated by the Turlock Irrigation District.   The WEC is a high efficiency, combined-cycle facility that will be integrated into TIDÂ¿s plans to meet its growing native load, and provide other ancillary services and benefits to TID.\n\nWEC is generally located at the western edge of the City of Turlock in Stanislaus County, California, approximately 2.7 miles west of Highway 99, just south of West Main Avenue, off South Washington Road. This site consists of approximately 18 acres within a 69-acre parcel of industrial zoned land. Industrial development exists on the north and east sides. Agricultural uses are located south of the site and agricultural, residential, and utility uses are to the west.  \n\nAmmonia is used at the Walnut Energy Center to reduc"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000021723,
      "SummaryText": "chnology and process equipment, including safety system, (3) maintenance procedures, and (4) operating procedures for the ammonia system.\n\nEach employee (presently involved in operating the ammonia process) has been trained to acquire the knowledge, skills, and abilities to safely carry out the duties and responsibilities, including emergency actions.  \n\nRefresher training is provided annually to each employee operating the covered process to ensure that the employee understands and adheres to the current operating procedures.  In addition, the Turlock Irrigation District ensures that operators are trained in any updated or new procedures prior to startup of a process after a major change as indicated in their management of change procedures.\n\nThe Turlock Irrigation District prepares and retains records of initial and refresher training, provides certification of the records, which includes the identity of the employee, the date of training, and the signature of the person (s) administering the training.\n\nContractors\n\nThe Turlock Irrigation District prefers to use it's on site staff to perform any work on the ammonia system. When that is not possible the Turlock Irrigation District has procedures and policies in place that ensure that only contractors with good safety programs are selected to perform work on and around the ammonia process and that the contractors are properly informed of the hazards, access limitations to these process areas, and emergency action procedures, and prepared to safely complete the work.  The Turlock Irrigation District holds contractor safety briefings before allowing them near or in the process areas; controls access to the process areas, and evaluates the contractor's performance.\n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nThe Turlock Irrigation District  has procedures in place to ensure that a pre-startup safety review is conducted prior to starting a new covered process or prior to making modifications to the ammo"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021723,
      "SummaryText": "Introduction\n \nThe Walnut Energy Center uses anhydrous ammonia as a necessary part of reducing the emissions of nitrogen oxides to the atmosphere.  Storing a large quantity of ammonia can be a hazard if it is not handled properly.  The Walnut Energy Center is owned by the Walnut Energy Center Authority, a joint powers authority comprised of the Turlock Irrigation District and the Merced Irrigation District.  The Turlock Irrigation District is responsible for operating Walnut Energy Center.  As such, it takes its safety obligations in storing and using ammonia as seriously as it takes controlling emissions from the power plant.  The following document describes what could happen if there were to be an accident, the steps the Turlock Irrigation District takes every day to ensure a safely operating plant, and what to do in the event of an emergency.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe Walnut Energy Center accidental release prevention policy involves a unified approach that integrates proven technology, staff training on operation and maintenance practices, and tested management system practices.  All applicable procedures of the State of California and U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\nTurlock Irrigation District recognizes the responsibility to make its environment, community and employee safety a primary part of our daily concerns.  Turlock Irrigation District is committed to being a responsible member of any community in which it has operations by giving top priority to operating in a safe and environmentally sound manner.  Turlock Irrigation District is dedicated to developing an environmentally responsible energy resource compatible with community needs.   The prevention of accidents and protection of its employees, property and the general public are essential to the efficient and successfu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021723,
      "SummaryText": "e nitrogen oxides (nitric oxide and nitrogen dioxide) created during the combustion of natural gas and exhausted from the two Combustion Turbine Generators (CTG) and two Heat Recovery Steam Generators (HRSG).  The maximum quantity of ammonia stored at Walnut Energy Center exceeds the federal RMP and CalARP specified threshold quantities of 10,000 pounds and 500 pounds, respectively; thus, the facility is subject to federal RMP and CalARP regulations.  The anhydrous ammonia process is a Program 3 process.\n\nSummary of the Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\nWalnut Energy Center is in compliance with Federal and State Process Safety Management requirements. Walnut Energy CenterÂ¿s accidental release prevention program is based on the following key elements:\n\nDetailed management system and clear levels of responsibilities and team member roles.\nComprehensive preventive maintenance program.\nPerformance of process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\nUse of state-of-the-art process and safety equipment.\nUse of accurate and effective operating procedures, written with the participation of the operators.\nHigh level of training of the operators and maintenance staff.\nImplementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nChemical-specific prevention steps include availability of contaminant specific respirators, awareness of the hazardous and toxic properties of ammonia, and presence of ammonia detectors and alarms.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data have been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of ammonia.  This information includes ammonia background information and MSDS sheets.\n\nDetails such as maximum intended inventory and safe upper and lower operating limits a"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000021723,
      "SummaryText": "re on file at the facility.  The Turlock Irrigation District also has procedures in place that is triggered to update process safety information if there is a major change that makes existing information inaccurate.\n\nThe ammonia process is equipped with a number of safety features designed to prevent accidental releases.  Such safety devices include secondary containment, leak detectors and alarms, pressure and level indication, emergency eye-wash and shower, a deluge system, and a vapor isolation valve.  \n\nProcess Hazard Analysis \n\nIn 2005, a detailed process hazard analysis (PHA) was conducted for ammonia system equipment and procedures.  The PHA was updated in April 2011.  A list of recommended actions was developed during the 2005 PHA to improve the ammonia safety, staff implemented those recommendations, as appropriate. An additional list of recommended actions was developed during the 2011 PHA to improve the ammonia safety, staff implemented those recommendations, as appropriate. \n\nA seismic assessment of the ammonia process was conducted in August 2005 and recommendations were provided to Walnut Energy Center staff for their evaluation and implementation. \n\nOperating Procedures\n\nThe Turlock Irrigation District maintains written operating procedures that provide clear instructions for ammonia process. The operating procedures include start-up, normal operation, and shutdown procedures.  Operating procedures were updated in April 2011.\n\nTraining \n\nWalnut Energy Center employees presently involved in operating or maintaining the ammonia process are trained in an overview of the process and detailed applicable operating and maintenance procedures. The Turlock Irrigation District ensures that each employee newly assigned to the process, is trained and tested to be competent in the operating procedures listed pertaining to their duties.  Walnut Energy Center training program includes as a minimum the following elements: (1) process safety information (2) process te"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000021723,
      "SummaryText": "nia system that require a Management of Change procedure implementation.  These procedures ensure that no new/significantly modified process will start-up and no regulated substances will be introduced into such a process prior to the pre-startup safety review. \n\nThe Turlock irrigation District uses a manual system that assures inspection, testing, and maintenance of ammonia equipment in accordance with the manufacturer and industry groups.\n\nHot Work Permits and Management of Change \n\nThe Turlock Irrigation District requires employees and contractors to employ safe work practices when performing hot work in, on, or around the covered process.  The Turlock Irrigation District uses a permitting program to ensure hot work is conducted safely on or near a process involving ammonia.\n\nThe Turlock Irrigation District  provides a system and approach to maintain and implement any management of change or modifications to equipment, procedures, chemicals, and processing conditions. This system allows Walnut Energy Center staff to identify and review safety hazards or provide additional safety, process, or chemical information to existing data before the proposed change would either compromise system safety or need training to be completed.\n\nInternal Compliance Audits\n\nInternal compliance audits will be conducted every 3 years to verify compliance with the programs and procedures contained in the RMP.  The Turlock Irrigation District  assembles an audit team that will include personnel knowledgeable in the Risk Management Program rule and in the process.  This team will evaluate whether the prevention program satisfies the requirements of the Risk Management Program rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit will be documented, recommendations resolved, and appropriate enhancements to the prevention program will be implemented.\n\nIncident Investigation\n\nThe Turlock Irrigation District investigates"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000021723,
      "SummaryText": "all incidents that could reasonably have resulted in a catastrophic release (serious injury to personnel, the public, or the environment) so that similar accidents can be prevented.  An investigation team is assembled and the investigation is initiated following the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.  Information found during the investigation is reviewed by affected staff and added or used to revise operating and maintenance procedures.\n\nFive-Year Accident History Summary\n\nEPA RMP regulations require reporting the five-year accident history of the covered processes.  The details of accidental releases are required for accidents that have caused at least one of the following:\n\nOnsite deaths, injuries, or significant property damage\n\nKnown offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place\n\nThe Walnut Energy Center is a new facility and has had no accidents involving ammonia.\n\nEmergency Response Program Summary\n\nThe Turlock Irrigation District  has established a written emergency action program that is followed by the employees to help safely control accidental releases of hazardous substances.  PSM and RMP regulations require that an Emergency Action Plan be prepared for facilities that are not responding facilities.  The plan must be prepared in accordance with the provisions of 8 CCR 3220, Emergency Action Plan.  This program has been coordinated with the City of Turlock Fire Department, which is a member of the Local Emergency Response Planning Committee (LEPC).  \n\nPlanned Changes to Improve Safety\n\nA number of studies and inspections have been conducted to improve the safety of the ammonia process at the Walnut Energy Center including:\n\nThe initial process hazard analysis conducted in January 2005. A follow up PHA was conducted in April 2011.\nThe seismic assessment conducted in August 2005.\nA safety inspe"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000021723,
      "SummaryText": "ction conducted by the City of Turlock Fire Marshall on April 21, 2011.\n\nDuring these studies and inspections, several additional risk reduction measures were recommended to improve safety at Walnut Energy Center.  Details of the recommendations from the process hazard analysis and the seismic assessment can be found in the prevention program document.  The risk reduction measures include confirming vendor procedures, confirming maintenance procedures, and posting signs near the ammonia tank. The implementation of these recommendations will further improve the safety of the ammonia system."
    }
  ]
}