{
  "FacilityID": 1000085804,
  "FacilityName": "Fasken Oil and Ranch, Ltd",
  "FacilityStr1": "8898 SE 8000",
  "FacilityStr2": null,
  "FacilityCity": "Andrews County",
  "FacilityState": "TX",
  "FacilityZipCode": "79714",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48003",
  "LEPC": "Andrews County LEPC",
  "FacilityLatDecDegs": "32.175874",
  "FacilityLongDecDegs": "-102.268382",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "FC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Fasken Management, LLC",
  "Company2Name": null,
  "CompanyDUNS": 68858778,
  "Company2DUNS": null,
  "OperatorName": "Fasken Oil and Ranch, Ltd.",
  "OperatorStr1": "6101 Holiday Hill Road",
  "OperatorStr2": null,
  "OperatorCity": "Midland",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "79707",
  "OperatorZipCodeExt": null,
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000228997",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2020-03-05 10:50:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-03-05 10:50:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2020-03-05 10:50:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-03-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 32.175989,
  "FRS_Long": -102.268807,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000107133,
      "AltID": "NGL Storage",
      "FacilityID": 1000085804,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000133995,
          "ProcessID": 1000107133,
          "ChemicalID": 155,
          "Quantity": 355804.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000118653,
              "ProcessChemicalID": 1000133995,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000118654,
              "ProcessChemicalID": 1000133995,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000118655,
              "ProcessChemicalID": 1000133995,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000118656,
              "ProcessChemicalID": 1000133995,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000118657,
              "ProcessChemicalID": 1000133995,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000118652,
              "ProcessChemicalID": 1000133995,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000118658,
              "ProcessChemicalID": 1000133995,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000108406,
          "ProcessID": 1000107133,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000085804,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-08-14 00:00:00",
    "ERTrainingDate": "2014-08-28 00:00:00",
    "CoordinatingAgencyName": "Andrews Volunteer Fire Department",
    "CoordinatingAgencyPhone": "4325233833",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000085804,
      "SummaryText": "The FASKEN Oil & Ranch Ltd., Mark Merritt Gas Plant is a new facility. This is 60 million ft3/day of ethane and heavier hydrocarbons recovery plant from sweet field gas. \r\n\r\nProcess Overview\r\nThe field gas is treated to remove unwanted components, dehydrated and processed to remove heavy (liquid) hydrocarbons from the gas stream. The process is subdivided into following sections\r\n\r\nInlet processing and stabilization:\r\nThe inlet processing consists of a slug catcher, compression, propane refrigeration system, and stabilization system. The gas flows through the slug catcher, which separates hydrocarbon liquids and water is condensed in the gathering system from the rest of the stream. Condensate is then fed to NGL Tower, which strips ethane and lighter components from the produced liquids. The NGL splitter separates the remaining liquid into a condensate and an NGL stream that will be blended with the product from the cryogenic section of the plant for sales. \r\n\r\nAmine treating:\r\nThe amine unit is designed to remove CO2 from the natural gas stream. CO2 can otherwise freeze in the cryogenic unit forming dry ice and forcing the shutdown of the facility. Amine treating is an exothermic chemical reaction process. The treating solution is a mixture of reverse osmosis (RO) water and diglycolamine (DGA). This aqueous mixture is regenerated and reused. The CO2 reacts with the amine to form an amine carbonate. The amine is now known as rich amine and the remaining gas is sweet and continues to the TEG system. \r\n\r\nTEG system:\r\nThe TEG system is designed to remove water from the natural gas stream in the preparation for cryogenic processing. This is accomplished by contacting lean, dry Tri-ethylene glycol with wet gas in order for any water vapor to be carried off in the glycol steam. The dry gas is sent on for processing, while the rich glycol stream is sent through a reboiler and still column to separate the absorbed water vapor and any hydrocarbons.  The glycol is then ready"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000085804,
      "SummaryText": "to be pumped back to the absorber tower for another circuit. \r\n\r\nCryogenic unit:\r\nThe cryogenic unit is designed to liquefy natural gas components from the sweet, dehydrated inlet gas by removing work (heat) from the gas by means of the turbo expander. The cryogenic unit recovers natural gas liquids (NGL) by cooling the gas stream to extremely cold temperatures (-160 F) and condensing components such as ethane, propane, butanes, and heavier components. The gas is cooled by a series of heat exchangers and by lowering the pressure of the gas from around 760 psig to approximately 240 psig. Once the gas has passed through the system of heat exchanger and expansion, it is recompressed using the energy obtained from expanding the gas. \r\n\r\nHot oil system:\r\nThe Hot oil system in the plant is used to provide heat to certain processes within the facility. The system will circulate hot oil and deliver heat to other processes. It consists of a Natural gas fired heater, hot oil pumps, hot oil surge tank and heat exchangers.  \r\n\r\nEmergency flare:\r\nThe flare is utilized in the event that the facility needs to be shut down. The sweet gas is than flared for safety purposes until the gas can be shut in at the back field. \r\n\r\nRisk Management Plan\r\n\r\nRisk management plan has been developed to protect the health and safety of the employees, nearby community and to protect the environment. \r\n\r\nNGL is the flammable Chemical mixture. The regulated chemicals contained in the mixture include Methane, Ethane, Propane, n-Butane, Iso-butane, n-Pentane, and Iso-pentane. Per 40-CFR-68-115 P.b2, 3, these chemicals are above threshold quantity limit of 10000 lb. Maximum quantity of these chemicals as NGL storage is 11404 ft3 (355804 lb). \r\n\r\nHazard assessment procedure:\r\nWorst case release was assumed to occur in the NGL storage tank, where maximum inventory of the contents (355804 pounds) may be present. NGL contains Methane, Ethane, Propane, Butane, Iso-butane, Pentane, and Iso-pentane. \r\n\r\nWorst"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000085804,
      "SummaryText": "-case release scenario analysis:\r\nThe analysis was performed using EPA's browser based software \"RMP*Comp Version 1.07\".  \r\n\r\nAssumptions about this scenario: \r\n¿\tWind speed: 1.5 meters/second (3.4 miles/hour)\r\n¿\tStability class: F\r\n¿\tAir temperature: 77 degrees F (25 degrees C)\r\nThe total quantity in the vessel is assumed to be involved in the explosion. The distance to an overpressure endpoint of 1 psi was taken resulting from a vapor cloud explosion of a cloud containing the largest quantity of the regulated flammable substance from a vessel failure. Following were the results,\r\n\r\nEstimated distance to 1 psi overpressure: 0.6 miles (0.9 kilometers) \r\n(This is the distance to the overpressure endpoint of 1 pound per square inch specified for this mixture under the RMP Rule.)\r\n\r\nChemical: Flammable Mixture\r\nCAS number: Not applicable (for a mixture)\r\nCAS number for individual Chemicals:\r\n\t\r\nChemical\tCAS #\r\nButane\t106-97-8\r\nEthane\t74-84-0\r\nIsobutane\t75-28-5\r\nIsopentane\t78-78-4\r\nMethane\t74-82-8\r\nPropane\t74-98-6\r\nPentane\t109-66-0\r\n\r\n \r\nThreat type: Flammable Gas\r\nScenario type: Worst-case\r\nPhysical state: Liquefied under pressure\r\nQuantity released: 355804 pounds\r\nRelease type: Vapor Cloud Explosion\r\n\r\nDefining offsite impacts-population\r\nAccording to the analysis, offsite impacts will be limited to 0.6 mile radius. Based on site visit of adjacent areas there are no public receptors (as defined by 40CFR-68.3) within this area, the population within 0.6 miles is zero (0). Based on available USGS data and site visit, no environmental receptors were found within 0.6 miles radius. \r\n\r\nMitigation\r\nFASKEN has an ESD system, fire and gas detection, an emergency flare, scrubbers, and sumps located around all pumps. FASKEN has liaison with (names of local emergency responders, local fire departments and/or local Emergency Planning Committees. FASKEN also need to make a formal/written liaison with them to have a mutual understanding/Emergency preparedness regarding handling/res"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000085804,
      "SummaryText": "ponding to emergencies. \r\n\r\nBuddy Hobbs Fire Chief\r\nAndrews Volunteer Fire Department\r\n201 E. Broadway\r\nAndrews, TX 79714\r\nPh: 432-523-3833\r\nFax: 432-523-2590\r\n\r\nMike Cook\r\nEmergency Management Coordinator\r\n201 N. Main St. # 113\r\nAndrews, TX 79714\r\n432-524-1429\r\n\r\nLocal Emergency Planning Committee\r\nThe Honorable Charlie Falcon\r\n201 N. Main St. # 104\r\nAndrews, TX 79714\r\n432-524-1401\r\n\r\nPer CFR-68-90, FASKEN employees are not required to respond to emergency situations only if \r\n(a) there are no regulated toxic substances at the facility \r\n(b) FASKEN has coordinated response actions with the local fire department and \r\n(c) appropriate mechanisms are in place to notify emergency responders when there is a need for response) In case of an emergency, FASKEN will coordinate with them. \r\n\r\nReview and update:\r\nOffsite Consequence analyses will be reviewed and updated at least once every five years. If there is a change in processes, quantities, or any other aspect might reasonably be expected to increase or decrease the worst-case distance to the endpoint, FASKEN will complete a revised analysis within six months of the change and submit a revised Risk Management Plan. \r\n\r\nFive-year Accident History:\r\nThere is no data to report in this category. \r\n\r\nPrevention program\r\nThe following is the summary of the accident prevention program in place at the FASKEN Oil and Ranch Ltd. \r\n\r\n1. Process Safety Information:\r\nThe facility keeps a variety of information available for those who operate the plant. This information include description of the processes and associated hazards, limits for key process parameters, specific inventories, equipment design basis, information related to Chemicals, e.g. MSDS of chemicals involved, safe operation limits, results of the deviation from the safe operation limits, and material and energy balances.\r\n\r\n2. Process Hazard Analysis:\r\nThe procedure is in place to perform PHA using HAZOP. The HAZOP addresses hazards of the process, current controls,"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000085804,
      "SummaryText": "consequences of the deviation, facility siting, human factors, and generates recommendations. (Baseline PHA was performed/is expected to be completed by (please state the expected time frame) PHA Completed 8-29-2013\r\n\r\n3. Operating procedures:\r\nFASKEN has developed and implementing written operating procedures that provide clear instructions for safely conducting plant activities. The procedures are available for all routine and non-routine activities performed at the plant including, startup, normal operations, shutdown, temporary operations, and emergency operations. Operating procedures also describe safety, health and environmental considerations, the operating limits, consequences of deviation and steps required to correct or avoid deviation. FASKEN will make sure that procedures are readily accessible to those who operate or maintain a process.\r\n\r\n4. Training:\r\nTraining is imparted to each employee involved in operating the process, before being involved in the process. The training has an emphasis on the specific health and safety hazards, emergency operations including shutdown, and applicable safe work practices. Refresher training is provided to each employee every three year or earlier if needed. Documentation is performed to make sure that each employee, involved in operating a process has received and verified through testing that each employee understands the training imparted. \r\n\r\n5. Mechanical Integrity:\r\nMechanical Integrity program is developed for the process equipments i.e. Process vessels, tanks, piping, relief devices and systems, emergency shutdown devices and systems, controls and pumps. Written (maintenance) procedures are developed and implemented and training is being imparted to the maintenance employees to support the facility Mechanical Integrity program. \r\nInspection and testing is performed on process equipment, following recognized and generally accepted good engineering practices and consistent with manufacturer's recommendations an"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000085804,
      "SummaryText": "d applicable codes. Inspection results are documented and deficiencies are corrected in a safe and timely manner. \r\n\r\nFASKEN assures that maintenance materials, spare parts and equipment are suitable for the process application for which they will be used.  The construction/fabrication of the new plants and equipments is performed such that they are suitable for the process application for which they will be used. \r\n6. Management of Change:\r\nFASKEN makes sure that the changes to the documented Process Safety Information (PSI) package are reviewed and approved before being implemented as required by Process Safety Management (PSM) regulations OSHA 29 CFR 1910.119. These changes include changes in process chemicals, technology, equipment and document changes and excludes replacement in kind. This procedure assures that the following considerations are addressed prior to any change:\r\n¿\tPurpose of the change\r\n¿\tThe technical basis for the proposed change \r\n¿\tImpact of change on health, safety and environment aspects \r\n¿\tModifications to operating procedures \r\n¿\tNecessary time period for the change \r\n¿\tTraining and communication requirements\r\n¿\tAuthorization requirements for the proposed change at the facility i.e. change in the process chemicals, technology, equipment, and procedures, and changes to stationary sources that affect a covered process. \r\n\r\n7. Pre-Startup Safety Review:\r\nFASKEN performs pre-startup safety reviews for any change in the facility, process chemicals, technology, equipment and procedure (not including replacement in kind). This procedure is intended to confirm, prior to the startup of a new or modified equipment / facility that\r\n¿\tConstruction is in accordance with design specifications.\r\n¿\tThe facility is safe to startup, operate and maintain.\r\n¿\tProcess Hazards Analysis (PHA) recommendations addressed and requirements contained in management of change, 68.75 have been met.\r\n¿\tElements of PSM have been appropriately addressed such as; training o"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000085804,
      "SummaryText": "f each employee involved in operating a process has been completed.\r\n8. Compliance Audits:\r\nA system is in place to perform audits to certify that compliance with the provisions of this subpart at least every three years has been evaluated. FASKEN will also verify that procedures and practices developed under this subpart are adequate and are being followed.\r\nThe compliance audits are conducted by at least one person knowledgeable in the process. A report of the findings of the audit is developed and recommendation with a corrective action is generated. FASKEN will track the recommendations and document the close out status of each. The last two audit reports will be retained for record purpose.\r\n\r\n9. Incident Investigation:\r\nFASKEN will investigate each incident that resulted in, or could have resulted in, catastrophic release of highly hazardous chemical. Investigation shall be initiated as promptly as possible but no later than 48 hours of the incident. An investigation team shall be established with at least one personnel who is trained in the procedure. At the end of the investigation a report shall be generated, which contains findings and corrective actions. A system is in place to track the corrective actions. Report shall be reviewed with all affected personnel whose job tasks are relevant to findings. Reports shall be retained for 5 years.\r\n\r\n10. Hot Work Permit:                                         \t\t\t\t\t\t\t\r\nA comprehensive work permit system is in place to ensure that jobs are safely planned, equipment is properly prepared, employees are adequately informed and work is safely executed. Some of the features of this system are; specific description of all the activities for which work permit is required with validity timing, gas test requirement, safety precautions, hazards, and protective equipment to be used. Refresher training for the employees is imparted on a regular basis. \r\n\r\n11. Emergency Planning and response:\r\nPer CFR-68-90, FASKEN employees ar"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000085804,
      "SummaryText": "e not required to respond to the accidental releases of the regulated substances. However, in case of a grave emergency, FASKEN has developed an emergency preparedness program, which includes shutdown the process in safest possible manner, helping and coordinating the rescue/mitigation efforts if needed and training requirements. It also lays down the procedure to coordinate with local authorities. \r\n\r\n12. Contractors:\r\nFASKEN lays down both company's and contractors' responsibilities to meet a common safety goal. FASKEN evaluates and awards contracts on the basis of previous safety performance. It is FASKENS responsibility to fill contract employee injury logs and illness log related to the contractor's work in process area. Contractor assures that each employee is trained in his/her job function and safe execution of it."
    }
  ]
}