{
  "FacilityID": 1000037465,
  "FacilityName": "Yauco Filtration Plant",
  "FacilityStr1": "Carr. 128 Km 2.6",
  "FacilityStr2": "Diego Hernandez Ward",
  "FacilityCity": "Yauco",
  "FacilityState": "PR",
  "FacilityZipCode": "00698",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "72153",
  "LEPC": "Ponce",
  "FacilityLatDecDegs": "18.051139",
  "FacilityLongDecDegs": "-66.853361",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G2",
  "LatLongDescription": "LC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Puerto Rico Aqueduct and Sewer Authority",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "PRASA",
  "OperatorStr1": "PO Box 7697",
  "OperatorStr2": null,
  "OperatorCity": "Ponce",
  "OperatorStateFIPS": "PR",
  "OperatorZipCode": "00732",
  "OperatorZipCodeExt": null,
  "RMPContact": "Irma M. Lopez santos",
  "RMPTitle": "Executive Compliance Director",
  "FTE": 11,
  "OtherEPAFacilityID": "PRD980535421",
  "EPAFacilityID": "100000171798",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Unknown",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2014-09-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-09-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2014-09-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-05-22 00:00:00",
  "DeRegistrationEffectiveDate": "2017-01-10 00:00:00",
  "AnniversaryDate": "2019-09-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.2.5",
  "FRS_Lat": 18.05114,
  "FRS_Long": -66.85336,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) STANDARD POSITION (SA ON)",
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045900,
      "AltID": "Chlorine injection/stor.",
      "FacilityID": 1000037465,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000058590,
          "ProcessID": 1000045900,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000055522,
          "ProcessID": 1000045900,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000555522,
          "ProcessID": 1000045900,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000037465,
      "SummaryText": "Yauco Filtration Plant is located at the PR-128 Km 2.6, Bo. Diego Hernandez, Yauco, Puerto Rico 00698.  This water treatment plant is owned by Puerto Rico Aqueducts and Sewer Authority (PRASA) which is a Government Agency.\n\n\n\nPRASA has developed the RMP following the Program #3 for the Management and Prevention of Risks associated with the storage and handling of the toxic substance used as for water disinfection:  Chlorine.  The RMP was prepared in compliance with EPA 40 CFR Part 68.  The prevention program was prepared in accordance with OSHA Process Safety Management (PSM) regulation as established in 29 CFR Part 1910.119.\n\n\n\nAccidental Release\n\nIt is PRASA policy to comply with EPA and OSHA Federal and Puerto Rico applicable requirements.  Chlorine is a toxic substance regulated by EPA, for that reason Yauco Filtration Plant is already observing required engineering controls.  Changes have been put in place to improve safety and as a part of the Prevention Plan implanted to protect the wellness of workers, employees, contractors, visitors and immediately surrounding areas and inhabitants.\n\n\n\nThe Stationary Source and Regulated Substance handled\n\nYauco Filtration Plant is located close to the area where the plant supplies the potable water.  The Chlorine is used as a disinfectant to destroy the microorganism that could cause illness in humans.  The Chlorine is delivered from the PRASA storage center in Puerto Nuevo to the plant in 1 ton containers.  Yauco Filtration Plant may has a storage maximum weight of 16,000 pounds distributed in 8 containers.  Two containers are connected to the vacuum operated chlorinator valves and through one of them, the dosified chlorine flows to the ejectors where the chlorine is combined with water and then sent to the injections points in the process of the plant.\n\n\n\nWorst Case Scenario\n\nThe Worst Case Scenario was determined as indicated in the EPA Wastewater Treatment Plant, as per Appendix F, Supplemental Risk Management Program"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000037465,
      "SummaryText": " Guidance for Waste Water Treatment Plants.  This guidance considers the release of the Chlorine Gas of the entire container (2000 pounds) during 10 minutes and other specifications related to the weather conditions and a radio of 1.3 miles, for a Chlorine concentration equal of higher than 3 ppm, which is the American Industrial Hygiene Association exposure limit above which it is determined human health will be affected.\n\n\n\nUsing Marplot and the US Census 2010, it was identified that 13,844 residents are inside the 1.3 miles radio.  The main concern is the proximity of the Diego Hernandez School to the chlorine area of the plant.  It was used ALOHA to simulate and map the gas dispersion.\n\n\n\nAlternative Case Scenario:\n\nThe more realistic scenario was also simulated as per EPA Wastewater Treatment Plants parameters, as a release of the total content of a 2000 pounds container, but throughout a valve leak.  In the alternative case the end point distance is specified as 0.1 miles and there are no receptors according actual conditions around the plant.\n\n\n\nGeneral Accident Release Prevention Program\n\nPRASA is actually close to implement a Prevention Plan to ensure the maintenance and mechanical integrity of the facilities which will improve significantly the safety scope of the current prevention plans.  Different Standard Operational Procedures (SOP) are already in place to comply the OSHA and PROSHO requirements in order to keep all the involved parties aware of the hazardous and risk related to the chlorine.  List of all SOP are indicated in the PSM report and are located in the plant.\n\n\n\nEmergency Response Programs\n\nPRASA has various SOPs to manage emergency programs associated to a release of the chemical and also related to the emergency actions to be taken before and after hurricanes and other atmospherics events.\n\n\n\nFive Years Accident History\n\nNo mayor release of chlorine in excess of 10 pounds has been reported during the last five years.\n\n\n\nPlanned Changes to"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000037465,
      "SummaryText": " Improve Safety\n\nPRASA has already implemented in Yauco Filtration Plant, a vacuum operated system to improve process control and the safety of the chlorine handling and storage.\n\n"
    }
  ]
}