{
  "FacilityID": 1000026097,
  "FacilityName": "ALTIVIA Marlow OK Warehouse",
  "FacilityStr1": "4868 Highway 81",
  "FacilityStr2": null,
  "FacilityCity": "Marlow",
  "FacilityState": "OK",
  "FacilityZipCode": "73082",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "40051",
  "LEPC": "Grady County LEPC",
  "FacilityLatDecDegs": "34.732825",
  "FacilityLongDecDegs": "-97.959059",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "AO",
  "LatLongDescription": "PC",
  "FacilityURL": "www.altivia.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "ALTIVIA CORPORATION",
  "Company2Name": null,
  "CompanyDUNS": 619719677,
  "Company2DUNS": 0,
  "OperatorName": "ALTIVIA Corporation",
  "OperatorStr1": "1100 Louisiana, Suite 3160",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Sterling",
  "RMPTitle": "General Manager - Manufacturing",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000216964",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-01-24 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-01-24 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-01-24 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-05-09 00:00:00",
  "DeRegistrationEffectiveDate": "2013-05-06 00:00:00",
  "AnniversaryDate": "2017-01-24 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000031994,
      "AltID": "Chlorine Storage",
      "FacilityID": 1000026097,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000032288,
          "ProcessID": 1000031994,
          "NAICSCode": "42469",
          "_desc": {
            "NAICS_CODE": "42469",
            "NAICS_DESCRIPTION": "Other Chemical and Allied Products Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000038952,
          "ProcessID": 1000031994,
          "ChemicalID": 62,
          "Quantity": 50000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000538952,
          "ProcessID": 1000031994,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000026097,
      "SummaryText": "ALTIVIA Corporation operates a warehouse located in Marlow, OK where full 2000lb chlorine containers and 150lb chlorine cylinders are stored inside the warehouse facility. The Marlow warehouse does not use, manufacture, or process chlorine. This site is used by ALTIVIA for purposes of warehousing and distribution of packaged water treatment chemicals including chlorine. This site is managed and operated by 2 full time employees (driver and warehouse manager)and reports to the Area Operations Manager.\n\n\n\nALTIVIA maintains and manages its chlorine inventory on a daily basis. Full chlorine cylinders and containers are recieved from the ALTIVIA facility in Houston, TX and stored until needed by customers located in proximity to the Marlow, OK warehouse. When ALTIVIA delivers full chlorine packages to the customer site, empty packages are picked up and returned to the Marlow warehouse. Empty chlorine packages are returned to the ALTIVIA Houston, TX production facility when ALTIVIA drops off full packages at the Marlow warehouse.\n\n\n\nThe ALTIVIA facility follows regulations established by the DOT, Department of Homeland Security, OSHA, EPA, etc. that govern safe handling, storage, and transportation of chlorine cylinders and containers. This facility is subject to the requirements of the EPA RMP program, but is exempt from the requirements of the OSHA PSM due its status as a \"retail facility\" under 1910.119(a)(2)(i).\n\n\n\nThe Marlow facility has established operating procedures, maintenance programs, and performed hazard reviews according to both RMP rules and industry standard practices; specifically noted practices in Chlorine Institute pamphlets 1,17,65,91 and other publications. These help ALTIVIA minimize the likelihood of releases.\n\n\n\nALTIVIA has developed and Emergency Response Plan that details the steps that the Marlow warehouse will take in the event of an emergency situation which includes a chlorine release at the facility. This includes roles of both internal (A"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000026097,
      "SummaryText": "LTIVIA personnel) and external (LEPC) responders. ALTIVIA has developed methods of effectively identifying potential for chlorine release before they occur utilizing physical inspections and rounds in addition to localized monitoring of the chlorine storage area on a daily basis. ALTIVIA maintains proper HAZWOPER and application training for its employees along with the proper response equipment to effectively minimize/mitigate a chlorine leak on a ton container or cylinder. ALTIVIA currently maintains a cylinder recovery vessel, \"A\" Kit, \"B\" Kit, and SCBAs on the Marlow site for use in response to a chlorine incident.\n\n\n\nThis facility is a new site being placed into operation January 2012 in replacement of the ALTIVIA facility located in Choctaw OK. The Marlow facility has never had any release or incidents. The Choctaw site (EPA ID#10000047353) will be decommissioned as it was a leased warehouse and will no longer house any ALTIVIA materials or property including chlorine.\n\n\n\nAs ALTIVIA grows, we are continually looking for new and improved methods to ensure safety of our personnel and community. These changes can only occur with continued input and support of our personnel, regulatory agencies, and our community.\n\n\n\nWorst Case Scenario - Chlorine Release\n\nThe worst case scenario for the Marlow OK facility is the release of the entire contents of the single largest container over 10 minutes. For the Marlow facility, the largest chlorine vessel contains 2000 lbs of chlorine liquified under pressure. ALTIVIA has determined that the land use around the facility qualifies as Rural due to the lack of terrain or structures near the facility. All full chlorine ton containers and cylinders are stored inside of the building and is considered a mitigation measure impacting the release.\n\n\n\nUsing the EPA RMP Comp Ver 1.07 tool along with MARPLOT, the distance to toxic endpoint of 0.087 ug/m3 of chlorine is 2.2 miles.\n\n\n\nAlternate Release Scenario - Chlorine Release \n\nALTIVIA "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000026097,
      "SummaryText": "has determined an alternate case scenario as a valve leak from a 150lb chlorine cylinder. The leak is assumed to occur out of a 1/4\" diameter opening with the release to occur inside the warehouse. Using RMP Comp and EPA OCA Guidance Lookup Table #24, the release rate would be 5 lb/min with a duration of 30 minutes. This assumes a constant release rate at constant pressure. The distance to toxic endpoint of chlorine is calculated at 0.1 miles as per RMP Comp.    "
    }
  ]
}