{
  "FacilityID": 1000056889,
  "FacilityName": "Calcasieu Refining Company",
  "FacilityStr1": "4359 West Tank Farm Road",
  "FacilityStr2": null,
  "FacilityCity": "Lake Charles",
  "FacilityState": "LA",
  "FacilityZipCode": "70605",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22019",
  "LEPC": "Calcasieu Parish LEPC",
  "FacilityLatDecDegs": "30.1325",
  "FacilityLongDecDegs": "-93.320278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G5",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 118488154,
  "ParentCompanyName": "Transworld Oil USA, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 58754722,
  "Company2DUNS": 0,
  "OperatorName": "Calcasieu Refining Company",
  "OperatorStr1": "4359 West Tank Farm Road",
  "OperatorStr2": null,
  "OperatorCity": "Lake Charles",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70605",
  "OperatorZipCodeExt": null,
  "RMPContact": "Bruce Hubbard",
  "RMPTitle": "Environmental Manager",
  "FTE": 122,
  "OtherEPAFacilityID": "3585",
  "EPAFacilityID": "100000071469",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "0520-00050-V8",
  "SafetyInspectionDate": "2015-08-27 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-04-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-04-15 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-04-15 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-04-15 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.12455,
  "FRS_Long": -93.3108,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "4",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000071039,
      "AltID": "NAPHTHA STAB LPG STORAGE",
      "FacilityID": 1000056889,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000072242,
          "ProcessID": 1000071039,
          "NAICSCode": "32411",
          "_desc": {
            "NAICS_CODE": "32411",
            "NAICS_DESCRIPTION": "Petroleum Refineries"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087770,
          "ProcessID": 1000071039,
          "ChemicalID": 155,
          "Quantity": 370533.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000074944,
              "ProcessChemicalID": 1000087770,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074945,
              "ProcessChemicalID": 1000087770,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074946,
              "ProcessChemicalID": 1000087770,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074947,
              "ProcessChemicalID": 1000087770,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000074948,
              "ProcessChemicalID": 1000087770,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000587770,
          "ProcessID": 1000071039,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056889,
      "SummaryText": "3585 LDEQ Facility ID Number\n\n\n\n1.0    EXECUTIVE SUMMARY\n\n\n\n1.1   Accidental Release Prevention and Emergency Response Policies\n\n\n\nCalcasieu Refining Company (CRC) operates a petroleum refinery located about five miles southwest of Lake Charles, Louisiana in Calcasieu Parish.  Parts of the operations at this facility involve the distillation and storage of liquefied petroleum gas (LPG) and are subject to the Chemical Accident Prevention Provisions located in Part 68 of Title 40 of the Code of Federal Regulations (i.e., 40 CFR 68).\n\n\n\nCRC is strongly committed to protecting its employees, the public, and the environment.  As part of this commitment, CRC maintains an operational policy that requires compliance with all applicable federal, state, and local regulations.  Significant resources have been used to implement a robust Process Safety Management (PSM) program that is compliant with 29 CFR 1910.119 and, more importantly, is continually being improved to further reduce the potential for an accidental chemical release.  CRC's PSM program addresses all 14 elements of PSM including those elements listed in 40 CFR 68 Subpart D.  Several years ago, CRC established an HSE committee with a PSM subcommittee.  The PSM subcommittee is comprised of hourly and salary personnel from departments throughout the company.  This group meets once a month and works to identify and implement further improvements to our PSM program.   \n\n\n\nCRC's Emergency Response Plan meets or exceeds the requirements as set forth in 40 CFR 68.95 (Risk Management Rule, Subpart E - Emergency Response), 29 CFR 1910.119(n) (Process Safety Management of Highly Hazardous Chemicals) and 29 CFR 1910.38(a) (OSHA's Emergency Action Plans Regulation).  The primary objective of the Emergency Response Plan is to address what action CRC employees should take in the event of an accidental release of hazardous chemicals.  The Emergency Response Plan contains emergency notification procedures and telephone numbers for t"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056889,
      "SummaryText": "he local fire district and other agency contacts (e.g., Calcasieu LEPC).  As part of its Risk Management Program, CRC has implemented an automatic calling service that notifies Calcasieu Refining personnel if an emergency upset has the potential to cause an off-site impact.\n\n  \n\nCalcasieu Refining Company (CRC) operates a petroleum refinery consisting of 2 atmospheric distillation units, a vacuum unit, 2 naphtha stabilizer units, supporting utility units (e.g. wastewater treatment), a products pipeline, a natural gas pipeline  and various transfer operations (e.g., loading of naphtha product to barges).  The facility operates 24 hours a day and may process up to approximately 90,000 barrels per day of crude oil.  The CRC facility meets the definition of stationary source as contained in 40 CFR 68.3.\n\n\n\nBased on a thorough review of the CRC facility there is only one affected process with a regulated substance (RS) present above its threshold quantity.  This process is the distillation and storage of LPG in storage tanks TK-2001A/B.  LPG is a mixture of various hydrocarbon compounds including propane, butane, and pentane.  The entire LPG mixture is considered to be a RS because it has a NFPA flammability hazard rating of four (4).  The LPG contains the following listed RSs: methane (0.2 weight percent), ethane (1.6 weight percent), propane (11.98 weight percent), isobutane (9.5 weight percent), normal butane (22.0 weight percent), isopentane (20.5 weight percent), normal pentane (19.3 weight percent), and heavy hydrocarbons (15.1 weight percent).  \n\n\n\nThe CRC facility does not have any processes that contain toxic RSs in amounts or conditions that warrant review under the Chemical Accident Prevention Provisions.  For example, hydrogen sulfide (CAS number 7783-06-4) is present in the crude oil in concentrations less than one percent by weight of the mixture.  Therefore, under the mixture rule, the amount of hydrogen sulfide in the mixture is not subject to the review."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056889,
      "SummaryText": "  Other flammable mixtures present in the facility have an NFPA flammability rating of three or less and are; therefore, exempt under the mixture rule.  For example, naphtha has an NFPA rating of three (3), kerosene has an NFPA rating of two (2), diesel has an NFPA rating of two (2), and reduced crude has an NFPA rating of one (1).\n\n\n\n1.2   Five-Year Accident History\n\n\n\nFor the five years prior to the submittal of this RMP update there have been no accidental releases that resulted in deaths, injuries, or significant on-site property damage.  Furthermore, there have been no accidental releases that caused known off-site deaths or injuries, required local residents to evacuate or shelter-in-place, caused property damage, or damaged the environment.\n\n\n\n1.3   Emergency Response Program\n\n\n\nCRC has a written emergency response plan that addresses accidental releases of hazardous substances.  The plan is protective of human health and the environment and includes the following elements:\n\n\n\n?<    an evaluation of plant risk,\n\n?<    an evaluation of area risk,\n\n?<    notification procedures and an explanation of the communication systems,\n\n?<    a listing of emergency equipment and facilities,\n\n?<    a description of emergency response training and drills,\n\n?<    a listing of Emergency Coordinators,\n\n?<    an equipment testing program,\n\n?<    emergency response procedures,\n\n?<    procedures for returning to normal procedures, and\n\n?<    a method for documenting updates to the plan and results of drills and tests.\n\n\n\n\n\n\n\n\n\n\n\nCRC's emergency response plan meets or exceeds the requirements set forth in 40 CFR 68.95 (Risk Management Rule, Subpart E - Emergency Response) and 29 CFR 1910.119(n) (OSHA Process Safety Management of Highly Hazardous Chemicals).  CRC has coordinated its emergency response program with the local fire department and will promptly provide to the Calcasieu Parish LEPC any information needed to implement the community emergency response plan.\n\n\n\n1.4   Recent and Planned Changes to Impr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000056889,
      "SummaryText": "ove Safety\n\n\n\nSeveral developments and findings have resulted from the implementation of the various elements of CRC's PSM program.  Actions taken under this program have already improved the safety of the LPG storage process.\n\n\n\nCRC's LPG system includes emergency shutdown systems, LEL monitors, a deluge system, and PSVs.  Truck loading operation has remained available as back up to high-pressure transfer pumps and the pipeline. The truck station and connecting lines were relocated to be greater than 50 feet from the LPG Storage Tanks. Whenever the LPG pipeline is down the LPG is transported to our customer in tank trucks. \n\n \n\nSeveral modifications related to the LPG storage tanks have been made in the past two years to comply with the API 2510 Standard. These include but are not limited to:\n\n\n\n?<    Modified spill containment to insure product drains away from the storage tanks in the event of a release.\n\n?<    Ball-type shutoff valves placed on the tank nozzle to enhance tank safety\n\n?<    Fire valves that close automatically in a fire case and actuators for remote operation were installed\n\n?<    Backflow check valves were installed on dedicated vessel fill piping.\n\n?<    The pumps, thermal relief device and block valves in the path of relief were car sealed open\n\n?<    Structural and piping supports have been fireproofed.\n\n              \n\nCRC will be conducting a third party PSM/RMP audit in the third quarter of 2016.  Any findings requiring action will be documented and tracked to completion.  \n\n\n\n\n\n"
    }
  ]
}