{
  "FacilityID": 1000059964,
  "FacilityName": "Taylor Fresh Foods, Inc.",
  "FacilityStr1": "1085 Abbott Street",
  "FacilityStr2": null,
  "FacilityCity": "Salinas",
  "FacilityState": "CA",
  "FacilityZipCode": "93901",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06053",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "36.656639",
  "FacilityLongDecDegs": "-121.632611",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "taylorfarms.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Taylor Fresh Foods",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Taylor Farms Retail, Inc.",
  "OperatorStr1": "1275 Hansen Street",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92901",
  "OperatorZipCodeExt": "5909",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000143052",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-10-06 00:00:00",
  "SafetyInspectionBy": "KIE Consultants",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-09-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-09-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2021-08-06 00:00:00",
  "DeRegistrationEffectiveDate": "2021-07-16 00:00:00",
  "AnniversaryDate": "2021-09-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 36.656639,
  "FRS_Long": -121.632611,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074894,
      "AltID": "Main Plant Refrigeration",
      "FacilityID": 1000059964,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092621,
          "ProcessID": 1000074894,
          "ChemicalID": 56,
          "Quantity": 27000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000076056,
          "ProcessID": 1000074894,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000062940,
              "Process_NAICS_ID": 1000076056,
              "SafetyReviewDate": "2015-10-07 00:00:00",
              "PHA_Date": "2018-12-31 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2014-11-19 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Operator error, no flow, low level, lack of maintenance, design deficiency, physical damage, & vandalism/terrorism",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Water Diffusion Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-09-05 00:00:00",
              "TrainingReviewDate": "2016-09-05 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Tailgates",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-10-05 00:00:00",
              "EquipmentInspectionDate": "2015-10-06 00:00:00",
              "EquipmentTested": "Operational Refrigeration Equipment",
              "ChangeMgmtDate": "2015-01-02 00:00:00",
              "ChangeMgmtReviewDate": "2015-10-05 00:00:00",
              "PreStartupReviewDate": "2015-01-02 00:00:00",
              "ComplianceAuditDate": "2015-05-15 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-10-05 00:00:00",
              "HotWorkPermitReviewDate": "2015-10-05 00:00:00",
              "ContractorSafetyReviewDate": "2015-10-05 00:00:00",
              "ContractorSafetyEvalDate": "2015-10-05 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000077059,
                  "PreventionProgram3ID": 1000062940,
                  "ProcessChemicalID": 1000092621
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000059964,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-04-15 00:00:00",
    "ERTrainingDate": "2015-04-08 00:00:00",
    "CoordinatingAgencyName": "Monterey County Environmental Healt",
    "CoordinatingAgencyPhone": "8317554971",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000059964,
      "SummaryText": "umps, cold room evaporative cooling coils, ammonia detection, control systems and diffusion tank. There are also three 510 gal and one 1000 gal nurse tanks that are not connected to the fixed system. Each nurse tank is approximately 75% full. Facility has total of five cold storage rooms and except cold rooms 2 & 3, each cold room served by dedicated low pressure recirculating pump package. Cold Room 2 & 3 served by the same recirculating pump package. Currently facility operates only Cold Room 1.  Cold Room 2 fan coils are pressurized by ammonia gas but room is not being used All the remaining cold rooms and related recirculating pump packages and room fan coils are pumped down and valved off. Facility remains operational all year. Most of the refrigeration equipment are located indoors. Two of the recirculator packages, condensers and nurse tanks are located outdoors. Mechanical room houses all of the compressors, high pressure receiver, two recirculator pump packages and control system. All compressors have safety switches that would shut down the compressors upon detection of unsafe operating conditions. Refrigeration control system sends alarms to refrigeration manager in case of emergency situation or any high pressure, high temp or ammonia detection . All pressure vessels and compressors are protected against high-pressure situations by safety relief valves. There are ammonia detectors in the cold rooms and mechanical room for alarming. There are assigned responders experienced with ammonia refrigeration that would respond to and determine specific actions for any incident. The refrigeration systems at the facility were constructed as per applicable codes and industry standards at the time of construction. The total ammonia charge of the refrigeration systems at the facility is approximately 27,000 lb. Refrigeration drawings are located in Appendix A.2-System Drawings of the RMP binder. A list of refrigeration equipment used at this facility can be found in A"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000059964,
      "SummaryText": "ation deadlines are also recommended. All refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Most of the safety concerns regarding the refrigeration system is seismic related. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000059964,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\r\nTaylor Fresh Foods, Inc. conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required. On-site personnel provide initial emergency response. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. Refrigeration contractors would also be on-call to provide emergency response. Emergency response training will be conducted yearly for current employees and as required to for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\r\n\r\n2. Stationary Source and Regulated Substances Handled\r\nTaylor Fresh Foods, Inc. uses anhydrous ammonia as a refrigerant in their operations. See Appendix A.2 in the hardcopy RMP binder located onsite for the drawings showing the facility location map and site plan. The ammonia system is used for cold storage of finished goods and various value adding products such as salad dressings. There is no processing operation at the facility. All of the refrigeration system equipment at the facility is  part of a single fixed system. Facility has also four  nurse tanks for ammonia storage but they are not part of the fixed system. Fixed system includes, screw and reciprocating type compressors, evaporative condensers, pressure vessels, ammonia p"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000059964,
      "SummaryText": "ppendix F of the RMP binder. Refrigeration equipment locations can be found on the plans. International Institute of Ammonia Refrigeration (IIAR) Ammonia Refrigeration Safety Inspection Checklists, located in Appendix A.1 in the RMP binder, describe equipment details. The refrigeration systems at this facility are single-stage vapor compression cycles. In general, the process chemistries for these systems are shown in Section V.A.2 in the hardcopy RMP located onsite. Anhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness of breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/ or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See Appendix A.4 in the RMP binderfor Material Safety Data Sheets (MSDS) for anhydrous ammonia.\r\n\r\n3. General Accidental Release Prevention Program\r\nTaylor Fresh Foods, Inc. maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release, see Appendix J-Incident Investigation in the hardcopy RMP binder. The ammonia refrigeration system has specific safety procedures to prevent a release. Operators, contractors and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. There are emergency shut-off switches outside the mechanical room for shutting down the system. Ammonia detectors are installed in all refrigerated rooms and the mechanical room. Personnel will automatic"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000059964,
      "SummaryText": "ally be notified if any detector exceeds its set point. Monitoring is done 24 hours per day. An emergency control box and diffusion tank allows system pressure to be relieved manually. All of the relief valves at the facility and the vacuum cooling systems are tied into an ammonia diffusion tank to prevent high-pressure releases to ambient.\r\n\r\n4. Five-Year Accident History\r\nAccording to Taylor Fresh Foods, Inc. personnel, there has been no releases of anhydrous ammonia since they occupy the facility in July 2015. According to previous owner's records there has been no ammonia release at the facility in the last 5 years. \r\n\r\n5. Emergency Response Program\r\nIn event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Safety Coordinator is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by the release. The Safety Coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required. A description of the emergency response plan is included in Appendix N in the hardcopy RMP binder.\r\n\r\n6. Planned Changes to Improve Safety\r\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed on the tables located in Section VIII. The table items are a result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, and a Safety Inspection performed by a qualified person. Some corrective items in the recommendation table originate from multiple codes but are listed only once. Specific facility areas and systems categorize recommendations resulting from the Safety Inspection; some of which may repeat general Process Hazard Analysis and Code Compliance Review items. Based on the severity of the hazards identified, implement"
    }
  ]
}