{
  "FacilityID": 1000014676,
  "FacilityName": "U.S. ARMY FORT BRAGG",
  "FacilityStr1": "DPW ENV. COMPLIANCE BRANCH",
  "FacilityStr2": "BLDG 2175 REILLY ROAD, STOP A",
  "FacilityCity": "FORT BRAGG",
  "FacilityState": "NC",
  "FacilityZipCode": "28310",
  "Facility4DigitZipExt": "5000",
  "FacilityCountyFIPS": "37051",
  "LEPC": "Cumberland County LEPC",
  "FacilityLatDecDegs": "35.18812",
  "FacilityLongDecDegs": "-079.0082",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "U.S. DEPARTMENT OF DEFENSE",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "GREGORY BEAN",
  "OperatorStr1": "DIRECTORATE OF PUBLIC WORKS",
  "OperatorStr2": "BUILDING 3-1631",
  "OperatorCity": "FORT BRAGG",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28310",
  "OperatorZipCodeExt": "5000",
  "FTE": 71238,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113254",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "04379T31",
  "SafetyInspectionDate": "2010-01-13 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-07-13 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-07-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-07-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2013-03-04 00:00:00",
  "DeRegistrationEffectiveDate": "2013-01-17 00:00:00",
  "AnniversaryDate": "2015-07-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.19111,
  "FRS_Long": -79.01,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R08",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018405,
      "AltID": "WASTEWATER TREATMENT",
      "FacilityID": 1000014676,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021828,
          "ProcessID": 1000018405,
          "ChemicalID": 62,
          "Quantity": 14000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000018727,
          "ProcessID": 1000018405,
          "NAICSCode": "92811",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000015117,
              "Process_NAICS_ID": 1000018727,
              "SafetyReviewDate": "2009-04-06 00:00:00",
              "PHA_Date": "2009-04-06 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": null,
              "MH_ToxicRelease": 1,
              "MH_Fire": 0,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 0,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 0,
              "PC_AutomaticShutoffs": 0,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 1,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2010-02-01 00:00:00",
              "TrainingReviewDate": "2009-04-06 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-04-06 00:00:00",
              "EquipmentInspectionDate": "2009-04-06 00:00:00",
              "EquipmentTested": "process equipment",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-04-06 00:00:00",
              "PreStartupReviewDate": "2009-04-06 00:00:00",
              "ComplianceAuditDate": "2009-06-19 00:00:00",
              "AuditCompletionDate": "2009-07-20 00:00:00",
              "IncidentInvestigationDate": "2007-04-06 00:00:00",
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-04-06 00:00:00",
              "HotWorkPermitReviewDate": "2009-04-06 00:00:00",
              "ContractorSafetyReviewDate": "2009-04-06 00:00:00",
              "ContractorSafetyEvalDate": "2009-04-06 00:00:00",
              "CBI_Flag": 0,
              "Description": "An accidental release prevention program is in place at Fort Bragg to minimize the risk of hazardous chemical releases at the WWTP.  Specific elements of the Level 3 program include the following:\n\n    Process Safety Information (PSI)\n    Process Hazard Analysis (PHA)\n    Operating Procedures\n    Training\n    Mechanical Integrity\n    Management of Change\n    Pre-startup Review\n    Compliance Audits\n    Incident Investigation\n    Employee Participation\n    Hot Work Permits\n    Contractors\n\nUp-to-date safety information enables supervisors and employees of covered processes to identify and understand hazards involved in the process.  The PSI compilation includes information on the hazards of the regulated substance, information regarding the technology of the process, and technical information on the equipment in the process.\n\nThe PHA was updated for the WTP and WWTP by URS on April 6-7, 2009.  The PHA update involves the systematic evaluation of the hazards posed by the regulated process.  URS used the What-if analysis method to analyze chlorine processes at the WTP and WWTP.  However, the WTP was closed March 31, 2010 and is no longer subject to RMP requirements.  The What-if methodology used to conduct the PHAs is consistent with requirements of the rule (40 CFR 68.67(b)).  The PHA study was performed to identify and document process hazards and preventive and mitigative measures.  In addition, URS made recommendations on measures that covered processes could take to further reduce risk of accidental release.  \n\nWritten Operating Procedures for each covered process were compiled and are maintained at the facility.  The Operating Procedures are available to all employees working in the process and must be reviewed annually to ensure currency.  The Operating Procedures are a compilation of standard operating procedures (SOPs), manufacturer operating procedures, and Chlorine Institute operating procedures.\n\nTraining in an overview of the process and the operating procedures for each process has been performed for each employee working in or maintaining that process.  This training consists of on-the-job training by the ORC at each plant.\n\nA Mechanical Integrity Program has been developed for equipment at the WWTP.  This program includes schedules for maintaining the good working order of process equipment, training for all employees performing maintenance on process equipment, regular inspection and testing of process equipment, prompt correction of equipment deficiencies, and appropriate checks and inspections to assure process equipment is of suitable fabrication and quality for its intended purpose.\n\nAny changes (except replacements-in-kind) to the process shall be reviewed prior to being implemented.  This procedure requires a review of changes by appropriate supervisory, maintenance, fire department, and environmental personnel for technical basis, impacts on safety and health, and changes to other portions of the RMP for the process. \n\nA Pre-startup Safety Review will be performed for any covered process anytime the process is modified enough to require a change in PSI.  The Pre-startup Safety Review will confirm construction and design specifications; safety, operating, maintenance, and emergency procedures are in place; PHA has been performed and resolved; and all employees working in the process have been trained. \n\nPeriodic Compliance Audits will be performed for covered processes to ensure adherence to procedures and practices required by the RMP.  These audits will be performed at least every three years by the Fort Bragg Safety Office.  The findings will be reported and actions taken to correct any deficiencies.  \n\nAn Incident Investigation procedure is in place at the WWTP to investigate any incident that resulted in, or could have resulted in catastrophic release of a regulated substance.  The cause of the incident will be investigated and recommendations for reducing the probability of such an incident in the future will be made.  Recommendations will be resolved as quickly as possible and the report shall be reviewed with all employees or contractors whose job tasks are relevant to the report findings.\n\nAn Employee Participation Plan should be implemented for covered processes at the WWTP to ensure that employees are included in conducting and developing the PHA and other elements of the RMP.  Additionally, the PHA and other RMP elements are made available to all employees working at the process.\n\nA Hot Work Permit will be obtained from the Fire Department anytime hot work (i.e., welding or brazing) is performed on covered processes.  The permit will document that fire prevention and protection measures have been taken into account prior to the work being performed.   \n\nThe process supervisor of the covered process will ensure that any contractor working on the process follows safe work practices and is informed of hazards and safety of the regulated substance and emergency response procedures.  The contractor will ensure that all employees under his care also follow safe practices and are informed of hazards of the regulated substance and emergency response procedures.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000018140,
                  "PreventionProgram3ID": 1000015117,
                  "ProcessChemicalID": 1000021828
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014676,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-04-06 00:00:00",
    "ERTrainingDate": "2009-04-06 00:00:00",
    "CoordinatingAgencyName": "FB Fire Department",
    "CoordinatingAgencyPhone": "9104320911",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014676,
      "SummaryText": "Section 112(r) of the Clean Air Act (CAA) Amendments of 1990 mandated the U.S. Environmental Protection Agency (EPA) to promulgate regulations to minimize the risk of accidental chemical releases.  EPA responded by publishing its Risk Management Program (RMP) rule on June 20, 1996.  The rule, codified at 40 Code of Federal Regulations (CFR) Part 68, requires subject facilities to formulate and implement measures to reduce the risk of an accidental chemical release.  Facilities are subject to the RMP rule if they have processes utilizing greater than a specified threshold quantity (TQ) of at least one of 77 air toxic or 63 flammable chemicals.\n\nSubject facilities are required to develop and implement a RMP and submit a Risk Management Plan (RMPlan) to regulatory authorities. The RMPlan serves as a summary document of the RMP for all covered processes at the facility, and information submitted in the RMPlan will be made available for public viewing.  In accordance with the requirements of 40 CFR 68.190(b), this document is a resubmission of the previous RMPlan submitted to EPA in 2009.\n\nFort Bragg is known primarily as the \"Home of the Airborne and Special Operations Forces\" and is home to the 82nd Airborne Division, the XVIII Airborne Corps, and Special Operations Command.  Fort Bragg is located in the southeast portion of North Carolina in Cumberland, Hoke, Harnett, Moore, Richland, and Scotland Counties.  The XVIII Airborne Corps and Fort Bragg has one process that utilizes chemicals in excess of its specified TQ.  This process involves chlorine storage, handling, and use at the Wastewater Treatment Plant (WWTP).  The Water Treatment Plant (WTP), previously subject to RMP requirements, was closed on March 31, 2010 and is no longer subject to the RMP requirements.\n\nBased on criteria outlined at 40 CFR 68.10, Fort Bragg has developed and implemented a Program Level 3 RMP compliant with EPA requirements for this process.  In the fall of 2006, American Water Services, "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014676,
      "SummaryText": "a private contractor, took over the daily operations of the WTP and WWTP.  However, the XVIII Airborne Corps and Fort Bragg have retained ownership of the plants and associated equipment.  The RMP for the WTP and WWTP was adopted by American Water Services on December 28, 2006.  The WTP is no longer subject to RMP requirements; however, the WWTP still has a process that utilizes chemicals in excess of its specified TQ and is still subject to RMP requirements.\n\nA worst-case release analysis and an alternative release analysis were performed using RMPComp, Version 1.07.  Results of the worst-case analyses indicate that the area of concern would be a 1.3 mile radius emanating from the WTP and WWTP, potentially impacting 2,900 and 4,800 people, respectively.  Results of the alternative release scenarios indicate that the area of concern would be a 0.2 mile radius emanating from the WTP and WWTP, potentially impacting 20 and 8 people, respectively.\n\nAs part of the Hazard Assessment, the five-year history of all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage, must be included.  Interviews with personnel at the WTP, WWTP, Environmental Compliance Branch, and Fire Department indicate that there have been four incidents in the past five years that occurred at the WTP.  These incidents occurred on 16 March 2005, 13 February 2007, 14 February 2007, and 6 April 2007, and did not result in any significant property damage on site, or known offsite deaths or injuries.  As the WTP is no longer subject to RMP requirements, effective March 31, 2010, these incidents have been removed from the RMP.  The WWTP is still subject to RMP requirements; however, there have been no incidents at this facility within the past 5 years. \n\nThe Risk Management Program at Fort Bragg has developed and implemented a comprehen"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014676,
      "SummaryText": "sive program to promptly respond to a toxic or flammable substance release to minimize injuries, lessen the impact to the surrounding community, minimize environmental impacts, and provide guidance to local emergency response personnel.  "
    }
  ]
}