{
  "FacilityID": 1000051419,
  "FacilityName": "Paulding Terminal",
  "FacilityStr1": "7506 US Route 127",
  "FacilityStr2": null,
  "FacilityCity": "Paulding",
  "FacilityState": "OH",
  "FacilityZipCode": "45879",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39125",
  "LEPC": "Paulding County LEPC",
  "FacilityLatDecDegs": "41.084777",
  "FacilityLongDecDegs": "-84.571838",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "GROWMARK, INC.",
  "OperatorStr1": "1701 Towanda Ave",
  "OperatorStr2": null,
  "OperatorCity": "Bloomington",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "61702",
  "OperatorZipCodeExt": "2500",
  "RMPContact": "Greg Eckhart",
  "RMPTitle": "Director, Facility Operations",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000230298",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-11-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-08-31 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-08-31 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-08-31 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000064966,
      "AltID": "Propane handling and stor",
      "FacilityID": 1000051419,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000066068,
          "ProcessID": 1000064966,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000080360,
          "ProcessID": 1000064966,
          "ChemicalID": 98,
          "Quantity": 1100000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000580360,
          "ProcessID": 1000064966,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000051419,
      "SummaryText": "1.    Facility accidental release and emergency response policy.\n\n\n\nThe Paulding Terminal complies with NFPA-58 requirements for LP-Gas storage, and it is our policy to adhere to all applicable federal, state, and local laws. If an emergency were to occur, it is our policy to notify the Paulding Fire Department and request that they respond to the emergency.\n\n\n\n2.    The stationary source and the regulated substances handled.\n\n\n\nThe primary purpose of the facility, which is located at 7506 US 127, Paulding, Paulding County, Ohio, is to store and distribute propane to wholesale customers. Propane is received by rail cars then distributed to the customers by truck transports. Access to the site is restricted to authorized facility employees, management personnel and contractors.\n\n\n\n3.    The worst-case release scenario and the alternative release scenario.\n\n\n\nThis facility has developed a worst-case and alternative-case scenario, however, since this is security-sensitive information it has been withheld from this Executive Summary as required by EPA regulations.\n\n\n\n4.    The accidental release prevention program.\n\n\n\nAt the Paulding Terminal we handle propane that is recognized by the EPA as a regulated, flammable substance. The same properties that make propane valuable as a fuel also make it necessary to practice certain safety precautions in handling it to prevent leaks, spills and accidents. First and foremost in our operations are the efforts undertaken to ensure employee and contractor safety while on site as well as minimize the risk exposure for the surrounding communities. It is our company policy to adhere to all applicable federal, state and local rules and regulations.\n\n\n\nThis distribution and storage facility is subject to and abides by OSHAs Process Safety Management (PSM) rule for sites handling hazardous chemicals. In addition, the site complies with EPAs Accidental Release Prevention Rule and all other applicable federal, state and local codes. When built, this fa"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000051419,
      "SummaryText": "cility was designed in accordance with NFPA-58.\n\n\n\nAll terminal employees have been thoroughly trained using the National Propane Gas Associations (NPGA) Certified Employee Training Program (CETP).\n\n  \n\nThe site and the company continually strive to improve operations performance including the prevention of incidents, injuries and releases at the facility. Primary elements of this continuous improvement effort include making capital improvements to the facility as required, maintaining up to date procedures and continual training of personnel in both regulatory and job specific subject matter. The integrity and reliability of major equipment, including pumps, compressors, pipelines and storage tanks is assured through periodic inspection and preventive maintenance practices. The chemicals handled do not present significant internal corrosion hazards and corrosion to external surfaces of pipelines and storage tanks is minimized via extensive inspection and painting programs.\n\n\n\nAs important as those previously mentioned items are, shutdown systems and emergency response equipment are also installed on site. Shutdown systems include remotely controlled, positive shutoff valves designed to shutdown affected equipment or isolate a problem once detected.\n\n\n\n5.    Five Year Accident History\n\n\n\nThere have been no accidental releases of propane in the past five years that:\n\n-have caused any deaths, injuries, or significant property damage at the facility; nor\n\n-to our knowledge, have resulted in offsite deaths, injuries, evacuations, shelter in place, property damage, or environmental damage.\n\n\n\n6. Emergency Response Program\n\n\n\nThis facility is considered a non-responding site and as such it maintains an Emergency Action Plan (EAP) which includes procedures for notification of local fire, law enforcement and medical organizations. Notification of potentially affected neighbors would be coordinated through the fire department or law enforcement after consultation with site pers"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000051419,
      "SummaryText": "onnel. Should an actual incident occur, the EAP gives guidance to employees on how to respond to minor accidents, incidental spills and/or small fires. Portable fire extinguishers are maintained throughout the site. Larger emergencies require assistance from local emergency response organizations and on-site personnel are knowledgeable as to when that outside assistance is required.\n\n\n\n7. Planned Changes to Improve Safety\n\n\n\nSafety improvement is on-going process at the facility. Periodic evaluations are performed to assess the maintenance of safe conditions. There are no specific safety recommendations for implementation at this time"
    }
  ]
}