{
  "FacilityID": 1000033108,
  "FacilityName": "Grecian Delight Estes",
  "FacilityStr1": "1301 Estes Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Elk Grove Village",
  "FacilityState": "IL",
  "FacilityZipCode": "60007",
  "Facility4DigitZipExt": "5403",
  "FacilityCountyFIPS": "17031",
  "LEPC": "Cook County LEPC",
  "FacilityLatDecDegs": "42.005278",
  "FacilityLongDecDegs": "-087.966944",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.greciandelightdistribution.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Grecian Delight Tonne",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "David Kiel",
  "OperatorStr1": "17W114 Oak Lane",
  "OperatorStr2": null,
  "OperatorCity": "Bensenville",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60106",
  "OperatorZipCodeExt": null,
  "FTE": 52,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000093908",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-08-15 00:00:00",
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-03-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-03-08 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2013-03-08 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-03-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 42.00524,
  "FRS_Long": -87.96648,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000040415,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000033108,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000048593,
          "ProcessID": 1000040415,
          "ChemicalID": 56,
          "Quantity": 13767.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000040816,
          "ProcessID": 1000040415,
          "NAICSCode": "311822",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000035299,
              "Process_NAICS_ID": 1000040816,
              "SafetyReviewDate": "2011-10-15 00:00:00",
              "PHA_Date": "2013-11-16 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-11-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Factors and Errors",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Computer-based process control and monitoring system",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Fire Detection System",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-10-15 00:00:00",
              "TrainingReviewDate": "2011-10-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Outside Refrigeration Classes and Seminars",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-10-15 00:00:00",
              "EquipmentInspectionDate": "2012-10-15 00:00:00",
              "EquipmentTested": "Ammonia Compressors",
              "ChangeMgmtDate": "2012-10-15 00:00:00",
              "ChangeMgmtReviewDate": "2012-10-15 00:00:00",
              "PreStartupReviewDate": "2004-05-30 00:00:00",
              "ComplianceAuditDate": "2012-10-25 00:00:00",
              "AuditCompletionDate": "2013-10-25 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2011-10-15 00:00:00",
              "HotWorkPermitReviewDate": "2011-10-15 00:00:00",
              "ContractorSafetyReviewDate": "2011-10-15 00:00:00",
              "ContractorSafetyEvalDate": "2011-10-15 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000041718,
                  "PreventionProgram3ID": 1000035299,
                  "ProcessChemicalID": 1000048593
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000033108,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-10-15 00:00:00",
    "ERTrainingDate": "2011-12-15 00:00:00",
    "CoordinatingAgencyName": "Elk Grove Village Fire Department",
    "CoordinatingAgencyPhone": "8477348000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000033108,
      "SummaryText": "EXECUTIVE SUMMARY\r\n\r\n\r\nGrecian Delight, Estes \r\nElk Grove Village, Illinois\r\n\r\n\r\nBackground Data\r\n\r\nIn accordance with Title 40 of the Code of Federal Regulations Chapter 68 (40 CFR 68) promulgated by the Environmental Protection Agency (EPA), Grecian Delight, Estes submits this Risk Management Plan (RMP) for operations at their facility in Elk Grove Village, Illinois.  The operations at Grecian Delight, Estes include the manufacturing of frozen dough and bakery products for chain restaurant customers and the wholesale baking industry, packaged under various recognized brand names.  \r\n\r\nAccidental Release Prevention and Emergency Response Policy\r\n\r\nGrecian Delight, Estes is committed to protecting the health of its employees, the surrounding community, and the environment.  It is the policy of Grecian Delight, Estes to maintain a safe and healthy workplace, protect the environment, and comply with all applicable regulations, including 40 CFR 68 and the Occupational Safety and Health Administration¿s (OSHA¿s) Process Safety Management (PSM) regulation, 29 CFR 1910.119.  \r\n\r\n\r\nStationary Sources and Regulated Substances\r\n\r\nTo ensure the quality of Grecian Delight, Estes' ingredients and final products, refrigeration is necessary to maintain the low temperatures required for the food processing and storage areas of the plant.  These requirements are promulgated and monitored by the United States Food and Drug Administration and the Illinois State Department of Health.  To achieve this, Grecian Delight, Estes uses anhydrous ammonia, the 112(r) regulated substance, as the primary refrigerant in the cooling system.  The ammonia refrigeration system maintains the 125,000 square-foot facility within the required range of operating temperatures and provides cooling for the manufacturing and storage of all products.  Anhydrous ammonia is a standard refrigerant for the food industries and widely used throughout the country.  The refrigeration system at Grecian Delight, Estes i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000033108,
      "SummaryText": "s a closed loop system and consists of receiver vessels, compressors, evaporators, condensers, chillers, and associated piping.  The system can contain a maximum amount of approximately 14,000 pounds of anhydrous ammonia at any time during the course of the year.  Ammonia is the only regulated substance, covered by the EPA¿s Chemical Accidental Prevention Provisions and the associated Risk Management Program requirements, that is used at the Elk Grove Village facility.\r\n\r\n\r\nWorst Case and Alternative Release Scenarios\r\n\r\nAs required by 40 CFR 68 Subpart B, Grecian Delight, Estes has evaluated a worst-case release scenario for anhydrous ammonia using the parameters specified by the EPA.  The worst-case release scenario is defined as the release, over a 10-minute period, of the entire contents of the largest vessel or pipe in the facility¿s system.  The worst-case release scenario was developed following EPA regulations, however, based on the facility¿s operating history, it is not considered by Grecian Delight, Estes to be a likely release scenario for the facility.  A more realistic release scenario (alternative release) was developed by Grecian Delight, Estes taking into consideration the facility¿s history of operational experience and the hazards identified in the process hazard analysis (PHA) conducted for the ammonia refrigeration system.  The PHA was conducted in accordance with OSHA¿s Process Safety Management regulations, contained in 29 CFR 1910.119, to ensure that potential hazards are identified and evaluated to minimize the potential of occurrence.\r\n\r\nUsing the equations in Appendix E of the EPA¿s General Risk Management Program Guidance document and the EPA¿s RMP*Comp computer program, the maximum distances to the ¿endpoint¿ specified for anhydrous ammonia were calculated for both scenarios and reported to the EPA.  The chemical-specific endpoints, established for release scenarios by the EPA, provide conservative estimates of the distances a chemical c"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000033108,
      "SummaryText": "ould possibly travel in the event of a release meeting the EPA¿s criteria. \r\n\r\n\r\nAccidental Release Prevention Program\r\n\r\nTo prevent, detect, and mitigate accidental releases of anhydrous ammonia, Grecian Delight, Estes has implemented several precautionary measures including process and equipment controls, operating procedures, preventive-maintenance programs, employee training, and audit programs.  The refrigeration system was installed at the facility in 1992 and it was designed and constructed in accordance with recognized engineering and industry codes and standards. \r\n\r\nGrecian Delight, Estes has also developed and implemented a PSM program pursuant to OSHA regulations and as such, has evaluated the refrigeration system for the potential to release anhydrous ammonia.  Some of the controls installed to detect, prevent, or mitigate catastrophic releases of ammonia include process equipment (pressure relief valves, check valves, backup pumps, and manual shutoffs), automated controls (interlocks, automatic shutoffs, ammonia leak detection systems, and electrical distribution system grounding) and process alarms and emergency response procedures. \r\n\r\nGrecian Delight, Estes has developed standard operating procedures for all employees and contractors that have contact with the ammonia refrigeration system.  These procedures incorporate safety measures to prevent employee injury, equipment damage, and accidental releases.  The procedures were developed by a team consisting of personnel from operations and maintenance, plant engineering, and Grecian Delight, Estes' refrigeration contractor.  Pursuant to written management of change procedures established by Grecian Delight, Estes, any changes to the operating procedures are to be communicated to affected employees.\r\n\r\nGrecian Delight, Estes understands that maintaining the refrigeration system in good working order is essential to preventing accidental releases; therefore Grecian Delight, Estes has implemented a preve"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000033108,
      "SummaryText": "ntative maintenance program.  The preventative maintenance program is scheduled, documented, and managed to ensure that regular maintenance occurs on the system.  Also, to ensure the mechanical integrity of critical refrigeration system components, equipment inspections are performed.\r\n\r\nTo ensure that the control measures at Grecian Delight, Estes are effective in maintaining the safe operation of the plant, regularly scheduled audits are performed on the ammonia refrigeration system and the facility, as follows:\r\n\r\nIn accordance with the OSHA and EPA requirements, Grecian Delight, Estes conducts detailed compliance audits of the Process Safety and Risk Management Programs.  Each audit incorporates a review of process safety information, process hazard analysis, operating procedures, training programs, system mechanical integrity, management of change, pre-start up safety review procedures, compliance audit procedures, incident investigation procedures, employee participation programs, hot work permit procedures, and contractor safety procedures.\r\n\r\nFive-Year Accident History\r\n\r\nOver the last five years, Grecian Delight, Estes has not experienced any reportable releases of anhydrous ammonia from the refrigeration system.  Furthermore, there has not been a reportable release of ammonia from the system since its initial installation in late 1992. \r\n\r\n\r\nEmergency Response Program\r\n\r\nThe Grecian Delight, Estes facility is included in the written community emergency response plan developed for Elk Grove Village.  In addition, Grecian Delight, Estes has developed site specific emergency action and emergency response plans to protect employees, the surrounding community, and the environment in the event of an ammonia release, fire, or other emergency.  These programs include the measures to be taken by Grecian Delight, Estes including emergency notifications, on-site and off-site coordination, ammonia release procedures and evacuation procedures. \r\n\r\nIn addition, Grecian"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000033108,
      "SummaryText": "Delight, Estes has an emergency response team consisting of plant personnel trained to respond to various emergency situations including the accidental release of ammonia.  These personnel are trained in accordance with the requirements of 29 CFR 1910.120, OSHA¿s Hazardous Waste Operations and Emergency Response regulations, for their response duties and functions.  Response team personnel receive initial training and annual refresher training thereafter.\r\n\r\nTo ensure that local response personnel are familiar with Grecian Delight, Estes' facility and their emergency response procedures, tours of the facility and a copy of the facility¿s Emergency Response Plan have been provided to the Elk Grove Village Fire Department.\r\n\r\nIn addition to the local fire department, Grecian Delight, Estes has arranged for emergency response assistance with two local refrigeration contractors knowledgeable in the facility layout and the design and operation of the ammonia refrigeration system.\r\n\r\nThe Grecian Delight, Estes facility is located in an industrial park covering a large portion of Elk Grove Village, and as a result, there are very few residential, community, and environmental receptors in the area.  However, in the event of an ammonia release with the potential for off-site effects, the Elk Grove Village Fire Department and the Cook County LEPC will be notified immediately.  Any notifications and/or instructions to the general public shall be made by these agencies and may include the following methods:\r\n\r\nPolice and fire vehicles equipped with public address systems, \r\n\r\nDoor-to-door notification of residents, and\r\n\r\nBroadcast message via the Cook County Emergency Broadcast System, if necessary.\r\n\r\n\r\nContinuing Efforts to Improve Safety\r\n\r\nAs part of Grecian Delight, Estes continuous efforts to optimize the performance and safe operation of the ammonia refrigeration system, several changes are planned at the facility to improve safety and further minimize the potential for"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000033108,
      "SummaryText": "ammonia releases.  These changes include process equipment upgrades, a new computer-based control system to monitor and manage the refrigeration process, and an automated condenser water treatment system."
    }
  ]
}