{
  "FacilityID": 1000024325,
  "FacilityName": "South Carlsbad Dew Point Control Plant",
  "FacilityStr1": "65 Roberson Road",
  "FacilityStr2": null,
  "FacilityCity": "Loving",
  "FacilityState": "NM",
  "FacilityZipCode": "88256",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35015",
  "LEPC": "Eddy County LEPC",
  "FacilityLatDecDegs": "32.313190",
  "FacilityLongDecDegs": "-104.136312",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "www.enterpriseproducts.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Enterprise Field Services, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Enterprise Products Operating, LLC",
  "OperatorStr1": "P.O. Box 4324",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77210",
  "OperatorZipCodeExt": "4324",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197636",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "P130-M1",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-05-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-12-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-12-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-10-20 00:00:00",
  "DeRegistrationEffectiveDate": "2020-10-09 00:00:00",
  "AnniversaryDate": "2016-12-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "03",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029738,
      "AltID": "Natural Gas Cooling",
      "FacilityID": 1000024325,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000035702,
          "ProcessID": 1000029738,
          "ChemicalID": 155,
          "Quantity": 36000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000030079,
              "ProcessChemicalID": 1000035702,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000030080,
              "ProcessChemicalID": 1000035702,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000030081,
              "ProcessChemicalID": 1000035702,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000030082,
              "ProcessChemicalID": 1000035702,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000030083,
              "ProcessChemicalID": 1000035702,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000030084,
              "ProcessChemicalID": 1000035702,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000030085,
              "ProcessChemicalID": 1000035702,
              "ChemicalID": 115
            }
          ]
        },
        {
          "ProcessChemicalID": 1000036337,
          "ProcessID": 1000029738,
          "ChemicalID": 155,
          "Quantity": 300000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000030478,
              "ProcessChemicalID": 1000036337,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000030479,
              "ProcessChemicalID": 1000036337,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000030480,
              "ProcessChemicalID": 1000036337,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000030481,
              "ProcessChemicalID": 1000036337,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000030482,
              "ProcessChemicalID": 1000036337,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000030483,
              "ProcessChemicalID": 1000036337,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000030042,
          "ProcessID": 1000029738,
          "NAICSCode": "211112",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000024325,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2011-01-31 00:00:00",
    "ERTrainingDate": "2011-11-10 00:00:00",
    "CoordinatingAgencyName": "Eddy County LEPC",
    "CoordinatingAgencyPhone": "5058853581",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 0,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000024325,
      "SummaryText": "South Carlsbad Dew Point Control Plant\n\nEnterprise Products Operating LLC\n\nExecutive Summary\n\nRisk Management Plan\n\n\n\nEPA Identifier:  1000 0019 7636\n\n\n\nAccidental Release Prevention and Response\n\n\n\nEnterprise Products Operating, LLC, has a long-standing commitment to worker and public safety.  This commitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation and maintenance of the facility?s processes.  It is the practice of Enterprise Products Operating LLC (Enterprise) to implement reasonable controls to prevent foreseeable releases of substances.  However, if a release does occur, trained personnel will respond to, control and contain the release.\n\n\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\n\n\nThe South Carlsbad Dew Point Control Plant located in Eddy County, New Mexico,  is owned by Enterprise Field Services LLC and is operated by Enterprise Products Operating, LLC.\n\n\n\nThe South Carlsbad Dew Point Control Plant is a simple heat exchange and refrigeration process that reduces the hydrocarbon dew point of the natural gas before it flows into the long distance gas transmission system.  The dew point control plant utilizes heat exchange and propane refrigeration to cool the gas to the required dew point, condensing some of the liquifiable hydrocarbons into a liquid phase.  The mixed hydrocarbon liquid stream is flashed to a lower pressure and heated to stabilize the product for atmospheric storage and trucking.  The lighter, higher vapor pressure hydrocarbons that are removed from the recovered and stabilized liquid are recompressed and recycled to the inlet of the dew point control plant.  \n\n\n\nThe South Carlsbad Dew Point Control Plant was evaluated to determine if any regulated flammable substances exceeded the threshold quantity.  Enterprise identified the regulated substances and quantities to be kept on site based on the process desig"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000024325,
      "SummaryText": "n and of the proposed process vessels.  Listed flammable substances which will be present above the threshold quantities at the South Carlsbad Dew Point Control Plant are a mixed natural gas liquid product containi9ng methane, ethane, propane, iso-butane, normal butane, iso-pentane and normal pentane.  The stabilized mixed hydrocarbon liquid, containing all of the same components except methane, is also present.  The plant is designed to operate as an unattended gas processing facility.  The South Carlsbad Dew Point Control Plant qualifies for exemption from the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standard as a normally unoccupied remote facility.  Due to the presence of regulated flammable materials above the threshold quantity, the South Carlsbad Dew Point Control Plant is registered as an EPA Risk Management Program 1 facility.  \n\n\n\n\n\nOffsite Consequence Analysis Results\n\n\n\nThe offsite consequence analysis will not be reflected in the executive summary but rather is reflected in the data components.  There are flammable substances on site, but no toxic substances above the threshold quantity.  The calculated distance for the Worst Case Scenario is less than the distance to nearest offsite receptor.  Since there have been no accidents with offsite consequences within the last five years and emergency response is coordinated with the Local Emergency Planning Commission, the plant qualifies as an RMP Program 1 facility.\n\n\n\nGeneral Accident Release Prevention Program\n\nChemical Specific Prevention Steps\n\n\n\nThe processes at the South Carlsbad Dew Point Control Plant have hazards that must be managed to insure continued safe operation.  The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\n\n\nSafe Work Practices\n\n\n\nThe South Carlsbad Dew Point Control Plant has long standing safe work practices in place to help ensure worker and "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000024325,
      "SummaryText": "process safty.  Examples of these include (1) control of the entry/presence/exit of support personnel, (2) a lockout/tagout procedure to ensure isolation of energy sources for equipment undergoing maintenance, (3) a procedure for safe removal of hazardous substances before process piping and equipment is opened, (4) a permit and procedure to control spark-producing activities (hot work) and (5)a permit and procedure to ensure that adequate precautions are in place before entry into a confined space.  These prodecures, along with training of affected personnel, form a system to help ensure that operations and maintenance activities are performed safely.\n\n\n\nSpecialized Safety Features\n\n\n\nThe South Carlsbad Dew Point Control Plant has safety features and controls in place to help contain/control a release, to quickly detect a release and reduce the consequence of a release.  The following types of safety features are used in the covered processes:\n\n\n\nRelease Detection\n\n\n\n* Hydrocarbon (hazardous gas) detectors and alarms\n\n\n\nRelease Containment and Control\n\n\n\n* Process relief valves that discharge to a flare to capture and incinerate episodic releases.\n\n* Valves to permit isolation of the process (manual or automated).\n\n* Automatic shutdown systems for specific process parameters (e.g., high temperature).\n\n* Curbs or dikes to contain liquid releases.\n\n* Redundant equipment and instrumentation (e.g., uninterruptible power supply for process control system)\n\n* Atmospheric relief devices.\n\n\n\nRelease Mitigation\n\n\n\n* Hand-held fire extinguishers   \n\n* Personnel trained in emergency response and procedures.\n\n* Personnel protective equipment (e.g., chemical protective clothing, self-contained breathing apparatus, etc.)\n\n\n\n\n\nFive Year Accident History\n\n\n\nThe South Carlsbad Dew Point Control Plant has an excellent record of accident prevention.  The facility has had no large or small releases within the last five years, and no incidents with onsite injuries or offsite consequenc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000024325,
      "SummaryText": "es.  \n\n\n\n\n\nEmergency Procedures Information\n\n\n\nThe South Carlsbad Dew Point Control Plant maintains a written emergency procedure, which is in place to protect worker and public safety as well as the environment.  The procedures are for the possibility of a fire or explosion if a flammable substance is accidentally released.  The procedures address notification of local emergency response agencies if a release occurs.  Employees receive training in emergency procedures.  The emergency procedure is updated when necessary based on modifications made to the plant facilities.  \n\n \n\n\n\nThe overall emergency procedure program for the South Carlsbad Dew Point Control Plant is coordinated with the.Eddy County Local Emergency Planning Commission (LEPC). The South Carlsbad Dew Point Control Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g. fire department).  This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.  In addition to periodic LEPC meetings, the South Carlsbad Dew Point Control Plant will conduct periodic emergency drills that involve the LEPC and emergency response organizations, and will provide periodic refresher training to local emergency responders regarding the hazards of regulated substances in the plant.\n\n\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nEnterprise Products Operating, LLC is committed to the safe design and operation of all of its processing and fractionation plants and liquid hydrocarbon terminals.  The following project is currently planned for installation to improve safety at South Carlsbad Dew Point Plant.\n\n\n\n*  Enterprise is currently planning to install an improved facility security and video monitoring system at South Carlsbad Dew Point Plant."
    }
  ]
}