{
  "FacilityID": 1000006442,
  "FacilityName": "Tropicana Manufacturing, LLC",
  "FacilityStr1": "240 N. Orange Avenue",
  "FacilityStr2": null,
  "FacilityCity": "City of Industry",
  "FacilityState": "CA",
  "FacilityZipCode": "91744",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.037778",
  "FacilityLongDecDegs": "-117.976111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.Tropicana.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 126463025,
  "ParentCompanyName": "PepsiCo",
  "Company2Name": null,
  "CompanyDUNS": 1287762,
  "Company2DUNS": 0,
  "OperatorName": "Tropicana Products, Inc.",
  "OperatorStr1": "1001 13th Avenue East",
  "OperatorStr2": null,
  "OperatorCity": "Bradenton",
  "OperatorStateFIPS": "FL",
  "OperatorZipCode": "34208",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kyle Morton",
  "RMPTitle": "HSE Manager",
  "FTE": 68,
  "OtherEPAFacilityID": "CA000077181",
  "EPAFacilityID": "100000077187",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-03-25 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 1,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.03955,
  "FRS_Long": -117.97439,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000007551,
      "AltID": "Refrigeration",
      "FacilityID": 1000006442,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000007678,
          "ProcessID": 1000007551,
          "NAICSCode": "311411",
          "_desc": {
            "NAICS_CODE": "311411",
            "NAICS_DESCRIPTION": "Frozen Fruit, Juice, and Vegetable Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000008457,
          "ProcessID": 1000007551,
          "ChemicalID": 56,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000508457,
          "ProcessID": 1000007551,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000006442,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nThe Tropicana facility utilizes the services of a professional refrigeration contractor to assist with the maintenance of the ammonia refrigeration system.  The system is checked on a regular basis to ensure it is functioning properly and in good repair.\n\nThe facility has an emergency evacuation plan that includes ammonia leaks.  If an ammonia leak or an alarm indicating an ammonia leak is observed by facility personnel, the decision to evacuate the building is made by management.  Professional emergency responders and the facilityA?s professional refrigeration service firm are called to assist with the ammonia leak. \n\nThe management at Tropicana is committed to safety.  The emergency action plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe facility is located at 240 North Orange Avenue in Industry, California.  The system was constructed in accordance with all applicable federal, state, and local regulations including the Uniform Fire and Mechanical Codes.\n\nThe ammonia refrigeration system uses 16,149 pounds of ammonia for the cold storage of fruit juice and fruit juice beverages.  The majority of the system is located in and around the engine room including vessels and compressors.  The condenser is mounted on the roof, and all of the evaporators are located in their respective cold storage areas.\n\nThe refrigeration process equipment at the facility operates continuously.  The compressors and condensers cycle on and off to comply with system demand during operation.  The ammonia refrigeration system provides cooling for the +10A?F Storage Area, the +35A?F Storage Area, and the +0A?F Freezer.  System equipment is located inside the Machine Room, outside, and in the "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000006442,
      "SummaryText": "Freezer and Storage areas. \n\nThe refrigeration cycle begins with the transfer of liquid ammonia from the Condensers to the High Pressure Receiver.  The High Pressure Receiver feeds high pressure liquid ammonia to the +20A?F Cooler Recirculator, the +10A?F and +0A?F Air Handling Units, and the Chillers (#4 & #6 - #9).\n\nThe +20A?F Cooler Recirculator feeds controlled pressure liquid ammonia to Air Handling Units #1 - #3 and #9 - #11 (+35A?F). At the evaporators, the liquid ammonia, flowing through coils in the unit, is partially boiled as it absorbs heat from the product and room.  The resulting A`wet suctionA? (liquid/vapor mix) from AHU #1 - #3 and #9 - #11 and the Chillers is returned to the +20A?F Cooler Recirculator, wherein the liquid drops to the bottom of the vessel (to be reused in the refrigeration process or transferred to the -10A?F Freezer Accumulator) and vapor is drawn from the top of each vessel by the Compressors.  \n\nResulting A`wet suctionA? (liquid/vapor mix) from AHU #6 & #8 returns to the -10A?F Freezer Accumulator.  Liquid ammonia drains to the -10A?F Freezer Accumulator Liquid Transfer Unit.  When the Liquid Transfer Unit (LTU) fills, hot gas from the compressors is fed to the LTU, which pressurizes the vessel, pushing high pressure liquid back to the +20A?F Cooler Recirculator.  A pump is also used to aid in the transfer process.\n\nThe Chillers use the high pressure liquid ammonia from the High Pressure Receiver to cool product in the process areas at the facility.  The liquid ammonia boils off, and the Chillers return cooler suction (vapor) to the +20A?F Cooler Recirculator.\n\nThe Frick Compressors (#3 - #6) draw vapor from the +20A?F Cooler Recirculator.  The Vilter Compressor (#2) draws vapor from the -10A?F Freezer Accumulator.  The Vilter Compressor (#1) can draw liquid off either of these vessels depending on system demand.  The vapor discharged from the Compressors is routed to the Condensers.  The compressors receive high pressure liquid "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000006442,
      "SummaryText": "from the from the High Pressure Receiver for oil cooling.\n\nAt the Condensers (3), air (fans) and water (pumps) are used to condense the compressor discharge into high pressure liquid, which then drains to the High Pressure Receiver to begin the refrigeration cycle again.  The system is also equipped with an Automatic Purger that removes non-condensables, i.e. air, from the system.\n\nAll process equipment and piping are designed according to ASME standards.  All ASME vessels are equipped with pressure relief valves that vent to the water diffusion tank at 150 psig, 250 psig, or 300 psig.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nThe Tropicana ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, the facility operates in accordance with Cal/OSHA's Process Safety Management regulation.  The facility conducts maintenance and any necessary minor repairs in house, but an outside contractor is hired for major repairs. The facility also maintains a contract with a professional refrigeration contractor to conduct preventative maintenance and any necessary repairs.\n\n\nThe facility including the ammonia system was designed and constructed in accordance with the Uniform Mechanical Code which specifically outlines requirements for the safe operation of the ammonia refrigeration system.  These safety features include two water diffusion tanks, ammonia sensors in the engine room as well as sensors near the evaporators, and automatic shut down systems. In addition, the majority of the ammonia is maintained inside the engine room and just outside of the engine room (Condenser and High Pressure).  All pressure vessels are equipped with pressure relief valves that are commonly piped to the water diffusion tanks.\n\nIn addition to the Uniform Mechanical Code, Tropicana has developed a preventive maintenance program that u"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000006442,
      "SummaryText": "tilizes the services of a professional refrigeration contractor to complete regularly scheduled inspections and tests of the ammonia refrigeration system as well as repairs as needed to process equipment.  \n\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no significant releases of ammonia at the facility over the past five years (June 2004 A? June 2009) that exceeded the Federal Reportable Quantity of 100 pounds or the state requirement mandating immediate reporting of any release or threatened release of a hazardous material.  In addition, there have been no injuries resulting from an ammonia release, nor any releases or A?near missesA? that warranted an internal incident investigation.\n\n\nEMERGENCY RESPONSE PROGRAM\n\nThe Tropicana facility has an emergency action plan in effect.  The Emergency Action Plan (Plan) is detailed in the Emergency Planning and Response section of this PSM/RMP document.  This Plan was designed to meet the following objectives:\n\n  1.)  To save lives.\n  2.)  To minimize and avoid injuries.\n  3.)  To protect the environment.\n  4.)  To minimize property damage.\n\nThe facility maintains a safety committee whose members are the designated emergency coordinators for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year.  This Plan was reviewed and updated to ensure compliance with the PSM/RMP regulations.\n\nIn case of an ammonia emergency, the Tropicana facility will evacuate all employees and alert the local emergency responders (fire department).  Tropicana plans to coordinate emergency response efforts with the fire department on a periodic and ongoing basis.\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Process Hazards Analysis, including a Hazard and Operability (HAZOP) study and a Facility"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000006442,
      "SummaryText": " Inspection, was conducted on April 23-24, 2008.  The PHA study provided mitigation measures to improve safety at the Tropicana facility located at 240 North Orange Avenue in Industry, California.  The Tropicana safety committee is planning to complete several items over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\n\n1. Continue to train all employees in the facility Safety Plan/Programs.\n\n2. Continue to have employee involvement in Safety Plan Development.\n\n3. Continue employee involvement through safety team participation.\n\n4. Continue internal and external safety audits/inspections and implement changes as needed.\n"
    }
  ]
}