{
  "FacilityID": 1000098255,
  "FacilityName": "Cascade Pacific Pulp, Halsey Pulp Mill",
  "FacilityStr1": "30480 American Drive",
  "FacilityStr2": null,
  "FacilityCity": "Halsey",
  "FacilityState": "OR",
  "FacilityZipCode": "97348",
  "Facility4DigitZipExt": "0400",
  "FacilityCountyFIPS": "41043",
  "LEPC": "Mid-Valley LEPC",
  "FacilityLatDecDegs": "44.381306",
  "FacilityLongDecDegs": "-123.158111",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cascadepulp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 827898862,
  "ParentCompanyName": "Cascade Pacific Pulp",
  "Company2Name": null,
  "CompanyDUNS": 827898862,
  "Company2DUNS": 827898862,
  "OperatorName": "Patrick Rank",
  "OperatorStr1": "30480 American Drive",
  "OperatorStr2": null,
  "OperatorCity": "Halsey",
  "OperatorStateFIPS": "OR",
  "OperatorZipCode": "97348",
  "OperatorZipCodeExt": "0400",
  "FTE": 187,
  "OtherEPAFacilityID": "97348PPTLB30480",
  "EPAFacilityID": "100000127828",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "22-3501",
  "SafetyInspectionDate": "2012-03-20 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-01-04 00:12:39",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-01-04 00:12:39",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-01-04 00:12:39",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-01-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 44.382194,
  "FRS_Long": -123.159618,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000121686,
      "AltID": "Chlorine Dioxide Plant",
      "FacilityID": 1000098255,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000152352,
          "ProcessID": 1000121686,
          "ChemicalID": 71,
          "Quantity": 19000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000123059,
          "ProcessID": 1000121686,
          "NAICSCode": "32211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000104547,
              "Process_NAICS_ID": 1000123059,
              "SafetyReviewDate": "2018-12-14 00:00:00",
              "PHA_Date": "2019-09-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-12-14 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-01-12 00:00:00",
              "TrainingReviewDate": "2021-01-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-01-30 00:00:00",
              "EquipmentInspectionDate": "2020-08-27 00:00:00",
              "EquipmentTested": "ClO2 Plant Inspection",
              "ChangeMgmtDate": "2021-12-21 00:00:00",
              "ChangeMgmtReviewDate": "2016-04-27 00:00:00",
              "PreStartupReviewDate": "2016-12-12 00:00:00",
              "ComplianceAuditDate": "2021-12-23 00:00:00",
              "AuditCompletionDate": "2022-06-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-12-14 00:00:00",
              "HotWorkPermitReviewDate": "2021-06-08 00:00:00",
              "ContractorSafetyReviewDate": "2020-09-22 00:00:00",
              "ContractorSafetyEvalDate": "2020-07-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000131345,
                  "PreventionProgram3ID": 1000104547,
                  "ProcessChemicalID": 1000152352
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000098255,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-04-21 00:00:00",
    "ERTrainingDate": "2021-04-30 00:00:00",
    "CoordinatingAgencyName": "Halsey Shedd Fire Department",
    "CoordinatingAgencyPhone": "5413692419",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000098255,
      "SummaryText": "efore the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in the covered processes. The mechanical integrity program includes:\r\n1.\t· Specifications for inspection and testing of process equipment.\r\n2.\t· Specifications for replacement parts and equipment\r\n3.\t· Procedures for inspecting, testing and maintaining process equipment\r\n4.\t· Procedures for safe work practices such as lockout/tag out, hot work, confined space entry, and line or equipment opening\r\n5.\t· Training of maintenance personnel\r\n6.\t· Documentation of maintenance activities\r\n\r\nManagement of Change.  The management of change program evaluates and approves all proposed changes to chemicals, equipment and procedures for a covered process to help ensure that the change does not negatively affect safe operations. Process changes that are determined to be a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change program. All other changes must be confirmed through the full management of change program to help ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\r\n\r\nPre-Startup Review.  The company performs a safety review of a new or modified process before the process is placed into service to help ensure that the process has been prepared to operate safely. This review confirms that:\r\n1.\t· Construction and equipment are in accordance with design specifications\r\n2.\t· Safety, operating, maintenance and emergency procedures are in place\r\n3.\t· Employee training has been completed\r\n4.\t· A process hazard analysis has been performed if the process is new or management of change requirements have been completed if an existing process has been modified\r\n\r\nCompliance Aud"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000098255,
      "SummaryText": "overed processes\r\n\r\nInformation further describing these elements is provided in this Risk Management Plan.\r\n\r\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nCascade Pacific Pulp is committed to the safety of workers and the public, and the preservation of the environment, through the prevention of accidental release of hazardous substances. The facility implements controls to prevent foreseeable releases of hazardous substances. These controls include training programs for personnel, programs to help ensure safety in the design, installation, operation and maintenance of processes, and programs to evaluate the hazards.  In the event of an accidental release, the facility controls and contains the release in a manner that will be safe for workers and will help prevent injury to the public or the environment. The Halsey Pulp Mill provides response training to personnel, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with the local fire department.\r\n\r\nIn order to implement these policies, the Halsey Pulp Mill established a management system directed by the Human Resource Manager to oversee safety-related activities.\r\n\r\nREGULATED SUBSTANCES\r\n\r\nCascade Pacific Pulp is a pulp mill primarily involved in the manufacture of bleached and unbleached pulp.  As part of this manufacturing process, the facility handles two regulated substances in quantities greater than the threshold to be covered by the RMP rule, as shown in the following list of RMP-covered processes.\r\n\r\nProcess \t\tProgram Level \tRegulated Substance \tProcess Quantity lbs.\r\n\r\nChlorine Dioxide Plant \t 3 \t\tChlorine Dioxide \t19,000\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nSince the mill was constructed in 1969, a prevention program has been in place to help prevent accidental releases of hazardous substances. Beginning in 1992, Halsey Pulp Mill formalized this prevention program for the filter p"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000098255,
      "SummaryText": "it.  The Halsey Pulp Mill audits covered processes to be certain that the prevention program is effectively addressing the safety issues. The facility assembles an audit team that includes personnel knowledgeable in OSHA's Process Safety Management, RMP rule and in the process. This team evaluates whether the prevention program satisfies the requirements of the OSHA rule and the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\r\n\r\nIncident Investigation.  The facility investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented. The employees are trained to identify and report any incident requiring investigation. An investigation team is assembled, and the investigation is initiated within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\r\n\r\nEmployee Participation.  The Halsey Pulp Mill has a written employee participation program for covered processes to help ensure that the safety concerns of workers are addressed. The mill encourages active participation of personnel in the prevention program activities of all processes at the facility. Employees are consulted on and informed about all aspects of the prevention program, including process hazard analyses and operating procedures.\r\n\r\nHot Work Permits.  The Halsey Pulp Mill has a hot work permit program to control spark or flame producing activities that could result in fires or explosions in covered processes at the Halsey mill. The mill reviewed OSHA's fire prevention and protection requirements in 29 CFR 1910.252(a) and created a Hot Work Permit Form to comply with these requirements. Personnel who are t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000098255,
      "SummaryText": "lant to comply with the 14 elements of the OSHA process safety management (PSM) prevention program. In 1998, prior to the building of the chlorine dioxide generator, Halsey Pulp Mill began implementing OSHA process safety management. In 1996, the EPA RMP rule established a requirement for facilities with listed material greater than the threshold quantity to plan for possible off-site consequences of a release.  There are three planning program levels.  Both Chlorine and Chlorine Dioxide fall under the Program 3 requirements.  Chlorine has been removed from use at the facility in 2021.\r\n\r\nProgram 3 - essentially the same as OSHA PSM, except that the program also focuses on protecting the public and the environment.\r\n\r\nThe following sections briefly describe the elements of the prevention program that address the EPA RMP rule prevention program requirements.\r\n\r\nProgram 3 Prevention Program\r\nThe Program 3 prevention program for chlorine dioxide consists of the following 12 elements:\r\n\r\nProcess Safety Information. The facility maintains a variety of technical documents that are used to help ensure safe operation of the processes. These documents address (1) physical properties of chlorine dioxide, (2) operating parameters of the equipment, and (3) design basis and configuration of the equipment. These documents are also used (1) to train employees, (2) to perform process hazards analyses, and (3) to help maintain the equipment. The process safety information is available to all employees, the local emergency personnel, and the fire department.\r\n\r\nProcess Hazard Analysis.  The facility performs and periodically updates process hazard analyses (PHA's) of the covered processes to help identify process hazards and generate recommendations that might improve the safe operation of the process. A team composed of operating and engineering personnel with process operating experience and a leader with process hazard analyses experience is assembled to analyze the hazards of the"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000098255,
      "SummaryText": "process. The Halsey Pulp Mill uses the hazard and operability (HAZOP) technique supplemented with checklists, to perform this analysis. The team prepares a written report describing the results of the analyses, including a list of recommendations. Responsibility to resolve the recommendations is assigned to the appropriate personnel and, when necessary, changes to enhance the safety of the process are implemented.\r\n\r\nOperating Procedures.  Halsey Pulp Mill personnel develop and maintain operating procedures that cover all phases of operations, including startup, normal operations, normal shutdown, and emergency shutdown.  The operating procedures (1) are used to train employees and (2) serve as reference guides for appropriate actions to take during both normal operations and process upsets. Operating procedures include:\r\n1.\t· Steps for safely conducting activities\r\n2.\t· Applicable process safety information, such as safe operating limits and consequences of process deviations.  Safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs.\r\n\r\nTraining.  Employees are trained to safely and effectively perform assigned tasks. The training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards of the substances in the process, and (3) a detailed review of the process operating procedures and safe work practices. Written and practical tests are used to verify that an employee understands the training material before the employee can resume work in the process.\r\n\r\nMechanical Integrity. The Halsey Pulp Mill maintains the mechanical integrity of process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. The mechanical integrity program includes (1) an inspection and testing program to help identify equipment deterioration and damage b"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000098255,
      "SummaryText": "o perform hot work are required to fill out the Hot Work Permit form. The Shift Supervisor reviews the completed form before work can begin. Training in the use of the Hot Work Permit Form is included in the mill's safe work practices orientation.\r\n\r\nContractors.  The Halsey Pulp Mill has a program to help ensure that contractor activities at the Halsey mill are performed in a safe manner. The program reviews the safety record of all contractors to help ensure that only contractors who can safely perform the desired job tasks are hired. Cascade Pacific Pulp explains to the contract supervisors the hazards of the process on which they and their employees will work, safe work practices, and emergency response procedures. Cascade Pacific Pulp requires that all contract employees have safety training prior to working at the Halsey Pulp Mill. Annually contractors' training documents and work performance are reviewed to help ensure that safe work practices are followed.\r\n\r\nCHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nIn addition to the required prevention program elements, the mill has implemented safety features specific to the hazardous substances used at the facility. The following paragraphs describe some of these safety features.\r\n\r\nChlorine Dioxide.  Chlorine dioxide is generated on site. The chlorine dioxide generator was designed as a fail-safe design. In emergency situations, the chemicals supplied to the generator are stopped. The reaction is quenched with chilled water. In a power failure situation, the chilled water valves to the tank fail open so that the reaction will immediately be quenched. Chlorine dioxide is stored at a stable temperature of 45 °F in refrigerated tanks that are continually swept with air to remove any residual chlorine dioxide. The residual chlorine dioxide is sent back into the generator system.\r\n \r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nCascade Pacific Pulp has completed a five-year accident history for chlorine and chlorine dioxide.  The accident his"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000098255,
      "SummaryText": "tory from June 2014 to June 2019 was reviewed.  There were no accidents from a covered process that resulted in deaths, injuries or significant property damage on site or known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.  \r\n\r\nYear Number of Reported Accidents\r\n\r\n2014\r\nNone\r\n\r\n2015\r\nNone\r\n\r\n2016\r\nNone\r\n\r\n2017\r\nNone\r\n\r\n2018\r\nNone\r\n\r\n2019\r\nNone\r\n\r\n2020\r\nNone\r\n\r\n2021\r\nNone \r\n\r\nEMERGENCY RESPONSE PROGRAMS\r\n\r\nA written emergency response program has been established to help safely respond to accidental releases of hazardous substances. The emergency response plan includes procedures for:\r\n1.\tNotifying the local fire department and the public should there be an accidental release\r\n2.\tProviding proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances at the Halsey Pulp Mill\r\n3.\tControlling and containing accidental releases of hazardous substances, including the use of emergency response equipment\r\n4.\tInspecting and maintaining emergency response equipment\r\n5.\tReviewing and updating the emergency response plan\r\n\r\nAn emergency response team is trained in these emergency response procedures. All personnel are trained in evacuation procedures. The facility periodically conducts emergency response drills on site with the emergency response teams and also coordinates drills with the local fire department.\r\n\r\nThe written emergency response plan complies with other federal contingency plan regulations (e.g., the OSHA regulations 29CFR 1910.38(a)) and has been communicated to local emergency response officials through the local fire department.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\nCascade Pacific Pulp constantly strives to improve the safety of the processes at the Halsey Pulp Mill through both the incident investigation program and a program soliciting safety suggestions from the workers."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000098255,
      "SummaryText": "The Halsey Pulp Mill is updating the RMP to reflect changes in chemicals regulated by the 40 CFR Part 68.  The Halsey Pulp Mill has one chemical, chlorine dioxide, which are regulated by the Risk Management Plan.  As a regulated facility, the mill is required to submit an updated RMP at least every 5 years.  The RMP has been updated in 2009, 2014 and 2019.  The RMP is being updated 2022 for the removal of chlorine from the mill site.\r\n\r\nFor the 5-year update, data was updated using the RMP*eSubmit on the EPA website.  The following information is reviewed and updated as necessary in RMP*eSubmit: the facility and registration information, Worst Case and Alternate Release Scenarios, accident history, prevention program 3 information, and emergency response information.\r\n\r\nRegistration Information\r\n\r\nThe registration information was updated to reflect personnel changes.  The latitude and longitude of the facility were reviewed and were correct as well as the NAICS Codes.\r\n\r\nWorst Case and Alternate Release Scenarios\r\n\r\nThe facility has one chemical which is regulated under the risk management program.  The chemical is chlorine dioxide.  Chlorine dioxide is manufactured on site for use in the pulp mill as the primary bleaching agent.  Chlorine dioxide is stored in three 63,000-gallon tanks which is greater than the threshold of 1000 lbs.  The worst-case scenario for chlorine dioxide is the rupturing of one of the tanks.  There is a containment area to hold the contents of the release.  This scenario has not changed.  The alternative scenario is the rupture of a chlorine dioxide pipe in the pipe bridge above the road.  This scenario remains the same.  \r\n\r\nBecause the Risk Management Plan Modeling was updated in 2019, the most recent census from 2010 was used.  \r\n\r\nAccident History\r\n\r\nThe accident history from June 2014 to December 2021 was reviewed.  There were no accidents from a covered process that resulted in deaths, injuries or significant property damage on site or"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000098255,
      "SummaryText": "known off-site deaths, injuries, evacuations, sheltering in place, property damage or environmental damage.  \r\n\r\nPrevention Program 3\r\n\r\nThe most recent updates for the prevention program 3 for chlorine and chlorine dioxide were provided in the RMP*eSubmit.\r\n\r\nEmergency Response Program\r\n\r\nThe Emergency Response Program was updated in April 2021.  Training was conducted in April and May 2021.\r\n\r\nEXECUTIVE SUMMARY\r\n\r\nCascade Pacific Pulp, Halsey Pulp Mill is a Kraft pulp mill which produces market pulp. The Halsey Pulp Mill is in Halsey, Oregon. The company is committed to operating in a manner that is safe for workers, the public, and the environment. As part of this commitment, the company has established a system to help ensure safe operation of the processes at the Halsey Pulp Mill. One component of this system is the risk management program (RMP) that helps manage the risks at the Halsey Pulp Mill and that complies with the requirements of the Environmental Protection Agency's (EPA) regulation 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs (the RMP rule). One of the requirements of the RMP rule is to submit a risk management plan (RMP Plan) describing the risk management program at the mill. This document is intended to satisfy the RMP Plan requirement of the RMP rule and to provide the public with a description of the risk management program at the Halsey Pulp Mill.  The risk management program consists of three elements:\r\n\r\n1.\tA hazard assessment to help understand (a) the potential offsite consequences of hypothetical accidental releases and (b) accidents that have occurred during the last five years associated with the use of substances regulated by the RMP rule.\r\n2.\tA prevention program to help maintain and safely operate the processes containing more than a threshold quantity of a regulated substance (covered processes).\r\n3.\tAn emergency response program to help respond to accidental releases of regulated substances from c"
    }
  ]
}