{
  "FacilityID": 1000073466,
  "FacilityName": "Hopewell Water Treatment Plant",
  "FacilityStr1": "900 Industrial Street",
  "FacilityStr2": null,
  "FacilityCity": "Hopewell",
  "FacilityState": "VA",
  "FacilityZipCode": "23860",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "51670",
  "LEPC": "Hopewell LEPC",
  "FacilityLatDecDegs": "37.300611",
  "FacilityLongDecDegs": "-077.278417",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "https://amwater.com/vaaw/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 42196196,
  "ParentCompanyName": "Virginia-American Water Company",
  "Company2Name": "American Water Works Company",
  "CompanyDUNS": 29984077,
  "Company2DUNS": 0,
  "OperatorName": "Virginia-American Water Company",
  "OperatorStr1": "900 Industrial Street",
  "OperatorStr2": "P.O. Box 60",
  "OperatorCity": "Hopewell",
  "OperatorStateFIPS": "VA",
  "OperatorZipCode": "23860",
  "OperatorZipCodeExt": null,
  "RMPContact": "John Ihli",
  "RMPTitle": "Director of Risk Management",
  "FTE": 35,
  "OtherEPAFacilityID": "VA3670800",
  "EPAFacilityID": "100000067526",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-09-21 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-10-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-10-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-10-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-11-05 00:00:00",
  "DeRegistrationEffectiveDate": "2021-09-01 00:00:00",
  "AnniversaryDate": "2023-10-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 37.30061,
  "FRS_Long": -77.27842,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000091665,
      "AltID": "Chlorination",
      "FacilityID": 1000073466,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000092887,
          "ProcessID": 1000091665,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000114537,
          "ProcessID": 1000091665,
          "ChemicalID": 62,
          "Quantity": 30000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000614537,
          "ProcessID": 1000091665,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000073466,
      "SummaryText": "Introduction and Policies\n\n\n\nVirginia American Water is committed to managing all operations in a manner that protects the environment and the health and safety of employees, customers, contractors, and the public while fully complying with applicable laws and regulations. Virginia American Water's management philosophy goals are achieved through the implementation of its Environmental, Health, and Safety Management Systems, by the personal commitments of employees and contractors, and by open communication with employees, customers, neighbors, and regulators. \n\n\n\nThe purpose of this Risk Management Plan is to provide information about operations at the facility, programs to prevent accidental chemical releases, emergency response plans in the event of an accidental release, the five-year accident history of the facility, and planned changes to improve safety at the plant.\n\n\n\nStationary Source and Regulated Substances\n\n\n\nThe Virginia American Water Hopewell Plant is a water treatment plant that provides potable domestic drinking water and potable water for industrial use to customers in the area of Hopewell, Virginia. To ensure that the water remains safe throughout the distribution system to every tap, the plant adds a small amount of chlorine as a disinfection agent. The concentrated form of chlorine is liquefied and stored in shipping containers. Before it is mixed with water, chlorine can be extremely hazardous if released to the air.\n\n\n\nOffsite Consequence Analysis Modeling\n\n\n\nVirginia American Water has completed an offsite consequence analysis including a worst-case release scenario. As required by the EPA RMP regulations, the worst-case scenario is defined as the release of the entire contents of the largest vessel or container as a gas in ten-minutes. The regulations require assuming worst-case wind speed and atmospheric conditions that result in the greatest projected impact distance.\n\n\n\nTwo alternative release scenarios were selected for the Virginia Amer"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000073466,
      "SummaryText": "ican Water Hopewell facility. The first scenario was a release resulting from a hose (whip) rupture of one ton of chlorine in the Pre-Chemical Building. The second scenario was a release from the vacuum regulator due to the regulator failing to reseat. Both scenarios assumed the scrubber did not function to mitigate the release, but the building acted as passive mitigation for both scenarios. Additional details regarding the release scenarios and the modeled consequences are provided in the facility's offsite consequence analysis modeling report.  \n\n\n\nAccidental Release Prevention and Emergency Response Policies\n\n\n\nVirginia American Water is committed to protecting its employees, the public, and the environment from any releases of hazardous materials used at its facilities.  Safety, environmental protection, and risk management programs have been implemented to prevent hazardous materials releases. The Hopewell plant is a responding facility for releases of the RMP-listed chemicals, so the site utilizes an Emergency Response Plan.  If there is an accidental chlorine release, local emergency responders will be called immediately to minimize the effect of the release and notify the public of any actions necessary to ensure public protection.  \n\n\n\nPrevention Program\n\n\n\nVirginia American Water is committed to personnel safety, public safety, continued reliable operation and regulatory compliance.  Based on this commitment, the Operations Manager has assumed overall responsibility for the development and implementation of the Risk Management Program. Other key plant supervisory staff also have clearly defined accountability and responsibility for each of the prevention program elements to meet both EPA and OSHA Process Safety Management requirements.\n\n\n\nFive-Year Accident History\n\n\n\nWithin the last five years, there have been no releases of RMP substances meeting the definition of 40 CFR 68.42(a) that resulted in onsite injuries, death, property damage, or offsite impac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000073466,
      "SummaryText": "ts.\n\n\n\nEmergency Response Program\n\n\n\nThe facility will continue to conduct emergency response preparedness activities and coordinate any emergency response actions necessary for the Hopewell facility with the Hopewell LEPC. A specific Emergency Response Plan for the facility is in place and that plan has been coordinated with local emergency responders. The Emergency Response Plan includes the essential planning for effectively protecting workers, the public, and the environment during emergency situations.\n\n\n\nPlanned Changes to Improve Safety\n\n\n\nThe facility completed a process hazard analysis (PHA) in October 2018 that identified several recommendations for enhanced process safety. These recommendations are summarized in the PHA report and are currently under evaluation.\n\n"
    }
  ]
}