{
  "FacilityID": 1000071780,
  "FacilityName": "Cash S.U.D.",
  "FacilityStr1": "6001 CR 3515",
  "FacilityStr2": null,
  "FacilityCity": "Quinlan",
  "FacilityState": "TX",
  "FacilityZipCode": "75474",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48231",
  "LEPC": null,
  "FacilityLatDecDegs": "32.977642",
  "FacilityLongDecDegs": "-96.026003",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ronald Moore",
  "OperatorStr1": "6001 CR 3515",
  "OperatorStr2": null,
  "OperatorCity": "Quinlan",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75474",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ronald Moore",
  "RMPTitle": "Production Manager",
  "FTE": 6,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000221048",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2018-08-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-08-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-08-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-08-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000089881,
      "AltID": "Chlorine Dissinfection",
      "FacilityID": 1000071780,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000091103,
          "ProcessID": 1000089881,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000112370,
          "ProcessID": 1000089881,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000612370,
          "ProcessID": 1000089881,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000089882,
      "AltID": "Water Plant",
      "FacilityID": 1000071780,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000091104,
          "ProcessID": 1000089882,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000112371,
          "ProcessID": 1000089882,
          "ChemicalID": 62,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000612371,
          "ProcessID": 1000089882,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000071780,
      "SummaryText": "Executive Summary Cash S.U.D.\n\n\n\nCash S.U.D. Treatment Plant, located near Quinlan, TX in Hunt county manages a policy of safe water treatment plant operation, at the Surface Water Treatment Plant, reducing to the greatest extent possible any hazards associated with the treatment process, and reducing any subsequent risk to the surrounding community, their employees and the environment. Cash S.U.D. cooperates with the surrounding community and local emergency response agencies to promote effective planning in the unlikely event that a process incident occurs.\n\n\n\nAs part of this policy, Cash S.U.D. maintains compliance with the U.S. Environmental Protection Agency, as under (USEPA) regulations for the prevention and mitigation of accidental release of extremely hazardous substances under section 112Ar of the Clean Air Act. Our facilities covered by the regulations (40 CFR 68) are required to implement a risk management program and submit a description of the program (called a risk management plan, or RMP) to USEPA.\n\n\n\nThe Cash S.U.D. Surface Water Treatment Plant (SWTP) falls under this regulation because of onsite storage and use of chlorine. The amount stored exceeds the threshold limits of 2500 pounds specified by the USEPA, thereby making the facility subject to compliance with the regulation.\n\n\n\nThe Cash S.U.D is voluntarily submitting RMP for the first time. In the past the Plant used an onsite generation system which did not come under EPA compliance rules. Once submitted the RMP will be resubmitted every 5 years.\n\nRMP's must also be updated resubmitted due to any change that requires a revised hazard review or revised offsite consequence analysis .In 2000 Cash S.U.D. incorporated the use of Liquid Ammonia Sulphate. The LAS is stored in bulk in a separate building and is fed with a LMI liquid pump. The LAS is a 40% solution and has a storage capacity of 5000 gallons.\n\n\n\nRegulated substances\n\n\n\nCash uses chlorine combined with LAS to disinfect water. The Plant "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000071780,
      "SummaryText": "receives raw water from Lake Tawakoni. Water is treated at the Surface Water Plant and distributed to the east side of the system in a network of pipes, Towers and pump stations and storage tanks.\n\n1. Chlorine\n\nThe Cash S.U.D. Surface Water Plant is incorporating the use of gas chlorine in one ton cylinders. We are currently using 150 pound chlorine cylinders and we have a Hypochlorite system for a disinfection back up if needed.\n\n\n\nThe chlorine system for the use of 1 ton cylinders is new to the Plant. The structure is new and hoist system is new and all 1 ton equipment is new or has been properly maintained. Any existing equipment used will be PM and serviced before on tons are brought on line. The piping system is new and has been rerouted for the 1 ton cylinders. The Cash SWTP has a max capacity of 8000 pounds of chlorine, which will exceed the threshold amount of 2500 pounds.\n\nChlorine in one ton cylinders will be brought to the Plant by truck. The cylinders will be moved to the storage area by the hoist system.\n\nThe one ton cylinders will be placed under the covered area in a set of trunnions. Normally the Plant will have one to three one cylinders on site, with a max capacity of four. Two of the cylinders will be hooked up on a change over system and the cylinder feeding will be on a set of scales. Only one cylinder will ever be online at time. The one ton cylinder will feed into a one inch PVC pipe going to the Fiber-glass Chlorine building. There are two regal chlorine feeders with a 250 pound per day capacity. One feeder can operate the plant if one feeder is being maintenance. Normally both feeders are in operation. When one tons are brought online, the 150 pound cylinders will be discontinued. The plant will have a 12.5% Hypo-chlorite system for a back-up system if needed. A 12.5 percent Hypo chlorite solution NSF 60 can be ordered from FSTI in Greenville Texas with an approximate 30 to 45 minute turn-around. A release of Chlorine could occur at the cove"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000071780,
      "SummaryText": "red slab were the one tons are located or possibly in the chlorine building or in the piping to the building. However, this unlikely due to fact that the chlorine feeds are vacuum assists only. The most likely scenario for a chlorine leak would be at the lead washer connecting the regulator to the one ton cylinder.\n\n\n\nLAS (Liquid Ammonia Sulphate)\n\n\n\nLiquid ammonia Sulphate in a 40 percent solution is a moderate health risk. The LAS is stored in bulk in a separate building within a tank and containment wall. The tank has a capacity of 5000 pounds. LAS is delivered to the Plant via tanker truck. It is fed at various feed points by liquid feed pumps to produce the required chloramines .LAS poses very little risk to the operators and the public and does not come under EPA rules for RMP.\n\n\n\nHazard assessment\n\n\n\nIn August 2013, Cash S.U.D. did a offsite consequence analysis at the Plant identifying worst case scenarios (chlorine) and an alternate release scenarios for chlorine. EPAAs RMP*Comp was used as the model for submission.\n\n\n\nFive Year Accident History\n\nCash has no history of Chlorine usage and therefore no accident history exists.\n\n\n\nPrevention Program\n\nThe Cash S.U.D. utility district maintains a consistent accidental release program to eliminate or minimize release of chlorine at the Cash S.U.D. Surface Water Treatment plant. The program consist of seven elements,\n\n\n\n1.) Safety Information\n\nCash S.U.D. will maintain information concerning process chemicals, technology, and equipment as part of their risk management program at the Treatment Plant. The information is made available to employees and contractors at the Plant who will work in Chlorine process area .Emergency response planners can also use the information to develop training programs and procedures.\n\n\n\n2.) Hazard Review\n\nA hazard review of chlorine will be conducted at least every 5 years to evaluate potential causes and consequences of accidental releases, or whenever there are changes that require "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000071780,
      "SummaryText": "a new hazard review. The results of any reviews will be documented and maintained as part of the RMP records. Any changes resulting from a review will be reported and resubmitted.\n\n\n\n3.) Operating Procedures\n\nCash S.U.D. has developed and implemented written operating procedures that provide instructions and steps for conducting activities associated with the chlorine process consistent with safety information. Cash operating procedures include startup, shutdown, and emergency operating procedures, and describe how system should be operated in order to minimize the chances of an accidental release. The procedure also emphad safety considerations during operation and address hazardous situations that can occur and how to correct them.\n\n\n\n4.) Training\n\nAll of Cash S.U.D. personnel are currently involved in chlorine processes, have been trained in the classroom and/or during on-the-job training in an overview of the processes and in the operating procedures, as is new staff assigned to the process. Training includes emphasis on safety and health, hazards, emergency operations including shutdown, and safe work practices. Refreshing training is provided at least every three years to ensure Cash S.U.D. staff understands and adheres to current operating procedures.\n\n\n\n5.) Maintenance\n\nCash S.U.D. has developed and implemented a preventive and corrective maintenance program to ensure equipment used to process, store or handle chlorine is functioning properly and installed to minimize risk of releases. The program addresses equipment testing, inspection, and preventive maintenance schedules, and documentation of equipment testing, inspection and preventive and corrective maintenance activities,\n\n\n\n6.) Compliance Audits\n\nUSEPA's risk management rule requires that Cash S.U.D. complete a compliance audit for its risk management program at least every 3 years. The primary goals of conducting a compliance audit are to verify compliance with risk management rule requirements and g"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000071780,
      "SummaryText": "ood process safety practices, identify process safety or program deficiencies and develop corrective actions, and increase safety awareness among all Cash S.U.D. staff. The risk management rule also requires that copies of the last 2 audits are maintained as part of the written program.\n\n\n\n7.) Incident Investigation\n\nCash S.U.D. management investigates each incident that results in or could have resulted in a catastrophic release of chlorine. A process to identify the underlying causes of incidents and implement procedures for preventing similar events has been developed.\n\n\n\nAn incident investigation team will be established following criteria in the Cash S.U.D. risk management program. As part of the investigation, an incident report will be prepared to recommend system changes (i.e., operational modifications, additional training and competency requirements), to prevent a similar incident from occurring in the future. The incident report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system.\n\n\n\nNo incidents have been reported at Cash S.U.D.\n\n\n\nAll chlorine cylinders are stored in a locked gate at all times which has a six foot security fence and two foot of barbed wire around the facility at all times. There is a security light that is on during hours of darkness.\n\n\n\nProgram level determination according to EPA charts is Level 2.\n\n\n\n\n\n"
    }
  ]
}