{
  "FacilityID": 1000060719,
  "FacilityName": "Flint Hills Resources Fairmont, LLC",
  "FacilityStr1": "1214 Road G",
  "FacilityStr2": null,
  "FacilityCity": "Fairmont",
  "FacilityState": "NE",
  "FacilityZipCode": "68354",
  "Facility4DigitZipExt": "3054",
  "FacilityCountyFIPS": "31059",
  "LEPC": "Fillmore County LEPC",
  "FacilityLatDecDegs": "40.618056",
  "FacilityLongDecDegs": "-097.603029",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": "www.fhr.com",
  "FacilityEmailAddress": "randy.carpenter@fhr.com",
  "FacilityDUNS": 78667068,
  "ParentCompanyName": "Flint Hills Resources Biofuels & Ingredients, LLC",
  "Company2Name": null,
  "CompanyDUNS": 966500147,
  "Company2DUNS": 0,
  "OperatorName": "Flint Hills Resources Fairmont, LLC",
  "OperatorStr1": "1214 Road G",
  "OperatorStr2": null,
  "OperatorCity": "Fairmont",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "68354",
  "OperatorZipCodeExt": "3054",
  "RMPContact": "Randy Carpenter",
  "RMPTitle": "Plant Manager",
  "FTE": 52,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000200604",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "OP08S2",
  "SafetyInspectionDate": "2016-08-17 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-11-27 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-13 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-13 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-10-23 00:00:00",
  "DeRegistrationEffectiveDate": "2018-08-20 00:00:00",
  "AnniversaryDate": "2022-01-13 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Flammable mixture is not subject to RMP as the mixture meets NFPA-3 criteria.",
  "_processes": [
    {
      "ProcessID": 1000075846,
      "AltID": "Denaturant Storage",
      "FacilityID": 1000060719,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077028,
          "ProcessID": 1000075846,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000093973,
          "ProcessID": 1000075846,
          "ChemicalID": 155,
          "Quantity": 1300000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000081525,
              "ProcessChemicalID": 1000093973,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000081526,
              "ProcessChemicalID": 1000093973,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000081527,
              "ProcessChemicalID": 1000093973,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000593973,
          "ProcessID": 1000075846,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060719,
      "SummaryText": "EPA Facility ID: 100000200604 Flint Hills Resources Fairmont, LLC\n\n\n\nExecutive Summary \n\n\n\nThis Executive Summary briefly reviews the major elements of the Risk Management Plan (RMP) for\n\nFlint Hills Resources Fairmont, LLC (FHR Fairmont) ethanol production facility located near the\n\nCity of Fairmont, Fillmore County, Nebraska.  This summary is presented in response to the requirements of the United States Environmental Protection Agency (EPA) under Title 40 of the Code of Federal Regulations, Part 68 (40 CFR 68) and Section 112(r) of the Clean Air Act. FHR Fairmont is subject to the RMP rule due to the onsite storage of natural gasoline (denaturant), a regulated flammable mixture, above the threshold quantities.\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\nFHR Fairmont is committed to protecting the environment and operating FHR Fairmont in a manner that promotes the safety of employees and the general public. Management has adopted and implemented policies that adhere to applicable federal and state rules and regulations, and as such the design and construction of FHR Fairmont has incorporated physical and operational safeguards to prevent accidental releases. Through the proper design, installation, operation and maintenance of the equipment, and the training of personnel, FHR Fairmont has minimized the hazard to human health and the environment from fires, explosions, or any unplanned sudden or non-sudden release of hazardous materials.\n\n\n\nIn the event of a release, the FHR Fairmont's emergency response is described in its Emergency Response Action Plan (ERAP) and Spill Prevention Control and Countermeasures (SPCC) Plan. The ERAP consist of procedures for responding to releases, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address emergency response (including proper first-aid and medical treatment for exposures), evacuation plans and accounting for personnel after an e"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060719,
      "SummaryText": "vacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident cleanup and decontamination requirements. In addition, FHR Fairmont has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions on the use of emergency response equipment. Employees receive training on performing their specific emergency response duties. The emergency response program is updated when necessary based on modifications made to FHR Fairmont processes or emergency response procedures.\n\n\n\n2. Facility Description and Regulated Substances Handled\n\n\n\nFHR Fairmont is a corn-based denatured ethanol fuel production plant which operates 24 hours per day, 7 days per week. Ethanol is produced through the conversion of corn starch to sugars and then conversion of the sugars to ethanol (i.e., grain alcohol) through a batch fermentation and continuous distillation process.\n\n\n\nThe RMP regulated material stored at FHR Fairmont is natural gasoline which is used as a denaturant in the ethanol fuel product.\n\n\n\n3. Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\n\n\nFHR Fairmont has programs in place to address accidental release prevention measures required by EPA, Process Safety Management (PSM) requirements from the Occupational Safety and Health Administration (OSHA), and notification requirements of EPA's Emergency Response and Community Right-to-Know (EPCRA) regulations. FHR Fairmont complies with RMP for the management of regulated substances such as ethanol, fuel additives, and denaturant (natural gasoline).\n\n\n\nFive Year Accident History\n\nThe site has not had any RMP reportable events within the past 5 years. \n\n\n\nEmployee Participation\n\nFHR encourages employees to participate in safety management and accident prevention. FHR Fairmont has developed an employee participation program as part of the RMP program. Process safety information, process hazard analysis (PHA)"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060719,
      "SummaryText": " results, recommendations, and action items, incident investigations, compliance audits, operating procedures, emergency response plan, and records of management of change are available to the operating personnel.\n\n\n\nProcess Hazard Analysis and Process Safety Information\n\nFHR Fairmont utilizes the HAZOP PHA methodology. The PHA identified the following potential major hazards: fire, explosion, over-pressurization, overfilling, equipment failure, and the loss of cooling, heating, electricity, and instrument air. FHR Fairmont utilizes process controls such as vents, relief valves, check valves, manual and automatic shutoffs, interlocks, alarms and procedures, rupture discs, excess flow devices, and grounding equipment to prevent or limit releases. FHR Fairmont also utilizes dike containment around FHR Fairmont's storage tanks, including the denaturant storage tank, to contain and mitigate liquid releases.\n\n\n\nFHR Fairmont keeps a variety of technical documents onsite that are used to help maintain safe operation of FHR Fairmont and provide information about the design and construction of process equipment. This information includes materials of construction, design pressure and temperature ratings, electrical rating of equipment, piping and instrument drawings. \n\n\n\nOperating Procedures and Training\n\nFHR Fairmont is responsible for developing and implementing written operating procedures that provide clear instructions for safely conducting activities involved in each covered process consistent with the RMP. The operating procedures that have been developed have been prepared as a guide for those involved with initial start-up, normal operation, normal shutdown and emergency shutdown of the process. FHR Fairmont has developed and implemented a comprehensive training program for employees involved in facility operations.\n\n\n\nContractors\n\nFHR Fairmont's contractor safety procedures establish minimum guidelines and activities in order to assure that the contractor's employe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000060719,
      "SummaryText": "es follow safe work practices and procedures. Prior to awarding contracts, an FHR Fairmont representative evaluates the prior safety performance of any prospective contractor. After the contractor has been selected, the FHR Fairmont representative conducts a contractor orientation meeting with the contract employer representative. At that time, FHR reviews known potential fire, explosion, or toxic release hazards that are related to the contractor's work and the covered process. The contract employer representative is also informed of the applicable provisions of the emergency action plan, conditions regarding entrance to the process and the applicable safe work practices that must be followed in order to work at the site. Because contractors may work on or near the process equipment, FHR Fairmont has procedures in place to ensure that contractors perform their work in a safe manner, have the appropriate knowledge and skills, and are aware of the hazards in their workplace.\n\n\n\nPre-Startup Safety Reviews\n\nAs part of the management of change (MOC) process, whenever a modification to the existing process is planned, either temporary or permanent, FHR Fairmont requires a Pre-Startup Safety Review (PSSR). The PSSR confirms that, prior to putting into service, the construction and equipment being used is in accordance with design specifications. The PSSR also confirms that the safety, operating, maintenance, and emergency procedures are in place and adequate training for each involved employee has been completed. A PSSR includes field verification of the construction and serves as a quality assurance function by requiring verification that accident prevention measures are properly implemented.\n\n\n\nMechanical Integrity\n\nFHR Fairmont's mechanical integrity program was developed as part of RMP that defines requirements for ensuring the integrity of process equipment. Written procedures help ensure the safe implementation of maintenance activities thus promoting the reliabilit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000060719,
      "SummaryText": "y and integrity of process equipment. This program also includes training, regular inspections and equipment testing.\n\n\n\nSafe Work Practices\n\nFHR Fairmont has safe work practices in place to ensure worker and process safety. These safety standards control entry into work areas and confined spaces, specify procedures to follow for isolating energy sources by lockout/tag-out and describe the permitting process for completing work at FHR Fairmont. Safety standards and work procedures are reviewed annually.\n\n\n\nHot Work Permit\n\nFHR Fairmont has a hot work permit program that details areas which require a permit and those areas for which a permit is not required. A hot work permit is required in process areas for cutting, welding, spark-producing equipment, etc., except in designated areas. The procedure includes accountability and responsibility for authorizing and issuing the hot work permit, display of the permit at the site of the hot work until the work is completed, site inspection, designation of appropriate precautions to be taken with the hot work, and assignment of a fire watch where appropriate.\n\n\n\nManagement of Change\n\nFHR Fairmont's MOC program reviews proposed changes to process chemicals, technology, equipment, procedures, materials, and design conditions prior to implementation of the change. Changes are reviewed by an interdisciplinary team to ensure that adequate controls are in place to manage any new hazards, and to verify that existing controls have not been compromised by a process change.\n\n\n\nIncident Investigation\n\nFHR Fairmont has procedures to promptly investigate any incident that has resulted in, or could reasonably result in a release of a regulated substance, fire/explosion, major property damage, environmental damage, or personal injury. The procedure establishes the minimum guidelines and activities of the incident investigation program in order to reduce the likelihood of repetitive occurrences of events which could reasonably lead to catas"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000060719,
      "SummaryText": "trophic releases. Investigations will be undertaken by a team to identify the situation leading to the incident as well as any corrective actions to prevent a similar release in the future. Corrective actions are tracked until they are completed. Incident investigation reports are retained for at least five years.\n\n\n\nCompliance Audits\n\nFHR Fairmont regularly conducts audits of the provisions of RMP and PSM to verify that procedures and practices developed under the standard are adequate and are being followed. A compliance audit of each program is conducted every three years. The audits include but are not limited to a review of documentation and process safety information, inspection of the physical facilities, and interviews with all levels of plant personnel. The audit team develops findings that are included in an audit report and forwarded to facility management for resolution. Findings and corrective actions taken in response to each finding are tracked until completion.\n\n\n\nChemical-Specific Prevention Steps\n\nThe processes at FHR Fairmont include hazards that must be managed to ensure continued safe operation. The RMP Program elements summarized previously apply to the denaturant processes. Collectively, these program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors. In addition to RMP, the facility has instrumentation and equipment to detect, contain, and reduce the consequences of a release, including:\n\n\n\nRelease Detection\n\n- Monitoring equipment to detect temperature, level, and pressure changes\n\n- Hand held air monitoring equipment with oxygen, LEL, CO and H2S monitoring sensors\n\n\n\nRelease Containment/Control\n\n- Atmospheric relief devices\n\n- Valves to permit isolation of the process\n\n- Shutdown systems\n\n- Redundant equipment and instrumentation (i.e., uninterruptible power supply for the process control system) \n\n\n\nRelease Mitigation\n\n- Secondary containment to contain liquid releases\n\n- Fire "
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000060719,
      "SummaryText": "suppression and extinguishing systems\n\n- Trained emergency response personnel\n\n- Emergency response equipment located on-site\n\n- FHR Personnel respond to small spills on-site\n\n\n\n4. Accident History\n\nFHR Fairmont has not had any accidents reportable under RMP within the past five years.\n\n\n\n5. Emergency Response Program\n\nAs discussed above, FHR Fairmont maintains a written ERAP. The purpose of these documents is to protect worker and public safety as well as the environment. These documents address aspects of emergency response, step-by-step emergency situation assessments, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post-incident requirements. In addition, FHR Fairmont has procedures that address maintenance, inspection, and testing of emergency response equipment, as well as instructions that address the use of emergency response equipment. Employees receive training in these procedures according to their role at the site, so that they are prepared and capable to respond up to incipient level fires or spills incident potentials. FHR Fairmont works with the local fire department and emergency responders to ensure the proper execution of the site plans. The emergency response program will be updated when necessary based on modifications made to facility processes.\n\n\n\n6. Planned Changes to Improve Safety\n\nFHR Fairmont has been designed and constructed to meet existing construction and process safety requirements. FHR Fairmont continually reviews safety practices and equipment, and maintenance programs are monitored on an ongoing basis.\n\n"
    }
  ]
}