{
  "FacilityID": 1000012007,
  "FacilityName": "Sysco Central Ohio, Inc.",
  "FacilityStr1": "2400 Harrison Road",
  "FacilityStr2": null,
  "FacilityCity": "Columbus",
  "FacilityState": "OH",
  "FacilityZipCode": "43204",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "39049",
  "LEPC": "Franklin County LEPC",
  "FacilityLatDecDegs": "39.970000",
  "FacilityLongDecDegs": "-083.065833",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.sysco.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Sysco Corporation",
  "Company2Name": null,
  "CompanyDUNS": 51099661,
  "Company2DUNS": 0,
  "OperatorName": "Sysco Central Ohio, Inc.",
  "OperatorStr1": "2400 Harrison Road",
  "OperatorStr2": null,
  "OperatorCity": "Columbus",
  "OperatorStateFIPS": "OH",
  "OperatorZipCode": "43204",
  "OperatorZipCodeExt": null,
  "RMPContact": "Mike Woods",
  "RMPTitle": "Safety Manager",
  "FTE": 249,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000168356",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2003-08-06 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-07-20 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-07-20 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-07-20 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-07-20 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 39.97004,
  "FRS_Long": -83.065,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000014718,
      "AltID": "NH3 Refrigeration System",
      "FacilityID": 1000012007,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000015061,
          "ProcessID": 1000014718,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000017083,
          "ProcessID": 1000014718,
          "ChemicalID": 56,
          "Quantity": 22000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000517083,
          "ProcessID": 1000014718,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012007,
      "SummaryText": "The Stationary Source and Regulated Substances Handled  --\n\nSysco Central Ohio, Inc. is a fully owned subsidiary of Sysco Corporation that provides food distribution and storage services for hospitals, schools, nursing home, restaurants and other commercial and professional facilities.  The Columbus facility is a refrigerated food distribution warehouse located two miles northwest of the downtown business district.   We currently have 249 employees.  Our refrigeration system uses Anhydrous Ammonia which is regulated by the EPA's RMP.  The many programs utilized by RMP are part of what we do on a daily basis to make sure that we protect the community and our associates.  The many prevention programs utilized by RMP are also used in a variety of other ways in our facility to help us assure a safe and healthy work force.  As part of Sysco, safety is our top priority and we expect to have the safest warehouse in the country.  --  \n\nTHE ACCIDENTAL RELEASE PREVENTION PROGRAM AND EMERGENCY RESPONSE POLICIES AT THE STATIONARY SOURCE: \n\n It is the policy of Sysco Central Ohio, Inc. to meet and exceed all requirements established by applicable safety, health and environmental regulations given to us by all state, local and federal agencies.  Our policy is to minimumize the potential for harm to site employees and contractors, the public and the environment, and to have in place contingency actions coordinated with local responding agencies for the unlikely event of a serious accidental ammonia release.\n\nTHE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\nSysco Central Ohio, Inc. has in place a thorough and ongoing PSM program.  The program calls for the implementation and maintenance of procedural and engineered safeguards at the facility to minimize the likelihood of a significant release of ammonia and to eliminate or reduce the effects of any release that might occur.  We have invested and will continue to invest substantial effort and"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012007,
      "SummaryText": " capital to make sure that we continue a strong safety performance.  We are involved in the following activities on a daily basis that incorporate the elements of our Process Safety and Risk Management Plans:\n\n1)  Process Hazard Analysis - We perform and maintain up to date reviews of our operations to identify what could go wrong and identify the necessary means to prevent the situation.  We also monitor our system and continuously improve its performance in the area of safety.\n2)  Process Design - Our systems and equipment are designed for safety in accordance with applicable industry standards and best engineering practices.  Designs include automatic emergency shutdowns, pressure relief devices, ventilation systems and release sensing systems.  Our refrigeration system is computer controlled which includes internal checks for abnormal conditions.  Our storage vessels are located indoors and protected by a key card security system.\n3)  Training - Our associates and contractors are trained on their job tasks, safe work practices and emergency response actions.  Training is continuously reviewed and enhance by our safety department.  Associates are trained on all required topics upon hire and then annually or before if needed.  Associates also participate in weekly safety meetings that cover a wide variety of safety materials.  \n4)  Maintenance - Each item of equipment that is involved in maintaining safety or in responding to an abnormal situation is inspected, tested and / or maintained on a frequency that reflects its service and condition.\n5)  Management of Change - No change to a piece of equipment or procedures can take place without a thorough review of the implications of that change to safety.  No change must adversely impact the safety built into the design and operations of our refrigeration system.  \n\nOur PSM program is tuned to reflect the hazards of Anhydrous Ammonia.  Our operating, maintenance, safe work, emergency response, training programs and se"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012007,
      "SummaryText": "lection of necessary PPE are all based on the appropriate requirements for Anhydrous Ammonia.  Also, our equipment is selected based on its intended service and chemical exposures including release detection devices.\n\nFIVE YEAR ACCIDENT HISTORY\n\nWe have had no events at the Sysco Central Ohio, Inc. facility that would qualify for inclusion in the RMP 5 year accident history.  We have never had a reportable release of ammonia.\n\nTHE EMERGENCY RESPONSE PROGRAM\n\nWe have in place a written emergency response plan that is coordinated with the Franklin County LEPC and the Columbus Fire Department.  All new associates, visitors and contractors are trained on the plan, and refresher training is conducted annually.  The plan itself is reviewed on an annual basis and is in compliance with all applicable local, state and federal regulations.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nOur safety program is an ongoing process involving the constant identification of all potential hazards and threats and the elimination of these hazards.  We continue to work with our associates, contractors and community to make the necessary changes to enhance our safety program.\n\n\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       "
    }
  ]
}