{
  "FacilityID": 1000075061,
  "FacilityName": "Willmar Municipal Utilities (Southwest Plant)",
  "FacilityStr1": "900 SW 18th Street",
  "FacilityStr2": null,
  "FacilityCity": "Willmar",
  "FacilityState": "MN",
  "FacilityZipCode": "56201",
  "Facility4DigitZipExt": "0937",
  "FacilityCountyFIPS": "27067",
  "LEPC": "Willmar Fire Department",
  "FacilityLatDecDegs": "45.113100",
  "FacilityLongDecDegs": "-095.067000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PG",
  "FacilityURL": "www.wmu.willmar.mn.us",
  "FacilityEmailAddress": "wmu@wmu.willmar.mn.us",
  "FacilityDUNS": 967306788,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Willmar Municipal Utilities",
  "OperatorStr1": "PO Box 937",
  "OperatorStr2": null,
  "OperatorCity": "Willmar",
  "OperatorStateFIPS": "MN",
  "OperatorZipCode": "56201",
  "OperatorZipCodeExt": "0937",
  "RMPContact": "John Harren",
  "RMPTitle": "General Manager",
  "FTE": 0,
  "OtherEPAFacilityID": "MND985668896",
  "EPAFacilityID": "100000058769",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-06-09 00:00:00",
  "SafetyInspectionBy": "Minnesota Municipal Utilities Association",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-01-04 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-01-04 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-01-04 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-01-04 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 45.11139,
  "FRS_Long": -95.0225,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "30",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000093479,
      "AltID": "Water Chlorination",
      "FacilityID": 1000075061,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000094760,
          "ProcessID": 1000093479,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000116988,
          "ProcessID": 1000093479,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000616988,
          "ProcessID": 1000093479,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000075061,
      "SummaryText": "Willmar Municipal Utilities provides water, heat, and electricity to a community of approximately 20,000 people in central Minnesota.  The only part of these operations that requires a \"RMP\" to be submitted is the water treatment and supply facility due to the amount of chlorine that is used to inject chlorine into the water supply.  The systems that are used to perform this task have been designed to operate as safely as today's technology can provide.  Early detection alarm systems and emergency response procedures are maintained to promptly address the remote possibility of a system failure that could cause a release of hazardous chemicals from the treatment system.\n\n\n\nWillmar Municipal Utilities (WMU) maintains a very vigorous training schedule for all employees in the areas of technical expertise, safety procedures, and emergency response.  The amount of chlorine stored at each of the two (2) water treatment plants requires WMU to implement a Risk Management Plan Level 2 Prevention Program.  The facilities have implemented the prevention program requirements and have completed hazard reviews, compliance audits, and they have also implemented operating procedures, training, maintenance activities, and incident investigation procedures.  The employees at WMU are efficient at performing their duties in a manner that prevents incidents and injuries.  Most Minnesota companies and organizations have been operating under the Minnesota OSHA workplace program for the reduction of injuries called \"AWAIR\" since 1990.  WMU has been constantly working on evaluating and improving safe operations for many years.\n\n\n\nThe system that is utilized for chlorine injection at the WMU water plants is a Hydro Instruments one ton container mounted gas feeder.  This system operates on a vacuum principal that gives it a degree of fail-safe operation.  Any failure in valves or lines between the chlorine cylinder and injector nozzle will cause a loss of vacuum that will close a regulator va"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000075061,
      "SummaryText": "lve to stop any release of chemical.  One 1-ton cylinder is connected in service and one 1-ton cylinder is connected in standby at each plant.  A spare 1-ton cylinder may also be located at the Southwest Water Treatment Plant.\n\n\n\nShould a regulator fail to operate, there is a possibility of a low pressure leak from the cylinder.  To maintain a high degree of assurance that this will not happen, these regulators are rotationally replaced on a four (4) year cycle.  In addition, a Powell MaxPro RA Valve Closure System is in place on each regulator valve.  Each cylinder, when empty, is shipped back to the chemical supply company to be tested and recertified before filling again.\n\n\n\nIf any of the safety features of this system should fail to prevent a release from the chlorine feeder system, there is a low level alarm system in operation at all times.  The cylinders are stored in a closed room built of concrete and cement block.  They are not vented to the outside unless a manual switch is turned on.  An alarm will sound in the power plant control room (staffed 24 hours a day) if there is a detectable amount of chlorine over 0.25 ppm.  The control room operator will then call the emergency response team to respond to the location of the problem.  \n\n\n\nOnce the emergency team has arrived at the location of the alarm, they will perform a remote air monitoring procedure to determine the concentration of chlorine inside the storage building.  These employees are trained to operate at the \"technician level\" under the OSHA 1910.120 standard (HAZWOPER) at the level \"C\" requirement for Personal Protective Equipment.  If air monitoring results show that the concentration of chlorine is too high for the safe use of a full face negative pressure respirator, the emergency team will seal off the area and call for the local fire department to respond.  The local fire department will oversee and conduct all response activities.  If air monitoring results show that safe entry could be ma"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000075061,
      "SummaryText": "de (less than 5 ppm), these employees will gain entry and repair the problem.\n\n\n\nThis system and its safeguards, along with WMU employees' professional approach to prevent accidents with this and other chemicals used at their facility, has proven to be very effective at attaining a record of very few releases and minimal amounts of chemical lost during an emergency event.  In the past five years, WMU has not had an accident involving chlorine that resulted in any on-site deaths, injuries, or significant property damage, evacuations, or shelterings in place.  It is the focus of WMU to maintain that record and look into ways to improve the engineering, operations, and training of employees whenever possible."
    }
  ]
}