{
  "FacilityID": 1000048658,
  "FacilityName": "Huntingdon Water Treatment Plant",
  "FacilityStr1": "153 Waterworks Ave.",
  "FacilityStr2": null,
  "FacilityCity": "Huntingdon",
  "FacilityState": "PA",
  "FacilityZipCode": "16652",
  "Facility4DigitZipExt": "1540",
  "FacilityCountyFIPS": "42061",
  "LEPC": "Huntingdon County LEPC",
  "FacilityLatDecDegs": "40.481111",
  "FacilityLongDecDegs": "-078.003333",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "IP",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Borough of Huntingdon",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Borough of Huntingdon",
  "OperatorStr1": "530 Washington Street",
  "OperatorStr2": null,
  "OperatorCity": "Huntingdon",
  "OperatorStateFIPS": "PA",
  "OperatorZipCode": "16652",
  "OperatorZipCodeExt": "1540",
  "RMPContact": "Steve Williams",
  "RMPTitle": "WTP Superintendent",
  "FTE": 4,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000071726",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-07-31 00:00:00",
  "SafetyInspectionBy": "ES2 Inc.",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-01-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-02-10 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-02-10 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2020-02-10 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 40.4849,
  "FRS_Long": -78.0111,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ZIP+4 CENTROID",
  "HorizontalAccMeasure": "2.4",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060986,
      "AltID": null,
      "FacilityID": 1000048658,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000062148,
          "ProcessID": 1000060986,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000074690,
          "ProcessID": 1000060986,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000574690,
          "ProcessID": 1000060986,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048658,
      "SummaryText": "Executive Summary\n\n\n\nHuntingdon Water Treatment Plant\n\n2nd & Water Works Avenue\n\nHuntingdon, PA  16652\n\n\n\n\n\nThe Borough of Huntingdon takes pride in observing the required safety precautions in \n\npreventing hazards in the workplace, and has emergency response plans in effect in the event of \n\naccidental releases of regulated substances. The emergency response plans are tailored to each \n\nfacility owned and operated by the Borough of Huntingdon. The Borough employs the latest \n\ntechnology in process controls and monitoring detection systems. Active and passive mitigation \n\nsystems are designed to minimize the impacts of any accidental releases of regulated substances.\n\n\n\nThe Huntingdon Water Treatment Plant (WTP), owned and operated by the Borough of \n\nHuntingdon, provides water service to residential, commercial and industrial users in the \n\nBorough of Huntingdon and in portions of Smithfield and Walker Townships. The Huntingdon \n\nWTP utilizes one (1) chemical onsite which is subject to the Chemical Accident Prevention \n\nprovisions found at 40 CFR Part 68. This toxic substance is Chlorine. Chlorine is used for \n\ndisinfection of the treated water prior to its distribution to the customers. \n\n\n\nTypically, there are two (2) one-ton cylinders of Chlorine present onsite at any given time. These \n\ncylinders are located in a brick chemical storage building. The room containing the cylinders \n\nvents to the outside. The chlorination feed system has manual and automatic shutoffs. A remote \n\nalarm system is employed to notify employees of any releases of chlorine gas. Safety equipment \n\nis located nearby. The facility is manned 8 hours per day, five days per week. Gates to the facility \n\nare locked when personnel are not on duty, therefore, the chlorination building is not accessible \n\nto the public. The doors to both the chlorine cylinder storage area and the feed system room are \n\nkept locked at all times.\n\n\n\nThe offsite consequence analysis conducted for the Huntingdon WTP "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048658,
      "SummaryText": "consisted of two scenarios, \n\nworst-case release and alternative release. The parameters for the worst-case release scenario are \n\nestablished by EPA. These parameters assume the maximum quantity in the largest vessel is \n\nreleased over a 10-minute period with default wind speed, temperature and humidity conditions. \n\nThe only passive mitigation present at the Huntingdon WTP is the fact that the chlorine cylinders \n\nare stored in a building which vents to the outside air. Using EPAA?s RMP*Comp model, the \n\nestimated distance to the toxic endpoint for a worst-case release is 0.9 mile. According to \n\nLandView 6 software, the estimated residential population within the 0.9 mile radius of the \n\nfacility is 3,292 persons based on 2000 U.S. census data. Other than the residential population, \n\nthere are a few commercial establishments, a church, a county prison, and a recreational area \n\nlocated within this measured radius.\n\n\n\nThe proposed alternative release scenario assumes a release will occur due to equipment failure. \n\nThe assumed parameters used in the RMP*Comp model are based on an actual incident that \n\noccurred at the BoroughA?s WWTP in 1997, in which a screw on the yoke assembly of the \n\nregulator could not be tightened and a small amount of chlorine was released. It is estimated that \n\nthe duration of the release was less than one minute and that no more than one pound of chlorine \n\nwas actually released into the room atmosphere. The estimated distance to the toxic endpoint for \n\nthe alternative release is less than 0.1 mile. According to LandView 6 software, the estimated \n\nresidential population within the 0.1 mile radius of the facility is 15 persons based on 2000 U.S. \n\ncensus data. \n\n\n\nA prevention program policy document was developed for the Huntingdon WTP in accordance \n\nwith regulations found at 40 CFR A?A?68.48-68.60. The facility is classified as a Program 2 \n\nfacility. Huntingdon WTPA?s Program 2 Prevention Program summarizes the pertinent safety \n\n"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048658,
      "SummaryText": "information, hazard review procedures, operating procedures, training requirements, maintenance \n\nprocedures, compliance audits and incident investigation policies. \n\n\n\nThe facility has standard operating procedures (SOPs) in effect for operation and maintenance of \n\nthe chlorination system. These SOPs are readily accessible to the chlorine building. Safety \n\nprecautions include, checking the chlorine detector before entering the cylinder room, use of a \n\nface mask and other appropriate personal protective equipment, and testing for leaks with \n\nammonia solution. A chlorine emergency kit A?BA? for 1-ton cylinders is available to contain small \n\nleaks and for minor repairs. Appropriate training on the use of the chlorine kit is provided to all \n\nemployees. Other training plant employees are offered include: confined space entry, first aid and \n\nCPR. Documentation of the training events for each employee is maintained in the employeesA? \n\npersonnel file.\n\n\n\nThe Huntingdon WTP has an Emergency Response Plan which has been coordinated through the \n\nHuntingdon County LEPC. The Plan provides notification procedures, emergency response \n\nprocedures, reporting requirements, and coordination efforts of all involved parties. The plan is \n\nreviewed and revised periodically to ensure contact names and telephone numbers are correct."
    }
  ]
}