{
  "FacilityID": 1000062328,
  "FacilityName": "Bedrock Liquids Handling Facility",
  "FacilityStr1": "3673 W US Highway 190",
  "FacilityStr2": null,
  "FacilityCity": "Ozona",
  "FacilityState": "TX",
  "FacilityZipCode": "76943",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48105",
  "LEPC": "Crockett County LEPC",
  "FacilityLatDecDegs": "30.909762",
  "FacilityLongDecDegs": "-101.283729",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "GO",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Leesburg LP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Leesburg LP",
  "OperatorStr1": "3963 Maple Ave",
  "OperatorStr2": "Suite 300",
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75219",
  "OperatorZipCodeExt": null,
  "RMPContact": "Julie Lang",
  "RMPTitle": "Director of Regulatory Affairs",
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000234819",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "137092",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-02-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-02-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-02-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078165,
      "AltID": "Nat Gas Processing Plant",
      "FacilityID": 1000062328,
      "ProgramLevel": 1,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000079345,
          "ProcessID": 1000078165,
          "NAICSCode": "42471",
          "_desc": {
            "NAICS_CODE": "42471",
            "NAICS_DESCRIPTION": "Petroleum Bulk Stations and Terminals"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000097135,
          "ProcessID": 1000078165,
          "ChemicalID": 155,
          "Quantity": 907860.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000085711,
              "ProcessChemicalID": 1000097135,
              "ChemicalID": 93,
              "_chemical": {
                "ChemicalID": 93,
                "ChemicalName": "Methane",
                "CASNumber": "74-82-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000085712,
              "ProcessChemicalID": 1000097135,
              "ChemicalID": 94,
              "_chemical": {
                "ChemicalID": 94,
                "ChemicalName": "Ethane",
                "CASNumber": "74-84-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000085713,
              "ProcessChemicalID": 1000097135,
              "ChemicalID": 98,
              "_chemical": {
                "ChemicalID": 98,
                "ChemicalName": "Propane",
                "CASNumber": "74-98-6",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000085714,
              "ProcessChemicalID": 1000097135,
              "ChemicalID": 107,
              "_chemical": {
                "ChemicalID": 107,
                "ChemicalName": "Isobutane  [Propane, 2-methyl]",
                "CASNumber": "75-28-5",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000085715,
              "ProcessChemicalID": 1000097135,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000085716,
              "ProcessChemicalID": 1000097135,
              "ChemicalID": 115,
              "_chemical": {
                "ChemicalID": 115,
                "ChemicalName": "Isopentane  [Butane, 2-methyl-]",
                "CASNumber": "78-78-4",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000085717,
              "ProcessChemicalID": 1000097135,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000597135,
          "ProcessID": 1000078165,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062328,
      "SummaryText": "Accidental Release Prevention and Response Policies\n\nPrism Midstream, LLC is committed to worker protection and public safety.  This commitment is determined by the resources invested in accident prevention, which includes training of personnel and consideration of safety in the design, installation, operation and maintenance of the facility.\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\nPrism Midstream, LLC owns and operates the Bedrock Liquids Handling Facility, a natural gas processing plant, located in Crockett County, Texas.  The handling facility is designed to store both NGLs and condensate.  The incoming NGL streams and condensate are stabilized and treated to meet sales specifications and routed to pressurized tanks for storage.  As evidenced in the ensuing text and based on criteria outlined in the Accidental Release Prevention (ARP) Program, the Bedrock Liquids Handling Facility is a Program 1 process.\n\n\n\nThe regulated flammable substances identified at the facility are NGL and unstabilized condensate.  For the purpose of identifying the maximum release quantity for use in determining potential off-site impacts, it is assumed that the entire contents of the vessel or the system are released to the atmosphere, forming a vapor cloud.  NGL (Off Spec) stored in TK-103 (Off Spec NGL Storage Tank) with a level of 54,000 gallons was determined to result in the WCS.  The distance to the endpoint of 1-psi overpressure for the worst-case release of the flammable mixture was calculated and determined to be 0.52 mile.\n\n\n\nFive-Year Accident Facility\n\nThe Bedrock Liquids Handling Facility is a new facility; therefore, this facility has not had any accidental releases during the past five years that meet the criteria for an accidental release as discussed in 40 CFR 68.42.\n\n\n\nLocal Emergency Response Coordination\n\nThe Bedrock Liquids Handling Facility has coordinated emergency response activities with the local fire department.  Also, operators of the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062328,
      "SummaryText": " facility are equipped with a written emergency response plan.  This plan includes information regarding adequate first aid and medical treatment, evacuations, notification of local emergency response agencies and the public and decontamination of the affected area after the incident has occurred.\n\n\n\nGeneral Accidental Release Prevention Program\n\nThe Bedrock Liquids Handling Facility has processes that are subject to EPA's RMP regulations and the OSHA's PSM standards; therefore this summary addresses each of the required elements and describes the management system in place to implement the accident prevention program.\n\n\n\nEmployee Participation\n\nAll level of employees and contract employees are encouraged to participate in making a safe work environment.  Employees are asked to provide opinions concerning accident prevention issues and to recommend improvements.  Employees are expected to maintain rule compliance based on their knowledge, experience and job responsibilities.\n\n\n\nProcess Safety Information\n\nThe Bedrock Liquids Handling Facility maintains a detailed record of information for identifying and understanding the chemical hazards, operating parameters and equipment designs associated with the facility processes.\n\n\n\nProcess Hazard Analysis (PHA)\n\nPrism Midstream, LLC conducts comprehensive studies to help ensure that hazards associated with various processes are identified and controlled efficiently.  These studies are completed by a team of qualified personnel with expertise in engineering and process operations.  To help ensure that the process controls and/or process hazards do not eventually deviated from the original designed safety features, the handling facility updates and revalidates the hazard analysis at least every five years.\n\n\n\nOperating Procedures\n\nThe Bedrock facility maintains written procedures that identify various modes of process operation, such as initial startup, normal/temporary operations, emergency/normal shutdown, and startup follo"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062328,
      "SummaryText": "wing a turnaround or emergency shutdown.  Operating procedures are frequently reviewed and certified as current.  When a process change occurs, operating procedures are revised as necessary.\n\n\n\nTraining\n\nPrism Midstream, LLC has a comprehensive training program in place to ensure that employees are competent in the operating procedures associated with the facility.  \n\n\n\nHot Work Permit \n\nThe Bedrock HG Liquids Handling Facility issues hot work permits for all how work operations and provided all employees with hot work permit training.\n\n\n\nContractors\n\nOn occasion, contractors are hired to conduct specialized maintenance and construction activities.  The Bedrock facility has procedures in place to ensure that contractors are trained in the work practices of the facility, follow the safety rules of the facility, advise the facility employees of any unique hazards presented by the contractor and notify the facility of all illnesses and injuries that occur in process areas.\n\n\n\nPre-Startup Safety Reviews (PSSRs)\n\nThe Bedrock facility conducts a PSSR for facility modifications that require a change in the process safety information.  The PSSR is to ensure that safety features, procedures, personnel and equipment are appropriately prepared for startup prior to placing the equipment into service.  A standard checklist is used to document compliance.\n\n\n\n\n\nMechanical Integrity\n\nHighly documented maintenance checks on all equipment are completed at the Bedrock facility to ensure proper operations.  Equipment examples include pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls, pumps, valves and temperature and pressure switches.  Maintenance operations are completed by qualified personnel with training in maintenance practices.  Maintenance personnel receive training on the process, process hazards and procedures applicable to the employee's job tasks.  Any equipment deficiencies identified by the maintenance checks ar"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062328,
      "SummaryText": "e corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nThe Bedrock Liquids Handling Facility has written procedures in place to manage and document changes to all covered processes.  To control and manage facility changes, a systematic approach is followed to minimize the possibility that such changes will have an adverse impact on personnel safety, equipment or the environment.  Any employees, process operators or maintenance personnel whose job tasks are affected by a modification in process conditions are promptly made aware of and offered training to deal with the modification.\n\n\n\nIncident Investigation\n\nPrism Midstream, LLC promptly investigates all incidents that result in, or could reasonably result in, a catastrophic release of a regulated substance.  The investigation is led by an incident investigation team consisting of those with appropriate knowledge and experience in the process.  These investigations are completed to identify the situation leading to the incident, as well as corrective actions that could prevent the release from reoccurring.  The findings of the investigation are documented and the results are reviewed by all employees who have the potential to be affected by the findings.\n\n\n\nEmergency Planning and Response\n\nThe Bedrock facility keeps a written emergency response plan onsite which includes the designated actions the company and all employees will take to ensure personal safety from fire and other emergencies.  The plan outlines actions that employees are to take when there is a release and facilitates the prompt evacuation of employees when necessary.\n\n\n\nCompliance Audits\n\nThe Bedrock facility will conduct audits to determine whether the procedures and practices required by the accident prevention program are being properly implemented.  The audit team will include individuals knowledgeable in the process, operations personnel and at least one employee with training in audit techniques and practices.  These audits will be c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000062328,
      "SummaryText": "ompleted at least every three years and any required corrective action will be completed in a safe and prompt manner.\n\n\n\nChanges to Improve Safety\n\nPrism Midstream, LLC is committed to operating the Bedrock Liquids Handling Facility in a safe manner for employees, the public and the environment.  The Bedrock facility will conduct compliance audits and hazard reviews as required and will make improvements to safety based on the findings from the audits and reviews.\n\n"
    }
  ]
}