{
  "FacilityID": 1000009286,
  "FacilityName": "Sioux Falls Water Purification Plant",
  "FacilityStr1": "2100 North Minnesota Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Sioux Falls",
  "FacilityState": "SD",
  "FacilityZipCode": "57104",
  "Facility4DigitZipExt": "0111",
  "FacilityCountyFIPS": "46099",
  "LEPC": "Minnehaha Civil Defense",
  "FacilityLatDecDegs": "43.571111",
  "FacilityLongDecDegs": "-096.729167",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "ST",
  "FacilityURL": "www.siouxfalls.org",
  "FacilityEmailAddress": "ganderson@siouxfalls.org",
  "FacilityDUNS": 78034683,
  "ParentCompanyName": "City of Sioux Falls Public Works",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Sioux Falls Public Works",
  "OperatorStr1": "2100 North Minnesota Avenue",
  "OperatorStr2": "PO Box 7402",
  "OperatorCity": "Sioux Falls",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57117",
  "OperatorZipCodeExt": "7402",
  "FTE": 33,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000050534",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2002-02-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2010-09-09 09:48:50",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-07-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.5715,
  "FRS_Long": -96.73044,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000010872,
      "AltID": null,
      "FacilityID": 1000009286,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012385,
          "ProcessID": 1000010872,
          "ChemicalID": 62,
          "Quantity": 76000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000011253,
          "ProcessID": 1000010872,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000008089,
              "Process_NAICS_ID": 1000011253,
              "SafetyReviewDate": "2008-12-01 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Uniform building and fire code.  The Chlorine Institute pamphlets and USEPA Municipal Wastewater Disinfection Design Manual",
              "FR_Comments": "The above plus CH2M Hill's design guidelines were used to verify facility design.",
              "HazardReviewDate": "2009-05-22 00:00:00",
              "ChangeCompletionDate": "2009-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Various, see Prevention Program",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "System enclosed in building",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Scrubber installed",
              "OpProceduresReviewDate": "2006-06-01 00:00:00",
              "TrainingReviewDate": "2008-06-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "vendor",
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-06-01 00:00:00",
              "EquipmentInspectionDate": "2009-05-21 00:00:00",
              "EquipmentTested": "See PM schedule, equipment is inspected and tested as part of routine preventive maintenance",
              "ComplianceAuditDate": "2008-12-01 00:00:00",
              "AuditCompletionDate": "2009-06-30 00:00:00",
              "IncidentInvestigationDate": "2004-02-26 00:00:00",
              "InvestigationChangeDate": "2004-10-30 00:00:00",
              "MostRecentChangeDate": "2008-12-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000008355,
                  "PreventionProgram2ID": 1000008089,
                  "ProcessChemicalID": 1000012385
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000009286,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2008-12-01 00:00:00",
    "ERTrainingDate": "2008-06-01 00:00:00",
    "CoordinatingAgencyName": "Minnehaha Emergency Management",
    "CoordinatingAgencyPhone": "6053674290",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 8,
      "FacilityID": 1000009286,
      "SummaryText": "sponse procedures there are plans for victim rescue, leak investigation, and communication with additional support agencies. In addition, critical plant operations are identified to ensure that, if possible, the critical Water Purification Plant functions are kept operational. \nThe Emergency Planning and Response plan also addresses plant site communication, emergency response equipment, first aid and medical treatment, medical surveillance and consultation, and emergency response drills."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009286,
      "SummaryText": "Executive Summary\nIntroduction \nChemicals are widely used in industry, in the home, and in the environment and are an integral part of everyoneÂ¿s daily lives. They are transported on roads, water, and railways. The City of Sioux Falls Water Purification Plant uses chemicals, too. The plant uses chlorine to disinfect our drinking water. The natural world contains more that 1,500 chlorine-containing compounds. Human cells generate hypochlorite, a form of chlorine to fight infection. Chlorine purifies our drinking water, disinfects our swimming pools and is truly life saving. In fact the World Health Organization estimates that 25,000 children worldwide die every day from waterborne diseases resulting from the lack of a water disinfection agent such as chlorine. \nStoring chemicals can be a hazard. We take our safety obligations in storing and using chemicals as seriously as we take providing safe drinking water. The following document describes what could happen if there were to be an accident, the steps we take everyday to ensure that our plant operates safely, and what we do in the event of an emergency. \nRegulatory Background\nThe USEPAÂ¿s Clean Air Act Amendments of 1990 included provisions that require facilities that use certain substances to develop a formal plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment. Before these regulations were in place, the Sioux Falls Water Purification Plant had already established many of the components of the plan. The requirements of this plan, commonly referred to as a Risk Management Plan (RMP), are detailed and codified in 40 CFR Part 68. \nAs required by the regulation, the RMP was updated in October 2008 to reflect changes made to the system and the RMP procedures and policies.  The update includes revisions made to reflect improvements the Water Purification Plant made to increase the safety of the chlorine sy"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009286,
      "SummaryText": "stem and reduce the risk of an accidental release.  The original executive summary submitted in 1999 and updated in 2004 was revised again to incorporate the changes made to the system and the plan as part of the 2008 update. The executive summary was reviewed and updated again in June 2009 to meet the 5-year update requirement in 40 CFR Part 68. \nChlorine Process Safety Systems\nThe Water Purification Plant stores chlorine in 1-ton containers. Chlorine is mixed with the treated water before being pumped to homes and businesses. Chlorine is non-explosive and non-flammable, however, like oxygen it is capable of combustion under some circumstances. In addition, it is an irritant to the respiratory system, eyes and skin. Exposure through inhalation at high concentrations is toxic. To prevent accidental releases from occurring that may cause these injuries, the Water Purification Plant has several safety systems. These systems along with the Prevention Program described below greatly reduce the possibility of a significant release of chlorine from occurring. One safety system is the chlorine Â¿leak detectorsÂ¿ that continuously monitor for leaks in the chlorine storage area. Even the smallest of leaks activates alarms that immediately alert plant personnel and allow them to prevent a potential release of chlorine to the atmosphere. In addition, sensors monitor the system pressures and temperatures to detect abnormal conditions that may indicate that a chlorine leak is about to occur. These monitors allow corrective actions to be taken before a leak may occur.  In the event of a leak, the Plant has also installed a dry chlorine scrubber.  This system is activated when the chlorine leak detection system detects a leak to scrub the air of all traces of chlorine leaving the building. \nTo date, the safety systems in place have allowed the Water Purification Plant to achieve an excellent record in preventing accidents. No chlorine release causing a safety or health hazard has"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009286,
      "SummaryText": "occurred within the last 10 years. \nSafety systems help reduce or eliminate the consequences of an accident, much like seat belts reduce injuries in car accidents and anti-lock brakes help avoid car accidents. But, unfortunately accidents can occur. By being prepared for an accident, we can handle the situation in a way that protects those around us. At the Water Purification Plant we prepare for an accidental release by planning a course of action to address and handle the situation. The Emergency Response Program details appropriate courses of action to be taken in the event of a release and is designed to protect people inside as well as outside of the plant. The combination of safety systems and the Emergency Response Program greatly reduces the risk due to a potential accidental release for people inside and nearby the plant. \nComponents of the RMP\nThe RMP consists of three major parts. The first part is the Hazard Assessment. The Hazard Assessment is done to determine the effects that a release of a regulated substance could have on the public. The second part is a Prevention Program that consists of 7 elements designed to improve the system safety and decrease the likelihood of a release. The third part is the Emergency Response Program, which develops a plan for dealing with a release in the unlikely event that one would occur. \nHazard Assessment\nA Hazard Assessment was performed to determine the effects a release would have on the public. For chlorine, the distance a set concentration of chlorine would travel must be determined. In addition, an estimate of the population outside of the plant boundary that could be impacted was determined, and sensitive receptors such as hospitals, schools, and parks were identified. The Hazard Assessment considers two release scenariosÂ¿a Â¿worst caseÂ¿ and an Â¿alternative release.Â¿ \nIf a release were ever to occur, the gas would migrate as the wind pushes it in the prevailing wind direction. The wind would move the gas i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009286,
      "SummaryText": "n primarily one direction. But the regulations require the release to be presented as though it would spread in all directions. In other words, the distance determined by the Hazard Assessment is only valid for the direction of the wind. Someone located the same distance upwind would not be affected by the release. \nWorst-Case Scenario\nThe regulations require the development of a worst-case release scenario based on conservative assumptions. For example, it is required to assume that the entire contents of the largest single container of chlorine will be released over 10 minutes. This is unlikely to occur because the physical properties of chlorine would cause the chlorine to actually freeze over. The frozen chlorine must then thaw to release further chlorine to the atmosphere. This freeze-thaw cycle would slow the release. Because of the freeze-thaw cycle the distance the chemical would travel is shorter than predicted. In addition, the regulations require that active efforts to stop the release cannot be considered. In many scenarios active efforts to stop the release would reduce the amount released. The regulations also require that the worst-case scenario assume conservative atmospheric conditions that result in a larger area of impact. \nThe hazard assessment requires that the Â¿toxic endpointÂ¿ or distance from the point of release to a location at which the chemical concentration equals or exceeds a certain concentration must be determined. That concentration is defined as the maximum airborne concentration below which individuals could be exposed for up to 1 hour without experiencing or developing irreversible or other serious health effects, or symptoms that could impair an individualÂ¿s ability to take protective action. Because the cloud from a chlorine leak would disperse relatively quickly, an individual at the worst-case scenario distance would be exposed to the exposure limit concentration for much less than the 1 hour assumed by the limit. In additio"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000009286,
      "SummaryText": "n, the exposure limit concentrations result in relatively minor health effects. Therefore, an individual at the worst-case scenario distance would be affected less than the results of the worst-case scenario may imply. Using these assumptions, computer modeling estimated that the distance to the toxic endpoint would be 1.17 miles.\nAlternative Scenario\nThe RMP rule also requires that at least one alternative release scenario be evaluated. The alternative scenarios reflect a type of release that is more likely to occur compared to the worst-case scenario. Unlike the worst-case scenario, the alternative release scenario may consider active actions to stop or contain the release and a more realistic release quantity and release rate. Lastly, it assumes local, typical meteorology, which is more realistic than the conservative meteorological conditions that must be assumed for the worst-case scenario. The alternative release scenario for chlorine was a release of chemical through a vacuum regulator safety relief vent. The alternative release scenarios are considered to be more representative of the effects likely in the event of a release. The distance that the alternative release of chlorine would travel was estimated to be 0.08 miles. No residential areas or population are located within this distance. The only receptor within 0.08 miles of the Water Purification Plant is a power plant.\nPrevention Program\nThe Prevention Program consists of 7 elements designed to improve the system safety and decrease the likelihood of a release.\nSafety Information\nThe RMP regulations require that information concerning process chemicals, technology, and equipment be compiled as part of a RMP program. Emergency response planners can use such information to develop training programs and procedures, or as a general resource. The information will be supplied to contractors who will work in the chlorine process area. All the required process safety information was compiled as required by the"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000009286,
      "SummaryText": "RMP regulations. The information meets and in many cases exceeds the minimum required by the regulations.\nHazard Review\nA hazard review was conducted systematically to evaluate potential causes and consequences of accidental releases. This information was used by Water Purification Plant staff to improve safety and reduce the consequences of accidental releases. The chlorine Hazard Review was conducted by CH2M HILL with the assistance of Water Purification Plant staff familiar with the process operation and maintenance and plant management. The review was done using a Â¿ChecklistÂ¿ method. Based on the results of the review, changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the chlorine system were identified. The changes that most effectively help prevent an accidental release have been or will in the future be implemented. \nOperating Procedures\nThe existing operating procedures for the chlorination processes have been recently reviewed and revised. Written operating procedures assure continuous, efficient, and safe operation of the facility. The goal of the operating procedures is to provide clear instructions to safely operate the process. Operating procedures are also used to train new employees and to provide refresher training for existing staff.\nThe detailed operating procedures include startup, shutdown and emergency operating procedures. The procedures describe how the system should be operated in order to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.\nTraining\nAn effective RMP training program can significantly reduce the number and severity of accidental release incidences. Employees involved in operating or maintaining the chlorination process receive training that includes applicable operating and maintenance procedures and an overview of th"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000009286,
      "SummaryText": "e process. Training must emphasize safety and health hazards and safe work practices.\nSioux Falls Water Purification Plant staff received initial training as part of their annual training on the chlorine system operations and maintenance. Refresher process operation training is provided at least every 3 years. \nMaintenance\nAn effective maintenance program is one of the primary lines of defense against a release. The maintenance program addresses equipment testing and inspection, preventative maintenance schedules, and personnel training. The intent is to ensure that equipment used to process, store, or handle chlorine is properly maintained and installed to minimize the risk of releases.\nThe Water Purification Plant staff use a computerized maintenance management system HTE to store equipment information, generate and prioritize work orders, and schedule preventative maintenance (PM). In addition to preventative maintenance, the Water Purification Plant staff performs corrective maintenance in the event of equipment malfunction or breakdown. All maintenance staff are trained to properly and safely perform maintenance.\nIncident Investigation\nEach incident that resulted in or could reasonably have resulted in a catastrophic release of chlorine must be investigated. A process to identify the underlying causes of incidents and implement procedures for preventing similar events has been developed. To investigate an incident, an investigation team will be established. As part of the investigation, an incident report will be prepared to recommend system changes to prevent the incident from occurring in the future.\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted, or exploded? As part of the incident review, staff actions that may have contributed to the incident will also be reviewed. A determination will be made as to whether it is necessary to institute additional training for the employe"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000009286,
      "SummaryText": "es to prevent the incident from occurring in the future. The incident investigation report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system. \nCompliance Audit\nThe Water Purification Plant will complete a compliance audit for the RMP program plant at least once every 3 years. The primary goals of conducting a compliance audit are to verify compliance with RMP requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and increase safety awareness among plant staff.\nThe compliance audit methodology is modeled after OSHAÂ¿s guidelines for conducting regulatory PSM compliance audits: Compliance Guidelines and Enforcement Procedures, OSHA Instruction CPL 2-2.45A (September 28, 1992). An auditor knowledgeable in the covered processes, RMP requirements, and audit techniques will conduct the audits. Based on the results of the audit, the plant will promptly determine an appropriate corrective action for each deficiency identified during the audit.\nEmergency Response Program\nThe Emergency Response Program develops a plan for dealing with a release. EPA RMP regulation 40 CFR 68 Subpart E require that an Accidental Release Emergency Response Plan be prepared. The plan must be prepared in accordance with the provisions of another overlapping OSHA regulationÂ¿Employee Emergency Plans (29 CFR 1910.38(a)). In addition, provisions of the OSHA hazardous waste and emergency response standard, 29 CFR 1910.120 (q), must also be considered. The Emergency Planning and Response Plan described in this section complies with the requirements of 40 CFR 68.95, 29 CFR 1910.38(a), and 29 CFR 1910.120(q). \nThe Emergency Planning and Response plan provides specific emergency response procedures for accidental releases of chlorine. The emergency response procedures cover a release from the initial alarm stage through Hazmat assistance. As part of the emergency re"
    }
  ]
}