{
  "FacilityID": 1000094407,
  "FacilityName": "Anchor Warehouse Services LLC",
  "FacilityStr1": "970 E Myer",
  "FacilityStr2": null,
  "FacilityCity": "Exeter",
  "FacilityState": "CA",
  "FacilityZipCode": "93221",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06107",
  "LEPC": null,
  "FacilityLatDecDegs": "36.276148",
  "FacilityLongDecDegs": "-119.131142",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Anchor Warehouse Services LLC",
  "OperatorStr1": "970 E. Myer Dr.",
  "OperatorStr2": null,
  "OperatorCity": "Exeter",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93221",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000151649",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-05-04 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-07-08 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-07-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-07-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2021-11-17 00:00:00",
  "DeRegistrationEffectiveDate": "2021-10-31 00:00:00",
  "AnniversaryDate": "2026-07-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 36.27514,
  "FRS_Long": -119.13052,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "04",
  "DeregistrationReasonOtherText": "Facility has sold. No longer responsible for RMP",
  "_processes": [
    {
      "ProcessID": 1000117174,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000094407,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000146556,
          "ProcessID": 1000117174,
          "ChemicalID": 56,
          "Quantity": 21000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118574,
          "ProcessID": 1000117174,
          "NAICSCode": "115114",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000100247,
              "Process_NAICS_ID": 1000118574,
              "SafetyReviewDate": "2021-05-25 00:00:00",
              "PHA_Date": "2021-07-02 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2022-07-31 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-12-28 00:00:00",
              "TrainingReviewDate": "2021-06-28 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 1,
              "CT_OralTest": 1,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-06-28 00:00:00",
              "EquipmentInspectionDate": "2021-06-01 00:00:00",
              "EquipmentTested": "North Hallway | Annual Air-Cooling Evaporator Checklist",
              "ChangeMgmtDate": "2017-08-01 00:00:00",
              "ChangeMgmtReviewDate": "2021-06-28 00:00:00",
              "PreStartupReviewDate": "2017-08-01 00:00:00",
              "ComplianceAuditDate": "2020-12-09 00:00:00",
              "AuditCompletionDate": "2021-12-31 00:00:00",
              "IncidentInvestigationDate": "2017-06-03 00:00:00",
              "InvestigationChangeDate": "2017-06-08 00:00:00",
              "ParticipationPlansReviewDate": "2021-06-28 00:00:00",
              "HotWorkPermitReviewDate": "2021-06-28 00:00:00",
              "ContractorSafetyReviewDate": "2021-06-28 00:00:00",
              "ContractorSafetyEvalDate": "2021-03-11 00:00:00",
              "CBI_Flag": 0,
              "Description": "Anchor Warehouse has prepared a unified Risk & Process Safety Management Program. The program is in compliance with Californias Accidental Release Prevention (CalARP) Program (in California CCR Title 19, Chapter 4.5 Program Level 3 Elements. At the Federal level, Title 40 CFR Part 68), and California OSHAs Process Safety Management (PSM) of Acutely Hazardous Materials standard (in California CCR Title 8, Section 5189, Process Safety Management of Acutely Hazardous Materials, and Federally Title 29 Code of Federal Regulations (CFR) 1910.119). This program has been prepared to address the risks involved with the presence of anhydrous ammonia in an amount in excess of 10,000 lbs., which is contained in our refrigeration system.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000125724,
                  "PreventionProgram3ID": 1000100247,
                  "ProcessChemicalID": 1000146556
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094407,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 0,
    "ER_ResponseActions": 0,
    "ER_PublicInfoProcedures": 0,
    "ER_EmergencyHealthCare": 0,
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Tulare County Environmental Health",
    "CoordinatingAgencyPhone": "5596247400",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094407,
      "SummaryText": "This program is intended to meet the spirit and intent of the following regulations:\n\n- California Accidental Release Prevention (CalARP) Program - Title 19 CCR, Chapter 4.5\n\n- Federal EPA Risk Management Program (RMP) - Title 40 CFR ?68\n\n- California Process Safety Management (PSM) Program, Title 8 CCR ?5189\n\n- Federal Process Safety Management (PSM) Program, Title 29 CFR ?1910.119\n\n\n\nHereafter this program will be referred to as the RMP-PSM program.\n\n\n\nThis program is intended to be a \"living document\". As such, the information, procedures, policies, and documentation that make up this program must be made easily accessible and updated as necessary. To accomplish this, Anchor Warehouse Exeter has elected to use PSMWriter, software developed and distributed by Resource Compliance, Inc. This software will assist us with updating, maintaining, scheduling, and tracking RMP-PSM related activities. \n\n\n\n1.1 Anchor Warehouse Exeter, Risk and Process Safety Management Program\n\nThis is to inform all interested persons, including employees, that Anchor Warehouse Exeter has updated their unified RMP-PSM Program. This program has been prepared to address the risks involved in operating and maintaining the following process which have the presence of hazardous chemicals above threshold quantities: \n\n\n\nAmmonia Refrigeration - Anhydrous Ammonia - 21,000\n\n\n\nOur RMP-PSM program promotes overall plant, worker, and public safety. The program enables our facility to prevent the occurrence, and minimize the consequences, of significant releases of hazardous chemicals. \n\n\n\nOverall, the program is designed to prevent accidental fatalities, injuries, illnesses and physical property damage.\n\n1. Our company has many policies and procedures in place to promote overall plant, worker and public safety. We have: \n\n2. Prepared a unified program based on the PSM plan to meet CalARP and RMP obligations as well\n\n3. Organized the program so that it meshes closely with general business practices\n\n\n\nU"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094407,
      "SummaryText": "tilized PSMWriter software to ensure that all necessary employees have access to relevant information (SOPs, PHAs, audits, etc.)\n\n\n\nThe RMP-PSM program sets forth rules, procedures and practices that will help our employees and neighbors protect themselves.\n\n\n\n1.2 Process Description\n\n\n\n1.2.1 Facility Overview\n\n\n\nAnchor Warehouse Services operates a commercial cold storage facility in Exeter, CA. The facility has an ammonia refrigeration system that provides refrigeration capacity to the following:\n\n(5) Cold Storage Rooms\n\n(3) Precool Rooms\n\n(1) Hallway\n\n\n\n1.2.2 Facility Location\n\n\n\nAnchor Warehouse Services is located at 970 E Myer Ave, Exeter, CA 93221. The latitude and longitude of the high pressure receiver is 36.276272, -119.131139. The facility is located approximately 0.25 miles east of state highway 65 and 3.5 miles south of state highway 198 in a rural area surrounded primarily by agricultural land.\n\n\n\nAccording to FEMA Flood Map Service, the facility is located in an area with 0.2% annual chance of flood.\n\n\n\nAnchor Warehouse Services is not located in an Alquist-Priolo Fault Zone as defined by the California Department of Conservation. In addition, a review of United States Geological Survey (USGS) fault maps revealed that there are no faults in close proximity to the site. The USGS 2018 One-Year Model revealed that Anchor Warehouse Services has a 1-2% chance of experiencing \"potentially minor-damage\" due to ground shaking in 2018.\n\n\n\n1.2.3 Description of Covered Process\n\n\n\nThe refrigerated areas are equipped with air-cooling evaporators and accumulators as required for flooded operation. The refrigeration machinery is contained within or directly above the machinery room. \n\n\n\n1.2.4 Process Chemistry\n\n\n\nThe refrigeration system employed at Anchor Warehouse Services is configured for flooded operation. The function and thermodynamics of each major component type in the system is summarized below:\n\n\n\nHigh Pressure Receivers\n\nThe purpose of the high pressure "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094407,
      "SummaryText": "receivers is to provide a safe location to add and store high pressure liquid ammonia in the refrigeration system. The high pressure receivers receive high pressure liquid from the condenser and supply high pressure liquid to each zone of refrigeration. The high pressure receivers are also used to provide storage for ammonia not being used in the process at any given moment. High Pressure Receiver 1 is equipped with a main liquid feed shut-off valve (king valve) that is clearly labeled and can be used to stop the flow of ammonia throughout the system. Under normal conditions, the high pressure receivers contain high pressure liquid and vapor ammonia.\n\n\n\nFlooded Accumulators\n\nThe purpose of each flooded accumulator is to provide a supply of low pressure liquid ammonia to the evaporators. Each accumulator is equipped with an expansion valve which expands the high pressure liquid into a low temperature and pressure liquid as it enters the vessel. The flooded accumulators supply, by gravity, low pressure liquid to the associated evaporators. Liquid and vapor returned from the evaporators is separated inside the flooded accumulators to allow only the vapor to be returned to the main suction accumulator. Under normal conditions, the flooded accumulators contain low pressure liquid and vapor ammonia.\n\n\n\nAir-Cooling Evaporators (Flooded)\n\nThe purpose of the flooded air-cooling evaporators in the cold storage rooms is to remove heat from the air in order to maintain a predetermined space temperature. The air-cooling evaporators receive liquid from a flooded accumulator. The evaporators contain a set of continuous coils through which the low pressure liquid flows. Due to the low pressures and temperatures maintained in the evaporator, the liquid refrigerant absorbs a great deal of heat from the surrounding area and evaporates. To increase the rate of heat removed, the evaporators use an electric fan to move warm air over the coils of cold liquid ammonia. Once the liquid has e"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094407,
      "SummaryText": "vaporated to form low temperature and pressure vapor, it returns to the supplying vessel. Under normal conditions, the air-cooling evaporators contain low pressure liquid and vapor ammonia.\n\n\n\nAir-Cooling Evaporators (Direct Expansion)\n\nThe purpose of the direct expansion air-cooling evaporators in the hallway is to remove heat from the air in order to maintain a predetermined space temperature. The air-cooling evaporators receive liquid from the high pressure receivers. Each evaporator is equipped with an expansion valve which reduces the pressure and temperature of the liquid as it enters the evaporator. The evaporators contain a set of continuous coils through which the low pressure liquid flows. Due to the low pressures and temperatures maintained in the evaporator, the liquid refrigerant absorbs a great deal of heat from the surrounding area and evaporates. To increase the rate of heat removed, the evaporators use an electric fan to move warm air over the coils of cold liquid ammonia. Once the liquid has evaporated to form low temperature and pressure vapor, it exits the evaporator and is returned to the main suction accumulator.\n\n\n\nMain Suction Accumulator\n\nThe purpose of the main suction accumulator is to prevent liquid from entering the compressors. The main suction accumulator receives vapor from the flooded accumulators and separates any residual liquid from the vapor to allow only the vapor to be piped to the suction of each compressor. Liquid in the main suction accumulator drains by gravity into the liquid transfer vessel. The main suction accumulator is equipped with a high level float switch that is wired to shut down the compressors in the event of a high level situation. This prevents liquid ammonia from entering the compressors. Under normal conditions, the main suction accumulator contains low pressure vapor ammonia.\n\n\n\nLiquid Transfer Vessel\n\nThe purpose of the liquid transfer vessel is to transfer liquid from the low side of the refrigeration sy"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000094407,
      "SummaryText": "stem back to the high pressure receivers. The liquid transfer vessel receives liquid from the main suction accumulator. Once the liquid level in the liquid transfer vessel reaches the float switch, the three way solenoid valve is energized for a period of time causing the liquid transfer vessel to become subject to high pressure and allowing the liquid to drain by gravity into the high pressure receivers. Under normal conditions the liquid transfer vessel can contain either high or low pressure liquid and vapor.\n\n\n\nCompressors\n\nThe purpose of the compressors is to raise the temperature and pressure of the low pressure gas in order to reject the heat absorbed in the evaporators to the atmosphere. The compressors receive low pressure vapor from the main suction accumulator and discharge high pressure vapor to the evaporative condensers. Each compressor has an integral oil separator that receives the high pressure vapor and separates residual oil from the ammonia so that the oil can be returned to the compressor. The compressors are equipped with high discharge pressure cutouts to shut the equipment off if the pressure exceeds the setpoint. Under normal conditions, the compressors contain both high and low pressure vapor ammonia.\n\n\n\nEvaporative Condenser\n\nThe purpose of the evaporative condenser is to reject the heat absorbed in the evaporators to the atmosphere. The evaporative condenser receives high pressure, superheated vapor from the compressors and supplies high pressure liquid to the high pressure receivers. The condenser uses air and water to cool the warm ammonia as it passes through a series of tubes within the condenser. As the cooling medium of air and water draws the heat from the vapor, the refrigerant condenses into a liquid and flows to the high pressure receivers. Under normal conditions, the evaporative condenser contains high pressure liquid and vapor ammonia.\n\n\n\n1.2.5 Safety Systems\n\n\n\nAmmonia Detection System\n\nThere are seven ammonia sensors instal"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000094407,
      "SummaryText": "led at Anchor Warehouse Services. The detection system is interlocked with the refrigeration system controls as follows:\n\nAmmonia concentration detectors are installed inside the machinery room to monitor the current concentration inside the room;\n\nIf the ammonia concentration exceeds 50 ppm, an alarm will be initiated. In addition, the PLC will notify facility personnel;\n\n\n\nEmergency Control Box\n\nThe Emergency Control Box (ECB) is installed on the east wall of the machinery room and contains three (3) valves.\n\nValve #1: Low Side Discharge Valve \n\nValve #2: High to Low Pressure Control Valve \n\nValve #3: High Side Discharge Valve\n\nIf necessary, these valves can be used to achieve the following results:\n\nValve #1 is used to relieve the pressure of the low side of the system to the relief valve discharge termination point.\n\nValve #2 is used to equalize the pressure from a high pressure receiver to a low pressure accumulator.\n\nValve #3 is used to relieve the pressure of the high side of the system to the relief valve discharge termination point. \n\n\n\nRelief Valves\n\nAll ASME pressure vessels and positive displacement compressors are equipped with relief valves designed to relieve pressure and protect the equipment from rupturing. Details regarding the relief valves are summarized below:\n\nEach relief valve has a set pressure equal to or less than the MAWP of the equipment that the relief valve protects;\n\nEach relief valve has a capacity which meets or exceeds the requirement of ANSI/IIAR 2-2014 Addendum A ?15.3.8;\n\n\n\nReciprocating Compressor Safety Devices\n\nEach reciprocating compressor has numerous safety devices to protect the compressor and the associated equipment. The following list summarizes the safety devices built into each compressor package:\n\nHigh Discharge Pressure Cutout - The high discharge pressure cutout will shut down the compressor if the discharge pressure equals or exceeds the setpoint.\n\nLow Suction Pressure Cutout - The low suction pressure cutout will"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000094407,
      "SummaryText": " shut down the compressor if the suction pressure is equal to or less than the setpoint.\n\nOil Pressure Cutout - The oil pressure cutout will shut down the compressor if the oil pressure equals or exceeds the setpoint.\n\n\n\nHigh Level Float Switch\n\nThe main suction accumulator is equipped with a high level float switch that is wired to shut down the compressors in the event of a high liquid level in the vessel. This prevents liquid ammonia from entering the compressors.\n\n\n\nMain Liquid Feed Shut-Off Valve (King Valve)\n\nHigh Pressure Receiver 1 is equipped with a main liquid feed shut-off valve (king valve) that is clearly labeled and can be used to stop the flow of ammonia throughout the system.\n\n\n\nEmergency Refrigeration Switch (E-Stop)\n\nThe principal entrance to the machinery room is equipped with an emergency refrigeration switch (e-stop) that controls power to the refrigeration machinery inside the machinery room. The switch can be activated in an emergency using the hammer next to the switch to break the switch glass.\n\n\n\n1.2.6 Process Classification\n\n\n\nThe ammonia refrigeration system at Anchor Warehouse Services consists of vessels, equipment, and valves which are interconnected by piping. As such, the refrigeration system at Anchor Warehouse Services is treated as a single process.\n\n\n\n1.3 General Accident Release & Chemical Specific Prevention Steps\n\n\n\n1.3.1 General \n\n\n\nWe inform our employees engaged in process operations of the dangers of an accidental release of anhydrous ammonia in annual safety meetings. During these meeting we also discuss preventative measures, such as evacuation, in order to be prepared for a release.\n\n\n\nAnchor Warehouse Exeter has also conducted an off-site consequence analysis of worst-case and alternative release scenarios for the ammonia refrigeration process. These are for the purposes of informing the public in the event of an accidental release. The results of the analyses are reported in PSMWriter and hard copy binders. \n\n\n\n1.3.2 "
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000094407,
      "SummaryText": "Anhydrous Ammonia\n\n\n\nThe ammonia refrigeration process at the Anchor Warehouse Exeter facility is an integral part of the overall business and operates most of the year. It is extremely important that this process is maintained and operated in a safe and efficient manner. Management is committed to making sure that employees are made aware of the potential danger of an ammonia leak.\n\n\n\nOur refrigeration personnel monitor the ammonia refrigeration process and keep an active logbook of all procedures and transactions that pertain to ammonia. In addition, the process is checked frequently by one of the outside refrigeration contractors that we use. These contractors also assist in performing the annual mechanical integrity inspection of our ammonia equipment. \n\n\n\n1.4 Five Year Accident History\n\n\n\nAnchor Warehouse Exeter has had no accidental release within the last five (5) years.\n\n\n\n1.5 Emergency Action and Response Plan\n\n\n\nAnchor Warehouse Exeter's emergency action and response program has been developed to satisfy the following requirements:\n\nCalifornia \"Emergency Action Plan\" - Title 8 CCR ?3220\n\nFederal \"Emergency Action Plan\" - Title 29 CFR ?1910.38 \n\n\n\nStrategically, we will respond \"minimally\" to a release. Under this plan we will call emergency personnel and evacuate the facility. All response activities would be done in coordination with the Local Fire Department and their Hazardous Materials Response Team. \n\nEvery year we review with our employees our evacuation procedures in the event of an emergency, including a hazardous chemical release.\n\n\n\n1.6 Planned Changes to Improve Safety\n\nAnchor Warehouse Exeter has implemented many policies and procedures to promote overall plant, worker and public safety. Nevertheless, Anchor Warehouse Exeter continually strives to improve in all areas, including safety.\n\n\n\nBy utilizing PSMWriter software, all necessary employees have access to every aspect of the RMP-PSM program. This has improved Anchor Warehouse Exeter's abil"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000094407,
      "SummaryText": "ity to communicate hazardous situations to employees and contractors. In addition, PSMWriter tracks all RMP-PSM related events so that Anchor Warehouse Exeter's management team can ensure that the RMP-PSM program is being implemented.\n\nAnchor Warehouse Exeter has implemented all aspects of the RMP-PSM program. When a RMP-PSM program requirement is completed (i.e. mechanical integrity inspection, process hazard analysis, compliance audit, etc.) any specific action items related to that event are entered into PSMWriter, assigned a responsible person, and given a due date. Once the action item has been completed, the resolution can be documented using PSMWriter as well. A list of current or past due action items can be accessed at any time by those with access to PSMWriter.\n\n\n\nIn addition to utilizing PSMWriter to create, schedule, track, and document events, Anchor Warehouse Exeter has also entered into a contract with Resource Compliance to obtain help with RMP-PSM program implementation.\n\n\n\nFor the future, Anchor Warehouse Exeter now thinks of the RMP-PSM program as a \"living document\". It is an interactive framework that guides safe action for Anchor Warehouse Exeter employees, but allows for feedback and continual improvement. Through the RMP-PSM program Anchor Warehouse Exeter will continue to maintain overall plant worker and public safety.\n\n"
    }
  ]
}