{
  "FacilityID": 1000043683,
  "FacilityName": "Anheuser-Busch Inc. - Fairfield Brewery",
  "FacilityStr1": "3101 Busch Drive",
  "FacilityStr2": null,
  "FacilityCity": "Fairfield",
  "FacilityState": "CA",
  "FacilityZipCode": "94534",
  "Facility4DigitZipExt": "9726",
  "FacilityCountyFIPS": "06095",
  "LEPC": "Region II LEPC",
  "FacilityLatDecDegs": "38.235931",
  "FacilityLongDecDegs": "-122.093062",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.anheuser-busch.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 6288799,
  "ParentCompanyName": "Anheuser-Busch Companies",
  "Company2Name": null,
  "CompanyDUNS": 98630254,
  "Company2DUNS": null,
  "OperatorName": "Anheuser-Busch, LLC",
  "OperatorStr1": "1 Busch Plaza",
  "OperatorStr2": null,
  "OperatorCity": "St. Louis",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "63118",
  "OperatorZipCodeExt": null,
  "FTE": 232,
  "OtherEPAFacilityID": "94533NHSRB3101B",
  "EPAFacilityID": "100000052426",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "A0606",
  "SafetyInspectionDate": "2011-10-11 00:00:00",
  "SafetyInspectionBy": "Solano County Environmental Health",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-03-04 15:54:02",
  "ErrorReportDate": null,
  "ReceiptDate": "2014-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2014-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2019-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.23906,
  "FRS_Long": -122.09023,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000053957,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000043683,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000065663,
          "ProcessID": 1000053957,
          "ChemicalID": 56,
          "Quantity": 44000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000054743,
          "ProcessID": 1000053957,
          "NAICSCode": "31212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000045298,
              "Process_NAICS_ID": 1000054743,
              "SafetyReviewDate": "2014-01-14 00:00:00",
              "PHA_Date": "2010-07-29 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-07-29 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2014-04-10 00:00:00",
              "TrainingReviewDate": "2014-05-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2014-05-20 00:00:00",
              "EquipmentInspectionDate": "2014-05-16 00:00:00",
              "EquipmentTested": "PRV",
              "ChangeMgmtDate": "2014-04-27 00:00:00",
              "ChangeMgmtReviewDate": "2013-04-09 00:00:00",
              "PreStartupReviewDate": "2013-03-27 00:00:00",
              "ComplianceAuditDate": "2013-04-09 00:00:00",
              "AuditCompletionDate": "2013-04-09 00:00:00",
              "IncidentInvestigationDate": "2014-02-20 00:00:00",
              "InvestigationChangeDate": "2014-02-20 00:00:00",
              "ParticipationPlansReviewDate": "2013-04-09 00:00:00",
              "HotWorkPermitReviewDate": "2013-03-27 00:00:00",
              "ContractorSafetyReviewDate": "2014-05-09 00:00:00",
              "ContractorSafetyEvalDate": "2013-07-30 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000054642,
                  "PreventionProgram3ID": 1000045298,
                  "ProcessChemicalID": 1000065663
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000043683,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2014-01-14 00:00:00",
    "ERTrainingDate": "2014-05-02 00:00:00",
    "CoordinatingAgencyName": "Solano Co. Dept. of Resource Mngmt.",
    "CoordinatingAgencyPhone": "7077846765",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000043683,
      "SummaryText": "side, where the refrigerant absorbs heat as it evaporates, and a high pressure or high side, where the refrigerant vapor releases heat as it is condensed back into a liquid. The system basically moves heat from the low side to the high side. Refrigeration is maintained by isolating the low side in some form of insulated enclosure where goods or processes can be chilled or frozen. \r\n\r\nThe low side of the refrigeration system typically uses one or more evaporators to remove heat from the space or products to be cooled. An evaporator contains a set of continuous coils through which the refrigerant flows. Due to the low pressures and corresponding low temperatures maintained in the evaporator, the liquid refrigerant quickly evaporates, absorbing a great deal of heat from the surrounding area. To increase the rate of heat removed, the evaporator uses an electric fan to move warm air over the coils of cold liquid ammonia. \r\n\r\nThe low and high sides of the refrigeration system are separated by the compressor and the expansion valve. The compressor is the driving force of the system. It pulls refrigerant vapor from the evaporator (low side) at a rate that will maintain the evaporator pressure required for the desired operating temperature. At the same time it pressurizes the warm vapor and forces it into the condenser and the high side of the system. Refrigeration compressors on the market today are screw type, reciprocating, and centrifugal. \r\n\r\nExpansion valves regulate the flow of liquid refrigerant from the high side to the low side by causing a large pressure drop. These valves are located between the receiver (high side) and the evaporator (low side). These valves, coupled with the capacities of the compressor, can help regulate the pressure of the evaporator thereby creating the cooling capabilities of the system. The high side of the refrigeration system consists of a condenser and a receiver. Warm refrigerant vapor enters the condenser after it has been pressurized"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000043683,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nAnheuser Busch - Fairfield management is not only committed to offering superior service, but also to maintaining a safe environment for all its employees and the surrounding communities.  Anheuser Busch - Fairfield's safety and environmental policies are administered by the EHS&S Manager, who conducts periodic inspections of the facility to ensure compliance, and oversees the entire safety and environmental programs, including the PSM/RMP/CalARP Program. \r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe Anheuser Busch facility is located at 3101 Busch Drive in Fairfield, California.  The facility is located approximately 0.25 miles south of Interstate 80 and 0.5 miles west of Chadbourne Road. The area immediately surrounding the facility is rural with a mixture of farmland and residential areas. The facility location with respect to the surrounding area is shown in Figure 1. \r\n\r\nThe facility uses approximately 44,000 pounds of ammonia as a refrigerant within a closed-loop refrigeration system. The system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for the processing and storage of beverages. Typical operating conditions of the system ranges from 26 psig on the low side to 120 psig on the high side of the system.  \r\n\r\nA refrigeration system is used to reduce the temperature of a heat source. A mechanical refrigeration system is a closed system that cycles the refrigerant, ammonia, from liquid to gas and back again. As the refrigerant absorbs large amounts of heat from the source, the refrigerant changes state from liquid to gas. At a different part of the system, the refrigerant releases heat as it is condensed back into a liquid. This system is referred to as having two sides: a low pressure or low"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000043683,
      "SummaryText": "by the compressor. A condenser will typically use  water to cool the warm ammonia as it passes through a series of tubes within the condenser. As the cooling medium of  water draws the heat from this vapor, the refrigerant condenses into a liquid and flows to the receiver. The receiver serves as a holding tank for the liquid refrigerant being fed to the low side. It also serves to hold the bulk of the refrigerant in the system when it is not in operation.  The ammonia inventory was provided by the facility on May 30, 2014.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nThe ammonia refrigeration system at the Anheuser Busch - Fairfield facility has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  For example, Anheuser Busch - Fairfield operates in accordance with the California Accidental Release Prevention (CalARP) Program.  It is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia. For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  Pressure relief valves on all pressure vessels protect the equipment from overpressurization and rupture.  All relief valves in the systems vent to the Ammonia Diffusion Tank.\r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nEPA's RMP regulation defines \"accident\" as the following: \r\n\r\n\"The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. The release must have caused at least one of the following: \r\n\r\n-On-site deaths, injuries, or significant property damage (§68.42(a)); or\r\n-Known o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000043683,
      "SummaryText": "ffsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\" \r\n\r\nAn investigation into the facility's accident history during the OCA Revalidation study performed on May 30, 2014, revealed that there have been no releases of ammonia over the past five years (May 2009 - May 2014) that exceeded the Federal Reportable Quantity of 100 pounds in 24 hours or that meet the EPA reporting criteria for the Five-Year Accident History as specified above.  \r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe facility has an Emergency Response Plan (plan) in effect.  This Plan was designed to meet the following objectives:  \r\n\r\n-save lives;\r\n-minimize and avoid injuries;\r\n-protect the environment; and\r\n-minimize property damage.\r\n\r\nThe Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated at least once per year. This Plan was reviewed and updated to ensure compliance with the CalARP regulations.  \r\n\r\nAnheuser Busch - Fairfield personnel circulate throughout the plant, taking note of unusual conditions in any portion of the system.  In the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger and the EHS&S Manager.  The EHS&S Manager will determine what procedures and personnel are necessary to remedy the problem. Emergency agencies will also be notified as necessary as outlined in the Emergency Response Plan.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nThe Process Hazard Analysis Study performed in July 2010, generated mitigation measures (recommendations) to improve safety at the Anheuser Busch - Fairfield facility.  The mitigation measures include installation of additional labeling and conducting key maintenance related tests/in"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000043683,
      "SummaryText": "spections.  The Anheuser Busch - Fairfield PSM Safety Committee is planning to complete several items, including the recommendations, over the next year, as a continual effort to provide a safe work environment for their employees.  These changes include the following items:\r\n\r\n1. \tContinue to train employees in the facility PSM Safety Plan/Programs.\r\n2. \tContinue to have employee involvement in PSM Safety Plan Development.\r\n3. \tContinue employee involvement through PSM Safety Team participation.\r\n4. \tContinue internal and external safety audits/inspections and implement changes as needed."
    }
  ]
}