{
  "FacilityID": 1000056459,
  "FacilityName": "Harry E. Myers Water Filtration Facility",
  "FacilityStr1": "1475 Hubert Pierce Rd",
  "FacilityStr2": null,
  "FacilityCity": "Mobile",
  "FacilityState": "AL",
  "FacilityZipCode": "36608",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01097",
  "LEPC": "Mobile County LEPC",
  "FacilityLatDecDegs": "30.722100",
  "FacilityLongDecDegs": "-088.260500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.mawss.com",
  "FacilityEmailAddress": "danderson@mawss.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "Mobile Area Water and Sewer System",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Mobile Area Water and Sewer System",
  "OperatorStr1": "4725 Moffett Road",
  "OperatorStr2": null,
  "OperatorCity": "Mobile",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "36618",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000107519",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-03-28 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-03-28 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-03-28 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-03-28 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 30.72219,
  "FRS_Long": -88.25912,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000070488,
      "AltID": null,
      "FacilityID": 1000056459,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000087095,
          "ProcessID": 1000070488,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000071690,
          "ProcessID": 1000070488,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000044272,
              "Process_NAICS_ID": 1000071690,
              "SafetyReviewDate": "2016-02-23 00:00:00",
              "FR_NFPA58": 0,
              "FR_OSHA": 0,
              "FR_ASTM": 1,
              "FR_ANSI": 1,
              "FR_ASME": 1,
              "FR_None": 0,
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2016-03-03 00:00:00",
              "ChangeCompletionDate": "2016-03-03 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 0,
              "MH_Corrosion": 0,
              "MH_Overfilling": 0,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 1,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 0,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 0,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 0,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2016-02-23 00:00:00",
              "TrainingReviewDate": "2016-02-23 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2016-02-23 00:00:00",
              "EquipmentInspectionDate": "2016-02-23 00:00:00",
              "EquipmentTested": "Chlorinators, Chlorine Detectors, Emergency Shut-off Vavles, Scrubber System, General System Visual Inspection",
              "ComplianceAuditDate": "2016-03-28 00:00:00",
              "AuditCompletionDate": "2016-04-29 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": 0,
              "Description": "Water Supply Utility",
              "_chemicals": [
                {
                  "PrimaryKey": 1000045058,
                  "PreventionProgram2ID": 1000044272,
                  "ProcessChemicalID": 1000087095
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000056459,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2016-03-28 00:00:00",
    "ERTrainingDate": "2016-01-29 00:00:00",
    "CoordinatingAgencyName": "Mobile Emergency Management",
    "CoordinatingAgencyPhone": "2514608000",
    "FR_OSHA1910_38": 0,
    "FR_OSHA1910_120": 0,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000056459,
      "SummaryText": "     Introduction\n\n\n\nThe USEPA's RMP regulation, 40 CFR 68, was published in the Federal Register on June 20, 1996, and developed to assist facilities in preventing accidental release of highly toxic or flammable chemicals.  The RMP regulation applies to an owner or operator of a stationary source that has more than a threshold quantity of a regulated substance in a process per 40 CFR 68.115.\n\n\n\nThe USEPA has established three (3) tiers of requirements to reduce the level of effort for facilities with a lower risk of offsite impacts.  These tiers are known as Programs 1, 2 and 3.  Program 1 is defined by a process that has had no accidental release causing offsite impacts in the past five (5) years or the nearest public receptor is beyond the distance to a toxic or flammable endpoint based on the worst-case release scenario.  Program 3 applies to a process that is subject to Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) or is not classified in any of the Program 3 NAICS codes defined in 40 CFR 68.10(d)(1).  Program 2 applies to processes not defined by Program 1 or 3.  Therefore, the E. Morgan Stickney Water Filtration Plant processes are subject to Program 2 requirements.\n\n\n\nThe Mobile Area Water and Sewer System (MAWSS) operates the Harry E. Myers Water Treatment Plant facility located at 1475 Hubert Pierce Road in Mobile, Alabama.  Chlorine is used as a disinfectant for treated surface water storing approximately eight (8) one-ton cylinders containing chlorine.  The Myers facility utilizes more than the threshold quantity of chlorine as defined in 40 CFR 68.150; therefore, the facility is required to submit an RMP.  The initial RMP was submitted by June 21, 1999. A five (5) year update was made by Malcolm Pirnie in January 2005 updating the offsite consequence analyses determining whether the parameters and assumptions used are still valid. To comply with the five (5) year update requirement in 2010, Goodwyn, Mills and Cawoo"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000056459,
      "SummaryText": "d reviewed the offsite consequence analyses to determine whether the parameters assumptions used are still valid and to make any necessary changes to update the RMP. In 2016, Goodwyn, Mills and Cawood reviewed and updated the plan with the assistance of the Myers operators. There were no significant changes to the current procedures that were discovered for this update term.\n\n\n\n     68.155(a) Accidental Release and Emergency Response Policies\n\n\n\nThe Myers facility has established procedures to ensure the integrity of the chlorination systems and minimize the potential for releases.  Standard protocols have been established for items such as systems operations, maintenance, training, and incident investigation.  To ensure the safety of the Stickney facility chlorination, the facility relies on the commitment and team effort of its employees and suppliers.\n\n\n\nThe Myers facility has a minimum of two (2) and a maximum of fifteen (15) employees on duty at any given time, which are trained on safe operation of the chlorination systems.  Daily inspections of the areas storing and/or using chlorine are conducted by the facility employees.  The area that stores the containers is fully enclosed and is equipped with a caustic scrubber for control of a chlorine release.  The caustic scrubber system is equipped with chlorine detectors that will automatically activate the scrubber system if a chlorine concentration of three (3) parts per million or greater is present.  In addition, MAWSS has installed an emergency chlorine valve actuator, which will shut off flow from the ton containers within 30 seconds after detecting a leak.  The system also contains an emergency \"panic button\" located outside of the storage area to allow for operator-initiated emergency shut-off.\n\n\n\nAll potential releases from the Stickney facility will be responded to by the Mobile County Emergency Management Agency (MCEMA), whose members are aware of the presence of chlorine at the facility.  The MCEMA woul"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000056459,
      "SummaryText": "d dispatch experienced HAZMAT personnel trained to respond to such emergencies.\n\n\n\n     68.155(b) Stationary Source and Substance Handled\n\n\n\nThe Myers facility stores and handles chlorine and is a stationary source potentially subject to 40 CFR 68.  The facility has four (4) one-ton chlorine cylinders connected at all times.  A header pipe supplies chlorine to two locations: the chlorine dioxide generator and the plant filter flume.  The containers are then moved inside the building for storage and usage.  In addition to the four (4) connected cylinders, up to four (4) additional cylinders are stored inside the building that are either full waiting to be used or empty waiting to be shipped.\n\n\n\nGaseous chlorine from the one-ton cylinders is drawn by a vacuum though one of the two rotometers, which serve to feed chlorine at a specified rate to the ejector system.  The gaseous chlorine is mixed with treated water to form a chlorine solution.  The chlorine solution is injected into the water at the filter flume feed point.  The water is then distributed for use by the residents of the City of Mobile.\n\n\n\n     68.155(c) Accidental Release Prevention\n\n\n\nWorst-case and alternative case release scenarios were conducted as required for the Prevention Program 2 process.  Emergency response activities have been coordinated with local responders which are also required for the Prevention Program 2 process.  Lastly, a program and document management system is in place.  The Prevention Program 2 process allows streamlined prevention program requirements; however, implementation of the following elements are required: safety information, hazard review, operating procedures, training, maintenance, compliance audits and incident investigations. \n\n\n\nGoodwyn, Mills and Cawood, Inc., with the assistance of Myers facility management and staff, conducted a compliance audit and a hazard review of the chlorine system using the \"What-If\" analysis.  The results of the audit and hazard review "
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000056459,
      "SummaryText": "identified recommended changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the chlorine system.  The results of the audit and the hazard review, in addition to recommendations made, are documented and are maintained as part of the RMP records.\n\n\n\n     68.155(d) Five-Year Accident History\n\n\n\nThe Stickney facility has had no accidental releases of chlorine within the last five (5) years that have resulted in on-site injuries, off-site injuries, and/or off-site impacts.\n\n\n\n     68.155(e) Emergency Response Program\n\n\n\nIf a release were to occur, a Myers facility employee would immediately contact the Mobile County Emergency Management Agency (MCEMA), whose members are aware of the presence of chlorine at the facilities.  The MCEMA would dispatch experience HAZMAT personnel trained to respond to such emergencies.  The emergency response procedures are outlined in the Mobile Area Water and Sewer System Emergency Action Plan.\n\n\n\nThe area that stores the one-ton cylinders is fully enclosed and is equipped with a caustic scrubber for mitigation of a chlorine release.  The caustic scrubber system is equipped with chlorine detectors that will automatically activate the scrubber system if a chlorine concentration of three (3) parts per million or great is present.  In addition, MAWSS has installed an emergency chlorine valve actuator, which will shut off flow from the one-ton cylinders within 30 seconds after detecting a leak.  The system also contains an emergency \"panic button\" located outside of the storage area to allow for operator-initiated emergency shut-off.\n\n\n\n     68.155(f) Safety Improvements\n\n\n\nRecommendations for safety improvements were identified in prior compliance audit and the Hazard Review exercises.  These recommendations, and target dates of implementation, are documented in the RMP. The 2016 hazard review and audit found no significant changes or recommendations required at this time."
    }
  ]
}