{
  "FacilityID": 1000105584,
  "FacilityName": "Cypress Creek Wastewater Treatment Plant",
  "FacilityStr1": "201 Seven Mile Island Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Florence",
  "FacilityState": "AL",
  "FacilityZipCode": "35630",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "01077",
  "LEPC": "Lauderdale County LEPC",
  "FacilityLatDecDegs": "34.784167",
  "FacilityLongDecDegs": "-087.701389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "C2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.florenceutilities.com",
  "FacilityEmailAddress": "mdoyle@florenceal.com",
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Florence Wastewater Depart.",
  "OperatorStr1": "P.O. Box 1023",
  "OperatorStr2": null,
  "OperatorCity": "Florence",
  "OperatorStateFIPS": "AL",
  "OperatorZipCode": "35630",
  "OperatorZipCodeExt": null,
  "FTE": 11,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000006352",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-08-16 00:00:00",
  "SafetyInspectionBy": "Alabama Municipal Insurance Corporation",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-06-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-06-06 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-06-06 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-06-06 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.7983,
  "FRS_Long": -87.7004,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000131836,
      "AltID": "Wastewater Treatment",
      "FacilityID": 1000105584,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000165238,
          "ProcessID": 1000131836,
          "ChemicalID": 49,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000165239,
          "ProcessID": 1000131836,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000133288,
          "ProcessID": 1000131836,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000080712,
              "Process_NAICS_ID": 1000133288,
              "SafetyReviewDate": "2023-05-12 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "Yes",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "The Chlorine Institute",
              "FR_Comments": null,
              "HazardReviewDate": "2023-05-11 00:00:00",
              "ChangeCompletionDate": "2023-05-11 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-05-12 00:00:00",
              "TrainingReviewDate": "2023-05-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-05-12 00:00:00",
              "EquipmentInspectionDate": "2023-05-12 00:00:00",
              "EquipmentTested": "Vacuum regulators and injectors",
              "ComplianceAuditDate": "2023-05-10 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000081541,
                  "PreventionProgram2ID": 1000080712,
                  "ProcessChemicalID": 1000165239
                },
                {
                  "PrimaryKey": 1000081540,
                  "PreventionProgram2ID": 1000080712,
                  "ProcessChemicalID": 1000165238
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000105584,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lauderdale County EMA",
    "CoordinatingAgencyPhone": "2567606363",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000105584,
      "SummaryText": ". In addition to training, we will follow proper operation and maintenance procedures for each system in order to maintain a neat and safe working environment."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000105584,
      "SummaryText": "enance practices. Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\tCompliance Audits\n\tOur facility conducts audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented. In accordance with EPA's RMP regulations we perform these audits at least every three years. Any corrective actions resulting from these audits are completed in safe and timely manner.\n\n\tIncident Investigation\n\tOur facility promptly investigates any incident which resulted in or could reasonably result in a catastrophic release of a regulated substance. These investigations provide valuable information for assessing all possible causes of the incident ranging from human error to equipment failure. In addition, possible corrective actions are identified to prevent the accident from recurring. All reports are retained for a minimum of five years as required by EPA's RMP regulations.\n\n5.\tFive Year Accident History\n\n\tOur facility takes pride in doing everything possible to prevent accidental releases and has had an excellent record of preventing accidental releases over the last five years. Due to our stringent release prevention policies, there has been no accidental release during this period.\n\n6.\tEmergency Response\n\n\tIn the event of an accidental release of chlorine or sulfur dioxide, we at the City of Florence, Alabama, Water & Wastewater Department have opted not to implement an Emergency Response Program. Instead, in accordance with RMP regulations, we have included our facility in the community emergency response plan and have the appropriate procedures in place to notify emergency responders when there is a need to respond.\n\n7.\tPlanned Changes to Improve Safety\n\n\tAs a result of preparing this Risk Management Plan, our facility will take the extra step to ensure all employees continually receive the appropriate training required to safely operate the chlorination and dechlorination system"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000105584,
      "SummaryText": "d sulfur dioxide process.\n\n\tHazard Analysis\n\tOur facility conducts a comprehensive overview and analysis of our chlorination and dechlorination system to ensure that the associated hazards are identified and controlled efficiently. The methodology used to carry out this analysis is a hazard review checklist specifically designed for water plants. This checklist was designed to meet the requirements of The Chlorine Manual published by The Chlorine Institute and The Supplemental Risk Management Program Guidance for Wastewater Treatment Plants, published by EPA. The analyses are performed by qualified personnel and are revalidated at regular intervals. Any findings related to the hazard analysis are addressed in a timely manner.\n\n\tOperating Procedures\n\tFor the purposes of safely conducting activities within our chlorination and dechlorination process, our facility maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown, and startup after a change. The information is regularly reviewed and is readily accessible to operators involved in the chlorination and dechlorination process.\n\n\tTraining\n\tOur facility has a comprehensive training program in place to ensure that employees who are operating the chlorine and sulfur dioxide process are competent in the operating procedures associated with the process. Refresher training is provided at least every three years in accordance with EPA's RMP regulations and more frequently as needed.\n\n\tMaintenance\n\tOur facility has established routine maintenance checks on the chlorine and sulfur dioxide process equipment to ensure proper operations. Process equipment examined by these checks includes among others, ton containers, piping, chlorinators, vent systems, rotometers, and ejectors. Maintenance operations are carried out by qualified personnel with previous training in maint"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000105584,
      "SummaryText": "ntainer. The total quantity released for chlorine is 405 pounds with an average release rate of 6.75 pounds per minute and a maximum sustained release rate of 15.8 pounds per minute. At class D atmospheric stability, a 3.0 m/s wind speed, and a temperature of 102F, a maximum distance of 0.69 miles is obtained corresponding to a toxic endpoint of 0.0087 mg/L. The potentially affected residential population was estimated at 289 people. Public receptors found within the alternative release radius for chlorine were residences and recreational areas. One environmental receptor, the Seven Mile Island Wildlife Refuge, was identified in the toxic endpoint area. The total quantity released for sulfur dioxide is 1,853 pounds with an average release rate of 36.3 pounds per minute and a maximum sustained release rate of 56.4 pounds per minute. At class D atmospheric stability, a 3.0 m/s wind speed, and a temperature of 102F, a maximum distance of 1.4 miles is obtained corresponding to a toxic endpoint of 0.0078 mg/L. The Potentially affected residential population was estimated at 3,850. Schools, residences, hospitals, public recreational areas, and major commercial, office, or industrial areas were all public receptors that were found within the radius of the sulfur dioxide alternative case release scenario. One environmental receptor, the Seven Mile Island Wildlife Refuge, was identified in the toxic endpoint area.\n\n4.\tThe General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps.\n\n\tOur facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR part 68 of the EPA regulations.  The following sections briefly describe the elements of the release prevention program that is in place at our facility.\n\n\tSafety Information\n\tOur facility maintains a record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with the chlorine an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000105584,
      "SummaryText": "rine and sulfur dioxide release scenarios, two worst case release and two alternative scenarios were analyzed in accordance with EPA's RMP regulations. To perform the required scenario analyses for our facility, we used Area Locations of Hazardous Atmospheres [ALOHA(R)] models and analysis. For the sulfur dioxide and chlorine worst case and alternative case release scenarios ALOHA analyses were run using ALOHA version 5.4.3. The following paragraphs provide details of the chosen scenarios.\n\t The worst case scenario, as required by EPA, assumes the maximum quantity of chlorine or sulfur dioxide in the largest vessel is released as a gas over ten minutes due to an unspecified failure. Our largest vessel for both chlorine and sulfur dioxide is a ton (2,000 pounds) container. Neither passive nor active mitigation was considered. At class F atmospheric stability, a 1.5 m/s wind speed, and a temperature of 102F, a maximum distance of 3.0 miles is obtained corresponding to a toxic endpoint of 0.0087 mg/L for chlorine and a maximum distance of 3.2 miles is obtained corresponding to a toxic endpoint of 0.0078 mg/L for sulfur dioxide. The potentially affected residential population was estimated to be approximately 23,367 for the chlorine release and 27,064 for the sulfur dioxide release. Schools, residences, hospitals, prisons, public recreational areas, and major commercial, office, or industrial areas were all public receptors that were found within the radius of the worst case release scenario. One environmental receptor, the Seven Mile Island Wildlife Refuge, was identified in the toxic endpoint area.\n\tThe alternative release scenario assumes the chlorine and sulfur dioxide release is less severe and is more likely to occur than the worst case release scenario. The scenario chosen for both substances involves a tubing failure, bad connection, or valve failure resulting in the release of gas through the 5/16 diameter valve body opening at the top of a 1 ton storage co"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000105584,
      "SummaryText": "CYPRESS CREEK WASTEWATER TREATMENT PLANT\nEXECUTIVE SUMMARY FOR CHLORINATION AND DECHLORINATIONPROCESS\n\n\n1.  \tAccidental Release Prevention and Emergency Response Policies\n\n\t\tThe Cypress Creek Wastewater Treatment Plant is strongly committed to employee, public and environmental safety. This commitment is inherent to a comprehensive accidental release prevention program in place that integrates areas such as design, installation, management practices, operating procedures, maintenance, and employee training associated with the chlorination and dechlorination process at our facility. The chlorination and dechlorination system at our plant is designed to meet industry standards and is well maintained. Appropriate controls and alarms are also in place to prevent possible releases of chlorine and sulfur dioxide. Furthermore, all applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program Level 2 are adhered to.\n\tIn the event an accidental release does occur, our facility is coordinated with the Lauderdale County Emergency Management Agency, local fire and police departments, as well as, Harcros Chemicals in Muscle Shoals, Alabama. These institutions provide highly trained emergency response personnel to control and mitigate effects of the release.\n\n2.\tOur Facility and the Regulated Substances Handled\n\n\tOur facility is a publicly owned wastewater treatment plant. Our primary activity is treating municipal wastewater from the City of Florence, AL for discharge into the Tennessee River. We have two regulated substances, Chlorine and Sulfur Dioxide. Chlorine is used for disinfecting the wastewater and to aid in plant operation.  The maximum inventory of Chlorine at our facility is 16,000 pounds. Sulfur Dioxide is used for dechlorinating the chlorinated wastewater at our facility. The maximum inventory of Sulfur Dioxide at our facility is 16,000 pounds.\n\n3.\tThe Worst Case Release Scenario and the Alternative Release Scenario\n\n\tFour possible chlo"
    }
  ]
}