{
  "FacilityID": 1000080385,
  "FacilityName": "INEOS Americas LLC",
  "FacilityStr1": "3503 Pasadena Freeway",
  "FacilityStr2": null,
  "FacilityCity": "Pasadena",
  "FacilityState": "TX",
  "FacilityZipCode": "77503",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48201",
  "LEPC": "Southeast Regional LEPC",
  "FacilityLatDecDegs": "29.731667",
  "FacilityLongDecDegs": "-095.154444",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 8188117,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "INEOS Americas LLC",
  "OperatorStr1": "P.O. Box 1959",
  "OperatorStr2": null,
  "OperatorCity": "Pasadena",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77501",
  "OperatorZipCodeExt": "1959",
  "FTE": 48,
  "OtherEPAFacilityID": "TXD093565653",
  "EPAFacilityID": "100000131582",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2010-01-13 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-06-12 19:11:34",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-12 19:11:34",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-12 19:11:34",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-06-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 29.73,
  "FRS_Long": -95.154722,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-SATELLITE",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000100354,
      "AltID": "Cumene Process",
      "FacilityID": 1000080385,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125704,
          "ProcessID": 1000100354,
          "ChemicalID": 155,
          "Quantity": 22000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000108667,
              "ProcessChemicalID": 1000125704,
              "ChemicalID": 129
            },
            {
              "FlamMixChemID": 1000108668,
              "ProcessChemicalID": 1000125704,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101603,
          "ProcessID": 1000100354,
          "NAICSCode": "32511",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084735,
              "Process_NAICS_ID": 1000101603,
              "SafetyReviewDate": "2014-04-19 00:00:00",
              "PHA_Date": "2014-10-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2016-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Injury Prevention",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2017-10-11 00:00:00",
              "TrainingReviewDate": "2018-11-30 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Computer Based",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-04-17 00:00:00",
              "EquipmentInspectionDate": "2018-07-16 00:00:00",
              "EquipmentTested": "E-13 / E-44 - API 510 Internal",
              "ChangeMgmtDate": "2019-06-06 00:00:00",
              "ChangeMgmtReviewDate": "2019-02-25 00:00:00",
              "PreStartupReviewDate": "2018-11-07 00:00:00",
              "ComplianceAuditDate": "2016-12-27 00:00:00",
              "AuditCompletionDate": "2017-12-27 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2018-10-01 00:00:00",
              "HotWorkPermitReviewDate": "2019-03-13 00:00:00",
              "ContractorSafetyReviewDate": "2018-12-12 00:00:00",
              "ContractorSafetyEvalDate": "2017-10-02 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000105613,
                  "PreventionProgram3ID": 1000084735,
                  "ProcessChemicalID": 1000125704
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000080385,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-09-30 00:00:00",
    "ERTrainingDate": "2018-10-18 00:00:00",
    "CoordinatingAgencyName": "Southeast Regional LEPC",
    "CoordinatingAgencyPhone": "7134732273",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000080385,
      "SummaryText": "ovided at least every three years and more frequently as needed.  During the training, each employee must demonstrate that they have the required knowledge, skills, and abilities to safely carry out their duties and responsibilities as provided in our operating procedures. \r\n\r\nMechanical Integrity\r\nWe have comprehensive preventive maintenance and mechanical integrity programs in place for the entire facility.  The program incorporates industry codes, procedures from federal and state regulations, and instructions provided by equipment manufacturers.  INEOS carries out documented maintenance checks on process equipment to ensure proper operations.  Inspection and testing of the sphere is performed in accordance with applicable standards and good engineering practice.  All maintenance operations are carried out by qualified personnel with previous training in maintenance experience.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\r\n\r\nManagement of Change\r\nWritten procedures are used at INEOS to manage changes in process chemicals, technology, equipment and procedures.  Process operators, maintenance personnel, and other employees whose job tasks are affected by such modifications are provided training.\r\n\r\nPre-startup Reviews\r\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice at INEOS.  These reviews are used to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup before ever placing equipment into operation.\r\n\r\nIncident Investigation\r\nINEOS promptly investigates any incident or near miss that has resulted in, or could reasonably result in a catastrophic release or injury.  These investigations are undertaken within 48 hours to identify the situation leading to the incident as well as any corrective actions to prevent the release or injuries from reoccurring.  Investigation re"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000080385,
      "SummaryText": "port findings are shared with all employees affected by the findings.  Each investigation report is retained for a minimum of five years.\r\n\r\nEmployee Participation\r\nINEOS believes that process safety management and accident prevention is a team effort.  Company employees actively participate in accident prevention and developing our process safety management programs.  In addition, our employees have access to all information created as part of the facility's implementation of the Risk Management Plan rule, including information resulting from process hazard analyses.\r\n\r\nContractors\r\nOur company employs contractors to perform maintenance and construction activities at the facility.  Prior to selecting a contractor, a thorough evaluation of the contractor's safety performance is carried out.  INEOS has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes.  Contractors are also informed of all of the emergency response procedures should an accidental release occur.\r\n\r\n5.  Five-year Accident History\r\n\r\nINEOS has had an excellent record of preventing accidental releases over the last five years.  Due to our stringent prevention policies, there have been no accidental releases as described per [40 CFR 68.42(a)].\r\n\r\n6.  Emergency Response Plan\r\n\r\nINEOS has a written emergency response plan to deal with accidental releases of hazardous materials.  The plan includes all aspects of emergency response including first aid and medical treatment, evacuations, notification of regulatory agencies and the public, on and offsite monitoring, as well as post-incident clean up of any affected areas.  The emergency response plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.  We coordinate our emergency plan with the City of Pasadena Office of Emergency Management, our facility's Local Emergency Planning Committee (LEPC).  \r\n\r\nTo"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000080385,
      "SummaryText": "RMP Executive Summary for INEOS Americas LLC - Pasadena Division\r\n\r\n1.  Accidental Release Prevention and Emergency Response Policies\r\n\r\nWe are committed to conducting our activities with the highest regard for environmental, health, safety, and community well-being. All applicable laws and regulations are adhered to with special emphasis on environmental and safety standards.  Our comprehensive accidental release prevention program covers areas such as design, installation, operating procedures, maintenance, and employee training.  If a release does occur, our highly trained emergency response personnel are at hand to control and mitigate the effects of the release.\r\n\r\n2.  The Stationary Source and the Regulated Substances Handled\r\n\r\nOur facility's primary activities are the manufacture of cumene.  We handle two risk management plan rule substances at our facility, propylene and propane.  We receive and store propylene and propane together as a mixture (P/P mix), so they are covered together as a flammable mixture for purposes of our risk management plan.  The propylene in the P/P mix is used to produce cumene, while the propane passes through our process and is sold.  We bring in P/P mix by tank truck, railcar, and pipeline. Propane is shipped from our facility primarely by pipeline, but can also be exported via tank truck.\r\n\r\n3.  The Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario.\r\n\r\nINEOS's worst case and alternative release scenarios do not impact any homes, schools, or hospitals.  The scenarios could, however impact our employees and our industrial neighbors. The following paragraphs provide details of the two scenarios.\r\n\r\nWorst Case Release Scenario (WCS)\r\nThe worst case release scenario involves a catastrophic release from a storage sphere.  The sphere is a vessel used for the storage of a pressurized liquefied mixture of prop"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000080385,
      "SummaryText": "ylene and propane feed (P/P Mix).  The scenario involves a release of P/P mix, which finds an ignition source and develops into a vapor cloud explosion. \r\n\r\nSeveral unlikely events must occur for this worst case scenario to materialize.  The sphere would have to be completely full; the 1 1/4 inch-thick steel walls of the sphere would have to fail instantaneously; all of the liquid material in the sphere would have to form a vapor cloud within 10 minutes; all of our safety systems would have to simultaneously fail; all our personnel would have to do nothing to contain or stop the release; specific weather conditions, which would tend to keep any vapor cloud confined and concentrated, would have to be present.  In the improbable event that each and every one of these conditions was to occur, the maximum distance to an endpoint of 1 psi overpressure would still not reach any homes, schools, or hospitals.  \r\n\r\nAlthough the EPA does not allow companies to consider any active safety measures when analyzing the worst case scenario, INEOS has a number of safety systems in place to prevent a release from ever occurring at the sphere.  The sphere meets strict design and construction standards.  It is constructed of 1 1/4 inch-thick steel and wrapped with a 4-inch-thick layer of insulation to help control the temperature and pressure inside the sphere. To prevent the vessel from over pressuring and releasing, the sphere has two relief valves.  These valves are inspected and tested in accordance with current standards and good engineering practice applicable.  An automatic isolation valve is located on the discharge of the sphere to shut off flow if there is a rupture downstream of the valve.  Numerous instrument alarms are in place to warn of potential equipment malfunction, including multiple pump malfunction alarms and automatic shutdowns on the sphere pumps.  Remote valves are installed to isolate and limit any release from the sphere, including a check valve on the sphere"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000080385,
      "SummaryText": "s to Improve Safety\r\n\r\nWe are continuously working to reduce our accident and release rate, primarily through employee involvement in our 5-year Safety Plan.  Several developments and findings have resulted from the implementation of the various elements of our accidental release prevention program.  Facility goals are set with intent to improve safety."
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000080385,
      "SummaryText": "quickly and effectively respond to emergencies at our facility, INEOS maintains one firefighting vehicle (quick attack) with two 1,500 GPM nozzles and two mobile 500 gallon foam trailers onsite, and a water deluge system.  Fixed fire monitors are in place at the sphere, the railcar unloading rack, and throughout the facility to respond to fires.  We have an emergency flare in place to safely combust propane and propylene during upsets or emergencies.  To ensure proper functioning, our emergency response equipment is regularly inspected and serviced. \r\n\r\nThe facility has a mass notification system to alert nearby persons during emergencies.  We also have procedures in place to alert the city of Pasadena and surrounding communities during emergencies. \r\n\r\nWe employ trained emergency responders, including onsite industrial firefighters, who train annually at the Texas A&M University Industrial Fire Fighting School.  We also have an onsite emergency medical team and an onsite rescue team. Additional personnel are on contract to provide emergency response equipment, expertise, and manpower if needed.  We have an emergency communications link to offsite responders through our emergency radio system, which we and our neighboring plants continuously monitor.  In addition to the Pasadena LEPC, we also closely coordinate our emergency plan with Channel Industries Mutual Aid (CIMA).  Procedures are in place to quickly notify CIMA by radio or telephone to bring in additional help if required.  CIMA is the largest industry mutual aid organization in the world.  It is a joining together of firefighting, rescue, hazardous materials, and emergency medical manpower and equipment from more than 100 industrial facilities and federal, state, and local emergency response agencies along the Houston Ship Channel for mutual assistance in case of an emergency. \r\n\r\nOur responders participate in the annual CIMA Zone 2 Drill, and the annual general membership drill.   \r\n\r\n7.  Planned Change"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000080385,
      "SummaryText": "fill line to prevent reverse flow.  In addition, we have a facility-wide leak detection and repair program to identify and repair leaks before they could ever result in an emergency.  This program includes scheduled monitoring of pumps, valves, connectors, and other equipment using portable hydrocarbon leak detectors.  When a leak is found, it is repaired and remonitored to verify that it is leak free.\r\n\r\nAlternate Scenario (AS)\r\nINEOS's alternative release scenario involves the failure of a two-inch diameter P/P mix railcar unloading vapor hose.  In the scenario, propylene and propane are released from an unloading hose, followed by a vapor cloud explosion.  Like the worst case scenario, the maximum distance to the endpoint of 1 psi overpressure would not reach any homes, schools, or hospitals.  \r\n\r\nINEOS has installed safety systems to prevent a railcar unloading hose failure from ever occurring.  The stainless steel-braided hoses used at INEOS exceed the design and construction requirements for our railcar unloading conditions.  Hoses are inspected prior to each use and fittings are replaced whenever indications of visible wear are present.  Railcar grounds are used to prevent any static discharge.\r\n\r\nThere is a relief valve on every P/P mix railcar to prevent the railcar and unloading hose from over pressuring.  We have instrument alarms to warn of potential equipment malfunction and equipment shutdowns to shut off flow.  Each unloading station is monitored via closed circuit television from a manned control room.  An automatic shutoff valve is located on each railcar to shut off flow if the unloading hose fails.  We have multiple remote block valves, check valves, and a control valve that can shut off flow to the railcar unloading line to isolate and limit any release.  \r\n\r\n4.  The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\r\n\r\nINEOS has put a program in place to meet or exceed every requirement of the accidental rel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000080385,
      "SummaryText": "ease prevention provisions set out in 40 CFR part 68 by the EPA.  The facility was designed and constructed in accordance with NFPA-58 Standard, 1967 Edition.  Processes at our facility are also subject to the Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) standard under 29 CFR 1910.119.    The following sections briefly describe the main elements of the release prevention program that are in place at our facility.\r\n\r\nProcess Safety Information\r\nINEOS maintains a detailed record of safety information that describes the chemical hazards, operating parameters and equipment designs associated with our processes.\r\n\r\nProcess Hazard Analysis\r\nSystems are in place to safely manage change as part of our process safety management program.   Comprehensive hazard reviews (where teams of employees examine potential hazards and develop ways to mitigate them) are performed to ensure that hazards associated with our processes are identified and controlled effectively.  The reviews are undertaken by a team of qualified personnel with expertise in engineering and process operations and are revalidated at regular intervals.  Any findings related to the hazard analysis are addressed promptly.\r\n\r\nOperating Procedures\r\nIn order to safely conduct activities at our facility, INEOS maintains detailed written operating procedures.  These procedures cover initial plant startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround.  They describe the tasks we must perform, safe operating parameters that we must maintain, and safety precautions for operations and maintenance activities.  The procedures are reviewed annually and are readily accessible to our operators.\r\n\r\nTraining\r\nINEOS has a formal training program to ensure that all employees who are operating processes are trained and tested in the operating procedures associated with these processes.   Refresher training is pr"
    }
  ]
}