{
  "FacilityID": 1000103808,
  "FacilityName": "Freshpoint Southern California",
  "FacilityStr1": "155 North Orange Avenue",
  "FacilityStr2": null,
  "FacilityCity": "City of Industry",
  "FacilityState": "CA",
  "FacilityZipCode": "91744",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06037",
  "LEPC": "California LEPC Region I",
  "FacilityLatDecDegs": "34.040312",
  "FacilityLongDecDegs": "-117.980943",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "G4",
  "LatLongDescription": "PC",
  "FacilityURL": "https://www.freshpoint.com/southerncalifornia/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Sysco Foods Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Freshpoint Southern California",
  "OperatorStr1": "155 North Orange Avenue",
  "OperatorStr2": null,
  "OperatorCity": "City of Industry",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "91744",
  "OperatorZipCodeExt": null,
  "FTE": 345,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000198877",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2022-08-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-01-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-01-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-01-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-01-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 34.038923,
  "FRS_Long": -117.978369,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000129241,
      "AltID": "Ammonia Refrigerated Whse",
      "FacilityID": 1000103808,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000162009,
          "ProcessID": 1000129241,
          "ChemicalID": 56,
          "Quantity": 12000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000130639,
          "ProcessID": 1000129241,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000111384,
              "Process_NAICS_ID": 1000130639,
              "SafetyReviewDate": "2022-11-10 00:00:00",
              "PHA_Date": "2022-02-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "process walkthrough inspection",
              "PHACompletionDate": "2023-09-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Backup Power for Emergency Lighting",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": "Ammonia Dispersion (neutralization in water) Tank",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "upgrade of ammonia leak detection system",
              "OpProceduresReviewDate": "2022-06-15 00:00:00",
              "TrainingReviewDate": "2022-06-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-11-10 00:00:00",
              "EquipmentInspectionDate": "2022-08-30 00:00:00",
              "EquipmentTested": "Ammonia leak detector testing & calibration",
              "ChangeMgmtDate": "2022-10-17 00:00:00",
              "ChangeMgmtReviewDate": "2022-06-15 00:00:00",
              "PreStartupReviewDate": "2021-03-19 00:00:00",
              "ComplianceAuditDate": "2022-06-15 00:00:00",
              "AuditCompletionDate": "2023-12-01 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2022-11-10 00:00:00",
              "HotWorkPermitReviewDate": "2022-06-15 00:00:00",
              "ContractorSafetyReviewDate": "2022-03-18 00:00:00",
              "ContractorSafetyEvalDate": "2022-09-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000139892,
                  "PreventionProgram3ID": 1000111384,
                  "ProcessChemicalID": 1000162009
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000103808,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "LA COUNTY FIRE DEPARTMENT Sta. 87",
    "CoordinatingAgencyPhone": "6263362611",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000103808,
      "SummaryText": "ility has worked to address safety issues as they arise in a continued effort to ensure a safe work environment. Compliance Audits, PHA studies, Mechanical Integrity Inspections, in addition to routine PSM / RMP Committee Meetings have generated recommendations to improve safety and compliance at the facility.  These include enhancing employee training policies, revising standard operating procedures, improving documentation and recordkeeping, and updating preventative maintenance policies, as well as ammonia equipment repairs.\n\nFreshpoint Southern California representatives also provide guidance and assistance for the facility personnel to ensure outstanding issues are resolved, and that the facility remains in compliance.  Freshpoint also plans to improve safety as follows:\n\n  --  Providing ammonia hazard communication and awareness training for all facility employees.\n  --  Training key facility personnel regarding acceptable operational parameters for the various ammonia refrigeration components.\n  --  Continued involvement of facility personnel in the ongoing development and implementation of the PSM, RMP, and CalARP risk management policies.\n  --  Maintaining professional contact with people who have vast experience in the ammonia industry such as the professional refrigeration engineering and service company, and the PSM/RMP/CalARP consultant.\n  --  Conducting routine PSM/RMP/CalARP Team meetings to ensure any issues identified by Facilities  Department personnel, contractors, consultants, or the operations department are discussed and addressed.\n  --  Reviewing and auditing the risk management and prevention policies to ensure they are maximizing the facility\u0092s efforts at limiting the risks associated with handling anhydrous ammonia."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000103808,
      "SummaryText": "2017 \u0096 December 2022) that meet the EPA reporting criteria for the Five-Year Accident History as specified above.  In addition, there have been no injuries resulting from a release of ammonia.\n\n\nEMERGENCY RESPONSE PROGRAM  \n\nAn emergency planning and response policy has been developed at the Freshpoint Southern California facility.  Since the facility does not maintain an internal \u0093Emergency Response Team\u0094, the policy is based on Cal-OSHA\u0092s requirements for Emergency Action Plan (CCR Title 8, Section 3220).  The Emergency Action Plan is detailed in the Emergency Planning & Response section of the PSM / RMP documents which is maintained by the Facility Maintenance Manager at the facility.\n\nThis program contains procedures detailing how the facility will respond to accidental ammonia releases and other emergencies such as fires, earthquakes, power outages, etc.  This program has been coordinated with the local emergency service agencies including: the City of Industry Fire Department, Los Angeles County Fire Department + HazMat Team, and the local emergency management services agency.\n\nThe facility\u0092s Emergency Action Plan Policy includes the following elements:\n\n  --  Key Facility Personnel and Responsibilities\n  --  Outside Agency Notification Contact Information\n  --  Detailed Action Plans for Internal Departments\n  --  First Aid Procedures\n  --  Emergency Medical Treatment Procedures\n  --  Evacuation Plans + Assembly Areas\n  --  Description for Handling Small Ammonia Releases\n  --  Details of Outside Assistance Available \n  --  Incident Command System\n  --  Initial and Refresher Training\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nFreshpoint Southern California is committed to the safety of employees, contractors/guests/visitors, as well as neighbors.  Continual evaluations of risks associated with the ammonia systems by in-house personnel as well as outside risk management professionals help to limit the possibility of unintended impacts associated with ammonia.\n\nThe fac"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000103808,
      "SummaryText": "frigeration systems.  Safety features include ammonia leak detectors in the machinery room and cold storage zones, microprocessor controlled compressors with automatic alarms + trips, ASME certified pressure vessels, and emergency stop controls.\n\nThe majority of the ammonia inventory is centrally located in the machine room vessels and equipment.  All pressure-rated vessels are equipped with mechanical pressure relief valves that automatically engage in case of a high pressure situation and vent to a water diffusion tank that is available to neutralize high pressure ammonia.\n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes, as ammonia is cycled through stages of liquid to vapor to liquid, similar to the refrigerant in a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\n\nContinued safety improvement for the ammonia refrigeration system is a top priority for Freshpoint Southern California.  The management plan, internal audits, Process Hazard Analysis studies, as well as our risk management policies are monitored and updated as appropriate to ensure that all elements of our PSM / RMP program remain accurate and complete.\n\n\nFIVE-YEAR ACCIDENT HISTORY\n\nEPA\u0092s RMP regulation defines \u0093accident\u0094 as the following: \n\n\u0093The release must be from a covered process and involve a regulated substance held above its threshold quantity in the process. The release must have caused at least one of the following: \n\n--  On-site deaths, injuries, or significant property damage (§68.42(a)); or\n--  Known offsite deaths, injuries, property damage, environmental damage, evacuations, or sheltering in place (§68.42(a)).\u0094\n\nAn investigation into the facility\u0092s accident history revealed that there have been no releases of ammonia over the past five years (December"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000103808,
      "SummaryText": "tastrophic accidents.\n\nPrograms developed for the PSM / RMP programs include employee participation, process safety information, process hazard analysis, pre-startup safety review, standard operating procedures, training, management of change, mechanical integrity (inspections / testing / maintenance), hot work permit, contractor management, and incident investigation.  To help coordinate the various elements of the program, a management system has been established that defines responsible parties at the facility for each element of the facility\u0092s PSM / RMP program.  The facility utilizes the services of a local professional refrigeration contractor for routine inspections / testing / maintenance activities, as well as service calls.  The preventative maintenance program is based on manufacturer recommendations, as well as industry standards and guidelines.\n\nIn the event of an accidental ammonia release, the emergency response plan is coordinated with the local emergency planning commission (LEPC) and the local fire house \u0096 Los Angeles County Fire Department Station 87.  The ultimate goal for Freshpoint Southern California\u0092s PSM / RMP plan is to prevent accidental releases of ammonia, injuries / illnesses, and to avoid adverse impacts to the environment.  These programs enable our facility to operate a refrigeration system safely because they are based on the rules, procedures, and guidelines that govern the ammonia refrigeration system, as well as the broader ammonia refrigeration industry throughout the country.\n\nThe Freshpoint Southern California ammonia refrigeration system has many safety features.  Much of the safety of the system is inherent in the policies and procedures that govern the operation of the system.  The Freshpoint Southern California facility, including the ammonia system, was designed and constructed in accordance with the recognized industry codes and standards, which specifically outline requirements for the design and operation of ammonia re"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000103808,
      "SummaryText": "ssure relief valves are replaced on a five year frequency.  Ammonia leak detectors are calibrated semi-annually and trigger local audible + visual alarms for facility personnel.\n\nRefrigeration process equipment at the facility operates continuously based on temperature readings in the warehouse.  The compressors and condensers cycle on and off to address system heat load demands during operation.  The refrigeration machinery room houses the compressors, recirculator and accumulator vessels, and auxiliary components, while the condenser is located on a raised platform outside.  Evaporators are located in various cold storage and dock rooms throughout the building.\n\nAmmonia is used as the primary refrigerant, which means it is used as a vehicle to move heat from cold storage zones to the outside atmosphere.  When heat is absorbed by the liquid ammonia, it vaporizes (changes phase), and is then compressed by the compressors.  The resulting high pressure ammonia vapor is routed to the condensers, where fans and sprayed water are used to reject latent heat in the ammonia vapor, causing it to condense to a liquid.\n\nMultiple auxiliary systems are in place to support the operational and safety requirements of the ammonia system including:  ammonia leak detection, auto purger to remove non-condensible gasses, pressure relief system, refrigeration control system, and a water diffusion tank that neutralizes any ammonia vapor vented through a pressure relief valve.  An Emergency Refrigerant Control Box is also available and can be used to reduce pressures on the high pressure side of the system.\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\nTo deal with the risks involved with ammonia refrigeration systems, policies and programs have been developed for the Freshpoint Southern California facility to limit the risks of an accidental ammonia release and/or minimize the consequences of a significant release, fires, explosions, and other types of ca"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000103808,
      "SummaryText": "Manager, are responsible for implementation of the PSM and RMP policies aimed at reducing the risks associated with the ammonia refrigeration system.  The facility also utilizes the support of a professional refrigeration contractor to ensure the on-going integrity of the ammonia equipment.\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\nThe Freshpoint Southern California facility (including the ammonia refrigeration system) was commissioned in 2007.  The facility is located approximately 1.8 miles east of Interstate 605 freeway, and approximately 1.5 miles north of CA State Highway 60, and just north of Valley Boulevard.\n\nFreshpoint Southern California is a cold storage logistics facility that receives, sorts, and distributes cold food products.  The refrigeration requirements are serviced by an industrial refrigeration system that utilizes anhydrous ammonia as the refrigerant.  The maximum intended inventory of ammonia at the facility is approximately 12,000 pounds.\n\nThe accidental release prevention program starts with good operating and safe work practices.  All ammonia process equipment, piping, and valves are inspected and maintained on a regular schedule by a professional refrigeration contractor in accordance with manufacturer and industry recommendations.\n\nFor example, all compressors are routinely inspected for oil leaks, pressure and temperature gauge calibrations, vibration analysis, oil pressure, and amp reading for motors;  alignment of compressor motors and bearings, filter changes, vibration readings are performed on compressor motors;  the condensers are routinely inspected and cleaned (this includes checking and cleaning nozzles and strainers), motors are greased, fans are checked for cracks, and piping is inspected for leaks;  oil pots are drained, pump bearing wear is monitored;  visual inspection for equipment and vessel operating conditions, piping and valves are assessed for leaks, integrity, and other potential abnormalities on daily basis;  pre"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000103808,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\nFreshpoint Southern California recognizes the facility\u0092s responsibility in protecting the public, its employees, the environment, equipment, and property.  Freshpoint Southern California is strongly committed to employee, public and environmental safety.  This commitment is reflected in a comprehensive accidental release prevention program.  This program addresses the design, installation, operation, maintenance, and employee training associated with the ammonia refrigeration equipment at Freshpoint Southern California in the City of Industry, California.\n\nIt is Freshpoint Southern California\u0092s policy to ensure that controls are in place to limit the risks of potential ammonia releases.  To accomplish the company\u0092s goal in controlling accidental losses, the facility has established safety programs that enable facility personnel to: maximize safety performance, reduce risks of handling ammonia and other potentially hazardous substances, and prepare facility personnel to address emergency situations as they might arise.\n\nThe Freshpoint facility draws from decades of company (including corporate) experience and expertise, as well as resources of external consultants, to ensure that the appropriate mitigation measures have been identified and are implemented.  The commitment to safety shows in the minimal accident history at the facility.\n\nOne of the activities associated with the facility\u0092s safety program has been the development and implementation of accidental release prevention and emergency response programs which are designed to comply with OSHA\u0092s Process Safety Management (PSM) standard (Process Safety Management of Highly Hazardous Chemicals), and EPA\u0092s Risk Management Program regulation (Risk Management Programs for Chemical Accidental Release Prevention), as well as the California Accidental Release Prevention (CalARP) program.  The VP of Operations along with support from the Facility Maintenance"
    }
  ]
}