{
  "FacilityID": 1000068100,
  "FacilityName": "OBI Seafoods - Petersburg",
  "FacilityStr1": "411 N Nordic Drive",
  "FacilityStr2": null,
  "FacilityCity": "Petersburg",
  "FacilityState": "AK",
  "FacilityZipCode": "99833",
  "Facility4DigitZipExt": "1147",
  "FacilityCountyFIPS": "02280",
  "LEPC": "Petersburg/Wrangell LEPC",
  "FacilityLatDecDegs": "56.814722",
  "FacilityLongDecDegs": "-132.954444",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "OBI Seafoods, LLC",
  "Company2Name": null,
  "CompanyDUNS": 9484908,
  "Company2DUNS": 0,
  "OperatorName": "OBI Seafoods, LLC",
  "OperatorStr1": "PO Box 1147",
  "OperatorStr2": null,
  "OperatorCity": "Petersburg",
  "OperatorStateFIPS": "AK",
  "OperatorZipCode": "99833",
  "OperatorZipCodeExt": "1147",
  "RMPContact": "Patrick Wison",
  "RMPTitle": "Plant Manager",
  "FTE": 40,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000113003",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2014-09-16 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-07-15 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2018-02-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2018-02-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2023-02-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 56.80535,
  "FRS_Long": -132.96358,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "60",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000085362,
      "AltID": "Refrigeration System",
      "FacilityID": 1000068100,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000086605,
          "ProcessID": 1000085362,
          "NAICSCode": "31171",
          "_desc": {
            "NAICS_CODE": "31171",
            "NAICS_DESCRIPTION": "Seafood Product Preparation and Packaging"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000106594,
          "ProcessID": 1000085362,
          "ChemicalID": 56,
          "Quantity": 18000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000606594,
          "ProcessID": 1000085362,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000068100,
      "SummaryText": "This Risk Management Plan (RMP) is submitted to the United States Environmental Protection Agency (EPA) to meet the requirements of Section 112(r) of the Clean Air Act Amendments of 1990, codified in the Code of Federal Regulation Title 40 Part 68.\n\n\n\nStationary Source and Chemical of Concern\n\nIcicle Seafoods, Petersburg Fisheries, Inc. is located in Petersburg, Alaska.  The facility is staffed year-round and also employs a large seasonal workforce during the spring and summer months.  The plant produces fresh and frozen seafood products, using anhydrous ammonia in a closed system as a refrigerant.  Ammonia is the safest refrigerant available and has excellent warning properties; it is extremely pungent at levels far below dangerous concentrations.  In calculating worst-case and alternative scenarios, efforts were made in all cases to overestimate rather than underestimate the effects of a release.  The plant has been operating safely since 1923. The facility will complete major system upgrades in 2011, thus exceeding the threshold quantity for RMP.\n\nNote:  The TRI facility siting tool is no longer available, therefore coordinates are per LandView 6.\n\n\n\nWorst-Case Scenario\n\nA worst case scenario is required to be documented in the RMP.  Based on the requirements of the RMP rule, it is assumed that the largest vessel in the system fails catastrophically, releasing its entire contents over a 10-minute period.  The release is modeled using RMP*Comp&trade; software. \n\n\n\nAlternative Release Scenario\n\nThe alternative release scenario for the ammonia refrigeration process is based on a potential hazard that is possible at the facility.  In this scenario, a safety relief valve fails, releasing ammonia gas to the atmosphere.  As this valve is designed to relieve to the outdoors, no mitigation is considered in the scenario calculations.  The release is evaluated according to the procedures documented in \"General Risk Management Program Guidance\" (April 2004), Appendix E \"Supp"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000068100,
      "SummaryText": "lemental Risk Management Program Guidance for Ammonia Refrigeration Facilities\" and modeled with RMP*Comp&trade; software.\n\n\n\nRelease Prevention Program \n\nIcicle Seafoods, Petersburg Fisheries, Inc. has a prevention program in place to comply with the requirements of the Process Safety Management (PSM) standard, which is designed to prevent accidental releases of ammonia.  The PSM program addresses all required elements including employee participation, process safety information and system drawings, operating procedures, hot work permits, management of change, mechanical integrity, training, pre-startup review, compliance audits, process hazard analysis, contractor safety, incident investigation and emergency response.  The system has many safety features built in including high and low level controls and alarms, safety relief valves, automatic and manually controlled valves and shutoffs, and check valves. \n\n\n\nFive-Year Accident History\n\nPer the requirements of 40 CFR 68.42, facilities must include a five-year accident history for all accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.  There have been no incidents meeting these criteria in the past five years.\n\n\n\nEmergency Response\n\nIcicle Seafoods, Petersburg Fisheries, Inc. maintains a written emergency response plan as part of the PSM plan to facilitate safe response to accidental ammonia releases.  The plan identifies personnel designated and trained to conduct the necessary duties during a response.  Responsibilities include notification of and communication with local responders and authorities, coordinating and conducting responses, as well as maintenance of emergency equipment and trained personnel.  The facility has coordinated its emergency response plan with local authorities and responders and conducts drills periodically to prac"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000068100,
      "SummaryText": "tice responses.  Designated facility personnel receive initial and annual training and certification.\n\n"
    }
  ]
}