{
  "FacilityID": 1000100319,
  "FacilityName": "Binney Water Purification Facility",
  "FacilityStr1": "5070 South Robertsdale Way",
  "FacilityStr2": null,
  "FacilityCity": "Aurora",
  "FacilityState": "CO",
  "FacilityZipCode": "80016",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08005",
  "LEPC": "Aurora LEPC",
  "FacilityLatDecDegs": "39.623252",
  "FacilityLongDecDegs": "-104.668354",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I1",
  "LatLongDescription": "AB",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 24338936,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Aurora Water",
  "OperatorStr1": "5070 South Robertsdale Way",
  "OperatorStr2": null,
  "OperatorCity": "Aurora",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80016",
  "OperatorZipCodeExt": null,
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000211521",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-07-20 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-05-05 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-05-05 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-05-05 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-05-05 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.623252,
  "FRS_Long": -104.668354,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "12.2",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000124209,
      "AltID": "Chlorine",
      "FacilityID": 1000100319,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000155199,
          "ProcessID": 1000124209,
          "ChemicalID": 62,
          "Quantity": 32000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000125621,
          "ProcessID": 1000124209,
          "NAICSCode": "22131",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000077965,
              "Process_NAICS_ID": 1000125621,
              "SafetyReviewDate": "2022-01-17 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "Yes",
              "FR_ANSI": "Yes",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "Chlorine Institute Pamphlet 6, Edition 17, April 2020",
              "FR_Comments": null,
              "HazardReviewDate": "2021-10-13 00:00:00",
              "ChangeCompletionDate": "2021-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Blast door",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2021-11-26 00:00:00",
              "TrainingReviewDate": "2022-01-17 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-11-26 00:00:00",
              "EquipmentInspectionDate": "2022-03-24 00:00:00",
              "EquipmentTested": "chlorine system hoist",
              "ComplianceAuditDate": "2021-05-24 00:00:00",
              "AuditCompletionDate": "2021-05-24 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000078675,
                  "PreventionProgram2ID": 1000077965,
                  "ProcessChemicalID": 1000155199
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000100319,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Aurora Fire Department",
    "CoordinatingAgencyPhone": "3036273130",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000100319,
      "SummaryText": "Introduction and Background\r\n\r\nThe U.S. Environmental Protection Agency's (EPA) Clean Air Act (CAA) Amendments of 1990 included provisions that require facilities that use certain substances to develop a plan to reduce the likelihood of an accidental release of the substances to the atmosphere and reduce the likelihood of serious harm to the public and the environment. The plan must also include mitigation measures to reduce the potential impact on the public in the unlikely event of a release. The requirements of this plan, commonly referred to as a Risk Management Plan (RMP), are detailed and codified in 40 Code of Federal Regulations (CFR) Part 68. \r\n\r\nThe Binney Water Purification Facility (BWPF) has chlorine in quantities above the regulatory threshold for which an RMP is required. \r\n\r\nChlorine is used at BWPF primarily to disinfect the drinking water prior to distribution. No other 40 CFR Part 68 chemicals are stored at the plant.\r\n\r\nThe RMP consists of three compliance programs, each with progressively stricter compliance standards. The chlorination processes at the BWPF are subject to Program 2, the second most stringent of the three programs, because the worst-case modeling includes public receptors within the impact area. The process however is not included in the specified standard industrial classification (SIC) codes and is not currently regulated under federal or state Process Safety Management (PSM) Requirements.\r\n\r\nProgram 2 of the RMP consists of two major parts. The first part is the hazard assessment. The hazard assessment is performed to determine the effects of a release of a regulated substance could have on the public. The second part is a prevention program that consists of seven elements designed to improve the system safety and decrease the likelihood of a release. These RMP components are described in the following paragraphs.\r\n\r\nHazard Assessment\r\n\r\nA hazard assessment was performed to determine the effects that a chlorine release would h"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000100319,
      "SummaryText": "ave on the public and environment. For the worst-case and alternative release scenarios, the distance from the point of release to the toxic endpoint, or the location at which individuals could be exposed for up to 1 hour without experiencing serious health effects, was determined. An estimate of the population affected by a release of chlorine was also determined, along with sensitive receptors such as schools, state parks and shopping areas. The hazard assessment also includes examining the plant's 5-year accident history. No accidents have occurred with respect to the chlorine processes in the last 5 years. \r\n\r\nPrevention Program\r\n\r\nThe prevention program consists of seven elements designed to improve the system safety and decrease the likelihood of a release.\r\n\r\nSafety Information\r\n\r\nThe RMP regulations require that information concerning process chemicals, technology, and equipment be compiled as part of an RMP program. Emergency response planners can use such information to develop training programs and procedures, or as a general resource. If needed, the information can be supplied to contractors who will work in the chlorine process area. All of the required process safety information was compiled as required by the RMP regulations. The information meets and in many cases exceeds the minimum required by the regulations.\r\n\r\nHazard Review\r\n\r\nA process hazard analysis (PHA) was conducted to evaluate potential causes and consequences of accidental releases. This information was used by BWPF staff to improve safety and reduce the consequences of accidental releases. Equipment, instrumentation, utilities, human actions, and external factors that might affect the process were the focus of the PHAs that were performed for the chlorine processes.\r\n\r\nThe chlorine PHAs was conducted by an interdisciplinary team of BWPF staff familiar with the process operation and maintenance. The PHA was performed using the American Water Works Association Research Foundation (AWWARF)"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000100319,
      "SummaryText": "Hazard Review Checklist in the Compliance Guidance and Model Risk Management Program for Water Treatment Plants. Based on the results of the PHAs, some changes in operating, maintenance, and other process safety management procedures that would improve the overall safety of the BWPF were identified and an implementation schedule was developed.\r\n\r\nOperating Procedures\r\n\r\nStandard Operating Procedures (SOPs) for the chlorination process was developed in conjunction with the RMP. Written operating procedures assure continuous, efficient, and safe operation of the plant. The goal of the SOPs is to provide clear instructions to safely operate the process. SOPs are also used to train new employees and to provide refresher training for existing staff.\r\n\r\nThe detailed SOPs include start-up, shutdown, and emergency operating procedures. The procedures describe how the system should be operated to minimize the chances of an accidental release. The procedures also emphasize safety considerations during operation and address hazardous situations that can occur and how to correct them.\r\n\r\nTraining\r\n\r\nAn effective RMP training program can significantly reduce the number and severity of accidental release incidences. Employees involved in operating or maintaining the chlorination process must receive training that includes applicable operating and maintenance procedures and an overview of the process. Training must emphasize safety and health hazards and safe work practices. The BWPF operators are certified and comply with CDPHE Regulation 100, 5 CCR-1003-2. Training and continuing Education Training Units are required to maintain certifications.\r\n\r\nBWPF staff will receive training on the safety information and operations and maintenance of chlorine prior to bringing it on-site. \r\n\r\nIn addition, operators must demonstrate proficiency with the chlorine system and be fit tested for PPE prior to be allowed to perform duties within the Chlorine Storage Room. In addition to the above"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000100319,
      "SummaryText": "referenced training, select BWPF staff have been trained to respond to an incidental chlorine gas release. Larger releases are addressed as part of the BWPF's Emergency Response Program.\r\n\r\nMaintenance\r\n\r\nAn effective maintenance program is one of the primary lines of defense against a release. The maintenance program addresses equipment testing and inspection and preventative maintenance schedules. The intent is to ensure that equipment used to process, store, or handle chlorine is maintained and installed to minimize the risk of releases.\r\n\r\nThe BWPF is maintained by the by Aurora Water Operational Staff. A computerized maintenance management system is used to generate work orders and schedule preventative maintenance. In addition to preventative maintenance, the Aurora Water Operational Staff performs corrective maintenance in the event of equipment malfunction or breakdown. Work orders indicate what safety precautions must be followed including whether lock-out/tag-out or confined space entry provisions are applicable.\r\n\r\nCompliance Audit\r\n\r\nThe BWPF is required to complete periodic audits for the RMP program. The primary goals of conducting an internal compliance audit are to gather sufficient data to verify compliance with RMP requirements and good process safety practices, identify process safety deficiencies and develop corrective actions, and increase safety awareness among plant staff.\r\n\r\nThe compliance audit methodology is modeled after Occupational Safety and Health Administration (OSHA)Compliance Guidelines and Recommendations for Process Safety Management. An internal compliance audit must be conducted at the plant at least once every 3 years beginning June 24, 2010 for chlorine. A team that includes at least one person knowledgeable in the covered process and an audit leader knowledgeable in RMP requirements and audit techniques will conduct the audits. The Treatment Plant Supervisor and the audit team will promptly determine an appropriate corrective"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000100319,
      "SummaryText": "action for each deficiency identified during the audit and document the corrective actions and the dates by which they must be taken.\r\n\r\nIncident Investigation\r\n\r\nEach incident that resulted in or could reasonably have resulted in a catastrophic release of chlorine must be investigated. A process to identify the underlying causes of incidents and to implement procedures for preventing similar events has been developed. To investigate an incident, an investigation team will be established. As part of the investigation, an incident report will be prepared to recommend system changes.\r\n\r\nThe investigation team should ask questions such as what equipment failed, which behavior failed, and which material leaked, reacted, or exploded? As part of the incident review, staff actions that may have contributed to the incident will also be reviewed. A determination will be made regarding whether it is necessary to institute additional training for the employees to prevent the incident from occurring in the future. On the incident report form, the Treatment Plant Supervisor identifies which of the recommended system changes are approved for implementation. The incident investigation report and any changes resulting from the report will be reviewed with all staff members who operate and maintain the applicable system."
    }
  ]
}