{
  "FacilityID": 1000092783,
  "FacilityName": "Zeco",
  "FacilityStr1": "4146 Southcreek Road",
  "FacilityStr2": null,
  "FacilityCity": "Chattanooga",
  "FacilityState": "TN",
  "FacilityZipCode": "37406",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47065",
  "LEPC": "Hamilton County LEPC",
  "FacilityLatDecDegs": "35.09183",
  "FacilityLongDecDegs": "-85.24577",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "A2",
  "LatLongDescription": "AB",
  "FacilityURL": "www.vincitgroup.com",
  "FacilityEmailAddress": "info@vincitgroup.com",
  "FacilityDUNS": null,
  "ParentCompanyName": "The Vincit Group",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Robert C. Bullard",
  "OperatorStr1": "412 Georgia Avenue Suite 300",
  "OperatorStr2": null,
  "OperatorCity": "Chattanooga",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37403",
  "OperatorZipCodeExt": null,
  "FTE": 42,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000226784",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-10-16 00:00:00",
  "SafetyInspectionBy": "Food Safety Audit",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-03-08 12:19:14",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-08 12:19:14",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-03-08 12:19:14",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-08 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": 35.09183,
  "FRS_Long": -85.24577,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "ADDRESS MATCHING-BLOCK FACE",
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115130,
      "AltID": "Chemical Manufacturing",
      "FacilityID": 1000092783,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000143872,
          "ProcessID": 1000115130,
          "ChemicalID": 18,
          "Quantity": 15024.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000116543,
          "ProcessID": 1000115130,
          "NAICSCode": "325611",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000072692,
              "Process_NAICS_ID": 1000116543,
              "SafetyReviewDate": "2020-12-08 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "OSHA (29 CFR 1910.119",
              "FR_Comments": null,
              "HazardReviewDate": "2020-05-17 00:00:00",
              "ChangeCompletionDate": "2020-06-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "Yes",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "Yes",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2020-11-01 00:00:00",
              "TrainingReviewDate": "2020-11-01 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2020-11-04 00:00:00",
              "EquipmentInspectionDate": "2021-01-14 00:00:00",
              "EquipmentTested": "All valves and pumps were changed out and are on a PM system for every 6 months.",
              "ComplianceAuditDate": "2020-12-23 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": "2020-10-12 00:00:00",
              "InvestigationChangeDate": "2021-01-01 00:00:00",
              "MostRecentChangeDate": "2021-01-01 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000073460,
                  "PreventionProgram2ID": 1000072692,
                  "ProcessChemicalID": 1000143872
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000092783,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2020-12-08 00:00:00",
    "ERTrainingDate": "2019-08-28 00:00:00",
    "CoordinatingAgencyName": "Hamilton County Hazardous Materials",
    "CoordinatingAgencyPhone": "4232096900",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092783,
      "SummaryText": "Executive Summary\r\n\r\nRisk Management Plan\r\n\r\nZeco, South Creek, Chattanooga, TN\r\n\r\n\r\n\r\nAccidental Release Prevention and Response Policies\r\n\r\nThe Zeco South Creek chemical manufacturing/distribution plant has had a long-standing commitment to protecting their employees, the public, and the environment. This commitment is demonstrated by the resources invested in accident prevention such as: providing comprehensive initial and refresher personnel training, considering safety in the design, installation, operation, inspection, and maintenance of our processes, and conducting drills to respond to simulated emergencies. Our objective is to implement controls to minimize the potential for releases or spills. However, if a release/spill occurs, our trained personnel will respond to control, contain, and mitigate the leak.\r\n\r\n\r\n\r\nWe prevent accidents using a structured safety management system entitled VG EHS Management System, Operations Management Systems, and a Safety Culture in which all employees play a role in the prevention of incidents. Our Operations Management Systems are the cornerstone for continuous improvement in our safety-related systems. These systems are evergreen and are in a continuous state of improvement, usually through many small improvement steps. Some examples are the recommendations from our safety audits and any incident investigations.\r\n\r\n\r\n\r\nThe South Creek Plant has been recognized by the Vincit Group for its effective safety and health management programs. Our plant is also seen the driver for safety improvements throughout Zeco and is currently mentoring our other two sites.\r\n\r\n\r\nDescription of the Stationary Source and Regulated Substances\r\n\r\n\r\nThe South Creek Chemical Plant, located in Chattanooga, TN, operates several processes to produce cleaning products for the food protein and waste water industries. Zeco only has two products that are regulated by EPA.  Our regulated toxic material is: Peracetic acid.\r\n\r\nGeneral Accidental Release P"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092783,
      "SummaryText": "revention Program\r\n\r\nThe plant uses a structured Environmental, Health, and Safety program, which covers all aspects of our operations that could affect the safety or health of our employees or public neighbors.  Although the plant is part of a larger company Vincit Group, the Zeco plant is evaluation the possibility of using the Environmental Management Systems (ISO 14001). \r\n\r\n\r\nThe EHS system meets all the requirements of the EPA Risk Management Program.  The system also exceeds all regulatory requirements by incorporating periodic management review of performance measurements for each practice to evaluate whether each practice is working as planned and what improvements might be made. The Zeco Plant conducts quarterly EHS audits which meets and goes beyond the regulations. \r\n\r\n\r\nThe EPA RMP area is described in greater detail below and in the Data Element Section. Due to the ongoing nature of our safety program, the dates associated with the various activities in our accident prevention program are constantly being updated. \r\n\r\n\r\n\r\nEmployee Participation\r\n\r\n\r\nZeco encourages employees to participate in all facets of EHS management process and accident prevention. An annual plan is developed with employee participation. This includes weekly safety meetings for operations and maintenance personnel, monthly safety audits, meetings of the Emergency Spill Response Plan and most recently, a training matrix is used to access employee training needs and requirements. Employees also participate in the development and updating of operating and maintenance procedures and conducting Hazard Analyses \r\n\r\n\r\n\r\nThe Safety Director reports directly to the Zeco operations director and is the final review on safety matters relating to facilities and operations. Safety, in the current environment, encompasses a broad range of issues. Not only is it necessary to provide for the well-being of the plant workers and equipment, but also to protect the community from any harm resultin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092783,
      "SummaryText": "g from an in-plant incident. The role and objectives of the Safety Director recognize this broader involvement\r\n\r\nThe general objectives of the Safety Director are as follows: \r\n\r\nHelp anticipate hazards and work with operations to avoid them.\r\n\r\nPromote improvements in safety matters throughout the plant. \r\n\r\nHelp develop and maintain a realistic and credible plant-wide Safety, Health and Environmental policy that reflects this broader definition.\r\n\r\nMonitor and provide continuity for Safety, Health and Environmental standards in facilities and procedures, and monitor progress in plant programs aimed at a more secure workplace. These standards consist of the applicable codes and industry standards.\r\n\r\n\r\nEmployee participation is further amplified in the Safety Committee. This safety committee meets quarterly and is represented by experienced colleagues in management and labor areas. The Plant Manager and hourly employee committee members co-chair the EHS Programs, which focuses on EHS programs and systems including security. Key EHS personnel are included in the quarterly agenda to report on on-going programs and initiatives. \r\n\r\nProcess Safety Information\r\n\r\n\r\nThe Zeco Plant keeps a variety of technical documents that are used to help maintain safe operation of the processes. These documents address chemical properties and associated hazards, limits for key process parameters, specific chemical inventories, equipment design basis, and equipment configuration information. Specific groups within the plant are assigned responsibility for maintaining the information up-to-date.\r\n\r\n\r\n\r\n\r\nChemical-specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in safety data sheets (SDS). In general the process safety information is maintained in site SOP.\r\n\r\n\r\n\r\nThe plant also maintains numerous technical documents that provide information about the design and construction of process equipment. This information i"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000092783,
      "SummaryText": "ncludes materials of construction, and chemical ratings, and electrical rating of equipment. This information, in combination with written procedures and trained personnel, provides a basis for establishing inspection and maintenance activities. This information is also used in evaluating proposed process and facility changes to ensure that safety features.\r\n\r\n\r\n\r\nHazard Analysis\r\n\r\n\r\nThe Zeco Plant has a comprehensive program of Residual Risk Reduction R3. Within this program each process is systematically examined to identify hazards and ensure that adequate controls are in place to manage the hazards.\r\n\r\n\r\n\r\nZeco used a knowledge-based R3 analysis technique to perform HA's.  R3 analysis is widely recognized as one of the most systematic and thorough HA techniques. The analyses are conducted using a team of people who have operating experience and engineering expertise on the process to be evaluated. This HA team identifies and evaluates hazards of the process as well as accident prevention and mitigation measures. The team also makes suggestions for additional prevention and/or mitigation measures when they might be appropriate.\r\n\r\n\r\n\r\nThe HA team findings are provided to local management for resolution. Implementation of prevention/mitigation steps in response to HA findings is based on the relative risk evaluation done by the HA team. Potential hazard scenarios with the greater assigned risk receive attention first. All HA findings are tracked until they are resolved. The findings and any resolutions are documented and retained for the life of the process.\r\n\r\n\r\n\r\nThe plant updates and revalidates the hazard analysis for each unit every five years. The results and findings from these updates are documented and retained for the life of the process. The team findings are forwarded to management for consideration, and resolution of the findings is documented and retained. \r\n\r\n\r\n\r\nOperating Procedures\r\n\r\n\r\nThe Zeco Chemical Plant maintains written procedures that ad"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000092783,
      "SummaryText": "dress various modes of process operations, such as startup, shutdown, normal, and emergency operations. These procedures can be used as a reference by experienced operators, and they provide a consistent basis for training new operators. These procedures are periodically reviewed and annually certified as current and accurate. The procedures are maintained current and accurate by revising them as necessary to reflect changes made through the management of change system.\r\n\r\n\r\n\r\nThe Zeco Chemical Plant has identified critical safe operating limits for process parameters such as temperature, levels, and compositions. This information along with written operating procedures is readily available to operators in the process and to other personnel to use as necessary to safely perform their job tasks.\r\n\r\n\r\nHot Work and Safe Work Practices\r\n\r\n\r\nThe Zeco Chemical Plant has long-standing safe work practices in place to help ensure worker and process safety. All safe work practices are contained in the site Safety, Health, and Environmental Manual that is available electronically from every desk on personal computer. Examples of safe work practices include: energy isolation for equipment being worked on (lockout/tagout), procedures for the safe removal of hazardous materials before opening process piping/equipment (work permit), hot work permit/procedure to safely manage spark-producing activities, vehicle entry into process areas, confined space entry permit/procedure, and job safety analyses to identify and mitigate hazards associated with maintenance tasks. These practices (and others), along with training, form a system to help ensure that operations and maintenance activities are performed safely. Unit-specific safe work practices are located in the unit standard operating manuals (SOPs), which are available electronically.\r\n\r\n\r\n\r\nTraining\r\n\r\n\r\nTo be compliment the written procedures for process operations, the Zeco Chemical Plant has implemented comprehensive training fo"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000092783,
      "SummaryText": "r all employees involved in operating a process. The process technician training program includes initial classroom and on-the-job training for new hire and newly assigned technicians. Phase 1 of the program covers orientation and initial process training in a classroom setting. Phase 2 relies on unit training manuals and provides a combination of classroom and field training. Phase 3 is on-the-job training with a qualified technician. Final evaluation of the trainee includes a written test and an oral field walk-through. Both are conducted by unit supervision. New hires must complete all three phases of the program while newly assigned process technicians begin their training at Phase 2.\r\n\r\n\r\n\r\nProcess Technician refresher training is provided through Safety Day,  unit-specific refresher training, and weekly safety meetings. Safety Day serves as the annual Hazmat technician refresher training for process technicians and general safety training, including: Fire Training, RCRA Refresher, Spill Response. Unit-specific Refresher Training covers standard and emergency procedures, simulated emergencies, and a review of the SDS EHS on the unit, and is conducted at least every three years. Respirator Fit testing are done on an annual basis in the field in separate training sessions. All of this training is documented for each process technician, including the means to verify that technician understood the training.\r\n\r\nMechanical Integrity/Preventative Maintenance\r\n\r\n\r\nThe Zeco Preventive Maintenance and Inspection Program is centered around a excel based management program. The excel contains technical data on piping, fixed equipment, machinery, and specifies the preventive maintenance frequencies and procedures required for each individual piece of equipment. Equipment breakdown and repair history are also recorded. Some older historical records will remain in a paper-based file.\r\n\r\n\r\n\r\nFixed equipment inspection intervals for all equipment are developed on a systematic b"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000092783,
      "SummaryText": "asis that includes historical data and current non-destructive inspection results. A quarterly inspection planning report is generated showing the equipment that is scheduled for inspection during the current year and what has not been completed yet.\r\n\r\n\r\n\r\nThe fixed equipment inspection techniques in use are in compliance with our own and applicable industry standards. Zeco's blending tank is a non-pressurized vessel that is kept at ambient temperature and pressure.  The tank is gravity fed using manual control valves and motors.\r\n\r\n\r\n\r\nSafety valves, rupture disks, and instrumentation systems designated as critical for either safety or environmental purposes are handled similarly in the R3 system. The intervals between inspection of these devices are set on the basis of criticality of service and analysis of the historical data. The list of safety and environmentally critical instrumentation is periodically reviewed to ensure effective coverage. Monthly reports are generated showing the status of equipment that is scheduled for inspection that month and year-to-date, and any equipment whose inspection may be overdue.\r\n\r\n\r\n\r\nQuarterly, EHS metrics are reviewed with the Site Operations in each operating area. Included is a review of the status of PM completion and fixed equipment inspection.\r\n\r\n\r\nAnother integral part of the mechanical integrity program is quality assurance. The Zeco Chemical Plant incorporates quality assurance measures into equipment purchases and repairs. This helps ensure that new equipment is suitable for its intended use and that proper materials and spare parts are used when repairs are made.\r\n\r\n\r\n\r\nIncident Investigation\r\n\r\n\r\nThe Zeco Plant investigates all Safety and Environmental accidents and incidents. Accidents are events that resulted in personnel injury, a reportable release/discharge or equipment damage. Incidents are events that had the potential to be an accident (near miss). The goal of each investigation is to determine the facts"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000092783,
      "SummaryText": "supplements the material in the site-wide Emergency Manual with additional information specific to chemical accident. \r\n\r\nEmergency Preparedness also includes numerous desktop exercises, including security, which is an integral part of the site integrity program. A security desk top drill will be performed in 2015, under the auspices of the Department of Homeland Security (DHS),"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000092783,
      "SummaryText": "and develop corrective actions to prevent a recurrence of the incident, or a similar one. All accident and incident reports are documented and provided to Plant Management for resolution. All incident and accident reports are reviewed by the Plant Manager and Director of Safety. Corrective actions taken in response to an investigation are tracked until complete. Investigation results are reviewed with employees and contractors who could be affected by the findings. Reports are retained for at least five years to be reviewed during future HAs and HA revalidations.\r\n\r\n\r\n\r\nCompliance Audits\r\n\r\n\r\n\r\nThe Zeco Plant periodically conducts an audit of the accident prevention program and the EHS Management System to determine whether the procedures and practices of the program are being utilized. Audits are conducted quarterly, annually. Audit team findings are provided to the chemical plant management for resolution. Corrective actions taken in response to the findings are tracked until they are complete. The resolution of each finding is documented and at least the two most recent audit reports are retained.\r\n\r\n\r\n\r\nChemical Specific Prevention Steps\r\n\r\n\r\n\r\nThe above accidental release prevention program applies to all facilities at our plant, not just those covered by the EPA RMP. Collectively, these prevention programs help prevent hazard scenarios that could be caused by either equipment failures or human errors.\r\n\r\n\r\n\r\nIn addition, specific features are incorporated in each process to prevent the release of regulated flammable or toxic substances. \r\nThe following features are among those used for specific processes.\r\n\r\nAll tank valves and exhaust, vent to the PAA scrubber.\r\n\r\nBack flow valves\r\n\r\nToxic gas detectors with alarms for peracetic acid. Steri-Trax system.\r\n\r\nManual valves to isolate and stop a leak.\r\n\r\nCurbing and diking to contain liquid leaks.\r\n\r\nProcedures to check for leaks before returning equipment to service after maintenance.\r\n\r\nDeluge system for any s"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000092783,
      "SummaryText": "pills associated with peracetic acid\r\n\r\nEmergency response procedures for specific chemicals.\r\n\r\nExternal barrier fence around the property and electronic locks on all door to limit access to only authorized personnel.\r\n\r\n\r\nFive Year Accident History\r\n\r\nThe Zeco Plant has had no releases or accidents during the past five years. \r\n\r\n\r\n\r\nEmergency Response Program\r\n\r\n\r\n\r\nEmergency response at the Zeco site is shared with the Chattanooga Fire Department.  The site maintains fire extinguisher and water hoses as fire-fighting equipment.  A well-equipped Chemical Plant Spill team is trained to respond to site emergencies. The Site Emergency Program and the Emergency Response Team (ERT) manuals are very comprehensive. They include very specific procedures to deal with site-wide emergencies. They also include specific external notification instructions in the event of a release.\r\n\r\n\r\nStaff members are trained in various phases of emergency response procedures. Several members of the staff are trained in basic first aid and the plant uses NOVA Care as our primary treatment facility. Arrangements are made Erlanger Hospital to provide medical services at other hours.\r\n\r\n\r\n\r\nPeriodic meetings are held with the Chattanooga Fire Department (CFD) to coordinate procedures and inform CFD officers about the site. The CFD Commander, who arrives at the site for any emergency, will be escorted to the scene to communicate with the Zeco Incident Commander, give advice and render an independent judgment of the situation.\r\n\r\n\r\n\r\nThe Chemical Plant Shift Team Leader is in charge of any Chemical plant emergency until operations management arrives. He has been trained to identify incidents that require agency notifications and has the authority to call out the Emergency Response Team (ERT). \r\n\r\n\r\nThe ERT consists of the plant management and senior staff people in Environmental, Technical, and Personnel Safety. A manual is available to guide this group to the proper agency contacts and it also"
    }
  ]
}