{
  "FacilityID": 1000048514,
  "FacilityName": "Rust-Oleum Corporation",
  "FacilityStr1": "16410 Industrial Lane",
  "FacilityStr2": null,
  "FacilityCity": "Hagerstown",
  "FacilityState": "MD",
  "FacilityZipCode": "21795",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "24043",
  "LEPC": "Washington County LEPC",
  "FacilityLatDecDegs": "39.598333",
  "FacilityLongDecDegs": "-077.801667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 5094420,
  "ParentCompanyName": "RPM, Inc.",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Rust-Oleum Corporation",
  "OperatorStr1": "11 Hawthrone Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Vernon Hills",
  "OperatorStateFIPS": "IL",
  "OperatorZipCode": "60061",
  "OperatorZipCodeExt": null,
  "FTE": 150,
  "OtherEPAFacilityID": "2174LRSTLMINTER",
  "EPAFacilityID": "100000119604",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "043-0167",
  "SafetyInspectionDate": "2015-11-10 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2016-01-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-01-07 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2016-01-07 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-01-07 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 39.599722,
  "FRS_Long": -77.794722,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060774,
      "AltID": "Aerosol Filling",
      "FacilityID": 1000048514,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000074401,
          "ProcessID": 1000060774,
          "ChemicalID": 155,
          "Quantity": 133580.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000064092,
              "ProcessChemicalID": 1000074401,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000064093,
              "ProcessChemicalID": 1000074401,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000061901,
          "ProcessID": 1000060774,
          "NAICSCode": "32551",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000050559,
              "Process_NAICS_ID": 1000061901,
              "SafetyReviewDate": "2015-11-12 00:00:00",
              "PHA_Date": "2015-11-12 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2018-05-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "No",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "Yes",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-11-12 00:00:00",
              "TrainingReviewDate": "2015-11-12 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2015-11-12 00:00:00",
              "EquipmentInspectionDate": "2015-12-28 00:00:00",
              "EquipmentTested": "Propellant Storage Tank",
              "ChangeMgmtDate": "2015-11-30 00:00:00",
              "ChangeMgmtReviewDate": "2015-11-12 00:00:00",
              "PreStartupReviewDate": "2015-12-30 00:00:00",
              "ComplianceAuditDate": "2014-08-29 00:00:00",
              "AuditCompletionDate": "2018-05-31 00:00:00",
              "IncidentInvestigationDate": "2014-11-01 00:00:00",
              "InvestigationChangeDate": "2014-11-01 00:00:00",
              "ParticipationPlansReviewDate": "2015-11-12 00:00:00",
              "HotWorkPermitReviewDate": "2015-11-12 00:00:00",
              "ContractorSafetyReviewDate": "2015-11-12 00:00:00",
              "ContractorSafetyEvalDate": "2015-11-12 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000061624,
                  "PreventionProgram3ID": 1000050559,
                  "ProcessChemicalID": 1000074401
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000048514,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2015-11-01 00:00:00",
    "ERTrainingDate": "2014-11-28 00:00:00",
    "CoordinatingAgencyName": "Williamsport Fire Department",
    "CoordinatingAgencyPhone": "3012239112",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048514,
      "SummaryText": "and report to the Incident Coordinator at the Incident Command Post and provide an assessment of the situation at hand. Other department supervisors and/or managers shall report to the Assembly Area and get a headcount for their department and report it to the Building Captain.\r\n\r\nIf present, the Maintenance Manager, the Production Manager, the Plant Manager, the Emergency Response Coordinator, and the Public Information Officer shall report to the Incident Coordinator at the Incident Command Post. The Incident Commander shall immediately contact the Williamsport Fire Department and the Emergency Response Coordinator if not available.\r\n\r\nUpon the direction of the fire department, the Incident Commander shall contact all the business operations within the worst case scenario radius and inform them of the potential release.\r\nResponding to an Accidental Release\r\n\r\nWith the exception of incipient stage fires that DO NOT involved an actual release, employees shall be evacuated from the plant and will not respond to the accidental releases in the tank/pipeline area.\r\nMost LP gas fires originate as smaller fires that become increasingly more dangerous. Furthermore, LP gas fires can escalate quickly, and a lack of fire suppression can lead to vessel failure. \r\nTo avoid this, employees may use a single portable fire extinguisher to attempt to extinguish an incipient state fire in the tank/pipeline area that does not involve an actual gas release. If a single fire extinguisher is not readily available or insufficient to extinguish the fire, employees shall abandon efforts, contact their manager/supervisor and evacuate the tank/pipeline area.\r\n\r\nEmployees should take care while evacuating tank/pipeline area not to do the following:\r\n\r\nDO NOT cause any open flame or other potential source of ignition such as vehicle ignition, lighters/matches, road flares, etc. to enter the tank/pipeline area \r\nDO NOT start motor vehicles or electrical equipment in the tank pipeline area\r\nDO NO"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048514,
      "SummaryText": "Purpose: \r\n\r\nThe purpose of this Standard Operation Procedure (SOP) is to document the Risk Management Program at the Rust-Oleum Manufacturing Plant in Williamsport Maryland in accordance with 40 CFR 68 Subpart D for the covered process at the Plant (Aerosol Filling).\r\nThis submission is being submitted as the five-year re-submission of Rust-Oleum RMP. Other than changing the emergency contact's contact information and updating the Prevention Program, no other changes to the RMP are being submitted.\r\n\r\nAreas of Responsibility:  \r\n\r\nEnvironmental Health and Safety (EHS) Manager\r\n\r\nThe EHS Manager shall be responsible for the development, implementation, and integration of the risk management program elements.\r\nThe EHS Manager shall be responsible for developing, tracking, and administering the operator training program related to this risk management program. This includes tracking competency, setting up and tracking operator refresher training, and setting up training for maintenance work with contractors.\r\nThe EHS Manager shall be responsible developing and exercising the emergency response plan found in this risk management program. This includes training responders, ensuring testing and maintenance of emergency response equipment, coordinating with public responders and selecting participants in accident investigations.\r\n\r\nMaintenance Manager\r\n\r\nThe Maintenance Manager shall be responsible for implementing the maintenance schedules found in the Mechanical Integrity Section of this risk management program's Process Hazard Analysis. This includes overseeing and documenting maintenance work conducting and revising schedules as needed\r\n\r\nProcedure: \r\n\r\nExecutive Summary\r\n\r\nThis Risk Management Program (RMP) has been implemented at Rust-Oleum's Hagerstown facility for the prevention of a release of the LP gas. \r\n&#8195;\r\nThe Rust-Oleum Corporation Hagerstown facility produces a variety of solvent and water-based paints and coatings for both brush and aerosol applicati"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000048514,
      "SummaryText": "alysis\r\nFive Year Accident History\r\nPrevention Plan Program Data\r\nCertification\r\n\r\nThe EHS Manager shall revise and submit appropriate as updates as follows\r\n\r\nAt least every five (5) years or after the most recent update\r\nWithin six (6) months of a change that requires a revision to the PHA or a hazard review\r\nWithin six (6) months of a reportable accident\r\nWithin one (1) month of a change in the facilities listed emergency contact"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048514,
      "SummaryText": "hone number is 847.367.7700.\r\n\r\nThe name and Chemical Abstract Service Number (CAS) of the LP gas is Flammable Mixture, 00-11-11. The components of the Flammable Mixture are LP gas (74-98-6) and Butane (106-97-8). The maximum quantity on hand of the mixture is approximately 133,580 pounds. The propellant is not inherently toxic.\r\n\r\nThe National Industrial Classification Code for the plant is 32551 (Paint and Coating Manufacturing)\r\n\r\nThe Environmental Protection Agency Facility Identification Number is 100000119604.\r\n\r\nThere are approximately 130 - 150 employees at the plant.\r\n\r\nThe Flammable Mixture is subject to 29 CFR 1910.119. The Flammable Mixture is not subject to 40 CFR 355. The last government inspection of the tank was by the Fire Marshal.\r\n\r\nThe emergency contact for this RMP is Kevin M Marrow, EHS Manager, Rust-Oleum Hagerstown Manufacturing Plant, 16410 Industrial Lane, Williamsport, Maryland 21795. (O) 301.223.8500. Email - kevin.marrow@rustoleum.com.\r\n\r\nThis RMP was prepared by the EHS Manager of Rust-Oleum with the assistance of Environmental Resources Management, 1701 Golf Road, Suite 1-700, Rolling Meadows, IL 60008-4242, and Phone: +1 (847) 258-8900.\r\n\r\nFive Year Accident History\r\n\r\nIn the past five years there have been no incidents that have resulted in death, injury, significant property damage on-site OR known off-site deaths, evacuations, injury, shelter in place, property or environmental damage.\r\n\r\nEmergency Response Information\r\n\r\nEmergency Notification Procedures for Tank/Pipeline Releases\r\n\r\nEmployees shall immediately report any of the following observations at the tank/pipeline area to their manager or supervisor: vapor fogs or blowing dirt around the tank/pipeline area; oily sheen on water surfaces; sound in the range from a quiet hissing to a loud roar; frozen ground in warm weather.\r\n\r\nThe manager/supervisor shall immediately initiate an evacuation of the plant using the fire alarm. The manager/supervisor shall evacuate the building"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048514,
      "SummaryText": "ons. The 13.14 acre site is improved by a 130,000 SF manufacturing plant with an associated parking lot. The manufacturing plant currently houses both the administrative offices and the plant manufacturing operations. \r\n\r\nA 30,000 gallon liquefied petroleum LP gas tank is located off the southwest corner of the manufacturing plant. LP gas (propane/butane mixture) is used at the facility as a propellant for aerosol paints. LP gas is a regulated flammable RMP substance with a threshold quantity for accidental release prevention of 10,000 pounds. The amount of LP gas present in the system is approximately 133,580 pounds.\r\n\r\nThe LP gas handled at the plant is operated and maintained in accordance with NFPA 58: Standard for Storage and Handling of Liquefied Petroleum Gases, as well as equipment manufacturer operation and maintenance requirements and recommendations and with appropriate and applicable industry standards and practices. \r\n\r\nRust-Oleum's policy to adhere to all applicable federal, state and local regulations is demonstrated through its comprehensive prevention program for all critical process systems addressing design, installation, operating and maintenance procedures and schedules, and employee and contractor training and certification. \r\n\r\nIn the event that an emergency incident were to occur at the Hagerstown Plant, response protocols have been developed and coordinated with offsite responders, including the Williamsport Fire Department and the Williamsport Police Department.\r\n\r\nRegistration\r\n\r\nThe plant is located at 16410 Industrial Lane, Williamsport, Washington County, Maryland 21795. The plant longitude is 39.598333 and latitude is -077.801667 as determined by interpolation - photo. The longitude and latitude is located at the center of the plant. \r\n\r\nThe Dun and Bradstreet number for Rust-Oleum Corporation is 114155651.\r\n\r\nThe owner/operator of the plant is Rust-Oleum Corporation located at 11 Hawthrone Parkway, Vernon Hills, Illinois, 60061. The p"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000048514,
      "SummaryText": "T evacuate through a vapor cloud\r\nDO NOT attempt to operate any pipeline valves\r\n\r\nOnce employees assemble at the Assembly Area, the Building Captain at the instruction of the Incident Commander shall instruct employees to quickly move and assemble at the end of Industrial Lane. Provided the command post remains upwind and uphill of the release the Incident Commander and his/her staff can remain in place.\r\n\r\nIf there has been flame impingement on the tank, vessel failure could be imminent. If these conditions have been present for 10 minutes or more from the initial impingement, an immediate evacuation of the Incident Commander and his/her staff is required even if the fire department has not arrived. The Incident Commander shall notify the fire department that he/she has moved away from the Plant.\r\n\r\nIf the fire department alone cannot control the incident. Expert advice, cooperation, and remedial actions by plant personnel shall be provided by Rust-Oleum employees. The fire department shall remain in control of the scene until the emergency has been mitigated.\r\n\r\nReviewing and Updating Emergency Response Information\r\n\r\nThe EHS Manager shall review this emergency response information annually to ensure continued effectiveness. Evacuation drills shall be conducted on a regular basis.\r\n\r\nAnnually, the Plant Management shall meet with State or local agencies with designated response roles at the Plant to familiarize them with the aerosol filling operation; places where facility personnel would normally be working; entrances, and possible evacuation routes and this emergency response information.\r\n\r\nThe emergency response information in this plan shall be updated as given below.\r\n\r\nRisk Management Plan Submittal and Registration\r\n\r\nThe initial risk management plan (RMP) and registration for the covered process was submitted. The RMP is a summary of all the important data elements above including the following:\r\n\r\nExecutive summary\r\nRegistration\r\nOff-site consequence an"
    }
  ]
}