{
  "FacilityID": 1000009512,
  "FacilityName": "Riverside Energy Center",
  "FacilityStr1": "1401 W. B-R Townline Road",
  "FacilityStr2": null,
  "FacilityCity": "Beloit",
  "FacilityState": "WI",
  "FacilityZipCode": "53511",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "55105",
  "LEPC": "Rock County LEPC",
  "FacilityLatDecDegs": "42.582962",
  "FacilityLongDecDegs": "-089.036674",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PC",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Riverside Energy Center, LLC",
  "Company2Name": null,
  "CompanyDUNS": 112710876,
  "Company2DUNS": 112710876,
  "OperatorName": "Energy Riverside Center, LLC",
  "OperatorStr1": "717 Texas Avenue, SUite 1000",
  "OperatorStr2": null,
  "OperatorCity": "Houston",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "77002",
  "OperatorZipCodeExt": null,
  "RMPContact": "Glenn Calloway",
  "RMPTitle": "General Manager",
  "FTE": 20,
  "OtherEPAFacilityID": "WIR000110254",
  "EPAFacilityID": "100000186078",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "01RV077-R3 WI",
  "SafetyInspectionDate": "2009-06-16 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-06-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-07-02 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-07-02 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-07-02 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000011193,
      "AltID": "SCR System",
      "FacilityID": 1000009512,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000011572,
          "ProcessID": 1000011193,
          "NAICSCode": "22111",
          "_desc": {
            "NAICS_CODE": "22111",
            "NAICS_DESCRIPTION": "Electric Power Generation"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000012782,
          "ProcessID": 1000011193,
          "ChemicalID": 57,
          "Quantity": 185040.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 57,
            "ChemicalName": "Ammonia (conc 20% or greater)",
            "CASNumber": "7664-41-7",
            "Threshold": 20000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000512782,
          "ProcessID": 1000011193,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000009512,
      "SummaryText": "Introduction\nRiverside Energy Center, LLC (Riverside Energy), a subsidiary of Calpine Corporation, owns the Riverside Energy Center (REC), a combined-cycle electric power generating facility located just north of the city of Beloit, in Rock County, Wisconsin.  The Riverside facility includes two Selective Catalytic Reduction (SCR) systems that use ammonia for the reduction of nitrogen oxide (NOx) emissions.  The ammonia is stored in aqueous form in two 12,000-gallon storage tanks located at the Riverside facility.  At full capacity, the tanks can store up to 185,040 pounds of aqueous ammonia.  Since the Riverside facility will be storing more than 20,000 pounds of aqueous ammonia in a process, it is subject to United States Environmental Protection Agency (USEPA) Risk Management Program (RMP) regulations codified in 40CFR Part 68.\n\nAmmonia is an easily liquefiable colorless gas with a sharp, intensely irritating odor.  The aqueous form is a solution of ammonia and water.  It is listed by the USEPA as a regulated toxic substance for release prevention.\n\nRelease Prevention and Emergency Response Policy\nPursuant to the Risk Management Plan (RMP) regulations (40 CFR Part 68) Riverside Energy developed this comprehensive written program to protect employees and the surrounding community from exposure to ammonia.  As part of the re-submittal process, Riverside Energy conducts a comprehensive review every five years and revises the RMP accordingly.\n\nRiverside Energy is committed to the safe operation of the SCR ammonia system at the Riverside facility.  A release prevention program has been developed and implemented by Riverside Energy that is a combination of several programs at the facility.  The release prevention program includes employee education in the hazards of aqueous ammonia and measures that can be used to reduce employee and community exposure to accidental releases of ammonia.  The program includes preventive maintenance programs (mechanical integrity) for th"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000009512,
      "SummaryText": "e ammonia system that incorporates inspections of the system in accordance with recognized standards of equipment inspection within the ammonia industry, as well as tests of system components in accordance with component manufacturersA!A| recommendations.\n\nThe release prevention program includes programs for pre-startup safety reviews and management of changes (MOC) to the ammonia system.  The program also includes specific requirements for safe work practices (such as safe approaches to welding and similar hot work) and safety requirements for contractors who may be hired to work on the systems.  \n\nSpecial emphasis is placed on handling accidental releases of ammonia and coordination of emergency response with local fire departments and other emergency response organizations in the release prevention program.\n\nAs part of the release prevention program requirements, Riverside Energy undertook a review of the potential offsite consequences of the accidental releases from two 12,000-gallon aqueous ammonia storage tanks.  Although such a release is highly unlikely, the regulation requires this review.\n\nWorst-Case Release Scenario\nAs required by USEPA regulations, the worst-case release scenario was assumed to be the complete loss of the contents of two 12,000-gallon storage tanks containing 185,040 pounds of aqueous ammonia.  This analysis included a common containment dike for both tanks as a passive mitigation measure.  The USEPA guidance for defining a worst-case release scenario for a release of gas is to estimate the release rate over a 10-minute period of the largest quantity resulting from a pipe or vessel failure.  Thus, the ammonia emission rate from the worst-case release scenario used was the loss of 185,040 pounds of aqueous ammonia averaged over a 10-minute period, (i.e., approximately 62.9 lbs./min. of ammonia released to the air.)\n\nUSEPAA!A|s public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 mg/lit (or 200 ppm)"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000009512,
      "SummaryText": ".  The model predicted a distance of 0.4 miles as the distance to the toxic endpoint due to the specified worst-case release.  Based on LandView 6 output, the total population within the potential exposure area is 45 with the following public receptors being potentially impacted A!V residences and industrial areas.\n\nRiverside Energy personnel follow the release prevention program which includes one round inspection per shift for a total of two inspections daily, annual calibration of the ammonia sensors, annual personnel training, and implementation of a preventive maintenance schedule based on the manufacturerA!A|s recommendations.  In addition, the ammonia tank is a permitted unfired pressure vessel and requires a visual inspection every three years in order to maintain certification from the Department of Commerce.  These measures greatly minimize the chance that the tanks will fully discharge their contents in a release and minimizes the potential for an offsite impact.\n\nAlternative Release Scenario\nFor the Riverside facility, the alternative release scenario was assumed to be the structural failure of a 2-inch pipe filled with aqueous ammonia under pressure at 56-psig pressure beyond the confines of the concrete dike.  It is assumed that active mitigation (use of emergency shutdown systems) starts within a reasonable time after the accidental release begins.  The pump can be remotely shut down from the control room when loss of pressure is detected.  For this analysis, the total release duration is assumed to be the time period from the beginning of the release event until the release is totally contained.  The total release duration was assumed to be 10 minutes.  In this analysis, no passive mitigation measures were assumed.  Thus, the ammonia emission rate from the alternative release scenario is given as the loss of 457 pounds of aqueous ammonia averaged over a 10-minute period.  This was based on a pumping rate of 2.5 gallons per minute and a density of amm"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000009512,
      "SummaryText": "onia of 7.44 pounds per gallon.  This scenario resulted in a release rate of ammonia to outside air of approximately 2.87 lbs/min.\n\nUSEPAA!A|s public-domain RMP*Comp model was used to determine the distance to the toxic endpoint of 0.14 mg/lit (or 200 ppm).  The model predicted a distance of 0.1 mile as the distance to the toxic endpoint due to the specified alternative release.  Based on LandView 6 output, the total population within the potential exposure area is 0.  There are no public receptors that will be potentially impacted. \n\nAs stated earlier, Riverside Energy personnel follow the Release Prevention Program in order to minimize the potential for system leaks.  The A!A?daily roundA!A? inspection conducted during each shift, in combination with the continuous monitoring of tank pressure from the control room, can quickly detect any leaks that are present.  In addition, the ammonia pumps are shutdown when the generating units are not operating. These simple prevention techniques significantly reduce the potential for an offsite impact.\n\nRelease Prevention Program\nAs indicated earlier, Riverside Energy pro-actively implements the release prevention program for the SCR ammonia system.  The scope of the release prevention program encompasses various facets of release prevention; e.g., it engenders employee participation, increases employee awareness about the hazards of handling ammonia, establishes safe standard operating procedures, and enhances access to process safety information through annual training being provided by the vendor and hands-on training.   During the design process, Riverside Energy performed a hazards analysis on the SCR ammonia system.  Subsequent hazard reviews were performed after three years and again after 5 years to review the existing operating procedures and equipment maintenance schedule.  These operational safeguard measures indicate a high success rate as demonstrated through no reported leaks or releases.  \n\nThe release preventi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000009512,
      "SummaryText": "on program provides the procedural backbone for safe operability functions and allows Riverside Energy to maintain, review and evaluate the program on a periodic basis.  Basic elements include the following but are not limited to:\n\nA?A<    Annual personnel training;\nA?A<    Hands-on training to new employees;\nA?A<    Ammonia release sensors located in the tanks area, which gives an alarm in the control room when triggered;\nA?A<    A!A?Daily roundA!A? inspections by shift workers twice daily;\nA?A<    Annual calibration of the ammonia sensors;\nA?A<    Ammonia pumps are shutdown when the combustion turbines are not generating;\nA?A<    Facility personnel are required to follow a chemical off-loading procedure and checklist;\nA?A<    Continuous review of safe operating procedures;\nA?A<    Evaluation of the mechanical integrity of the equipment which includes visual inspection of the ammonia tank every 3 years;\nA?A<    Implementation of a preventive maintenance schedule per vendorA!A|s recommendations; and\nA?A<    Effective emergency response program.  \n\nEmergency Response Program\nThe release prevention program incorporates the Riverside facilityA!A|s comprehensive emergency response plan.  The emergency response program places special emphasis on handling accidental releases of aqueous ammonia and coordination of emergency response with local fire departments and other emergency response organizations such as the Rock County LEPC.  The response plan details the emergency response structure and includes personnel responsibilities and procedures within that structure.  In addition, the plan includes procedures for notification of local agencies in the event of an incident, facility evacuation, and decontamination.  Finally, the plan discusses emergency preparedness and planning, including plans for conducting emergency response team training and drills.\n\nCalpineA!A|s management is committed to supporting the emergency response (ER) organization and its prescribed functions.  ER team members are drawn from "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000009512,
      "SummaryText": "the existing employee pool and the organizational concept fosters pride and emphasizes concerns for safe operation of the Riverside facility.  The well-defined ER organization operates in conjunction with the local Fire Department and the Rock County LEPC to alleviate safety concerns about handling aqueous ammonia. \nAuditing Program\nRiverside Energy has developed an auditing program for the Riverside facilityA!A|s ammonia system.  This audit program includes elements from the Program 3 requirements and has been established to provide a mechanism for periodic reviews of the various aspects of the RMP including:\n-    the physical ammonia system;\n-    hazard review;\n-    operation of the system;\n-    maintenance procedures;\n-    training procedures; and\n-    incident investigation procedures.\n\nAlthough not specifically required by the RMP regulations for Program 2 facilities, audits are conducted every three years.  A copy of the audit form used to conduct these audits is included in this document.\n\nIncident Investigation Program\nRiverside Energy has developed an incident investigation program for the Riverside facilityA!A|s ammonia system.  This program includes elements from the Program 3 requirements and has been established to provide a mechanism for determining root causes of accidental releases of ammonia and preventing such events in the future.   A copy of the form used to conduct incident investigation is included in this document.   "
    }
  ]
}