{
  "FacilityID": 1000011219,
  "FacilityName": "Greater Des Moines Energy Center",
  "FacilityStr1": "4401 Carlisle Road",
  "FacilityStr2": null,
  "FacilityCity": "Pleasant Hill",
  "FacilityState": "IA",
  "FacilityZipCode": "50327",
  "Facility4DigitZipExt": "1300",
  "FacilityCountyFIPS": "19153",
  "LEPC": "Polk County LEPC",
  "FacilityLatDecDegs": "41.556340",
  "FacilityLongDecDegs": "-093.525390",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "NE",
  "FacilityURL": "www.midamerican.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 884718768,
  "ParentCompanyName": "MidAmerican Energy Company",
  "Company2Name": "MidAmerican Holdings Company",
  "CompanyDUNS": 884718768,
  "Company2DUNS": 884718768,
  "OperatorName": "MidAmerican Energy Company",
  "OperatorStr1": "4401 Carlisle Road",
  "OperatorStr2": null,
  "OperatorCity": "Pleasant Hill",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50327",
  "OperatorZipCodeExt": "1300",
  "FTE": 22,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000189574",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2012-08-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-10-09 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-10-09 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-10-09 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.553362,
  "FRS_Long": -93.524995,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": "GPS CARRIER PHASE STATIC RELATIVE POSITION",
  "HorizontalAccMeasure": "50.9",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000013366,
      "AltID": "Aqueos Ammonia System",
      "FacilityID": 1000011219,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000015370,
          "ProcessID": 1000013366,
          "ChemicalID": 57,
          "Quantity": 187220.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000013729,
          "ProcessID": 1000013366,
          "NAICSCode": "221119",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000011219,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Polk County LEPC",
    "CoordinatingAgencyPhone": "5152834768",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000011219,
      "SummaryText": "Executive Summary\nExecutive Summary for MidAmerican Energy CompanyÂ¿s Greater Des Moines Energy Center Risk Management Plan \n\nAccidental Release Prevention and Emergency Response Policies (40 CFR 68.155(a))\n\nMidAmerican Energy Company's (MidAmerican) Greater Des Moines Energy Center is strongly committed to employee, public and environmental safety. The commitment is demonstrated by an accidental release program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with processes at the facility. It is our policy to implement appropriate controls to prevent potential releases of regulated substances.\n\nThe Facility and Regulated Processes (40 CFR 68.155(b))\n\nMidAmerican Energy Company's primary activity is the generation of electrical energy by combustion of natural gas in a combined-cycle, combustion turbine facility. \nPart of that activity involves the use of a system that provides aqueous ammonia for selective catalytic reduction in the heat recovery steam generators. The aqueous ammonia storage and forwarding system (the process) consists of a storage tank, two forwarding pumps, associated piping, valves, and instrumentation.  Vaporized ammonia is injected into the SCR section. The flue gas entrains the ammonia and as the mixture passes through the SCR, it undergoes a reaction that reduces nitrogen oxides to meet the standrds within the facility's air permit.\n\nThe maximum inventory of aqueous ammonia in the process is 25,000 gallons (187,220 pounds). Ammonia in the storage tank is concentrated at 29.4% in water. \n\nThis Risk Management Plan updates the original plan submitted October 15, 2004 for EPA Facility ID# 1000 0018 9574. \n\nWorst-Case and Alternative Release Scenarios (40 CFR 68.165(a)(1))\n\nTo perform the required off-site consequence analysis for the facility, MidAmerican used the EPA's Risk Management Program RMP*Comp, Version 1.07. The worst-case scenario involved the catastrophic release of a"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000011219,
      "SummaryText": "queous ammonia from the storage tank. In this scenario, all 25,000 gallons of aqueous ammonia is released into the diked enclosure around the storage tank, forming a pool from which evaporation takes place. At Class F atmospheric stability and 1.5 meters/second wind speed, the maximum distance of 0.10 mile is obtained to a toxic endpoint of 0.14 mg/L. \n\nThe alternative release scenario is one more likely to occur than the worst-case scenario, unless no release occurs. In this scenario, 25,000 gallons of aqueous ammonia is released from the storage tank into the diked enclosure.  No controls were assumed, even though row valves may be utilized in an emergency to mitigate releases. Also, less than 25,000 gallons of aqueous ammonia will be typically present. Under neutral weather conditions (stability Class D) and wind speed of 3 meters/second, the maximum distance to the toxic endpoint of 0.14 mg/L is<0.10 miles. \n\nWe determined that there are no public receptors within the worst-case or alternative release scenarios.  There have been no accidents at the Greater Des Moines Energy Center.  Therefore, this process qualifies for Program Level 1. The Greater Des Moines Energy Center's responsibility under Program Level 1 is as follows:\n\n* Submit a single RMP, as provided in Â§68.150 to 68.185. The RMP shall include a registration that reflects all covered processes.\n* Analyze the worst-case release scenario for the process, as provided in Â§68.25; document that the nearest public receptor is beyond the distance to a toxic or flammable endpoint defined in Â§68.22(a); and submit in the RMP the worst-case release scenario as provided in Â§68.165;\n* Complete the five-year accident history for the process as provided in Â§68.42 of this part and submit it in the RMP as provided in Â§68.168;\n* For Program 1 processes, the owner or operator shall submit in the RMP the certification statement provided in Â§68.12(b)(4); \n* Provide in the RMP an executive summary that includes a bri"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000011219,
      "SummaryText": "ef description of the following elements: \n       (a) The accidental release prevention and emergency response policies at the stationary source; \n       (b) The stationary source and regulated substances handled; \n       (c) The general accidental release prevention program and chemical-specific prevention steps; \n       (d) The five-year accident history; \n       (e) The emergency response program; and \n       (f) Planned changes to improve safety. \n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\nThe facility has taken all the necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 for Program Level 1 processes. The facility was designed and constructed in accordance with appropriate engineering and nationally recognized design standards. The following sections describe the elements of the release prevention program that is in place. \n\nEmergency Response Plan \n\nThe Greater Des Moines Energy Center employees will not respond to accidental releases of regulated substances; therefore, the requirements of Â§68.95 are not applicable to the Greater Des Moines Energy Center.  The Greater Des Moines Energy Center has coordinated with the Local Emergency Planning Committee to be included in their emergency response plan.  The Greater Des Moines Energy Center has also coordinated with the local fire department to be included in their fire mitigation plan.\n\nThe Polk County Emergency Services and Disaster Agency is the Local Emergency Planning Committee (LEPC) with which emergency response has been coordinated. \n\nThe telephone number of the LEPC Coordinator is (515) 283-4768.\n \nFive-Year Accident History \n\nThere have been no accidents at the Greater Des Moines Energy Center. \n\nThe Emergency Response Program\n\nAmmonia monitors have been installed around the aqueous ammonia storage tank at the Greater Des Moines Energy Center.  In the event of an ammonia release, plant operators will recei"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000011219,
      "SummaryText": "ve an alarm from the monitors.  The plant operators will then notify emergency response personnel to an ammonia release at the Greater Des Moines Energy Center.  \n\nPlanned Changes to Improve Safety\n\nNo changes to this plan are anticipated at this time."
    }
  ]
}