{
  "FacilityID": 1000081008,
  "FacilityName": "`Kenyon Zero Storage /The Freezer Group LLC",
  "FacilityStr1": "100 Benitz Road",
  "FacilityStr2": null,
  "FacilityCity": "Prosser",
  "FacilityState": "WA",
  "FacilityZipCode": "99350",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "53005",
  "LEPC": "Benton County LEPC",
  "FacilityLatDecDegs": "46.220139",
  "FacilityLongDecDegs": "-119.734806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G4",
  "LatLongDescription": "ST",
  "FacilityURL": "kenyonzero.com",
  "FacilityEmailAddress": "peggy@kenyonzero.com",
  "FacilityDUNS": 962674110,
  "ParentCompanyName": "Kenyon Zero Storage",
  "Company2Name": null,
  "CompanyDUNS": 3781192,
  "Company2DUNS": 0,
  "OperatorName": "Kenyon Zero Storage",
  "OperatorStr1": "250 Grandridge",
  "OperatorStr2": null,
  "OperatorCity": "Grandview",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98930",
  "OperatorZipCodeExt": null,
  "RMPContact": "Scott Wingert",
  "RMPTitle": "President/General Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000106173",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-04-18 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-07-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-07-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-07-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-07-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 46.22014,
  "FRS_Long": -119.73481,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "GPS CODE (PSEUDO RANGE) PRECISE POSITION",
  "HorizontalAccMeasure": "0.1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000101265,
      "AltID": "Rifrigeration   System",
      "FacilityID": 1000081008,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000102527,
          "ProcessID": 1000101265,
          "NAICSCode": "31141",
          "_desc": {
            "NAICS_CODE": "31141",
            "NAICS_DESCRIPTION": "Frozen Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000126921,
          "ProcessID": 1000101265,
          "ChemicalID": 56,
          "Quantity": 32207.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000626921,
          "ProcessID": 1000101265,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000081008,
      "SummaryText": "1.0 EXECUTIVE SUMMARY\n\n\n\n1.10 Accidental Release Prevention And Emergency Response Policies\n\n\n\nThe Kenyon Zero Storage refrigeration system uses pure anhydrous ammonia (a commonly used refrigerant for industrial systems) as the refrigerant.  Given the quantity handled, anhydrous ammonia is considered a hazardous substance by EPA.  Many of the properties that make ammonia valuable as a refrigerant also requires that precautions and procedures be in place to protect employee and public health and safety during a chemical emergency.  It is the policy of Kenyon Zero Storage to be in compliance with all applicable federal and state rules and regulations.    \n\n\n\nSafety at our facility is inherent in the manner in which anhydrous ammonia is handled.  While the design of the facility incorporates a multitude of safety devices, safe handling procedures combined with appropriate training of our personnel are key aspects to maintaining safety at our facility.\n\n\n\nWe have a written Process Safety Management (PSM) plan, crucial component of this plan is the Emergency Response Plan, developed in compliance with the Emergency Response provisions.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events. \n\n\n\n1.20 Facility Description And Substances Handled\n\n\n\nKenyon Zero Storage is a agricultural products storage facility that freezes and refrigerates products.  Production requires the use of a refrigeration system to preserve the integrity of the foods.  This refrigeration process uses ammonia as a refrigerant.  Access to the facility is restricted to authorized employees, management personnel, and contractors.\n\nThe regulated substance handled at this facility is anhydrous ammonia.\n\nThe ammonia refrigeration system maximum inventory is 32,207 pounds of anhydrous ammonia.  There is no standby make-up inventory kept on-site.\n\n\n\n"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000081008,
      "SummaryText": "1.30 The worst-case release scenario(s) and the alternative release scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario\n\n\n\nRelease scenarios were modeled using RMP*Comp, a software program developed by the National Oceanic and Atmospheric Administration (NOAA) and EPA.  Offsite receptors were defined using the LandView system.  This system estimates residential population within the circle defined by the endpoint of the worst-case and alternative release scenarios.  In addition, it lists whether certain types of public receptors and environmental receptors are within the circles.\n\n\n\n1.40 General Accidental Release Prevention Program And Chemical-Specific Prevention Steps\n\n\n\nKenyon Zero Storage complies with EPA Accidental Release Prevention Rule and with all applicable state codes and regulations.  The design and construction of this facility was in accordance with published standards, tests or recommended methods of trade, industry or governmental organizations.  \n\nKenyon Zero Storage written PSM plan incorporates many policies and procedures to ensure safe operation and maintenance of this facility.  Plan elements essential to safe operation of the refrigeration system include employee participation, process hazard information, process hazard analysis, operating procedures, training, contractor safety, pre-startup safety review, mechanical integrity, management of change, hot-work permits, incident investigation, emergency response and planning, and compliance audits.  This plan will be reviewed annually and updated as necessary by the Kenyon Zeros Storage Refrigeration Engineer. \n\n\n\nTraining is provided to ensure that each employee involved in operating a process has been trained in an overview of the process, the operating procedures, and safety considerations.  Only qualified maintenance personnel operate and interact with the refrigeration system.  This minimizes the chances of inadvertent er"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000081008,
      "SummaryText": "ror in operation that could lead to a release of ammonia.  Startup, shutdown, and any onstream adjustments are handled by these qualified persons.  \n\n\n\n1.50 Five-Year Accident History\n\n\n\nThere were no reportable accidents in the last 5 years.\n\n\n\n1.60 Emergency Response Program\n\n\n\nKenyon Zero Storage has a written Emergency Response Plan developed to ensure that precautions and procedures are in place to protect employee and public health and safety during a chemical emergency.  The Emergency Response Plan includes pre-emergency planning and coordinating with outside parties.  This enables those who deal with emergencies to have a course of action to effectively deal with unplanned events.  Kenyon Zero Storage has a letter of understanding with West Benton Fire and Rescue for primary response, and a letter of understanding with Sunnyside Fire Department for HAZMAT services.\n\n\n\nThe approach in the development of this plan has been to identify the ammonia emergencies most likely to occur at Kenyon Zero Storage and establish precautions and procedures to protect life safety and health during an emergency.  The refrigeration process has back-up prevention systems to keep processing malfunctions from becoming ammonia release emergencies.  If an emergency does occur, the following response personnel, facilities, and equipment are in place:\n\n\n\n \n\nIncident Command Center\n\nEmergency Alarm and Communication System\n\nEmergency Response Team\n\nEvacuation Plans and Assembly Points\n\nPersonal Protective Equipment\n\n\n\nThe role and procedures for obtaining external emergency assistance have been formally established with the Sunnyside Fire Department, including the Sunnyside HazMat Response Team stationed at the Sunnyside Fire Department.  \n\n\n\nAll Kenyon Zero Storage personnel will be trained to fulfill their designated responsibilities in an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify plan elements requiring imp"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000081008,
      "SummaryText": "rovement.   \n\n\n\nThis plan will be reviewed annually and updated as necessary by the Kenyon Zero Storage Refrigeration Engineer.\n\n\n\n1.70 Planned Changes To Improve Safety\n\n\n\nThis facility started production operations in August 1998.  Any upgrades or extensive maintenance work performed in the future will be in compliance with those standards applicable at that time.\n\n\n\nKenyon Zero Storage will continue to conduct emergency response training for affected personnel to ensure that all employees are able to perform their expected duties during an emergency.  Mock emergency drills will be held periodically to maintain familiarity with response actions and identify elements requiring improvement.\n\n\n\nKenyon Zero Storage completed a PSM/RMP compliance audit in September of 2016.  Audit recommendations are expected to be implemented by September of 2017.  Kenyon Zero Storage conducted a 5 year PHA re-validation in June of 2014.  Recommendations for the PHA re-validation will be addressed by June of 2015."
    }
  ]
}