{
  "FacilityID": 1000021736,
  "FacilityName": "City of McAllen North Wastewater Treatment Plant",
  "FacilityStr1": "2100 Sprague Road",
  "FacilityStr2": null,
  "FacilityCity": "McAllen",
  "FacilityState": "TX",
  "FacilityZipCode": "78501",
  "Facility4DigitZipExt": "0220",
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.305278",
  "FacilityLongDecDegs": "-098.218889",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.mcallen.net",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of McAllen",
  "OperatorStr1": "P O BOX 220",
  "OperatorStr2": null,
  "OperatorCity": "McAllen",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78501",
  "OperatorZipCodeExt": "0220",
  "FTE": 16,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000057993",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-04-08 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-04-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-14 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2011-04-14 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2012-10-05 00:00:00",
  "DeRegistrationEffectiveDate": "2012-01-06 00:00:00",
  "AnniversaryDate": "2016-04-14 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 26.305278,
  "FRS_Long": -98.218889,
  "FRS_Description": "PROCESS UNIT",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "2400",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000026405,
      "AltID": "Wastewater Treatment",
      "FacilityID": 1000021736,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000031384,
          "ProcessID": 1000026405,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000026758,
          "ProcessID": 1000026405,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000018215,
              "Process_NAICS_ID": 1000026758,
              "SafetyReviewDate": "1999-04-29 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "No",
              "FR_ASME": "No",
              "FR_None": "No",
              "FR_OtherType": "SARA Title III",
              "FR_Comments": null,
              "HazardReviewDate": "2011-04-12 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "No",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Refine SOP and leak detection system",
              "PC_Vents": "No",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "No",
              "PC_AutomaticShutoffs": "No",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "frequent inspection 24/7 per week by plant personnel - aggressive preventive maintenance program for chlorine equipment, also have installed chemical leak detectors.",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-04-12 00:00:00",
              "TrainingReviewDate": "2011-04-13 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "Mock drills (hands on)",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "No",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2011-04-06 00:00:00",
              "EquipmentInspectionDate": "2011-04-04 00:00:00",
              "EquipmentTested": "Chlorine vacuum injectos",
              "ComplianceAuditDate": "2011-04-14 00:00:00",
              "AuditCompletionDate": "2011-04-14 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000018481,
                  "PreventionProgram2ID": 1000018215,
                  "ProcessChemicalID": 1000031384
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000021736,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-07-15 00:00:00",
    "ERTrainingDate": "2011-04-13 00:00:00",
    "CoordinatingAgencyName": "McAllen Fire Department",
    "CoordinatingAgencyPhone": "9566812500",
    "FR_OSHA1910_38": "No",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": "40 CFR Part 68"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000021736,
      "SummaryText": "onse Program in which plant employees are divided into various management and response teams.  Back-up personnel have been designated in the event that employees designated are unavailable.\n \nThe Emergency Response Plan includes: (1) procedures to follow in the event of a chlorine or sulfur dioxide emergency, (2) information about the frequency of employee emergency response training, and (3) a detailed description of the emergency response training underway. \n\nThe McAllen Fire Department has been designated to provide emergency responders and equipment to CRRT, who has been contracted to provide HAZMAT response.  CRRC will assume Incident Command upon arriving at the plant. \n\nPLANNED CHANGES TO IMPROVE SAFETY\nBased on the hazard review and prevention evaluation completed for chlorine and sulfur dioxide, a list of action items was developed and is being considered by North WWTP management to determine if implementation is to be accomplished.  The most notable planned changes include the following:\n\n* Ensure that the delivery driver follows a set procedure in the delivery of chlorine or sulfur dioxide.  MW will coordinate with the staff to develop a procedure to govern the activities of the driver or vendor while on plant grounds.  It is anticipated that the vendor can then be subjected to this procedure at the time of the plant?s next bid for chemical purchase.  However, the existing vendor will likely accept these requirements voluntarily to ensure customer satisfaction; \n\n* Provide backup power for the plant systems in case of a power outage; and\n\n* In the future when the plant facilities are expanded or upgraded, consideration will be given to design and construction of containment buildings to encompass the chlorine cylinders and the sulfur dioxide containers designed in conjunction with the capability to chemically neutralize any accidental releases.  This option might be compared with the conversion to a nongaseous chlorine or sulfur dioxide compound. \nEXECUTI"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000021736,
      "SummaryText": "VE SUMMARY\n\nMONTGOMERY WATSON\nCITY OF MCALLEN ACCIDENTAL RELEASE PREVENTION PROGRAM\nNORTH WASTEWATER TREATMENT PLANT\tES-5\n\nEXECUTIVE SUMMARY\n\nMONTGOMERY WATSON\nCITY OF MCALLEN ACCIDENTAL RELEASE PREVENTION PROGRAM\nNORTH WASTEWATER TREATMENT PLANT\tES-1"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000021736,
      "SummaryText": "INTRODUCTION\nThe United Sates Environmental Protection Agency (USEPA) finalized the Accidental Release Prevention Program (ARPP) under Section 112(r) of the 1990 Clean Air Act Amendments and subsequently finalized the Accidental Release Prevention Risk Management rule (40 CFR Part 68).  This rule established the criteria of the Risk Management Plans (RMPs) required under the ARPP.  40 CFR Part 68 is similar to the Occupational Safety and Health Administration?s Process Safety Management Program, which is designed to protect workers from accidental releases of hazardous substances.  \nThe Risk Management Program rule addresses over 100 chemical substances, 77 of which are acutely toxic and 63 of which are flammable gases, and the accidental release of these substances. The United States Environmental Protection Agency (USEPA) estimates that over 100,000 sources are covered by the rule, including chemical manufacturers and wholesalers, certain retailers, potable water treatment systems, wastewater treatment plants, ammonia refrigeration systems, and federal facilities.\nThe North Wastewater Treatment Plant (WWTP) falls under this regulation because of the onsite storage of chlorine and sulfur dioxide.  The amount stored for both chemicals exceed the threshold limits specified by the USEPA, thereby making the facility subject to compliance with the regulation.  The North WWTP personnel have complied with the USEPA Risk Management Program rule and have completed an Accidental Release Prevention Program (ARPP) Plan that contains the following required information:\n* A management system (40 CFR Part 68 Subpart A);\n* A hazard assessment that establishes the worst case and alternative release scenarios and their impact on the population and the environment (40 CFR Part 68 Subpart B);\n* A prevention program that includes safety information, a hazard review, operating procedures, training, maintenance, compliance audits, and incident investigations. (40?CFR Part 68 Subpart C);"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000021736,
      "SummaryText": "chover module with gas piping and miscellaneous valves, four flow proportionate feed chlorinators, and gas piping and ejectors.  A release of chlorine gas could potentially occur at the chlorine storage area or at the chlorine process area. \nChlorine is delivered to the North WWTP by truck and chlorine containers are stored in the outside storage area located to the north of the Chemical Building. Chlorine is removed as a pressurized gas, however; the majority of the chlorine feed is operated through an induced vacuum, which makes the system extremely safe and minimizes potential pressurized leaks along the feed lines.  \nThe existing sulfur dioxide feed facility at the North WWTP consists of 1 one-ton sulfur dioxide containers on-line, two vacuum regulators mounted to an automatic switchover module with gas piping and miscellaneous valves, two flow proportionate feed sulfunators, and gas piping and ejectors.  A release of sulfur dioxide could potentially occur at the sulfur dioxide storage area or the sulfur dioxide process area. \nSulfur dioxide is delivered to the North WWTP by truck, and stored in the outside storage area located to the northeast corner of the plant site. Sulfur dioxide is removed as a pressurized gas, however; the majority of the sulfur dioxide feed is operated through a water induced vacuum, which makes the system extremely safe and minimizes the potential for pressurized leaks along the feed lines.  \nWORST-CASE AND ALTERNATIVE RELEASE SCENARIOS\nThe storage and process areas for both sulfur dioxide and chlorine have associated hazards that can potentially affect onsite employees and the off site population and environment.  The USEPA requires that a single worst case scenario for the facility and one alternative release scenario for each regulated chemical be reported. \n\nWorst-Case Scenario\nThe worst-case release scenario is the one that creates the greatest dispersion of a regulated substance in any direction to an offsite endpoint.  For the No"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000021736,
      "SummaryText": "rth WWTP, chlorine poses the greatest risk.  The largest potential release of chlorine would occur through a valve failure on one of the one ton cylinders located at the plant.  This valve failure could potentially release all 2,000 pounds of the chlorine as a gas.  Under Section 68.25(c)(1), the release time for a chemical such as chlorine under worst-case conditions is 10 minutes.  Passive mitigation controls were not applicable to the worst-case release at this plant.\n\nThe USEPA-approved modeling program DEGADIS+ was used to characterize the effects of the worst case scenario at the North WWTP facility.  The distance to the toxic endpoint of 3?ppm was determined to be 1.66 miles. Commercial, industrial, and residential areas would be affected in the worst-case release scenario. The estimated affected residential population is 10300 people.\n\nThe worst-case release scenario is the one that creates the greatest dispersion of a regulated substance in any direction to an offsite endpoint.  The largest potential release of sulfur dioxide would occur through a valve failure on a one-ton container located at the plant.  This valve failure could potentially release all 2,000 pounds of the sulfur dioxide as a gas.  Under Section 68.25(c)(1), the release time for a chemical such as sulfur dioxide is 10 minutes.  Passive mitigation controls were not applicable to the worst-case release scenario at this plant.\n\nThe EPA-approved modeling program DEGADIS+ was used to characterize the effects of the worst-case sulfur dioxide release scenario at the North WWTP.  The distance to the toxic endpoint of 3 ppm was determined to be 1.61 miles.  The affected residential population is estimated to be 7,700 people.  Commercial, industrial and residential areas would be affected in the worst-case release scenario.\n\nAlternative Release Scenarios\nOne alternative scenario for chlorine was modeled for the North WWTP. The release was established as a leak that would potentially develop in the p"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000021736,
      "SummaryText": "and\n* An emergency response plan (40 CFR Part 68 Subpart E).\nThe following subsections discuss details of the plan that have been implemented at the North WWTP.\nRELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\nThe North WWTP facility has an excellent record in preventing and minimizing release of chlorine and sulfur dioxide.  The emergency response policies at this facility ensure that emergency response coverage is available 24 hours per day, 7 days per week.  Adequate provisions have been implemented to coordinate response activities with outside agencies, such as the McAllen Fire Department in the event of an emergency.  In the event of a release, plant staff will contact the McAllen Fire Department, who will in turn contact CRRT.  CRRT will provide the City of McAllen with HAZMAT response.  The plant staff has received training to enable an onsite staff response prior to the arrival of the City of McAllen HAZMAT RESPONDERS.\n\nREGULATED SUBSTANCE\nThe North WWTP uses chlorine as a disinfectant in the wastewater treatment process.  The North WWTP regularly has a maximum storage quantity of 12 one-ton containers of chlorine at its facility that is stored outside.  This is above the threshold limit of 2,500?pounds set by the USEPA.  In addition to the chlorine, the North WWTP uses sulfur dioxide to dechlorinate treated wastewater before discharge.  The North WWTP regularly has a maximum storage quantity of 4 one-ton containers of sulfur dioxide at its facility that is stored outside.  This is above the threshold limit of 5,000?pounds set by the USEPA. \n\nPROCESS DESCRIPTION\nThe North WWTP is located at 2100 W. Sprague Road, in McAllen Texas.  The wastewater is treated at the plant and after being disinfected using chlorine and dechlorinated using sulfur dioxide, is subsequently discharged back into the receiving stream.  \nThe existing chlorine feed facility at the North WWTP consists of 6 one-ton chlorine containers, two vacuum regulators mounted to an automatic swit"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000021736,
      "SummaryText": "acking at the chlorine container valve.  A release of chlorine through the 0.2-inch diameter hole in the valve packing is presumed to occur for approximately 10 minutes, before being observed or detected, and repaired.  The release rate of chlorine caused by leakage through this opening is calculated to be 73.7 pounds per minute.  DEGADIS+ was also used to characterize the effects of the alternative case scenario at the North WWTP.  The distance to the USEPA defined toxic endpoint of 3 ppm was determined to be 1.33 miles.  The estimated affected residential population is 6,600 people.  \n\nOne alternative scenario for sulfur dioxide was modeled for the North WWTP. The release was established as a leak that would potentially develop in the packing at the sulfur dioxide container valve.  A release of sulfur dioxide through the 0.2-inch diameter hole in the valve packing is presumed to occur for approximately 10 minutes, before being observed or detected, and repaired.  The release rate of sulfur dioxide caused by leakage through this opening is calculated to be 73.3 pounds per minute.  DEGADIS+ was also used to characterize the effects of the alternative case scenario at the North WWTP.  The distance to the USEPA defined toxic endpoint of 3 ppm was determined to be 1.39 miles.  The estimated affected residential population is 7700 people.  \n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\nThe North WWTP carries out consistent operation and maintenance of its chlorine and sulfur dioxide equipment utilizing only fully trained personnel in this area.  North WWTP management ensures consistent operation through disciplinary actions for operational deviations.\n\nFIVE-YEAR ACCIDENT HISTORY\nThe accident history for the North WWTP was reviewed for the period from April 2006 through April 2011.  During this period of time, no accidental releases of chlorine or sulfur dioxide had occurred.\n\nEMERGENCY RESPONSE PROGRAM\nAs mentioned earlier, this facility has developed an Emergency Resp"
    }
  ]
}