{
  "FacilityID": 1000014263,
  "FacilityName": "City of Edinburg Wastewater Treatment Plant",
  "FacilityStr1": "1202 North M Road",
  "FacilityStr2": null,
  "FacilityCity": "Edinburg",
  "FacilityState": "TX",
  "FacilityZipCode": "78541",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48215",
  "LEPC": "Hidalgo County LEPC",
  "FacilityLatDecDegs": "26.308611",
  "FacilityLongDecDegs": "-098.136389",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I3",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 155704653,
  "ParentCompanyName": "City of Edinburg",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "City of Edinburg",
  "OperatorStr1": "P.O. Box 1079",
  "OperatorStr2": null,
  "OperatorCity": "Edinburg",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "78540",
  "OperatorZipCodeExt": null,
  "FTE": 15,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000162003",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2008-01-09 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2011-03-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-05-25 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2010-05-25 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2013-08-07 00:00:00",
  "DeRegistrationEffectiveDate": "2013-07-19 00:00:00",
  "AnniversaryDate": "2015-05-25 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 26.293306,
  "FRS_Long": -98.13775,
  "FRS_Description": null,
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000017834,
      "AltID": "4",
      "FacilityID": 1000014263,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021158,
          "ProcessID": 1000017834,
          "ChemicalID": 62,
          "Quantity": 4000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000018175,
          "ProcessID": 1000017834,
          "NAICSCode": "22132",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000012389,
              "Process_NAICS_ID": 1000018175,
              "SafetyReviewDate": "2008-02-19 00:00:00",
              "FR_NFPA58": "No",
              "FR_OSHA": "No",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": null,
              "FR_Comments": null,
              "HazardReviewDate": "2008-01-24 00:00:00",
              "ChangeCompletionDate": null,
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "No",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "No",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "No",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "Yes",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "Yes",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-02-19 00:00:00",
              "TrainingReviewDate": "2010-04-28 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-02-19 00:00:00",
              "EquipmentInspectionDate": "2010-04-21 00:00:00",
              "EquipmentTested": "Chlorine Dispensing Equipment",
              "ComplianceAuditDate": "2010-03-31 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": null,
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000012675,
                  "PreventionProgram2ID": 1000012389,
                  "ProcessChemicalID": 1000021158
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000014263,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2005-02-02 00:00:00",
    "ERTrainingDate": "2010-04-28 00:00:00",
    "CoordinatingAgencyName": "City of Edinburg Fire Department",
    "CoordinatingAgencyPhone": "9563832323",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014263,
      "SummaryText": "Executive Summary\n\nThis four-section report presents the revised Risk Management Plan (RMP) prepared by Chemical Response & Remediation Contractors, Inc. in February, 2008, on behalf of the City of Edinburg Wastewater Treatment Plant, located at 1202 North M Road, Edinburg, Hidalgo County, Texas. The responsible officials at the Edinburg Wastewater Plant are Jose A. Villescas, Director of Utilities, and Augustin Gomez, Wastewater Superintendent. The plant serves a population of approximately 66,600. That figure is the 2006 estimated population of Edinburg according to the U.S. Census Bureau (http://factfinder.census.gov).\n\nThe City of Edinburg Wastewater Treatment Plant Risk Management Plan report address each regulation required under 40 CFR 68.22, Subpart B: Hazard Assessment. Adherence to the guidelines within this report ensures compliance with federal regulations and results in a safe environment within and about the facility, and serves to educate facility personnel potential hazards associated with the facility and the chemicals it uses in its wastewater treatment process. This report will remain accessible to facility personnel and will be updated whenever a change in the facility process or facility management occurs.  \n\nThe City of Edinburg Wastewater Plant handles chlorine in amounts exceeding the regulatory threshold set by the EPA for regulated substances. The facility is subject to Program 2 of the Clean Air Act, since the toxic endpoint zone includes public receptors. The chlorination process is not subject to OSHA Process Safety Management (PSM) requirements. \n\nThis report presents a description of the input parameters used to perform the offsite consequence analysis. The input parameters include toxic endpoint, wind speed and atmospheric stability class, ambient temperature and humidity, height of release, surface roughness, and temperature of the released substance. RMP regulations for Program 2 processes require the performance of a consequence an"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014263,
      "SummaryText": "alysis for one worst-case release scenario, estimated to create the greatest distance in any direction, to a toxic endpoint. The worst-case release scenarios selected for this report involved the complete loss of the chlorine to the air. One considers 4,000 pounds of chlorine which represents the greatest amount held by two, one-ton, interconnected vessels. A second worst-case scenario was developed with one, one-ton vessel (2,000 pounds). This represents the greatest amount held in a single vessel. \n\nDispersion modeling for the worst-case scenarios were generated by the EPA program, RMP*Comp, Ver. 1.07. The modeling results for one worst-case scenario indicate that the maximum distance needed for the concentration of chlorine to reach the toxic endpoint (0.0087 mg/L) as a result of a 10-minute release of 4,000 pounds of chlorine is 1.9 miles. The modeling results for a second worst-case scenario indicate that the maximum distance needed for the concentration of chlorine to reach the toxic endpoint (0.0087 mg/L) as a result of a 10-minute release of 2,000 pounds of chlorine is 1.3 miles.\n\nClean Air Act regulations require that a scenario which is more likely to occur than the worst-case scenario be selected as the alternative release. The scenario selected involves the rupture of the connection between two, one-ton containers (4,000 pounds of chlorine). This could be the result of operator error or as a result of severe weather conditions such as a hurricane or a tornado. This rupture results in the release of the container=s entire contents over a period of 30 minutes. This is equivalent to a release rate of 1,180 pounds of chlorine per minute. The modeling results for the alternative release scenario indicate that the maximum distance needed for the concentration of chlorine to reach the toxic endpoint (0.0087 mg/L) as a result of a 30-minute release of 4,000 pounds of chlorine is 0.5 miles. \n\nThe Environmental Protection Agency Clean Air Act Risk Management Plann"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014263,
      "SummaryText": "ing requires the determination of the potentially affected residential population within a circle with its center at the point of the release and a radius determined by the distance to the endpoint estimated to two significant digits. LandView6 provided the population estimate for this report. The worst-case scenarios using EPA conditions show distances to the endpoints of 1.9 miles (4,000 pounds of chlorine) and 1.3 miles (2,000 pounds of chlorine) from the release source. LandView6 estimates show populations of 16,400 for a 1.9 mile radius and 8,800 for a 1.3 mile radius. The use of more realistic conditions for the alternative scenarioBspecifically a gas aerosol chlorine release and a 30 minute averageBleads to a toxic endpoint distance of 0.5 miles. The total potentially affected population within the circle is estimated at 400 persons. A search of U.S. Geological Survey maps did not identify any offsite impacts of environmental receptors within the endpoint.\n\nThe City of Edinburg accidental release prevention policy involves an approach that integrates technologies, procedures, and management practices in compliance with all applicable EPA Prevention Program requirements. The Â¿City of Edinburg Safety ProgramÂ¿ document is stored in the main office of the facility at the main gate at the southwest corner of the property. Chemical-specific prevention steps include employee awareness of the hazardous and toxic properties of chlorine and the availability of Self-Contained-Breathing-Apparatus (SCBA), worn by operators during connection and disconnection of chlorine.\nThe City of Edinburg has prepared written procedures that provide clear instructions or steps for safely conducting activities associated with the chlorination process.  They are consistent with the applicable safety information. This document is titled, Â¿The City of Edinburg General Operation and Maintenance Manual for Process Stations,Â¿ and it is located in the main office beside the laboratory.\n\nTh"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014263,
      "SummaryText": "e City of Edinburg emergency response policy involves the preparation of response plans tailored to each facility and to the emergency response services available in the community. Plans must be in compliance with the EPA Emergency Response Program requirements. The City of Edinburg is the first responder. Employees are trained in response techniques and notification of other first responders in the event of accidental chlorine releases.\n\nThe City of Edinburg has developed and implemented an emergency response program for the purpose of protecting public health and the environment.  The City of Edinburg=s Fire and Police Departments reviewed the facility=s emergency response program. Both departments are members of the Hidalgo County Local Emergency Planning Committee (LEPC). The program includes an emergency response decision tree and a notification plan. Emergency response drills, drill evaluations, and emergency operation and response procedures are reviewed annually."
    }
  ]
}