{
  "FacilityID": 1000012623,
  "FacilityName": "Delhaize America, DC #10",
  "FacilityStr1": "2085 Harrison Road",
  "FacilityStr2": null,
  "FacilityCity": "Salisbury",
  "FacilityState": "NC",
  "FacilityZipCode": "28145",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37159",
  "LEPC": "Rowan County LEPC",
  "FacilityLatDecDegs": "35.675680",
  "FacilityLongDecDegs": "-080.52949",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "CE",
  "FacilityURL": "www.foodlion.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3448560,
  "ParentCompanyName": "Delhaize America LLc",
  "Company2Name": null,
  "CompanyDUNS": 90322194,
  "Company2DUNS": 0,
  "OperatorName": "Delhaize America LLC",
  "OperatorStr1": "2085 Harrision Rd",
  "OperatorStr2": null,
  "OperatorCity": "Salisbury",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "28145",
  "OperatorZipCodeExt": null,
  "RMPContact": "Charles Rohda",
  "RMPTitle": "Facility and Equipment Manager",
  "FTE": 750,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000210737",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-03-04 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2010-02-26 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2010-02-26 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2010-02-26 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2015-02-26 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000015695,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000012623,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000016078,
          "ProcessID": 1000015695,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000018483,
          "ProcessID": 1000015695,
          "ChemicalID": 56,
          "Quantity": 27000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000518483,
          "ProcessID": 1000015695,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000012623,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\n\nDelhaize America-Distribution Center # 10, Salisbury, North Carolina, is strongly committed to employee, public and environmental safety. This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated processes. It is our policy to implement appropriate controls to prevent possible accidental releases of regulated substances. However, if such an accidental release does occur, we are coordinated with this facilityA?s contracted emergency response team, local Fire Department, and the Rowan County Emergency Management Agency for emergency response support.\n\nStationary Source and the Regulated Substances Handled\n\nDelhaize America-Distribution Center #10 is a dry and cold storage distribution facility.  The facility is primarily responsible is for storage, processing and resourcing Delhaize America grocery stores. The facility is located in the rural area of the city of Salisbury, North Carolina.  \n\nThe substance regulated under the Chemical Accident Prevention Provisions (40 CFR 68) that is located on site is anhydrous ammonia.  Ammonia  (Anhydrous) is the only RMP regulated substance present at this facility in a threshold quantity and is utilized as the primary cooling media in our closed-loop refrigeration system. The systemA?s purpose is to provide refrigeration and cold storage capabilities for our product. Due to the size and characteristics of our ammonia refrigeration system, as well as Process Safety Management (PSM) applicability, this facility is covered under Program 3 of the RMP regulations.\n\nThe Worst Case Release Scenario(s) and the Alternative Release Scenario(s), including administrative controls and mitigation measures to limit the distances for each reported scenario have been completed as discussed in the enclosed RMP Submittal text"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000012623,
      "SummaryText": " file.\n\nTo evaluate both the worst case and alternative release scenarios, EPA's RMP COMP was utilized exclusively. The RMP COMP model is referenced in the RMP Offsite Consequence Analysis Guidance as an acceptable model for the mathematical approximation process. \n\nAs specified in the RMP Guidance, the worst case and alternate case release scenarios have been calculated and the results of the calculations are on file at the Delhaize America, Salisbury, North Carolina location.  Public and environmental receptors that could possibly be affected by the scenarios were determined through the use of LANDVIEW 6 mapping system software and US Census Bureau 2000 data. \n\nGeneral Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\nDC #10 has taken all necessary steps to comply with the accidental release prevention requirements set forth in 40 CFR Part 68.  Delhaize America is also subject to the OSHA PSM Standard under 29 CFR 1910.119, as well as the EPCRA Section 302 and 311/312 notification/reporting requirements.\nEmergency Response Plan\n\nDelhaize AmericaA?s Emergency Response Policy focuses on evacuation of the facility in the event of an ammonia emergency, with the assistance from local emergency response agencies performing rescue, firefighting, first-aid, medical treatment, and other response functions. The facility maintains a written Emergency Response Plan to document specific procedures to be implemented in the event of various emergencies, including ammonia release. The Emergency Release Plan includes procedures for facility evacuation, as well as for notification to the local emergency response agencies, which are responsible for notifying the public. The plan is promptly updated to reflect any pertinent changes taking place within the facility that would require modified procedures.\n\nDelhaize America on-site personnel will respond to minor incidental ammonia releases only.  Trained off-site responders will handle all non-incidental"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000012623,
      "SummaryText": " and major releases.\n\nPlanned Changes to Improve Safety:\n\nDelhaize America currently has no changes planned for the ammonia refrigeration processes at this time.   However, the processes will be subjected to periodic process hazard analysis reviews for the purpose of identifying potential hazards and implementing the necessary improvement to provide a safer system. Delhaize America personnel will also periodically review all potential opportunities to improve the safety of our personnel, the surrounding community, and the ammonia refrigeration processes.\n\n"
    }
  ]
}