{
  "FacilityID": 1000102107,
  "FacilityName": "Rich Products Lodi",
  "FacilityStr1": "40 Neuharth Drive",
  "FacilityStr2": null,
  "FacilityCity": "Lodi",
  "FacilityState": "CA",
  "FacilityZipCode": "95240",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06077",
  "LEPC": "Inland Region 4 LEPC",
  "FacilityLatDecDegs": "38.108554",
  "FacilityLongDecDegs": "-121.271686",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "GO",
  "LatLongDescription": "ST",
  "FacilityURL": "www.richs.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 91486864,
  "ParentCompanyName": "Rich Products Corporation",
  "Company2Name": null,
  "CompanyDUNS": 2108371,
  "Company2DUNS": null,
  "OperatorName": "Rich Products Lodi",
  "OperatorStr1": "1831 S. Stockton Street",
  "OperatorStr2": null,
  "OperatorCity": "Lodi",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "95240",
  "OperatorZipCodeExt": null,
  "FTE": 336,
  "OtherEPAFacilityID": "95240CTTGB4ENEU",
  "EPAFacilityID": "100000209311",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2021-10-26 00:00:00",
  "SafetyInspectionBy": "San Joaquin County Health Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-09-12 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-09-12 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-09-12 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-09-12 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 38.110933,
  "FRS_Long": -121.269716,
  "FRS_Description": "UNKNOWN",
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000126754,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000102107,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000158576,
          "ProcessID": 1000126754,
          "ChemicalID": 56,
          "Quantity": 39000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000128127,
          "ProcessID": 1000126754,
          "NAICSCode": "311812",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000109222,
              "Process_NAICS_ID": 1000128127,
              "SafetyReviewDate": "2022-01-17 00:00:00",
              "PHA_Date": "2022-12-15 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-12-16 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Automatic shutoff at 500ppm",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "Yes",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "REMS Installation",
              "OpProceduresReviewDate": "2022-08-16 00:00:00",
              "TrainingReviewDate": "2021-08-15 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "No",
              "CT_Observation": "Yes",
              "CT_OtherType": "Reading & acknowledgement of SOPs annually",
              "MaintenanceReviewDate": "2022-01-17 00:00:00",
              "EquipmentInspectionDate": "2020-04-16 00:00:00",
              "EquipmentTested": "5 year mechanical integrity audit - all major system components",
              "ChangeMgmtDate": "2021-12-16 00:00:00",
              "ChangeMgmtReviewDate": "2022-01-17 00:00:00",
              "PreStartupReviewDate": "2022-01-15 00:00:00",
              "ComplianceAuditDate": "2020-01-07 00:00:00",
              "AuditCompletionDate": "2022-06-15 00:00:00",
              "IncidentInvestigationDate": "2020-08-10 00:00:00",
              "InvestigationChangeDate": "2021-01-15 00:00:00",
              "ParticipationPlansReviewDate": "2022-04-06 00:00:00",
              "HotWorkPermitReviewDate": "2022-04-06 00:00:00",
              "ContractorSafetyReviewDate": "2022-04-06 00:00:00",
              "ContractorSafetyEvalDate": "2022-04-06 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000136961,
                  "PreventionProgram3ID": 1000109222,
                  "ProcessChemicalID": 1000158576
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000102107,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Lodi Fire Department",
    "CoordinatingAgencyPhone": "2093336735",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 6,
      "FacilityID": 1000102107,
      "SummaryText": "bled, and the investigation is initiated within 48 hours of the incident. The results of the investigation are documented, recommendations are resolved, and appropriate process improvements are implemented.\n\nk)   Employee Participation - We have a written employee participation program for covered processes to help ensure that the safety concerns of our workers are addressed. We encourage active participation of personnel in the prevention program activities of all processes at the facility. Employees are consulted on and informed about all aspects of our accidental release prevention program.\n\nl)   Hot Work Permits - We have a hot work permit program to control spark- or flame-producing activities that could result in fires or explosions in our facility. We reviewed OSHA's fire prevention and protection requirements and created a hot work permit system to comply with these requirements. Training in the use of the hot work permit system is included in our safe work practices orientation.\n\nm)   Contractors - We have a program in place to help ensure that contractor activities at our facility are performed in a safe manner. This program reviews the safety record of all our contractors to help ensure that we hire only contractors who can safely perform the desired tasks. We explain to the contract supervisors the hazards of the process on which they and their employees will work, our safe work practices, and our emergency action procedures. The Contractor is required to ensure that training has been performed for each of their employees who work at the facility before that worker begins work at our facility. And finally, we periodically review contractors' training documents and work performance to help ensure that safe practices are followed.\n\n5.   Five-Year Accident History (§68.155(d)):\nThere have been no reportable incidents during the past five years.\n\n6.   Emergency Action Plan and Chemical-Specific Prevention Steps (§68.155(e) and §2745.3(e)): We have developed"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000102107,
      "SummaryText": "lity, in addition PSM meetings are held to review safety and PSM program elements."
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000102107,
      "SummaryText": "and implemented an OSHA hazardous substance emergency action plan for anhydrous ammonia. The plan outlines specific procedures for evacuations, incident alarms and alerting. The emergency action plan includes procedures for:\n\na)   Informing the National Response Center (NRC), LEPC, Fire Department, Police, etc. about accidental releases that could reasonably result in offsite consequences.\n\nb)   Providing proper first aid and emergency medical treatment for accidental human exposure to anhydrous ammonia.\n\nWe have an Emergency Action Program that identifies the actions to be taken during an emergency situation, and the Plant Manager is in charge of coordinating emergency actions. All of our personnel are trained in evacuation procedures. The EHS Manager is responsible for apprising the Region IV Local Emergency Planning Committee (LEPC) of the emergency situation, and the LEPC is responsible for notifying the public, if necessary.\n\n7.   Emergency Response Notification Activities\nWe coordinate response needs at least annually with local emergency planning and response organizations, providing the following:\n\na)   Our emergency action plan,\nb)   Any updated emergency contact information, and\nc)   any other information identified by local responders as relevant to local emergency response planning.\n\n8.   Emergency Response Notification Exercises\nWe conduct an annual exercise of our emergency response notification mechanisms.\n\n9.   Planned Changes to Improve Safety (§68.155(f) and §2745.3(f)):\nWe constantly strive to improve the safety of our processes using recommendations developed through the prevention program and a program soliciting safety suggestions from our employees. Based on the Process Hazard Analysis (PHA) for anhydrous ammonia, a list of action items was developed. The status of these action items will be monitored to ensure that implementation of the safety improvements is accomplished. Monthly safety training is conducted for all team members at this faci"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000102107,
      "SummaryText": "r newly modified processes are more likely to be involved in accidental releases. Therefore, we perform safety reviews of new or modified processes before placing them into service to help ensure their safe operation. This review confirms that: (1) construction and equipment are in accordance with design specifications, (2) adequate safety, operating, maintenance, and emergency procedures are in place, (3) employee training has been completed, and (4) a PHA has been performed (if required) if the process is new or management of change requirements have been completed if an existing process has been modified.\n\nh)   Compliance Audit - One of the cornerstones of an effective prevention program is a regular, thorough assessment. We audit our covered process every 3 years to be certain our program is effectively addressing the safety issues of our operations. We assemble an audit team that includes personnel knowledgeable in the PSM and RMP rules and in our process design, and this team evaluates whether the prevention program satisfies the requirements of these rules and whether it is sufficient to help ensure safe operation of the process. The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\ni)   Third-Party Audit - Should we experience an accidental release that results in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage, we will employ an independent, third-party to conduct the next Compliance Audit.\n\nj)   Incident Investigation - We investigate all incidents that resulted in, or could reasonably have resulted in (i.e., a near miss) serious injury to personnel, the public, or the environment so that similar accidents can be prevented in the future. We train our employees to identify and report any incident requiring investigation. An investigation team is assem"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000102107,
      "SummaryText": "upset. Operating procedures include: (1) steps for safely conducting activities, (2) applicable process safety information, such as operating limits and consequences of process deviations, and (3) safety and health considerations, such as chemical hazards, personal protective equipment requirements, and actions to take if exposure to a hazardous substance occurs.\n\nd)   Training - We train workers to safely and effectively perform their assigned tasks. Our training program includes both initial and refresher training that covers (1) a general overview of the process, (2) the properties and hazards associated with anhydrous ammonia, and (3) a detailed review of the process operating procedures and safe work practices. On-the-Job Training and Evaluation is used to verify that an employee understands the training material before the employee can begin or resume work on the system.\n\ne)   Mechanical Integrity - We maintain our process equipment to help prevent equipment failures that could endanger workers, the public, or the environment. Our mechanical integrity (preventive maintenance) program includes (1) inspection and testing program to help identify equipment deficiencies and damage before the equipment fails and (2) a quality assurance program to help ensure that new and replacement equipment meet the strict design standards required for service in our process.\n\nf)   Management of Change - We evaluate and specifically approve all proposed changes to chemicals, equipment, technology, and procedures to help ensure that the change does not negatively affect safe operations. All changes other than replacement-in-kind must be approved through the full management of change program. This helps ensure that inadvertent consequences of process changes are prevented, safety consequences of changes are addressed, affected process safety information and procedures are updated, and affected employees are notified of the changes.\n\ng)   Pre-Startup Review - We recognize that new o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000102107,
      "SummaryText": "ent (PSM) rule. For our facility, the prevention program requirements for the EPA's RMP rule and CalARP regulations are nearly identical to the PSM rule. The following section briefly describes the 12 elements of our prevention program:\n\na)   Process Safety Information - We maintain a variety of technical documents, including an emergency preparedness plan, to help ensure that employees and local emergency responders know about the hazards associated with our facility. These documents address (1) physical properties of anhydrous ammonia, (2) operating parameters for our equipment, and (3) design basis and configuration for our equipment. We ensure that this process safety information is available to all our employees.\n\nb)   Process Hazard Analysis - We perform and periodically update process hazard analysis (PHAs) for our covered process to help identify process hazards and make recommendations that might improve the safe operation of the process. A multidisciplinary team is assembled to analyze the hazards of our process. This team includes personnel with engineering and process operating experience and a leader with PHA experience. The team systematically addresses the hazards associated with operation of the equipment in the covered process. The team then prepares a written report describing the results of the analysis, including a list of recommendations.\n\nResponsibility for resolving the recommendations is assigned to plant personnel, and, when appropriate, changes to enhance the safety of the process are implemented. The analysis is revisited at least every 5 years to ensure it is current.\n\nc)   Operating Procedures - Our operators and managers work together to develop and maintain operating procedures to define how tasks related to process operations should be safety performed. The operating procedures are used to train employees and serve as reference guides for appropriate actions to take during both normal operations and in the unlikely event of a process"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000102107,
      "SummaryText": "We also provide our employees with extensive training in the safe operation of those processes and equipment.\n\nEmergency Action - We have developed an OSHA hazardous substance Emergency Action Plan. This plan outlines specific procedures for evacuations, incident alarms and alerting.  Depending upon a given situation, the Lodi Fire Department will be called to provide emergency responders and equipment. The Lodi Fire Department will be called for all fire related emergencies. The facility has communicated the hazard of anhydrous ammonia with the Lodi Fire Department and the Local Emergency Planning Committee (LEPC). The incident commander has ultimate control of the implementation of the emergency response.\n\nOur internal emergency communications program ensures that all supervisors and employees in areas affected by an inadvertent chemical leak are warned and evacuated, if necessary, and immediate steps are taken to evaluate and stop the leak. To ensure that we are adequately addressed in the community emergency response plan and to ensure that local response organizations are aware of our facility, annual coordination exercises are conducted. Additionally, we conduct an annual exercise of our notification mechanisms.\n\n2.   Stationary Source and Regulated Substances (§68.155(b) and §2745.3(b)):\nCottage Bakery, Inc. is a processing plant located at 40 Neuharth Drive Stockton Street in Lodi, CA. The facility utilizes anhydrous ammonia for refrigeration and freezing of the bakery products manufactured and stored at the facility.\n\n3.   Worst Case and Alternative Release Scenarios:\nEquations from the U.S. EPA's RMP Guidance for Ammonia Refrigeration were utilized to calculate the worst case and alternative release scenarios for the ammonia refrigeration process.\n\n4.   Prevention Program (§68.155(d) and §2745.3(c)):\nWe have developed and implemented a prevention program that complies with the Occupational Safety and Health Administration's (OSHA's) Process Safety Managem"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000102107,
      "SummaryText": "ts environment and the communities in which it serves.  RPC holds itself to the highest set of standards and is about doing what's right...no matter what.\n\nFACILITY DESCRIPTION\nRich Products Lodi is located at 40 Neuharth Drive in Lodi, CA.\n\nThe facility consists of a processing plant used to manufacture and bakery products, which are frozen for shipment. The Site's North American Industrial Classification System (NAICS) code is 311812 (Commercial Bakeries). As part of the Site's refrigeration system, which is used to freeze the bakery products for shipment, the Site handles quantities of anhydrous ammonia, a regulated substance/highly hazardous chemical as defined in the USEPA's RMP Rule, Cal OES CalARP program, and OSHA's PSM standard, in an amount exceeding the regulatory threshold for anhydrous ammonia in a single process, i.e., the Site's refrigeration system. The Facility is registered to Program Level 3 under the USEPA CAPP and Cal OES CalARP programs. The Facility normally operates 6 days per week, 24 hours per day and maintains approximately 340 full time employees.\n\nThe anhydrous ammonia, which is liquefied under pressure, is contained in various vessels, accumulators, piping, and heat exchangers throughout the refrigeration system. The majority of the Site’s refrigeration machinery is located outside, adjacent to the building.\n\n1.   Accidental Release Prevention and Emergency Action (§68.155(a) and §2745.3(a)): Protecting the health and safety of our employees and neighbors, and of the surrounding environment, is our top priority, and we have a comprehensive program in place to reduce risks associated with our process.\n\nHazard Assessment and Reduction - We regularly assess the risks associated with the use of anhydrous ammonia in our manufacturing processes and seek out ways in which to reduce those risks.\n\nAccident Prevention - We engineer and construct our manufacturing processes and equipment to minimize the possibility of accidental chemical releases."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000102107,
      "SummaryText": "Rich Products Corporation's (RPC's) Lodi, CA location (Site) has developed this program in accordance with the United States Environmental Protection Agency's (USEPA's) Chemical Accident Prevention Provisions (CAPP) of the Clean Air Act, as amended (CAAA), a.k.a., the Risk Management Plan (RMP) rule, which is codified at 40 CFR 68, the California Governor’s Office of Emergency Services (Cal OES) California Accidental Release Prevention (CalARP) program, which is codified at Chapter 4.5 of Division 2 of Title 19 of the California Code of Regulations (CCR), and the United States Occupational Safety & Health Administration's (OSHA's) Process Safety Management (PSM) of Highly Hazardous Chemicals (HHCs) standard (PSM Standard), which is codified at 29 CFR 1910.119. The program is designed to inform all Site employees (hereafter referred to as Associates) of the hazards of ammonia, procedures for the safe use of ammonia, and the steps taken for the safety of Associates in the event of a release or spill (i.e., emergency response plan, management of change procedures, preventative maintenance program, associate training, etc.).\n\nAdditionally, RPC has developed and implemented the Rich Products Corporation Standards for Safety Performance which outlines the corporate policy for safety policies, safety procedures, and sample programs to be implemented at each Rich Products Corporation Facility.\n\nRPC is guided by a set of core values that include:\n• Cherish Our Culture - Work, learn and celebrate together;\n• Innovate - Imagine what's possible and create what's valued;\n• Be the Trusted First Choice - Listen, understand and deliver for customers like no other company;\n• Better Our Communities - Devote time and talent where we work and live; and\n• Do What's Right - No matter what.\n\nRPC is committed to an irrevocable obligation to act responsibly in every decision made and with every person encountered.  RPC understands it is a trusted steward of its business relationships, i"
    }
  ]
}