{
  "FacilityID": 1000077071,
  "FacilityName": "BEF Foods",
  "FacilityStr1": "200 N. Wolcott St.",
  "FacilityStr2": null,
  "FacilityCity": "Hillsdale",
  "FacilityState": "MI",
  "FacilityZipCode": "49242",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "26059",
  "LEPC": "Hillsdale County LEPC",
  "FacilityLatDecDegs": "41.921722",
  "FacilityLongDecDegs": "-084.616118",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.bobevans.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 4286407,
  "ParentCompanyName": "Bob Evans Farms",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "BEF Foods",
  "OperatorStr1": "200 N. Wolcott St.",
  "OperatorStr2": null,
  "OperatorCity": "Hillsdale",
  "OperatorStateFIPS": "MI",
  "OperatorZipCode": "49242",
  "OperatorZipCodeExt": null,
  "RMPContact": "Paul Monahan",
  "RMPTitle": "Plant Manager",
  "FTE": 140,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000187077",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2019-05-28 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": "2009 Hillsdale 5 Year resubmit",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-04-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-04-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-04-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000095893,
      "AltID": "Industrial Refrigeration",
      "FacilityID": 1000077071,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000097159,
          "ProcessID": 1000095893,
          "NAICSCode": "311611",
          "_desc": {
            "NAICS_CODE": "311611",
            "NAICS_DESCRIPTION": "Animal (except Poultry) Slaughtering"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120067,
          "ProcessID": 1000095893,
          "ChemicalID": 56,
          "Quantity": 12772.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000620067,
          "ProcessID": 1000095893,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077071,
      "SummaryText": "BEF Foods is proud to inform all interested parties that our company is complying with OSHA's Process Safety Management Standard (PSM), Title 29 Code of Federal Regulations 1910.119, and EPA's Risk Management Program regulations (RMP), Title 40 CFR Part 68.  In addition to other state and local codes applicable to our facility and process. We have undertaken this process to deal with the risks involved with the storage, handling, and use of Anhydrous Ammonia in our facility.\n\n\n\nOur goal is to promote overall worker, public, and plant safety.\n\n\n\nBEF Foods is located at 200 N. Wolcott St, Hillsdale, Michigan. We manufacture some of the finest pork products in the world.  The facility includes processing tanks, piping, packaging equipment, raw materials warehousing, finished goods refrigerated storage, an Ammonia refrigeration engine room, boilers, and miscellaneous utilities. \n\n\n\nThe refrigeration system required for our production process necessitates the submission of this Risk Management Plan.  The refrigeration system contains approximately 13,000 pounds of anhydrous ammonia.  This surpasses the threshold quantity of 10,000 pounds outlined in Process Safety Management and Risk Management Program regulations.\n\n\n\nBEF Foods has implemented numerous policies and procedures to enable our facility to prevent the occurrence and minimize the consequences of significant releases of Anhydrous Ammonia as well as other hazardous substances, fires, explosions, and other types of catastrophic accidents.  Overall these programs prevent accidental fatalities, injuries, and illnesses and avoid property damage.\n\n\n\nOur safety programs prevent accidents because they focus on the rules, procedures, and practices that govern individual processes, activities, or pieces of equipment.  These rules are detailed and improved as necessary. \n\n\n\nBEF Foods has organized the information and polices pertaining to the process into a complete library consisting of five numbered volumes, some volume"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077071,
      "SummaryText": " numbers are assigned to sets of reference manuals, such as Operation and Maintenance manuals.  This library also incorporates the use of videos and computerized tests.\n\n\n\nVolume I of the PSM/RMP Library incorporates written programs:\n\n\n\nVolume II incorporates information on the specific system components of the production area equipment. This information is used as a reference source for the operator to positively identify system components. This manual also provides a checklist for performing the yearly Mechanical Integrity Inspection.\n\n\n\nVolume III incorporates a complete valve list, process and instrumentation diagrams, flow schematics, and other drawing pertinent to the production area equipment. The valve list contains information on the type, port size, identifying number, use, location, model, manufacturer, drawing reference, and normal operating position of each valve in the system. Process and Instrumentation Diagrams are included for the individual system components. Flow schematics are included showing the entire system. A Block flow diagram provides a brief overview of the system. Drawings are included showing symbol and abbreviation descriptions. Plan views are included to allow the operator to physically locate equipment in the building.\n\n\n\nVolume IV incorporates a complete set of standard operating procedures for the production area equipment. Describing the proper steps for preparing components for start-up, starting components, monitoring normal operation, shutting down as part of normal operation, restarting equipment as part of normal operation, shutting down equipment for maintenance, restarting equipment after maintenance, shutting down equipment in emergency situations, restarting equipment after an emergency situations shutdown, and pump out procedures. Also, included as a part of each Standard Operating Procedure is the Technical Operating Specifications for the associate system component. This information includes consequences of deviation "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077071,
      "SummaryText": "from standard operating procedures.\n\n\n\nVolume V contains Operation and Maintenance Information for the production area equipment including manufactures information, spare parts list, maintenance procedures, and preventative maintenance procedures.\n\n\n\nProcess Hazard Analysis Re-validation is scheduled for this year. The PHA highlighted some deficiencies in the system. These items were addressed as part of the continuous improvement of the facility. These items were addressed on the basis of priority (Injuries to personnel).\n\n\n\nBEF Foods also incorporates additional safety items such as tagging of all ammonia system valves and components. \n\n\n\nDESCRIPTION OF THE REFRIGERATION SYSTEM\n\n\n\nBEF Foods in Hillsdale, Michigan is a meat-based processing and distribution facility.  The facility incorporates a standard evaporation and compression ammonia refrigeration system.  \n\n\n\nSUMMARY OF THE FIVE-YEAR ACCIDENT HISTORY\n\n\n\nBEF Foods had no releases of over 100 pounds the last five years.\n\n\n\nDESCRIPTION OF THE EMERGENCY RESPONSE PLAN\n\n\n\nIn the event that an ammonia leak is detected employees are to notify the onsite Maintenance Manager and Emergency Response Facilitator.  The facilitator takes an ammonia level reading using a detection device.  If the facilitator determines that the ammonia level is above 25 ppm an evacuation of the exposure area is ordered.\n\n\n\nThe Maintenance Manager determines if the leak is serious enough that outside assistance is needed.  If outside assistance is needed the local HAZMAT organization is contacted. The Maintenance Manager then takes appropriate procedures, such as Emergency Shutdown Standard Operating Procedures, to control the leak with personal protective devices in place.\n\n\n\nBEF Foods is committed to continuous improvement of our policies, procedures, and facility. It is the intention of BEF Foods to remain an industry leader. New technology, training techniques, and equipment are continuously being added to our system.\n\n"
    }
  ]
}