{
  "FacilityID": 1000036741,
  "FacilityName": "Bridgeport Ethanol, LLC",
  "FacilityStr1": "10106 South Railroad Avenue",
  "FacilityStr2": null,
  "FacilityCity": "Bridgeport",
  "FacilityState": "NE",
  "FacilityZipCode": "69336",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "31123",
  "LEPC": "Morrill County LEPC",
  "FacilityLatDecDegs": "41.642464",
  "FacilityLongDecDegs": "-103.075790",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 956745413,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Ted Free",
  "OperatorStr1": "10106 South Railroad Avenue",
  "OperatorStr2": null,
  "OperatorCity": "Bridgeport",
  "OperatorStateFIPS": "NE",
  "OperatorZipCode": "69336",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian DeBlois",
  "RMPTitle": "Plant Manager",
  "FTE": 30,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000204227",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2013-07-23 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2013-10-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2013-10-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2013-10-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2018-10-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000045009,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000036741,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000045413,
          "ProcessID": 1000045009,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054377,
          "ProcessID": 1000045009,
          "ChemicalID": 56,
          "Quantity": 80389.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000554377,
          "ProcessID": 1000045009,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000045010,
      "AltID": "Ethanol Manufacturing",
      "FacilityID": 1000036741,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000045414,
          "ProcessID": 1000045010,
          "NAICSCode": "325193",
          "_desc": {
            "NAICS_CODE": "325193",
            "NAICS_DESCRIPTION": "Ethyl Alcohol Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000054412,
          "ProcessID": 1000045010,
          "ChemicalID": 155,
          "Quantity": 542100.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 155,
            "ChemicalName": "Flammable Mixture",
            "CASNumber": "00-11-11",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000047518,
              "ProcessChemicalID": 1000054412,
              "ChemicalID": 125,
              "_chemical": {
                "ChemicalID": 125,
                "ChemicalName": "Pentane",
                "CASNumber": "109-66-0",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            },
            {
              "FlamMixChemID": 1000047519,
              "ProcessChemicalID": 1000054412,
              "ChemicalID": 118,
              "_chemical": {
                "ChemicalID": 118,
                "ChemicalName": "Butane",
                "CASNumber": "106-97-8",
                "Threshold": 10000.0,
                "ChemType": "F",
                "flgCBI": 0,
                "ChemOwner": "FED"
              }
            }
          ]
        },
        {
          "ProcessChemicalID": 1000554412,
          "ProcessID": 1000045010,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000036741,
      "SummaryText": "RISK MANAGEMENT PLAN EXECUTIVE SUMMARY\n\nBridgeport Ethanol, LLC\n\n\n\nBridgeport Ethanol, LLC (Bridgeport) owns and operates a nameplate 50,000,000 gallon per year (50 MMgal/yr) denatured fuel-grade ethanol and industrial grade undenatured ethanol plant. Plant construction began in September 2007 and operations began in November 2008. At that time, BRIDGEPORT submitted an RMP for the facility in accordance with 40 CFR Part 68. \n\n\n\nThe Bridgeport ethanol plant utilizes corn (grain) to produce ethanol via natural fermentation. These activities fall under Standard Industrial Classification (SIC) 2869, Industrial Organic Chemicals, Not Elsewhere Classified. The plant generates fuel-grade ethanol, primarily for blending with motor fuels. The ethanol may be blended with approximately 2.5% gasoline in the final denaturing stages of the process or it may be left undenatured. The plant also generates carbon dioxide, corn oil, and wet distiller's grain and solubles (WDGS), which can be sold as animal feed.\n\n\n\nAccidental Release Prevention and Response Policies\n\n\n\nBridgeport is committed to worker and public safety.  This commitment is demonstrated by Bridgeport's investment in accident prevention, through the establishment of a facility that is well designed, installed, operated and maintained. In addition, training is considered a crucial part of safe operation and accident prevention. Staff is trained about spill prevention and control methods as well as emergency response plans in place at the facility.\n\n\n\nIt is Bridgeport policy to implement reasonable controls to prevent foreseeable releases of regulated substances and if a release does occur, plant personnel will respond to contain the release as necessary. Bridgeport management is dedicated to safety, spill prevention and proper emergency response.\n\n\n\nDescription of the Stationary Source and Regulated Substances\n\n\n\nBridgeport is located approximately one mile southeast of Bridgeport, Morrill County, Nebraska on a 43 acre "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000036741,
      "SummaryText": "parcel of land that is bounded by Country Roads 90 and 92 and the Burlington Northern Santa Fe railroad.\n\n\n\nThe facility operates 24 hours per day, 7 days per week for the purpose of manufacturing fuel grade ethanol from corn. The substances which Bridgeport has onsite that are regulated by the RMP program are Anhydrous Ammonia and Denaturant (natural gasoline) which is considered a flammable mixture.  The anhydrous ammonia is used as a chemical processing aid and is consumed in the manufacturing process. It is stored in a single anhydrous ammonia tank. The denaturant (natural gasoline) is used to denature the ethanol so that it is unfit for human consumption before being shipped offsite. Denaturant is generally stored onsite in the denaturant and final product storage tanks. \n\n\n\nFive Year Accident History\n\n\n\nBridgeport has been subject to RMP criteria since it began storing anhydrous ammonia and denaturant (natural gasoline) onsite.\n\nIn the last five years, Bridgeport has had no reportable accidents.\n\n\n\nEmergency Response Program Information\n\n\n\nBridgeport is registered with the Morrill County, NE LEPC and does not have its own Emergency Response Plan for emergencies requiring a high level of emergency support. In the case that an incident occurred which required high level emergency response, Bridgeport would call 911 for the necessary fire, medical or other emergency support.\n\n\n\nAs explained above, Bridgeport is committed to worker and public safety and has invested in training and equipment to prevent chemical spills and other emergency situations. In the event of a chemical spill, plant personnel would respond to contain the release, as necessary. Some physical aspects of the plant would also help the personnel contain a potential spill. For example, all tanks that contain denaturant are located in a large, bermed containment area that is separated from the plant.  A release from one of these tanks would be prevented from migrating off-site, and a fire could be "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000036741,
      "SummaryText": "extinguished before it spreads to other units at the facility.  In addition, a manual shut off valve in the ammonia tank would help limit the volume of an ammonia spill.\n\n\n\nGeneral Accidental Release Prevention Program\n\n\n\nBridgeport is subject to RMP Prevention Program Level 3.  Bridgeport is fulfilling its duties to comply with the EPA requirements of 40 CFR Part 68.115(d) through the completion of this RMP and similar efforts regulated by OSHA's Process Safety Management standard (29 CFR 1910.119).  Bridgeport has complied with Process safety information, safe work practices such as Hot Work, Confined Space Entry and Lockout/Tagout, and operations and maintenance procedures are documented on-site. Periodic functions such as process hazard analyses (PHA), training, management of change, pre-startup safety reviews, and incident investigation are conducted on a regular basis.\n\n  \n\nThe denaturant tank is equipped with tank level sensors and alarms as well as a bermed containment structure that surrounds the entire tank farm.  The anhydrous ammonia tank is equipped with a manual shut off valve.  These chemical specific prevention measures minimize the risk for an RMP reportable incident.  Compliance audits of the RMP Prevention Program will be conducted on a regular basis to assure compliance with EPA and OSHA regulations. \n\n\n\nPlanned Changes to Improve Safety\n\n\n\nAs previously mentioned, Bridgeport is committed to protecting its employees, the greater community and the environment from the release of hazardous substances used in the ethanol fuel production process. Bridgeport management is committed to promoting a safe work environment and will continue to provide its employees with the necessary training, tools, and ongoing support to operate the ethanol production facility in a safe and efficient manner. Periodic audits will help us assure that we are doing everything reasonable to minimize the risk of and mitigate the effects of an accidental release.\n\n\n\n"
    }
  ]
}