{
  "FacilityID": 1000028559,
  "FacilityName": "Fourth Creek Wastewater Treatment Plant",
  "FacilityStr1": "1500 Lyons Bend Road",
  "FacilityStr2": null,
  "FacilityCity": "Knoxville",
  "FacilityState": "TN",
  "FacilityZipCode": "37919",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "47093",
  "LEPC": "Knox County LEPC",
  "FacilityLatDecDegs": "35.916942",
  "FacilityLongDecDegs": "-083.987503",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.kub.org",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Knoxville Utilties Board",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Knoxville Utilties Board",
  "OperatorStr1": "PO Box 59017",
  "OperatorStr2": null,
  "OperatorCity": "Knoxville",
  "OperatorStateFIPS": "TN",
  "OperatorZipCode": "37950",
  "OperatorZipCodeExt": "9017",
  "FTE": 3,
  "OtherEPAFacilityID": "TN0023574",
  "EPAFacilityID": "100000084963",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-02-07 00:00:00",
  "SafetyInspectionBy": "Knox County Air Quality Management Division",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "*Public Wastewater Treatment Plant",
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2013-12-02 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-06-18 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "Yes",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2012-06-18 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2022-07-15 00:00:00",
  "DeRegistrationEffectiveDate": "2022-07-14 00:00:00",
  "AnniversaryDate": "2017-06-18 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 35.916942,
  "FRS_Long": -83.987503,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000034767,
      "AltID": "Disinfection Process",
      "FacilityID": 1000028559,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000042053,
          "ProcessID": 1000034767,
          "ChemicalID": 62,
          "Quantity": 16000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000035129,
          "ProcessID": 1000034767,
          "NAICSCode": "22132",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000030423,
              "Process_NAICS_ID": 1000035129,
              "SafetyReviewDate": "2012-03-23 00:00:00",
              "PHA_Date": "2012-04-01 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2012-02-22 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Terroristic Acts",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "No",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "No",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-05-20 00:00:00",
              "TrainingReviewDate": "2012-02-22 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-05-20 00:00:00",
              "EquipmentInspectionDate": "2012-05-18 00:00:00",
              "EquipmentTested": "Chlorine Alarm Summary, leak detection, scrubber system.",
              "ChangeMgmtDate": "2010-02-09 00:00:00",
              "ChangeMgmtReviewDate": "2012-02-22 00:00:00",
              "PreStartupReviewDate": "2010-02-11 00:00:00",
              "ComplianceAuditDate": "2012-02-22 00:00:00",
              "AuditCompletionDate": "2012-02-22 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2012-02-22 00:00:00",
              "HotWorkPermitReviewDate": "2012-02-22 00:00:00",
              "ContractorSafetyReviewDate": "2012-03-19 00:00:00",
              "ContractorSafetyEvalDate": "2012-02-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000036266,
                  "PreventionProgram3ID": 1000030423,
                  "ProcessChemicalID": 1000042053
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000028559,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2011-07-01 00:00:00",
    "ERTrainingDate": "2011-07-28 00:00:00",
    "CoordinatingAgencyName": "Knoxville/Knox Co LEPC",
    "CoordinatingAgencyPhone": "8652152297",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000028559,
      "SummaryText": "Knoxville Utilities Board POA\r\nFourth Creek Wastewater Treatment Plant\r\nRisk Management Program\r\nExecutive Summary\r\n\r\n1.0  Accidental Release Prevention and Response Policies\r\n\r\nThe Knoxville Utilities Board (KUB) Fourth Creek Wastewater Treatment Plant has a long-standing commitment to operating our facility in a manner that is safe for our employees, the public, and the environment.  A primary aspect of this commitment is the KUB Fourth Creek Wastewater Treatment Plant system to help ensure the safe operation of our water chlorination process.  Our commitment is also demonstrated by the resources invested in accident prevention, such as considering safety in the design, installation, operation and maintenance of our process, as well as, extensive training of our operating personnel.\r\n \r\nIn the event of an accidental release, the KUB Fourth Creek Wastewater Treatment Plant has procedures that are designed to control and contain the release in a manner that will be safe for our employees and will help prevent injury to the public and the environment.  The KUB Fourth Creek Wastewater Treatment Plant's emergency response personnel receive thorough training in handling accidental releases.  An emergency response coordinator has been assigned to oversee response activities and to coordinate response efforts with local emergency agencies.  Communications with the Local Emergency Planning Committee (LEPC) have been ongoing throughout the preparation of this plan and policies.\r\n\r\nIn order to effectively implement these policies, the KUB Fourth Creek Wastewater Treatment Plant established a management system headed by the Fourth Creek Wastewater Treatment Plant Operations Supervisor to ensure the proper implementation and effectiveness of our Risk Management Program.\r\n\r\n\r\n2.0  KUB Fourth Creek Wastewater Treatment Plant and Regulated Substances\r\n\r\nKUB Fourth Creek Wastewater Treatment Plant is located in Knoxville, Tennessee, a city of over 170,000 residents.  The KUB Fourt"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000028559,
      "SummaryText": "h Creek Wastewater Treatment Plant handles one substance regulated by the OSHA Process Safety Management Standard and the EPA Risk Management Program Rule (RMP Rule) rule in quantities above the Threshold Quantity. \r\n\r\nProcess Description: Chlorination\r\nProgram Level: 3\r\nRegulated Substance: Chlorine\r\nMaximum Quantity (lbs): 16,000  \r\n\r\n\r\n3.0  Hazard Assessment Results\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant performed an offsite consequence analysis to estimate the potential impacts of accidental releases of the Chlorine from our process. The regulated substance was evaluated for a possible worse-case release scenario and alternative release scenario.  The results of this Hazard Assessment have been appropriately communicated to the local emergency response agencies.\r\n\r\n4.0  Accidental Release Prevention Program - Program 3\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant Chlorination Process is covered by the OSHA Process Safety Management standard.  The requirements of the OSHA Process Safety Management standard are nearly identical to the RMP Rule Program 3 Prevention Program requirements.  The Chlorination Process Prevention Program consists of the following elements.\r\n\r\n4.1  Process Safety Information\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant maintains a variety of technical documents that help ensure the safe operation of our processes.  These documents address:\r\n\r\n* physical properties of hazardous substances handled,\r\n* chemical properties and associated hazards of those substances,\r\n* operating parameters and limitation(s) of the process equipment,\r\n* design basis and configuration of the equipment, and\r\n* specific chemical inventories.\r\n \r\nThe KUB Fourth Creek Wastewater Treatment Plant ensures that the process safety information is available to all KUB Fourth Creek Wastewater Treatment Plant employees, the Local Emergency Planning Committee (LEPC), and the local fire department.  The Plant Maintenance Manager is responsible for maint"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000028559,
      "SummaryText": "aining and updating this information, as needed.\r\nChemical specific information, including exposure hazards and emergency response/exposure treatment considerations, is provided in material safety data sheets (MSDSs).  This information is supplemented by other technical information specific for these chemicals.  Continuous attention is given to revisions and updates on the hazards of chlorine and other chemicals used in our process.  Information regarding toxicity, environmental impacts, corrosion concerns, inadvertent mixing hazards, and other safety and health concerns are addressed and communicated to the appropriate parties.\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant also maintains numerous technical documents that provide information about the design and construction of process equipment.  This information includes:\r\n\r\n* materials of construction,\r\n* design pressures,\r\n* temperature ratings,\r\n* electrical ratings,\r\n* flow limits,\r\n* block flow diagrams,\r\n* consequences of deviation from operating limits,\r\n* safety systems,\r\n* applicable design codes and standards,\r\n* process chemistry, and\r\n* design basis for relief and ventilation systems.\r\n\r\nWhen information was not available for design documents, it was developed through special project committees or during the Process Hazard Analyses (PHAs) of the Chlorination Process.  Many of the operating parameters are included in the operating procedures to aid in the safe and proper operation of the process.  These documents are used to:\r\n\r\n* train employees,\r\n* perform Process Hazard Analyses (PHAs), and\r\n* help maintain the equipment.\r\n\r\nAll the above mentioned information, in combination with written procedures and trained personnel, provide a basis for establishing inspection and maintenance activities, as well as for evaluating proposed process and facility changes to ensure that safety features in the Chlorination Process are not compromised.\r\n\r\n4.2  Process Hazard Analysis\r\n\r\nThe KUB Fourth Creek Wastew"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000028559,
      "SummaryText": "before the equipment fails,\r\n* a quality assurance program to help ensure that the new and replacement equipment meet the design standards required for service in our process,\r\n* procedures for safe work practices such as lockout/tagout, hot work, confined space entry and line or equipment opening,\r\n* training of maintenance personnel, and\r\n* documentation of maintenance activities.\r\n\r\n 4.6  Management of Change\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant has a comprehensive program to manage changes to processes.  Under this program, all proposed changes to chemicals, equipment, and procedures for the Chlorination Process must be evaluated and approved to help ensure the change does not negatively affect safe operations.  Changes are reviewed to (1) ensure that adequate controls are in place to manage any new hazards and (2) verify that existing controls have not been compromised by the change.  Affected chemical hazard information, process operating limits, and equipment information, and procedures are updated to incorporate these changes.  In addition, operating and maintenance personnel are provided with any necessary training related to the change.\r\n\r\n4.7  Pre-startup Review\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant performs a safety review of all new or modified processes prior to their being placed into service to ensure that these processes have been prepared to operate safely.  This review is designed to confirm:\r\n\r\n* construction and equipment are in accordance with design specifications,\r\n* adequate safety, operating, maintenance, and emergency procedures are in place,\r\n* employee training has been completed, and\r\n* for covered processes, a PHA has been performed for new processes and management of change requirements have been completed for modified processes.\r\n \r\nA pre-startup review team uses checklists to verify all aspects of readiness.  The review involves field verification of the construction elements and serves as a quality assur"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000028559,
      "SummaryText": "ance function by requiring verification that accident prevention program requirements are properly implemented.\r\n \r\n4.8  Compliance Audit\r\n \r\nThe KUB Fourth Creek Wastewater Treatment Plant conducts periodic audits of the Chlorination Process to ensure the KUB Fourth Creek Wastewater Treatment Plant Prevention Program has been effectively implemented and addresses the safety issues of our operations.  Compliance audits are conducted at least every three years by a team of hourly and management personnel who are knowledgeable of the RMP Rule and the Chlorination Process.  The team evaluates the KUB Fourth Creek Wastewater Treatment Plant Prevention Program and other aspects of the KUB Fourth Creek Wastewater Treatment Plant Risk Management Program.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the Prevention Program are implemented.  The KUB Fourth Creek Wastewater Treatment Plant maintains records of at least the last two audits conducted.\r\n \r\n4.9  Incident Investigation\r\n \r\nThe KUB Fourth Creek Wastewater Treatment Plant promptly investigates all incidents that resulted in, or reasonably could have resulted in, a fire/explosion, toxic gas release, major property damage, environmental loss, or personal injury.  The goal of each investigation is to determine the facts and develop corrective actions to prevent recurrence of the incident or a similar incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\r\n \r\n4.10  Employee Participation\r\n \r\nThe KUB Fourth Creek Wastewater Treatment Plant developed a written employee participation program for the Chlorination Process and other aspects of our operations to ensure that the safety concerns are addressed.  The KUB Fourth Creek Wastewater Treatment Plant encourages the active participation of our employees in the Prevention Program for all processes and tasks at our facility.  Emp"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000028559,
      "SummaryText": "develop and maintain written operating procedures to define how tasks related to the Chlorination Process operation should be safely performed.  These written procedures address various modes of process operations, such as:\r\n\r\n* unit startup,\r\n* normal operations,\r\n* temporary operations,\r\n* emergency shutdown,\r\n* normal shutdown, and\r\n* initial startup of a new process.\r\n \r\n \r\n The written operating procedures include:\r\n \r\n* steps for safely conducting process tasks,\r\n* applicable process safety information, such as safe operating limits and consequences of process deviations, and\r\n* safety and health considerations, such as chemical hazards, personal protective equipment requirements, and action(s) to take in the event of an exposure to a hazardous substance.\r\n\r\n4.4  Training\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant trains workers to safely and effectively perform their assigned tasks.  The KUB Fourth Creek Wastewater Treatment Plant training program includes both initial and refresher training that covers:\r\n\r\n* a general overview of the Chlorination Process,\r\n* the properties and hazards of the substances in the process, and\r\n* a detailed review of the process operating procedures and safe work practices.\r\n\r\nIn addition to the above mentioned classroom training, each operator is required to work for a period of time with an experienced operator until clear understanding of the operating procedures is demonstrated.  Refresher training is conducted annually as part of the KUB Fourth Creek Wastewater Treatment Plant's ongoing safety training effort.\r\n\r\n4.5  Mechanical Integrity\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant maintains the mechanical integrity of Chlorination Process equipment to help prevent failures that could endanger workers, the public, or the environment.  The KUB Fourth Creek Wastewater Treatment Plant mechanical integrity program includes:\r\n\r\n* an inspection and testing program to help identify equipment deterioration and damage"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000028559,
      "SummaryText": "loyees are consulted on and informed of all aspects of the KUB Fourth Creek Wastewater Treatment Plant Risk Management Plan (RMP) and participate on PHA and Compliance Audit teams.\r\n \r\n4.11  Hot Work Permits\r\n \r\nThe KUB Fourth Creek Wastewater Treatment Plant established a Safe Work Permit program to control spark or flame producing activities that could result in fires or explosions in the processes at our facility.  The KUB Fourth Creek Wastewater Treatment Plant utilizes a Safe Work Permit form designed after the OSHA fire prevention and protection requirements found in 29 CFR 1910.252(a).  Personnel who are to perform the Hot Work are required to complete the form which is reviewed by the area supervisor.  The form must be approved before work can proceed.  Training in the use of the Safe Work Permit form is provided to all affected personnel.\r\n \r\n4.12  Contractors\r\n \r\nThe KUB Fourth Creek Wastewater Treatment Plant established a program to help ensure that contractors who are used to supplement the workforce during periods of increased maintenance or construction conduct their work in a safe manner.  Under the program, the record of all contractors is reviewed to ensure that KUB Fourth Creek Wastewater Treatment Plant hires contractors who can safely perform work on or near covered process equipment.  Our program ensures that contractors:\r\n \r\n* perform their work in a safe manner,\r\n* have the appropriate knowledge and skills,\r\n* are aware of the hazards in the workplace,\r\n* understand what to do in the event of an emergency,\r\n* understand and follow the KUB Fourth Creek Wastewater Treatment Plant's safety rules, and\r\n* inform KUB Fourth Creek Wastewater Treatment Plant personnel of any hazards identified during their work.\r\n \r\nProgram efforts are accomplished by providing contractors with:\r\n \r\n* a process overview,\r\n* information about safety and health hazards,\r\n* emergency response plan requirements, and\r\n* safe work practices prior to beginning work.\r\n \r\n\r\n5"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000028559,
      "SummaryText": "y response procedures.  All KUB Fourth Creek Wastewater Treatment Plant personnel are trained in evacuation procedures.  Drills are conducted periodically to test our evacuation and emergency response procedures.  Annual drills are conducted with local emergency response agencies to ensure emergency plans are properly coordinated. \r\n\r\n\r\n7.0  Planned Changes to Improve Safety\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant continuously strives to improve the safety of our processes through incident investigation, Process Hazard Analysis, and employee suggestions.  Our engineering and technical personnel stay abreast of technology advancements which may improve the safety of our processes.  As a result of these efforts, the KUB Fourth Creek Wastewater Treatment Plant has planned the following changes in our processes to improve safety:"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000028559,
      "SummaryText": ".0  Chemical Specific Prevention Steps\r\n \r\nIndustry standards are followed at the KUB Fourth Creek Wastewater Treatment Plant to help ensure safe handling of chlorine.  The vendor supplies chlorine via a Department of Transportation (DOT) approved truck and in DOT approved 1 ton cylinders.  The chlorination process equipment is designed and constructed with state-of-the-art materials and technology utilizing the standards and guidelines of the Chlorine Institute, American Water Works Association, ASME, ANSI, and other applicable codes.  Workers who perform operations involving chlorine receive training emphasizing safe handling procedures according to the guidelines required by the KUB Fourth Creek Wastewater Treatment Plant. \r\n\r\n\r\n6.0  Emergency Response Programs\r\n \r\nThe KUB Fourth Creek Wastewater Treatment Plant maintains a written emergency response program, which is in place to protect worker and public safety as well as the environment.  The program consists of procedures for responding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released.\r\n  \r\nThe KUB Fourth Creek Wastewater Treatment Plant emergency response program includes procedures for:\r\n \r\n* informing the local LEPC, fire department, and public about accidental releases that could reasonably result in offsite consequences,\r\n* providing proper first aid and emergency treatment for accidental human exposure to hazardous substances,\r\n* evacuation plans and methods for accounting for personnel after an evacuation,\r\n* controlling and containing accidental releases of hazardous substances, including the use of emergency response equipment,\r\n* inspecting and maintaining emergency response equipment,\r\n* post-incident cleanup and decontamination requirements, and\r\n* reviewing and updating the emergency response plan.\r\n\r\nThe KUB Fourth Creek Wastewater Treatment Plant maintains an emergency response team trained in these emergenc"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000028559,
      "SummaryText": "ater Treatment Plant performs and periodically updates process hazard analyses (PHAs) of the Chlorination Process to help identify process hazards and generate recommendations that might improve the safe operation of the process.  Within this program, the Chlorination Process is systematically examined to identify hazards and ensure that adequate controls are in place to manage these hazards.\r\n\r\nTo perform the PHAs, KUB Fourth Creek Wastewater Treatment Plant primarily uses the What-if/Checklist technique.  The PHAs are conducted using a team of people with experience in engineering and Chlorination Process operation and a leader with experience in process hazard analysis techniques. This team identifies and evaluates hazards of the process as well as accident prevention and/or mitigation measures, when appropriate.  The team then prepares a written report describing the results of the analysis, including a list of recommendations ranked according to relative risk ratings assigned by the team.  Responsibility to resolve the recommendations is assigned to the Treatment Plant Operations Supervisor and is tracked through completion.  The final resolution of each finding is documented and retained.\r\n\r\nTo help ensure that the process controls and/or process hazards do not eventually deviate significantly from the original design safety features, the KUB Fourth Creek Wastewater Treatment Plant periodically updates and revalidates the hazard analysis results.  These periodic reviews are conducted at least every 5 years and will be conducted at this frequency until the Chlorination Process is no longer in operation.  The results and findings of these updates are documented and retained.  The team findings are forwarded to the KUB Property Owners Association for consideration, and the final resolution of the findings is documented and retained.\r\n\r\n4.3  Operating Procedures\r\n\r\nKUB Fourth Creek Wastewater Treatment Plant engineers, operators, and supervisors work together to"
    }
  ]
}