{
  "FacilityID": 1000106042,
  "FacilityName": "DRP Gibbstown Logistics Center",
  "FacilityStr1": "200 N Repauno Ave",
  "FacilityStr2": null,
  "FacilityCity": "Gibbstown",
  "FacilityState": "NJ",
  "FacilityZipCode": "08027",
  "Facility4DigitZipExt": "1096",
  "FacilityCountyFIPS": "34015",
  "LEPC": "Gibbstown Emergency Management",
  "FacilityLatDecDegs": "39.840868",
  "FacilityLongDecDegs": "-075.302593",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "IO",
  "LatLongDescription": "OT",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 933571957,
  "ParentCompanyName": "Delaware River Partners LLC",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "Delaware River Partners LLC",
  "OperatorStr1": "200 N Repauno Ave",
  "OperatorStr2": null,
  "OperatorCity": "Gibbstown",
  "OperatorStateFIPS": "NJ",
  "OperatorZipCode": "08027",
  "OperatorZipCodeExt": "1096",
  "FTE": 23,
  "OtherEPAFacilityID": "560309",
  "EPAFacilityID": "100000163093",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-04-11 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": "Gibbstown Facility: EPA Submission (with NO2)",
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-07-10 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-07-10 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-07-10 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-07-10 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.1",
  "FRS_Lat": 39.841111,
  "FRS_Long": -75.2975,
  "FRS_Description": "ADMINISTRATIVE BUILDING",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132387,
      "AltID": "LPG Transloading",
      "FacilityID": 1000106042,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000165843,
          "ProcessID": 1000132387,
          "ChemicalID": 155,
          "Quantity": 61000000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000148398,
              "ProcessChemicalID": 1000165843,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000148399,
              "ProcessChemicalID": 1000165843,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000148400,
              "ProcessChemicalID": 1000165843,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000148401,
              "ProcessChemicalID": 1000165843,
              "ChemicalID": 129
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000133818,
          "ProcessID": 1000132387,
          "NAICSCode": "42471",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000114090,
              "Process_NAICS_ID": 1000133818,
              "SafetyReviewDate": "2023-06-11 00:00:00",
              "PHA_Date": "2023-04-13 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "Yes",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": "LOPA",
              "PHACompletionDate": "2023-07-31 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "No",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Fire Water Exposure Protection System",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "LEL Monitors",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "Yes",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "Yes",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "Yes",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-06-01 00:00:00",
              "TrainingReviewDate": "2023-04-27 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Safety Training at Delaware Valley Safety Council",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2023-01-01 00:00:00",
              "EquipmentInspectionDate": "2023-06-22 00:00:00",
              "EquipmentTested": "Vaporizer",
              "ChangeMgmtDate": "2023-06-14 00:00:00",
              "ChangeMgmtReviewDate": "2023-05-23 00:00:00",
              "PreStartupReviewDate": "2023-06-15 00:00:00",
              "ComplianceAuditDate": "2023-03-28 00:00:00",
              "AuditCompletionDate": "2023-07-31 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2023-03-09 00:00:00",
              "HotWorkPermitReviewDate": "2023-06-08 00:00:00",
              "ContractorSafetyReviewDate": "2023-03-21 00:00:00",
              "ContractorSafetyEvalDate": "2022-09-22 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000143099,
                  "PreventionProgram3ID": 1000114090,
                  "ProcessChemicalID": 1000165843
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106042,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-04-27 00:00:00",
    "ERTrainingDate": "2022-12-13 00:00:00",
    "CoordinatingAgencyName": "Gibbstown VFC",
    "CoordinatingAgencyPhone": "8564236580",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": "NJAC 7:31 NJDEP TCPA Program; 29 CFR 1910.119 OSHA PSM, 40 CFR Part 68 EPA RMP"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106042,
      "SummaryText": ". There have been no recordable incidents at DRP since construction and start up of the facility.\n\nDRP encourages employees to propose changes to increase the safety of the operations and the Facility at large. A project review is the first step to any Management of Change requested at the facility. Improvement to safety systems are considered by a team of DRP Employees during that preliminary review."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106042,
      "SummaryText": "tified annually as accurate and complete by Operations..\n        \u0095\tHazard Review and Offsite Consequence Analysis \u0096 Worst-case and alternative case release scenarios were developed to assess the potential for offsite impact and support the PHA. There are no credible scenarios the have an offsite impact, and offsite receptors as defined in 40 CFR 68.30 and 68.33, are not present in the release distance to the endpoint.\n        \u0095\tPre-startup safety review (PSSR) \u0096 A PSSR was conducted in accordance with the TCPA program requirements before startup of the cavern and is included in the tasks required prior to start up of the major modification to the registered RMP.\n        \u0095\tTraining and Employee Participation \u0096 Hazards have been communicated to all employees and contractors, and training has been conducted on the safe operation of the system. Employees and contractors actively participate in the annual facility emergency response drills. In addition, employees have been trained in the facility emergency action plan and included in the development of the PHA, SOPs, and other procedures.\n        \u0095\tContractor Safety \u0096 Contractors are pre-qualified and subjected to safety assessments.\n        \u0095\tMaintenance and Mechanical Integrity \u0096 The cavern has undergone integrity and pressure testing, and the transloading system has been inspected for quality, specifications and performance during the PSSR prior to start up. Ongoing preventive maintenance and inspections are implemented to ensure ongoing safe operation and preventive maintenance of the facility assets.\n        \u0095\tSafe Work Practices \u0096 Other procedures include Management of Change, Confined Space, Safe and Hot Work Permitting, and annual Compliance Audits. The facility is also subject to site inspection annually or as requested by the NJDEP Bureau of release Prevention.\n        \u0095\tIncident investigation \u0096 All incidents and accidents, including near-misses, will be investigated to improve safety and prevent re- occurrence"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106042,
      "SummaryText": "8) and the OSHA Process Safety Management Standard (29 CFR 1910.119).\n\n4.\tTransportation of LPG into and out of the site by truck or railcar is highly regulated by the US Department of Transportation (DOT). DRP is also a registered member of CHEMTREC, who is a leader in 24 hour Emergency Response and incident management.\n\n5.\tDRP has developed a comprehensive Emergency Action Plan/Emergency Response Plan (EAP/ERP) compliant with USCG, NJDEP, and OSHA regulations. DRP ensures all applicable employees are trained in the provisions of the EAP/ERP initially and refreshed on the plan as required by changes to the content, or annually thereafter. In addition, the site coordinates the plan with the local response agencies annually at minimum and conducts annual emergency preparedness exercise with local and county emergency responders. The local volunteer department is supported by the Gloucester County Department of Emergency Response which includes 911 dispatch, fire and emergency medical services, and a hazardous materials response team. \n\n6.\tIn addition to the design, prevention, and emergency response elements discussed above, the safety management program for existing LPG Transloading Process operation includes the following elements:\n\n        \u0095\tProcess Hazard Analysis (PHA) \u0096 PHA's are conducted on new processes and major modifications. Inherently Safety Technology (IST) reviews and Layers of Protection Analysis (LOPA) are included as part of the PHA review \n        \u0095\tProcess Safety Information \u0096 Safety Reviews of Design are also performed for the design of a new process which include a review of process safety information, process flow diagrams, Piping & Instrumentation Diagrams (P&IDs), and other details for the safe design, construction, and operation of the system.\n        \u0095\tStandard Operating Procedures (SOPs) \u0096 SOPs have been developed based on the engineering design. The SOPs are updated and implemented prior to start-up of the system, and are reviewed and cer"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106042,
      "SummaryText": "l major modification was initiated which includes the installation of six aboveground horizontal LPG storage vessels. The increased inventory reported in this submission (7/2023) reflects the inventory from these additional storage units.\n\nThe above major changes were constructed according to recommended industry specifications and operation under the jurisdiction of the USCG (as applicable). These changes were covered under major MOCs and all subsequent process safety information, including process hazard analyses (PHAs), Inherently safer technology (IST) reviews, and Pre-startup Safety Reviews (PSSRs) were performed.\n\nLPG is a flammable substance and can be present as a liquid or a vapor (gas). The DRP transloading facility is designed in accordance with modern safety standards. The design, construction and operation includes all applicable codes and standards and industry best practices to prevent impact to human health and the environment.\n\n1.\tThe LPG Transloading Process has been designed and constructed in accordance with current industry safety standards including:\n        \u0095\tNational Fire Protection Association (NFPA)\n        \u0095\tInternational Code Council (ICC), which includes International Fire Code (IFC)\n        \u0095\tAmerican Petroleum Institute (API)\n        \u0095\tAmerican Society of Mechanical Engineers (ASME)\n\n2.\tThe LPG Transloading Process design includes redundant gas monitors, pressure relief valves, alarms and interlocks to protect the system as well as automatic emergency shut-down systems. In addition, an enclosed flare system has been installed to collect and safely destroy flammable gas in case of an emergency.\n\n3.\tThe LPG Transloading Process is subject to significant safety regulation, including construction approval and oversight by the New Jersey Department of Environmental Protection (NJDEP) Toxic Catastrophe Prevention Act (TCPA). The TCPA program incorporates (and is more stringent than) the USEPA Chemical Accident Prevention Provisions (40 CFR 6"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106042,
      "SummaryText": "Delaware River Partners LLC (DRP) owns and operates the DRP Gibbstown Logistics Center in Gloucester County, New Jersey. The site was formerly owned by DuPont and operated as an explosives and chemical manufacturing facility from approximately 1890 to 1980. Chemours became the owner of record of the site in April 2015 and DRP acquired the site in June 2016. The site is being redeveloped into a multi-modal deep-water seaport by DRP. The site features an existing underground cavern that was previously mined out of metamorphic rock in approximately 1965. The cavern was previously used by DuPont for the storage of anhydrous ammonia and has been repurposed to store Liquefied Petroleum Gas (LPG).\n\nThe Facility includes extensive LPG storage and distribution capabilities including cavern storage, truck and rail unloading , and truck, rail, and vessel (ship) loading (collectively referred to as the LPG Transloading Process). The LPG operations are located near the Delaware River, at the north of the site and about one mile from the site entrance. The Facility was developed and expanded in stages. Initially, the Facility included cavern storage in one cavern along with rail and truck receipt and distribution. The cavern was refurbished to receive, store, and distribute Liquefied Petroleum Gas (LPG). The cavern is located between 340 and 370 feet below the ground surface and has a working storage capacity of approximately 6.6 million gallons (890,000 cubic feet). The cavern and loading/unloading facilities were approved by the NJDEP for operation under the TCPA Risk Management Program.\n\nA major modification to this approved RMP took place in 2021 to enable for expanded operations. This expansion included a change of the covered chemical from butane to flammable mixture, installation of an additional rail car rack, connection to the dock to allow vessel (ship) loading, truck transloading operations (landside), and the addition of a deep water port. Subsequently, an additiona"
    }
  ]
}