{
  "FacilityID": 1000048572,
  "FacilityName": "City of Kingsland Wastewater Treatment Plant",
  "FacilityStr1": "960 South Grove Blvd.",
  "FacilityStr2": null,
  "FacilityCity": "Kingsland",
  "FacilityState": "GA",
  "FacilityZipCode": "31548",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13039",
  "LEPC": "Kingsland Fire Department",
  "FacilityLatDecDegs": "30.784714",
  "FacilityLongDecDegs": "-81.682225",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Kingsland",
  "OperatorStr1": "960 Grove Blvd.",
  "OperatorStr2": "P.O. Box 250",
  "OperatorCity": "Kingsland",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "31548",
  "OperatorZipCodeExt": null,
  "RMPContact": "Chris Bray",
  "RMPTitle": "Superintendent",
  "FTE": 5,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000209918",
  "OSHA_PSM": 0,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-11-06 00:00:00",
  "SafetyInspectionBy": "Local Government Risk Management Service",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-02-06 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-02-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-02-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-03-14 00:00:00",
  "DeRegistrationEffectiveDate": "2018-03-09 00:00:00",
  "AnniversaryDate": "2020-02-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000060842,
      "AltID": "Chlorination",
      "FacilityID": 1000048572,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000061986,
          "ProcessID": 1000060842,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000074494,
          "ProcessID": 1000060842,
          "ChemicalID": 62,
          "Quantity": 10000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000574494,
          "ProcessID": 1000060842,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000048572,
      "SummaryText": "The City of Kingsland Wastewater Treatment Plant Risk Management Plan is for use with the facilityA?s chlorine injection system.  Chlorine is used at the facility for disinfection of the plant effluent through the use of a chlorinated water solution.  The chlorine is delivered to the facility and is stored in one-ton tanks in gaseous form.  The chlorine gas is then removed from the tanks and ejected into potable water streams through the use of gas safety equipment.\n\n\n\nChlorine gas is very toxic and can cause sickness and even death if inhaled or in contact with exposed skin.  For this reason, a Hazard Prevention Program is part of the every day operation of the chlorine gas system.  While the hazards of chlorine gas are very great, through the use of standard operating procedures as part of the Prevention Program it may be safely used in the critical wastewater disinfection process.  Because the plant effluent is directly into Little Catfish Creek, it is of primary importance to the immediate environment and population that the risk of bacterial infection be removed, and chlorination is the most reliable and effective means of disinfection.\n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:      A major expansion of the City of Kingsland Wastewater Treatment Plant in 2007 occasioned an update of the facility's Risk Management Plan.  Although the basic chlorine gas processing equipment and procedures remained fundamentally the same through the expansion, the equipment was upgraded and the volume of chlorine gas stored was increased.\n\n\n\nThe Municipal Utilities Department of the City, under which the Wastewater Treatment Plant operates has taken care to follow the mandates of the applicable laws, regulations and industry best practices in order to ensure that the employees of the City and the surrounding population remain safe.  The accidental release prevention policy involve an exhaustive, 81 step Hazard Prevention Program Checklist.  The checklist has b"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000048572,
      "SummaryText": "een reviewed and updated to ensure it includes all operating procedures necessary for safe delivery, hook-up, operation, maintenance, detection and disposal of all gas storage equipment.\n\nIn addition to the chlorine gas procedures and policies, the facility also maintains a parallel and integrated program of hazard prevention for Sulfur Dioxide, which is not stored in quantities above the threshold quantity set by EPA for regulation.\n\n\n\nThe checklists and emergency response policies are kept in binders on site, readily available for consultation and reference.\n\n\n\nFACILITY AND REGULATED SUBSTANCES HANDLED:  The facility is under state guidelines for wastewater effluent discharge which limit the pathogens which may be released into the waters of the state.  For this reason, chlorine gas is used to create a chlorine-water solution to disinfect the plant effluent after the treatment process.  \n\n\n\nThe chlorine gas is delivered to the facility in the form of one-ton tanks.  The delivery truck is backed into a garage-type chlorine room where an electronically operated hoist aids the staff in off-loading the tanks.  The tanks are lowered onto four scales which monitor the remaining chlorine in the tanks.  Chlorine gas appurtenances are limited to this chlorine room and an adjacent chlorine control room, where the stable chlorine-water solution is piped to the two chlorine solution diffusers used in the treatment process.\n\n\n\nThe chlorine storage area is open on one side and secured through lockable doors and a lockable chain link fence gate on the open side.  Up to five one-ton chlorine tanks may be stored at the facility at any one time, with four tanks regularly in use.  In addition to chlorine gas, sulfur dioxide gas canisters are also delivered by truck to a separate area A? sulfur dioxide is not stored in quantities above the threshold quantity set by EPA for regulation and as such are not included in the RMP submitted via the CDX reporting system.\n\n\n\nGENERAL ACCIDENTAL"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000048572,
      "SummaryText": " RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS:  The chlorine system Risk Management is broken into two parts: risks associated with the hook-up and removal of the chlorine tanks; and the risks inherent in the everyday operation of the chlorine gas handling equipment.  The risks of the former are managed through the many Hazard Prevention Checklist items included in the Risk Management Binder such as chocking the delivery truck wheels before unloading and inspection of tanks before off loading.  A detailed management plan is also included to protect against the risks of the latter, namely ensuring the safe operation of the chlorine handling equipment.  The chlorine system has its own operations and maintenance procedures (with a copy included in the RMP binder), as does any equipment used at the plant.  The regular, preventive maintenance of all chlorine equipment manages the risks associated with gas leaks associated with failures of the chlorine system appurtenances.\n\n\n\nIn addition, the Hazard Prevention Program checklist also includes leak detection procedures and policies to follow should a leak be detected.\n\n\n\nIt should also be noted that the Kingsland Wastewater Treatment Plant is recently nder new management by the installation of a new superintendent which will ensure the maintenance and training programs are continued for the future operation of the chlorine gas system.\n\n\n\nFIVE YEAR ACCIDENT HISTORY:  There have been no chlorine gas related incidents in the last five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM:  The emergency response for chemical releases from the facility will be handled by the City of Kingsland Fire Department.  A certification to that effect is included in the RMP binder, and the phone number for the Fire Department is posted prominently at the facility.  The Fire Department maintains specific training for its employees for quick response to any possible chemical release at the facility.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000048572,
      "SummaryText": ":  The existing processes and procedures are sufficient and there are no changes planned at this time to improve safety.\n\n"
    }
  ]
}