{
  "FacilityID": 1000045082,
  "FacilityName": "Helena Chemical Company - Burkburnett, TX",
  "FacilityStr1": "2202 South Red River Expressway",
  "FacilityStr2": null,
  "FacilityCity": "Burkburnett",
  "FacilityState": "TX",
  "FacilityZipCode": "76354",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48485",
  "LEPC": "Wichita County LEPC",
  "FacilityLatDecDegs": "34.052810",
  "FacilityLongDecDegs": "-098.559589",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Chemical Company",
  "OperatorStr1": "2202 South Red River Expressway",
  "OperatorStr2": null,
  "OperatorCity": "Burkburnett",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "76354",
  "OperatorZipCodeExt": null,
  "RMPContact": "Donna Lewis",
  "RMPTitle": "Office Manager",
  "FTE": 16,
  "OtherEPAFacilityID": "None",
  "EPAFacilityID": "100000082019",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2016-10-19 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2017-01-11 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-01-11 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2017-01-11 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-01-11 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 34.05575,
  "FRS_Long": -98.55896,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000055813,
      "AltID": "Storage and Handling",
      "FacilityID": 1000045082,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000056754,
          "ProcessID": 1000055813,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000068116,
          "ProcessID": 1000055813,
          "ChemicalID": 56,
          "Quantity": 363779.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000568116,
          "ProcessID": 1000055813,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000077349,
      "AltID": "Fertilizer Blending",
      "FacilityID": 1000045082,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000078535,
          "ProcessID": 1000077349,
          "NAICSCode": "325314",
          "_desc": {
            "NAICS_CODE": "325314",
            "NAICS_DESCRIPTION": "Fertilizer (Mixing Only) Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000096036,
          "ProcessID": 1000077349,
          "ChemicalID": 56,
          "Quantity": 223864.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000596036,
          "ProcessID": 1000077349,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000045082,
      "SummaryText": "EXECUTIVE SUMMARY\n\n\n\nThis Process Safety Management (PSM) and Risk Management Plan (RMP) Program document (PSM/RMPr) was prepared on behalf of Helena Chemical Company (HCC) pursuant to the requirements of the Clean Air Act ? 112(r) as codified by the Occupational Safety and Health Administration (OSHA) at 29 CFR ? 1910.119 and by the U.S. Environmental Protection Agency (EPA) at 40 CFR ?68.  The OSHA PSM and EPA Subpart D RMP standards are applicable to operations at the Burkburnett Facility, Burkburnett, TX.  At this Facility, HCC engages in the formulation, distribution and sale of chemicals (i.e. retail) to customers, most of who use HCC's products to support agricultural operations.  \n\n\n\nThis electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Burkburnett Facility located approximately 2 miles northwest of Burkburnett, TX at 2202 South Red River Expressway, Burkburnett, TX 76354.  The electronic RMP summarizes the policies and procedures implemented by the Burkburnett Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Burkburnett Facility has taken to ensure that a response to a release will be implemented in a proper and timely manner.\n\n\n\nPURPOSE FOR UPDATING RMP\n\n\n\nHCC is submitting this plan as a 5-year update.  All applicable sections of the PSM/RMP have been addressed.  \n\n\n\nFACILITY\n\n\n\nThe Operations at the Burkburnett Facility consists of agricultural chemical storage and handling, blending, retail sale and distribution.  As related to the PSM/RMPr, the Burkburnett Facility stores and handles one covered chemical (anhydrous ammonia) at quantities that exceed the threshold quantity established by EPA.  Two (2) covered processes are operated at this Facility and they include:\n\n\n\no    Covered Process 1: Storage & Handling (Anhydrous Ammonia)\n\no    Covered Process 2: Fertilizer Blending (Ammonium Polyphosphate)\n\n\n\nThe Burkburn"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000045082,
      "SummaryText": "ett Facility receives anhydrous ammonia by commercial tanker truck (9,600-gallon).  The anhydrous ammonia is transferred to one of three (3) stationary storage tanks.  The commercial tanker truck operator (Contractor) performs these transfer operations.\n\n\n\nAt this Facility, anhydrous ammonia is loaded out into the stationary storage tanks for storage.  The Facility either loads out to commercial tanker truck for bulk delivery to other facilities or is loaded out to a mobile pipe reactor (MPR) for the blending of ammonium polyphosphate.  When loading out to commercial tanker truck, trained Facility personnel perform the transfer.\n\n\n\nWhen blending ammonium polyphosphate, the anhydrous ammonia is blended with water and phosphoric acid.  Ammonium polyphosphate is a liquid fertilizer that is used by farmers on a seasonal basis.  Covered process equipment used in this process includes a stationary storage tank for the storage of the anhydrous ammonia and a MPR.  The stationary storage tank is owned by HCC, and the MPR is owned and operated by an Independent Fertilizer Reacting Contractor (IFRC).  When the IFRC arrives to the Facility, the Facility transfers the responsibility of the anhydrous ammonia in the stationary storage tank to the IFRC.  At this point, the IFRC connects the MPR to the stationary storage tank with transfer hoses.  When the IFRC is complete with its operations, the IFRC transfers the responsibility for the anhydrous ammonia in the stationary storage tank back to the Facility.\n\n\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\n\n\nWorst case and alternative case offsite consequence analyses were completed for both the ammonia storage process and the fertilizer blending process.  The worst case release scenario is the same for the both the ammonia storage and the blending process because the largest vessel (i.e. a 48,000-gallon stationary storage tank) is common to both of the covered processes when connected.  The worst case scenario release for the Burkburnett Facility"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000045082,
      "SummaryText": " was modeled as if the 48,000-gallon stationary storage tank was punctured on the side at the ground level and the resulting release being a ground level horizontal jet at the maximum temperature.\n\n\n\nThe alternative (or more likely to occur) scenarios are the same for the two processes.  For the anhydrous ammonia storage and handling covered process, the alternative consequence analysis assumes that a 30-second release from a ruptured 2-inch transfer hose caused by an impact from a vehicle or some other source on the liquid ammonia transfer hose during a loading or unloading operation.  For the fertilizer blending process, the alternative consequence analysis assumes that a 30-second release from a ruptured 2-inch liquid transfer hose is severed during the blending process.  Mitigation equipment involved in this alternative scenario includes excess flow valves and emergency shutoff valves, and operating procedures that the Facility and the IFRC uses to safeguard ammonia transfer operations.\n\n\n\nACCIDENT PREVENTION PROGRAM\n\n\n\nThe Office Manager implements the risk management planning process at this Facility.  The Office Manager is assisted by other Helena staff, as directed.  The Office Manager is responsible for ensuring that Facility Operators are properly trained in the implementation of the Program 3 Accident Prevention Program elements: Management System, Employee Participation, Process Safety Information, Process Hazard Analysis, Operating Procedures, Training, Contractor, Pre-Startup Review, Mechanical Integrity, Hot Work Permit, Management of Change, Incident Investigation, Emergency Response, and Compliance Audits.  \n\n\n\nThe Office Manager is responsible for managing the IFRC in accordance with the Contractor PSM/RMP requirements.  However, the IFRC is responsible for ensuring that its Operators are properly trained in the implementation of its OSHA PSM accident prevention program.\n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nHCC's Burkburnett Facility is a non-respondin"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000045082,
      "SummaryText": "g facility. HCC has coordinated emergency response activities with its local emergency response agency and local fire department.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Burkburnett Facility.\n\n\n\nCONCLUSION\n\n\n\nThe Risk Management Plan implemented by HCC at the Burkburnett Facility complies with the requirements of the Clean Air Act, Section 112(r).  The RMP will be updated as the Burkburnett Facility adds, deletes, or changes processes.  The Emergency Response Program has been coordinated with the Wichita County LEPC and local Fire Department.\n\n\n\nNOTE: Sections 4, 5, and 6 of EPA's RMP Submit Program are not applicable to the Burkburnett Facility.\n\n"
    }
  ]
}