{
  "FacilityID": 1000106203,
  "FacilityName": "Molson Coors USA, LLC - Milwaukee Brewery",
  "FacilityStr1": "4000 West State Street",
  "FacilityStr2": null,
  "FacilityCity": "Milwaukee",
  "FacilityState": "WI",
  "FacilityZipCode": "52308",
  "Facility4DigitZipExt": "3175",
  "FacilityCountyFIPS": "55079",
  "LEPC": "Milwaukee County LEPC",
  "FacilityLatDecDegs": "43.04173",
  "FacilityLongDecDegs": "-87.96333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "UN",
  "LatLongDescription": "UN",
  "FacilityURL": "https://www.molsoncoors.com/",
  "FacilityEmailAddress": "mollie.pape@Molsoncoors.com",
  "FacilityDUNS": 117884654,
  "ParentCompanyName": "Molson Coors Beverage Company",
  "Company2Name": null,
  "CompanyDUNS": 7057342,
  "Company2DUNS": null,
  "OperatorName": "Molson Coors Beverage Company",
  "OperatorStr1": "3939 West Highland Blvd",
  "OperatorStr2": null,
  "OperatorCity": "Milwaukee",
  "OperatorStateFIPS": "WI",
  "OperatorZipCode": "52308",
  "OperatorZipCodeExt": "3175",
  "FTE": 1561,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000135622",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "241007030",
  "SafetyInspectionDate": "2017-03-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2025-01-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-07-20 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-07-20 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-07-20 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 43.04212,
  "FRS_Long": -87.96307,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000132630,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000106203,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000166132,
          "ProcessID": 1000132630,
          "ChemicalID": 56,
          "Quantity": 125000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000134063,
          "ProcessID": 1000132630,
          "NAICSCode": "31212",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000114298,
              "Process_NAICS_ID": 1000134063,
              "SafetyReviewDate": "2022-12-21 00:00:00",
              "PHA_Date": "2022-09-16 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2024-12-31 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "human factors",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "Yes",
              "PC_EmergencyAirSupply": "Yes",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "Yes",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Handheld ammonia meters",
              "CH_ChemicalReduction": "Yes",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2023-04-05 00:00:00",
              "TrainingReviewDate": "2022-06-24 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2022-06-24 00:00:00",
              "EquipmentInspectionDate": "2023-05-30 00:00:00",
              "EquipmentTested": "#14 Evap Condenser",
              "ChangeMgmtDate": "2022-12-19 00:00:00",
              "ChangeMgmtReviewDate": "2022-06-24 00:00:00",
              "PreStartupReviewDate": "2022-02-01 00:00:00",
              "ComplianceAuditDate": "2021-06-03 00:00:00",
              "AuditCompletionDate": "2024-12-31 00:00:00",
              "IncidentInvestigationDate": "2022-01-06 00:00:00",
              "InvestigationChangeDate": "2022-05-25 00:00:00",
              "ParticipationPlansReviewDate": "2022-06-24 00:00:00",
              "HotWorkPermitReviewDate": "2022-06-24 00:00:00",
              "ContractorSafetyReviewDate": "2022-12-31 00:00:00",
              "ContractorSafetyEvalDate": "2022-06-24 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000143317,
                  "PreventionProgram3ID": 1000114298,
                  "ProcessChemicalID": 1000166132
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106203,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-02-16 00:00:00",
    "ERTrainingDate": "2021-12-31 00:00:00",
    "CoordinatingAgencyName": "Milwaukee Fire Department",
    "CoordinatingAgencyPhone": "4142868925",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106203,
      "SummaryText": "Section 112(r) of the Clean Air Act Amendments (CAA) requires EPA to publish regulations and guidance for chemical accident prevention at facilities that use certain hazardous substances. These regulations and guidance are contained in the Risk Management Program (RMP) rule.  The RMP rule requires facilities that use extremely hazardous substances to develop a Risk Management Plan which identifies the potential effects of a chemical accident, identifies steps the facility is taking to prevent an accident, and spells out emergency response procedures should an accident occur. \n\nEPA\u0092s RMP requirements apply to the following covered chemicals at the Milwaukee Brewery:\n\u0095\tAnhydrous Ammonia (CAS No. 7664-41-7) \n\nAnhydrous ammonia is a highly hazardous chemical used as a refrigerant in the brewery refrigeration system.  It is a colorless gas with a pungent, suffocating odor.  Direct skin contact may lead to frostbite and tissue damage. The Milwaukee Brewery currently maintains roughly 75,000 \u0096 115,000 lbs. of anhydrous ammonia in the closed loop refrigeration system that consists of compressors, condensers, evaporators, vessels, and piping.  \n\nRMPs are required to be electronically submitted to the RMP Reporting Center at least once every 5 years or more often if triggered by certain events identified in 40 CFR 68.190 (i.e., updates) or 40 CFR 68.195 (i.e., required corrections).\nAdministrative updates were completed in 2020 and 2021, but the last full resubmission to EPA was completed in August 2018. As an owner/operator of an RMP facility which last completed a full resubmission on August 29, 2018, the Molson Coors USA, LLC \u0096 Milwaukee Brewery (\u0093Milwaukee Brewery\u0094) must fully update and resubmit the RMP no later than August 28, 2023. \n\nThe Milwaukee Brewery is also subject to the Process Safety Management (PSM) regulations under the Occupational Safety and Health Administration (OSHA).  For the most part, the PSM Program is a subset of the EPA\u0092s RMP requirements.  Recogn"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106203,
      "SummaryText": "izing this, for improved implementation and program maintenance efficiency, only one overall program has been implemented which combines both the PSM and RMP requirements.  The overall compliance program is referred to as the Process Safety Management Program. As a result of these complimentary regulations, the Process Safety Management Program includes the following required elements: management system, employee participation, process safety information, process hazard analysis, operating procedures, operator training, contractors, pre-startup safety review, mechanical integrity, hot work permit, management of change, incident investigation, emergency planning and response, compliance audits, trade secrets, hazard assessment, five-year accident history, and risk management plans. \n\nContained herein is a summary of updates included in the 2023 full resubmission of the Milwaukee Brewery Risk Management Plan to the U. S. EPA.\n\nSection 1: Registration Information \nIn this submission, the employee count was updated to include salaried employees at our Corporate Buildings located at 3939 Highland Blvd as part of the larger Milwaukee Campus. \n\nAdditionally, DUNS numbers were updated to accurately reflect the more recent organizational changes: \nMolson Coors Beverage Company (PARENT COMPANY) \u0096 DUNS 00-705-7342 \n250 S. Wacker Drive, Chicago, IL 60606 \n\nMolson Coors USA LLC \u0096 DUNS 11-788-4654\n250 S. Wacker Drive, Chicago, IL 60606 (f/k/a MillerCoors USA Plants: Golden, Fort Worth, Trenton, Milwaukee, Miller Valley Brewery, Milwaukee Technical Center, Chippewa Falls Point and 10th Street)\n\nOther points of contact updated to reflect Corporate Communications (Both US and Canada): Josh Noel, josh.noel@Molsoncoors.com, Phone number 312-496-5669.\n\nSections 2 \u0096 5: Worst Case and Alternate Release Scenarios \nThe Milwaukee Brewery is required to review and update the Offsite Consequence Analysis (OCA) at least once every five years pursuant to 40 CFR 68.36. The Milwaukee Brewery upda"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106203,
      "SummaryText": "ted the OCA on June 8, 2023 (2023 Off-Site Consequence Analysis Molson Coors Milwaukee, HCG Associates). The review and update did not result in major changes to the scenarios or distance-to-endpoints. Plume information from each scenario was entered into the Missouri Census Data Center\u0092s Census Area Profiles (CAPs) American Community Survey (ACS), which was last updated in December 2022 with 2017-2021 ACS data. \n\nSection 6: Accident History\nA review of the 5-year accident history was conducted for the Milwaukee Brewery. No accidental releases have occurred over the past five years from a covered process and resulted in deaths, injuries, or significant property damage on site or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage. \n\nSections 7 \u0096 8: Prevention Program \nFor Program 3 processes, Molson Coors must verify completion of any recurring prevention program implementation requirements. The regulations require several aspects of your prevention program to be periodically implemented or reviewed. \n\n\u0095\tMolson Coors must update and revalidate the process hazard analysis (PHA) at least once every 5 years (40 CFR §68.67) to assure that the PHA is consistent with the current process. This update and revalidation must be conducted by a team.\no\tThe most recent Process Hazards Analysis was conducted in September 2022. This Process Hazard Analysis (PHA) was performed using the What If/Checklist methodology. Audit action items are being tracked for completion with an estimated completion date for all items by the end of 2024. \n\n\u0095\tPursuant to CFR §§68.54 and 68.71, Molson Coors is required to provide refresher training in operating procedures at least every three years, and more often if necessary. \no\tRefresher training held on August 12, 2020, by Bassett Mechanical. Testing was conducted following completion of refresher training to verify employee understanding. \n\n\u0095\tPer 40 CFR §§68.58 and 68.79, Molson Coors is requir"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106203,
      "SummaryText": "ed to audit procedures and practices for compliance with the regulations at least every three years to verify their adequacy and implementation. \no\tThe most recent compliance audit of the program was conducted by HCG Associates, LLC on site on March 16-18, 2021, and June 3, 2021. The final audit results were transmitted on June 30, 2021, and action item tracking is ongoing with estimated completion by 12/31/24. \n\n\u0095\tPer 40 CFR §68.56, Molson Coors is required to inspect and test your process equipment according to the schedule that you have established based on good engineering practices. \no\tEquipment is inspected and tested according to good engineering practices. The most recently inspected/tested equipment was the #14 Evaporator Condenser (WO 81577388).\n\n\u0095\tPer 40 CFR §68.89, Molson Coors is required to certify annually that your operating procedures are current and accurate. \no\tThe annual review is ongoing with the most recent dates of review being 04/3/23 and 6/28/23. Annual reviews are certified by the PSM coordinator and are tracked in the Milwaukee NH3 SOP INDEX document beginning in 2019 through current. \n\n\u0095\tPer 40 CFR §68.7, For Program 3 processes only, if changes are made to the process other than \u0093replacements in kind\u0094, Molson Coors is required to update the process safety information and any procedures affected by the change.\no\tThe management of change process has been completed for 15 changes since 2019, including updates to process safety information and procedures affected by the change. \n\nSection 9: Emergency Response \nMolson Coors is required to periodically review and update, as appropriate, the emergency response program and to notify employees of any changes to the emergency response plan (40 CFR §68.95). \n\nThe emergency response plan for the Milwaukee Brewery contains procedures for fire/smoke, explosion, confined space rescue, severe weather, medical incident, chemical spill/leaks, utilities emergency, workplace violence, and bomb threat.  The"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000106203,
      "SummaryText": "ERP also includes facility specific information (site maps/drawings, security, communication system, emergency organization), emergency/spill prevention, post emergency procedures, training summary, and administrative management of change.  The emergency response plan for the facility is submitted each year to the Milwaukee County Local Emergency Planning Committee (LEPC) through the Wisconsin Hazmat Online Planning and Reporting System (WHOPRS) with the annual chemical inventory submittal.  The plan was most recently updated in February 2023 and was distributed to all employees as well as posted on the Molson Coors Milwaukee Brewery SharePoint. \n\nThe facility's emergency response program related to ammonia processes consists of the following core elements; 24-hour monitoring by ammonia refrigeration specialists, stationary ammonia detection devices, hazard communication training for all employees on anhydrous ammonia, an emergency response plan, ammonia response drawings, and coordination with local authorities and emergency response units.  \n\nAt the end of 2023, exercise plans and schedules will be incorporated into this section per the RMP Reconsideration Rule requirements\n\nJanuary 2025 Facility Site Contact updated from Lauren Hill to Jennifer Pulsifer; Other point of contact updated from Josh Noel to Mollie Pape"
    }
  ]
}