{
  "FacilityID": 1000106840,
  "FacilityName": "DEMICKS LAKE GAS PLANT",
  "FacilityStr1": "11242 - 33rd Street NW",
  "FacilityStr2": null,
  "FacilityCity": "Keene",
  "FacilityState": "ND",
  "FacilityZipCode": "58847",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "38053",
  "LEPC": "Mckenzie County LEPC",
  "FacilityLatDecDegs": "47.89",
  "FacilityLongDecDegs": "-102.993611",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "AB",
  "FacilityURL": "ONEOK.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "ONEOK, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7907827,
  "Company2DUNS": null,
  "OperatorName": "ONEOK Rockies Midstream, L.L.C.",
  "OperatorStr1": "100 West 5th Street",
  "OperatorStr2": "(Corporate)",
  "OperatorCity": "Tulsa",
  "OperatorStateFIPS": "OK",
  "OperatorZipCode": "74103",
  "OperatorZipCodeExt": "4298",
  "FTE": 35,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000242695",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "PTC 18012",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "Never had one",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-08-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-08-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-08-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-08-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R04",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000133510,
      "AltID": "Demicks Lake Gas Plant",
      "FacilityID": 1000106840,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000167298,
          "ProcessID": 1000133510,
          "ChemicalID": 98,
          "Quantity": 350000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000167312,
          "ProcessID": 1000133510,
          "ChemicalID": 155,
          "Quantity": 4700000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000150210,
              "ProcessChemicalID": 1000167312,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000150211,
              "ProcessChemicalID": 1000167312,
              "ChemicalID": 93
            },
            {
              "FlamMixChemID": 1000150212,
              "ProcessChemicalID": 1000167312,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 1000150213,
              "ProcessChemicalID": 1000167312,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 1000150214,
              "ProcessChemicalID": 1000167312,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000150215,
              "ProcessChemicalID": 1000167312,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 1000150216,
              "ProcessChemicalID": 1000167312,
              "ChemicalID": 107
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000134964,
          "ProcessID": 1000133510,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000106840,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2023-01-20 00:00:00",
    "ERTrainingDate": "2022-11-02 00:00:00",
    "CoordinatingAgencyName": "McKenzie County LEPC",
    "CoordinatingAgencyPhone": "7014447483",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000106840,
      "SummaryText": "ONEOK Rockies Midstream, L.L.C. (ORM)\nDEMICKS LAKE GAS PLANT\n\n\nACCIDENTAL RELEASE PREVENTION AND RESPONSE POLICIES\n\nThe Demicks Lake Gas Plant (Facility/Plant) has a commitment to worker and public safety. This\ncommitment is demonstrated by the resources invested in accident prevention, such as training personnel and considering safety in the design, installation, operation, and maintenance of our processes. Our policy is to implement reasonable controls to prevent foreseeable releases of regulated substances. However, if a release does occur, trained personnel will respond to control and contain the release. ONEOK Rockies Midstream, LLC (ORM) believes in maintaining a safe working environment for all employees. Our equipment and personnel reflect this belief, and our prime objective is to ensure the personal safety of every employee on the job-site and to safe guard company property through preventative measures. Employees of ORM are expected to be familiar with all company safety policies. Through continuing education, in-house training and management support, we will provide a safe and professional working environment for our employees as well as those whose lives and safety have been entrusted to us.\n\nDESCRIPTION OF THE STATIONARY SOURCE AND REGULATED SUBSTANCES\n\nThe Demicks Lake Gas Plant, located near Keene, North Dakota is a three train ) 600 MMscfd gas processing plant using mechanical refrigeration, cryogenic extraction and fractionation to process wellhead gas into marketable natural gas and natural gas liquids (NGLs). As a result of this operation, several EPA regulated flammable substances are processed, recovered, and stored at the facility (e.g., methane, ethane, propane, isobutane, butane, isopentane, pentane, and gas condensate). The Demicks Lake Gas Plant does not use or store any regulated toxic substances above the EPA set threshold levels.\n\nGENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM\n\nThe Demicks Lake Gas Plant is regulated by the Environmental"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000106840,
      "SummaryText": "Protection Agency's (EPA's) risk management program regulation and also subject to the Occupational Safety and Health Administration (OSHA) process safety management (PSM) standard.\n\nCHEMICAL-SPECIFIC PREVENTION STEPS\n\nThe processes at the Demicks Lake Gas Plant have hazards that must be managed to ensure continued safe operation. The following is a description of existing safety features applicable to prevention of accidental releases of regulated substances in the facility.\n\nUniversal Prevention Activities\n\nThe accidental release prevention program summarized previously is applied to all RMP-covered processes at the Demicks Lake Gas Plant. Collectively, these prevention program activities help prevent potential accident scenarios that could be caused by equipment failures and human errors. Specialized Safety Features\n\nThe Demicks Lake Gas Plant has safety features on many units to help (1) contain/control a release, (2) quickly detect a release, and (3) reduce the consequences of (mitigate) a release. The following types of safety features are used in the covered processes:\n\nRelease Detection\n\u0095\tDaily Operator Inspection\n\u0095\tMonthly Valve, Seal, and Flange Inspections \n\u0095\tTanks/vessels are equipped with level and pressure sensors\n\u0095\tHigh/Low alarms and shutdowns\n\u0095\tFacility is staffed 24-hours a day, 7-days a week\n\nRelease Containment/Control\n\u0095\tProcess Relief Valves that prevent vessel over pressurization\n\u0095\tValves to Permit Isolation of the Process (manual and automated)\n\u0095\tAutomated Shutdown Systems for Specific Process Parameters (e.g., high temperature)\n\u0095\tCurbing or Diking to Contain Liquid Releases\n\u0095\tRedundant Equipment and Instrumentation (e.g., emergency power supply, backup pumps, etc.)\n\nRelease Mitigation\n\u0095\tTrained emergency response personnel (HAZWOPER, fire response)\n\u0095\tPersonal Protective Equipment (e.g., hard hat, safety glasses, protective clothing, FR clothing, etc.).\n\nFIVE-YEAR ACCIDENT HISTORY\n\nThe Demicks Lake Plant experienced no RMP reportable accident"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000106840,
      "SummaryText": "s in the past 5 years. Releases from a covered process involving a regulated substance held above its threshold quantity in the process that did occur at the facility, were quickly contained and resulted in no deaths, injuries, significant property damage, environmental damage, evacuations, or sheltering in place.\n\nEMERGENCY RESPONSE PROGRAM INFORMATION\n\nThe Demicks Lake Gas Plant maintains a written emergency action response plan (EARP), which is in place to protect worker and public safety as well as the environment. The plan consists of procedures for\nresponding to a release of a regulated substance, including the possibility of a fire or explosion if a flammable substance is accidentally released. The procedures address or reference all aspects of emergency response, including proper first aid and medical treatment for exposures, evacuation plans and accounting for personnel after an evacuation, notification of local emergency response agencies and the public if a release occurs, and post incident cleanup and decontamination requirements. \n\nIn addition, the Plant has procedures that address maintenance, inspection, and testing of emergency response. Employees receive training in these procedures as necessary to perform their specific emergency response duties, and participate in annual plant emergency drills to ensure emergency shutdown system (ESD) integrity and reinforce proper employee response. The EARP is updated when necessary based on modifications made to gas plant process or other ONEOK Rockies Midstream facilities. The EARP program changes are administered through the MOC process, which includes informing and/or training affected personnel in the changes. The overall emergency response plan for the Demicks Lake Gas Plant is coordinated with the McKenzie County Local Emergency Planning Committee (LEPC) which is responsible for preparing the community emergency response plan. The local responders for plant emergencies are the Watford Fire Department and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000106840,
      "SummaryText": "the McKenzie County Sheriff Department. The Demicks Lake Gas Plant has around-the-clock communications capability with appropriate LEPC officials and emergency response organizations (e.g., fire department, sheriff office). This provides a means of notifying the public of an incident, if necessary, as well as facilitating quick response to an incident.\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\nThe Demicks Lake Gas Plant resolves all findings from PHAs. Safety training will be continued\nfor all employees."
    }
  ]
}