{
  "FacilityID": 1000094686,
  "FacilityName": "Audubon Metals Texas LLC",
  "FacilityStr1": "5200 East State Highway 31",
  "FacilityStr2": null,
  "FacilityCity": "Corsicana",
  "FacilityState": "TX",
  "FacilityZipCode": "75109",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48349",
  "LEPC": "Navarro County LEPC",
  "FacilityLatDecDegs": "32.097147",
  "FacilityLongDecDegs": "-96.393822",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "GO",
  "LatLongDescription": "CE",
  "FacilityURL": "www.audubonmetals.com",
  "FacilityEmailAddress": "wjb@AudubonMet.com",
  "FacilityDUNS": 117702963,
  "ParentCompanyName": "Audubon Metals LLC",
  "Company2Name": "Audubon Metals LLC",
  "CompanyDUNS": 956665970,
  "Company2DUNS": null,
  "OperatorName": "Audubon Metals Texas LLC",
  "OperatorStr1": "5200 East State Highway 31",
  "OperatorStr2": null,
  "OperatorCity": "Corsicana",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75109",
  "OperatorZipCodeExt": null,
  "FTE": 100,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000247075",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "158434",
  "SafetyInspectionDate": null,
  "SafetyInspectionBy": "new facility",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "Yes",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2022-01-23 17:43:34",
  "ErrorReportDate": null,
  "ReceiptDate": "2022-01-23 17:43:34",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2022-01-23 17:43:34",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2027-01-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000117555,
      "AltID": "Demag Process",
      "FacilityID": 1000094686,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000147026,
          "ProcessID": 1000117555,
          "ChemicalID": 62,
          "Quantity": 24000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000118908,
          "ProcessID": 1000117555,
          "NAICSCode": "331314",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000100581,
              "Process_NAICS_ID": 1000118908,
              "SafetyReviewDate": "2021-07-07 00:00:00",
              "PHA_Date": "2021-07-07 00:00:00",
              "PHA_WhatIf": "Yes",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "Yes",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2021-07-07 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "No",
              "MH_OtherType": "cylinder handling",
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "Yes",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "Yes",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "Yes",
              "MD_None": "No",
              "MD_OtherType": "Area video surveilance",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "New Facility",
              "OpProceduresReviewDate": "2021-08-17 00:00:00",
              "TrainingReviewDate": "2021-07-07 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2021-08-17 00:00:00",
              "EquipmentInspectionDate": "2021-08-17 00:00:00",
              "EquipmentTested": "Chlorine system, auto shut-off valves, evacuation alarms",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2021-08-17 00:00:00",
              "PreStartupReviewDate": "2021-07-07 00:00:00",
              "ComplianceAuditDate": "2021-08-17 00:00:00",
              "AuditCompletionDate": "2021-08-17 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2021-08-17 00:00:00",
              "HotWorkPermitReviewDate": "2017-02-17 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2021-08-17 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000126219,
                  "PreventionProgram3ID": 1000100581,
                  "ProcessChemicalID": 1000147026
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000094686,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2021-07-07 00:00:00",
    "ERTrainingDate": "2021-10-21 00:00:00",
    "CoordinatingAgencyName": "Corsicana Fire Department",
    "CoordinatingAgencyPhone": "9036544956",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 1,
      "FacilityID": 1000094686,
      "SummaryText": "lten metal through a proprietary German technology using a submerged graphite recirculation pump that not only recirculates the molten metal within the multi-chambered furnace for heat transfer purposes but also causes intimate mixing of the gas with the metal without bubbling (as in conventional technology).  As a result of this mixing, nearly stoichiometric utilization of chlorine occurs, with virtually no residual chlorine emissions. The impurities float to the molten metal surface as dross consisting of metallic chloride salts.  The dross is periodically removed by skimming the surface.  After cooling, it is shipped for offsite processing and disposal.  The refined molten aluminum metal is casted into ingots for direct shipment to aluminum die casting customers. \r\nThe design of the facility results in excellent control of air and water pollution.  There is no discharge of waste water from the facility except for sanitary sewage wastewater from employee comfort facilities.  The wet processing of scrap inherently eliminates dust emission potential from raw material handling and processing.  Further, all furnace gases are ducted to a dry scrubber system using slaked lime (calcium hydroxide) injection for efficiently removing chlorine and other gaseous pollutants.  This is followed by a high efficiency fabric filter baghouse for the collection of particulate dust.  The aluminum dryer unit is equipped with an afterburner for control of smoke followed by a slaked lime injected dry scrubber pollution control system for cleaning the exhaust gases and particulates.\r\nThe chlorine used for the refining (demag) process is stored in one ton cylinders in a dedicated Chlorine Building at the west side of the main building.  The chlorine liquid is vaporized and piped overhead to the demag well of the furnace, with various monitoring and safety devices incorporated to ensure automatic and manual shutoff of chlorine gas as well as appropriate alarms in the control room.  The cont"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000094686,
      "SummaryText": "rol rooms are manned by the Furnace Production Supervisor and trained operators.  Approximately twelve (12) cylinders, containing 2,000 pounds of chlorine each, may be stored in the Chlorine Building at any time.  Each cylinder is open online to facilitate operation of the smelter/converter furnace.  Empty cylinders are also stored in the Chlorine Building as is a cylinder repair kit.  Emergency response equipment is located in on the southeast side of the main building for use by trained personnel pending on wind direction. A purge system, using inert nitrogen gas from a bulk liquid nitrogen storage tank located outside the Chlorine Building, is provided for purging the chlorine lines prior to switching cylinders and for emptying all chlorine gas from lines so as to allow safe maintenance or system shutdown.\r\nBased on the quantity of chlorine in storage, Audubon is required to comply with the Clean Air Act Section 112(r) chemical accident prevention and response requirements.  The applicable regulations are promulgated in Title 40 Code of Federal Regulations (CFR) 68 requiring preparation and implementation of a Risk Management Plan (RMP).  \r\nAs part of the prevention program necessitated by the storage of chlorine and the above hazard assessment results, Audubon has undertaken steps to minimize the potential for a release.  The chlorine piping in the facility is labelled.  Only qualified contractors are allowed to make changes to the system if and when required, after review with the design engineers of the material specifications, needed precautions, leak checks and annual system integrity inspection procedures prior to startup.  Hot work on the chlorine system is prohibited and only trained Maintenance personnel allowed to change cylinders and inspect and maintain the system according to internal work instructions and procedures.  A nitrogen purge system is provided for safely clearing the lines with the inert gas.  A continuous chlorine detector with alarm and"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000094686,
      "SummaryText": "installation of all system components in accordance with Chlorine Institute guidelines and material specifications ensures that all steps are being taken to maintain the mechanical integrity of the system and minimize the potential for an accidental release.\r\nThe chlorine cylinder supplier is DPC Industries, Inc. located in Dallas, Texas.  DPC not only provides delivery and empty cylinder pickup utilizing their specially equipped truck but also offers a 24-hour chlorine release response team.  The Audubon facility has made arrangements with DPC Industries for emergency assistance by the trained response team in case of need.  In addition, Audubon has prepared and implemented a plant emergency plan to ensure suitable response to a chlorine release emergency and will be coordinating response plans with local emergency responders and Local Emergency Planning Committee requirements.  \r\nOSHA required Emergency Response and Incident Commander training courses are held at least annually for the 24-hour coverage of the onsite responders.  Actions taken under the RMP prevention program are likely to further minimize the potential for a contingency requiring a response."
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000094686,
      "SummaryText": "The Audubon Metals Texas LLC (AMT) facility is located at 5200 East State Highway 31 in Corsicana, Texas.  The facility is designed to recycle aluminum from shredded non-ferrous scrap metal using a wet heavy media separation process.  This is followed by secondary smelting of the reclaimed aluminum to produce alloyed aluminum.  AMT operates approximately 50 weeks per year and has 24/7 response trained personnel onsite as well as manned security surveillance.\r\nThe Audubon facility receives shredded non-ferrous scrap metal by rail and truck.  After quality control checks, the shipments are unloaded in a roofed bay with a concrete floor and prepared for separation of aluminum metal.  The received aluminum scrap contains other metallic scrap such as zinc, copper, stainless steel and magnesium alloys as well as traces of glass, plastic, rubber and dirt from shredding of automobiles and other scrap by offsite metal recycling facilities.  The aluminum is separated from the non-ferrous mix by use of a wet heavy media floatation process located within the plant building.  The aluminum is segregated from the other materials in stages, utilizing inherent specific gravity differences in a wet media environment.  The separated aluminum scrap is washed and dried in preparation for smelting while the other residual metals are sold to other offsite metal recyclers.  Wastes consisting of glass, plastic, dirt and rubber are accumulated in roll off boxes and shipped for disposal in a permitted solid waste landfill.\r\nThe aluminum scrap is smelted in a 225,000 pound natural gas-fired smelter/converter furnace which combine the melting with converting, using a proprietary refining process for removal of traces of magnesium and other impurities in the melt.  A metallurgy laboratory analyzes the in-process materials and guides the refining process to meet customer specifications.   Various alloying materials such as ferrosilicon, copper, etc. are added and chlorine gas injected into the mo"
    }
  ]
}