{
  "FacilityID": 1000022118,
  "FacilityName": "Sweetwater Creek Gas Plant",
  "FacilityStr1": "322 Private Rd. 4520",
  "FacilityStr2": null,
  "FacilityCity": "Decatur",
  "FacilityState": "TX",
  "FacilityZipCode": "76234",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "48497",
  "LEPC": "Wise County LEPC",
  "FacilityLatDecDegs": "33.171030",
  "FacilityLongDecDegs": "-097.398110",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.jwenergy.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "J-W Pipeline Company",
  "Company2Name": "J-W Energy Company",
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "J-W Pipeline Company",
  "OperatorStr1": "P.O. Box 226406",
  "OperatorStr2": null,
  "OperatorCity": "Dallas",
  "OperatorStateFIPS": "TX",
  "OperatorZipCode": "75222",
  "OperatorZipCodeExt": "6406",
  "FTE": 2,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000171253",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-03-21 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-06-09 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-05-06 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-05-06 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-05-06 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 33.17222,
  "FRS_Long": -97.4,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "001",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000026906,
      "AltID": "Cryogenic Gas Plant",
      "FacilityID": 1000022118,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000031930,
          "ProcessID": 1000026906,
          "ChemicalID": 155,
          "Quantity": 1080000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 105086,
              "ProcessChemicalID": 1000031930,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 105087,
              "ProcessChemicalID": 1000031930,
              "ChemicalID": 94
            },
            {
              "FlamMixChemID": 105088,
              "ProcessChemicalID": 1000031930,
              "ChemicalID": 115
            },
            {
              "FlamMixChemID": 105089,
              "ProcessChemicalID": 1000031930,
              "ChemicalID": 125
            },
            {
              "FlamMixChemID": 105090,
              "ProcessChemicalID": 1000031930,
              "ChemicalID": 98
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000027209,
          "ProcessID": 1000026906,
          "NAICSCode": "211112",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000023098,
              "Process_NAICS_ID": 1000027209,
              "SafetyReviewDate": "2011-03-21 00:00:00",
              "PHA_Date": "2009-09-02 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2011-09-02 00:00:00",
              "MH_ToxicRelease": 0,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 0,
              "MH_Earthquake": 0,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 0,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 1,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2011-05-02 00:00:00",
              "TrainingReviewDate": "2011-05-02 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 0,
              "CT_Demonstration": 0,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2010-04-16 00:00:00",
              "EquipmentInspectionDate": "2010-10-20 00:00:00",
              "EquipmentTested": "Pressure Safety Valves",
              "ChangeMgmtDate": "2009-09-02 00:00:00",
              "ChangeMgmtReviewDate": "2011-05-02 00:00:00",
              "PreStartupReviewDate": "2010-04-16 00:00:00",
              "ComplianceAuditDate": "2011-02-10 00:00:00",
              "AuditCompletionDate": "2012-02-10 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2010-04-16 00:00:00",
              "HotWorkPermitReviewDate": "2010-04-16 00:00:00",
              "ContractorSafetyReviewDate": "2011-05-02 00:00:00",
              "ContractorSafetyEvalDate": "2011-03-21 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000027262,
                  "PreventionProgram3ID": 1000023098,
                  "ProcessChemicalID": 1000031930
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000022118,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2011-01-27 00:00:00",
    "ERTrainingDate": "2011-01-11 00:00:00",
    "CoordinatingAgencyName": "Decature Fire Department",
    "CoordinatingAgencyPhone": "9406273333",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000022118,
      "SummaryText": "Executive Summary AA? Risk Management Plan\nJ-W Pipeline Company, Sweetwater Creek Plant\n\n1.    Executive Summary (40 CFR 68.155)\n\nThe Executive Summary is a brief description of the Risk Management Plan (RMP).  J-W Pipeline Company will submit the Executive Summary to a central point as specified by the Environmental Protection Agency. \n\n    1.1 Accidental Release Prevention and Emergency Response Policies (40 CFR             68.155(a)) \n\nJ-W Pipeline Company's accidental release prevention policy involves a unified approach that integrates procedures and management practices.  Applicable procedures of the U.S. Environmental Protection Agency (EPA) Prevention Program are adhered to.  J-W Pipeline Company's emergency response policy involves the preparation of response plans that are tailored to the facility and to the emergency response services available in the community, and complies with the EPA Emergency Response Program requirements.\n\nJ-W Pipeline Company's spill policy seeks to implement appropriate controls to prevent accidental releases of regulated substances.  If such a release does occur, the Facility personnel are prepared to work with the local fire department, Local Emergency Planning Commission, and other authorities to control and mitigate the effects of the release. \n\n    1.2 Stationary Source and Regulated Substance Handled (40 CFR 68.155(b))\n\nThe primary activity at J-W Pipeline's Sweetwater Creek Facility, herein referenced as the stationary source and the Facility, is the handling and storage of natural gas liquids (NGL).  As part of the facility operation, natural gas liquids (NGL) are stored on site, and sold to a petroleum refiner.  The flammable regulated chemical mixture at the Facility is Natural Gas Liquid (NGL) that is an aliphatic and aromatic hydrocarbon mixture.  The flammable regulated chemicals contained in the mixture include ethane, propane, isobutene, N-butane, isopentane and N-pentane.  These regulated flammable chemicals have a regulated thresho"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000022118,
      "SummaryText": "ld quantity of 10,000 pounds (lbs.).  The maximum inventory of NGL is four 60,000-gallon bulk storage tanks, which contains an average 270,000 lbs. of regulated flammable chemicals each.\n\n    1.3 Worst Case Scenario and Alternative Release Scenario (40 CFR 68.155)) \n\nMethodology given in the RMP Offsite Consequence Analysis Guidance by the EPA was applied using the RMP-COMP model approach to perform worst-case release scenario (WCRS) and alternative release scenario (ARS).\n\nThe WCRS submitted for Program 3 flammable substances assumed the release was the total quantity of one 60,000-gallon bulk storage tank which forms a vapor cloud within the lower and upper flammability limits, and the cloud detonates.  For flammable substances, the endpoint is overpressure of 1 pound per square inch (psi) for vapor cloud explosions. \n\nUsing the flammable endpoint of 1-psi overpressure the distance to the endpoint indicated that the Facility has offsite consequences from the WCRS.  \n\nAfter considering possible ARSs, a release involving a pool fire of the NFL condensate from a failure of a 2-inch steel pipe connected to the NGL bulk storage tank was selected as the most probable.  The ARS distance to endpoint for the above-described release was calculated at 0.1 miles from the facility.  \n\nUsing the flammable endpoint (lower flamability limit) the distance to the endpoint indicated that the Facility has no offsite consequences from the ARS.  \n\nA sendary ARS was selcted and involved the activation of a pressure relief valve on the 60,000 lbs storage tank.  The scenario involves the pressure reliefe valve opening and a gas release of 11454 lbs. per minute at 250 psi.  The release was calculted to be for 17 minutes, as the tank would empty in this time.  The distance to endpoint is 0.3 miles from the facility, and there are offsite consequences identified with this ARS.  The secondary ARS, while haveing a larger distance to endpoint, is far less probable than the first, as multiple failu"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000022118,
      "SummaryText": "res would be involved during the unmanned hours of the facility.\n\n    1.4 The General Accidental Release Prevention Program and the Chemical Specific             Prevention Steps (40 CFR 68.155(d))\n\nJ-W Pipeline Company has taken he necessary steps to comply with the accidental release prevention requirements of 40 CFR 68.  This Facility was designed and constructed in accordance with applicable state and federal regulations as listed in the RMP.  The following sections briefly describe the elements of the release prevention program that are in place at the stationary source.  \n\n        1.4.1 Process Safety Information and Hazard Review\n\nJ-W Pipeline Company maintains a written Emergency Response Plan regarding safety information that describes the chemical hazards associated with regulated substances at the Facility.  Further safety information is also detailed in the RMP.  In addition, operating procedures and equipment design codes and standards associated with the operations at the Facility are maintained in the RMP on site.  The Facility conducts Safety inspections to identify and control the hazards associated with the process.  J-W Pipeline Company inspects the bulk storage vessels, pipes, valves, gauges, and pumps on a regular basis.  Any findings related to the hazard analysis are addressed in a timely manner.\n\n        1.4.2 Operating Procedures\n\nFor the purposes of safely conducting activities at the Facility associated with regulated substances, J-W Pipeline Company maintains written operating procedures.  These procedures address various modes of operation such as initial startup, normal operations, emergency shutdown, emergency operations, normal shutdown and startup after an emergency shutdown.  The information is reviewed as needed and is readily accessible to operators involved with the processes.  \n\n        1.4.3. Training\n\nJ-W Pipeline Company has an operator safety-training program in place to train employees involved in the process.  New employees receive basic training in pr"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000022118,
      "SummaryText": "ocess operations followed by on-the-job supervision until they are deemed competent to work independently.  Refresher training is provided annually and more frequently as needed.  In addition, employees not operating the process are involved in safety training on the hazards associated with the regulated substances at the Facility. \n\n        1.4.4. Maintenance Procedures\n\nJ-W Pipeline Company performs maintenance checks on the Facility equipment to ensure proper functions.  Qualified personnel carry out maintenance operations.  Equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner. \n\nWhen outside contractors are required for maintenance and construction activities, those personnel are accompanied by J-W Pipeline Company employees or are briefed by company personnel on the rules, regulations, and emergency procedures outlined in the Emergency Response Plan before initiating work.  \n\n        1.4.5. Compliance Audits\n\nJ-W Pipeline Company conducts audits on a regular basis to determine whether the provisions of the RMP rule are being implemented.  These audits are performed at least every 3 years as required by 40 CFR 68.    Corrective actions required as a result of the audits are undertaken in a safe and prompt manner.  \n\n        1.4.6. Incident Investigation\n\nJ-W Pipeline Company promptly investigates any incident that has resulted in, or could have reasonable resulted in a catastrophic release of a regulated substance.  These investigations are performed to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring.  Reports are retained for a minimum of 5 years.  \n\n    1.5. Five-year Accident History (40 CFR 68.155(e))\n\nThe Facility has never had a reportable accident of covered processes.\n\n    1.6 Emergency Response Program (40 CFR 68.155(f))\n\nThe Facility has an Emergency Response Program.  The Emergency Response Plan describes response procedures to minimize hazards to human h"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000022118,
      "SummaryText": "ealth and the environment in the event of a regulated substance accidental release.  Aspects of emergency response include adequate first aid and medical treatment, evacuations, notifications of local emergency response agencies and the public, as well as post-incident cleanup of affected areas. In the event of a covered process accident, first aid procedures and procedures to inform authorities and the public are described in the Emergency Response Plan.  A general emergency practice drill will be performed at least annually and includes and invitation to the local authorities.  A site map, MSDSs, and a list of chemicals kept on the site are kept at the Facility.  \n\n    1.7 Planned Changes to Improve Safety (40 CFR 68.155(g))\n\nMaintenance checks, compliance audits, management of change procedures and incident investigations will identify changes to improve safety.  J-W Pipeline Company has a continued commitment to update equipment and improve safety regarding the covered process when necessary.\n"
    }
  ]
}