{
  "FacilityID": 1000023781,
  "FacilityName": "Carthage Terminal",
  "FacilityStr1": "18195 County Rd 138, Box 308",
  "FacilityStr2": null,
  "FacilityCity": "Jasper",
  "FacilityState": "MO",
  "FacilityZipCode": "64755",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "29097",
  "LEPC": "Jasper County LEPC",
  "FacilityLatDecDegs": "37.313611",
  "FacilityLongDecDegs": "-094.305000",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "http://www.magellanlp.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Magellan Pipeline Company, L.P.",
  "Company2Name": null,
  "CompanyDUNS": 7187305,
  "Company2DUNS": 0,
  "OperatorName": "Magellan Pipeline Company, L.P.",
  "OperatorStr1": "18195 County Rd 138, Box 308",
  "OperatorStr2": null,
  "OperatorCity": "Jasper",
  "OperatorStateFIPS": "MO",
  "OperatorZipCode": "64755",
  "OperatorZipCodeExt": null,
  "RMPContact": "Dennis Whitfield",
  "RMPTitle": "Area Supervisor",
  "FTE": 4,
  "OtherEPAFacilityID": "MOD084096130",
  "EPAFacilityID": "100000191776",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "OP-2001-014",
  "SafetyInspectionDate": "2010-08-12 00:00:00",
  "SafetyInspectionBy": "MERC",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-11-16 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-11-16 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-11-16 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2016-11-16 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000029028,
      "AltID": "1",
      "FacilityID": 1000023781,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000029311,
          "ProcessID": 1000029028,
          "NAICSCode": "48691",
          "_desc": {
            "NAICS_CODE": "48691",
            "NAICS_DESCRIPTION": "Pipeline Transportation of Refined Petroleum Products"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000034732,
          "ProcessID": 1000029028,
          "ChemicalID": 98,
          "Quantity": 25214572.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 98,
            "ChemicalName": "Propane",
            "CASNumber": "74-98-6",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000034733,
          "ProcessID": 1000029028,
          "ChemicalID": 118,
          "Quantity": 573647.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 118,
            "ChemicalName": "Butane",
            "CASNumber": "106-97-8",
            "Threshold": 10000.0,
            "ChemType": "F",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534732,
          "ProcessID": 1000029028,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000534733,
          "ProcessID": 1000029028,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000023781,
      "SummaryText": "DESCRIPTION OF STATIONARY SOURCE AND REGULATED SUBSTANCES:\n\nThe Carthage Facility is a butane storage/blending and propane storage facility. The facility is located in Carthage, MO. The regulated substances at this facility are butane and propane. The equipment which handles butane includes pressure vessels and associated piping and may contain a maximum of 573,647 lbs. The equipment which handles propane includes a cavern, pressure vessel, and associated piping and may contain a maximum of 25,214,572 lbs.  Both of these numbers are taking into account engineering controls.  \n\n\n\nACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES:\n\nThe Carthage Terminal has a strong commitment to worker and public safety, along with resources\n\ninvested in accident prevention, such as training personnel and contractors in design, installation, operations,\n\nand maintenance procedures. These assets began operating under the name Magellan Pipeline Company, L.L.C. on September 1, 2003.  Magellan Pipeline Company L.L.C. was subsequently changed to Magellan Pipeline Company, L.P. on September 9, 2004.  There have been no reports of a harmful butane or propane release at this station.  If an emergency were to occur, it is our policy to notify the LEPC and request that they respond to the emergency.\n\n\n\nWORST CASE SCENARIO DESCRIPTION\n\nAs discussed in the Risk Management Program Guidance for Offsite Consequence Analysis, the EPA has\n\ndefined the Worst-Case Scenario (WCS) as the release of the largest quantity of a regulated substance from a\n\nsingle vessel or process line failure that results in the greatest distance to an endpoint. At Carthage, the\n\nregulated substance is propane which is a flammable substance. This WCS assumes the entire quantity contained\n\nin the largest vessel or section of piping within the propane system releases to the atmosphere, forms a\n\nvapor cloud, and is subsequently detonated. One (1) pound per square inch overpressure is used as the\n\nendpoint as this is"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000023781,
      "SummaryText": " the threshold for potentially serious injuries to people from flying glass, falling debris, and\n\nother explosion effects.  \n\n\n\nAt Carthage the largest quantity of the covered flammable substance, propane, is the 7,063,014 gallon cavern.  The WCS assumes this vessel in its entirety is released catastrophically to the atmosphere and the vapor cloud formed is ignited and then at some distance from the center of the explosion reaches an endpoint of one (1) PSI overpressure. A total of 27,077,316 lbs is the maximum amount of propane that is stored in the vessel taking into account an administrative control limiting the maximum level of propane in the tank to 84%. Using RMP*Comp to\n\ncalculate the distance to endpoint, a 2.4 mile radius is estimated to be impacted if the worst case type of release occurred at Carthage.\n\n\n\nALTERNATIVE CASE SCENARIO DESPRICTION\n\nFrom the butane process, the alternative case scenario is a release from a pump seal on the blending pump. The seal fails and equates to approximately a 1\" hole. This pump is downstream of the storage vessel and once the seal leak occurs, the pump is automatically shut down by the temperature transmitter located on the pump seal area within 30 seconds. Once the pump is shut down, the driving force is the liquid height of butane stored within the vessel at the time. For this scenario, the assumption is that the season is summer when the tanks are typically full and the liquid has expanded due to warmer weather, so the full height of the tank is used to estimate the release rate. The leak is detected by the hazardous gas detectors at the location and then the nearest technician arrives within 25 minutes. The technician evaluates the situation and puts on the proper PPE and isolates the pump by closing the suction and discharge valves after another 15 minutes have passed resulting in a total release time of 40 minutes.  In this scenario, the release rate is 931 lbs per min for 40 minutes for a total release volume of 3"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000023781,
      "SummaryText": "7,240 lbs.  Using RMP*Comp to calculate the distance to endpoint, a <0.1 mile radius is estimated to be impacted if this  alternative case release occurred at Carthage.\n\n\n\nGENERAL ACCIDENTAL RELEASE PREVENTION AND MAINTENANCE PROGRAM:\n\nThe regulated butane and propane storage/blending process in the facility is compliant with the thirteen (13)\n\nelements of Process Safety Management and other employee training programs, along with operating and\n\nmaintenance procedures. The process controls listed in Section 7.4e were chosen based on whether or not\n\nthey were used as safeguards in the last PHA for this facility. There may be other process controls in this\n\nfacility that were not identified as safeguards in the last PHA. The facility has no \"Trade Secrets\". The facility\n\ncomplies with the Federal and State requirements for leak detection of valves, pumps, and flanges.\n\nInspections are conducted and documented to ensure the integrity of the regulated equipment.\n\n\n\nFIVE-YEAR ACCIDENT HISTORY:\n\nThere has been no accidental release from the butane or propane processes at the Carthage Facility that has required reporting under the RMP rule within the past five years.\n\n\n\nEMERGENCY RESPONSE PROGRAM:\n\nThe facility maintains a written Emergency Response Plan. Within the past five years neither the propane or  butane process has had an accidental release that has caused offsite impacts provided in the RMP rule. In the event of fire or explosion, or a release of a regulated substance from the propane or butane process, entry within the distance to the specified endpoint may pose a danger to public emergency responders. Therefore, emergency\n\nresponders should not enter the area unless directed through the unified or incident command process.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY:\n\nNo changes are currently planned to the butane or propane process. As opportunities for improvement associated with these processes arise at the Carthage Terminal, they will be evaluated by Magellan Pipel"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000023781,
      "SummaryText": "ine Company, L.P.\n\n\n\n"
    }
  ]
}