{
  "FacilityID": 1000062846,
  "FacilityName": "El Centro Generating Station",
  "FacilityStr1": "485 East Villa Road",
  "FacilityStr2": null,
  "FacilityCity": "El Centro",
  "FacilityState": "CA",
  "FacilityZipCode": "92243",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06025",
  "LEPC": "Region VI LEPC",
  "FacilityLatDecDegs": "32.803333",
  "FacilityLongDecDegs": "-115.539722",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "AO",
  "LatLongDescription": "NW",
  "FacilityURL": "www.iid.com",
  "FacilityEmailAddress": "cjbeltran@iid.com",
  "FacilityDUNS": 617628888,
  "ParentCompanyName": "Imperial Irrigation District",
  "Company2Name": null,
  "CompanyDUNS": 806472916,
  "Company2DUNS": 9584624,
  "OperatorName": "Imperial Irrigation District",
  "OperatorStr1": "485 East Villa Road",
  "OperatorStr2": null,
  "OperatorCity": "El Centro",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92243",
  "OperatorZipCodeExt": null,
  "FTE": 50,
  "OtherEPAFacilityID": "CAD980817142",
  "EPAFacilityID": "100000198591",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "V-2152",
  "SafetyInspectionDate": "2017-05-01 00:00:00",
  "SafetyInspectionBy": "Department of Toxic Substances Control",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "Yes",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2017-11-29 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2017-04-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2017-04-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2022-04-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "3.8",
  "FRS_Lat": 32.8022,
  "FRS_Long": -115.54,
  "FRS_Description": null,
  "FRS_Method": "UNKNOWN",
  "HorizontalAccMeasure": "1.5",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000078777,
      "AltID": "SCR",
      "FacilityID": 1000062846,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000098144,
          "ProcessID": 1000078777,
          "ChemicalID": 56,
          "Quantity": 60000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000079959,
          "ProcessID": 1000078777,
          "NAICSCode": "22111",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000066204,
              "Process_NAICS_ID": 1000079959,
              "SafetyReviewDate": "2017-05-22 00:00:00",
              "PHA_Date": "2017-05-26 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "No",
              "PHA_HAZOP": "Yes",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2017-12-01 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "No",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": "Human Error",
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Sensors and Controller",
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "Yes",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": "Secodnary Containment",
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Tank and Pipeline Sensors and Local and Central Alarms",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "Yes",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Replacement of Ammonia Tank Sensors and Controller and addition of monitoring equipment",
              "OpProceduresReviewDate": "2017-07-22 00:00:00",
              "TrainingReviewDate": "2017-06-26 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "No",
              "TR_OtherType": "RMP and PSM Safety Awareness Training, SOP Training, and MOC & PSSR training",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2017-07-22 00:00:00",
              "EquipmentInspectionDate": "2017-10-26 00:00:00",
              "EquipmentTested": "Storage tank, deluge system, leak detection system, all sensors and valves, flow transmitters",
              "ChangeMgmtDate": "2017-06-26 00:00:00",
              "ChangeMgmtReviewDate": "2017-07-22 00:00:00",
              "PreStartupReviewDate": "2012-05-11 00:00:00",
              "ComplianceAuditDate": "2017-05-31 00:00:00",
              "AuditCompletionDate": "2017-12-01 00:00:00",
              "IncidentInvestigationDate": "2006-12-01 00:00:00",
              "InvestigationChangeDate": "2007-01-31 00:00:00",
              "ParticipationPlansReviewDate": "2017-06-26 00:00:00",
              "HotWorkPermitReviewDate": "2017-07-22 00:00:00",
              "ContractorSafetyReviewDate": "2017-04-03 00:00:00",
              "ContractorSafetyEvalDate": "2017-01-20 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000082003,
                  "PreventionProgram3ID": 1000066204,
                  "ProcessChemicalID": 1000098144
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000062846,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2017-07-20 00:00:00",
    "ERTrainingDate": "2014-07-29 00:00:00",
    "CoordinatingAgencyName": "Imperial County Public Health Dept",
    "CoordinatingAgencyPhone": "7604824438",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "Yes",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000062846,
      "SummaryText": "El Centro Generating Station (ECGS), located at 485 East Villa Road, El Centro, California operates six power generation units along with Selective Catalytic Reduction (SCR) technology to reduce emissions of nitrogen oxides (NOx) for three combustion turbines.   SCR is a post-combustion flue gas NOX emission control technology that speeds up reaction process for removal of NOX from the flue gas downstream from the combustion process.  A reducing agent is used to reduce NOX emissions, primarily nitric oxide (NO) and nitrogen dioxide (NO2), by oxidation-reduction reactions in the presence of a catalyst.  The most common reducing agent (reagent) used with SCR is ammonia.  Injection of the correct ammonia/air mixture into the combustion exhaust stream before the catalyst, initiates the reactions and achieves the desired removal of NOx emissions upstream from the stack.  The ECGS uses anhydrous ammonia (60,000 pounds) as the reagent for the SCR reactions. For this purpose, ECGS stores 60,000 pounds or 12,000 gallons in a single ammonia storage tank.\r\n\r\nDue to the hazardous nature of anhydrous ammonia, ECGS is required to develop and implement specific regulatory requirements, enforced by both local and federal government agencies, including Federal Risk Management Plan (RMP), Process Hazard Analysis (PHA), Process Safety Management (PSM), and a Seismic Analysis (SA) of the facilities, operations, and equipment.    All regulatory requirements for the use and storage of anhydrous ammonia at the ECGS are found within:\r\n¿P\tTitle 40 Part 68 of the Code of Federal Regulations;\r\n¿P\tTitle 20 Section 1910.119 of the Code of Federal Regulations; and\r\n¿P\tSections 25531 - 25543.3 of the California Health and Safety Code.\r\n\r\nECGS is a generation facility that consists of three steam turbine generators and three gas turbine generators.  A single 12,000-gallon (60,000 lb) anhydrous ammonia tank is located within ECGS facility to supply various SCR systems for each combustion unit with"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000062846,
      "SummaryText": "reducing agent for NOx reduction and control.  Maintenance and loading of the anhydrous ammonia storage tank has been contracted out by ECGS to Air Gas. Transport of Anhydrous ammonia to ECGS is accomplished by using tanker trucks, with individual deliveries of about 5,000 to 7,000 gallons per delivery. When the units are operating, a delivery is scheduled every three to five weeks.\r\nThe 12,000-gallon horizontal storage tank has an outside diameter of 9-feet with a length of 23-feet and 5-inches.  The Ammonia Storage Tank is located inside an enclosure that is adjacent to the unloading area.  The floor beneath the storage tank is slightly sloped towards a sump (with drain) in the north western corner of the enclosure.  This area is sloped to contain and drain accidental spills.  In addition, the ammonia-handling facility is equipped with extensive ammonia detection and alarm systems to protect workers and equipment in the event of a malfunction anywhere within the system.\r\nThe use of equipment for the storage and handling of anhydrous ammonia in support of the SCR project will require compliance with several environmental and safety regulatory requirements, including preparation of this RMP pursuant to the CalARP Program.  The quantity of ammonia on-site also triggers the federal RMP program pursuant to Section 112(r) of the Clean Air Act.  An RMP is required under the CalARP program and at the discretion of the local administering agency (AA).  In Imperial County, the AA is the Department of Toxic Substance Control (DTSC), which also is the local Certified Unified Program Agency (CUPA).  The DTSC has informed the ECGS that an RMP will be required in connection with the anhydrous ammonia system in operation at their facilities. \r\n\r\nThe original RMP submitted on January 30, 2007 includes a Seismic Analysis (SA), a Process Hazard Analysis (PHA), an Offsite Consequence Analysis (OCA), and the proper RMP submittal documentation.  The current revision is triggered by the"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000062846,
      "SummaryText": "third scheduled five-year update and a modification in the plant site configuration related to the repowering of Unit 3. The RMP documentation will be submitted in both electronic and hard copy format.  Endeavour EHS, LLC (Endeavour) has been contracted to conduct this RMP, along with all necessary analyses previously mentioned.  In the future, the ECGS will be required to complete updates to its RMP program on a 5-year basis, if any changes are applied to the ammonia system or the facility or perform updates earlier per RMP regulations.\r\n\r\nDuring 2012, ECGS upgraded some of its power generating units and added additional generating capacity due to the critical need for a load following. The El Centro Unit 3 Repowering Project was implemented which added approximately 144 MW of generation capacity, interconnected to an existing 92 kV system at the El Centro Switching Station. The project consisted of replacing the Combustion Engineering boiler and Westinghouse steam turbine generator with two Siemens SGT-800 combustion turbine generators (CTG), two heat recovery steam generators, and a Siemens SST-600 steam turbine generator. The existing ammonia bulk storage system has remained and continues to be used as the main supply tank for all units along with minor modifications that were made during repowering project including the replacement of the ammonia air vaporizer skids with an updated model of similar design and layout for the new units.\r\nThis document is the RMP prepared for submittal to DTSC to address the facility for the unloading, storage and handling of anhydrous ammonia at the ECGS.  The organization of the RMP closely follows that recommended in the CalARP Program Guidance document.\r\n\r\nA.\tAccidental Release Prevention and Emergency Policies in Place at Facility\r\n&#61607;\tECGS will comply with the California Accidental Release Prevention Program (CalARP) and the Federal Risk Management Program (RMP).\r\n&#61607;\tA copy of the \"Contingency Plan and Emergency"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000062846,
      "SummaryText": "Response Procedures for El Centro Steam Plant\" prepared for the IID is included in Section 9.0 of this document. \r\nB.\tDescription of Regulated Processes and Regulated Substances Handled\r\n&#61607;\tThe primary activity of the ECGS is generation of electric power.\r\n&#61607;\tThe only regulated substance used in an amount triggering the CalARP/RMP program is anhydrous ammonia, which will be used as the reagent for the Selective Catalytic Reduction (SCR) emission control technology installed on the power generating units.\r\n&#61607;\t The maximum quantity of anhydrous ammonia to be stored on-site will be approximately 12,000 gallons or 60,000 pounds.  \r\nC.\tWorst-Case Ammonia Release Scenario and Alternative Release Scenario for Anhydrous Ammonia\r\n&#61607;\tThe worst-case scenario is complete failure of the 12,000-gallon tank of anhydrous ammonia with complete loss of product under worst-case atmospheric dispersion conditions.  The Anhydrous ammonia will drain rapidly into the enclosure beneath the tank, which will limit the volatilization of the ammonia to the atmosphere.  Due to the quantity of anhydrous ammonia being stored at ECGS, the facility will meet RMP Program's Level 3 requirements.  In addition to analyzing a worst case accidental release scenario, in which the entire 12,000 gallons (60,000 lb) of anhydrous ammonia is released from the tank into the atmosphere within 10 minutes, ECGS will also analyze an alternative case scenario.  The alternative accidental release scenario is the one in which a major damage or accidental disconnection of the anhydrous ammonia hose from the tank or delivery truck during loading and unloading process will result to release of approximately 100 pounds per minute of ammonia into the atmosphere for five minutes.  The alternative case scenario is analyzed under more favorable atmospheric dispersion conditions (atmospheric conditions that will allow a toxic ammonia cloud to be dispersed and thus contained more easily). \r\n&#61607;\tThe c"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000062846,
      "SummaryText": "hanges occurring at the plant for this current update will not change the offsite consequence analysis as previously analyzed because the ammonia quantity and geographical/demographical conditions (location of schools, populations, and census data from 2010) has not changed.\r\nD.\tGeneral Accidental Release Prevention Program\r\nThe principal features of the design and operating procedures for the anhydrous ammonia handling and storage facilities that will be implemented to minimize the occurrence of an accidental release of anhydrous ammonia and the consequences if a release occurs are listed below.  Other important safety features are discussed throughout this RMP.\r\n&#61607;\tThe secondary containment structure is built in such a way to contain the entire volume of the storage tank, the water from the emergency deluge system and two inches of water from a 24-hour rain event (with 4 inches of freeboard).\r\n&#61607;\tAll ammonia piping and equipment has been constructed in a manner to minimize the necessary amount of piping used in the system.\r\n&#61607;\tTwo safety relief valves are located on the storage tank.\r\n&#61607;\tShut-off valves are located on the tank fill and vapor return lines that can be activated by the delivery truck operator, and remotely via remote control during loading and unloading process.\r\n&#61607;\tManual Shut-off valve located near the Ammonia Tank in case of an emergency.\r\n&#61607;\tAmbient ammonia detectors/sensors with safety alarms are located at various locations throughout the facility including ammonia pipelines, ammonia skids, and the ammonia loading/unloading areas.  Sensors set at 50 ppm initial alarm and at 75 ppm the deluge system is triggered.  \r\n&#61607;\tA deluge or fog system controlled by ambient sensors and other signals from the ammonia storage tank.  A signal from one of the four ambient ammonia detectors/sensors by the Tank area or a high-pressure signals form the ammonia tank will actuate a water fogging system around the ammonia ta"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000062846,
      "SummaryText": "nk, thereby suppressing the dispersion of an ammonia vapor cloud in the event of an accidental release or spill. The trigger point for the deluge system to be activated is 75 ppm.\r\n&#61607;\tHardwired trip switches in the storage area and the control room to shut down the ammonia forwarding pumps and generate safety alarms regardless of PLC functional status.\r\n&#61607;\tInterconnection piping between the existing ammonia tank and the flow control skid shall be double-contained.\r\nE.\tFive Year Accident History (Update)\r\n&#61607;\tNo RMP reportable accidents have been recorded or have occurred at the ECGS since 2008. This was revalidated for 2017 update.\r\no\tAccident reporting procedures are found in the Emergency Contingency Plan, which contains a standard method of reporting accidents: the District Incident Report as well as notification to outside agencies.\r\nF.\tPlanned Changes to Improve Safety\r\n&#61607;\tThe procedures and equipment that are described in this RMP for detecting unplanned releases of anhydrous ammonia and for responding in the event of such a release are currently being implemented at the ECGS and have been applied since the initial installation of the ammonia system (1992)."
    }
  ]
}