{
  "FacilityID": 1000108386,
  "FacilityName": "Carpenter Co. - Mt. Airy, NC",
  "FacilityStr1": "PO Box 1528",
  "FacilityStr2": "1515 Carter Street",
  "FacilityCity": "Mt. Airy",
  "FacilityState": "NC",
  "FacilityZipCode": "27030",
  "Facility4DigitZipExt": "1528",
  "FacilityCountyFIPS": "37171",
  "LEPC": "Surry County LEPC",
  "FacilityLatDecDegs": "36.472778",
  "FacilityLongDecDegs": "-080.608611",
  "ValidLatLongFlag": "No",
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.carpenter.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3109444,
  "ParentCompanyName": "Carpenter Co.",
  "Company2Name": null,
  "CompanyDUNS": 3109444,
  "Company2DUNS": null,
  "OperatorName": "Travis Gnida",
  "OperatorStr1": "PO Box 1528",
  "OperatorStr2": "1515 Carter Street",
  "OperatorCity": "Mt. Airy",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27030",
  "OperatorZipCodeExt": "1528",
  "FTE": 200,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000252576",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2023-01-02 00:00:00",
  "SafetyInspectionBy": "State environmental agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "F",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2023-11-30 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2023-11-30 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "No",
  "SubmissionMethod": "RMP*eSubmit II",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2023-11-30 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2028-11-30 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000135452,
      "AltID": "Polyurethane Foam Mfg.",
      "FacilityID": 1000108386,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000169772,
          "ProcessID": 1000135452,
          "ChemicalID": 77,
          "Quantity": 630000.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000136926,
          "ProcessID": 1000135452,
          "NAICSCode": "32615",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000108386,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2022-12-15 00:00:00",
    "ERTrainingDate": "2022-12-16 00:00:00",
    "CoordinatingAgencyName": "Mt. Airy Fire Department",
    "CoordinatingAgencyPhone": "3367863570",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "Yes",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 5,
      "FacilityID": 1000108386,
      "SummaryText": "opted.  This program was established to educate our employees of the hazards associated with the chemicals used at Carpenter \u0096 Mt. Airy.  This Written Hazard Communication Program complies fully with the United Nations\u0092 Globally Harmonized System of Classification and Labeling of Chemicals (GHS) and OSHA\u0092s Hazard Communication Standard (HCS.)  GHS training is an annual requirement within our company.\n\nCarpenter Company has joined with its property loss insurance carrier, FM Global, to establish guidelines and parameters for the safe receiving, storage, and use of TDI in the polyurethane foam pouring plants across the United States and Europe.  \n\nSafety is the most important thing we do at Carpenter \u0096 Mt. Airy.  Our utmost goal is for---all of us---to return home to our loved ones at the end of each day. \n  \n\n\nThe following sections cover the only requirements for a Program Level 1 facility."
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000108386,
      "SummaryText": "disposal, coordination agreements with the Mt. Airy Fire Department and Clean Harbors Environmental Services, Inc., the evacuation plan, and listing of the required government reports that must be filed if the Emergency Response Plan is implemented. \n\nAll employees, both hourly and salaried, of the foam pouring process have been trained at the \u0093Technician Level\u0094 of OSHA\u0092s HAZWOPER standard.  Other hourly employees, located throughout the plant, as well as some members of management, have also been trained at the \u0093Technician Level.\u0094  \n\nIn the event of a fire, Carpenter \u0096 Mt. Airy\u0092s maintenance personnel make up a Fire Brigade, whose sole purpose is to assist the Mt. Airy Fire Department.  This fire brigade operates the facility\u0092s fire suppression, alarm, and security systems.  \n\nF)\tPlanned Changes to Improve Safety \n\nThe Reinhart Technical Center (RTC), in Richmond, VA, is Carpenter Company\u0092s state-of-the-art Research and Development Center.  At RTC, chemists, chemical engineers, and other highly skilled personnel are constantly reviewing and \u0093re-inventing\u0094 the foam pouring process.  RTC personnel has developed and refined the many recipes that Carpenter\u0092s pouring plants produce every day.  Foremost at RTC is the safety of Carpenter\u0092s employees, our plant\u0092s neighbors, and the environment that we live in.  Most of our safety procedures have been developed by RTC experts.  RTC strives daily to make the polyurethane foam pouring process safer.  \n\nAt Carpenter \u0096 Mt. Airy, we recognize that the post-9/11 world that we live in calls for prudent measures in regards to plant security.  To ensure and maintain a secure facility, Carpenter \u0096 Mt. Airy has implemented the following:\n\u0095\tEmployees must enter their personalized access code to enter the building.\n\u0095\tAll approved visitors must sign our visitor\u0092s log and are escorted at all times. \n\u0095\tBefore hiring, a background check and drug test is performed on prospective employees.\n\nA Written Hazard Communication Program has been ad"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000108386,
      "SummaryText": "s composed of foam pouring personnel, other plant hourly employees, as well as several members of management.  All Spill team members have, at minimum, HAZWOPER training \u0093Hazardous Materials Technician Level.\u0094  Each year, Spill Team members attend an 8-hour Refresher Course to maintain their \u0093Technician Level\u0094 certification. \n\nTo forecast the worst-case release scenario of TDI, the NOAA\u0092s National Ocean Services\u0092 ALOHA air dispersion model was used.  The worst-case toxic release scenario was determined to be an instantaneous liquid spill and vaporization of TDI from a railcar queued outdoors into a diked area.  From this ALOHA modeling, it was determined a release rate of 1.1 lbs. per minute for a duration of 60 minutes could occur.  The ALOHA model was also used to estimate the distance to the toxic endpoint. The distance to the toxic endpoint is 0.06 miles (106 yards) which did not extend off-site. Therefore, no public receptors were within the distance to the toxic endpoint.\n\nD)\tThe Five-Year Accident History\n\nFor the five years prior to the submission of this RMP, Carpenter \u0096 Mt. Airy has NOT had an accidental release of the regulated substance, Toluene Diisocyanate (TDI), where exposure to the substance, their reaction products, overpressure generated by an explosion involving the substance, or radiant heat generated by a fire involving the substance led to any of the following offsite:  death, injury or response or restoration activities for an exposure of an environmental receptor.\n\nE)\tThe Emergency Response Program \n\nAn Emergency Response procedure for Carpenter \u0096 Mt. Airy is located in the Emergency Response Plan.  This Emergency Response Plan is comprised of topographic maps of the outside and site layouts of the inside of the facility, listing of the emergency coordinators with fields of expertise, parameters in which lead to the implementation of the emergency response plan, emergency response procedures, listing of emergency equipment at the responder\u0092s"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000108386,
      "SummaryText": "ates the only remaining RMP regulated substance.  This substance, toluene diisocyanate (TDI) is inventoried above its 10,000 lb. threshold, thus requiring RMP inclusion.\n\nToluene diisocyanate (TDI), an 80/20% mix of the 2, 4 and 2, 6 isomers, is used as a reactant in the foam pouring process.  TDI is received primarily via railcars that contain approximately 190,000 pounds of product.  These railcars are queued outdoors.  Transfer hoses and related equipment are connected and the unloading process begins.  TDI is transferred from the railcar to storage tanks located in the interior tank farm.  These TDI tanks are seated in concrete secondary containment structures that can completely capture the tank\u0092s content in the event of a total tank failure.  TDI is pumped from the storage tanks through a strainer, filter, and heat exchanger before arriving into the mixing head.  In the mixing head, TDI is blended with polyol, water, carbon dioxide (CO2), pigments, fillers, and other minor components.  The resulting chemical reaction produces polyurethane foam.\n\nC)\tThe General Accidental Release Prevention Program and Chemical-Specific Prevention Steps \n\nCarpenter \u0096 Mt. Airy abides fully with EPA\u0092s Clean Air Act Section 112(r):  Accidental Release Prevention/Risk Management Plan Rule.  Carpenter \u0096 Mt. Airy\u0092s Risk Management Plan will be subject to dedicated inspections by the North Carolina Department of Environmental Quality - Division of Air Quality.  Further, this facility is in good standing with all of the N.C. DEQ\u0092s Divisions (Air Quality, Water Quality, and the Departments of Waste Management and Storm Water.)\n\nConcerning TDI, the storage tanks are equipped with electronic overfill alarms with automatic pump shutoff and are vented through a bank of activated charcoal filters to remove all of the TDI vapors.  The foam pouring process is equipped with a continuous TDI vapor monitor with electronic and audible alarms.\n\nCarpenter \u0096 Mt. Airy has an in-house Spill Team that i"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000108386,
      "SummaryText": "program and chemical-specific prevention steps\nD)\tThe five-year accident history\nE)\tThe emergency response program\nF)\tPlanned changes to improve safety \n\nA)\tThe Accidental Release Prevention and Emergency Response Policies\n\nCarpenter Co. \u0096 Mt. Airy, NC is committed to abide with all federal, state, county, and local laws and regulations concerning the proper storage, handling, and use of all chemicals whether toxic, flammable, or otherwise.  Carpenter - Mt. Airy is committed to its Guiding Principles, Safety Policy, and Environmental Policy.  These guidance materials \u0093put down on paper\u0094 the company\u0092s obligation to protect its employees, customers, and beyond our property lines---our neighbors and the environment.\n\nAn Emergency Response Plan for Carpenter - Mt. Airy has been developed.  This Plan includes the procedures for informing applicable Emergency Response agencies should an accidental release occur.  Also, the Emergency Response Plan provides guidelines for the Emergency Coordinator(s) to respond to all emergency situations.  These guidelines include:  location of all hazardous chemicals and other substances, listing of alternate Emergency Coordinators with contact information, assembly of Carpenter \u0096 Mt. Airy\u0092s employee-staffed Spill Team, telephone numbers for all emergency response agencies and the closest local hospital, and provides the division manager or his designee the government agencies that must be notified during and after an emergency situation has abated.  \n\nIn the event of a major release of a hazardous substance, all U.S. Carpenter locations have contracted with Clean Harbors Environmental Services, Inc. to coordinate and execute a massive clean-up effort.  \n\nB)\tThe Stationary Source and Regulated Substances Handled  \n\nCarpenter \u0096 Mt. Airy, located at 1515 Carter Street, Mt. Airy, NC, manufactures polyurethane foam products for the furniture, bedding, and home furnishings industries.  It is the polyurethane foam pouring process that incorpor"
    },
    {
      "ESSeqNum": 0,
      "FacilityID": 1000108386,
      "SummaryText": "Executive Summary---Risk Management Plan for Carpenter Company, Mt. Airy, NC---40 CFR 68.155\n\nIn 1948, E. Rhodes Carpenter began distributing cushioning materials to the furniture industry.  By 1956, Carpenter\u0092s company began manufacturing flexible polyurethane foam marketed to the furniture and home furnishings industries.  In 1962, Carpenter built the first continuous foam pouring line in Richmond, VA.  Due to Carpenter\u0092s hard work, honesty, and integrity his company grew rapidly.  Since inception, Carpenter Co. has been an industry leader in the markets served, by opening new manufacturing facilities and acquiring existing companies to meet customer demands.  This allowed Carpenter Co. to grow into the largest producer of polyurethane foam in the world.  On December 1, 2023, Carpenter Co. acquired NCFI Polyurethanes in Mt. Airy, NC and changed its name to Carpenter Co. \u0096 Mt. Airy, NC. Through its polyurethane foam pouring process the facility is subject to the Environmental Protection Agency\u0092s (EPA) Risk Management Plan Rule.\n\nThe information required from facilities under the RMP rule helps local fire, police, and emergency response personnel prepare for and respond to chemical emergencies.  Making RMPs available to the public also fosters communication and awareness to improve accident prevention and emergency response practices at the local level.  The RMP rule requires companies that use certain toxic and flammable chemicals to develop a Risk Management Plan.   \n\nWith this acquisition, Carpenter Co. \u0096 Mt. Airy, NC, will eliminate the use of Pentane (the sole flammable RMP chemical.)  The change in ownership and the removal of Pentane necessitates this RMP submittal.    \n\nIn accordance with the rules in 40 CFR 68.155 (guidelines on the Executive Summary) the following areas will be discussed herein:\n\nA)\tThe accidental release prevention and emergency policies\nB)\tThe stationary source and regulated substances handled\nC)\tThe general accidental release prevention"
    }
  ]
}