{
  "FacilityID": 1000079946,
  "FacilityName": "C&S Wholesale Grocers Inc. - Suffield",
  "FacilityStr1": "1120 Harvey Lane",
  "FacilityStr2": null,
  "FacilityCity": "Suffield",
  "FacilityState": "CT",
  "FacilityZipCode": "06078",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "09003",
  "LEPC": "Suffield LEPC",
  "FacilityLatDecDegs": "41.9455164",
  "FacilityLongDecDegs": "-72.6232103",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cswg.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "C&S Wholesale Grocers Inc.",
  "Company2Name": null,
  "CompanyDUNS": 1842467,
  "Company2DUNS": null,
  "OperatorName": "C&S Wholesale Grocers Inc.",
  "OperatorStr1": "7 Corporate Drive",
  "OperatorStr2": "P.O. Box 821",
  "OperatorCity": "Keene",
  "OperatorStateFIPS": "NH",
  "OperatorZipCode": "03431",
  "OperatorZipCodeExt": null,
  "FTE": 231,
  "OtherEPAFacilityID": "CTD065531410",
  "EPAFacilityID": "100000102694",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2012-12-05 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2021-03-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-06-04 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-06-04 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2023-09-29 00:00:00",
  "DeRegistrationEffectiveDate": "2023-03-05 00:00:00",
  "AnniversaryDate": "2024-06-04 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 41.94559,
  "FRS_Long": -72.6235,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "150",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000099799,
      "AltID": "ammonia (anhydrous)",
      "FacilityID": 1000079946,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000125027,
          "ProcessID": 1000099799,
          "ChemicalID": 56,
          "Quantity": 15200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000101039,
          "ProcessID": 1000099799,
          "NAICSCode": "49312",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000084405,
              "Process_NAICS_ID": 1000101039,
              "SafetyReviewDate": "2016-08-19 00:00:00",
              "PHA_Date": "2019-08-06 00:00:00",
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2019-02-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "Yes",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "Yes",
              "MH_Hurricanes": "Yes",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "Yes",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": "Ammonia Detection",
              "MS_SprinklerSystem": "Yes",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "No",
              "CH_OtherChanges": "Five year revalidation",
              "OpProceduresReviewDate": "2018-07-11 00:00:00",
              "TrainingReviewDate": "2016-08-19 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Periodic monthly training calls given by the Corporate Compliance Team",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-03-16 00:00:00",
              "EquipmentInspectionDate": "2019-04-25 00:00:00",
              "EquipmentTested": "Annual system mechanical integrity service - outside contractor performs",
              "ChangeMgmtDate": "2018-03-16 00:00:00",
              "ChangeMgmtReviewDate": "2016-08-19 00:00:00",
              "PreStartupReviewDate": "2016-08-23 00:00:00",
              "ComplianceAuditDate": "2017-03-20 00:00:00",
              "AuditCompletionDate": "2018-03-21 00:00:00",
              "IncidentInvestigationDate": "2018-02-27 00:00:00",
              "InvestigationChangeDate": "2018-03-26 00:00:00",
              "ParticipationPlansReviewDate": "2016-08-19 00:00:00",
              "HotWorkPermitReviewDate": "2016-03-01 00:00:00",
              "ContractorSafetyReviewDate": "2019-03-12 00:00:00",
              "ContractorSafetyEvalDate": "2016-08-19 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000105154,
                  "PreventionProgram3ID": 1000084405,
                  "ProcessChemicalID": 1000125027
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000079946,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Suffield Fire Department",
    "CoordinatingAgencyPhone": "8606683888",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "No",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000079946,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\r\n\r\nC&S Wholesale Grocers' senior management is not only committed to offer superior service, but to also maintain a safety and environmental program to promote a safe environment for all its employees and the surrounding community.  The Corporate Compliance Team assists the facility in administering safety and environmental policies. The Corporate Compliance Team is made up of the following personnel:\r\n\r\n¿\tSenior Director of Corporate Refrigeration\r\n¿\tSenior Manager of Corporate Refrigeration\r\n¿\tDirector of Environmental & OSHA Compliance\r\n¿\tPSM-RMP Regulatory Manager\r\n¿\tCorporate Manager of Facilities Compliance\r\n¿\tOSHA Regulatory Manager\r\n¿\tEnvironmental Compliance Manager\r\n\r\nThe Maintenance Manager periodically evaluates the health and safety practices of facility employees to ensure compliance, and oversees implementation of the safety and environmental programs.  These programs include forklift safety, hazard communications, lockout/tagout, Hazardous Materials Emergency Business Plan, employee safety manuals, manufacturer's documentation, Emergency Response, as well as the Risk Management Plan.\r\n\r\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\r\n\r\nThe C&S Suffield facility is located at 1120 Harvey Lane in Suffield, Connecticut.  The primary business of the C&S Suffield facility is to provide refrigerated warehousing and storage for various food products.  In order to conduct operations, the facility maintains a refrigeration system containing approximately 15,200 pounds of anhydrous ammonia, a regulated substance.  The refrigeration system, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, and then back to high pressure liquid) in order to provide refrigeration for glycol chilling, dock operations and cold storage. \r\n\r\nOff-site Release Scenarios\r\n\r\nC&S has conducted an OCA based o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000079946,
      "SummaryText": "n the EPA document titled RMP Offsite Consequence Analysis Guidelines, and used the EPA's RMP*Comp Version 1.07 to estimate the distance traveled to a toxic endpoint defined by the EPA regulation. This data were then used to estimate the potential impact caused by a release from each of the regulated substances.\r\n\r\nWorst-Case Release Scenarios\r\n\r\nAs required by regulations, scenarios were considered where the entire capacity of the largest vessel for each regulated chemical at the facility was released in 10 minutes. Although these scenarios are highly unlikely in the event of a release, it provides the local responding agencies with a maximum possible impact in the event of an accidental release. In considering these releases, the most pessimistic meteorological conditions were used. Passive mitigation measures were taken into account when considering these release scenarios.\r\n\r\nAlternative Release Scenarios\r\n\r\nAlternative scenarios were developed to assess what potential impact may occur in the event of a release that is more likely to occur than the worst-case scenarios for each of the regulated chemicals. Several possible release scenarios were considered, and the scenarios with the greatest offsite impact were chosen. In considering the alternative release scenario, the default meteorological conditions for alternative scenarios were used in RMP*Comp. These scenarios represent a more realistic release, and have a downwind distance and impact considerably smaller than the worst-case scenario. No passive or active mitigation measures were taken into account when considering these release scenarios.\r\n\r\nProcess Description\r\n\r\nThe refrigeration cycle begins with the transfer of liquid ammonia from the Condenser to the Thermosyphon Receiver.  Priority feed from the Thermosyphon Receiver is reserved for thermosyphon oil cooling of the Screw Compressors (4), with excess liquid overflowing to the High Pressure Receiver.  The liquid ammonia is stored within the High Pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000079946,
      "SummaryText": "essure Receiver until it is fed, as needed, to the Intercooler and the +20F Pump Recirculator.\r\n\r\nAt the Intercooler, the refrigerant is subcooled as it flows through coils immersed in a bath of liquid ammonia.  The subcooled liquid refrigerant is fed to the -20F Pump Recirculator and the vapor ('flashed' from the liquid bath) is drawn by the High Stage Compressors.  The level of the liquid bath is maintained via a float switch on the vessel which controls the operating position (open/closed) of a solenoid valve connected to the liquid inlet to the vessel.\r\n\r\nThe +20F Pump Recirculator pumps liquid ammonia to evaporators in the Medium Temperature Evaporators (AU9 thru AU16 and AU24 thru AU25) and the Dock Evaporators (AU18 thru AU23), while the -20F Pump Recirculator pumps liquid ammonia to evaporators in the Low Temperature Evaporators (AU1 thru AU8).  At the evaporators, the liquid ammonia, flowing through coils in the unit, is partially boiled as it absorbs heat from the product and room.  The resulting 'wet suction' (liquid/vapor mix) is returned to the pump package which supplied each evaporator, wherein the liquid drops to the bottom of the vessel (to be reused in the refrigeration of the warehouse) and vapor is drawn from the top by the applicable compressor (see below).\r\n\r\nThe Low Stage Compressors (3) draw vapor from the -20F Pump Recirculator and the High Stage Compressors (4) draw vapor from the +20F Pump Recirculator and the Intercooler.  At the Low Stage Compressors, the pressure of the ammonia vapor is raised and then discharged to the Intercooler, where it is 'bubbled' through the ammonia bath to desuperheat the vapor.  The vapor discharged from the High Stage Compressors is primarily routed to the Condensers, but also used in the Glycol Heat Exchanger and in the defrost cycle of the evaporators.  There are two screw compressors and one reciprocating compressor for the low stage of the refrigeration system and two screw compressors and two reciprocati"
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000079946,
      "SummaryText": "a Incident responders and observers.  This Plan is reviewed and updated at least once per year to ensure compliance with the PSM and RMP regulations.  Facility personnel receive annual training regarding the emergency procedures and the Emergency Response Team holds regular drills.\r\n\r\nPLANNED CHANGES TO IMPROVE SAFETY\r\n\r\nC&S Wholesale Grocers, Inc. took over operations at the Suffield Facility in 2003.  The following details the Process Hazard Analysis history for the facility:\r\n\r\n¿Original Study - 1995:  Noted in the 2004 study that the original was conducted in 1995. No report exists but C&S has acknowledged that we do not have access to it.\r\n¿PHA Revalidation 1 - 11/16/2004\r\n¿PHA Revalidation 2 - 5/13/2009\r\n¿PHA Revalidation 3 - 4/3/2014\r\n¿PHA Revalidation 4 - 2/5/2019 & 2/6/2019\r\n\r\nThe PHA Revalidations consisted of a:\r\n\r\n- Hazard and Operability (HAZOP) study or What-If Studies\r\n- series of safety checklists; and\r\n- facility inspection.\r\n\r\nThe mitigation measures (recommendations) include additional training, key maintenance-related tests/inspection, and enhanced emergency response policies and procedures.  The recommendations resultant from the most recent revalidation study are scheduled to be addressed by 8/6/2019."
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000079946,
      "SummaryText": "ng compressors for the high stage of the refrigeration system.  The reciprocating compressors are glycol-cooled, while the screw compressors receive high pressure liquid from the Thermosyphon Receiver for thermosyphon oil cooling.\r\n\r\nAt the Condensers (2), air (fans) and water (pumps) are used to condense the High Stage Compressor discharge into high pressure liquid, which then drains to the Thermosyphon Receiver to begin the refrigeration cycle again.  At the Glycol Heat Exchanger, glycol, used in a separate closed system to heat the floor under the freezer, is heated by high pressure ammonia vapor as it passes through the heat exchange unit.  The liquid ammonia condenses and then drains to the Intercooler.  The system is also equipped with an Automatic Purger that removes non-condensables, i.e. air, from the system.\r\n\r\nAmmonia sensors are located in the Engine Room and within each refrigerated space throughout the warehouse.\r\n\r\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\r\n\r\nIn order to operate the ammonia refrigeration system, the facility complies with the following risk management regulations:\r\n\r\n1) OSHA's Process Safety Management (PSM); and\r\n2) EPA's Risk Management Program (RMP).\r\n\r\nThese regulations impose numerous requirements on the facility to ensure the safety of the public and on-site workers.  The following summarizes the key compliance programs that have been implemented by C&S Suffield Facility to prevent the accidental release of ammonia from the facility.  The Operating Procedures program ensures that the ammonia system is operated in a safe manner.  The Training program ensures that personnel fully understand how to perform their jobs in a safe manner.  The Mechanical Integrity program ensures that the ammonia system is in proper working condition based upon routine testing, inspections, and maintenance according to manufacturer's specifications and industry standards.  The Management of Change program ensures that"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000079946,
      "SummaryText": "process modifications are implemented in a safe manner.  The Pre-Startup Safety Review program ensures that adequate safety measures are in place before ammonia is introduced into a process.  The Hot Work Permit program ensures that C&S Suffield Facility employees and contractors perform hot work (e.g. welding) in a safe manner.  The Contractor Safety program ensures that contractors understand the hazards of ammonia and must take specified precautions to safely complete job requirements.\r\n\r\nIt is important to note that the refrigeration system has been designed with several safety features to prevent the accidental release of ammonia.  For example, the compressors are equipped with safety mechanisms that will cause the units to shut down if operating conditions exceed designated safety limits.  Also, level indicators, alarms, and switches are installed in key points within the system to monitor the supply of liquid ammonia and to ensure that a vessel is not overfilled.  The facility has also installed ammonia sensors in the Engine Room, in the cold storage areas which will alert operators in the event of ammonia detection. \r\n\r\nFIVE YEAR ACCIDENT HISTORY\r\n\r\nThere have been no federally reportable incidents nor any that resulted in serious injuries or offsite consequences within the last five years (June 2014 - June 2019). \r\n\r\nEMERGENCY RESPONSE PROGRAM\r\n\r\nThe facility has an Emergency Action Plan (plan) in effect at the facility.  This Plan was designed to meet the following objectives:  \r\n\r\n- save lives;\r\n- minimize and avoid injuries;\r\n- protect the environment; and\r\n- minimize property damage.\r\n\r\nThe Plan provides the notification procedures and evacuation routes for emergencies that may arise at the facility. The Facility is non-responding and has personnel trained to support the HazMat response team if required (up to 300 ppm of ammonia).\r\n\r\nThere is a specific program (CEHS-0042) which outlines the training, qualifications and procedures for authorized ammoni"
    }
  ]
}