{
  "FacilityID": 1000049527,
  "FacilityName": "Domtar Paper Company LLC",
  "FacilityStr1": "PO Box 747",
  "FacilityStr2": "Highway 149 North",
  "FacilityCity": "Plymouth",
  "FacilityState": "NC",
  "FacilityZipCode": "27962",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37117",
  "LEPC": "Martin County LEPC",
  "FacilityLatDecDegs": "35.860028",
  "FacilityLongDecDegs": "-76.778806",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "GO",
  "LatLongDescription": "PU",
  "FacilityURL": "www.domtar.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 3199882,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Domtar Paper Company LLC",
  "OperatorStr1": "PO Box 747",
  "OperatorStr2": "Highway 149 North",
  "OperatorCity": "Plymouth",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27962",
  "OperatorZipCodeExt": null,
  "FTE": 475,
  "OtherEPAFacilityID": "27962WYRHSTROWB",
  "EPAFacilityID": "100000156984",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "590069A5.A",
  "SafetyInspectionDate": "2015-02-10 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": "90 Ton Railcar of Chlorine Located at Filter Plant",
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2015-07-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2015-07-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2015-07-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2018-07-19 00:00:00",
  "DeRegistrationEffectiveDate": "2018-05-30 00:00:00",
  "AnniversaryDate": "2020-07-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.1.7",
  "FRS_Lat": 35.86583,
  "FRS_Long": -76.78306,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "40",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R06",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000062116,
      "AltID": "Chlorine Dioxide Process",
      "FacilityID": 1000049527,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000076389,
          "ProcessID": 1000062116,
          "ChemicalID": 71,
          "Quantity": 30240.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000063258,
          "ProcessID": 1000062116,
          "NAICSCode": "32211",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000051619,
              "Process_NAICS_ID": 1000063258,
              "SafetyReviewDate": "2010-03-05 00:00:00",
              "PHA_Date": "2014-11-20 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2015-06-30 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 1,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 1,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 0,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 0,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 1,
              "PC_PurgeSystem": 1,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 1,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2015-07-16 00:00:00",
              "TrainingReviewDate": "2011-10-01 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-10-07 00:00:00",
              "EquipmentInspectionDate": "2015-04-20 00:00:00",
              "EquipmentTested": "ClO2 Plant Equipment (tanks, pumps, filters, agitators, ejectors, eductors, piping, scrubbers)",
              "ChangeMgmtDate": "2014-01-07 00:00:00",
              "ChangeMgmtReviewDate": "2013-10-08 00:00:00",
              "PreStartupReviewDate": "2010-03-15 00:00:00",
              "ComplianceAuditDate": "2015-01-13 00:00:00",
              "AuditCompletionDate": "2016-01-13 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2015-01-13 00:00:00",
              "HotWorkPermitReviewDate": "2012-11-02 00:00:00",
              "ContractorSafetyReviewDate": "2015-04-08 00:00:00",
              "ContractorSafetyEvalDate": "2015-04-16 00:00:00",
              "CBI_Flag": 0,
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000064260,
                  "PreventionProgram3ID": 1000051619,
                  "ProcessChemicalID": 1000076389
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000049527,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2014-11-18 00:00:00",
    "ERTrainingDate": "2014-10-15 00:00:00",
    "CoordinatingAgencyName": "Martin County LEPC",
    "CoordinatingAgencyPhone": "2527928151",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000049527,
      "SummaryText": "1.0  RMP - Executive Summary\n\nDomtar Paper Company is committed to operating in a manner that is safe for employees, the public and the environment.  As part of this commitment, Domtar has established a system to help ensure safe operation of the process within the facility.  One component of the system is a Risk Management Plan (RMP) for the Chlorine Dioxide system located within the facility.  (Chlorine dioxide is used as a bleaching agent to whiten the pulp.)  The RMP complies with the requirements of the United States Environmental Protection Agency's (USEPA's) regulation, 40 CFR 68, Accidental Release Prevention Requirements: Risk Management Programs.  One of the requirements of the regulation is that Domtar must submit an RMP to the USEPA describing the risk management program at the facility.  This document is intended to provide the USEPA and the public with a description of the risk management program for the Chlorine Dioxide system within the Domtar Facility.\n\nDomtar's risk management program consists of three elements:\n\n 1.  Hazard Assessment. Identification of potential off-site consequences of hypothetical accidental releases and any accidents that have occurred in the last five years associated with the usage of chlorine dioxide.\n\n 2.  Prevention Program.  Maintains and safely operates the chlorine dioxide process.\n\n 3.  Emergency Response Program.  A response system for accidental releases of chlorine dioxide.\n\n1.1  Accidental Release Prevention and Emergency Response Policies\n\nDomtar is committed to the safety of workers and the public, and the preservation of the environment, through the prevention of accidental releases of hazardous substances.  Domtar implements reasonable controls to prevent foreseeable releases of hazardous substances.  These controls include training programs for personnel; programs to help ensure safety in the design, installation, operation, and maintenance of the Chlorine Dioxide Plant; and, programs to evaluate the hazards."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000049527,
      "SummaryText": "\n\nIn the event of an accidental release, Domtar controls and contains the release in a manner that will be safe for workers and will help prevent injury to the public or the environment.  Domtar provides response training to responders, designates an emergency response coordinator to oversee response activities, and coordinates response efforts with local hospitals, fire departments, law enforcement and hazardous materials responders.  Response activities have also been discussed with the LEPCs in Bertie, Martin and Washington counties.\n\n 1.2  Regulated Substances\n\nAs part of the pulp and paper manufacturing processes, Domtar uses only one regulated substance in sufficient quantity to be covered by the RMP rule.  The one substance is chlorine dioxide manufactured at the Mill's Chlorine Dioxide Plant.  The chlorine dioxide is used to bleach wood pulp. The RMP rule covers chlorine dioxide at a concentration greater than 1%.  Currently, the Mill limits the concentration to less than 1% but would like the flexibility to increase the concentration to 1.2%.  Since the Chlorine Dioxide process is already covered under OSHA's Processes Safety Management regulation, the process is a program level 3 as defined in the EPA rule.\n\n1.3  Offsite Consequence Analysis\n\nDomtar performed an offsite consequence analysis to estimate the potential for an accidental release of a regulated substance to affect the public or the environment.  The offsite consequence analysis consists of evaluating both worst-case release and alternative release scenarios.  Domtar does not expect a worst-case release scenario to ever occur.  An alternative release scenario represents a release that (1) might occur at a facility like Domtar Chlorine Dioxide Plant and (2) would result in the greatest potential offsite consequences if the release occurred.\n\nThe main objective of performing the offsite consequence analysis is to determine the distance at which certain effects might occur to the public because of "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000049527,
      "SummaryText": "an accidental release (called the endpoint distance).  When considering the release of a toxic substance, most people at the endpoint distance would be able to walk away from the exposure without any long-term health consequences, although some short-term consequences (e.g., strong eye or throat irritation) are likely.  Some people who are particularly susceptible to the substance released could be incapacitated.  At distances less than the endpoint distance, the effects would be greater; at distances greater than the endpoint distance, the effects would be less.\n\nThe RMP rule requires Domtar to report one worst-case scenario and at least one alternative release scenario.  The following information summarizes the offsite consequence analysis performed by Domtar.\n\n1.3.1  Worst-case Release Scenario\n\nThe worst-case release scenario for the Chlorine Dioxide plant is the failure of the largest storage tank.  The entire contents of the tank are released in 10 minutes.  The maximum distance to the toxic endpoint concentration is greater than 25 miles. The 2010 census indicates that 75,000 people in six counties live within this distance from the Chlorine Dioxide plant.  Public receptors within this distance include facilities such as: schools, residences, hospitals, boat landings, golf courses, churches, commercial & industrial areas, hotels/motels, etc.  Environmental receptors within this distance include facilities such as: State park, wildlife preserves, refuges and gamelands, etc.\n\n1.3.2  Alternative Release Scenario\n\nThe alternative release scenario is a failure in the piping from the pump to the storage tanks.  The scenario assumes that the chlorine dioxide detectors detect the leak within 10 minutes, and that 10 pounds of chlorine dioxide will be released.  The maximum distance to the toxic endpoint concentration is .1 miles.  The 2010 census indicates that no one lives within this distance from the Chlorine Dioxide Plant and there are no public receptors within t"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000049527,
      "SummaryText": "his distance.\n\n1.4  Accidental Release Prevention Program and Chemical-specific Prevention Steps\n\nDomtar uses a prevention program to help prevent accidental releases of all hazardous chemicals onsite.  The Chlorine Dioxide Plant met the requirements of OSHA's Process Safety Management (PSM) regulation prior to start up in 1994.  The USEPA's RMP regulation requires the same basic prevention program except for the RMP program also focuses on protecting the public and the environment.  The following sections briefly describe Domtar's prevention program at the Chlorine Dioxide Plant to meet the RMP regulations.\n\n1.4.1  Employee Participation\n\nDomtar fosters broad and active participation in the prevention program by involving hourly, salary and contract employees with the common purpose to make the workplace safer.  In the development and maintenance of the prevention program, Domtar consults regularly with employees and their representatives.  Also, employees and their representatives have access to information developed for the prevention program.\n\n1.4.2  Process Safety Information\n\nDomtar maintains many technical documents to ensure safe operation of the Chlorine Dioxide Plant.  These documents contain information pertaining to: the hazards of the highly hazardous chemicals in the process, the technology of the process and the equipment in the process.\n\nThe Safety Data Sheet (SDS) documents the following hazards of chlorine dioxide in the Chlorine Dioxide Plant: toxicity information, permissible exposure limits, physical data, reactivity data, corrosivity data and thermal and chemical stability data.  Also, the PSM book contains information about the hazardous effects of inadvertent mixing of different materials.\n\nThe process technology of the Chlorine Dioxide Plant is located in the Chlorine Dioxide Plant Operating Manual.  Technology information in the manual includes: process flow diagram, process chemistry, maximum intended information, safe upper and lower limi"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000049527,
      "SummaryText": "ts for Chlorine Dioxide Plant operating parameters and an evaluation of the consequences of deviations from the Chlorine Dioxide Plant's operating parameters.\n\n The process equipment documentation includes information concerning the operating parameters, design basis and configuration of the equipment in the Chlorine Dioxide Plant.  Specifically, Domtar has the following equipment documentation: materials of construction, piping & instrumentation diagrams, electrical classification, relief system design and design basis, ventilation system design, design codes and standards used, safety systems, and verification that the process complies with recognized and generally accepted engineering practices.\n\n1.4.3  Process Hazard Analysis\n\nDomtar performs and periodically updates process hazard analyses (PHAs) of the Chlorine Dioxide Plant to help identify process hazards and to generate recommendations that might enhance the safety of the process.  A team composed of engineering, operations, maintenance, environmental, safety and process control performs the PHA.  Typically, Domtar utilizes the Hazard and Operability (HAZOP) methodology to perform the PHA.  After completion of the PHA, the PHA team prepares a report describing the results of the analysis and a list of recommendations.  Recommendations are distributed by responsible supervisor.  Supervisors then address each recommendation and document the resolution.\n\n1.4.4  Operating Procedures\n\nDomtar has developed a Chlorine Dioxide Plant Operating Manual that provides clear instructions for activities in the Chlorine Dioxide Plant area.  The manual includes procedures for: initial start-up, normal operation, temporary operation, emergency shutdown, normal shutdown, start-up after a turnaround or emergency shutdown, operating limits including the consequences of process deviation and steps required to correct or avoid deviation, safety and health considerations, safety systems and their functions and safe work practices."
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000049527,
      "SummaryText": "  Domtar annually reviews the operating manual to ensure that the procedures are up-to-date.\n\n1.4.5  Employee Training\n\nDomtar is committed to ensure that employees and contractors understand the nature and causes of problems arising from the Chlorine Dioxide Plant operations and aware of the hazards particular to the Chlorine Dioxide Plant.  In the Chlorine Dioxide Plant area, classroom training and on-the-job training is used with operating procedures until an acceptable skill level has been reached.  Senior operators and supervisors use a formatted checklist and an oral interview to determine the trainee's skill level.  Refresher training is performed at a minimum every three years to refresh operator's skills.\n\n1.4.6  Contractors\n\nDomtar has established a program to help ensure that activities in the Mill are performed in a safe manner.  The program reviews the safety record of contractors so that contractors with proven safe work practices are allowed to work in the Mill.  Prior to the start of work, Domtar explains to all contractor supervisors the hazards of the process on which they and their employees will work, Domtar safe work practices and Domtar emergency response procedures.  In addition, Domtar requires that the contractor supervisor train each of their employees prior to the start of work at the Mill.  Domtar periodically reviews the contractors' training documents and work performance to ensure that safe work practices are followed.\n\n1.4.7  Pre-start-up Safety Review\n\nSince the Chlorine Dioxide Plant has been using chlorine dioxide for many years, Domtar performs a safety review of the process if any significant modifications are made to the process. The safety review helps ensure that the process has been prepared to operate safely.  The review confirms that: construction and equipment are in accordance with design specifications; adequate safety, operating, maintenance and emergency procedures are in place; employee training has been completed; an"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000049527,
      "SummaryText": "d, that a process hazard analysis or management of change requirements have been met.  During the pre-start-up safety review, Domtar uses a checklist to ensure that appropriate issues have been addressed and to document the review.\n\n1.4.8  Mechanical Integrity\n\nDomtar maintains the mechanical integrity of the process to help prevent equipment failures that could endanger workers, the public or the environment.  The mechanical integrity program has two major aspects to it: a quality assurance program to help ensure that new and replacement equipment meet the design standards required for service in the Chlorine Dioxide Plant; and, an inspection and testing program to help identify equipment deterioration and damage before equipment fails.\n\nThe quality assurance program includes: specifications for replacements parts and equipment; procedures for safe work practices such as lock/out tag out, hot work, confined space entry and line or equipment opening; training of maintenance personnel; and, documentation of maintenance activities.\n\nThe inspection and testing program includes: specifications for inspecting and testing process equipment; procedures for inspecting, testing and maintaining process equipment; training of maintenance personnel; and, documentation of maintenance activities.\n\n1.4.9  Hot Work Permit\n\nDomtar has a hot work permit program to control spark- or flame-producing activities that could result in fires or explosions within the mill.  Prior to performing hot work (such as welding, grinding, cutting), personnel are required to fill out the Hot Work Permit Form.  Training in the use of the Hot Work Permit Form is included in the Domtar safe work practices orientation.\n\n1.4.10  Management of Change\n\nDomtar's management of change program evaluates and approves all proposed changes to chemicals, equipment, and procedures for the Chlorine Dioxide Plant to help ensure that the change does not negatively affect safe operations.  Process changes determined to b"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000049527,
      "SummaryText": "e a replacement in kind (e.g., replacing a valve with an identical valve) are allowed without completing a full management of change review.  All other changes are confirmed through the full management of change review to help ensure: inadvertent consequences of process changes are prevented; safety consequences of changes are addressed; affected process safety information and procedures are updated; and, affected employees are notified of the changes.\n\n1.4.11  Incident Investigation\n\nDomtar investigates all incidents that could reasonably have resulted in a serious injury to personnel, the public, or the environment so that similar accidents can be prevented.  Domtar trains employees to identify and report any incident or near-miss requiring investigation.  An investigation team is assembled, and the investigation is initiated within 24 hours of the incident.  The results of the investigation are documented, recommendations are resolved, and appropriate process enhancements are implemented.\n\n1.4.12  Compliance Audits\n\nDomtar audits the Chlorine Dioxide Plant process to be certain that the prevention program is effectively addressing the safety issues of Chlorine Dioxide Plant operations.  Domtar assembles an external audit team that includes personnel knowledgeable in the RMP rule and in the process, and this team evaluates whether the prevention program satisfies the requirements of the RMP rule and whether the prevention program is sufficient to help ensure safe operation of the process.  The results of the audit are documented, recommendations are resolved, and appropriate enhancements to the prevention program are implemented.\n\n1.4.13   Chemical-specific Prevention Steps\n\nDomtar has implemented safety features specific to the chlorine dioxide generated at the Chlorine Dioxide Plant.  If a release occurs inside or outside the Chlorine Dioxide Plant building, an automatic valve at the chlorine unloading station closes and only the quantity in the piping will be r"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000049527,
      "SummaryText": "eleased.  Visual and audible chlorine dioxide alarms are provided in the Chlorine Dioxide Plant and surrounding process area.\n\n1.5 Five-year Accident History\n\nA thorough review of all environmental, safety and process information indicates that Domtar has had no accidents involving chlorine dioxide at the Chlorine Dioxide Plant that have resulted in any injuries or damages on or off-site.\n\n1.6 Emergency Response Program\n\nDomtar has a written comprehensive emergency management plan (CEMP) to help safely respond to emergency situations including accidental releases of hazardous substances. Leadership reviews the CEMP annually to ensure they understand the plan and can implement the plan. The CEMP includes the Spills and Unpermitted or Hazardous Material Release (Environmental Incident) Response and Notification Procedure. \n\nSeveral Domtar employees are EMTs and trained to provide proper first aid and emergency medical treatment to treat accidental human exposure to hazardous substances. Domtar also has a medical center that is staffed with a Registered Nurse Monday-Friday from 8am-5pm. There are two local hospitals located with 30 miles of the mill.  \n\nDomtar employees working in the Chlorine Dioxide Plant are trained in HAZWOPER at the Operator level so they have the ability to operate within the incident command structure to passively contain or control a leak. The regional Hazmat team is located in Williamston, NC which is less than 30 miles from the mill. They would respond should there be a significant release of a hazardous substance. \n\n All Domtar personnel are trained in evacuation procedures.  Domtar periodically conducts emergency response drills, including drills coordinated with local emergency response agencies. \n\nThe written emergency response plan complies with other federal contingency plan regulations (e.g., the OSHA regulations 29 CFR 1910.38(a), 29 CFR 1910.120(a)) and has been communicated to local emergency response officials through the local fir"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000049527,
      "SummaryText": "e department and the LEPC.\n\n1.7 Planned Changes to Improve Safety\n\nDomtar constantly strives to improve the safety within the Mill through both the incident investigation program and a program soliciting safety suggestions from the workers.  Also, Domtar maintains compliance with OSHA's Process Safety Management regulation to ensure continued improvement in the safety of the process. \n\n2.0 Revision History    \n\nDomtar will review and revise the RMP and PSM plan as needed to ensure alignment between the two plans. \n\n5/28/15 - Kari Cahoon - New\n\n"
    }
  ]
}