{
  "FacilityID": 1000090869,
  "FacilityName": "GreenGate Fresh",
  "FacilityStr1": "3255 S. Ave 3 1/2 E",
  "FacilityStr2": "P.O. Box 1269",
  "FacilityCity": "Yuma",
  "FacilityState": "AZ",
  "FacilityZipCode": "85365",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "04027",
  "LEPC": "Yuma County LEPC",
  "FacilityLatDecDegs": "32.668333",
  "FacilityLongDecDegs": "-114.570556",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "CE",
  "FacilityURL": "greengatefresh.com",
  "FacilityEmailAddress": "hr@greengatefresh.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "GreenGate Fresh, LLLP",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "GreenGate Fresh LLLP",
  "OperatorStr1": "1222 Merrill St.",
  "OperatorStr2": null,
  "OperatorCity": "Salinas",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93901",
  "OperatorZipCodeExt": null,
  "RMPContact": "Robert Gleim",
  "RMPTitle": "Sr. Maintenance/Facilities Manager",
  "FTE": 45,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000213299",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2020-11-15 00:00:00",
  "SafetyInspectionBy": "Cypress Engineering Group",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-11-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-11-18 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-11-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-11-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "5",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000112938,
      "AltID": "Basic Inorganic Chemicals",
      "FacilityID": 1000090869,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000114291,
          "ProcessID": 1000112938,
          "NAICSCode": "311991",
          "_desc": {
            "NAICS_CODE": "311991",
            "NAICS_DESCRIPTION": "Perishable Prepared Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000141140,
          "ProcessID": 1000112938,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000641140,
          "ProcessID": 1000112938,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000090869,
      "SummaryText": "1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nGreenGate Fresh conducts inspection procedures to review refrigeration equipment prior to startup and during operations. These procedures identify potential sources of release and equipment corrections required to prevent these releases. On-site personnel and certified refrigeration contractors review the equipment as required.\n\n\n\nOn-site personnel provide initial emergency response. On-site personnel will make a preliminary assessment in the event of a release and will provide first response. First response may include emergency equipment shutdown, system isolation, or controlled operation such as pump down to prevent or reduce an off-site release. No emergency operations will be performed that are beyond the capabilities of the operators or other on-site personnel. Local fire and police departments with mutual aid response will provide emergency response for a major release event. Refrigeration contractors would also be on-call to provide emergency response.\n\n\n\nEmergency response training will be conducted yearly for current employees and as required for new employees. Records will be kept of all training performed at the site for a minimum of five (5) years.\n\n\n\n2. Stationary Source and Regulated Substances Handled\n\n\n\nGreenGate Fresh uses anhydrous ammonia as a refrigerant in their operations. Drawings in Chapter 8 - Appendix 8.1 show the facility location map and site plan.\n\n\n\nGreenGate Fresh has over 10,000 lbs. of ammonia in any single refrigeration system. Anhydrous ammonia is used as a refrigerant in product storage cooling, vacuum cooling, and water chilling operations. There are two (2) separate refrigeration systems (processes) at the facility. These processes are (1) Main System, and (1) Vacuum Cooling System. The Main System is the largest single system with ammonia quantity of approximately 15,000 lbs., which is above the federal TQ of 10,000 lbs. The Vacuum Cooling System has less than"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000090869,
      "SummaryText": " 10,000 lbs. of ammonia. The facility has no machinery room housing the refrigeration equipment.\n\n\n\nEach system is a single stage closed loop ammonia refrigeration system. Each system operates between 17? F/30 psig on the suction side and 87? F/157 psig on the discharge side during normal operations. \n\n\n\nMain System: The largest system is the Main System that serves the cold rooms and the water chillers. Main System is composed of fixed and portable equipment. Fixed equipment includes high- and low-pressure receivers, ammonia pumps, cold room evaporators, water chillers and surge drums, evaporative condenser, skid-mounted reciprocating compressor, condenser skid (evaporative condenser and high-pressure receiver), ammonia detection, control systems, and diffusion tank. Portable equipment includes two refrigeration trailers and three skid-mounted screw compressors. The one of the refrigeration trailer is owned by the facility and has one evaporative condenser, one high-pressure receiver, and one screw compressor installed on it. The other refrigeration trailer is leased from the Western Precooling Systems (WPS) and has one evaporative condenser and one high-pressure receiver installed on it. Two of the screw compressors ships to Salinas, CA facility for summer operations. The other screw compressor (AHRC 1205A) stays on site all year. Main System is operated seasonally from November to April. The ammonia charge of the Main System including the portable equipment is approximately 15,000 lbs.\n\n\n\nVacuum Cooling System: Vacuum cooling system comprises of two (2) 12-pallet (half-car) vacuum tubes w/ surge drums on top of each tube (flooded system) and one refrigeration trailer. The Refrigeration Trailer consists of two screw compressors, one high-pressure receiver, and one evaporative condenser. Vacuum Cooling System has approximately 3,000 lbs. of ammonia. Vacuum Cooling System is operated seasonally from November to April. At the end of the season, all vacuum cooling sys"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000090869,
      "SummaryText": "tem equipment ships to Salinas, CA facility for summer operations, from April to November.\n\n\n\nFacility operates seasonally from approximately November through April. The facility pumps down all the ammonia in the Main System to the high-pressure and low pressure receivers during the off season and all the ammonia in the vacuum cooling system to on-site nurse tanks.\n\n\n\nAll of the main system and vacuum cooling system equipment except the cold room evaporators are located outdoors.\n\n\n\nThe total quantity of ammonia currently at the site is approximately 18,000 lbs. Public receptors are located within the worst-case accidental release toxic endpoint area.\n\n\n\nThe compressors have safety cutouts that will shut down the compressors upon detection of unsafe operating conditions. All pressure vessels and the compressors are protected against high-pressure situations by safety relief valves. All low side vessels that are connected directly to the suction of compressor is installed with high level float switches that shuts down compressor upon detection of high liquid level in the vessel. All cold storage warehouses are installed with ammonia sensors that triggers an alarm upon detection of ammonia vapor in the vicinity of the sensor. Refrigeration control system sends alarms to refrigeration manager in case of emergency situation or any high pressure, high temp or ammonia detection.\n\n\n\nUpdated refrigeration drawings are located in Appendix 8.1-Refrigeration System Drawings. International Institute of Ammonia Refrigeration (IIAR) \"Ammonia Refrigeration Safety Inspection Checklists,\" located in Appendix 12.1, describe equipment details.\n\n\n\nThe refrigeration systems at this facility are a single-stage vapor compression cycle. In general, the process chemistry for each system is described in Chapter 8.3.\n\n\n\nAnhydrous ammonia (NH3) is a gas in its natural state and is extremely irritating to mucous membranes and lung tissue. The gas is pungent and may be suffocating as shortness o"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000090869,
      "SummaryText": "f breath and labored breathing can develop if inhaled. Prolonged inhalation of high concentrations may cause bronchitis and/or pneumonia, with some residual reduction in pulmonary functions. Repeated or prolonged contact of high concentrations of ammonia to the skin can cause frostbite, redness, pain and serious skin burn. See Appendix 8.4 for Safety Data Sheets (SDS) for anhydrous ammonia.\n\n\n\n3. General Accidental Release Prevention Program\n\n\n\nGreenGate Fresh maintains a release prevention program to eliminate or minimize releases. The program includes regular inspections, monitoring equipment and logging conditions, scheduled maintenance, and operator training. There is a program to analyze releases for ways to prevent a similar future release, see Chapter 16-Incident Investigation.\n\n\n\nThe ammonia refrigeration system has specific safety procedures to prevent a release. Operators and mechanics are trained for safe operation and maintenance of the refrigeration system. They are also trained in emergency response procedures in the event of an ammonia release. Ammonia detectors are installed in all refrigerated rooms. Personnel will automatically be notified if any detector exceeds its set point. Monitoring is done 24 hours per day. All of the relief valves at the main system and the vacuum cooling system are tied into an ammonia diffusion tanks (one for each system) to prevent high-pressure releases to ambient.\n\n\n\n4. Five-Year Accident History\n\n\n\nAccording to GreenGate Fresh personnel, in the past five years there have been no releases of anhydrous ammonia resulting in reportable quantities or injuries.\n\n\n\n5. Emergency Response Program\n\n\n\nIn the event of a release, certain personnel are designated to determine the potential hazard and coordinate response procedures. The Safety Coordinator is responsible in coordinating emergency response and will be contacting emergency response agencies, schools, daycare centers, and acute care facilities that may be affected by th"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000090869,
      "SummaryText": "e release. The Safety Coordinator will also be responsible for evacuation of employees if necessary and for coordination with community emergency responders if off-site evacuations are required. A description of the emergency response plan is included in Chapter 20.\n\n\n\n6. Planned Changes to Improve Safety\n\n\n\nRecommended corrective actions to mitigate the potential for an accidental ammonia release are proposed on the tables located in Chapter 0.0. The table items are a result from recommendations made during the Process Hazard Analysis, a Code Compliance Review, and a Safety Inspection performed by a qualified person. Some corrective items in the recommendation table originate from multiple codes but are listed only once. Based on the severity of the hazards identified, priority level and implementation deadlines are also recommended.\n\n\n\nAll refrigeration equipment is well maintained and operated in a safe manner by trained personnel. Operating, maintenance, training, and safety procedures will be formalized with improved written documentation.\n\n\n\n"
    }
  ]
}