{
  "FacilityID": 1000014445,
  "FacilityName": "Helena Chemical Company - Madison, SD",
  "FacilityStr1": "620 SW Third Street",
  "FacilityStr2": null,
  "FacilityCity": "Madison",
  "FacilityState": "SD",
  "FacilityZipCode": "57042",
  "Facility4DigitZipExt": "0466",
  "FacilityCountyFIPS": "46079",
  "LEPC": "Don Thomson",
  "FacilityLatDecDegs": "44.001780",
  "FacilityLongDecDegs": "-097.123330",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 7036759,
  "ParentCompanyName": null,
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Helena Chemical Company",
  "OperatorStr1": "P.O. Box 412",
  "OperatorStr2": null,
  "OperatorCity": "Madison",
  "OperatorStateFIPS": "SD",
  "OperatorZipCode": "57042",
  "OperatorZipCodeExt": "0466",
  "RMPContact": "Jody Bergheim",
  "RMPTitle": "Branch Manager",
  "FTE": 10,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000009947",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2009-06-05 00:00:00",
  "SafetyInspectionBy": "South Dakota Department of Agriculture",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2011-06-14 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2011-04-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2011-04-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-06-24 00:00:00",
  "DeRegistrationEffectiveDate": "2020-06-22 00:00:00",
  "AnniversaryDate": "2016-04-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 44.00139,
  "FRS_Long": -97.12306,
  "FRS_Description": "STORAGE TANK",
  "FRS_Method": "INTERPOLATION-MAP",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000018079,
      "AltID": "Storage Tank & Filling",
      "FacilityID": 1000014445,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018403,
          "ProcessID": 1000018079,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021411,
          "ProcessID": 1000018079,
          "ChemicalID": 56,
          "Quantity": 163464.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521411,
          "ProcessID": 1000018079,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000018080,
      "AltID": "Railcar & Tanker Truck",
      "FacilityID": 1000014445,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018404,
          "ProcessID": 1000018080,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021412,
          "ProcessID": 1000018080,
          "ChemicalID": 56,
          "Quantity": 204802.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521412,
          "ProcessID": 1000018080,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000018081,
      "AltID": "Fertilizer Reacting",
      "FacilityID": 1000014445,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000018405,
          "ProcessID": 1000018081,
          "NAICSCode": "42491",
          "_desc": {
            "NAICS_CODE": "42491",
            "NAICS_DESCRIPTION": "Farm Supplies Merchant Wholesalers"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000021413,
          "ProcessID": 1000018081,
          "ChemicalID": 56,
          "Quantity": 165104.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000521413,
          "ProcessID": 1000018081,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000014445,
      "SummaryText": "EXECUTIVE SUMMARY\n\nThe Helena Chemical Company (Helena) Madison Facility has submitted this updated electronic RMP in compliance with the provisions of the Clean Air Act 112 (r) as codified by the U.S. Environmental Protection Agency at 40 CFR Part 68.  This electronic submittal provides conservative estimates of the offsite consequences of an accidental release of anhydrous ammonia from the Madison Facility located at 620 SW Third Street, Madison, SD 57042.  The electronic RMP summarizes the policies and procedures implemented by the Madison Facility to minimize the likelihood of an accident.  The electronic RMP also summarizes the actions that the Madison Facility has taken to ensure that a response to a release (even though a release is unlikely) will be implemented in a proper and timely manner.\n\nPURPOSE FOR UPDATING RMP\n\nHelena has updated this RMP to include three different covered processes: (1) an on-site Tank Storage and Filling, (2) a temporary ammonia storage process (Railcar or Tanker Truck); and (3) a mobile fertilizer reacting process.  Future operation at the Facility may include the temporary storage of anhydrous ammonia in a railcar process and a fertilizer reacting process.  These processes will be managed in accordance with the requirements of a Program Level 3.  The on-site tank storage and filling process will be managed as a Program Level 2.  Helena is resubmitting this RMP as a 5-Year update.  As part of the update, Helena updated the off-site consequence analysis for the worst case and the alternative case release scenarios for each covered process.\n\nFACILITY\n\nThe Madison Facility is a retail agricultural chemical facility.  Anhydrous ammonia is currently transported to the Facility via tanker truck and then transferred into the on-site 12,000-gallon storage tank.  The Vendor (i.e. tanker truck operator) is responsible to Helena for complying with relevant operation, maintenance, and training procedures and documentation.  \n\nFrom the storage "
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000014445,
      "SummaryText": "tank, the anhydrous ammonia is transferred to nurse tanks and sold as retail to the end user.  The on-site tank storage and filling process is performed by qualified and trained Facility personnel.  Facility personnel conduct the storage and filling procedures in accordance with its Operating Procedures.  \n\nFuture operations may include two additional processes that include (1) transportation and temporary storage of anhydrous ammonia in a 34,000-gallon railcar, and (2) fertilizer reacting.  Anhydrous ammonia temporarily stored in the railcar will be reacted with phosphoric acid in a mobile pipe reactor and then diluted with water.  Helena does not own or operate the railcar or reacting process, but does operate the tank storage and filling process.  The reacting process and its ancillary unloading procedures (i.e. from a railcar) are performed by an Independent Fertilizer Reacting Contractor (IFRC).  After the reacting process is complete, any residual anhydrous ammonia is stored in the transportation containers until the transportation company removes the container from the Helena Facility.\n\nOFF-SITE CONSEQUENCE ANALYSIS\n\nWorst case and alternative case offsite consequence analyses were completed for each covered process (i.e. Tank Storage & Filling, Railcar and tanker Truck Storage, and Fertilizer Reacting).  The worst case scenario release for the Madison Facility assumes that all the contents of the largest single vessel (a single railcar or single storage tank) are released.  The release was modeled as if the railcar or storage tank was punctured on the side at the ground level. The resulting release of ammonia was modeled as a ground level horizontal jet.\n\nThe alternative (or more likely to occur) scenario for the Railcar covered process assumes that a vapor valve is leaking or is not fully closed.  (The scenario actually assumes the valve is only 50% closed.)  The alternative scenario for the Reacting and Tank Storage covered processes are the same and assum"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000014445,
      "SummaryText": "es that liquid transfer line up to 2-inches in diameter is severed during the reacting or filling process.  \n\nACCIDENT PREVENTION PROGRAM\n\nThe Branch Manager implements the risk management planning process at this Helena facility.  The Branch Manager is assisted by other Helena staff, as directed.  The ammonia storage prevention program is implemented by Helena employees.  Helena employees inspect the markings on transportation containers (Railcar or Tanker Trucks) to ensure that the containers are operated within the U.S. DOT required inspection requirements and they inspect the Bill of Lading to ensure that the containers are not overfilled.  Helena employees also conduct inspections of railcars, tanker trucks, and its on-site storage tank for leaking valves and fittings in accordance with the accident program detailed in the Risk Management Program document.  \n\nThe reacting process prevention program is implemented by the IFRC because Helena does not own or operate the reacting process.  Helena requires the IFRC to certify its compliance with a Process Safety Management Plan and it spot checks some aspects of the contractorA?s PSM documentation (e.g. maintenance, training records) to ensure that the Contractor is complying with its PSM Plan.  \n\nEMERGENCY RESPONSE PROGRAM\n\nHelenaA?s Madison Facility is a non-responding facility. Helena has coordinated emergency response activities with its local emergency response agency and local fire department.  Helena has a written Contingency Plan that includes procedures to notify local emergency response agencies in event of a significant ammonia release.  Helena employees will not, under any circumstance, serve as first responders to a significant release of ammonia.\n\nFIVE YEAR ACCIDENT HISTORY\n\nThere have been no on-site deaths, injuries, or significant property damage; or off-site deaths, injuries, property damage, evacuations, or sheltering in place, in the past five (5) years because of the ammonia operations at the Ma"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000014445,
      "SummaryText": "dison Facility.\n\nCONCLUSION\n\nThe Risk Management Plan implemented by Helena Chemical Company at the Madison Facility complies with the requirements of the Clean Air Act, Section 112(r). The RMP will be updated as the Madison Facility adds, deletes, or changes processes. The Emergency Response Program has been coordinated with the Lake County LEPC.\n\nNOTE: Sections 4, 5, and 6 of the standard RMP produced by EPAA?s RMP Submit Program are not applicable to the Madison Facility.\n"
    }
  ]
}