{
  "FacilityID": 1000082582,
  "FacilityName": "Lineage Seafreeze",
  "FacilityStr1": "206 SW Michigan St",
  "FacilityStr2": null,
  "FacilityCity": "Seattle",
  "FacilityState": "WA",
  "FacilityZipCode": "98106",
  "Facility4DigitZipExt": "1908",
  "FacilityCountyFIPS": "53033",
  "LEPC": "King County LEPC",
  "FacilityLatDecDegs": "47.542105",
  "FacilityLongDecDegs": "-122.337384",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "lineagelogistics.com",
  "FacilityEmailAddress": "info@lineagelogistics.com",
  "FacilityDUNS": 115176323,
  "ParentCompanyName": "Lineage Logistics",
  "Company2Name": null,
  "CompanyDUNS": 78545588,
  "Company2DUNS": 0,
  "OperatorName": "Lineage Logistics LLC",
  "OperatorStr1": "1 Park Plaza Suite 550",
  "OperatorStr2": null,
  "OperatorCity": "Irvine",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "92614",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Facility Maintenance Manager",
  "FTE": 300,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000112512",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-07-02 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2022-02-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-09-23 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2019-09-23 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2024-09-23 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.10.1",
  "FRS_Lat": 47.54104,
  "FRS_Long": -122.33615,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "15",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000103209,
      "AltID": "Frozen Warehouse",
      "FacilityID": 1000082582,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000104482,
          "ProcessID": 1000103209,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000129211,
          "ProcessID": 1000103209,
          "ChemicalID": 56,
          "Quantity": 45800.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000629211,
          "ProcessID": 1000103209,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000082582,
      "SummaryText": "Executive Summary for\n\nLineage-Seattle SeaFreeze\n\nSeattle, WA\n\n\n\nAmmonia Refrigeration Facility\n\n\n\nAccidental Release Prevention and Emergency Response Policies \n\nThe people of Lineage-Seattle SeaFreeze are strongly committed to employee, public and environmental safety. Our belief in environmental stewardship is revealed in our policies and demonstrated through our actions. Our commitment is demonstrated by our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance and employee training associated with the processes in our facility. It is our policy to implement appropriate controls to prevent possible releases of regulated substances. Although such releases may not be foreseeable, our plans are fully coordinated with the highly trained emergency response personnel at the Seattle Fire Department to control and mitigate the effects of any release should they occur.\n\n\n\nThe Stationary Source and the Regulated Substances Handled\n\nOur facility's primary activities revolve around large-scale public storage of food products. Anhydrous\n\nammonia is the major regulated substance present at our facility. The entire ammonia inventory is used as a\n\nrefrigerant to support our process. \n\n\n\nGeneral Accidental Release Prevention Program and Chemical-Specific Prevention Steps\n\nOur facility has taken steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68 by the EPA. In addition, our facility is subject to the OSHA, PSM standard under 29 CFR 1910.119. Our facility is also subject to EPCRA, Section 302 notification requirements.\n\n\n\nThe following sections briefly describe the elements of the release prevention program that is in place at our\n\nstationary source:\n\n\n\nProcess Safety Information\n\nLineage-Seattle SeaFreeze maintains a detailed record of written safety information that describes the chemical hazards, operating parameters and equipment designs associated with"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000082582,
      "SummaryText": " all the processes.\n\n\n\nProcess Hazard Analysis\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our processes are\n\nidentified and controlled efficiently. The methodology used to carry out these analyses is the \"what if/checklist\"\n\nmethodology. The studies are undertaken by a team of qualified personnel with expertise in engineering and\n\nprocess operations and will be revalidated at a regular interval of three years or sooner if required by the\n\nregulation. Any findings related to the hazard analysis are addressed in a timely manner.\n\n\n\nOperating Procedures\n\nFor the purposes of safely conducting activities within our covered processes, Lineage -Tacoma maintains written operating procedures. These procedures address various modes of operation such as initial startup, normal operations, temporary operations, emergency shutdown, emergency operations, normal shutdown and startup after a turnaround. The information is regularly reviewed and is readily accessible to operators involved with the processes.\n\n\n\nTraining\n\nLineage-Seattle SeaFreeze has a comprehensive training program in place to ensure that employees who are operating processes are completely competent in the operating procedures associated with these processes. Refresher training is provided at least every three years and more frequently as needed.\n\n\n\n\n\n\n\nMechanical Integrity\n\nLineage-Seattle SeaFreeze carries out highly documented maintenance checks on process equipment to ensure proper operations. Process equipment examined by these checks includes pressure vessels, storage tanks, piping systems, relief and vent systems, emergency shutdown systems, controls and pumps.\n\nMaintenance procedures are performed by qualified personnel with a strong background in maintenance\n\npractices. Specialized training is provided to these personnel as needed. Any equipment deficiencies\n\nidentified during maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\nWr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000082582,
      "SummaryText": "itten procedures are in place to manage changes in process chemicals, technology, equipment and procedures. Process operators, maintenance personnel and all other employees whose job tasks are affected by a change in a process are promptly made aware of and offered training to deal with the changes.\n\n\n\nPre-startup Reviews\n\nPre-start up safety reviews related to new processes and to modifications in established processes are conducted as a regular practice. These reviews are conducted to confirm that construction, equipment, operating and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\nLineage-Seattle SeaFreeze conducts audits on a regular basis to determine whether the provisions set out under the RMP Rule are being implemented. These audits are carried out at least every 3 years and any corrective actions required as a result of the audits are undertaken in a safe and prompt manner.\n\n\n\nIncident Investigation\n\nLineage-Seattle Seafreeze promptly investigates any incident that has resulted in, or could reasonably result in a catastrophic release of a regulated substance. These investigations are undertaken to identify the situation leading to the incident as well as any corrective actions to prevent the release from reoccurring. All reports are retained for a minimum of 5 years.\n\n\n\nEmployee Participation\n\nLineage-SeaFreeze believes that process safety management and accident prevention is a team effort. Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements. In addition, our employees have access to all information collected as part of the facility's compliance with the RMP Rule including information resulting from process hazard analyses.\n\n\n\nContractors\n\nOn occasion, our company hires contractors to conduct specialized maintenance and construction activities.\n\nPrior to selecting a contractor, a thorough evaluation of safe"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000082582,
      "SummaryText": "ty performance of the contractor is carried out.\n\nLineage -Seattle SeeFreeze has a strict policy of informing the contractors of known potential hazards related to the contractor's work and the processes. Contractors are also informed of all the procedures for emergency response to an accidental release of a regulated substance.\n\n\n\nFive-year Accident History\n\nLineage-Seattle SeaFreeze has an excellent record of preventing accidental releases over the last 5 years.\n\nDue to our stringent release prevention policies, there has been no accidental release during this period.\n\n\n\nEmergency Response \n\nLineage-Seattle SeaFreeze has a written Emergency Action Plan to deal with accidental releases of hazardous materials. The Emergency Action Plan in place prepares for emergency evacuations, to provide first aid and medical treatment and to contact federal, state and local officials in the event of a major release of ammonia.\n\nThe plan is promptly updated to reflect any pertinent changes taking place within our processes that would require a modified emergency response.\n\n\n\nThe King County LEPC, Office of Emergency Management is the local Emergency Planning Committee (LEPC)\n\nwith which our emergency plan has been coordinated and verified.\n\n\n\nPlanned Changes to Improve Safety\n\nAll recommendations that were generated by the 2017 PHA are being addressed.\n\nAny new equipment installed in the future will incorporate new safety design and technology available at the\n\ntime of installation. If, based upon mechanical integrity inspections improvements are deemed necessary,\n\nthey will be performed in a timely fashion.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    }
  ]
}