{
  "FacilityID": 1000061221,
  "FacilityName": "Highway 14 Wastewater Treatment Plant",
  "FacilityStr1": "800 Sucrose Drive",
  "FacilityStr2": null,
  "FacilityCity": "New Iberia",
  "FacilityState": "LA",
  "FacilityZipCode": "70560",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "22045",
  "LEPC": "Iberia Parish LEPC",
  "FacilityLatDecDegs": "29.991639",
  "FacilityLongDecDegs": "-091.846972",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 79460846,
  "ParentCompanyName": "City of New Iberia",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of New Iberia",
  "OperatorStr1": "800 Sucrose Drive",
  "OperatorStr2": null,
  "OperatorCity": "New Iberia",
  "OperatorStateFIPS": "LA",
  "OperatorZipCode": "70560",
  "OperatorZipCodeExt": null,
  "RMPContact": "Vincent S.Palumbo II, PE",
  "RMPTitle": "Director - Wastewater Department",
  "FTE": 14,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000197752",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2011-11-04 00:00:00",
  "SafetyInspectionBy": "C.N.A. Risk Control",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2019-04-01 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-11-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 1,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-11-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-11-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000076471,
      "AltID": "Chlorine Storage & Usage",
      "FacilityID": 1000061221,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077654,
          "ProcessID": 1000076471,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094759,
          "ProcessID": 1000076471,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594759,
          "ProcessID": 1000076471,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    },
    {
      "ProcessID": 1000076472,
      "AltID": "SO2 Storage & Usage",
      "FacilityID": 1000061221,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077655,
          "ProcessID": 1000076472,
          "NAICSCode": "22132",
          "_desc": {
            "NAICS_CODE": "22132",
            "NAICS_DESCRIPTION": "Sewage Treatment Facilities"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094760,
          "ProcessID": 1000076472,
          "ChemicalID": 49,
          "Quantity": 8000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 49,
            "ChemicalName": "Sulfur dioxide (anhydrous)",
            "CASNumber": "7446-09-5",
            "Threshold": 5000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594760,
          "ProcessID": 1000076472,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000061221,
      "SummaryText": "This Risk Management Plan has been developed by Domingue, Szabo & Associates, Inc. for The City of New Iberia's Highway 14 Waste Water Treatment Plant in accordance with 40 CFR part 68.  The Plan was updated by City in November 2016.  This facility is subject to requirements of this program due to the usage and storage of chlorine in an amount greater than 2,500 lbs. and sulfur dioxide in an amount greater than 5,000 lbs.\n\n\n\nThe facility is located within the city limits of New Iberia, LA at the end of Sucrose Drive, off of LA Highway 14.  The area surrounding the facility consists of agricultural fields, recreation areas, residents and commercial buildings.  The latitude and longitude of the facility was obtained from USGS Topographic map entitled New Iberia South, LA.\n\n\n\nTreatment includes the chlorination and de-chlorination (using sulfur dioxide) of treated water prior to being discharged into the adjacent Rodere Canal.  A continuous dose of chlorine is mixed with water in the injection room.  Once the chlorine is injected into the water it is diluted to an amount, which is less than 1% chlorine, by weight.  The chlorine-water mixture is then routed to the contact chamber where the wastewater is disinfected.  The part of this process that is subject to the RMP requirements begins with the chlorine supply (6-1 ton cylinders) and ends at the point where chlorine gas is mixed with the water.  The facility uses approximately one cylinder of chlorine every two weeks.  The wastewater plant stores a maximum of six-one ton cylinders (12,000 lbs.) of chlorine at any one time.\n\n\n\nThe worst-case release scenario for both chlorine and sulfur dioxide involves the release of the greatest amount from a single vessel as required by 40 CFR part 68.25 (b)- Determination of worst-case release quantity.  This type of release may occur as a result of catastrophic natural or other unforeseen disaster.  A release of 2,000 lbs. for a duration of 10 minutes results in a 1.3 mile distanc"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000061221,
      "SummaryText": "e to the toxic endpoint for both chlorine and sulfur dioxide.  This endpoint, developed by the American Industrial Hygiene association, is the location where minimal effects of exposure to the toxic substance are likely to occur.  This distance encompasses approximately one half of the city of New Iberia from LA Hwy 14 at US Hwy 90. to Center St. at Dale St. and from Admiral Doyle Drive at Hopkins St. to Lewis St. between Admiral Doyle Drive and US Hwy 90.  Using MARPLOT v5.0.3 software developed by the USEPA and NOAA, the population residing within an area encompassing a circle with a 1.3 mile radius (worst-case release circle) is 7,719 people.  Refer to Section 5.0 for the vicinity map, which depicts the worst-case release circle and for details of the public and environmental receptors.\n\n\n\nAn alternative case or a more likely release of sulfur dioxide or chlorine could occur as a result of a valve, regulator seal, or gasket leak.  The plant is equipped with both CL2 and SO2 leak detection systems that have sensors located near the cylinders and within injection rooms.  If 1 ppm leak of CL2/SO2 is detected an alarm will sound and according to facility personnel, it would take less than 1 minute for on-site personnel to respond by closing the flow valve and thus stopping the leak.  Assuming the substance (either chlorine or sulfur dioxide) flashes to the atmosphere at a rate of 0.5 ft3/min for a maximum of 5 minutes (0.5 lbs. of chlorine or 0.4 lbs. of sulfur dioxide) the distance to the toxic endpoint is less than 0.1 mile.  The area within 0.1 mile of the facility currently affects only agricultural fields and a recreational area owned by the City of New Iberia.  Using MARPLOT v5.0.3 software developed by the USEPA and NOAA, the population residing within an area encompassing a circle with a 0.1 mile radius is 0 people.  This type of release is only expected to impact those persons in the immediate vicinity of the chlorine or sulfur dioxide cylinders.  Refer to t"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000061221,
      "SummaryText": "he vicinity map and to Section 5.2 of this manual for details of the public and environmental receptors and the mitigation systems in place at the plant.\n\n\n\nThe facility has not experienced a release, which caused on or off site injury, death, or property damage within the past five years.\n\n\n\nFacility employees are properly trained in the operating and maintenance procedures.  These procedures are kept on-site within the O & M Manuals.  Records of inspections, testing, and maintenance are also kept on file at the facility.\n\n\n\nWritten emergency response procedures have been developed and are kept on file at the facility.  Emergency response procedures within this manual describe actions for incidental response for facility personnel in the event of a relatively small leak or release that does not pose an immediate safety or health hazard.  If incidental response activities do not halt the release or the release poses an immediate safety or health hazard, specially trained response personnel are contacted to take over response activities.  In the event of a chlorine leak or release, employees are instructed to assess the situation and to determine if it is safe to discontinue the leak without the help of emergency responders.  If there are any doubts as to the safety of the release, the employees are to initiate the written notification procedures.  Details to these procedures are found in Section 7.0 of the manual.\n\n\n\nCurrent safety features installed at the facility include the leak detection system, 24 hr/day on-site personnel and a covered storage area to protect the cylinders from the heating effects of direct sunlight.  Inspections of the process and associated equipment are conducted on a regular basis to avoid failure and detect normal wear and tear of equipment parts."
    }
  ]
}