{
  "FacilityID": 1000007534,
  "FacilityName": "Santa Fe Pump Station/Water Chlorination Facility",
  "FacilityStr1": "1011 Round House Road",
  "FacilityStr2": null,
  "FacilityCity": "Gallup",
  "FacilityState": "NM",
  "FacilityZipCode": "87301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "35031",
  "LEPC": "Mckinley LEPC",
  "FacilityLatDecDegs": "35.525833",
  "FacilityLongDecDegs": "-108.755278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ci.gallup.nm.us",
  "FacilityEmailAddress": "water@ci.gallup.nm.us",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Gallup Joint Utilities",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "City of Gallup Joint Utilities",
  "OperatorStr1": "110 W. Aztec Ave.",
  "OperatorStr2": "P.O. Box 1270",
  "OperatorCity": "Gallup",
  "OperatorStateFIPS": "NM",
  "OperatorZipCode": "87305",
  "OperatorZipCodeExt": null,
  "RMPContact": "Ernest Thompson",
  "RMPTitle": "Water/Wastewater Superintendent",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000151658",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2004-03-17 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-18 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-18 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-18 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2019-05-20 00:00:00",
  "DeRegistrationEffectiveDate": "2019-05-15 00:00:00",
  "AnniversaryDate": "2014-06-18 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 35.52639,
  "FRS_Long": -108.75389,
  "FRS_Description": "CENTER OF FACILITY",
  "FRS_Method": "INTERPOLATION - DIGITAL MAP SRCE (TIGER)",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000008677,
      "AltID": "Chlorination",
      "FacilityID": 1000007534,
      "ProgramLevel": 2,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000008869,
          "ProcessID": 1000008677,
          "NAICSCode": "22131",
          "_desc": {
            "NAICS_CODE": "22131",
            "NAICS_DESCRIPTION": "Water Supply and Irrigation Systems"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000009699,
          "ProcessID": 1000008677,
          "ChemicalID": 62,
          "Quantity": 750.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000509699,
          "ProcessID": 1000008677,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000007534,
      "SummaryText": "Executive Summary\n\n\nIn June 1996, the U.S. Environmental Protection Agency (EPA) issued the Risk Management Program Standard (RMP Standard) (40 CFR, Part 68).  Regulated under the Clean Air Act Amendments (CAAA), Section 112(r), the RMP Standard requires facilities that store large amounts of listed hazardous chemical substances to prepare and implement risk management plans to reduce the probability of accidental releases and minimize the health risks to the public and the environment in the event of a release.  The RMP Standard regulates 77 listed toxic substances and 63 listed flammable substances.  The RMP Standard applies to an estimated 7,200 public and private drinking water and wastewater treatment facilities nationwide where chlorine and/or ammonia are used as disinfectants.  When properly used, chlorine has proven to be both safe and effective.\n\nThe two Gallup Pump Station/Water Chlorination Facilities (GPSWCF), Yah-ta-hey and Santa Fe, supply water to residential, commercial and industrial users.  Santa Fe stores and uses chlorine, but does not store amounts above the threshold quantities.  However, the City of Gallup has decided to address Santa Fe in its RMProgram to ensure the safe operation and maintenance of the facility. The term anhydrous chlorine and chlorine are used interchangeably and specifically refer to a chemical listed in the RMP Standard.    \n\nThe chlorine is used to disinfect drinking water and prevent the spread of waterborne diseases. At Santa Fe, the chlorine is stored within a building in 150-pound cylinders.  The total maximum intended inventory at Santa Fe is 1,050 pounds with only two 150-pound cylinders on-line at any one time.  The chlorine is liquefied under pressure in the 150-pound cylinders.  Chlorine is drawn as a gas in an alternating manner from the two 150-pound cylinders through a vacuum feed system.  The gaseous chlorine is then metered into a solution through two chlorinators.  The chlorine solution is then fed to a d"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000007534,
      "SummaryText": "istribution line injection point.\n\nMinimizing Risk\nThe major driving force in the development of the RMP Standard is reducing the risk to public health by minimizing the potential of a chemical release.  The GPSWCF have a multi-layer system in place to meet this goal.  The RMProgram includes the following: (1) properly trained operators to safely handle chlorine; (2) chlorine detectors located where chlorine is stored and/or used; and (3) chemical release prevention and emergency response plans in place. Trained personnel respond to chlorine alarms to assess whether a chlorine release poses an imminent danger to employees or the public.  While a significant release is unlikely, the emergency response plans have been developed for just such an occurrence.  The emergency response plans include procedures to be followed by operators trained to take appropriate action including contacting the City of Gallup Fire Department and New Mexico State Police. \n\nManagement System\nWithin the management and administrative roles of the GPSWCF, responsibility has been defined to coordinate and implement the RMProgram.  Overall development and management of the RMProgram is the responsibility of the RMProgram Manager.  The Water Systems Superintendent is the designated RMProgram Manager.  The RMProgram Coordinator reports to the RMProgram Manager and is responsible for the day-to-day coordination and implementation of the RMProgram.  The Assistant Superintendent is the designated RMProgram Coordinator.  The RMProgram Coordinator will delegate various GPSWCF operators to assist in the implementation of the RMProgram.  Additional program oversight is provided by the City of GallupA?s Utilities Director and Safety Officer who act as auditors of the programA?s implementation and overall quality.\n\n5-Year Accident History\nAny accidental releases from covered processes that resulted in deaths, injuries, or significant property damage on site, or known offsite deaths, injuries, evacuations, "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000007534,
      "SummaryText": "sheltering in place, property damage, or environmental damage must be reported in the RMProgram submission to EPA.  Based upon interviews with plant operations, maintenance, safety, and training staff and management, no such chemical release has occurred at Santa Fe in the last five years.\n\nChemical Release Prevention Program\nSanta Fe has a chemical release prevention program in place for the chlorination process.  Key provisions of the prevention program are as follows:\n\n1. Written procedures have been prepared for the chlorination process, including directions for safe startup and shutdown operations and emergency shutdown;\n\n2. Employees who operate the chlorination system must receive training initially and periodically on safe startup and shutdown operations and emergency shutdown;\n\n3. Incidences, including minor releases are investigated to improve the safety of the chlorination process;\n\n4. Once completed, incident investigations are shared with employees;\n\n5. A hazard review, which identifies potential hazards and ways to improve the safety of the chlorination process, is conducted every five years, or when significant changes are made to the process;\n\n6. A maintenance program is in place to prevent accidental chemical releases that may result from mechanical failure of improperly maintained equipment.  Maintenance practices are consistent with guidance provided by the Chlorine Institute; and\n\n7. Compliance audits are conducted every three years to evaluate the RMProgram and its implementation for compliance with the EPA RMP Standard.\n\nEmergency Response Program\nSanta Fe has an emergency response program in place.  This program consists of personnel trained to recognize releases, assess the situation, and engage the proper emergency response personnel.  When external emergency response is required, GWPSCF personnel will notify the City of Gallup Fire Department and the New Mexico State Police then establish an incident command system.  Incident command is tra"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000007534,
      "SummaryText": "nsferred to the Fire Department or the New Mexico State Police upon their arrival.  GWPSCF personnel familiar with the chlorination process remain on site to assist the emergency response agencies if necessary.  The Fire Department and New Mexico State Police have access to additional emergency response resources, including the Local Emergency Planning Committee, Highway and Transportation Department, Department of Health, Chlorine Institute and the EPA."
    }
  ]
}