{
  "FacilityID": 1000060739,
  "FacilityName": "Conagra Brand  - Waterloo",
  "FacilityStr1": "2701 Midport Blvd",
  "FacilityStr2": null,
  "FacilityCity": "Waterloo",
  "FacilityState": "IA",
  "FacilityZipCode": "50703",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "19013",
  "LEPC": "Black Hawk County LEPC",
  "FacilityLatDecDegs": "42.544588",
  "FacilityLongDecDegs": "-092.390776",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "A1",
  "LatLongDescription": "PU",
  "FacilityURL": "www.conagrafoods.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 52906513,
  "ParentCompanyName": "ConAgra Brands, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 7258908,
  "Company2DUNS": 0,
  "OperatorName": "Steve Schultz",
  "OperatorStr1": "2701 Midport Blvd.",
  "OperatorStr2": null,
  "OperatorCity": "Waterloo",
  "OperatorStateFIPS": "IA",
  "OperatorZipCode": "50703",
  "OperatorZipCodeExt": null,
  "RMPContact": "Steve Schultz",
  "RMPTitle": "Plant Manager",
  "FTE": 195,
  "OtherEPAFacilityID": "5070WCNGRF271MI",
  "EPAFacilityID": "100000214403",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-04-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-05-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-11-08 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-11-08 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-11-08 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000075886,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000060739,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000077068,
          "ProcessID": 1000075886,
          "NAICSCode": "311919",
          "_desc": {
            "NAICS_CODE": "311919",
            "NAICS_DESCRIPTION": "Other Snack Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000094033,
          "ProcessID": 1000075886,
          "ChemicalID": 56,
          "Quantity": 11168.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000594033,
          "ProcessID": 1000075886,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060739,
      "SummaryText": "Executive Summary\n\n\n\nConAgra Foods\n\n2701 Midport Boulevard\n\nWaterloo, Iowa 50703\n\n\n\nRisk Management Plan Executive Summary - Ammonia Refrigeration System \n\nSystem Total Charge = 11,168 lbs.\n\nRMP Facility ID #:  RMP Facility ID#:  1000 0021 4403\n\n\n\n1. Accidental Release Prevention and Emergency Response Policies\n\n\n\nThe ConAgra Foods pudding pack & David Sunflower Seeds processing facility located in Waterloo, Iowa is strongly committed to employee, public, and environmental safety.  This commitment is inherent to our comprehensive accidental release prevention program that covers areas such as design, installation, operating procedures, maintenance, and employee training associated with our regulated ammonia refrigeration.  It is our policy to implement appropriate controls to prevent possible releases of ammonia.  If such a release does occur, we are completely coordinated with the Waterloo Fire Department for emergency response support.\n\n\n\n2. The Stationary Source and the Regulated Substances Handled\n\n\n\nThe only Risk Management Program (RMP) regulated substance present is anhydrous ammonia which is utilized as the primary cooling media in our closed-loop refrigeration system.  The system is calculated to contain 11,168 lbs. of ammonia.\n\n\n\nThe purpose of the refrigeration system(s) is to provide cold storage capabilities for the perishable products.  The ammonia is used to cool glycol that is then used in the plant for the required cooling.  There is one Engine Room located on the east area of the building.\n\n\n\nDue to the size and characteristics of our ammonia refrigeration system, as well as Process Safety Management (PSM) applicability, this facility is covered under Program 3 of the RMP regulations.\n\n\n\nHere is a summary of some of our recent RMP activity:\n\n\n\n?    April 7, 2011 - Initial RMP Submittal\n\n?    April 8, 2016 - De-Registered the RMP as the system was pumped out and recharged with 8,898 lbs. of ammonia back in 2013\n\n?    November, 2016 - Updated & submitted to R"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060739,
      "SummaryText": "MP based on a corporate 08/13/16 Charge Management Report \n\n\n\n3. The General Accidental Release Prevention Program and the Chemical-Specific Prevention Steps\n\n\n\nOur facility has taken all necessary steps to comply with the accidental release prevention requirements set out under 40 CFR Part 68.  Our facility is also subject to the OSHA PSM standard under 29 CFR 1910.119, as well as the EPCRA Section 302 and 311/312 notification/reporting requirements.  The following sections briefly describe the elements of the accidental release prevention program that are in place at our facility.\n\n\n\nProcess Safety Management\n\n\n\nThe ConAgra Waterloo facility maintains a detailed record of safety information that describes the chemical hazards, operating parameters, and equipment designs associated with the ammonia refrigeration system.\n\n\n\nProcess Hazard Analysis\n\n\n\nOur facility conducts comprehensive studies to ensure that hazards associated with our ammonia refrigeration system are identified and controlled efficiently.  The methodology used to carry out these analyses is What If Scenarios.  The studies are undertaken by a team of qualified personnel with expertise in refrigeration engineering and process operations, and are re-evaluated at a minimum of every five (5) years.  Any findings related to the Process Hazard Analysis (PHA) are addressed in a timely manner.\n\n\n\nOperating Procedures\n\n\n\nFor the purpose of safely conducting activities related to our ammonia refrigeration system, ConAgra Foods Waterloo maintains written operating procedures.  These procedures address various modes of operation including startup, normal operations, emergency operations, normal shutdown, emergency shutdown, and pump out.  The information is regularly reviewed and is readily accessible to all operators who work with the ammonia refrigeration system.\n\n\n\nTraining\n\n\n\nThe ConAgra Foods Waterloo facility has a comprehensive training program in place to ensure that authorized employees, who are workin"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000060739,
      "SummaryText": "g with the ammonia refrigeration system, are competent in all relevant operating procedures.  Refresher training is provided at least every three (3) years and more frequently as needed.\n\n \n\nMechanical Integrity\n\n\n\nThe ConAgra Foods Waterloo facility carries out highly documented maintenance checks on ammonia refrigeration system equipment to ensure proper operations.  Process equipment examined by these checks includes among others; pressure vessels, piping systems, pressure relief valves, emergency shutdown systems, controls and pumps.  Maintenance operations are carried out by qualified personnel with previous training in applicable maintenance practices.  Furthermore, these personnel are offered specialized training as needed.  Any equipment deficiencies identified by the maintenance checks are corrected in a safe and timely manner.\n\n\n\nManagement of Change\n\n\n\nWritten procedures are in place at the ConAgra Foods Waterloo facility to manage changes in ammonia refrigeration system technology, equipment, and procedures.  Authorized employees whose job tasks are affected by an ammonia refrigeration system modification are promptly made aware of and offered training to deal with the modification.\n\n\n\nPre-Startup Reviews\n\n\n\nPre-startup safety reviews are conducted any time the ammonia refrigeration system, or any of its components, are opened for repairs, tie-ins, or modifications.  These reviews are conducted to confirm that construction, equipment, operating procedures, and maintenance procedures are suitable for safe startup prior to placing equipment into operation.\n\n\n\nCompliance Audits\n\n\n\nConAgra Foods Waterloo facility conducts PSM/RMP audits on a regular basis to determine whether the provisions set out under the RMP rule are being implemented.  The audit of the full PSM/RMP programs will be carried out at least every three (3) years.  Any corrective actions required as a result of these audits will be undertaken in a safe and timely manner.\n\n\n\nIncident Investiga"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000060739,
      "SummaryText": "tion\n\n\n\nConAgra Foods Waterloo facility promptly investigates any incident that has resulted in, or could have reasonably resulted in, an unintentional release of ammonia.  These investigations are undertaken to identify the situation leading to the incident, as well as to define any corrective actions implemented to prevent the release from reoccurring.  All reports are retained for a minimum of five (5) years.\n\n\n\nEmployee Participation\n\n\n\nConAgra Foods Waterloo facility truly believes that PSM and accident prevention is a team effort.  Company employees are strongly encouraged to express their views concerning accident prevention issues and to recommend improvements.  In addition, our employees have access to information related to PSM and RMP implementation, including Process Hazard Analysis (PHA) information.\n\n\n\nContractors\n\n\n\nOn occasion, our company hires contractors to conduct specialized maintenance and/or construction activities related to the ammonia refrigeration system.  Prior to selecting a contractor, a thorough evaluation of safety performance of the contractor is carried out.  ConAgra Foods Waterloo facility has a policy of informing the contractors of known potential hazards related to the contractor's work with the ammonia refrigeration system.  Contractors are also informed of all the procedures for emergency response should an accidental release of ammonia occur.\n\n\n\n4. Five-year Accident History\n\n\n\nConAgra Foods Waterloo facility has not had an incident associated with the ammonia refrigeration system that trigged the five-year accident history criteria.\n\n\n\n5. Emergency Preparedness Plan\n\n\n\nConAgra Foods Waterloo facility's Emergency Plan focuses on evacuation of the facility in the event of an emergency, with local emergency response agencies performing all rescue, firefighting, first-aid, medical treatment, and other response functions.  The facility maintains a written Emergency Action Plan to document specific procedures to be implemented in "
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000060739,
      "SummaryText": "the event of various emergencies, including an ammonia release.  The plan includes procedures for facility evacuation, as well as for notification of the local emergency response agencies and the public. As needed and in a timely manner, the plan is updated to reflect any pertinent changes taking place within the facility that would require modified procedures.\n\n\n\nThe Waterloo Fire Department is the primary emergency response agency for all facility emergencies. \n\n \n\n6. Planned Changes to Improve Safety\n\n\n\nThe facility has implementing the components of the Program Level 3 RMP and associated PSM program, which has resulted in improved safety at our facility. Some of these components include ammonia refrigeration system safety training, employee training, management of change procedure, standard and emergency operation procedures, incident investigation procedures, RMP compliance audits, & etc.\n\n"
    }
  ]
}