{
  "FacilityID": 1000096306,
  "FacilityName": "Fairburn Regional Distribution Center",
  "FacilityStr1": "1555 Oakley Industrial Boulevard",
  "FacilityStr2": null,
  "FacilityCity": "Fairburn",
  "FacilityState": "GA",
  "FacilityZipCode": "30213",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "13121",
  "LEPC": "Fulton County LEPC",
  "FacilityLatDecDegs": "33.531667",
  "FacilityLongDecDegs": "-084.596667",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "P1",
  "LatLongDescription": "PG",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "SC Johnson & Son",
  "Company2Name": null,
  "CompanyDUNS": 6091417,
  "Company2DUNS": null,
  "OperatorName": "DHL Supply Chain",
  "OperatorStr1": "1555 Oakley Industrial Boulevard",
  "OperatorStr2": null,
  "OperatorCity": "Fairburn",
  "OperatorStateFIPS": "GA",
  "OperatorZipCode": "30213",
  "OperatorZipCodeExt": null,
  "FTE": 83,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000186452",
  "OSHA_PSM": "No",
  "EPCRA_302": "Yes",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-08-15 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2024-03-21 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-09-27 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2021-09-27 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-09-27 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 33.53507,
  "FRS_Long": -84.59753,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R09",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000119433,
      "AltID": "Aerosol Product Storage",
      "FacilityID": 1000096306,
      "ProgramLevel": 1,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000149416,
          "ProcessID": 1000119433,
          "ChemicalID": 155,
          "Quantity": 16661031.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000131933,
              "ProcessChemicalID": 1000149416,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000131932,
              "ProcessChemicalID": 1000149416,
              "ChemicalID": 107
            },
            {
              "FlamMixChemID": 1000131931,
              "ProcessChemicalID": 1000149416,
              "ChemicalID": 118
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000120786,
          "ProcessID": 1000119433,
          "NAICSCode": "49311",
          "_prev_prog_3": [],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000096306,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2018-08-15 00:00:00",
    "ERTrainingDate": "2020-07-28 00:00:00",
    "CoordinatingAgencyName": "Fairburn Fire Department",
    "CoordinatingAgencyPhone": "4047307911",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "Yes",
    "FR_OPA90": "No",
    "FR_EPCRA": "No",
    "FR_OtherRegulation": null,
    "ExercisePlan": "No",
    "ExercisePlanDate": null,
    "NotificationDrill": "No",
    "NotificationDrillDate": null,
    "TabletopExercise": "No",
    "TabletopExerciseDate": null,
    "LEPCCoordination": "No",
    "LEPCCoordinationDate": null,
    "LEPCCoordinationReason": null,
    "LocalResponseAgencyCoordination": "No",
    "LocalResponseAgencyCoordinationDate": null,
    "LocalResponseAgencyCoordinationReason": null,
    "StationarySource": "No"
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000096306,
      "SummaryText": "Fairburn Regional Distribution Center\r\n\r\nA Risk Management Plan has been implemented at the Fairburn facility for the prevention of accidental releases of hazardous materials. The facility is located at 1555 Oakley Industrial Boulevard in Fairburn (Fulton County) Georgia. The facility is a storage and distribution warehouse that houses consumer products, packaged in aerosol cans, manufactured by SC Johnson & Son (SC Johnson). SC Johnson is a privately held, family-managed company, with worldwide headquarters located in Racine, Wisconsin. \r\n                                                                                                                                                                          \r\nLiquefied Petroleum Gas (LPG) propellant used in aerosol products contains several components that are classified as flammable materials under EPA's RMP regulations. Specifically, the propellants consist of propane, butane and isobutane blends. The maximum projected quantities (cases) of aerosol products stored in the warehouse and product propellant weights were used to estimate maximum quantities of RMP-regulated chemicals in the warehouse storage process. \r\n\r\nThe worst case scenario performed, based on EPA's Offsite Consequence Analysis Guidance, indicates that the distance to the 1 psi overpressure endpoint will not extend beyond plant property. No offsite receptors are impacted. There have also been no prior accidents at the facility resulting in any offsite environmental impacts.\r\n\r\nEmergency response activities at the Fairburn Facility are coordinated with the Fulton County LEPC and the Fairburn Fire Department.\r\n\r\nThe maximum number of pallets storing flammable mixture-containing products is consistent with that which had historically been reported, which was based on the best information available at the time it was prepared. The historic information was reviewed in 2021 and conservatively refined as follows:\r\n\r\n1. The number of pallets of aerosol produ"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000096306,
      "SummaryText": "cts remained the same at 9,200 pallets; however, the relative distribution for use with Level 1 vs. Level 2/3 aerosols was refined, as discussed below.\r\n2. The number of cases per pallet was increased from 110 to 205 cases per pallet, as a worst-case; however, the actual number of cases per pallet generally varies by product depending on packaging & transportations requirements.\r\n3. The number of cans per case (i.e., 12 cans/case) remained the same.\r\n4. The worst-case amount of propellant per can was increased from 0.33 lb/can to 0.73 lb/can for Level 1 aerosols (as Raid Max Flying Insect Killer) and 0.74 lb/can for Level 2/3 aerosols (as Raid Max Concentrated Deep Reach Fogger).\r\n5. The worst-case release has been increased from one can to a full-case of 12-cans.\r\n6. For continuity with the original reporting approach, the flammable mixture mass reported in Sec. 1.17.c (16,661,031 lbs) is the total of the reportable flammable chemicals, while the total mass of the entire mixture is calculated at 19,260,863 lbs.\r\n\r\nThe fourth item is expected to result in a more refined approximation of the worst-case amount of flammable mixture in individual containers for use in calculating the worst case release scenario, given it is realistic to expect that when the above-noted Raid products are present onsite, there will be at least one case that may contribute to release. For continuity, this refinement was then conservatively extrapolated to estimate the maximum aggregate amount of flammable mixture that may be present onsite for the purpose of assessing applicability relative to whether the 10,000 lb TQ is exceeded. To this end, we estimated that 3,892 pallets of Level 1 aerosols would all be as Raid Max Flying Insect Killer, and that 5,308 pallets of Level 2/3 aerosols would all be as Raid Max Concentrated Deep Reach Fogger. While such is expected to provide a conservative worst-case aggregate amount for applicability assessment purposes, such is not reasonable to expect in"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000096306,
      "SummaryText": "practice because at any given time, there will be more than one type of Level 1 aerosol product, and more than one type of Level 2/3 aerosol product onsite - each with varying amounts of flammable mixtures (expected to be less than or equal to that which is noted under Item 4, above). The relative\r\nmix of products at any given time depends on numerous variables (e.g., market demand, distribution needs). Regardless of the actual mix of products, the TQ is expected to be triggered - whether using the historic estimate or the conservatively refined 2021 estimate. In practice, the estimate maintained prior to the 2021 submittal may provide a more realistic approximation of a maximum aggregate amount of flammable mixture that may reasonably be expected at any given time given the variability in the relative amounts of products and the flammable mixture content thereof."
    }
  ]
}