{
  "FacilityID": 1000001664,
  "FacilityName": "North Hollywood Wells Chlorination Station",
  "FacilityStr1": "11805 Vanowen Street",
  "FacilityStr2": null,
  "FacilityCity": "North Hollywood",
  "FacilityState": "CA",
  "FacilityZipCode": "91605",
  "Facility4DigitZipExt": "6031",
  "FacilityCountyFIPS": "06037",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.194167",
  "FacilityLongDecDegs": "-118.390278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "ST",
  "FacilityURL": "www.ladwp.com",
  "FacilityEmailAddress": "water@ladwp.com",
  "FacilityDUNS": 0,
  "ParentCompanyName": "City of Los Angeles Department of Water and Power",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Department of Water and Power",
  "OperatorStr1": "111 North Hope Street",
  "OperatorStr2": "Room 1449",
  "OperatorCity": "Los Angeles",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "90012",
  "OperatorZipCodeExt": "2607",
  "FTE": 0,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000138424",
  "OSHA_PSM": 0,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2006-12-14 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2009-06-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-06-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2009-06-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-06-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": 34.19404,
  "FRS_Long": -118.39027,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000002190,
      "AltID": "Chlorination",
      "FacilityID": 1000001664,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000002413,
          "ProcessID": 1000002190,
          "ChemicalID": 62,
          "Quantity": 12000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000002296,
          "ProcessID": 1000002190,
          "NAICSCode": "22131",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000001365,
              "Process_NAICS_ID": 1000002296,
              "SafetyReviewDate": "2009-03-09 00:00:00",
              "PHA_Date": "2009-03-13 00:00:00",
              "PHA_WhatIf": 0,
              "PHA_Checklist": 0,
              "PHA_WhatIfChecklist": 0,
              "PHA_HAZOP": 1,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2010-06-21 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 1,
              "MH_Overfilling": 1,
              "MH_Contamination": 1,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 1,
              "MH_Floods": 0,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 1,
              "PC_Scrubbers": 1,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 1,
              "PC_EmergencyPower": 1,
              "PC_BackupPump": 1,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 0,
              "MS_Dikes": 0,
              "MS_FireWalls": 0,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 0,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 1,
              "MS_Neutralization": 0,
              "MS_None": 0,
              "MS_OtherType": "Halogen Valve Actuators",
              "MD_ProcessAreaDetectors": 1,
              "MD_PerimeterMonitors": 0,
              "MD_None": 0,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 1,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 1,
              "CH_NoneRequired": 0,
              "CH_None": 0,
              "CH_OtherChanges": "Chlorine mini-scrubber has been installed",
              "OpProceduresReviewDate": "2008-12-14 00:00:00",
              "TrainingReviewDate": "2009-03-17 00:00:00",
              "TR_Classroom": 1,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2009-04-03 00:00:00",
              "EquipmentInspectionDate": "2009-05-20 00:00:00",
              "EquipmentTested": "Cl2 leak sensor",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2009-05-07 00:00:00",
              "PreStartupReviewDate": null,
              "ComplianceAuditDate": "2009-02-19 00:00:00",
              "AuditCompletionDate": "2009-05-06 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2009-05-07 00:00:00",
              "HotWorkPermitReviewDate": "2009-05-07 00:00:00",
              "ContractorSafetyReviewDate": "2009-05-07 00:00:00",
              "ContractorSafetyEvalDate": null,
              "CBI_Flag": 0,
              "Description": "The LADWP accident release prevention program is based on the following key elements:A?High level of training of the operators,Preventive maintenance program, Use of state-of-the-art process and safety equipment, Use of accurate and effective operating procedures, written with the participation of the operators, Performance of a process hazard analysis of equipment and procedures, Implementation of an auditing and inspection program. Chemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, presence of chlorine detectors with remote monitoring, use of Halogen actuators on ton containers feeding liquid chlorine, and a chlorine scrubber.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000001628,
                  "PreventionProgram3ID": 1000001365,
                  "ProcessChemicalID": 1000002413
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000001664,
    "ER_CommunityPlan": 0,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2009-05-01 00:00:00",
    "ERTrainingDate": "2009-05-06 00:00:00",
    "CoordinatingAgencyName": "Los Angeles Fire Department",
    "CoordinatingAgencyPhone": "8187568889",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 0,
    "FR_RCRA": 0,
    "FR_OPA90": 0,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000001664,
      "SummaryText": "Chlorine is the most commonly used substance for disinfecting drinking water.  The addition of chlorine or chlorine compounds to water is called chlorination.  Chlorination is considered to be the most important process for preventing the spread of waterborne disease in drinking water.  The Los Angeles Department of Water and Power (LADWP) also uses chlorine for drinking water disinfection purposes to protect public health per state and federal water quality standards.  Storing and handling large quantities of chlorine can create hazardous situations.  LADWP takes safety obligations in storing and using chlorine as seriously as it takes providing safe drinking water.  The LADWP North Hollywood Wells Chlorination Station chlorine handling process is subject to the U.S. Environmental Protection Agency (EPA) Risk Management Program and Plan and also to the California Accidental Release Prevention (CalARP) Program requirements.  The facilities subject to the EPA and CalARP regulations are required to prepare and update Risk Management Plans (RMPs).  The RMP is to include policies and procedures followed to safely operate the facility and the actions which will be taken by the facility in an event of an emergency.  LADWP prepared and submitted the RMPs for the North Hollywood facility in June 1999 and June 2004.  This RMP is the five-year update of the June 2004 RMP.  LADWP prepared a Program Level 2 RMP in 2004 because North Hollywood Wells Chlorination Station is not subject to PSM regulations.  In the excess of caution, LADWP has now decided to prepare a Program Level 3 RMP.  Thus, this 2009 update of the RMP demonstrates compliance with the Program Level 3 requirements. \n\nThe following information is specifically required in the RMP Update Executive Summary: \n\nA?    Accidental release prevention and emergency response policies.\nA?    General facility and regulated substances information.\nA?    Summary of the accidental release prevention program and chemical-specific preventi"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000001664,
      "SummaryText": "on steps.\nA?    Five-year accident history summary.\nA?    Emergency response program summary.\nA?    Planned changes to improve safety.\n\nThe above information for the North Hollywood Wells Chlorination Station is provided below.\n\nAccidental Release Prevention and Emergency Response Policies\n\nThe LADWP accidental release prevention policy involves a unified approach that integrates the use of proven technology, trains staff in operation and maintenance practices, and uses tested and proven management system practices.  All applicable requirements of the State of California and EPAA?s Prevention Program are adhered to, including key elements such as training, systems management, and emergency response procedures.  \n\nThe LADWP emergency response policy involves the preparation of emergency response plans for hazardous materials which are tailored to each facility and to the emergency response services available in the community, and is in compliance with the EPA and CalARP Program Emergency Response Program Requirements.  The LADWP has prepared an Emergency Response Plan for the North Hollywood Wells Chlorination Station to facilitate coordination and emergency planning with offsite response officials and facilities in the event of an emergency.  The emergency response plan has been coordinated with local response agencies (City of Los Angeles Fire Department).  The North Hollywood Wells Chlorination Station has an excellent record in preventing accidents from occurring.\n\nGeneral Facility and Regulated Substance Information\n\nThe North Hollywood Wells Chlorination Station is located at 11805 Vanowen Street, North Hollywood, California. This facility chlorinates well water before being supplied to parts of the San Fernando Valley.  The station consists of a chlorination room, a chlorine storage room, an instrument room, and a two-ton capacity chlorine scrubber in the basement.  The facility currently stores chlorine, a regulated toxic substance under the EPA and CalARP Program rul"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000001664,
      "SummaryText": "es.  A maximum of six one-ton chlorine containers is stored at the North Hollywood Wells chlorine building.  Four of these chlorine containers are connected to the chlorination process to feed liquid and gaseous chlorine and two others are stored as spares.  The one-ton container is the largest vessel (container) on line. The maximum quantity of chlorine present at the North Hollywood Wells Chlorination Station at any given time exceeds the listed threshold quantities in the EPA and CalARP rules.  It also exceeds the listed threshold quantities in the federal and California Occupational Safety and Health Administration (OSHA) Process Safety Management (PSM) Standards. However, the facility is normally unstaffed and water treatment operators visit the facility daily and respond to any trouble alarms which may occur.  Thus, the LADWP North Hollywood Wells facility is not subject to federal or California OSHA PSM regulations.\n\nIn normal operation, two chlorine 1-ton containers are manifolded together into a liquid header that connects to the evaporators.  These containers are equipped with Halogen actuators on the angle valves and feed liquid chlorine under pressure.  The actuators will close the angle valves when a chlorine concentration of 10 ppm is detected in the room.  Two additional ton containers with actuators are connected through a gas supply header.  They bypass the evaporators, serving as an automatic backup when the primary containers run dry or the evaporator shuts down due to a low temperature condition. Space is allocated in the room for the storage of two additional containers that are not provided connections to the system.  \n\nThe liquid chlorine passes from the containers through the evaporators where it is vaporized in a water bath.  The gaseous chlorine then proceeds to one of the three chlorinators that regulate the flow of chlorine.  From there, gas then travels under vacuum to the injectors.\n\nThere are four injectors located in an underground va"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000001664,
      "SummaryText": "ult (injectors currently being relocated to the wall inside the chlorinator room) which draw chlorine gas into mixing water to form a concentrated solution.  The solution is piped to diffuser tubes located in the water distribution pipelines.\n\nResidual chlorine analyzers monitor residual chlorine downstream of the diffusers. \n\nChlorine leak detectors are provided to detect chlorine leaks in the chlorine container room and the chlorinator room.  The detectors activate an alarm system which includes:  (1) flashing red lights over the entry door to the buildings, (2) an audible alarm within the chlorination building, and (3) an alarm at the Los Angeles Aqueduct Filtration Plant (LAAFP) at Sylmar.\n\nThe station has installed a caustic solution main scrubber actuated by chlorine detectors at a chlorine concentration of 3 ppm which can neutralize up to 4,000 lb of chlorine in case of a chlorine leak. \n\nA dry media chlorine A?mini-scrubberA? unit (MS) has also been installed at the NHWCS. MS is an emergency chlorine scrubber intended to protect personnel working in the building or immediate area from a chlorine gas release from the chlorinator vents.  It can neutralize up to 25 lbs of chlorine, and the media manufacturer specifies chlorine removal to less than 5 parts per billion.\n\nIn the event power is lost at the chlorination facility, an alarm will alert the LAAFP control room.  Chlorine flow will continue unaffected, with no safety consequences.  The chlorine scrubber has two pumps to supply caustic to the scrubber.  One pump operates and the other is a spare.  The station is powered by two separate power supplies. \n\nThe facility is normally unstaffed; water treatment operators visit the facility daily. A response team coordinated from LADWP Los Angeles Aqueduct Filtration Plant (LAAFP) responds to any trouble alarms which may occur. Access to the facility is through gates, which are kept locked all the time.\n\nSummary of the Accidental Release Prevention Program and Che"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000001664,
      "SummaryText": "mical-Specific Prevention Steps\n\nThe LADWP accidental release prevention program is based on the following key elements:\n\nA?    Detailed management system and clear levels of responsibilities and team member roles.\nA?    Comprehensive process safety information that is readily available to staff, emergency responders, and contractors.\nA?    Comprehensive preventive maintenance program.\nA?    Performance of process hazard analysis of equipment and procedures with operation and maintenance staff participation and review.\nA?    Use of state-of-the-art process and safety equipment.\nA?    Use of accurate and effective operating procedures, written with the participation of the operators.\nA?    High level of training of the operators and maintenance staff.\nA?    Implementation of an incident investigation, inspection, and auditing program using qualified staff.\n\nChemical-specific prevention steps include availability of self-contained breathing apparatus (SCBA), worn by the operators during connection/disconnection of chlorine supply, awareness of the hazardous and toxic properties of chlorine, presence of chlorine detectors with remote monitoring, the use of Halogen actuators on the ton containers feeding liquid chlorine, a chlorine main scrubber, and a chlorine mini-scrubber.\n\nProcess and Chemical Safety Information\n\nComprehensive chemical data has been assembled to include regulatory reporting and action thresholds, health hazard, and chemical exposure limitations, as well as detailed physical properties of chlorine.  This information includes chlorine background information and MSDS sheets.\n\nEquipment safety information was compiled on the chlorine process.  Specifications for the chlorine process are collected and provided in one place for easy reference.  Details such as maximum intended inventory; safe upper and lower temperatures; and safe upper and lower pressures for the chlorination facility are on file at the facility.  LADWP also has procedures in place that are triggered to update "
    },
    {
      "ESSeqNum": 5,
      "FacilityID": 1000001664,
      "SummaryText": "process safety information if there is a major change that makes existing information inaccurate.\n\nProcess Hazard Analysis \n\nIn 1991, a detailed hazard review/process hazard analysis was conducted for the chlorination system equipment and procedures.  The hazard review was further reviewed in April 1999.  In April 2004 a hazard review was again performed for the whole chlorination system. The 2004 hazard review/PHA was further reviewed on March 13, 2009 and will be updated again within a five-year period or whenever there is major change in the process.  A list of recommended actions was developed in March 2009 to further improve the chlorine safety and staff is currently evaluating these recommendations.  Staff will document the completion of the recommended actions.\n\nA seismic walkthrough was completed on April 1, 2009 based on the LEPC Region 1 guidance document, and recommendations are being evaluated for implementation.\n\nOperating Procedures\n\nLADWP has prepared written operating procedures for North Hollywood Wells chlorination facility that provide clear instructions or steps for safely conducting activities relating to chlorination process. They are consistent with the chlorine safety information.  Written operating procedures included in the facilityA?s Operation and Maintenance Manual include:\n\nA?    Delivery of Chlorine\nA?    Container Connections\nA?    Initial Startup Procedure\nA?    Normal Operation\nA?    Normal Shutdown\nA?    Temporary Operations\nA?    Emergency Operations\nA?    Emergency Shutdown\nA?    Startup Following Emergency Shutdown\n\nTraining \n\n    The LADWP ensures that each employee operating or maintaining the chlorination process, and each employee newly assigned to this process, is trained and tested for competency in the operating procedures listed above. The LADWP employee training documentation files include training records for each employee assigned to operate or maintain the chlorination process. The training ensures that the employee has the required knowledge, sk"
    },
    {
      "ESSeqNum": 6,
      "FacilityID": 1000001664,
      "SummaryText": "ills, and abilities to safely carry out the duties and responsibilities, including chlorine emergency response, as provided in the operating procedures.  Employee training includes as a minimum the following elements:\n\nA?    Safety Information.\nA?    Process Technology and Process Equipment, including safety systems.\nA?    Maintenance Procedures.\nA?    Operating Procedures for the chlorine system.\nA?    RMP Program contents.\nA?    Emergency Response Plan and Procedures.\n\nRefresher training is provided at least every three years to each employee operating the chlorination process to ensure that the employee understands and adheres to the current operating procedures.  In addition, LADWP ensures that operators are trained in any updated or new procedures prior to startup of a process after major modifications.  Training programs for the North Hollywood Wells Chlorination Station were most recently reviewed on March 17, 2009.\n\nContractors\n\nLADWP Contractor procedures specify the information required to be provided to the contractors performing work on or near the chlorination process, the training requirements for contractor employees, and mechanism to obtain assurance from contractors that they have informed their employees of the appropriate safety rules.  LADWP provides information and explanations concerning the hazards and processes. \n\nPre-Startup Safety Review and Mechanical Integrity Program\n\nLADWP has procedures in place to ensure that a pre-startup safety review is conducted prior to starting a new covered process or prior to making modifications to the chlorination systems that require a MOC procedure implementation.  The required conditions prior to startup include:\n\nA?    Construction and/or equipment are in accordance with design specifications.\nA?    Safety, operating, maintenance, and emergency procedures are in place and are adequate.\nA?    A PHA has been performed for any new facilities and recommendations have been resolved or implemented prior to startup.\nA?    At modified facili"
    },
    {
      "ESSeqNum": 7,
      "FacilityID": 1000001664,
      "SummaryText": "ties, MOC requirements have been met.\nA?    Training of each operating and maintenance employee involved in the process is complete.\n\nThese procedures ensure that no new/significantly modified process will start-up and no regulated substances will be introduced into such a process prior to the pre-startup safety review.  This constitutes a final check that the process and equipment are ready to go and that the recommendations of the PHA have been implemented or adequately addressed.  This will ensure that the design and construction of a new or modified process is safely executed and that the facility is prepared to operate it. \n\nMechanical integrity procedures for the plant ensure that written maintenance procedures are implemented and documented, including training of maintenance personnel.\n\nMaintenance \n\nThe LADWP operates a MAXIMO Program that generates a task order for performance of the preventive maintenance routine after a designated time past the closing of the previous task order for that maintenance.  Description of the work to be performed is included with the printed work order.  The water treatment supervisor is responsible for this task.  \n\nIn addition, the written maintenance procedure is provided in the Operation and Maintenance Manual as follows: Preventive maintenance schedules are provided which summarize inspection, test, and maintenance schedules on a daily, weekly, bi-monthly, monthly, biannual, annual, every 2 to 10 years, and as-needed basis.  These allow the operator to rapidly review what maintenance is necessary.  The schedules are supplemental to the log sheets on-site and provide a summary and quick reference to manufacturer's O&M manuals.  A maintenance log book is provided on-site for quick reference by the Operator.\n\nLADWP documents inspection, testing, and maintenance of chlorination equipment and assures the performance is done in accordance with the recommendations of the manufacturer and industry groups (i.e., Chlorine Institute).\n\n"
    },
    {
      "ESSeqNum": 8,
      "FacilityID": 1000001664,
      "SummaryText": "Hot Work Permits and Management of Change \n\nHot work refers to work involving electric or gas welding, cutting, brazing, or similar flame or spark producing operations.  The procedures call for the issuance of a hot work permit whenever it is conducted on or near the chlorination process and other areas deemed appropriate as described in the procedures.  Fire prevention and protection systems are in place prior to the issuance of the hot work permit.  The permit indicates the dates the work is authorized for, the location and specific operational requirements and is kept on file in the administrative office. \n\nLADWP Management of Change (MOC) procedures include steps required to be taken by plant personnel prior to implementing changes to chlorination equipment, procedures, raw materials, and processing conditions.  Training, process safety information, operating procedures, and maintenance procedures are updated according to the changes made.\n\nInternal Compliance Audits\n\nThe LADWP has been certifying at a minimum of every three years that compliance with Program 2 Prevention Program requirements is met and that procedures and practices developed are adequate and being followed. Starting June 21, 2009, compliance audits will seek to verify compliance with Program 3 Prevention Program requirements. \n\nThe compliance audit consists of separating the RMP program elements or sections, and auditing each element to determine compliance and effectiveness.  For each internal audit, the audit team completes a Compliance Audit Certification Page and Compliance Audit Checklist forms (one form for each prevention program requirement).  The Compliance Audit Certification Page provides process identification, the dates of the audit, team members, and certification by the audit leader.  The Compliance Audit Checklist details the requirements of each RMP element and contains questions that may assist with the auditing process. The audit checklist for each element consists of the fol"
    },
    {
      "ESSeqNum": 9,
      "FacilityID": 1000001664,
      "SummaryText": "lowing three sections:\n\nA?    Records Review: A review of the RMP written Prevention Program.\nA?    On-Site Conditions: The audit team reviews the program elements based on observation of the plant conditions and safety practices.\nA?    Interviews:  The program elements are evaluated by interviewing personnel from appropriate functions including operations, maintenance, management, and contractors.\n\nTeam members record RMP program deficiencies identified during the audit on the checklist.\n\nIncident Investigation\n\nThe LADWP incident investigation procedures describe incident reporting, investigation, and investigation reporting steps to be followed by plant personnel.  The incident investigation is started promptly but no later than 48 hours after the event.  The LADWP promptly addresses and resolves all recommendations and implements the recommendations in a timely manner to prevent an incident recurrence.  All incident investigation reports are retained on LADWP file for at least a period of five years from the date the reports are completed.\n\nFive-year Accident History Summary\n\nNo chlorine releases that could have caused safety or health hazard (deaths, injuries, property or environmental damage, evacuations, or sheltering in place) occurred at the North Hollywood Wells Chlorination Station during the last five years.\n\nEmergency Response Program Summary\n\nLADWP is a first responder, its employees respond to chlorine accidental releases.  In the event an accidental release that could result in offsite consequences occurs, external resources such as the City of Los Angeles Fire Department will be solicited to respond as well. \n\nAs part of the emergency response program, the LADWP has developed and implemented an emergency response plan for the purpose of protecting public health and the environment.  The following elements are included:\n\n(a)    An emergency response plan, maintained at the stationary source and at the Los Angeles Aqueduct Filtration Plant (LAAFP) containing:\n\nA?"
    },
    {
      "ESSeqNum": 10,
      "FacilityID": 1000001664,
      "SummaryText": "    Organizational structure (chain-of-command) and responsibilities of various LADWP personnel.\nA?    Procedures for planning and coordination with off-site emergency response organizations.\nA?    Details of the training programs for all employees involved with the chlorination process, contractor training, and medical surveillance of LADWP personnel who respond to chlorine releases.\nA?    Details of emergency recognition and prevention at the LADWP.\nA?    Procedures for informing the public and local emergency response agencies about accidental releases.\nA?    Documentation of proper first aid and emergency medical treatment necessary to treat accidental human exposures and the detailed information on emergency health care.\nA?    Procedures and measures for emergency response after an accidental release.\n\n(b)    Procedures for the use of emergency response equipment and for its inspection, testing, and maintenance. \n(c)    Training in relevant procedures for all employees involved with the chlorination process.\n(d)    Procedures to review and update, as appropriate, the emergency response plan to reflect changes and ensure that employees are informed of changes.\n\nPlanned Changes to Improve Safety\n\nAs part of updating the 1999 Risk Management Program, a process hazard analysis (PHA) was performed in 2004 for the chlorination system.  A number of equipment and procedural changes were made as part of the implementation of the recommended actions. All the above recommendations have been evaluated and implemented by the LADWP, including the installation of a dry media chlorine mini-scrubber.  An additional 29 recommendations to further improve chlorine safety were identified in March 2009, when the PHA was reviewed for the facility. Based on the seismic assessment, three recommendations were also made to improve chlorine safety. It is expected that all the recommendations will be evaluated by December 2009 and implemented by June 2010.  The implementation of these recommendations will further impro"
    },
    {
      "ESSeqNum": 11,
      "FacilityID": 1000001664,
      "SummaryText": "ve the safety of the chlorine system.\n"
    }
  ]
}