{
  "FacilityID": 1000029957,
  "FacilityName": "CordenPharma Colorado, Inc.",
  "FacilityStr1": "2075 North 55th Street",
  "FacilityStr2": null,
  "FacilityCity": "Boulder",
  "FacilityState": "CO",
  "FacilityZipCode": "80301",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "08013",
  "LEPC": "Boulder County LEPC",
  "FacilityLatDecDegs": "40.016944",
  "FacilityLongDecDegs": "-105.220278",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "UN",
  "LatLongDescription": "CE",
  "FacilityURL": "www.cordenpharma.com",
  "FacilityEmailAddress": "cpc_hr@cordenpharma.com",
  "FacilityDUNS": 76470525,
  "ParentCompanyName": "Corden US, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "CordenPharma Colorado, Inc.",
  "OperatorStr1": "2075 North 55th Street",
  "OperatorStr2": null,
  "OperatorCity": "Boulder",
  "OperatorStateFIPS": "CO",
  "OperatorZipCode": "80301",
  "OperatorZipCodeExt": null,
  "FTE": 205,
  "OtherEPAFacilityID": "COD076470525",
  "EPAFacilityID": "100000176766",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "95OPBO150",
  "SafetyInspectionDate": "2012-07-27 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2012-08-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2012-08-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2012-08-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2017-08-17 00:00:00",
  "DeRegistrationEffectiveDate": "2017-08-11 00:00:00",
  "AnniversaryDate": "2017-08-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": 40.02032,
  "FRS_Long": -105.22471,
  "FRS_Description": "PLANT ENTRANCE (GENERAL)",
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "1",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000036529,
      "AltID": "piperidine storage/charge",
      "FacilityID": 1000029957,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_chemicals": [
        {
          "ProcessChemicalID": 1000044153,
          "ProcessID": 1000036529,
          "ChemicalID": 34,
          "Quantity": 38000.0,
          "CBI_Flag": 0,
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000036968,
          "ProcessID": 1000036529,
          "NAICSCode": "325411",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000032039,
              "Process_NAICS_ID": 1000036968,
              "SafetyReviewDate": "2012-07-02 00:00:00",
              "PHA_Date": "2012-07-02 00:00:00",
              "PHA_WhatIf": 1,
              "PHA_Checklist": 1,
              "PHA_WhatIfChecklist": 1,
              "PHA_HAZOP": 0,
              "PHA_FMEA": 0,
              "PHA_FTA": 0,
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2013-04-05 00:00:00",
              "MH_ToxicRelease": 1,
              "MH_Fire": 1,
              "MH_Explosion": 0,
              "MH_RunawayReaction": 0,
              "MH_Polymerization": 0,
              "MH_Overpressurization": 1,
              "MH_Corrosion": 0,
              "MH_Overfilling": 1,
              "MH_Contamination": 0,
              "MH_EquipmentFailure": 1,
              "MH_CoolingLoss": 1,
              "MH_Earthquake": 0,
              "MH_Floods": 1,
              "MH_Tornado": 0,
              "MH_Hurricanes": 0,
              "MH_OtherType": null,
              "PC_Vents": 1,
              "PC_ReliefValves": 1,
              "PC_CheckValves": 0,
              "PC_Scrubbers": 0,
              "PC_Flares": 0,
              "PC_ManualShutoffs": 1,
              "PC_AutomaticShutoffs": 1,
              "PC_Interlocks": 1,
              "PC_Alarms": 1,
              "PC_KeyedBypass": 0,
              "PC_EmergencyAirSupply": 0,
              "PC_EmergencyPower": 0,
              "PC_BackupPump": 0,
              "PC_GroundingEquipment": 1,
              "PC_InhibitorAddition": 0,
              "PC_RuptureDisks": 1,
              "PC_ExcessFlowDevice": 0,
              "PC_QuenchSystem": 0,
              "PC_PurgeSystem": 0,
              "PC_None": 0,
              "PC_OtherType": null,
              "MS_SprinklerSystem": 1,
              "MS_Dikes": 1,
              "MS_FireWalls": 1,
              "MS_BlastWalls": 0,
              "MS_DelugeSystem": 1,
              "MS_WaterCurtain": 0,
              "MS_Enclosure": 0,
              "MS_Neutralization": 1,
              "MS_None": 0,
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": 0,
              "MD_PerimeterMonitors": 0,
              "MD_None": 1,
              "MD_OtherType": null,
              "CH_ChemicalReduction": 0,
              "CH_ChemicalIncrease": 0,
              "CH_ChangeProcessParameters": 0,
              "CH_InstallProcessControls": 0,
              "CH_InstallProcessDetection": 0,
              "CH_InstallPerimeterMonitoring": 0,
              "CH_InstallMitigationSystems": 0,
              "CH_NoneRequired": 0,
              "CH_None": 1,
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2012-02-06 00:00:00",
              "TrainingReviewDate": "2012-06-29 00:00:00",
              "TR_Classroom": 0,
              "TR_OnTheJob": 1,
              "TR_OtherType": null,
              "CT_WrittenTest": 0,
              "CT_OralTest": 1,
              "CT_Demonstration": 1,
              "CT_Observation": 1,
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2012-01-17 00:00:00",
              "EquipmentInspectionDate": "2011-06-17 00:00:00",
              "EquipmentTested": "test for sump pump 6/17/2011.  Completed for 081 tank January 2007",
              "ChangeMgmtDate": "2007-08-24 00:00:00",
              "ChangeMgmtReviewDate": "2010-05-11 00:00:00",
              "PreStartupReviewDate": "2002-12-16 00:00:00",
              "ComplianceAuditDate": "2012-02-06 00:00:00",
              "AuditCompletionDate": "2014-12-23 00:00:00",
              "IncidentInvestigationDate": "2002-05-17 00:00:00",
              "InvestigationChangeDate": "2002-06-05 00:00:00",
              "ParticipationPlansReviewDate": "2012-03-06 00:00:00",
              "HotWorkPermitReviewDate": "2011-06-29 00:00:00",
              "ContractorSafetyReviewDate": "2012-04-06 00:00:00",
              "ContractorSafetyEvalDate": "2012-06-12 00:00:00",
              "CBI_Flag": 0,
              "Description": "A 20,000 liter (16,000 liter working volume) piperidine storage tank has full secondary containment.   A concrete storage tank unloading pad with active mitigation is also installed to facilitate direct loading of the storage tank.  Per 29 CFR 1910.119, the system, including the tanker unloading station, storage tank and associated piping and containment, and piping to a \"day tank\" for process and production use, are subject to PHA and revalidation at least every 5 years.  The tank farm is outdoors, and is covered by a deluge sprinkler system.  The unloading area containment includes a sump and the entire containment area is sloped toward the sump.  A manually operated pump can be used to divert any spill to a best desired location.  An e-stop for the tanker unload is accessible from inside and outside the containment.  Procedures are in place to have quantities of citric acid available and \"at hand\" to neutralize any smaller quantities of piperidine.  The process equipment is reflected in the \"piperidine storage modification\" scenario.  A smaller vessel without secondary containment with a 12,000 liter volume is modeled as the worst case scenario.  A loading pad transfer hose leak without active mitigation was modeled as the alternative scenario.",
              "_chemicals": [
                {
                  "PrimaryKey": 1000038085,
                  "PreventionProgram3ID": 1000032039,
                  "ProcessChemicalID": 1000044153
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000029957,
    "ER_CommunityPlan": 1,
    "ER_FacilityPlan": 1,
    "ER_ResponseActions": 1,
    "ER_PublicInfoProcedures": 1,
    "ER_EmergencyHealthCare": 1,
    "ER_ReviewDate": "2012-03-13 00:00:00",
    "ERTrainingDate": "2011-08-18 00:00:00",
    "CoordinatingAgencyName": "LEPC (Amy Danzl)",
    "CoordinatingAgencyPhone": "3034413640",
    "FR_OSHA1910_38": 1,
    "FR_OSHA1910_120": 1,
    "FR_SPCC": 1,
    "FR_RCRA": 1,
    "FR_OPA90": 1,
    "FR_EPCRA": 1,
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000029957,
      "SummaryText": "RMP Executive Summary\n\n1.0 RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nCordenPharma Colorado Company, Inc. currently uses Environmental Protection Agency (EPA) Risk Management Program (RMP) regulated chemicals below threshold quantities with the exception of Piperidine. CordenPharma Colorado (CPC) has evaluated the requirements of the RMP rule and has reviewed present emergency management practices.  CordenPharma Colorado has determined that current practices meet or exceed the requirements of RMP. \n\n\n\nCordenPharma Colorado has an extensive process safety management program designed to satisfy all of Occupational Safety & Health Administration's (OSHA) Process Safety Management program requirements and the RMP.  CPC is dedicated to working with the community emergency response authorities to address the potential for releases that could affect the public.  CPC employs physical and administrative controls to mitigate potential releases.  CPC implements extensive internal training to prevent releases as well as prepare for eventualities which may result from releases.  CPC is an active member of the Local Emergency Planning Committee (LEPC) and endeavors to prepare the LEPC for the possibility of responding to releases that could originate from CPC. \n\n\n\n2.0 PROCESS DESCRIPTION AND REGULATED SUBSTANCES\n\n\n\nCPC has one regulated substance under 40 CFR 68 that exceeds the plan threshold, piperidine.  Piperidine is used in the production of pharmaceutical intermediates, and in performing research and development of new and/or improved pharmaceutical processes.  Specifically, piperidine is used in the production of anti-HIV/AIDs pharmaceuticals and treatments for irritable bowel syndrome.  Pharmaceuticals are primarily produced via synthesis routes involving organic chemicals.    \n\n\n\nThe piperidine threshold in 40 CFR 68 is 15,000 pounds.  The main process vessel containing piperidine has a maximum working capacity of 19,000 pounds.\n\n\n\nPiperidine has associated ha"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000029957,
      "SummaryText": "zards that can potentially affect on-site employees and the general public in the event of a large spill.  The worst case scenario and alternative release scenarios are described below per 40 CFR 68.\n\n\n\nPiperidine is a chemical with a pungent odor that is readily detectable below concentrations of concern.  The odor is described in literature as amine-like, heavy, sweet, floral, animal odor, or pepper-like, but always unpleasant.  Due to the odor, exposed persons will not voluntarily stay in areas of even low concentrations.  Little data regarding exposure limits is available in the literature, however CordenPharma Colorado  has been advised by expert toxicologist's to consider the following concentrations for emergency response planning purposes:\n\n    \n\n    1 ppm: It is believed that nearly all individuals could be exposed up to this airborne concentration for up to one hour without experiencing other than mild, transient adverse health effects or without perceiving a clearly defined objectionable odor. \n\n\n\n    10-100 ppm: It is believed that nearly all individuals could be exposed up to this airborne concentration range for up to one hour without experiencing or developing irreversible or other serious health effects or symptoms that could impair an individual's ability to take protective action.\n\n\n\n    100-1000 ppm: It is believed that nearly all individuals could be exposed up to this airborne concentration range for up to one hour without experiencing or developing life threatening health effects.\n\n\n\nAnticipated health effects are acute irritation/toxicity including skin irritation, corrosive effect on human tissue, nausea.  In the next section is a description of the release scenarios for piperidine and their off-site consequences:\n\n\n\n2.1 WORST-CASE SCENARIO DESCRIPTION\n\n\n\nA worst-case scenario has been developed for CPC.  Taking the specific definition of the worst-case from 40 CFR 68.25, the vessel that can store the largest quantity of piperidine has been identified.  "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000029957,
      "SummaryText": "The maximum release of piperidine possible is 19,000 pounds.  Passive controls are not applicable to this scenario, however the storage tank is in reality within a dedicated secondary containment that limits the surface area.  The worst case release would be as a liquid spill to the ground.  The area is covered by concrete, designed to slope toward sumps and drainage for control, which also limits surface area. Liquid piperidine is then subject to evaporation that may create a vapor cloud that would reach off-site receptors per EPA distance-to-endpoint factors.\n\n\n\n2.2 ALTERNATIVE RELEASE SCENARIO DESCRIPTION\n\n\n\nThe alternative release scenario is a piperidine release from a delivery tank truck.  Tank truck deliveries will be in 2000 gallon increments.  Deliveries are recieved on a concrete containment pad that is designed to contain the entire volume of the tank truck. The containment includes a sump and sump pump. The containment pad surface area is approximately 416 square feet.  The concrete pad qualifies as passive control.  Active mitigation of the release is human intervention, including use of the sump pump, and of citric acid to neutralize any piperidine that may splash out of the containment.  The alternative release scenario distance-to-endpoint will reach off-site receptors. \n\n\n\n3.0 GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL SPECIFIC PREVENTION STEPS\n\n\n\nCPC complies with OSHA's Process Safety Management (PSM) program.  The EPA has said that a process in compliance with OSHA PSM is also in compliance with RMP program level 3.  The process containing piperidine at CPC is RMP program level 3.  All elements of OSHA PSM have been implemented for the piperidine containing process.\n\n\n\nKey aspects of the PSM program include: process safety information and updates, process hazard analysis, operating procedure documentation and review, class room and on-hands training prior to system operation, mechanical integrity program, management of change prog"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000029957,
      "SummaryText": "rams, pre-startup reviews, incident investigation, routine compliance audits, special work permit programs, contractor management and qualification, and employee participation in process safety reviews.\n\n\n\n4.0 FIVE-YEAR ACCIDENT HISTORY\n\n\n\nThere have been no accidents involving RMP regulated chemicals in the last five years that have affected offsite receptors or have resulted in significant loss of property or injury of personnel.\n\n\n\n5.0 EMERGENCY RESPONSE PROGRAM\n\n\n\nCordenPharma Colorado has a comprehensive emergency response plan that addresses employee, contractor and public safety.  Moreover, CPC is committed to the protection of both its employees and the public.\n\n\n\n6.0 PLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nCordenPharma Colorado has a proactive incident investigation program that acts as a continuous mechanism to evaluate and improve safety.  A Compliance Team consisting of environmental, safety and regulatory affairs representatives conduct weekly audits and follow up of all incident reports.  Incidents are tracked according to the program and a system is in place to coordinate close out of action items and improvement of all environmental and safety control systems.  The Compliance Team conducts monthly training of employees to communicate issues and improvements learned via the audits and incident reports. \n\n\n\n\n\nVer. 8/10/12\n\n"
    }
  ]
}