{
  "FacilityID": 1000000275,
  "FacilityName": "Peter Pan Seafoods - Port Moller, AK",
  "FacilityStr1": "2200 Airport Way",
  "FacilityStr2": "Port Moller - Plant",
  "FacilityCity": "Port Moller",
  "FacilityState": "AK",
  "FacilityZipCode": "99571",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "02013",
  "LEPC": "AEB -LEPC listed as innactive",
  "FacilityLatDecDegs": "55.979167",
  "FacilityLongDecDegs": "-160.513333",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "Z4",
  "LatLongDescription": "CE",
  "FacilityURL": "www.ppsf.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": null,
  "ParentCompanyName": "Peter Pan Seafoods, Inc.",
  "Company2Name": "Maruha/Nichiro Corporation",
  "CompanyDUNS": 9249533,
  "Company2DUNS": null,
  "OperatorName": "Peter Pan Seafoods, Inc.",
  "OperatorStr1": "2200 6th Ave.",
  "OperatorStr2": "Suite #1000",
  "OperatorCity": "Seattle",
  "OperatorStateFIPS": "WA",
  "OperatorZipCode": "98121",
  "OperatorZipCodeExt": "1820",
  "FTE": 38,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185836",
  "OSHA_PSM": "Yes",
  "EPCRA_302": "No",
  "CAA_TitleV": "No",
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "1997-06-12 00:00:00",
  "SafetyInspectionBy": "State occupational safety agency",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2009-04-23 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2009-04-23 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2009-04-23 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2014-04-23 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 55.98728,
  "FRS_Long": -160.575469,
  "FRS_Description": "FACILITY CENTROID",
  "FRS_Method": "INTERPOLATION-PHOTO",
  "HorizontalAccMeasure": "100",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000000308,
      "AltID": null,
      "FacilityID": 1000000275,
      "ProgramLevel": 3,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000000321,
          "ProcessID": 1000000308,
          "ChemicalID": 56,
          "Quantity": 16200.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": []
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000000341,
          "ProcessID": 1000000308,
          "NAICSCode": "311712",
          "_prev_prog_3": [
            {
              "PreventionProgram3ID": 1000000221,
              "Process_NAICS_ID": 1000000341,
              "SafetyReviewDate": "2008-05-20 00:00:00",
              "PHA_Date": null,
              "PHA_WhatIf": "No",
              "PHA_Checklist": "No",
              "PHA_WhatIfChecklist": "Yes",
              "PHA_HAZOP": "No",
              "PHA_FMEA": "No",
              "PHA_FTA": "No",
              "PHA_OtherTechnique": null,
              "PHACompletionDate": "2006-06-05 00:00:00",
              "MH_ToxicRelease": "Yes",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "No",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "No",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "No",
              "MH_Earthquake": "Yes",
              "MH_Floods": "No",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "Yes",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "No",
              "PC_Scrubbers": "No",
              "PC_Flares": "No",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "No",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "Yes",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "No",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "No",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "No",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "Yes",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "Yes",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": null,
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "Yes",
              "CH_None": "No",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2008-05-20 00:00:00",
              "TrainingReviewDate": "2008-05-20 00:00:00",
              "TR_Classroom": "No",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": null,
              "CT_WrittenTest": "No",
              "CT_OralTest": "No",
              "CT_Demonstration": "Yes",
              "CT_Observation": "No",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2008-05-20 00:00:00",
              "EquipmentInspectionDate": "2008-05-20 00:00:00",
              "EquipmentTested": "Entire refrigeration system undergoes a throuough inspection before annual start-up.  Pressure vessels and relief valves are inspected by a state licensed inspector every three years, last done 06/07.",
              "ChangeMgmtDate": null,
              "ChangeMgmtReviewDate": "2006-06-05 00:00:00",
              "PreStartupReviewDate": "2008-05-20 00:00:00",
              "ComplianceAuditDate": "2008-05-20 00:00:00",
              "AuditCompletionDate": null,
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "ParticipationPlansReviewDate": "2008-06-05 00:00:00",
              "HotWorkPermitReviewDate": "2008-06-05 00:00:00",
              "ContractorSafetyReviewDate": null,
              "ContractorSafetyEvalDate": "2001-06-10 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000000230,
                  "PreventionProgram3ID": 1000000221,
                  "ProcessChemicalID": 1000000321
                }
              ]
            }
          ],
          "_prev_prog_2": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000000275,
    "ER_CommunityPlan": "No",
    "ER_FacilityPlan": "Yes",
    "ER_ResponseActions": "Yes",
    "ER_PublicInfoProcedures": "Yes",
    "ER_EmergencyHealthCare": "Yes",
    "ER_ReviewDate": "2009-04-10 00:00:00",
    "ERTrainingDate": "2008-06-08 00:00:00",
    "CoordinatingAgencyName": "Alaska State Emergency Response Com",
    "CoordinatingAgencyPhone": "9074287000",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "No",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000000275,
      "SummaryText": "Executive Summary\nRisk Management Plan\nPeter Pan Seafoods - Port Moller, AK\nApril, 2009\n\nFacility Description\nPeter Pan Seafoods, Port Moller is a seafood processing (freezing) plant located on the Alaska Peninsula, approximately 550 air miles SW of Anchorage.  This facility is operated seasonally during the summer months and currently processes salmon only.  The location of the plant is on the lee side of a sand spit that separates the waters of Port Moller Bight from the Bering Sea.  The facility is located within the Aleutians East Borough in a very remote setting; the nearest town is Nelson Lagoon, 25 miles to the southwest.\n\nThe processing season at Port Moller is from mid June through mid September.  Peak employment is during July when there are up to 140 employees working at the location.  The facility is on watchman status from mid September through the end of April.  For a number of years frozen salmon and salmon roe have been the only products produced at the facility.  Daily capacity of the plant is about 250,000 round pounds.  Annual poundage of salmon through the plant in recent years has ranged from 7 to 9 million pounds.  The refrigeration plant uses ammonia (anhydrous) as the refrigeration medium.  There is a maximum amount of 16,200 lbs of ammonia in the refrigeration system, in a single process.  \n\nPrevention and Emergency Response\nOperating in a remote location offers many challenges that those in less remote locations do not face.  We have to be self sufficient to a large degree in providing all of our utilities, our living and dining facilities and our protection from fire, oil spill or chemical release.  Protection of our employees and facility from dangers associated with fire or chemical release is a top priority.  We maintain an emergency response brigade that trains in responding to these potential hazards.  The safe evacuation of employees and containment of the hazard are the brigades top priorities.  An even higher priority is placed on"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000000275,
      "SummaryText": "he same time.  This occurs on average about 12 days over the course of a season.  We could also have up to 140 employees exposed to this release that would not be considered public receptors.\n\nA failure of this receiver would occur in an area that is closely monitored by the refrigeration operator and other processing personnel.  Any abnormal occurrence with this equipment would be quickly recognized and dealt with accordingly.  Key personnel who work around the refrigeration equipment are trained to be alert for ammonia leaks or unusual equipment operation that may indicate a problem.  They are taught who to contact and what procedure to follow.  Upon recognizing ammonia release or equipment failure the first actions are to attempt to limit the problem and prepare our employees for evacuation if it becomes necessary.   The facility does have ammonia detectors in key locations and an emergency alarm system that would alert the response brigade and the employees that may need to evacuate as well as the general camp population.  During nighttime hours when there is no production taking place, the refrigeration plant is monitored twice hourly by a watchman.  In event of a large spill that cannot be directly limited the refrigeration system can be remotely shut down from the powerhouse by cutting power to the equipment.  This would cause all liquid solenoid valves to close that would shut off supply of liquid ammonia to the affected area.  Public receptors that may be in the vicinity of a release do not receive direct training but are made aware of the presence and affects of ammonia through postings in public areas of the facility.  The public that would be present are generally very familiar with the facility and its personnel as this is a very limited population that we both are dealing with.  There would not be any residences or public facilities of any type that would be anywhere near the affected range of this spill scenario.  \n\nAccident History\nThere have been no"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000000275,
      "SummaryText": "reportable ammonia releases incidents during the past five years.  \n\nEmergency Response Program\nThe Port Moller facility lies within the boundaries of the Aleutians East Borough.  This is the only local government jurisdiction in the area.  We are registered with the Aleutians East Borough LEPC but do not have a formal written response program with them.  Currently the State of Alaska Emergency Response Commission lists the Aleutians East Borough LEPC as being inactive.  At the present time if there were significant release of hazardous material at our facility we would coordinate our efforts with the State of Alaska Emergency Response Commission.  We have recently contacted the Borough to update our relationship with the LEPC and were informed of its inactivity.\n\nAs outlined above, our own facility personnel would take the initial initiative in response to a release of hazardous material.  First response would be to limit the release as much as possible while ensuring the safety of the camp population.  Notification of the camp population would be achieved very quickly through the alarms and procedures we have in place.  There would be no need to immediately notify any off-site individuals, as there is no local population outside of the facility.  Further response and/or clean-up activities could be coordinated with our King Cove facility that has additional trained personnel.  They could be on location at Port Moller in as little as 2 hours via air in case of a very serious emergency.  Within an hour of a reportable chemical release we would report to the Borough, the State Emergency Response Commission, The U.S. Coast Guard, and the EPA."
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000000275,
      "SummaryText": "reducing the likelihood of an incident by maintaining the plant to a high level of dependability and safety.  \n\nDue to the seasonal nature of our operation the plant needs to run at top capacity during the short and often hectic processing season.  Plant failures for any reason during this time would result in considerable loss of valuable processing time.  We spend considerable time and effort during shutdown and before seasonal start-up of the plant to perform maintenance and inspections of the plant to ensure that it is in good operating condition.  Most plants that run year round could not be afforded this thorough inspection and maintenance period.  The results for us are two fold, a good operating plant and a safer workplace for our employees.  This facility complies with the OSHA PSM rule.  We provide training to all of our employees as to the properties and potential dangers of ammonia.  We conduct emergency alarm and evacuation drills and have written procedures for both production and non-production personnel on what to due in case of fire or chemical release.  We have an on site medical person (PA-C) and a well-equipped clinic.  Public receptors of a chemical release event would be limited to fishermen or supply boat personnel that would incidentally be at the plant location.  The permanent population consists solely of plant employees.\n\nWorst Case Release \nThe worst-case consequence analysis provided in this RMP is a scenario where there is a failure of our large receiver while it is 80% full, which is the case during the off-season when the refrigeration system is pumped down.  In this instance 8,000 lbs. of ammonia could be released.  Using RMP-Comp (Ver. 1.07), with release duration of ten minutes, the toxic endpoint would extend 1.6 miles.  There would be no public receptors exposed to a release of this type as the conditions for it to happen, system pumped down during off season, would exist only in the presence of a small number of facility mainten"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000000275,
      "SummaryText": "ance workers or the winter watchman.  There are no public residences or facilities of any type anywhere near this distance.  There is a State Critical Habitat Area boundary two miles away that would not be reached in this scenario.\n\nThe situation surrounding this scenario also makes it very unlikely that it would ever happen.  The situation occurs only when the refrigeration system is pumped down and secured.  There would be no refrigeration equipment running or energized and no equipment and very limited human traffic in the area of the receiver.  The most likely situation for a failure of this magnitude would be if a large enough earthquake occurred that resulted in general failure of the dock structure that the equipment is located on.  In any occurrence of this magnitude the ammonia release would be somewhat mitigated by the location of the receiver on the dock structure.  Some of the liquid ammonia released would likely flow through the dock decking and fall into seawater below.\n\nAlternative Release\nThe Alternative Release scenario presented in the RMP consists of a failure of the same receiver while the refrigeration system is in operation.  This scenario was selected, even though it is an unlikely occurrence, due to the location of the receiver, out in the open where the release would have a wider area impact.  The rest of the refrigeration system is located mostly within buildings.  While in operation the large receiver normally operates with a 6 liquid level.  This would relate to about 900 lbs. of liquid ammonia.  The release scenario was 150 lbs. per minute released over a duration of 6 minutes.  This would empty the liquid contents of the receiver.  Using RMP-Comp the toxic endpoint would extend 0.2 miles.  There could potentially be a maximum of 100 public receptors exposed to a release of this type.  This would only happen if the release coincided with a general fishery closure that could bring a large portion of the fishing fleet to our facility at t"
    }
  ]
}