{
  "FacilityID": 1000060059,
  "FacilityName": "Basic American Foods Rexburg",
  "FacilityStr1": "40 East 7'th North",
  "FacilityStr2": null,
  "FacilityCity": "Rexburg",
  "FacilityState": "ID",
  "FacilityZipCode": "83440",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "16065",
  "LEPC": "Madison County LEPC",
  "FacilityLatDecDegs": "43.8400",
  "FacilityLongDecDegs": "-111.7830",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I4",
  "LatLongDescription": "FC",
  "FacilityURL": "http://www.baf.com/",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Basic American, Inc",
  "Company2Name": null,
  "CompanyDUNS": 9149477,
  "Company2DUNS": 0,
  "OperatorName": "Brian Gustaveson",
  "OperatorStr1": "40 East 7th North",
  "OperatorStr2": null,
  "OperatorCity": "Rexburg",
  "OperatorStateFIPS": "ID",
  "OperatorZipCode": "83440",
  "OperatorZipCodeExt": null,
  "RMPContact": "Brian Gustaveson",
  "RMPTitle": "Facility Manager",
  "FTE": 190,
  "OtherEPAFacilityID": "IDD099322109",
  "EPAFacilityID": "100000196986",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 1,
  "ClearAirOpPermitID": "065-00008",
  "SafetyInspectionDate": "2016-03-01 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-09-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-09-22 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-09-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": "2020-03-10 00:00:00",
  "DeRegistrationEffectiveDate": "2020-02-14 00:00:00",
  "AnniversaryDate": "2021-09-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "50",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": "02",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000074988,
      "AltID": "Process Water Treatment",
      "FacilityID": 1000060059,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000076150,
          "ProcessID": 1000074988,
          "NAICSCode": "311423",
          "_desc": {
            "NAICS_CODE": "311423",
            "NAICS_DESCRIPTION": "Dried and Dehydrated Food Manufacturing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000092736,
          "ProcessID": 1000074988,
          "ChemicalID": 62,
          "Quantity": 6000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 62,
            "ChemicalName": "Chlorine",
            "CASNumber": "7782-50-5",
            "Threshold": 2500.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000592736,
          "ProcessID": 1000074988,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000060059,
      "SummaryText": "Facility Overview. The Basic American Foods (BAF) facility in Rexburg, Idaho is a potato processing operation primarily providing food service and consumer packaged products. The facility is regulated under Part 68 of the Clean Air Act Amendments, also referred to as the Risk Management Program (RMP), due to onsite chlorine storage in excess of the 2,500-pound RMP applicability threshold in a process.  The facility's RMP covered process is a process water treatment system that uses chlorine gas at the site. The stationary source covered process consists of 2 to 3 one ton cylinders with each vessel storing a maximum of 2,000 pounds.  The site has used chlorine for many years, but within the past five exceeded the 2500 lb threshold which triggered the development of a RMP.\n\n\n\nChemical Safety Overview. The facilitys overall approach and commitment to chemical safety is demonstrated by 1) the implemented management, training, operating procedures, and maintenance systems in place at the facility, and 2) the hazard assessment, prevention program, and emergency response provisions implemented specifically for chlorine in response to the RMP requirements. The management structure and oversight to ensure safety is documented in the facility's RMP manual and includes compliance with applicable regulations, codes, and standards (40 CFR 68, 29 CFR 1910.119).  \n\n\n\nFive Year Accident History.  The facility has had no reportable accidental releases of chlorine within the past five years.  \n\n\n\nPrevention Program. The facility has implemented a Program 3 level Prevention Program, as required by the RMP rules, in accordance with U S EPA, OSHA Process Safety Management (PSM), and vendor guidance for chlorine. These prevention program provisions are specifically intended to minimize the probability and/or consequences of accidental chlorine releases from the facility and include such measures as a system hazard review, operating and maintenance procedures, training, compliance auditin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000060059,
      "SummaryText": "g, management system, and updates. The facility prevention program is an ongoing system based on periodic training, incident investigations, procedure revisions as needed and RMP updates as required to reflect facility change and RMP requirements.\n\n\n\nEmergency Response Program.  The facility has coordinated response with the Rexburg Fire Department to ensure that they will respond to any accidental release from the chlorine system.  The facility has also established a notification mechanism to ensure the Fire Department will be properly notified when response is required for a chlorine release.  Based on this coordination with the local emergency responders, the facility is not required to implement additional RMP emergency response program requirements.\n\n\n\nSafety Management and Changes: The facility is committed to ensuring that operations are safe and in accordance with all RMP requirements, and has established a senior manager responsible for RMP development, implementation, and compliance. This manager is committed to maintain the safety of the RMP-covered chlorine system through active adherence to the appropriate procedures and codes. To ensure that the appropriate changes occur as necessary to maintain and improve safety, ongoing hazard reviews, training, audits, maintenance and investigations will be conducted as required by the RMP.  Updates to the RMP will be completed as necessary in response to these activities.\n\n\n\nSummary. As documented in this submittal, the RMP for the facility has been updated in accordance with all 40 CFR 68 requirements and the facility has certified RMP compliance."
    }
  ]
}