{
  "FacilityID": 1000092956,
  "FacilityName": "Banner Creek LLC",
  "FacilityStr1": "619 East 4th Street",
  "FacilityStr2": null,
  "FacilityCity": "Holton",
  "FacilityState": "KS",
  "FacilityZipCode": "66436",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "20085",
  "LEPC": "Jackson County LEPC",
  "FacilityLatDecDegs": "39.4620972",
  "FacilityLongDecDegs": "-095.727500",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "G1",
  "LatLongDescription": "PU",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "Johnsonville Sausage, LLC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Banner Creek LLC",
  "OperatorStr1": "619 East 4th Street",
  "OperatorStr2": null,
  "OperatorCity": "Holton",
  "OperatorStateFIPS": "KS",
  "OperatorZipCode": "66436",
  "OperatorZipCodeExt": null,
  "RMPContact": "Jay VanLeeywen",
  "RMPTitle": "Plant Coordinator",
  "FTE": 220,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000185845",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2018-03-16 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 1,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-03-25 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-03-25 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-03-25 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-03-25 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "3.8",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "10",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000115388,
      "AltID": "Ammonia Refrigeration",
      "FacilityID": 1000092956,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000116822,
          "ProcessID": 1000115388,
          "NAICSCode": "31161",
          "_desc": {
            "NAICS_CODE": "31161",
            "NAICS_DESCRIPTION": "Animal Slaughtering and Processing"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000144258,
          "ProcessID": 1000115388,
          "ChemicalID": 56,
          "Quantity": 14186.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000644258,
          "ProcessID": 1000115388,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000092956,
      "SummaryText": "Facility Description\n\nBanner Creek LLC operates a pork processing facility near the southeast edge of Holton, Kansas, at 619 East 4th Street.  The facility is located along the south side of 4th Street (Highway 16), and has been at this location since 1969.  The nature of the business involves swine slaughter and processing of pork products for commercial distribution.  \n\n\n\n\n\nChemicals Regulated Under EPA's Chemical Accident Prevention Program\n\nThe Banner Creek Holton Kansas pork processing facility has very few hazardous or toxic chemicals on site.  The facility refrigeration system uses anhydrous ammonia as refrigerant, which is the only CAPP/RMP regulated chemical on site in excess of applicable thresholds.     \n\n     \n\n\n\nAccidental Release Prevention and Emergency Response Policy\n\nBanner Creek LLC is committed to protection of it employees and the surrounding community by maintaining our ammonia equipment in safe condition and providing our personnel with training in safe operating procedures.  This facility has not had an accidental release of ammonia from our facility which resulted in adverse health effects to the public or to our employees, or in property damage.  We have clear lines of authority and responsibility with respect to all aspects of our release prevention program, leading directly to the Plant Coordinator.  We maintain current safety information on ammonia and our ammonia refrigeration equipment, and review potential hazards that may be associated with the storage and use of ammonia at our facility.  We train both our operating and maintenance personnel in our procedures and safe practices.  New employees are trained before being allowed to work on ammonia equipment without close supervision, and periodic refresher training is provided.  If significant changes occur in equipment or processes which could potentially impact the storage or use of ammonia, affected employees are retrained.  We inspect and audit the ammonia refrigeration system, usin"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000092956,
      "SummaryText": "g both in-house staff and experienced professionals from outside the company.\n\n\n\n\n\nAccidental Release Prevention Program, and Chemical-Specific Prevention Steps\n\nBanner Creek LLCs Holton facility is committed to protection of the environment through the combined use of inspection, maintenance, employee training and response preparation.  A schedule is established for covered process preventative maintenance, inspections and tests.  The plant is fully lighted. Personnel are typically on-site 24 hours a day, 7 days a week. There is a multi-camera video surveillance system installed at the property, and a general computer based alarm system. The alarm system includes monitoring of the ammonia refrigeration system, including level control and overfill monitors. The alarm system is monitored in the control room for abnormal conditions, which trigger visual control panel alarm lights and audible alarms. Banner Creek LLC has developed a written emergency response program/plan and coordinated planned response actions with the Holton Fire Department.  The plan designates specific actions and procedures to be followed in the event of an accidental release of anhydrous ammonia, and designates primary and secondary incident commanders.  It also includes contact information for responsible Banner Creek LLC personnel and emergency response agencies.\n\n\n\n\n\nFive-Year Accident History\n\nWithin the five years previous to the date of this submission, the facility has not had a recordable accident which required inclusion in the 5-year accident history required by Subpart B of the CAPP/RMP regulation.  \n\n\n\n\n\nPlanned Changes to Improve Safety\n\nThere are no current design projects or equipment procurements planned in this category at the time of this submission; however, Banner Creek LLC's management and operations team is committed to an on-going system of production process review, evaluation of improvements in available technology (including safety features), analysis of previous plant "
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000092956,
      "SummaryText": "incidents (including near misses), safety checks, and Prevention Program compliance audits, to identify opportunities to improve plant safety.  \n\n\n\n"
    }
  ]
}