{
  "FacilityID": 1000084742,
  "FacilityName": "Shaws Distribution Center #32711",
  "FacilityStr1": "100 Danton Drive",
  "FacilityStr2": null,
  "FacilityCity": "Methuen",
  "FacilityState": "MA",
  "FacilityZipCode": "01844",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "25009",
  "LEPC": "Essex LEPC",
  "FacilityLatDecDegs": "42.720000",
  "FacilityLongDecDegs": "-071.211111",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I2",
  "LatLongDescription": "PU",
  "FacilityURL": "www.shaws.com",
  "FacilityEmailAddress": null,
  "FacilityDUNS": 0,
  "ParentCompanyName": "New Albertsons Inc",
  "Company2Name": null,
  "CompanyDUNS": 780148537,
  "Company2DUNS": 0,
  "OperatorName": "Shaws.",
  "OperatorStr1": "100 Danton Drive",
  "OperatorStr2": null,
  "OperatorCity": "Methuen",
  "OperatorStateFIPS": "MA",
  "OperatorZipCode": "01844",
  "OperatorZipCodeExt": null,
  "RMPContact": "Kirby A. Shirk",
  "RMPTitle": "Facility Maintenance Manager",
  "FTE": 446,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000195781",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-11-06 00:00:00",
  "SafetyInspectionBy": "OSHA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 0,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2020-01-22 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2020-01-22 00:00:00",
  "GraphicsIndicator": 1,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2020-01-22 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2025-01-22 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000105889,
      "AltID": "Refrigerated Warehousing",
      "FacilityID": 1000084742,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000107151,
          "ProcessID": 1000105889,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000132611,
          "ProcessID": 1000105889,
          "ChemicalID": 56,
          "Quantity": 15000.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000632611,
          "ProcessID": 1000105889,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000084742,
      "SummaryText": "ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES\n\n\n\nAlbertsons is strongly committed to employee, public and environmental safety. This commitment is reflected in a comprehensive accidental release prevention program. This program addresses the design, installation, operation, maintenance, and employee training associated with the process solution equipment at the facility. \n\n\n\nAlbertsons senior management is not only committed to offering superior service, but also to maintaining a safety and environmental program to promote a safe environment for all its employees and the surrounding communities. The facility maintains a Safety Committee whose members are the designated emergency coordinators for the facility.  Albertsons has an Emergency Response Plan (Plan) in effect, which is detailed in the Emergency Planning and Response section of the PSM document maintained at the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures which will be implemented to respond effectively to emergency situations that may arise at the facility.  This Plan is reviewed and updated as needed to remain current.  \n\n\n\nSTATIONARY SOURCE AND REGULATED SUBSTANCE\n\n\n\nAlbertsons Methuen Distribution Center was designed and constructed in accordance with all applicable federal, state, and local regulations in place at the time of construction.  The area immediately surrounding the facility is urban with a mixture of commercial, industrial, and residential areas.  The facility operates 24 hours per day, 7 days per week. \n\n\n\nThe Albertsons Methuen Distribution Center uses anhydrous ammonia to provide refrigeration for cold storage of grocery products.  The distribution center uses a maximum intended inventory of 17,000 pounds of ammonia as a refrigerant within a closed system, which operates continuously.  Compressors and condensers cycle on and off to comply with system demand during o"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000084742,
      "SummaryText": "peration.  Cold storage and dock areas use evaporators to maintain room temperatures.  The regulated process, consisting of piping, valves, and equipment, cycles ammonia through various physical states (high pressure liquid, low pressure liquid, low pressure vapor, high pressure vapor, then back to high pressure liquid) in order to provide refrigeration for cold storage and dock areas.\n\n\n\nChanges in pressure are directly related to changes in temperature: lowering the ammonia pressure lowers its temperature.  Low-pressure (cold) liquid ammonia provides refrigeration by removing ambient heat.  Removal of ambient heat causes the liquid ammonia (contained within the system) to vaporize.  Heat is later removed from the ammonia as it is condensed back into a liquid.  Typical operating conditions range from approximately 25 psig on the low pressure side of the system to 151 psig on the high side. \n\n\n\nThe majority of the ammonia refrigeration equipment is located inside the engine room. The condensers are mounted on the engine room roof and the evaporators are placed in dock or storage areas.  Access to the engine room is limited to authorized personnel.  \n\n\n\nACCIDENTAL RELEASE PREVENTION PROGRAM AND CHEMICAL-SPECIFIC PREVENTION STEPS\n\n\n\nThe facility operates in accordance with the International Institute of Ammonia Refrigeration (IIAR) guidelines and standards. In addition, Albertsons - Methuen Distribution Center has implemented a Process Safety Management program for compliance with the OSHA 29 CFR 1910.119 regulation.  This included conducting an initial PHA and five year revalidations to examine potential release scenarios and identify measures to reduce the consequences and/or likelihood of such events.  The PHA has been revalidated every five years.  The PSM prevention programs included developing written operating and maintenance procedures as well as other policies and programs to manage the handling of ammonia at the facility (Management of Change, Incident Inves"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000084742,
      "SummaryText": "tigation, Employee Training, and Participation, etc.). \n\n\n\nThe ammonia refrigeration systems are equipped with various system controls and status indicators intended to minimize potential ammonia related accidents and to allow facility personnel to monitor system operations.  This monitoring system is comprised of liquid level controls, pressure and temperature controls and indicators, as well as other system safeguards and methods for allowing facility personnel to effectively monitor and control refrigeration operations. \n\n\n\nThe facility is equipped with ammonia gas detectors located in the Engine Room and in the warehouse areas. \n\n\n\nAmmonia refrigeration systems do not experience any chemical reactions or internal corrosion.  The only composition change that occurs within the systems are phase changes, as ammonia is cycled through various stages of liquid and vapor, similar to a household refrigerator.  The refrigeration system is a closed-loop system without any regular emissions or releases.  Any leaks are noted and repaired immediately.\n\n\n\nFIVE YEAR ACCIDENT HISTORY\n\n\n\nAn investigation into the facility's accident history reveals that there have been no significant releases of ammonia that meet the EPA RMP definition of \"accident\" in the last five years (November 2014- November 2019).  \n\n\n\nEMERGENCY RESPONSE PROGRAM\n\n\n\nThe facility has an emergency action plan in effect.  The Emergency action plan is detailed in the Emergency Planning and Response section of the PSM document, which is maintained at the facility:\n\n\n\n  1.) To save lives.\n\n  2.) To minimize and avoid injuries.\n\n  3.) To protect the environment.\n\n  4.) To minimize property damage.\n\n\n\nThe facility maintains a safety committee whose members include the designated incident commander for the facility.  The Plan provides the response organization and notification procedures, evacuation routes, ammonia health hazards, and mitigation procedures, which will be implemented to respond effectively to emergen"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000084742,
      "SummaryText": "cy situations that may arise at the facility.  This Plan is reviewed and updated as necessary to remain current.\n\n\n\nFacility personnel receive annual training regarding the emergency procedures.  In the event that an ammonia leak is discovered, the person nearest to the leak will alert any personnel in the immediate area who are unaware of the danger.  The Albertsons Plant Manager will determine what procedures and personnel are necessary to remedy the problem.  Emergency agencies will also be notified as necessary as outlined in the Emergency Response Plan.\n\n\n\nPLANNED CHANGES TO IMPROVE SAFETY\n\n\n\nAlbertsons is continually evaluating the ammonia refrigeration system. The most recent review included an independent Mechanical Integrity Inspection in December 2019. This resulted in mitigation measures to improve safety and overall system integrity.  The PSM Team and safety committee continue to work on the following items:\n\n\n\n1.  Continue to train all employees in the facility Safety Plan/Programs.\n\n\n\n2.  Continue to have employee involvement in Safety Plan Development.\n\n\n\n3.  Continue employee involvement through safety team participation.\n\n\n\n4.  Continue internal and external safety audits/inspections and implement changes as needed.\n\n\n\n"
    }
  ]
}