{
  "FacilityID": 1000055757,
  "FacilityName": "Frostyaire of Maumelle",
  "FacilityStr1": "11100 Louis Nelson Drive",
  "FacilityStr2": null,
  "FacilityCity": "Maumelle",
  "FacilityState": "AR",
  "FacilityZipCode": "72113",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "05119",
  "LEPC": "Pulaski County LEPC",
  "FacilityLatDecDegs": "34.861472",
  "FacilityLongDecDegs": "-092.389639",
  "ValidLatLongFlag": 1,
  "LatLongMethod": "I3",
  "LatLongDescription": "ST",
  "FacilityURL": "frostyaire.com",
  "FacilityEmailAddress": "frostyaireofmaumelle@frostyaire.com",
  "FacilityDUNS": 840217061,
  "ParentCompanyName": "Frostyaire of Arkansas, INC",
  "Company2Name": null,
  "CompanyDUNS": 0,
  "Company2DUNS": 0,
  "OperatorName": "Lucas G. Thomas",
  "OperatorStr1": "11100 Louis Nelson Drive",
  "OperatorStr2": null,
  "OperatorCity": "Maumelle",
  "OperatorStateFIPS": "AR",
  "OperatorZipCode": "72113",
  "OperatorZipCodeExt": null,
  "RMPContact": "William A Conway Jr.",
  "RMPTitle": "Maintenance Manager",
  "FTE": 13,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000212236",
  "OSHA_PSM": 1,
  "EPCRA_302": 0,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2015-10-06 00:00:00",
  "SafetyInspectionBy": "Fire Department",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2016-02-17 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2016-02-17 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 1,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2016-02-17 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2021-02-17 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": "1.0",
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "3",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000069685,
      "AltID": "Mechanical Refrigeration",
      "FacilityID": 1000055757,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000070867,
          "ProcessID": 1000069685,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000085972,
          "ProcessID": 1000069685,
          "ChemicalID": 56,
          "Quantity": 14700.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000585972,
          "ProcessID": 1000069685,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000055757,
      "SummaryText": "EXECUTVE SUMMARY\n\n\n\nFrostyaire of Maumelle is a cold storage facility that utilizes anhydrous ammonia as a refrigerant.   The chemical properties of anhydrous ammonia make it a valuable refrigerant.  However, anhydrous ammonia is also a toxic chemical which makes it necessary to implement certain safety precautions/programs to eliminate the potential for a release of ammonia.  Frostyaire's main goal of this Risk Management Plan (RMP) is for the prevention of human exposure to ammonia, reducing the threat to our employees, as well as reducing the potential of a release to members of our community. Frostyaire strives to adhere to all applicable federal and state laws, regulations, and rules in handling anhydrous ammonia.   \n\n\n\nThe anhydrous ammonia (NH3) system is comprised of a single storage vessel, with associated pumps, compressors, piping, condensers, safety valves, etc. Frostyaire has developed and implemented a prevention program for the accidental release of NH3.  The prevention program or Process Safety Management (PSM) Plan is an extensive program involving hazard analysis, employee training, mechanical integrity inspections, hot work program, operating procedures, emergency response action plan, and contractor safety requirements.  The NH3 system was designed according to specific codes and standards and designed with repetitive safety devices/interlocks to provide for the accidental release of NH3.  The prevention goal of an accidental release of NH3 is achieved by the safety/monitoring devices, the design of the facility, the training of authorized personnel and safe handling practices.  The system has a maximum capacity of 14,700 pounds of NH3. This is the maximum capacity contained in the storage vessel, and the associated feed and return lines to and from the refrigeration coils.\n\n\n\nOur emergency response plan was developed in conjunction with numerous departments within Frostyaire that includes personnel that have extensive experience in the operation"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000055757,
      "SummaryText": " of refrigeration systems and emergency response (HAZWOPER training).  The emergency response plan includes procedures for notification of key personnel to assess the nature and  of the release, then the notification of other members of the Frostyaire Response team. Upon assessment of the nature and severity of the release, notification will then be made to the Maumelle 911 system, which serves to notify the Maumelle Fire Department for assistance with the emergency response. Frostyaire Maintenance Personnel & Response team members will determine the cause and location of the release and make every effort to isolate it by closing valves to the affected area. In the unexpected event of an uncontrolled ammonia release, the appropriate response actions would be made by Frostyaire in conjunction with the Maumelle Fire Department.  Such measures may include, but not limited to, control of ammonia vapors by the use of water spray from fire fighting equipment. Three (3) points of water connection are located on the property for fire fighting equipment. In the event an evacuation of nearby businesses or other establishments is required, the Maumelle Fire Department and Maumelle Police Department will coordinate evacuation notifications, if required, based upon receptors identified within this plan. \n\n\n\nThe worst-case scenario release is failure of our NH3 storage tank when filled to the greatest amount under normal operating conditions.  The total amount released is assumed to be the entire contents of the vessel (10,000 pounds) as a liquid spill which would result in almost immediate vaporization. Passive mitigation was not considered for this scenario. The calculated distance to the toxic endpoint for this scenario is a radius of 0.7 miles. Frostyaire is located in an urban area.\n\nAn alternative scenario was also identified for the process that is based upon a release as a result of a failure of a rupture disk and or relief valve on a vessel.  It is estimated that approxi"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000055757,
      "SummaryText": "mately 412 pounds of NH3 would be released for a duration of five (5) minutes.  Such a release would be caused by mechanical/equipment or control system failure. This release would result in a distance to the toxic endpoint of approximately .20 miles.  No residential homes are located within this radius.\n\n\n\nNo incident has occurred at the Frostyaire location that resulted in a reportable release of NH3 within the past five (5) years.\n\n\n\nFrostyaire is continually evaluating effectiveness of their PSM program by conducting Process Hazard Analysis, implementing Management of Change Procedures, providing extensive employee training, implementing a stringent mechanical integrity program, and evaluating the PSM program on a regular basis to ensure all aspects of the program are implemented and appropriate for the process. \n\n"
    }
  ]
}