{
  "FacilityID": 1000093822,
  "FacilityName": "Walmart Distribution Center 6858",
  "FacilityStr1": "2837 Senator Ralph Scott Parkway",
  "FacilityStr2": null,
  "FacilityCity": "Mebane",
  "FacilityState": "NC",
  "FacilityZipCode": "27302",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "37001",
  "LEPC": "Alamance County LEPC",
  "FacilityLatDecDegs": "36.05621",
  "FacilityLongDecDegs": "-079.32373",
  "ValidLatLongFlag": 0,
  "LatLongMethod": "I2",
  "LatLongDescription": "CE",
  "FacilityURL": null,
  "FacilityEmailAddress": "lee.hill@walmart.com",
  "FacilityDUNS": 51957769,
  "ParentCompanyName": "Wal-Mart Stores, Inc.",
  "Company2Name": null,
  "CompanyDUNS": 51957769,
  "Company2DUNS": 0,
  "OperatorName": "Walmart Store, Inc.",
  "OperatorStr1": "2837 Senator Ralph Scott Parkway",
  "OperatorStr2": null,
  "OperatorCity": "Mebane",
  "OperatorStateFIPS": "NC",
  "OperatorZipCode": "27302",
  "OperatorZipCodeExt": null,
  "RMPContact": null,
  "RMPTitle": "Maintenance Manager",
  "FTE": 518,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000232599",
  "OSHA_PSM": 1,
  "EPCRA_302": 1,
  "CAA_TitleV": 0,
  "ClearAirOpPermitID": null,
  "SafetyInspectionDate": "2017-06-07 00:00:00",
  "SafetyInspectionBy": "EPA",
  "OSHARanking": 0,
  "PredictiveFilingFlag": 1,
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": 0,
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": 0,
  "CompletionCheckDate": "2021-06-07 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2021-06-07 00:00:00",
  "GraphicsIndicator": 0,
  "AttachmentsIndicator": 0,
  "CertificationReceivedFlag": 0,
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": 0,
  "ElectronicWaiverReceivedFlag": 0,
  "PostmarkDate": "2021-06-07 00:00:00",
  "RMPCompleteFlag": 1,
  "DeRegistrationDate": null,
  "DeRegistrationEffectiveDate": null,
  "AnniversaryDate": "2026-06-07 00:00:00",
  "CBIFlag": 0,
  "CBIUnsanitizedVersionFlag": 0,
  "VersionNumber": null,
  "FRS_Lat": null,
  "FRS_Long": null,
  "FRS_Description": null,
  "FRS_Method": null,
  "HorizontalAccMeasure": "25",
  "HorizontalRefDatumCode": "002",
  "SourceMapScaleNumber": "24000",
  "DeregistrationReasonCode": null,
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000116409,
      "AltID": null,
      "FacilityID": 1000093822,
      "ProgramLevel": 3,
      "CBI_Flag": 0,
      "_naics": [
        {
          "Process_NAICS_ID": 1000117822,
          "ProcessID": 1000116409,
          "NAICSCode": "49312",
          "_desc": {
            "NAICS_CODE": "49312",
            "NAICS_DESCRIPTION": "Refrigerated Warehousing and Storage"
          }
        }
      ],
      "_chemicals": [
        {
          "ProcessChemicalID": 1000145551,
          "ProcessID": 1000116409,
          "ChemicalID": 56,
          "Quantity": 38742.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 56,
            "ChemicalName": "Ammonia (anhydrous)",
            "CASNumber": "7664-41-7",
            "Threshold": 10000.0,
            "ChemType": "T",
            "flgCBI": 0,
            "ChemOwner": "FED"
          },
          "_flam_mix_chemicals": []
        },
        {
          "ProcessChemicalID": 1000645551,
          "ProcessID": 1000116409,
          "ChemicalID": 0,
          "Quantity": 0.0,
          "CBI_Flag": 0,
          "_chemical": {
            "ChemicalID": 0,
            "ChemicalName": "Public OCA Chemical",
            "CASNumber": null,
            "Threshold": null,
            "ChemType": null,
            "flgCBI": 0,
            "ChemOwner": null
          },
          "_flam_mix_chemicals": []
        }
      ]
    }
  ],
  "_accidents": [],
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000093822,
      "SummaryText": "WALMART DISTRIBUTION CENTER #6858 Mebane,NC RISK MANAGEMENT PLAN Executive Summary 1. ACCIDENTAL RELEASE PREVENTION AND EMERGENCY RESPONSE POLICIES. At this Walmart Distribution Center (D. C.), we utilize anhydrous ammonia that is considered hazardous by the Environmental Protection Agency (EPA). The properties that make ammonia valuable as a refrigerant also necessitate certain safety precautions. Walmart strives to protect all its valuable resources and assets - both personnel and property. We live and have families in this community. We want to prevent exposure to all our personnel as well as nearby members of our community, existing natural resources, and the surrounding environment. It is our policy to comply with all Federal, State, and Local regulations. Through continual, accurate training and various safety devices and procedures, we work to minimize potential releases. Our emergency response program has specific procedures for accidental releases of anhydrous ammonia as well as other emergencies. We work in conjunction with the Mebane Fire Department and the Local Emergency Planning Committee to prepare for necessary notification of all affected neighbors. \n\n\n\n2. THE STATIONARY SOURCE AND REGULATED SUBSTANCES HANDLED. The primary purpose of our facility is the temporary storage of refrigerated and frozen foods. We utilize anhydrous ammonia as the primary means for refrigeration and freezing. An outside company is used to fill our main receiver tanks. Piping then carries the ammonia to the needed refrigeration or freezing units. Access to the site is restricted to facility employees, authorized management personnel and authorized contractors. The regulated substance used at our facility is anhydrous ammonia. The maximum amount of ammonia stored at this facility is 38742 pounds. We have the capacity for more but our policy is not to exceed IIAR recommendations.\n\n\n\n3. FIVE-YEAR ACCIDENT HISTORY. To date, this Walmart D. C. facility has not incurred a reportab"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000093822,
      "SummaryText": "le release in the past five years.\n\n\n\n4. THE RMP MANAGEMENT PROGRAM. The management of the RMP program will be handled by the Maintenance Manager. He/She will administrate in conjunction with the Walmart D.C. management and personnel. Other entities or organizations that will be coordinated with include the Emergency Management Association (EMA) and the Mebane Fire Department.\n\n\n\n5. THE GENERAL ACCIDENTAL RELEASE PREVENTION PROGRAM AND THE SPECIFIC PREVENTION STEPS. The Walmart D.C. facility complies with all applicable Federal, State and Local regulations including the EPA's Accidental Release Prevention Rule. Our personnel are trained about this during our Hazard Communications Training and through access to our Written Programs. Our Refrigeration Maintenance operators receive a combination of classroom and On-The-Job training (OJT). They are given written and oral tests. They are observed and are able to demonstrate proper job skills and knowledge. Also, the ammonia system is operated, tested and maintained to the standard of International Institute of Ammonia Refrigeration, the most stringent standards of the industry. \n\n\n\n6. THE EMERGENCY RESPONSE PROGRAM. Walmart D.C. has onsite Hazardous Materials trained personnel to immediately respond to adverse conditions. We have monthly meetings and quarterly drills as well as annual certification. This helps minimize the potential of an off-site release. We work very closely with the Emergency Management Association (EMA) and the Mebane Fire Department on emergency preparedness. We meet periodically with representatives of each to address any changes in the facility or any new concerns. \n\n\n\n7. PLANNED CHANGES TO IMPROVE SAFETY. Currently, Walmart D.C. trains and tests all refrigeration technicians. Our preventative maintenance program is above standard and our total ammonia Process Safety Program is reviewed annually and updated periodically. Our program is improved continuously through annual updated of our written pr"
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000093822,
      "SummaryText": "ogram and annual training of our technicians. We also take advantage of new technologies when safer and more economical alternatives are available. Walmart Facility has implemented training for their refrigeration technicians. The program consists of classroom training, viewing various training/safety videos and written testing procedures. The training will be conducted on at least an annual basis.\n\n"
    }
  ]
}