{
  "FacilityID": 1000077546,
  "FacilityName": "West Montalvo Field M4 Pool Gas Chiller Unit",
  "FacilityStr1": "5713 W. Gonzales Rd.",
  "FacilityStr2": null,
  "FacilityCity": "Oxnard",
  "FacilityState": "CA",
  "FacilityZipCode": "93036",
  "Facility4DigitZipExt": null,
  "FacilityCountyFIPS": "06111",
  "LEPC": "California Region 1 LEPC",
  "FacilityLatDecDegs": "34.231350",
  "FacilityLongDecDegs": "-119.242796",
  "ValidLatLongFlag": "Yes",
  "LatLongMethod": "I4",
  "LatLongDescription": "ST",
  "FacilityURL": null,
  "FacilityEmailAddress": null,
  "FacilityDUNS": 809124894,
  "ParentCompanyName": "California Resources Corporation",
  "Company2Name": null,
  "CompanyDUNS": null,
  "Company2DUNS": null,
  "OperatorName": "California Resources Corporation",
  "OperatorStr1": "3055 West Pacific Coast Highway",
  "OperatorStr2": null,
  "OperatorCity": "Ventura",
  "OperatorStateFIPS": "CA",
  "OperatorZipCode": "93001",
  "OperatorZipCodeExt": null,
  "FTE": 7,
  "OtherEPAFacilityID": null,
  "EPAFacilityID": "100000173439",
  "OSHA_PSM": "No",
  "EPCRA_302": "No",
  "CAA_TitleV": "Yes",
  "ClearAirOpPermitID": "0048",
  "SafetyInspectionDate": "2018-06-13 00:00:00",
  "SafetyInspectionBy": "Ventura County Air Pollution Control District",
  "OSHARanking": "No",
  "PredictiveFilingFlag": "No",
  "SubmissionType": "R",
  "RMPDescription": null,
  "NoAccidents": "No",
  "ForeignStateProv": null,
  "ForeignZipCode": null,
  "ForeignCountry": null,
  "CBI_Flag": "No",
  "CompletionCheckDate": "2019-05-31 00:00:00",
  "ErrorReportDate": null,
  "ReceiptDate": "2019-05-31 00:00:00",
  "GraphicsIndicator": "No",
  "AttachmentsIndicator": "No",
  "CertificationReceivedFlag": "Yes",
  "SubmissionMethod": "RMP*eSubmit",
  "CBISubstantiationFlag": "No",
  "ElectronicWaiverReceivedFlag": "No",
  "PostmarkDate": "2019-05-31 00:00:00",
  "RMPCompleteFlag": "Yes",
  "DeRegistrationDate": "2020-12-01 00:00:00",
  "DeRegistrationEffectiveDate": "2020-10-15 00:00:00",
  "AnniversaryDate": "2024-05-31 00:00:00",
  "CBIFlag": "No",
  "CBIUnsanitizedVersionFlag": "No",
  "VersionNumber": "1.0",
  "FRS_Lat": 34.21906,
  "FRS_Long": -119.25164,
  "FRS_Description": null,
  "FRS_Method": "ADDRESS MATCHING-HOUSE NUMBER",
  "HorizontalAccMeasure": "8",
  "HorizontalRefDatumCode": "003",
  "SourceMapScaleNumber": null,
  "RMPSubmissionReasonCode": "R07",
  "DeregistrationReasonCode": "01",
  "DeregistrationReasonOtherText": null,
  "_processes": [
    {
      "ProcessID": 1000096553,
      "AltID": "Natural Gas Chiller Unit",
      "FacilityID": 1000077546,
      "ProgramLevel": 2,
      "CBI_Flag": "No",
      "_chemicals": [
        {
          "ProcessChemicalID": 1000120909,
          "ProcessID": 1000096553,
          "ChemicalID": 155,
          "Quantity": 77600.0,
          "CBI_Flag": "No",
          "_flam_mix_chemicals": [
            {
              "FlamMixChemID": 1000104988,
              "ProcessChemicalID": 1000120909,
              "ChemicalID": 98
            },
            {
              "FlamMixChemID": 1000104989,
              "ProcessChemicalID": 1000120909,
              "ChemicalID": 118
            },
            {
              "FlamMixChemID": 1000104990,
              "ProcessChemicalID": 1000120909,
              "ChemicalID": 125
            }
          ]
        }
      ],
      "_naics": [
        {
          "Process_NAICS_ID": 1000097811,
          "ProcessID": 1000096553,
          "NAICSCode": "21113",
          "_prev_prog_3": [],
          "_prev_prog_2": [
            {
              "PreventionProgram2ID": 1000060436,
              "Process_NAICS_ID": 1000097811,
              "SafetyReviewDate": "2018-09-20 00:00:00",
              "FR_NFPA58": "Yes",
              "FR_OSHA": "Yes",
              "FR_ASTM": "No",
              "FR_ANSI": "Yes",
              "FR_ASME": "Yes",
              "FR_None": "No",
              "FR_OtherType": "API Standards, NFPA 70, 1997 UBC, 1997 UFC, Ventura County Fire Department Standards",
              "FR_Comments": null,
              "HazardReviewDate": "2019-04-08 00:00:00",
              "ChangeCompletionDate": "2020-04-08 00:00:00",
              "MH_ToxicRelease": "No",
              "MH_Fire": "Yes",
              "MH_Explosion": "Yes",
              "MH_RunawayReaction": "No",
              "MH_Polymerization": "No",
              "MH_Overpressurization": "Yes",
              "MH_Corrosion": "Yes",
              "MH_Overfilling": "Yes",
              "MH_Contamination": "No",
              "MH_EquipmentFailure": "Yes",
              "MH_CoolingLoss": "Yes",
              "MH_Earthquake": "Yes",
              "MH_Floods": "Yes",
              "MH_Tornado": "No",
              "MH_Hurricanes": "No",
              "MH_OtherType": null,
              "PC_Vents": "No",
              "PC_ReliefValves": "Yes",
              "PC_CheckValves": "Yes",
              "PC_Scrubbers": "Yes",
              "PC_Flares": "Yes",
              "PC_ManualShutoffs": "Yes",
              "PC_AutomaticShutoffs": "Yes",
              "PC_Interlocks": "Yes",
              "PC_Alarms": "Yes",
              "PC_KeyedBypass": "No",
              "PC_EmergencyAirSupply": "No",
              "PC_EmergencyPower": "No",
              "PC_BackupPump": "No",
              "PC_GroundingEquipment": "Yes",
              "PC_InhibitorAddition": "No",
              "PC_RuptureDisks": "No",
              "PC_ExcessFlowDevice": "Yes",
              "PC_QuenchSystem": "No",
              "PC_PurgeSystem": "No",
              "PC_None": "No",
              "PC_OtherType": null,
              "MS_SprinklerSystem": "No",
              "MS_Dikes": "Yes",
              "MS_FireWalls": "No",
              "MS_BlastWalls": "No",
              "MS_DelugeSystem": "No",
              "MS_WaterCurtain": "No",
              "MS_Enclosure": "No",
              "MS_Neutralization": "No",
              "MS_None": "No",
              "MS_OtherType": null,
              "MD_ProcessAreaDetectors": "No",
              "MD_PerimeterMonitors": "No",
              "MD_None": "No",
              "MD_OtherType": "Operator surveillance and truck loader attendance during product transfer operations",
              "CH_ChemicalReduction": "No",
              "CH_ChemicalIncrease": "No",
              "CH_ChangeProcessParameters": "No",
              "CH_InstallProcessControls": "No",
              "CH_InstallProcessDetection": "No",
              "CH_InstallPerimeterMonitoring": "No",
              "CH_InstallMitigationSystems": "No",
              "CH_NoneRequired": "No",
              "CH_None": "Yes",
              "CH_OtherChanges": null,
              "OpProceduresReviewDate": "2018-09-20 00:00:00",
              "TrainingReviewDate": "2018-09-20 00:00:00",
              "TR_Classroom": "Yes",
              "TR_OnTheJob": "Yes",
              "TR_OtherType": "Safety meetings / Trainings",
              "CT_WrittenTest": "Yes",
              "CT_OralTest": "Yes",
              "CT_Demonstration": "Yes",
              "CT_Observation": "Yes",
              "CT_OtherType": null,
              "MaintenanceReviewDate": "2018-09-20 00:00:00",
              "EquipmentInspectionDate": "2019-03-11 00:00:00",
              "EquipmentTested": "K-101 Gas Compressor",
              "ComplianceAuditDate": "2018-09-20 00:00:00",
              "AuditCompletionDate": "2019-09-20 00:00:00",
              "IncidentInvestigationDate": null,
              "InvestigationChangeDate": null,
              "MostRecentChangeDate": "2016-04-28 00:00:00",
              "CBI_Flag": "No",
              "Description": null,
              "_chemicals": [
                {
                  "PrimaryKey": 1000061084,
                  "PreventionProgram2ID": 1000060436,
                  "ProcessChemicalID": 1000120909
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "_accidents": [],
  "_emerg_resp": {
    "FacilityID": 1000077546,
    "ER_CommunityPlan": "Yes",
    "ER_FacilityPlan": "No",
    "ER_ResponseActions": "No",
    "ER_PublicInfoProcedures": "No",
    "ER_EmergencyHealthCare": "No",
    "ER_ReviewDate": null,
    "ERTrainingDate": null,
    "CoordinatingAgencyName": "Ventura County Fire Department",
    "CoordinatingAgencyPhone": "8053899710",
    "FR_OSHA1910_38": "Yes",
    "FR_OSHA1910_120": "No",
    "FR_SPCC": "Yes",
    "FR_RCRA": "No",
    "FR_OPA90": "Yes",
    "FR_EPCRA": "Yes",
    "FR_OtherRegulation": null
  },
  "_exec_summary": [
    {
      "ESSeqNum": 0,
      "FacilityID": 1000077546,
      "SummaryText": "Accidental Release Prevention and Emergency Response Policies\r\n \r\nCalifornia Resources Corporation (CRC) is the owner of the West Montalvo Field M4 Pool Gas Chiller Unit. It is the policy of CRC that its employees, environment, property, and the general public be protected from any off-site impacts that may occur as a result of its operations. To achieve this end, CRC strives to operate its facilities in compliance with applicable federal, state, and local safety, health, and environmental regulations. CRC has a long-standing commitment to employee and public safety at the West Montalvo Field M4 Pool Gas Chiller Unit. This commitment is demonstrated by the resources invested in accident prevention (e.g., training of personnel, considering safety in the design, installation, operation, and maintenance of the facility, etc.). It is the company's philosophy to implement reasonable mitigation measures to eliminate preventable releases of regulated substances as well as other substances.\r\nCompany emergency response policies are implemented to comply with the overall corporate policy of providing its workers with a safe workplace and minimizing risk to the public. This is considered to be of prime importance; therefore, all procedures must be carried out in the appropriate manner. The safety of emergency and non-affected personnel has the highest priority. Only then can safely executed rescue and medical activities be considered. Protection of the environment is another high priority. Only after life, safety, and environmental concerns are addressed will the focus shift to the secondary issues of property conservation and business recovery.\r\n\r\nFacility Description\r\n\r\nThe West Montalvo Field M4 Pool Gas Chiller Unit is located at 5713 W. Gonzales Road in Oxnard, California. The entrance is secured with a locked gate. The public receptors are workers that may be present in the commercial farm land that surrounds the facility.\r\n\r\nCRC acquired the West Montalvo Field in the"
    },
    {
      "ESSeqNum": 1,
      "FacilityID": 1000077546,
      "SummaryText": "fourth quarter of 2014. The field produces heavy crude oil and associated natural gas. The associated gas from the field flows via gas gathering lines to the M4 Pool facility, where it is treated at the M4 Pool Gas Chiller Unit to recover natural gas liquids (NGLs) and reduce the water content in the natural gas to pipeline specifications. The recovered NGLs are stored in a pressurized, horizontal NGL Storage Vessel on-site until off-loaded to tanker trucks for subsequent sale. The volume in the NGL Storage Vessel is administratively controlled to a maximum of 14,400 gallons (80% full). \r\n\r\nRegulated Substances\r\n\r\nThe sole regulated substance at the facility is the flammable mixture processed in the Gas Chiller Unit and stored in the NGL Storage Vessel. Based on the maximum capacity of the vessel at 80% full, the inventory of the storage vessel is 74,500 pounds, which exceeds the 10,000 pound threshold for flammable mixtures. The Gas Chiller Unit and NGL Storage Vessel is therefore covered under the federal Accidental Release Prevention Program (40 CFR 68) and the California Accidental Release Prevention (CalARP) Program (19 CCR 2735 et seq.). The facility is unmanned and is operated, maintained and serviced by employees and contractors who visit the facility only periodically to perform their necessary tasks. The facility is, therefore, considered exempt from Cal/OSHA Process Safety Management (PSM) regulations.\r\nSummary of Offsite Consequence Analysis Results\r\nThe specific methodology used, dispersion modeling parameters, assumptions, and results can be found in the Hazard Assessment report. \r\n\r\nSummary of Accidental Release Prevention Program\r\n\r\nThe West Montalvo Field M4 Pool Gas Chiller Unit is only subject to the Prevention Program elements of a CalARP Program 2 as outlined below:\r\n\r\nSafety Information - This includes complete and accurate written information concerning process chemicals, process technology, safety systems, and process equipment. The process"
    },
    {
      "ESSeqNum": 3,
      "FacilityID": 1000077546,
      "SummaryText": "tation.  The M4 Pool Gas Chiller Unit utilizes the Maximo computerized maintenance management software to track, implement, and record their preventive maintenance program.\r\n\r\nCompliance Audits - Periodically CRC performs an audit of their Safety, Environmental, and Regulatory programs as required by California's Injury & Illness Prevention Program (IIPP). An audit is a technique used to gather sufficient facts and information to verify compliance with the standards. The audit includes an evaluation of the design and effectiveness of the Prevention Program and a field inspection of the safety and health conditions and practices to verify that the prevention program elements are effectively implemented.  Compliance Audits will be performed at least once every three years.\r\n\r\nIncident Investigation - A crucial part of CRC's prevention program is a thorough investigation of incidents to identify the chain of events and causes so that corrective measures can be developed and implemented. Accordingly, CRC has an incident investigation program which requires the investigation of each incident that resulted in, or could have reasonably resulted in, release of a flammable material.  CRC utilizes the TapRoot methodology to identify root causes when conducting Incident Investigations. \r\n\r\nChemical Specific Prevention Steps\r\n\r\nIn addition to implementation of the prevention elements, CRC has implemented specific safety features for the prevention, detection and control of releases of regulated (and other) substances at the M4 Pool Gas Chiller Unit.\r\nThe following are some of the control and detection equipment located in and around the facility to minimize the risk of an accident involving hazardous materials at the M4 Pool Gas Chiller Unit:\r\n¿\tRelief and/or safety valves\r\n¿\tAlarms and Automated Shutdowns\r\n¿\tSecondary containment\r\nAll applicable Safety Systems are listed as Mitigation in the Hazard Review report.\r\n\r\nFive-Year Accident History\r\n\r\nThere have been no accidental r"
    },
    {
      "ESSeqNum": 4,
      "FacilityID": 1000077546,
      "SummaryText": "eleases from the covered process that resulted in deaths, injuries, or significant property damage onsite, or known offsite deaths, injuries, evacuations, sheltering in place, property damage, or environmental damage.\r\n\r\nEmergency Response Program Summary\r\n\r\nCRC has developed written emergency response procedures to assist the employees with the reporting and safe practices to be taken in the event of a release.  Furthermore, the facility has submitted their Hazardous Materials inventories and Business Emergency Plan with the local Fire Department to provide notification to first responders.  The plan consists of procedures for notification of local emergency response agencies, evacuation plans for the M4 Pool Gas Chiller Unit and accounting for facility personnel after an evacuation.  Emergency shutdown procedures are included in the Operating Procedures for the Gas Chiller Unit that are located at the field office's Facility Technical Information (FTI) cabinet, as well as on the company's shared servers.  The procedures allow for safe shutdown or isolation of the covered process and containment of potential spills or leaks.\r\nApplication of the emergency response procedures ensures compliance with the Cal/OSHA Emergency Action Plans Standard and the emergency response element of the CalARP Prevention Program 2 requirements. \r\n\r\nPlanned Changes to Improve Safety\r\n\r\nPlanned changes to improve safety are identified during periodic audits, Incident Investigations, External Events Analysis, and the Hazard Review. Any recommendations or findings are tracked and closed utilizing an internal database."
    },
    {
      "ESSeqNum": 2,
      "FacilityID": 1000077546,
      "SummaryText": "safety information includes information pertaining to the hazards, technology and the equipment of the NGL recovery system.  This information is maintained by CRC's facilities engineering group.\r\n\r\nHazard Review - An organized and systematic effort to identify and analyze the significance of potential hazards associated with operating the Gas Chiller Unit and NGL Storage Vessel. The Process Hazard Review provides information that will assist the company and its employees in making decisions for improving safety and reducing the consequences of unwanted or unplanned spills of flammable NGLs. As part of the company's prevention program and in compliance with the 5-year update requirements, a redo of the Hazard Review has been conducted for the Gas Chiller Unit and NGL Storage Vessel on 4/8/2019 using the HAZOP and What-If/Checklist Methodologies.\r\n\r\nOperating Procedures - All procedures for operating and maintaining the M4 Pool Gas Chiller Unit are documented and accessible to employees whose work involves this system. As needed, changes or updates to the operating procedures are performed as part of the facility's management of change process.\r\n\r\nTraining - Personnel performing specific tasks which affect the Gas Chiller Unit must be qualified to perform their assigned tasks. The company has an established training program that ensures the training and competency of employees whose jobs require them to perform work which affects the Gas Chiller Unit.\r\n\r\nMaintenance - Equipment used to process, store, or handle flammable materials must be designed, constructed, installed, and maintained to minimize the release of such chemicals. As required, elements of the preventive maintenance program include identifying and categorizing equipment and instrumentation, inspections and tests and their frequency; maintenance procedures; training of maintenance personnel; criteria for acceptable test results; and documentation of manufacturer recommendations for equipment and instrumen"
    }
  ]
}